[
    {
        "url": "https://www.holyrood.com/news/view,scottish-government-must-develop-a-clear-national-strategy-for-health-and-social-care-says-audit-scotland",
        "title": "Scottish Government must develop a clear national strategy for health and social care, says Audit Scotland",
        "description": "A new report from Audit Scotland warns that “significant changes” must be made to ensure the financial sustainability"
    },
    {
        "url": "https://www.property118.com/rees-mogg-slams-goves-socialist-error-renters-reform-bill/",
        "title": "Rees-Mogg slams Gove’s ‘socialist error’ Renters (<b>Reform</b>) Bill",
        "description": "Sir Jacob Rees-Mogg criticises the housing secretary’s plans to abolish Section 21 evictions and regulate short-term lets."
    },
    {
        "url": "https://www.which.co.uk/news/article/ways-isas-are-changing-in-april-2024-a7Cqc3N7yclx",
        "title": "5 ways Isas are changing in April 2024",
        "description": "In November&#39;s Autumn Statement, the Chancellor announced several changes which will come into force from 6 April 2024: Savers will be able to open and pay into multiple Isas of the same type annually. That will replace current rules that only let you put money into one of each type of Isa every tax year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110543/JOHN-MACLEOD-Camerons-return-like-Bobby-stepping-Dallas-shower-Tories-worse-bad-dream.html",
        "title": "JOHN MACLEOD: Cameron&#39;s return was like Bobby stepping out of the Dallas shower. But for the Tories, this is worse than a bad dream",
        "description": "We had the usual excuses after Kingswood and Wellingborough. Low turnout. The mischievous role of <b>Reform</b>, splitting the centre-Right vote. And that it is perfectly normal, as Sunak indeed last week argued, for a party in government to do badly in mid-term ..."
    },
    {
        "url": "https://www.independent.co.uk/news/ap-new-orleans-police-department-new-orleans-justice-department-b2500300.html",
        "title": "11 years later, still no end to federal intervention in sight for New Orleans police",
        "description": "A federal judge says the New Orleans Police Department’s progress in complying with an 11-year-old reform agreement has “accelerated dramatically.&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110955/jeremy-hunt-plans-inheritance-tax-spring-budget-tight-public-finances.html",
        "title": "Jeremy Hunt shelves plans to cut inheritance tax again ahead of his Spring Budget due to tight public finances",
        "description": "In a blow to Tory MPs campaigning on the issue, the Chancellor has concluded tight public finances leave him unable to make meaningful changes to the tax."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/12028307/nhs-audit-scotland-scottish-government-neil-gray-crisis/",
        "title": "Scotland’s crisis-hit NHS ‘unable to meet growing demand’ of the sick and could become unaffordable, says report",
        "description": "SCOTLAND’S crisis-hit NHS is “unable to meet the growing demand” of the sick and could become unaffordable, a damning report revealed last night. Audit Scotland found waiting lists for treatment"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68365865",
        "title": "Watch: Chaos in the Commons over Gaza ceasefire vote",
        "description": "An SNP opposition day debate on a ceasefire in Gaza descended into confusion with some MPs walking out of the Commons. SNP and Tory MPs expressed their anger, after Commons Speaker Sir Lindsay Hoyle chose both the government and the Labour Party&#39;s amendments to an SNP motion, breaking with convention."
    },
    {
        "url": "https://uk.news.yahoo.com/11-years-later-still-no-232930848.html",
        "title": "11 years later, still no end to federal intervention in sight for New Orleans police",
        "description": "NEW ORLEANS (AP) — The New Orleans Police Department&#39;s progress in complying with an 11-year-old <b>reform</b> agreement has “accelerated dramatically,” a federal judge said Wednesday, but she gave no indication when she would feel comfortable relaxing ..."
    }
]