[
    {
        "url": "https://asia.nikkei.com/cms/Politics/South-Korea-s-New-Reform-Party-suffers-split-as-ex-PM-exits",
        "title": "South Korea&#39;s New <b>Reform</b> Party suffers split as ex-PM exits",
        "description": "SEOUL -- Former South Korean Prime Minister Lee Nak-yon has decided to leave a newly created political party less than two weeks after joining its ranks. The breakup comes as the April election for the National Assembly nears."
    },
    {
        "url": "https://www.thisdaylive.com/index.php/2024/02/21/what-should-we-tell-the-president",
        "title": "WHAT SHOULD WE TELL THE PRESIDENT?",
        "description": "The <b>reform</b> agenda must offer genuine support to the poor and vulnerable and provide immediate comfort and security to enable them navigate the stormy seas, writes Muhammad Sagagi There is certainly a seeming lack of policy coordination in <b>reform</b> ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/greece-becomes-worlds-first-orthodox-nation-legalise-same-sex-marriage-1723524",
        "title": "Greece Becomes World&#39;s First Orthodox Nation To Legalise Same-Sex Marriage",
        "description": "Athens parliament passed the LGBTQIA+ legislation while civilians took to the streets in celebration of the <b>reform</b>. The vote took place over two days of heated debates, with supporters of the legalisation describing the legislation as &quot;long overdue&quot; and ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/gcse-reform-is-essential-if-were-to-help-pupils-flourish-qthchxjkn",
        "title": "GCSE <b>reform</b> is essential if we’re to help pupils flourish",
        "description": "The government has rejected all the major recommendations of a cross-party House of Lords select committee report calling for a fundamental <b>reform</b> of education for 11 to 16-year-olds. The case for change, however, is overwhelming. The national curriculum ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/mordaunt-could-beat-starmer-next-election-tory-voters/",
        "title": "Only Mordaunt could beat Starmer at next election, say Tory voters",
        "description": "Leader of the Commons only candidate backed by 2019 Conservative voters to give party a better chance if she replaced Rishi Sunak"
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/21/australia-news-live-tanya-plibersek-fashion-recycling-julian-assange-wikileaks-mulch-asbestos-nsw?filterKeyEvents=true",
        "title": "Australia news live: Plibersek warns fashion industry over recycling failures; cannabis legalisation inquiry opens",
        "description": "Follow live"
    },
    {
        "url": "https://www.ft.com/content/cae5c81e-e2d0-481b-9b5e-bbb4dec6a040",
        "title": "Rishi Sunak should resist a swerve to the right",
        "description": "Bleeding support on that scale on its right flank, they say, could compound its losses in an election. They are urging Sunak to tack further to the right in cutting taxes, slowing climate goals and hardening his line on “illegal” migration,"
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-68351507?at_link_id=81C1982E-D01C-11EE-8D51-91C14B3AC5C4&at_ptr_name=twitter&at_link_origin=bbchealth&at_campaign_type=owned&at_link_type=web_link&at_bbc_team=editorial&at_format=link",
        "title": "Junior doctor strike: Swann questions merit of industrial action",
        "description": "Junior doctors in Northern Ireland have voted in favour of strike action. A 24-hour walkout by junior doctors is planned from 6 to 7 March. In a letter to the British Medical Association (BMA) on Tuesday, Mr Swann said &quot;frustration should not spill into industrial action that cannot achieve anything of substance&quot;."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/20/governments-draft-rail-reform-bill-published-fittingly-late-labour-says?ref=biztoc.com",
        "title": "Draft rail <b>reform</b> bill published ‘fittingly late’, Labour says",
        "description": "Government legislation for independent Great British Railways has little prospect of becoming law A draft bill to <b>reform</b> Britain’s railway has been published by the government – derided by Labour as “fittingly late” and with no prospect of becoming ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/some-people-said-like-turkeys-28666196",
        "title": "&#39;Some people said it was like turkeys voting for Christmas... they were right&#39;",
        "description": "Hannah, 34, said: “Some people said it was like turkeys voting for Christmas, and they were right. Me? I didn’t vote Conservative and I never will. Why people thought the Conservatives would do anything for Leigh is beyond me.”"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-minister-maria-caulfield-gives-32172000",
        "title": "Tory minister Maria Caulfield gives bizarre excuse for not handing back £8,000 pay-off",
        "description": "Tory Health Minister Maria Caulfield pocketed thousands of pounds in severance pay despite returning to the same job just seven weeks later - and she has refused to give it back"
    },
    {
        "url": "https://www.ft.com/content/9c5c46c2-2326-4ab1-91f7-71ffa2c8c108",
        "title": "Brussels signals potential end to rule of law dispute with Poland",
        "description": "Brussels has signalled it could end a years-long sanctions procedure against Poland by the summer after Donald Tusk’s government presented its plan for restoring judicial independence."
    },
    {
        "url": "https://www.thetablet.co.uk/news/18327/german-bishops-drop-synodal-committee-vote-after-vatican-warning",
        "title": "German bishops drop ‘synodal committee’ vote after Vatican warning",
        "description": "The bishops had planned to consider the <b>reform</b> at the meeting in Augsburg on 19-21 February, with the hope that the committee once established would prepare for the creation of a permanent “synodal council”. However, a letter from the Vatican published ..."
    },
    {
        "url": "https://www.railnews.co.uk/news/2024/02/20-rail-reform-bill-resurrects-franchises.html",
        "title": "Rail <b>Reform</b> Bill resurrects franchises",
        "description": "The Government has published its draft Rail Reform Bill, which would pave the way to giving legal status to the proposed ‘guiding mind’ Great British Railways. GBR is referred to as the Integrated Rail Body, and the draft echoes previous suggestions that the IRB will be in charge of awarding and monitoring National Rail Contracts."
    },
    {
        "url": "https://www.echo-news.co.uk/news/national/24131878.draft-bill-sets-plans-major-rail-reform/",
        "title": "Draft Bill sets out plans for major rail <b>reform</b>",
        "description": "Attempts to improve punctuality and simplify ticketing are among other measures set out by ministers in the draft Rail <b>Reform</b> Bill. It is unlikely the legislation will make it on to the statute books before the next general election. Transport Secretary ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/esports-entertainment-group-announces-voluntary-180000396.html",
        "title": "Esports Entertainment Group Announces Update to Voluntary Delisting from the Nasdaq",
        "description": "Forward-Looking Statements The information contained herein includes forward-looking statements, as defined in the Private Securities Litigation <b>Reform</b> Act of 1995. Forward-looking statements generally can be identified by words such as “anticipates ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/government-publishes-draft-bill-create-28670756",
        "title": "Government publishes draft Bill to create Great British Railways public body and overhaul rail services",
        "description": "The UK Government has unveiled extensive plans to <b>reform</b> Britain&#39;s railways. These proposals, detailed in a draft Bill, suggest forming a new public entity called Great British Railways (GBR). This body would manage rail infrastructure and oversee railway ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/third-mps-trying-delay-new-28672009",
        "title": "Third of MPs trying to delay new tenant protection bill are landlords",
        "description": "Tom Darling, the campaign manager of the Renters’ <b>Reform</b> Coalition, said: “Those making money out of our broken housing system should not be holding up and watering down reforms to give renters more rights. “That these landlord MPs are now choosing ..."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-20/commissioners-overseeing-troubled-fire-service-have-full-support-says-minister",
        "title": "Minister overseeing troubled South Wales fire service says commissioners have &#39;full support&#39;",
        "description": "Hannah Blythyn announced the appointment of four commissioners on 6 February after a &#39;damning&#39; independent report exposed a culture of sexism and misogyny. | ITV News Wales"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mark-harper-government-grant-shapps-british-rail-b1140335.html",
        "title": "Draft Bill sets out plans for major rail <b>reform</b>",
        "description": "Attempts to improve punctuality and simplify ticketing are among other measures set out by ministers in the draft Rail <b>Reform</b> Bill. This draft Bill demonstrates our commitment to reforming the railways Mark Harper, Transport Secretary It is unlikely the ..."
    }
]