[
    {
        "url": "https://www.mirror.co.uk/news/health/huge-majority-uks-dentists-think-32090957",
        "title": "Huge majority of UK&#39;s dentists think Rishi Sunak&#39;s Conservatives are harming the NHS",
        "description": "A pair of surveys questioning more than 3,000 dentists across the UK revealed that two-thirds of them now plan to go private – and a whopping 90% think Rishi Sunak&#39;s Conservative government is to blam"
    },
    {
        "url": "https://www.huffpost.com/entry/border-deal-immigration-reform-republicans_n_65c55c39e4b093b2e782f2d0?ncid=engmodushpmg00000003",
        "title": "A Brief History Of Republicans Walking Away From Bipartisan Immigration Deals",
        "description": "Lawmakers reached bipartisan agreements on immigration in 2006, 2013 and 2018, pairing pathways to citizenship for undocumented immigrants ― the thing Democrats wanted ― with border security for Republicans. Each time, Republicans walked away decrying “amnesty” for people who had entered the country illegally."
    },
    {
        "url": "https://www.racingpost.com/news/britain/talks-between-racing-and-betting-set-to-continue-with-both-parties-locked-in-stalemate-over-levy-reform-a9LTt6v9lVck/",
        "title": "Talks between racing and betting set to continue with both parties locked in stalemate over levy <b>reform</b>",
        "description": "Racing&#39;s leadership has called for the levy to be reformed and extended to all betting on racing by British punters to help bridge the gap. Talks between racing&#39;s representatives and the BGC have not progressed, however, and there is only a matter of weeks before the deadline for a decision in late April."
    },
    {
        "url": "https://www.racingpost.com/news/britain/government-support-needed-on-affordability-checks-and-levy-reform-to-retain-licence-holders-says-trainers-body-ahbHh2R7vmym/",
        "title": "Government support needed on affordability checks and levy <b>reform</b> to retain licence holders says trainers&#39; body",
        "description": "NTF chief executive Paul Johnson said: “We are always concerned when we see trainers deciding to hand in their licences. Often this is motivated by either financial pressures or a lack of staff and it is one of the roles of the NTF to work to bring about improvements in both areas."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865169/Boris-Johnson-campaign-comeback-would-win-us-the-next-election-Tories-say",
        "title": "Boris Johnson campaign comeback would &#39;win us the next election&#39; Tories say",
        "description": "Andrew Griffith became the first member of the government to support a comeback, saying &quot;Boris is a great voice&quot;."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/rishi-sunak-latest-news-labour-green-pledge-starmer-live/",
        "title": "Politics latest news: Labour in fresh green U-turn over windfall tax",
        "description": "Rachel Reeves insisted she will still be the UK’s “first green chancellor” despite tearing up Labour’s flagship £28 billion investment pledge. Ms Reeves originally made the statement during her speech at Labour Party conference in 2021."
    },
    {
        "url": "https://www.edp24.co.uk/news/24108668.labour-partys-alice-macdonald-planning-reform-norwich/",
        "title": "Labour Party&#39;s Alice Macdonald on planning <b>reform</b> in Norwich",
        "description": "Labour candidate for Norwich North, Alice Macdonald, wants councils to get more planning powers after the collapse of the revamp of Anglia Square."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066175/Pensioners-abandon-Tories-just-quarter-65s-planning-vote-Conservative-Reform-Labour.html",
        "title": "Pensioners abandon the Tories with just a quarter of over-65s planning to vote Conservative at the next election - down from 60% in 2019 - with a surge in support for <b>Reform</b> ...",
        "description": "Just 26 per cent of over-65s say they plan to vote for the Tories at the next election, down from an estimated 60 per cent who backed the party under Boris Johnson at the 2019 election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/rishi-sunak-latest-news-labour-green-pledge-starmer-live/?utmsource=email",
        "title": "Politics latest news: Nigel Farage suggests West should be open to negotiations with Putin",
        "description": "The founder of <b>Reform</b> UK said he was “shocked” by the “absolute reluctance” to consider negotiations with Russia since Moscow launched its invasion of Ukraine in February 2022. It comes after Putin accused Boris Johnson of sabotaging a peace deal ..."
    },
    {
        "url": "https://www.investmentweek.co.uk/news/4172317/global-investors-warn-fcas-listings-reform-regress-shareholder-protections",
        "title": "Global investors warn FCA&#39;s listings <b>reform</b> will regress shareholder protections",
        "description": "Global investors representing $77trn of global assets under management have issued a warning against the Financial Conduct Authority&#39;s proposed UK listings regime reforms."
    },
    {
        "url": "https://www.mortgagesolutions.co.uk/news/2024/02/09/calls-for-uk-regulator-reform/",
        "title": "Calls for UK regulator <b>reform</b>",
        "description": "The Industry and Regulators Committee has raised significant concerns over the role of UK regulators, their ability to operate with genuine independence from government, and how they are held to account. In its report, Who watches the watchdogs? Improving ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-mp-laura-trott-skewered-32082113.amp",
        "title": "Tory MP Laura Trott skewered over party&#39;s U-turns in excruciating 60-second take down",
        "description": "That&#39;s been abandoned. “There was going to be social care <b>reform</b> that&#39;s gone, HS2 that&#39;s gone. The electric car mandate 2030, now 2035. Immigration <b>reform</b> that was introduced by your government. It&#39;s been reformed by your government. One of the reforms ..."
    }
]