[
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/08/australia-politics-live-png-prime-minister-marape-parliament-question-time-anthony-albanese-peter-dutton-stage-three-tax-cuts-ir-law-right-to-disconnect?page=with:block-65c3eb268f08b8fa87cc7c61&filterKeyEvents=false",
        "title": "Australia politics live: Littleproud claims IR laws pose ‘biosecurity risk’ to farmers, backs reforms to end price-gouging",
        "description": "Follow live"
    },
    {
        "url": "https://www.telegraph.co.uk/football/2024/02/07/premier-league-var-overhaul-fan-experience-mistakes-pgmol/",
        "title": "Premier League pushes for VAR overhaul – here is how it can be improved",
        "description": "Premier League admit experience is &#39;poor&#39; for match-going fans but there remains scepticism over semi-automated offside technology"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-sunak-trans-joke-brianna-ghey-2895221",
        "title": "Brianna Ghey’s father calls on Sunak to apologise for ‘degrading’ trans ‘joke’",
        "description": "Peter Spooner is &#39;disgusted&#39; with the PM&#39;s &#39;absolutely dehumanising&#39; comment as Tory MPs complain to whips and PM refuses to apologise"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24105085.multi-billion-north-east-devolution-deal-laid-parliament/",
        "title": "Multi-billion North East devolution deal laid in Parliament",
        "description": "Legislation to establish a new North East mayor and ratify a multi-billion pound devolution deal has been laid in Parliament."
    },
    {
        "url": "https://uk.news.yahoo.com/slovaks-protest-criminal-law-reform-170952020.html",
        "title": "Slovaks protest criminal law <b>reform</b> as key vote looms",
        "description": "Thousands of Slovaks protested on Wednesday in the latest of a string of rallies against plans by Prime Minister Robert Fico&#39;s government to lower punishments for corruption and scrap a prosecution office that probes high-profile crimes."
    },
    {
        "url": "https://www.mortgagesolutions.co.uk/news/2024/02/07/mps-sign-early-day-motion-to-back-mortgage-prisoner-campaign/",
        "title": "MPs sign early day motion to back Mortgage Prisoner campaign",
        "description": "An early day motion has been signed by 11 MPs to acknowledge a campaign from the UK Mortgage Prisoners to reform mortgage regulations."
    },
    {
        "url": "https://www.landlordzone.co.uk/news/calls-for-reforms-to-epcs-to-help-decarbonise-uk-homes",
        "title": "Calls for reforms to EPCs to help decarbonise UK homes",
        "description": "EPCs as they stand have been slammed by MPs and property experts alike. But Energy Performance Certificates are still seen as a powerful means of tackling inefficient buildings in the UK, so there is a growing recognition that reform is needed."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/important-milestone-historic-north-east-28587678",
        "title": "&#39;Important milestone&#39; as historic North East devolution deal legislation laid in Parliament",
        "description": "Passage through Parliament is the long-awaited final hurdle in a years-long negotiation process over the historic devolution deal for Tyne and Wear, Northumberland, and County Durham"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864161/wellingborough-by-election-reform-win-odds",
        "title": "Odds of <b>Reform</b> UK pulling off shock by-election victory slashed with Tory voters on strike",
        "description": "Speculation is mounting that <b>Reform</b> UK could cause &quot;a political earthquake&quot; in next week&#39;s Wellingborough by-election after bookmakers suddenly slashed the odds of the party&#39;s candidate Ben Habib. Mr Habib entered the race at a distant third favourite of ..."
    },
    {
        "url": "https://www.express.co.uk/news/world/1864157/geert-wilders-coalition-talks-the-netherlands-government",
        "title": "Dutch far-right leader in trouble as coalition talks collapse-but party&#39;s popularity soars",
        "description": "Despite his views of Brussels, he said he doesn&#39;t intend for the Netherlands to leave the bloc but, rather, to <b>reform</b> it and shape it from within."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/07/cut-benefits-instead-relying-migration-bring-down-debt-obr/",
        "title": "Cut benefits instead of relying on migration to bring down debt, says OBR chief",
        "description": "Much of the increase in the latter half of the decade is thought likely to be driven by spending on “health and disability benefits, reflecting rising caseloads” and spending on pensioners. The OBR also projects that spending on health and disability benefits for people of working age will rise from £60bn this year to just over £77bn in 2028."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/cops-still-dock-year-after-32068339",
        "title": "Cops &#39;still in dock&#39; year after David Carrick sentencing as Met told <b>reform</b> not working",
        "description": "In the year since serial rapist Metropolitan Police constable David Carrick was jailed for 30 years, more force members have been convicted, prompting one ex-officer to speak out"
    },
    {
        "url": "https://www.investing.com/news/economy/argentinas-milei-weighs-next-steps-after-economic-reform-bill-setback-3295975/",
        "title": "Argentina&#39;s Milei weighs next steps after economic <b>reform</b> bill setback",
        "description": "BUENOS AIRES (Reuters) -The government of Argentine President Javier Milei was seeking to salvage his wide-ranging economic reform package on Wednesday after Congress delivered a major blow a day earlier, casting doubt over its future and triggering a fall in financial markets."
    },
    {
        "url": "https://www.mortgagesolutions.co.uk/news/2024/02/07/trade-bodies-call-for-lisa-and-htb-isa-reform-to-help-first-time-buyers/",
        "title": "Trade bodies call for LISA and HTB ISA <b>reform</b> to help first-time buyers",
        "description": "The BSA and TISA want a cut in withdrawal penalties and change in price thresholds for LISAs and HTB ISAs to aid first-time buyers."
    },
    {
        "url": "https://www.thenational.scot/news/24104162.nigel-farage-house-lords-conservative-minister-says/",
        "title": "Nigel Farage should be in House of Lords, Conservative minister says",
        "description": "A UK Government minister has called for Nigel Farage to be given a seat in the House of Lords. Esther McVey, a Cabinet Office minister labelled the “minister for common sense”, said that the Reform UK founder should be given a peerage as he is “one of the country’s greatest campaigners”."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864161/wellingborough-by-election-reform-win-odds?ruid=db151208-24e4-44ee-b518-e99f971bf4dc",
        "title": "Odds of <b>Reform</b> UK pulling off shock by-election victory slashed with Tory voters on strike",
        "description": "EXCLUSIVE: Political attention has fallen on the Wellingborough by-election where bookmakers are predicting a shock result could rock Rishi Sunak&#39;s government."
    },
    {
        "url": "https://www.recruiter.co.uk/news/2024/02/appg-launches-highlight-flexible-family-friendly-working",
        "title": "APPG launches to highlight flexible family-friendly working",
        "description": "A Flexible and Family-Friendly Working All-Party Parliamentary Group (APPG) was launched in the House of Commons yesterday [6 February 2024]. The APPG will focus on championing flexible working policies that support families across the country to remove the barriers that people with caring responsibilities face in the workplace."
    },
    {
        "url": "https://www.england.nhs.uk/publication/our-plan-to-recover-and-reform-nhs-dentistry/",
        "title": "Faster, simpler and fairer: our plan to recover and <b>reform</b> NHS dentistry",
        "description": "We’ve put some small files called cookies on your device to make our site work. We’d also like to use analytics cookies. These send information about how our site is used to a service called Google Analytics. We use this information to improve our site."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24103854.lobbyists-back-reform-halt-never-ending-string-scandals/",
        "title": "Lobbyists back <b>reform</b> to halt ‘never-ending string of scandals’",
        "description": "The body pointed to scandals such as the Greensill affair, in which the now Foreign Secretary Lord Cameron was found to have been lobbying for disgraced financier Lex Greensill, and recent allegations that Conservative MP Scott Benton had breached Commons rules on lobbying as evidence that current regulation was not fit for purpose."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/george-galloway-labour-rochdale-tony-lloyd-gaza-b2492092.html",
        "title": "Gaza, Galloway and grooming – Labour launches campaign to hold Rochdale seat",
        "description": "Also running is political firebrand George Galloway, of the Workers Party of Britain, who is campaigning against Labour’s stance on the conflict in Gaza, and former Rochdale Labour MP Simon Danczuk, now the <b>Reform</b> Party candidate. Around 20% of the ..."
    }
]