[
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-nhs-prime-minister-rwanda-labour-b2495025.html",
        "title": "I understand voters’ frustrations, Sunak says in live TV grilling",
        "description": "As peers in the House of Lords debated draft legislation aimed at sending asylum seekers to Kigali, one voter asked Mr Sunak why he was “so adamant” about the Rwanda policy “when public documentation shows it isn’t working and that it’s not going to work”."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865966/keir-starmer-labour-party-rochdale-by-election",
        "title": "Keir Starmer finally cuts ties with Labour by-election candidate after fresh row explodes",
        "description": "Keir Starmer had faced accusations he was protecting a &quot;racist crank&quot; after his party rallied round MP hopeful Azhar Ali."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865963/tories-bring-back-boris-johnson-uk-general-election",
        "title": "Tories urged to bring Boris Johnson back for &#39;game-changing&#39; general election campaign",
        "description": "Ahead of what Tory MPs are dubbing &quot;apocalypse week&quot; for the party, Rishi Sunak has been warned he needs to bring back Boris Johnson or lose catastrophically."
    },
    {
        "url": "https://www.heraldscotland.com/news/24115207.scottish-government-evading-scrutiny-freedom-information/",
        "title": "The Scottish Government, &#39;evading scrutiny&#39; and Freedom of Information",
        "description": "The Scottish Government has found itself tied in knots once again over transparency – but should we be surprised at politicians not being as"
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-government-rotten-culture-of-secrecy-slammed",
        "title": "Scottish government&#39;s ‘rotten culture of secrecy’ slammed",
        "description": "SCOTTISH LABOUR hit out at a “rotten culture of secrecy” today after it was revealed that the Scottish government honours less than a third of freedom of information (FoI) requests in full and on time."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13074859/Tories-slump-lowest-poll-rating-Rishi-PM-Labour-lead-surging-25-points-start-one-Sunaks-worst-weeks-No10.html",
        "title": "Tories slump to their lowest poll rating with Rishi as PM with Labour lead surging to 25 points at start of what could be one of Sunak&#39;s worst weeks in No10",
        "description": "The latest Redfield &amp; Wilton Strategies survey showed the Conservatives on just 21 per cent support among voters, which is down three points since last week."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/304918/alliance-calls-for-urgent-delivery-of-early-learning-and-childcare-strategy",
        "title": "Alliance Calls For Urgent Delivery Of Early Learning And Childcare Strategy",
        "description": "12 February 2024 Alliance Calls For Urgent Delivery Of Early Learning And Childcare Strategy The Alliance Party has called on the Minister of Education, Paul Givan, to urgently bring forward a timeline for delivery on the Early Learning and Childcare Strategy."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24113053.unfair-draw-wider-conclusions-candidates-israel-claims-shadow-minister/",
        "title": "Unfair to draw wider conclusions from candidate’s Israel claims: shadow minister",
        "description": "A shadow minister has insisted it would be “unfair” to conclude there is a problem with Labour in Rochdale amid criticism of remarks about Israel made by the party’s constituency candidate."
    }
]