[
    {
        "url": "https://news.sky.com/story/popcons-seek-to-rally-tory-base-as-they-look-to-a-post-election-future-13065575",
        "title": "PopCons seek to rally Tory base as they look to a post-election future",
        "description": "Liz Truss may have been ousted from Number 10 after just 49 days. But she has support from certain Conservative MPs for her ideas to live on."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-polling-london-mayoral-election-susan-hall-mayor-labour-conservative-polls-b1137514.html",
        "title": "London mayoral election: Sadiq Khan says he does not believe polls giving him 20 point lead over Susan Hall",
        "description": "The mayor pointed to the twin shocks in 2016 of the Brexit campaign and Donald Trump seizing victory as examples of polls misjudging electorates"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-block-labours-bid-scrap-32062701",
        "title": "Tories block Labour&#39;s bid to scrap severance pay-offs for ministers who quit in disgrace",
        "description": "Labour sought to reform the rules after it emerged last month nearly £1million was paid out during the ministerial churn of Boris Johnson and Liz Truss&#39;s chaotic governments"
    },
    {
        "url": "https://www.northern-times.co.uk/news/jamie-halcro-johnston-snps-nearly-80-million-in-cuts-will-341491/",
        "title": "Jamie Halcro Johnston: SNP&#39;s nearly £80 million in cuts will hit rural Scotland hard",
        "description": "He says &#39;decisions by SNP and Green ministers in Edinburgh that will have a real impact on life here in the Highlands.&#39;"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/government-to-review-ministers-severance-payouts-but-rejects-immediate-reform-99463/",
        "title": "Government to review ministers’ severance payouts but rejects immediate <b>reform</b>",
        "description": "The Government has said it will consider reviewing the rules for taxpayer-funded ministerial severance pay, but rejected calls for immediate <b>reform</b>. Cabinet Office minister Esther McVey said the principle of making “reasonable” payments “remains ..."
    },
    {
        "url": "https://inews.co.uk/news/jeremy-hunt-stamp-duty-housing-crisis-2892905?ico=more_from_this_author",
        "title": "If Jeremy Hunt made simple tweaks to stamp duty, he could fix the housing crisis",
        "description": "Let’s talk about taxes! Specifically Stamp Duty Land Tax – more commonly known as stamp duty – and how with just a few tweaks, experts argue <b>reform</b> could lead to a more equitable housing market. Nobody enjoys paying taxes. Not really. Which is why ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68217579.amp",
        "title": "South Wales fire service taken over after sexual harassment probe",
        "description": "Ms Blythyn, deputy minister for social partnership, said the commissioners would be able to restructure and <b>reform</b> its management to ensure a &quot;wholesale change in processes, values and culture&quot;. Her move was welcomed by Welsh Women&#39;s Aid Last month ..."
    },
    {
        "url": "https://uk.news.yahoo.com/opposing-ukraine-aid-bill-playing-190348606.html",
        "title": "Opposing Ukraine aid bill is playing into Putin&#39;s hands: Biden",
        "description": "The demand that military aid for Ukraine be tied to immigration <b>reform</b> came from Republicans in the first place, with Trump keen to equate the crisis at the border with chaos abroad that he repeatedly claims he would have averted. But Trump has appeared ..."
    },
    {
        "url": "https://www.ft.com/content/23285980-1ed4-43e9-b886-7a0c90ffea54",
        "title": "Italy’s parliament approves controversial company board reforms",
        "description": "The measures were an eleventh-hour addition by the rightwing government in Rome to a wider, long-awaited bill designed to <b>reform</b> the country’s capital markets. The bill, which has been in the works for three years, is seen as a way of helping attract ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/12008815.onus-of-implementation-falls-on-new-parliament/",
        "title": "Onus of implementation falls on new Parliament",
        "description": "THE Scottish Parliament will be asked to implement a programme of land reform which will give unprecedented protection to the interests of"
    },
    {
        "url": "https://www.heraldscotland.com/news/12009876.measures-propose-end-to-practice-of-rural-communities-literally-having-land-sold-out-from-under-them-wide-support-for-reforms/",
        "title": "Measures propose end to practice of rural communities literally having land sold out from under them Wide support for reforms",
        "description": "Highland Correspondent David Ross and Chris Holme gauge reaction to the proposals to change land ownership in Scotland"
    },
    {
        "url": "https://www.4barsrest.com/articles/2023/2045.asp",
        "title": "That thorny topic of trust",
        "description": "Brass band writer Christopher Thomas adds his thoughts on adjudication trust and integrity and how he believes we all have a part to play in its reform and modernisation."
    },
    {
        "url": "https://www.lbc.co.uk/news/by-election-tripping-point-tory-disaster-nadine-dorries/",
        "title": "Tories losing next week&#39;s by-election will be &#39;tipping point&#39; for &#39;seismic&#39; election defeat, Nadine Dorries tells LBC",
        "description": "The Tories losing next week&#39;s by-election in Wellingborough will act as a &#39;tipping point&#39; before the party faces a &#39;seismic&#39; electoral wipeout, Nadine Dorries has told LBC."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1863825/esther-rantzen-assisted-dying-huge-victory",
        "title": "Dame Esther Rantzen hails &#39;undeniable proof&#39; Brits back assisted dying after huge victory",
        "description": "Since revealing she had signed up to Swiss suicide clinic Dignitas, Dame Esther has been inundated with messages from tens of thousands of people, some who lost sick loved ones in unimaginably cruel ways and others who, like her, simply want the right to end their lives as they see fit."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68076729?at_medium=RSS&",
        "title": "Wellingborough by-election: Who will make a splash?",
        "description": "Ben Habib (left) and <b>Reform</b> UK&#39;s leader Richard Tice launched their campaign in Wellingborough Wellingborough voted 62.4% in favour of Brexit in the 2016 EU referendum. Ben Habib, <b>Reform</b> UK&#39;s candidate, said this could give the party, which was formerly ..."
    },
    {
        "url": "https://www.ft.com/content/dbbd9998-b530-46de-a9d9-08a0bf3591ed",
        "title": "Among US conservatives, the dial is finally shifting on welfare",
        "description": "“Welfare <b>reform</b>” in 1996 ended these perverse incentives and many conservatives consider it the era’s signal policy achievement. What to make, then, of a policy that provides resources to lower-income households, but does so only if they are working ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13047901/Outrage-Warwickshire-councillors-call-return-ways-past-disabled-children-institutions-dealt-means-suggest-children-ADHD-need-strict-correction.html",
        "title": "Outrage as Warwickshire councillors call for a &#39;return to the ways of the past&#39; when disabled children were put in institutions and &#39;dealt with by whatever means&#39; - and suggest ...",
        "description": "It was right at the time.&#39; The recording was shared by organisation SEND (Special Educational Needs and Disabilities) <b>Reform</b> England on Monday morning and has now been viewed hundreds of thousands of times online as outrage grows. Warwickshire County ..."
    },
    {
        "url": "https://news.sky.com/story/nigel-farage-conservatives-facing-extinction-event-and-hes-aiming-to-replace-them-13065400",
        "title": "Nigel Farage: Conservatives facing &#39;extinction event&#39; and he&#39;s aiming to replace them",
        "description": "The Reform Party politician spoke at the Conservatives&#39; PopCon event about what he thinks will happen after the next election and ruled out joining the Tories. Sir Jacob Rees-Mogg, meanwhile, described his party as the &quot;Duracell bunny of political life&quot;."
    },
    {
        "url": "https://inews.co.uk/news/jeremy-hunt-stamp-duty-housing-crisis-2892905?ico=most_popular",
        "title": "If Jeremy Hunt made simple tweaks to stamp duty, he could fix the housing crisis",
        "description": "As the Institute for Fiscal Studies (IFS) have noted, stamp duty not only disincentivises but penalises those who have larger homes selling up to downsize while also preventing those who need to upsize doing so because it increases the amount of cash they need up front."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/esther-mcvey-labour-emily-thornberry-liz-truss-government-b2491649.html",
        "title": "Government to review ministers’ severance payouts but rejects immediate <b>reform</b>",
        "description": "Cabinet Office minister Esther McVey said the principle of making “reasonable” payments “remains sound” given ministers can be removed at any time, telling MPs: “The Government doesn’t currently intend to reform severance pay for departing ministers, although I am happy to review it.”"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/government-to-review-ministers-severance-payouts-but-rejects-immediate-reform-109945/",
        "title": "Government to review ministers’ severance payouts but rejects immediate <b>reform</b>",
        "description": "Cabinet Office minister Esther McVey said the principle of making “reasonable” payments “remains sound” given ministers can be removed at any time, telling MPs: “The Government doesn’t currently intend to reform severance pay for departing ministers, although I am happy to review it.”"
    },
    {
        "url": "https://inews.co.uk/news/jeremy-hunt-stamp-duty-housing-crisis-2892905?ITO=msn",
        "title": "If Jeremy Hunt made simple tweaks to stamp duty, he could fix the housing crisis",
        "description": "Let’s talk about taxes! Specifically Stamp Duty Land Tax – more commonly known as stamp duty – and how with just a few tweaks, experts argue <b>reform</b> could lead to a more equitable housing market. Nobody enjoys paying taxes. Not really. Which is why ..."
    },
    {
        "url": "https://uk.news.yahoo.com/nigel-farage-conservatives-facing-extinction-143100338.html",
        "title": "Nigel Farage: Conservatives facing &#39;extinction event&#39; and he&#39;s aiming to replace them",
        "description": "Nigel Farage believes it&#39;s possible to replace the Conservative Party with his own <b>Reform</b> Party as he predicts an &quot;extinction event&quot; for the government at the next election. Mr Farage was speaking to Sky News political editor Beth Rigby at the launch of ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/jacob-reesmogg-lee-anderson-government-tories-mps-b2491433.html",
        "title": "Truss warns of ‘left-wing extremists’ as she seeks to galvanise ‘secret Tories’",
        "description": "The arch-Brexiteer and <b>Reform</b> UK founder said the group represents “a very small minority within the parliamentary Conservative Party”, which is now “so far away from the centre of gravity of most Conservative voters, it is almost untrue”."
    }
]