[
    {
        "url": "https://news.yahoo.com/georgia-could-require-cash-bail-235716430.html",
        "title": "Georgia could require cash bail for 30 more crimes, including many misdemeanors",
        "description": "Georgia, once a self-proclaimed leader in criminal justice reform, is sliding a little further toward its old lock-&#39;em-up ways. State senators voted 30-17 on Thursday to require cash bail for 30 additional crimes,"
    },
    {
        "url": "https://www.bbc.com/news/topics/cj1g47k231yt?page=2",
        "title": "Argentina economy",
        "description": "Argentina is divided over the new president&#39;s plans for its troubled economy. A court has suspended labour reforms brought in by newly elected Argentine president, Javier Milei. It had been due in a few days to join the group, seen as a counterweight to the Western-led world."
    },
    {
        "url": "https://www.prnewswire.co.uk/news-releases/biovaxys-announces-completion-of-first-tranche-of-private-placement-302051347.html",
        "title": "BIOVAXYS ANNOUNCES COMPLETION OF FIRST TRANCHE OF PRIVATE PLACEMENT",
        "description": "BioVaxys Technology Corp. (CSE: BIOV) (FRA: 5LB) (OTCQB: BVAXF) (&quot;BioVaxys&quot; or the &quot;Company&quot;) announces that it has completed the first"
    },
    {
        "url": "https://inews.co.uk/news/politics/simon-danczuk-rochdale-by-election-2884557",
        "title": "Ex-Labour MP who sent explicit texts to teen girl to stand as <b>Reform</b> candidate",
        "description": "Simon Danczuk, who was suspended for “inappropriate” behaviour towards the 17-year-old student, is the “right candidate” to tackle Rochdale’s grooming gangs, according to leader Richard Tice"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/former-rochdale-mp-simon-danczuk-28554289",
        "title": "Former Rochdale MP Simon Danczuk is standing in a by-election for his old seat",
        "description": "Former Rochdale MP Simon Danczuk has announced he is seeking to reclaim his old seat in Parliament. The ex-Labour MP will represent Reform UK - the party founded by former UKIP leader Nigel Farage - at the Rochdale by-election later this month."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/former-labour-mp-simon-danczuk-32025626",
        "title": "Former Labour MP Simon Danczuk switches to Nigel Farage&#39;s <b>Reform</b> for Rochdale byelection",
        "description": "Former Labour MP Simon Danczuk, who was blocked from running for Labour in 2017 after an explicit texting scandal, is standing as the candidate for Nigel Farage&#39;s Reform Party"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/01/when-senate-vote-mexico-border-ukraine-aid",
        "title": "Senate to vote next week on bipartisan border bill, Schumer says",
        "description": "Top Senate Democrat gives timetable for vote on border security bill tied to Ukraine aid as Trump urges lawmakers to reject deal"
    },
    {
        "url": "https://www.ft.com/content/6660f1ec-ff38-4904-9cf6-f99f1d61d2c9",
        "title": "<b>Reform</b> UK accepted donations from Crispin Odey despite sexual assault allegations",
        "description": "The right-wing party Reform UK accepted a political donation from disgraced financier Crispin Odey two months after he was accused of sexual misconduct."
    },
    {
        "url": "https://edition.cnn.com/videos/politics/2024/02/01/dan-crenshaw-potential-border-reform-bill-sot-raju-ip-vpx.cnn",
        "title": "‘Height of stupidity’: Dan Crenshaw calls out GOP lawmakers on border <b>reform</b> bill",
        "description": "Rep. Dan Crenshaw (R-TX) criticized lawmakers in his own party for trying to ‘torpedo’ a potential border reform bill. CNN’s Manu Raju reports."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/dark-day-politics-mp-mike-freer-constituents-shock-decision-to-quit",
        "title": "‘Dark day for politics’: MP Mike Freer’s constituents’ shock at decision to quit",
        "description": "Justice minister Mike Freer is stepping down as MP for Finchley and Golders Green after death threats, abuse and intimidation"
    },
    {
        "url": "https://feweek.co.uk/alternative-provision-in-desperate-need-of-reform-damning-ofsted-and-cqc-report-says/",
        "title": "Alternative provision in ‘desperate need of <b>reform</b>’, damning Ofsted and CQC report says",
        "description": "Alternative provision in England is in “desperate need of reform” amid “systemic issues” that lead to “inconsistent outcomes” for young people, two watchdogs have said in a critical report today."
    },
    {
        "url": "https://www.halesowennews.co.uk/news/24091699.stourbridge-train-stations-pilot-tap-tap-payments/",
        "title": "Old Hill and Rowley Regis stations to get contactless tech",
        "description": "STOURBRIDGE Junction and Town stations are among railway stations across the region to be fitted with new tap-in and tap-out technology to"
    },
    {
        "url": "https://www.investing.com/news/economy/imf-backs-mileis-reforms-says-risks-to-argentinas-44-billion-program-remain-3290359",
        "title": "IMF backs Milei&#39;s reforms, says risks to Argentina&#39;s $44 billion program remain",
        "description": "The International Monetary Fund said Argentina is committed to accumulating international reserves and stemming a central bank financing of government debt under the latest review of its $44 billion loan program,"
    },
    {
        "url": "https://edition.cnn.com/2024/02/01/americas/milei-reforms-argentina-agriculture-workers-mate-intl/index.html",
        "title": "‘I don’t know how I will eat.’ For the workers behind Argentina’s national drink, Milei’s reforms are turning sour",
        "description": "Six months a year, she harvests yerba, the leaves of a native South American shrub that are the basis of Argentina’s national beverage, mate. Few other drinks permeate the Argentinian way of life as does mate,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/northern-ireland-dup-stormont-irish-sea-government-b1136466.html",
        "title": "DUP tensions over Stormont deal exposed as peer says sea border concerns remain",
        "description": "Former deputy leader of the DUP Lord Dodds of Duncairn suggested there was a divergence of views within the party."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/24091480.committee-says-major-reforms-council-funding-needed/",
        "title": "Committee says major reforms into Council funding are needed",
        "description": "THE Government needs to make major reforms to how local councils are funded to prevent authorities from facing financial collapse. These are the findings of a cross-party committee of MPs, who say a £4 billion funding gap needs to be plugged to prevent councils across the country from going bankrupt."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155026/rochdale-byelection-former-labour-mp-simon-danczuk-bids-to-become-rochdales-first-reform-mp",
        "title": "Rochdale by-election: former Labour MP Simon Danczuk bids to become Rochdale&#39;s first <b>Reform</b> MP",
        "description": "Former Rochdale MP Simon Danczuk is trying his hand at becoming the town’s MP again, by standing for Reform UK."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13034479/Sexting-shame-MP-Simon-Danczuk-exited-Commons-amid-explicit-messages-scandal-plots-return-Parliament-Reform-UKs-candidate-Rochdale-election.html",
        "title": "Sexting shame MP Simon Danczuk - who exited the Commons amid an explicit messages scandal - plots return to Parliament as <b>Reform</b> UK&#39;s candidate at Rochdale by-election",
        "description": "The 57-year-old is hoping to be re-elected to the seat he held for Labour between 2010 and 2017 when local voters go to the polls at the end of this month."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/could-local-councils-in-england-really-go-bust_uk_65bbaa38e4b0102bd2d82477",
        "title": "Could Local Councils In England Really Go Bankrupt? Here&#39;s What You Need To Know`",
        "description": "MPs have warned that severe government underfunding poses a severe risk to local councils in England. A cross-party committee estimates that there is a £4bn funding gap for the 2024-25 – and suggested councils could go “bust” as a result."
    },
    {
        "url": "https://www.dudleynews.co.uk/news/24091681.stourbridge-train-stations-pilot-tap-tap-payments/",
        "title": "Dudley railway stations to pilot tap in tap out payments",
        "description": "STOURBRIDGE Junction and Town stations are among railway stations across the region to be fitted with new tap-in and tap-out technology to"
    },
    {
        "url": "https://www.stourbridgenews.co.uk/news/24091679.stourbridge-train-stations-pilot-tap-tap-payments/",
        "title": "Stourbridge train stations to pilot tap in tap out payments",
        "description": "STOURBRIDGE Junction and Town stations are among railway stations across the region to be fitted with new tap-in and tap-out technology to"
    },
    {
        "url": "https://www.heraldscotland.com/news/24090708.fmqs-dont-cut-budget-new-belford-hospital-can-built/?ref=rss",
        "title": "FMQs: &#39;Don&#39;t cut budget so new Belford Hospital can be built&#39;",
        "description": "Humza Yousaf has urged UK ministers not to impose a cut to Scotland&#39;s capital Budget to allow the building of a new hospital in Fort William as"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033977/Alarm-bells-Rishi-Sunak-poll-Reform-UK-new-high.html",
        "title": "Alarm bells for Rishi Sunak as poll shows <b>Reform</b> UK hitting new high of 14% support in the Red Wall - and a FIFTH of 2019 Tory voters are backing the Nigel Farage-founded party",
        "description": "Research by Redfield &amp; Wilton Strategies suggested the Nigel Farage-founded party is picking up significant support in the crucial election battleground."
    },
    {
        "url": "https://uk.news.yahoo.com/bradford-referenced-major-report-councils-170000874.html",
        "title": "Bradford referenced in major report on how councils are funded",
        "description": "Funding model for local councils broken&#39; The committee is made up of both Conservative and Labour MPs, and Clive Betts, Labour chair of the committee said: “Long-term <b>reform</b> is vitally needed. “The funding model for local councils is broken.”"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/ex-mp-simon-danczuk-suspended-for-sexting-to-fight-byelection-for-reform",
        "title": "Ex-MP Simon Danczuk suspended for sexting to fight byelection for <b>Reform</b>",
        "description": "Former Labour member likely to be up against George Galloway in contest for Rochdale seat"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/01/reform-uk-accepted-money-former-tory-donor/",
        "title": "<b>Reform</b> UK admits it accepted money from former Tory donor accused of sexual misconduct",
        "description": "Crispin Odey gave £10k to the party two months after allegations emerged that he had harassed a string of women"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scotland-students-scottish-parliament-scottish-government-government-b1136394.html",
        "title": "Student body declares Scotland’s university and college system ‘broken’",
        "description": "The National Union of Students Scotland has set out its own vision for a new, improved system in a paper called Broke Students, Broken System."
    },
    {
        "url": "https://www.lbc.co.uk/news/former-labour-mp-simon-danczuk-standing-reform-candidate-rochdale-byelection/",
        "title": "Former Labour MP Simon Danczuk is standing as <b>Reform</b> candidate in the Rochdale by-election",
        "description": "Former Labour MP Simon Danczuk is standing as the Reform Party’s candidate in the Rochdale by-election. Mr Danczuk, who represented the seat from 2010 to 2017 and helped expose the Rochdale grooming scandal has defected to the Richard Tice-led party ahead of the poll."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/out-area-taxi-working-banned-28552604",
        "title": "Out of area taxi working to be banned if Labour win election, says Andy Burnham",
        "description": "‘Out of area’ taxi working would be banned under Labour, Andy Burnham has said. Mr Burnham, speaking on his regular BBC Radio Manchester ‘in the hot seat’ phone in, also said he had verbal confirmation from Louise Haigh, shadow transport minister, that the practice would be stopped."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862204/Reform-UK-labour-party-Rochdale-byelection",
        "title": "<b>Reform</b> UK unveil ex-Labour MP as their candidate in Rochdale by-election",
        "description": "Reform UK has pulled off a shock coup after announcing their candidate for the upcoming Rochdale by-election will be none other than the constituency’s former Labour MP. Simon Danczuk will stand for Richard Tice’s party, after a by-election was called following the passing of incumbent MP Sir Tony Loyd a fortnight ago."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25658518/simon-karen-danczuk-mp-candidate-rochdale/",
        "title": "Sext shame MP Simon Danczuk is standing as <b>Reform</b> candidate after remarrying in wake of split from Karen Danczuk",
        "description": "FORMER Labour MP Simon Danczuk is standing as the Reform Party’s candidate in the Rochdale byelection. He is the first famous politician to defect to the party, which was founded by Nigel Farage"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/liverpool-riverside-mp-kim-johnson-28549298",
        "title": "Liverpool Riverside MP Kim Johnson challenging Joint Enterprise law",
        "description": "Kim Johnson, MP for Liverpool Riverside took the second reading of her Bill to Parliament to tighten up law on joint enterprise"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/four-reforms-stop-english-councils-145452752.html",
        "title": "Four reforms to stop English councils from going bankrupt",
        "description": "A new study of council financing in Germany, Italy and Japan offers some new ideas for how to solve English councils’ financial difficulties."
    },
    {
        "url": "https://www.biggleswadetoday.co.uk/news/people/mp-calls-for-action-to-end-misery-of-unadopted-roads-on-new-housing-estates-across-mid-bedfordshire-4501548",
        "title": "MP calls for action to end misery of unadopted roads on new housing estates across Mid Bedfordshire",
        "description": "Mid Bedfordshire MP Alistair Strathern is calling for action to help residents who’ve been waiting years for roads to be adopted by the council."
    },
    {
        "url": "https://www.politicshome.com/members/article/no-room-drought-steps-improve-uk-agricultural-sectors-resilience-drought-water-security",
        "title": "No room for drought: Steps to improve the UK agricultural sector’s resilience to drought and water security",
        "description": "In 2022, the UK experienced its fifth driest summer since 1836. Combined with record-breaking temperatures, this led to severe drought conditions"
    },
    {
        "url": "https://www.politicshome.com/members/article/government-recommit-renters-reform-bill-renters-pets",
        "title": "Why government must recommit to the Renters <b>Reform</b> Bill for renters with pets",
        "description": "The Renters Reform Bill aims to balance the relationship between tenants and landlords, including granting tenants the right to keep pets. Any"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/reform-uk-accepts-10000-millionaire-32020628",
        "title": "<b>Reform</b> UK accepts £10,000 from millionaire Crispin Odey who is accused of sexual harassment",
        "description": "The donation, which was uncovered by DeSmog, was made by hedge fund boss Crispin Odey last August just weeks after 13 women accused him of sexual harassment or abuse"
    },
    {
        "url": "https://www.professionalpensions.com/news/4169516/gmp-uprating-order-approved-parliament",
        "title": "GMP 3% uprating order approved in parliament",
        "description": "The annual uprating order for GMPs has been approved at 3% after a parliamentary session yesterday (31 January)."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/diana-shipping-inc-announces-time-141400478.html",
        "title": "Diana Shipping Inc. Announces Time Charter Contract for m/v Philadelphia With NYK Line",
        "description": "Diana Shipping Inc. (NYSE: DSX), (the “Company”), a global shipping company specializing in the ownership and bareboat charter-in of dry bulk vessels, today announced that, through a separate wholly-owned subsidiary,"
    }
]