[
    {
        "url": "https://www.itv.com/watch/news/voices-of-shooting-victims-recreated-in-bid-to-push-through-gun-reform/6yfk0tn",
        "title": "Voices of shooting victims recreated in bid to push through gun <b>reform</b>",
        "description": "Mon 19 Feb 9.53pm • Families of young people lost to gun violence in the U.S. have been campaigning in Washington, using AI-generated recordings of their children."
    },
    {
        "url": "https://www.itv.com/news/2024-02-19/voices-of-children-killed-in-us-school-shootings-created-by-ai",
        "title": "Voices of children killed in US school shootings created by AI to lobby for gun <b>reform</b>",
        "description": "After years of lobbying politicians to tighten gun ownership laws, Joaquin Oliver&#39;s parents have switched to using AI to make calls from beyond the grave. | ITV National News"
    },
    {
        "url": "https://www.chathamhouse.org/2024/02/ukraine-means-enlargement-again-eus-priority-not-reasons-it-claims",
        "title": "Ukraine means enlargement is again the EU’s priority – but not for the reasons it claims",
        "description": "Enlargement is back. For the last decade or so, the European Union had made it clear that, while accession negotiations with several countries would continue, it did not expect any of them to actually join the bloc any time soon."
    },
    {
        "url": "https://www.thepharmaletter.com/article/european-group-demands-reform-of-generics-procurement-policies",
        "title": "European group demands <b>reform</b> of generics procurement policies",
        "description": "The trade group - which represents the generic, biosimilar and  value-added medicines industries across Europe - has a  newly-published position paper exploring how the current design  of procurement rules in European Union (EU) member states, often  aimed exclusively at reducing…"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/first-minister-michelle-oneill-says-stormont-committee-is-best-place-to-discuss-reform-of-the-institutions-34RYR4WPZNEZNPESQIRQSDZNDA/",
        "title": "First Minister Michelle O’Neill says Stormont committee is ‘best place’ to discuss <b>reform</b> of the institutions",
        "description": "The Sinn Féin first minister said Stormont’s assembly and executive review committee was the “best place” to take forward measures that could potentially remove the largest nationalist or unionist parties’ ability to collapse power-sharing."
    },
    {
        "url": "https://www.investing.com/news/economy/china-must-see-need-to-reform-wto-rules-says-eu-trade-chief-3307584",
        "title": "China must see need to <b>reform</b> WTO rules, says EU trade chief",
        "description": "BRUSSELS (Reuters) - China needs to play a constructive role in talks at the World Trade Organization to <b>reform</b> global trade rules on industrial subsidies or risk rivals setting their own policies at China&#39;s expense, the European Union&#39;s trade chief said ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/eastwood-reforming-apprenticeship-tax-should-be-priority-for-economy-minister-4524817",
        "title": "Eastwood: Reforming apprenticeship tax should be priority for economy minister",
        "description": "The Lagan Valley MLA has said: &quot;I welcome the Minister&#39;s commitment to improving skills and placing focus on apprenticeships, but without <b>reform</b> of the Apprenticeship Levy, large businesses continue to, essentially, pay a tax without seeing the benefit of ..."
    },
    {
        "url": "https://schoolsweek.co.uk/gcses-what-ministers-said-in-response-to-lords-reform-calls/",
        "title": "GCSEs: What ministers said in response to Lords’ <b>reform</b> calls",
        "description": "DfE rejects calls to scrap the EBacc and for wider <b>reform</b>, but sets out some of its thinking on the issue DfE rejects calls to scrap the EBacc and for wider <b>reform</b>, but sets out some of its thinking on the issue Ministers have rejected calls by a House of ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/gb-news-ofcom-pro-tory-bias-rishi-sunak-programme/",
        "title": "GB News investigated for pro-Tory bias in Rishi Sunak Q&amp;A",
        "description": "GB News is facing a fresh impartiality row after Ofcom launched an investigation into its question-and-answer event with Rishi Sunak. The regulator said it received around 500 complaints about The People’s Forum: The Prime Minister from viewers who felt it was biased towards the Conservative Party."
    },
    {
        "url": "https://uk.news.yahoo.com/boris-johnson-bring-back-half-095934693.html",
        "title": "Boris Johnson ‘would bring back half of lost Tory votes’ and is favourite to replace Sunak, poll finds",
        "description": "The study comes just weeks after a Tory bustup over secretive polls, including the “Labour landslide” poll warning of Tory wipeout at the general election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/i-would-spoil-rochdale-by-election-ballot-says-streeting/?utmsource=email",
        "title": "I’d spoil my ballot if I was voting in Rochdale, says ‘ashamed’ Wes Streeting",
        "description": "Shadow health secretary apologises to supporters in Greater Manchester town after party suspended candidate in anti-Semitism row"
    },
    {
        "url": "https://uk.news.yahoo.com/two-ex-local-london-politicians-084116504.html",
        "title": "Two ex-local London politicians sworn in as MPs after Labour ousted Tories in by-elections",
        "description": "The by-election results were a heavy blow to the Conservatives, especially given that they saw <b>Reform</b> UK getting double-digit backing in both by-elections. They have sparked fresh talk of a possible challenge to Rishi Sunak if the party’s position in the ..."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1868131/Reform-UK-Ben-Habib-by-election",
        "title": "Only <b>Reform</b> UK can save Britain from growing existential threat it faces, says Ben Habib",
        "description": "So undermined is the country that defining a woman has become a challenge. Only <b>Reform</b> UK will stand up for Britain, making policies purely in the interests of the Unted Kingdom and British citizens. Only <b>Reform</b> UK will save our economy, protect our ..."
    },
    {
        "url": "https://carsonnow.org/reader-content/02/19/2024/state-workers-wanting-retirement-benefits-reform-gather-governors-mansion-",
        "title": "State workers wanting retirement benefits <b>reform</b> gather at Governor&#39;s Mansion in Carson City",
        "description": "Several state employees were at the Governor&#39;s Mansion in Carson City on Monday holding signs encouraging the state to reform its PERS retirement system."
    },
    {
        "url": "https://www.al.com/reckon/2024/02/landmark-criminal-justice-reforms-targeted-in-louisiana-special-legislative-session.html",
        "title": "Landmark criminal justice reforms targeted in Louisiana special legislative session",
        "description": "Republican Gov. Jeff Landry wants to roll back a slew of laws that granted second chances to incarcerated people and helped shrink Louisiana’s prison population."
    },
    {
        "url": "https://www.theleader.com.au/story/8527323/georges-river-councils-vision-for-sustainable-housing/",
        "title": "Mayoral Minute with Sam Elmir: Leading for Change - Housing <b>Reform</b>",
        "description": "Georges River is a Council committed to being future focused and ambitious. In the coming years, we will see pockets of the future emerge through strategic initiatives that support our region to be more accessible, green, diverse, and innovative."
    },
    {
        "url": "https://www.scmp.com/comment/article/3252444/chinese-government-must-stop-chipping-away-deng-xiaopings-economic-legacy",
        "title": "The Chinese government must stop chipping away at Deng Xiaoping’s economic legacy",
        "description": "It is disappointing and worrying to see the true legacy of Deng being chipped away in recent years. While “<b>reform</b>” is enshrined as a politically correct word, it seems to have lost its original meaning, to become a facade used to describe anything the ..."
    },
    {
        "url": "https://www.freemalaysiatoday.com/category/opinion/2024/02/20/malaysia-overdue-for-public-service-reform/",
        "title": "Malaysia overdue for public service <b>reform</b>",
        "description": "Malaysia stands on the precipice of overdue public service reform. While the spotlight often falls on pension reforms as a solution to rising government debt, the real crux of the issue lies in the broader question: What does the future hold for Malaysia’s public service?"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868310/reform-labour-together-general-election",
        "title": "<b>Reform</b> UK could &#39;change picture entirely&#39; for Labour at general election – new analysis",
        "description": "&quot;But, a few small shifts in voters’ views and a would-be majority narrows. A collapse in the resurgent Reform party, just like Ukip and the Brexit Party before them, could change the picture entirely. There is no room for complacency.”"
    },
    {
        "url": "https://bylinetimes.com/2024/02/19/millions-missing-from-electoral-roll-as-voters-face-double-whammy-of-registration-issues-and-photo-id/",
        "title": "Millions Missing from Electoral Roll as Voters Face Double Whammy of Registration Issues and Photo ID",
        "description": "In some constituencies, one-fifth of potential voters have not signed up to the electoral roll, new analysis reveals"
    },
    {
        "url": "https://www.communitycare.co.uk/2024/02/19/can-systemic-practice-improve-how-early-help-staff-support-families/",
        "title": "Can systemic practice improve how early help staff support families?",
        "description": "A pilot study will look at how systemic practice can enhance the work of early help services in supporting families in need"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/19/kemi-badenoch-post-office-scandal-alexei-navalny-uk-politics-live?topics=PERSON%3AKeir+Starmer",
        "title": "Kemi Badenoch to defend her claims about ex-Post Office chair in statement to MPs – UK politics live",
        "description": "Business secretary to address parliament after she accused Henry Staunton of giving interview ‘full of lies’ about conversation after his dismissal"
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/02/19/the-politics-behind-sue-grays-plan-for-citizens-assemblies/",
        "title": "The politics behind Sue Gray’s plan for ‘citizens’ assemblies’",
        "description": "It has been five months since Sue Gray began work as Keir Starmer’s chief of staff — in what amounted to her first foray into party politics. And, in that time, the former partygate investigator has established herself as a pivotal figure in the Labour leader’s inner circle."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/boris-johnson-rishi-sunak-tory-vote-b2498409.html",
        "title": "Boris Johnson ‘would bring back half of lost Tory votes’ and is favourite to replace Sunak, poll finds",
        "description": "The study comes just weeks after a Tory bustup over secretive polls, including the “Labour landslide” poll warning of Tory wipeout at the general election"
    },
    {
        "url": "https://www.landlordzone.co.uk/news/landlord-mps-accused-of-trying-to-gut-renters-reform-bill",
        "title": "MPs slammed for tabling sensible amendements to <b>reform</b> bill",
        "description": "The Renters (Reform) Bill is in its Report stage within the House of Commons but the Renters Reform Coalition says five MPs with significant property portfolios are among a group of some 40 Conservative MPs who have tabled amendments to the Bill, with a further seven of them holding just one property."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/uk-pub-rules-could-change-28660082",
        "title": "UK pub rules could change due to 7,000 being expected to go bust",
        "description": "It comes as Chancellor Jeremy Hunt comes under pressure with the Tories to slash booze duty in the Budget and Spring Statement next month (March)."
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/pateley-bridge-candidate-for-north-yorkshire-mayor-says-reform-uk-party-can-change-politics-for-the-better-4523754",
        "title": "Pateley Bridge candidate for North Yorkshire Mayor says <b>Reform</b> UK party can &#39;change politics for the better&#39;",
        "description": "The Harrogate and Knaresborough branch of the Reform UK party has opted to back Keith Tordoff for Mayor of York and North Yorkshire in the week he came out firmly against the town’s controversial £11."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/19/louisiana-criminal-justice-bills-jeff-landry?ref=upstract.com",
        "title": "‘Unconscionable’ criminal justice bills could fuel soaring incarceration in Louisiana",
        "description": "Reform advocates condemn raft of measures expected to pass under new far-right governor"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/rishi-sunak-told-stop-playing-28659283",
        "title": "Rishi Sunak told to &#39;stop playing footsie&#39; with Nigel Farage as Tories face election disaster",
        "description": "The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13099787/Reform-UK-make-difference-massive-192-seat-Labour-majority-hung-Parliament-Keir-Starmer-left-14-seats-short-general-election.html",
        "title": "<b>Reform</b> UK &#39;could make the difference&#39; between a massive 192-seat Labour majority and a hung Parliament with Keir Starmer left 14 seats short at the general election",
        "description": "According to modelling by the Labour Together think tank, the fortunes of the Nigel Farage-backed party may prove key to how many seats Labour wins."
    },
    {
        "url": "https://www.ids.ac.uk/opinions/livelihood-change-after-land-reform-new-research-from-zimbabwe/",
        "title": "Livelihood change after land <b>reform</b>: new research from Zimbabwe",
        "description": "I try and catch up on the ever-growing literature on land, agriculture and rural change in Zimbabwe. Each year there seems to be more and more, as the body of work grows based on many research studies,"
    },
    {
        "url": "https://thestrayferret.co.uk/reform-uk-backs-independent-keith-tordoff-for-mayor/",
        "title": "<b>Reform</b> UK backs Independent Keith Tordoff for mayor",
        "description": "The Reform UK parliamentary candidate for Harrogate and Knaresborough has backed Independent Keith Tordoff to be Mayor of North Yorkshire."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/uk-pub-restaurant-hotel-warning-28658788",
        "title": "UK pub, restaurant and hotel warning and it&#39;s &#39;real cause of concern&#39;",
        "description": "A joint survey by UKHospitality, the British Beer and Pub Association, British Institute of Innkeeping and Hospitality Ulster has made the findings."
    },
    {
        "url": "https://inews.co.uk/news/politics/were-fking-up-so-much-no-10-despair-after-tories-double-defeat-2911108?ico=most_read_by_subscribers",
        "title": "‘We’re f**king up so much’: No 10 despair after Tories’ double defeat",
        "description": "But in the immediate aftermath of the Tories’ double defeat, there was little evidence of any serious manoeuvres against Sunak. How long that will hold remains to be seen, particularly if next month’s Budget fails to shift the polls and flights to Rwanda do not take off."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-told-playing-footsie-32156950",
        "title": "Rishi Sunak told &#39;playing footsie&#39; with Nigel Farage and <b>Reform</b> will trigger Tory wipeout",
        "description": "Former Conservative Party chairman Chris Patten warned Rishi Sunak that the party &#39;won&#39;t stand a prayer of winning the next election&#39; if it lurches to the right to pursue Reform UK"
    },
    {
        "url": "https://www.taxi-point.co.uk/post/hundred-s-of-london-black-cab-drivers-demand-fairer-treatment-and-regulation-reforms-from-tfl",
        "title": "Hundred’s of London black cab drivers demand fairer treatment and regulation reforms from TfL",
        "description": "Hundreds of independent London&#39;s black cab drivers are uniting in protest against what they consider excessively stringent licensing regulations imposed by Transport for London (TfL). Rallying under the collective ‘Taxi Drivers Unite,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-nigel-farage-conservatives-reform-b2498418.html",
        "title": "Former Tory chairman warns Rishi Sunak against ‘playing footsie’ with <b>Reform</b> UK",
        "description": "Lord Patten said the Conservative Party is ‘deluding itself’ if it thinks it can ‘behave like this and still go on and win an election’"
    },
    {
        "url": "https://wgnradio.com/news/graham-supports-house-bill-recombining-foreign-aid-with-border-reform/",
        "title": "Graham supports House bill recombining foreign aid with border <b>reform</b>",
        "description": "WASHINGTON (NEXSTAR) – On Sunday’s “Face the Nation” Senator Lindsey Graham (R-S.C.) said a new national security bill, introduced by a bipartisan group of House lawmakers last week, may be Washington’s best bet to quickly get aid to Ukraine ..."
    },
    {
        "url": "https://www.bbc.com/news/world-us-canada-64442756?_hsenc=p2ANqtz-8fM2lx_AQWktEvskhykNEKzHZpaE6p_AfH3a3xsXkDsPfZmMH2DNvDPCHvuNDlm9s_PylV",
        "title": "Tyre Nichols: Police unit is disbanded after death",
        "description": "&quot;This is a necessary step. We want to be fully transparent to the community.&quot; But for some, the problem of police violence is more deeply rooted than any <b>reform</b> can address. At the rally Saturday, Memphis native Allie Watkins held a sign that proclaimed ..."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/19/labour-will-introduce-citizens-assemblies-after-transformational-success-in-ireland/",
        "title": "Labour will introduce citizens’ assemblies after ‘transformational’ success in Ireland",
        "description": "The Labour Party has said it is drawing up plans to introduce “citizens’ assemblies” which could be used to bypass Whitehall and make key decisions.  Sue Gray, the chief of staff to Labour leader Sir Keir Starmer,"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/danczuk-expresses-fears-of-violence-ahead-of-rochdale-poll-368921/",
        "title": "Danczuk expresses fears of violence ahead of Rochdale poll",
        "description": "Mr Danczuk also highlights immigration as a big issue for his target voters in Rochdale, one of the poorest towns in England – which voted 60% for Brexit. “We have had one of the highest intake of asylum seekers in the country compared to other towns and cities,” Mr Danczuk said."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/offices-old-pubs-former-factories-what-really-like-2910453",
        "title": "We live in converted offices, old pubs, and former factories – this is what it’s really like",
        "description": "Your clothes wouldn&#39;t dry unless you hung them in this weird heating room. It was a massive fire hazard, looking back I can’t believe there were no fires&#39;"
    },
    {
        "url": "https://uk.news.yahoo.com/corruption-trials-continue-illinois-lobbyist-110000290.html",
        "title": "As corruption trials continue, Illinois lobbyist <b>reform</b> effort pushed in General Assembly",
        "description": "Illinois laws regulating lobbyists and their influence on state government have long been criticized as being too weak, especially for a state with a history of influence peddling and corruption. As the Illinois General Assembly begins its spring session,"
    },
    {
        "url": "https://www.politico.eu/article/world-trade-organization-india-united-states-protectionism-agriculture/",
        "title": "Don’t just blame the US; India is blocking WTO <b>reform</b> too",
        "description": "As Narendra Modi bids for a third term, the nation of 1.4 billion is taking multiple files hostage at the global trade body."
    },
    {
        "url": "https://www.nwemail.co.uk/news/national/24127568.danczuk-expresses-fears-trouble-ahead-rochdale-poll/",
        "title": "Danczuk expresses fears of trouble ahead of Rochdale poll",
        "description": "Simon Danczuk, the ex-Labour MP for Rochdale – now standing as the <b>Reform</b> Party candidate, says he has found the atmosphere has changed in the time since he last ran for office. “I’ve been out of politics for five years or so and I’ve come back in ..."
    },
    {
        "url": "https://www.harrogate-news.co.uk/2024/02/19/reform-uk-in-harrogate-endorse-keith-tordoff-as-their-preferred-mayor-for-york-and-north-yorkshire/",
        "title": "<b>Reform</b> UK in Harrogate endorse Keith Tordoff as their preferred Mayor for York and North Yorkshire",
        "description": "Richard Brown, the <b>Reform</b> UK candidate for the MP of Harrogate and Knaresborough, is placing his support behind Independent candidate Keith Tordoff MBE to be Mayor of York and North Yorkshire. The area has seen a growing support for <b>Reform</b> UK in the ..."
    },
    {
        "url": "https://www.civilserviceworld.com/professions/article/labour-plans-citizens-assemblies-sue-gray",
        "title": "Labour would introduce citizens&#39; assemblies, Sue Gray says",
        "description": "She said the assemblies will get the public directly involved in deciding contentious issues such as constitutional <b>reform</b>, devolution and housing, in excerpts of Keir Starmer: The Biography seen by The Times. A general election is due to take place by ..."
    },
    {
        "url": "https://www.ft.com/content/29e5c880-edbe-4227-879d-7b401f36b697",
        "title": "Can the SEC’s landmark reforms survive a Wall Street fightback?",
        "description": "Many of his <b>reform</b> projects focus on intermediaries in the equity, private capital and government bond markets to ensure “fair, orderly and efficient” operation, he adds. He has so far proposed 67 rules, the highest number since Mary Schapiro ..."
    }
]