[
    {
        "url": "https://www.brennancenter.org/our-work/research-reports/whats-next-reforming-section-702-foreign-intelligence-surveillance-act",
        "title": "What’s Next for Reforming Section 702 of the Foreign Intelligence Surveillance Act",
        "description": "Congress must decide among four bills to reauthorize the controversial spying law — or whether to allow it to expire."
    },
    {
        "url": "https://www.tivysideadvertiser.co.uk/news/24094561.school-summer-holidays-cut-four-weeks/",
        "title": "School summer holidays could be cut to four weeks",
        "description": "Pembrokeshire councillors are to give their views on a consultation which could see the summer school holidays reduced to just four weeks, the"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "<b>Reform</b> support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://uk.news.yahoo.com/n-b-woman-accused-deaths-183611946.html",
        "title": "N.B. woman accused in the deaths of 14 horses to be tried in the Court of King&#39;s Bench",
        "description": "Charlotte Bright, charged in the deaths of 14 horses between Feb. 1 and April 8, 2023 has elected to be tried by a Court of King&#39;s Bench judge without a jury.Bright was charged with three criminal offences."
    },
    {
        "url": "https://news.sky.com/story/labour-will-look-for-radicalism-through-reform-13062317?dcmp=snt-sf-twitter",
        "title": "Labour will look for &#39;radicalism&#39; through <b>reform</b> rather than risk fiscal slip-up",
        "description": "Image: Keir Starmer addressed 400 business leaders at a Labour business event this week. Pic: PA Without typical Labour levers of tax or spend, <b>reform</b> will be a big element of the party&#39;s offer to voters at the next general election, be it workers&#39; rights ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/ill-die-in-a-ditch-for-a-free-nhs-wes-streeting-tells-reform-critics-2887233?ITO=msn",
        "title": "I’ll ‘die in a ditch’ for a free NHS, Wes Streeting tells <b>reform</b> critics",
        "description": "Shadow health secretary said people are feeling more &#39;reassured&#39; about his plans for reform of the health service as he pledges a Labour government will intervene early to tackle UK&#39;s mental health ep"
    },
    {
        "url": "https://www.itv.com/news/2024-02-02/questions-over-how-suspect-in-chemical-attack-was-granted-asylum-after-offence",
        "title": "Questions over how suspect in chemical attack was granted asylum after sex offence",
        "description": "Abdul Ezedi, suspected of attacking families with a corrosive substance, was convicted of a sex offence in 2018 and later granted asylum. | ITV National News"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/cramlington-labour-candidate-general-election-28558593",
        "title": "Labour select candidate to fight newly formed Northumberland seat at general election",
        "description": "The Labour Party has unveiled its candidate for the newly formed Cramlington and Killingworth seat at the looming General Election."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/tuv-delegation-canvasses-for-ben-habib-and-reform-uk-in-wellingborough-by-election-4503748",
        "title": "TUV delegation canvasses for Ben Habib and <b>Reform</b> UK in Wellingborough by-election",
        "description": "Wellingborough voted 62.4% in favour of Brexit in the 2016 EU referendum, so Mr Habib, <b>Reform</b> UK&#39;s candidate, said this could give his party - formerly the Brexit Party - good odds. Did you know with a Digital Subscription to Belfast News Letter ..."
    },
    {
        "url": "https://www.bva.co.uk/news-and-blog/news-article/bva-responds-to-government-proposals-to-reform-veterinary-medicines-regulations/",
        "title": "BVA responds to Government proposals to <b>reform</b> Veterinary Medicines Regulations",
        "description": "The British Veterinary Association (BVA) has broadly welcomed the publication of the Government’s plans to reform the Veterinary Medicines Regulations (VMR) in Great Britain. The proposed amendments to the 2013 Regulations follow a consultation last year, which BVA jointly responded to alongside several of its specialist divisions."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155023/everyone-who-is-standing-in-the-rochdale-byelection",
        "title": "Everyone who is standing in the Rochdale by-election",
        "description": "On 29 February, residents of the Rochdale constituency will have their chance to say who they want to represent them"
    },
    {
        "url": "https://www.thegrocer.co.uk/wholesalers/prison-food-reform-is-huge-opportunity-for-wholesalers-says-charity/687653.article",
        "title": "Prison food <b>reform</b> is ‘huge opportunity’ for wholesalers, says charity",
        "description": "The Food Matters in Prisons report, issued last month, calls for greater transparency and accountability around food procurement"
    },
    {
        "url": "https://www.ft.com/content/ffcf64bb-0b28-4514-87b1-d70b8601ae8c",
        "title": "Slovakia’s Robert Fico under pressure to ditch plan to close anti-corruption office",
        "description": "Slovakia’s Eurosceptic premier Robert Fico is under increased pressure from opposition parties, street protests and the EU not to go ahead with plans to close down the country’s anti-corruption office."
    },
    {
        "url": "https://inews.co.uk/news/nigel-farage-wont-stand-as-mp-reform-leader-hints-2886100",
        "title": "Nigel Farage won’t stand as MP, <b>Reform</b> leader hints",
        "description": "Richard Tice suggests Farage will support the party&#39;s general election campaign, but will not make an eighth attempt to become an MP"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/michael-kelly-down-and-connor-can-expect-bishop-alan-mcguckian-to-lead-a-journey-of-reform-JLB33CJMYJAE5EWV4S6VSZNLBQ/",
        "title": "Michael Kelly: Down and Connor can expect Bishop Alan McGuckian to lead a journey of <b>reform</b>",
        "description": "Known as personable and hard-working, Bishop McGuckian was a close adviser to the somewhat more distant Bishop Noel Treanor, who never gave any strong indication that he enjoyed being in Down and Connor as bishop from 2008 until his 2022 appointment as the Pope’s ambassador to Brussels."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/",
        "title": "Politics latest news: Labour starts pre-election talks with civil service",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1862517/robert-taylor-rishi-sunak-get-a-grip-or-go",
        "title": "Rishi Sunak must get a grip or go now, writes Robert Taylor",
        "description": "In trying to keep both wings of the coalition together, he has fallen between two stools. No wonder <b>Reform</b> is polling at 13% and rising. The budget will be held on March 6. Unless there is a big, immediate uptick in fortunes it is time to consider the ..."
    },
    {
        "url": "https://www.thegrocer.co.uk/sysco-gb-advocates-for-apprenticeship-levy-education-reform/687791.article",
        "title": "Sysco GB advocates for apprenticeship levy education <b>reform</b>",
        "description": "Sysco GB is pushing for the current apprenticeship levy to encompass wider education funding, including adult learning and literacy and numeracy schemes for its existing staff."
    },
    {
        "url": "https://www.walesonline.co.uk/news/education/teaching-unions-wales-write-education-28557805",
        "title": "All teaching unions in Wales write to Education Minister opposing shorter summer holidays",
        "description": "&quot;The proposed changes will do damage to secondary learners... every secondary teacher knows that this is a serious error,&quot; teacher and school leaders&#39; unions say."
    },
    {
        "url": "https://menafn.com/1107802933/Roofing-Solar-Reform-Alliance-Emerges-To-Transform-Industry-Practices",
        "title": "Roofing &amp; Solar <b>Reform</b> Alliance Emerges To Transform Industry Practices",
        "description": "This united group of contractors is taking a stand against greed and corruption. DENVER, COLORADO, UNITED STATES, February 2, 2024 /"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/home-office-james-cleverly-robert-jenrick-london-zac-goldsmith-b1136562.html",
        "title": "Calls for ‘urgent’ Home Office review into alkali attack suspect’s asylum claim",
        "description": "The details of the case have renewed calls from some Tory MPs for serious reform of the asylum system, with former immigration minister Robert Jenrick calling on Home Secretary James Cleverly to carry out a “detailed review” of how Ezedi was allowed to remain in the UK."
    },
    {
        "url": "https://www.standard.co.uk/news/london/mayoral-election-serge-crowbolder-lower-rents-digital-democracy-b1136471.html",
        "title": "London mayoral election: Independent candidate pledges lower London rents and digital democracy",
        "description": "Mayoral hopeful Serge Crowbolder has also said wants to commission a study into whether a dam could be built between Kent and Essex"
    },
    {
        "url": "https://uk.style.yahoo.com/ftc-orders-blackbaud-overhaul-reckless-132037589.html",
        "title": "FTC orders Blackbaud to overhaul &#39;reckless&#39; security practices in wake of 2020 breach",
        "description": "Education tech company Blackbaud agreed to settle with the U.S. Federal Trade Commission over the company’s security practices that resulted in a 2020 data breach. The FTC alleges that Blackbaud, a U."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13037091/Rishi-Sunak-Tory-MPs-hotel-England-cricket-election.html",
        "title": "Rishi Sunak gathers Tory MPs at luxury hotel to insist they can emulate England cricket team and pull off miracle election victory… as poll shows Labour 17 points ahead",
        "description": "Rishi Sunak cited the surprise victory in the first test against India as he treated around 100 of his troops to dinner at a luxury hotel in Leicester Square."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/?utmsource=email",
        "title": "Politics latest news: <b>Reform</b> UK hits highest ever level of support in Red Wall in setback for Sunak",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://uk.news.yahoo.com/finnish-strikes-over-labour-reform-124400536.html",
        "title": "Finnish strikes over labour <b>reform</b> empty Helsinki",
        "description": "Public transport ground to a halt across much of Finland on Friday as part of mass strikes over the government&#39;s proposed labour reforms, leaving Helsinki&#39;s normally-bustling city centre unusually quiet."
    },
    {
        "url": "https://www.edie.net/financial-uncertainty-at-uk-councils-undermining-net-zero-progress-government-warned/",
        "title": "Financial uncertainty at UK councils undermining net-zero progress, Government warned",
        "description": "UK100 urges a major policy reform to enable local authorities to meet net-zero targets, warning short fixes won&#39;t resolve the £4bn funding shortfall looming through to 2026."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/the-loan-charge-is-ruining-lives-and-failing-to-stop-dodgy-umbrella-companies-leading-mp-warns-4502937",
        "title": "The loan charge is ruining lives and failing to stop &#39;dodgy umbrella companies&#39;, leading MP warns",
        "description": "MPs and industry leaders are calling on the Government to impose regulations on rogue umbrella companies who exploit workers and cheat the taxman."
    },
    {
        "url": "https://www.just-style.com/news/uzbekistan-welcomes-scrutiny-amid-2023-cotton-harvest-forced-labour-claims/",
        "title": "Uzbekistan ‘welcomes scrutiny’ amid 2023 cotton harvest forced labour claims",
        "description": "A report has alleged some forced labour took place during Uzbekistan&#39;s 2023 cotton harvest, raising concerns on the need for urgent reform."
    },
    {
        "url": "https://businessmondays.co.uk/new-look-board-announced-to-help-drive-land-reform/",
        "title": "New-look board announced to help drive land <b>reform</b>",
        "description": "Michael Russell joins the Scottish Land Commission as Chair The Scottish Government has announced the appointment of a new Chair and two new members to  the Board of the Scottish Land Commission. Michael Russell will join the Land Commission as its new Chair,"
    },
    {
        "url": "https://www.lawgazette.co.uk/news/buckland-divorce-reform-needs-to-move-faster/5118635.article",
        "title": "Buckland: divorce <b>reform</b> needs to move faster",
        "description": "Former lord chancellor concerned about speed of progress on financial remedies with several months to go until Law Commission &#39;scoping paper&#39; published."
    },
    {
        "url": "https://www.insider.co.uk/appointments/michael-russell-confirmed-new-scottish-32028413",
        "title": "Michael Russell confirmed as new Scottish Land Commission chair",
        "description": "The Scottish Government has announced the appointment of a new chair and two new members to the board of the Scottish Land Commission. Michael Russell replaces the outgoing Andrew Thin, while Craig Mackenzie and Deb Roberts have been appointed as commissioners."
    },
    {
        "url": "https://uk.news.yahoo.com/type-student-loan-forgiveness-coming-095401294.html",
        "title": "A new type of student-loan forgiveness is coming this month",
        "description": "Biden will begin canceling student debt for borrowers in the SAVE plan who originally borrowed $12,000 or less and made 10 years of payments."
    },
    {
        "url": "https://www.chemistanddruggist.co.uk/CD137924/Five-things-to-know-about-the-foundation-training-reform",
        "title": "Five things to know about the foundation training <b>reform</b>",
        "description": "The General Pharmaceutical Council (GPhC) have recently made way for new foundation training standards and Zhyar Said breaks this"
    }
]