[
    {
        "url": "https://www.itv.com/news/wales/2024-01-30/new-qualification-to-be-introduced-in-major-education-reform",
        "title": "New qualification to be introduced in major education <b>reform</b>",
        "description": "This means that along with new Made-for-Wales GCSEs, learners in Wales aged 14-16 will be able to choose from: Cassy Taylor, director of qualifications policy and <b>reform</b> at Qualifications Wales, said this new policy represents the &quot;biggest transformation ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? Starmer opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://inews.co.uk/opinion/wrong-about-house-of-lords-good-peers-holding-government-to-account-2878804?ico=related_stories",
        "title": "I was wrong about the House of Lords – good peers are holding the Government to account",
        "description": "In 2022, Sir Simon Jenkins opined scathingly in a Guardian column about the club of the great, the good and not good at all: “Not one living prime minister has deigned to darken its door. They know too much of its deals, kickbacks and cronyism to be reminded of them round every corner."
    },
    {
        "url": "https://thenegotiator.co.uk/70-of-housebuilders-want-labour-to-win-general-election-says-knight-frank",
        "title": "70% of housebuilders want Labour to win General Election, says Knight Frank",
        "description": "The Knight Frank Land Index &amp; Housebuilder Survey of English housebuilders shows 70% favour Labour government plans for reform."
    },
    {
        "url": "https://www.investing.com/news/economy/japan-pm-vows-to-do-everything-possible-to-boost-household-income-3286529",
        "title": "Japan PM vows to do &#39;everything possible&#39; to boost household income",
        "description": "Kishida and Finance Minister Shunichi Suzuki both stressed the need to tackle fiscal <b>reform</b>. &quot;Japan&#39;s fiscal situation will become even more severe due to several rounds of extra stimulus budgets in response to the COVID-19 pandemic and rising inflation ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/30/wales-council-tax-england-real-levelling-up?ref=mc.news",
        "title": "Wales has been brave enough to completely rethink the hated council tax. Take note, England",
        "description": "The Senedd’s plan to shift the burden of this levy away from those on lower incomes shows how real levelling up can work, says the Guardian columnist Polly Toynbee"
    },
    {
        "url": "https://uk.news.yahoo.com/editorial-bad-faith-negotiations-no-090000982.html",
        "title": "Editorial: Bad faith negotiations: No immigration restriction is enough for Trump &amp; GOP",
        "description": "Senate talks on immigration <b>reform</b> have been misrepresented as either side negotiating over its policy preferences. In actuality, Republicans have held Ukraine aid hostage and demanded that the Democrats acquiesce to increasingly unhinged restrictions ..."
    },
    {
        "url": "https://www.property118.com/majority-of-letting-agents-find-the-renters-reform-bill-unfair/",
        "title": "Majority of letting agents find the Renters (<b>Reform</b>) Bill unfair",
        "description": "Bill could significantly harm the private rented sector. A Propertymark survey reveals a massive 94% of letting agents believe"
    },
    {
        "url": "https://www.propertywire.com/adviser-news/buy-to-let/propertymark-urges-government-to-hold-landlord-forums/",
        "title": "Propertymark urges government to hold landlord forums",
        "description": "Local authorities need to hold landlord forums to allow them to properly engage with the Renters <b>Reform</b> Bill passing through parliament, Propertymark has argued. The estate agency trade group found that 52% of local authorities in England have not had a ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cp6xkx4ez8po?at_medium=RSS&at_campaign=KARANGA",
        "title": "You&#39;ve heard of GCSEs, so what are VCSEs?",
        "description": "Qualifications Wales said it hoped VCSEs would become as recognised a brand as GCSE and “valued in the same way”. VCSEs will be a new brand of vocational qualifications. These are more practical and tend to be geared at certain jobs or careers. They are a different to general qualifications like GCSEs which are usually awarded in academic subjects."
    },
    {
        "url": "https://www.miningreview.com/coal/south-african-rail-reform-and-liberalisation/",
        "title": "Rail <b>reform</b> and liberalisation: Where are we?",
        "description": "After a century without coherent rail policy in SA, the White Paper on National Rail Policy was adopted by the Cabinet in March 2022."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/windsor-framework-fundamental-reform-needed-to-solve-problems-says-economist-esmond-birnie-4497523",
        "title": "Windsor Framework: ‘Fundamental <b>reform</b>’ needed to solve problems says economist Esmond Birnie",
        "description": "A leading economist says that problems affecting the Northern Ireland economy can only be dealt with by fundamental reforms of the Windsor Framework."
    },
    {
        "url": "https://philosophynow.org/issues/160/Edmund_Burke_and_the_Politics_of_Reform",
        "title": "Edmund Burke &amp; the Politics of <b>Reform</b>",
        "description": "But the two impulses – conservatism and <b>reform</b> – are not contradictory if there are things to conserve in society as well as things to change. For instance, if a society has a functioning democracy, concerned citizens should be as active in its ..."
    },
    {
        "url": "https://www.modernghana.com/news/1288897/ndc-prefers-election-date-change-to-take-effect.html",
        "title": "NDC prefers election date change to take effect from 2028",
        "description": "The opposition National Democratic Congress NDC has supported the change in the day for national elections but wants the reform to begin in 2028."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/29/navigating-healthcare-challenges-in-pakistan-a-call-for-reform/",
        "title": "Navigating Healthcare Challenges in Pakistan: A call for <b>reform</b>",
        "description": "Pakistan, a country with a rich cultural tapestry and a history shaped by various influences, faces considerable challenges in its healthcare sector. Despite commendable efforts, several factors contr"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861005/rishi-sunak-immigration-referendum-general-election",
        "title": "Rishi Sunak handed blueprint for shock election win with &#39;radical offer&#39; on immigration",
        "description": "A leading academic said the PM could &quot;pull off one of the biggest shocks&quot; in the history of general elections by promising a referendum on reducing immigration."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/czrl3r90kgko",
        "title": "Castletown property rates to rise 9% from April",
        "description": "Residents in Castletown are facing an above-inflation rate rise from April, the local authority has confirmed. Ratepayers face a hike of 9% in their domestic rates and 8.9% in the refuse rate. That equates to an average town rate rise of £38."
    },
    {
        "url": "https://uk.news.yahoo.com/illinois-appeals-courts-see-dramatic-004200470.html",
        "title": "Illinois appeals courts see ‘dramatic increase’ in cases following elimination of cash bail",
        "description": "In October in Livingston County, Judge Jennifer Bauknecht issued a lengthy decision following a detention hearing just weeks after cash bail was abolished across the state. “All right. Since its founding,"
    },
    {
        "url": "https://www.getsurrey.co.uk/news/surrey-news/extra-funding-announced-crucial-council-28512238",
        "title": "Extra funding announced for crucial council services in Surrey but &#39;difficult decisions&#39; remain",
        "description": "It comes amid a backdrop of councils facing difficult financial times, with Woking declaring itself effectively bankrupt, Runnymede being served a Best Value Notice, and Surrey County Council admitting it would need to make serious cuts to protect services and increase tax by the maximum allowable in order to have a legal budget."
    },
    {
        "url": "https://fortune.com/2024/01/29/salt-caucus-house-members-states-california-connecticut-are-missing-the-pointand-taxes-politics-congress/",
        "title": "SALT Caucus House members from states like California and Connecticut are missing the point–and could end up raising taxes for everyone next year",
        "description": "That’s a laudable aim, but their method of achieving it is backward. Instead of advocating for the <b>reform</b> of burdensome income taxes in their own states, SALT Caucus members are holding federal tax relief hostage just to undo a 2017 law that capped the ..."
    },
    {
        "url": "https://www.retailgazette.co.uk/blog/2024/01/union-morrisons-angry-pension/",
        "title": "Morrisons: Union ‘angry and disappointed’ by pension changes",
        "description": "Retail trade union Usdaw is &quot;angry and disappointed&quot; with Morrisons&#39; refusal to consider alternative proposals for pension scheme <b>reform</b>. Retail trade union Usdaw is “angry and disappointed” with Morrisons’ refusal to consider alternative proposals ..."
    },
    {
        "url": "https://www.mirror.co.uk/money/royal-mail-latest-letter-deliveries-31963362",
        "title": "Royal Mail latest: Are letter deliveries being cut down to three days a week?",
        "description": "Industry regulator Ofcom has warned the UK postal service risks becoming “unsustainable” without <b>reform</b>, which is why it has looked at potential changes that could be made. However, campaigners have argued that reducing the number of days it delivers ..."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/money/pensions-and-retirement/jeremy-hunt-pension-plan-risk-2870370?ico=in-line_link",
        "title": "Jeremy Hunt’s ‘pot-for-life’ pension plan sparks concern over risk to savers",
        "description": "Advisers, providers and experts have said that other policy changes should take priority, as savers may not be equipped to make adequate decisions under a <b>reform</b> where they are given more flexibility. It comes as the Government consultation closes on ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145863.welfare-reforms-a-disgrace-says-cleric/",
        "title": "Welfare reforms &#39;a disgrace&#39; says cleric",
        "description": "ONE of Britain&#39;s most senior Catholic figures has criticised the Government&#39;s welfare <b>reform</b> programme as a &quot;disgrace&quot; that is driving people to destitution. In one of the most strongly worded attacks yet by a senior church figure, Vincent Nichols ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145602.unite-bosses-back-labour-plans-reform-unions-link/",
        "title": "Unite bosses back Labour plans to <b>reform</b> unions link",
        "description": "Leaders of Unite have backed plans to <b>reform</b> the historic link between Labour and the unions. The executive of Unite held a special meeting to discuss a paper drawn up for Labour leader Ed Miliband by Lord Collins, a former union and party official."
    }
]