[
    {
        "url": "https://www.newsday.com/news/nation/Vatican-Germany-reform-synod-r39519",
        "title": "German bishops to head to Rome after Vatican demands they scrap a vote on contentious lay council",
        "description": "A delegation of German bishops is expected in Rome soon after the Vatican insisted they scrap a planned vote on a controversial proposal to let laypeople participate in a decision-making council alongside bishops."
    },
    {
        "url": "https://news.sky.com/story/labour-lead-grows-in-sea-wall-constituencies-polling-shows-13079229",
        "title": "Labour lead grows in &#39;sea wall&#39; constituencies, polling shows",
        "description": "Research seen by Sky News suggests Sir Keir Starmer&#39;s party is ahead of the Conservatives in a swathe of coastal constituencies in England and Wales."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/wales-next-first-minister-candidates-28695735",
        "title": "Wales&#39; next First Minister: Candidates stand firm on 20mph limits and farming consultation",
        "description": "Voting is open in the race to become the next leader of Welsh Labour when Mark Drakeford stands down in March. It is between the economy minister, Vaughan Gething, and education minister, Jeremy Miles. Voting is open for Labour members and those in affiliated groups, and the result will be announced on March 16."
    },
    {
        "url": "https://www.thesun.ie/news/12273493/rte-catherine-martin-defends-handling-exit-package-untenable/",
        "title": "Defiant Martin defends handling of ‘very difficult’ RTE exit pay saga as minsters give backing amid ‘untenable’ calls",
        "description": "MEDIA Minister Catherine Martin has defended her handling of the latest crisis to engulf RTE, which led to Siun Ni Raghallaigh resigning as the chairwoman of the network’s board. Minister Martin,"
    },
    {
        "url": "https://www.ft.com/content/820a4c91-675b-4000-a70b-940002e99ddb",
        "title": "Rishi Sunak touts ‘green shoots’ of UK economic recovery ahead of Budget",
        "description": "Sunak and chancellor Jeremy Hunt believe voters are starting to see evidence of a recovery, with real wages rising and unemployment rates below 4 per cent. Hunt is putting the finishing touches to the main measures he intends to put into his Budget on March 6, which he hopes to show voters a clear path to a brighter future."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24140857.sunak-backs-farmers-protesting-welsh-government-reform/",
        "title": "Sunak backs farmers protesting against Welsh Government <b>reform</b>",
        "description": "RISHI Sunak has offered his support to protesting farmers in Wales. Farmers across Wales have objected to the Welsh Labour government’s proposals to change farming subsidies to require more land to be set aside for environmental schemes."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/23/reform-raise-40p-income-tax-threshold-70k/",
        "title": "<b>Reform</b> would raise 40p income tax threshold to £70k",
        "description": "Draft manifesto unveiled by party leader Richard Tice piles pressure on Chancellor to go further with tax cuts in spring Budget"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/23/reform-uk-to-unveil-new-policies-and-election-candidates-at-doncaster-rally",
        "title": "<b>Reform</b> UK to unveil new policies and election candidates at Doncaster rally",
        "description": "Far-right party is trying to capitalise on third place finishes in recent byelections and is cleaning up social media histories of prospective MPs"
    },
    {
        "url": "https://www.thenational.scot/politics/24138657.get-voters-engaged-not-local-authority-reform/",
        "title": "How do we get voters more engaged, if not with local authority <b>reform</b>?",
        "description": "Any reporter or newspaper that steps out of line, questions just a little “too near the bone” a particular incident, will find themselves on the receiving end of a charge of “bringing the game into disrepute” by the very officials who are above and beyond question or criticism."
    },
    {
        "url": "https://inews.co.uk/news/rebel-tory-mp-rental-reforms-2921737?ico=most_popular",
        "title": "Rebel Tory MPs may force renters’ reforms to be put ‘on ice’",
        "description": "The Government is considering putting on hold radical rental reforms if concessions fail to appease the nearly 50 Tory MPs opposed to proposed rules"
    },
    {
        "url": "https://www.accountingweb.co.uk/tax/hmrc-policy/hmrc-targets-unrepresented-in-basis-period-reform",
        "title": "HMRC targets unrepresented in basis period <b>reform</b>",
        "description": "Unrepresented sole traders and partnerships with a year-end other than 31 March or 5 April could have a surprise landing on their doormats in the next"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-council-looks-cut-172-28689707",
        "title": "Glasgow council looks to cut 172 teaching posts at primary and secondary schools",
        "description": "Education service reform was included in a budget passed last week, as the city faces a £107m budget blackhole over three years."
    }
]