[
    {
        "url": "https://uk.news.yahoo.com/5-things-know-senate-border-224759240.html",
        "title": "5 things to know about the Senate border deal",
        "description": "That population has been at the center of the immigration <b>reform</b> conversation for decades. The last true comprehensive immigration <b>reform</b> bill in 1986 is best known for its amnesty provisions that prompted about 3,000,000 people to apply for permanent ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-mps-government-liz-truss-boris-johnson-b1137283.html",
        "title": "Labour pushes Government to change rules for ministers’ severance payouts",
        "description": "Shadow attorney general Emily Thornberry will seek to force a Commons vote on reforming ministerial severance payments (Peter Byrne/PA) Labour will seek to <b>reform</b> the rules for payouts when ministers leave office after it emerged nearly £1 million was ..."
    },
    {
        "url": "https://uk.news.yahoo.com/germanys-scholz-dismisses-corporate-tax-210932941.html",
        "title": "Germany&#39;s Scholz dismisses new corporate tax relief ideas",
        "description": "German Chancellor Olaf Scholz on Monday declined to consider corporate tax reform ideas floated by his ministers to revive the economy, saying the focus should instead on finally passing an existing draft law aiming to offer companies fiscal relief."
    },
    {
        "url": "https://www.thetimes.co.uk/article/stop-stumbling-over-sick-pay-reform-d68md0pbk",
        "title": "Stop stumbling over sick pay <b>reform</b>",
        "description": "You look up your workplace’s sick pay policy and find that you only get statutory sick pay (SSP), just £109 a week. Against the doctor’s advice, you return to work early, the stitches still fresh and your injuries unhealed."
    },
    {
        "url": "https://www.thedrum.com/tv/video/best-for-britains-naomi-smith-on-modern-campaigns-social-media-shifts-and-the-urgency-of-electoral-reform",
        "title": "Best for Britain&#39;s Naomi Smith on modern campaigns, social media shifts, and the urgency of electoral <b>reform</b>",
        "description": "From her corporate career to leading Best for Britain, Naomi discusses tackling the aftermath of the Brexit referendum and Rishi Sunak&#39;s surprising ranking in an eye-opening Sunday Times Poll"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/liz-truss-ally-pulls-out-popular-conservatives-launch/",
        "title": "Truss ally pulls out of Popular Conservatives group launch at last minute",
        "description": "He has suggested that Richard Tice, who leads the <b>Reform</b> party Mr Farage co-founded, held broadly similar views to Tories including Ms Truss. Sir Simon Clarke, a former housing secretary, was removed from the Popular Conservatives launch event last month ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/05/fix-crumbling-nhs-doctors-reform-wes-streeting",
        "title": "How to fix Britain’s crumbling NHS? Whatever you do, don’t ask a doctor",
        "description": "My conversations with senior staff tell me this: only radical <b>reform</b> will work. If he takes control, Wes Streeting must be brave I recently asked two wise doctors, senior in their profession, what was wrong with today’s NHS. Was it money? Was it ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24099212.yousaf-facing-snp-backbench-rebellion-justice-reforms/",
        "title": "Yousaf facing SNP backbench rebellion over justice reforms",
        "description": "HUMZA Yousaf is facing a SNP backbench rebellion over landmark reforms on how sexual offences are prosecuted- in Scotland . Former Cabinet minister Fergus Ewing revealed he will vote against the legislation if a controversial proposal to run a juryless trials pilot for rape cases remains in the plans."
    },
    {
        "url": "https://www.thetimes.co.uk/article/5f8c4589-a45c-4a8c-bfd5-f417f892e74a?shareToken=f52e7d3eb46651c0210adda12566dd41",
        "title": "Keir Starmer promises patient health records in one place under Labour",
        "description": "“Yes, we want to get behind this proposal,” he said. “I think it’s a very important <b>reform</b> that we need to make. It will be part of a package of reforms because the NHS is on its knees under this government, and it is unforgivable to take the NHS ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/12-arrested-greece-police-remove-195623798.html",
        "title": "12 arrested in Greece as police remove students blocking exams over a private university bill",
        "description": "It argues that the <b>reform</b> would prevent skilled people from leaving to study abroad and make higher education more relevant to the labor market. Opponents say the proposed law would undermine state universities — which provide free tuition — and ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863148/tory-members-fury-survey-rishi-sunak",
        "title": "&#39;Look what you&#39;ve done!&#39; Angry Tories rage MPs have destroyed party in poll",
        "description": "In an earlier piece, Express.co.uk laid out the findings which revealed 50.48 percent of members would vote for <b>Reform</b> UK with 15.95 percent already defecting to the party led by Richard Tice. Meanwhile, 90.18 percent said they would not campaign for the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/labour-mps-government-liz-truss-boris-johnson-b2491089.html",
        "title": "Labour pushes Government to change rules for ministers’ severance payouts",
        "description": "Labour will seek to <b>reform</b> the rules for payouts when ministers leave office after it emerged nearly £1 million was spent during last year’s political chaos. The party will use an Opposition Day debate on Tuesday to present a Bill aiming to change the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082?ico=in-line_link",
        "title": "Tories planning for two back-to-back general elections",
        "description": "They need to grow up. Jill Mortimer [the MP for Hartlepool] is worried because she’s got Richard Tice [the leader of <b>Reform</b>] threatening to stand in her seat and he’ll end up splitting her vote. They all want extra support from the party. People don ..."
    }
]