[
    {
        "url": "https://www.thesun.co.uk/news/25872414/michael-gove-ban-no-fault-evictions/",
        "title": "Michael Gove vows to ban no-fault evictions by next election after 30,000 notices were dished out last year",
        "description": "Landlords dished out 30,230 Section 21 notices – the highest number since 2016. Mr Gove is facing huge pressure to get the Renters <b>Reform</b> Bill through the Commons. Labour and the Lib Dems have accused him of de-prioritising the issue due to pressure from ..."
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/12/australia-politics-live-offshore-detention-richardson-review-home-affairs-clare-o-neil-peter-dutton-anthony-albanese-question-time?topics=ORG%3AABC+Melbourne",
        "title": "Australia politics live: Barnaby Joyce confesses to ‘big mistake’ over Canberra footpath incident",
        "description": "Follow live"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68257375",
        "title": "Wellingborough: Calls for action on gangs at by-election debate",
        "description": "Calls for more visible policing and new initiatives to draw young people away from gangs have been heard in a BBC East Wellingborough by-election discussion. The town, facing a by-election on Thursday, is still haunted by the death of teenager Dylan Holliday, who was stabbed 13 times."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-not-defend-delinquent-nato-194427669.html",
        "title": "Trump would not defend delinquent NATO members",
        "description": "The White House has reacted to comments by former President Donald Trump indicating he would encourage Russia to &quot;do whatever the hell they want&quot; to NATO countries that don&#39;t pay their organizational dues."
    },
    {
        "url": "https://www.thetimes.co.uk/article/new-health-secretary-neil-gray-pledges-to-fix-scotlands-nhs-wfkgcq2j9",
        "title": "New health secretary Neil Gray pledges to fix Scotland’s NHS",
        "description": "Number of patients seeking private care to avoid lengthy waiting lists is unacceptable, says successor to Michael Matheson"
    },
    {
        "url": "https://www.ft.com/content/58a7ddaa-28cd-4950-a53b-f9f52c699dd2",
        "title": "Michael Gove promises to bring in ban on no-fault evictions before election",
        "description": "Levelling-up secretary woos younger voters with pledge to put long-delayed plan in place with investment in court system"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/brexit-uk-economy-cost-damage-b2491585.html",
        "title": "The Brexit bill: £100bn hit to UK exports as toy, medical kit and jewellery sales slump",
        "description": "Businesses that make sporting goods, children’s toys, jewellery and medical goods have struggled the most with the border costs imposed by the UK’s decision to leave the EU"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865534/nigel-farage-house-of-lords-reform-plaid-carmen-smith-comment",
        "title": "Nigel Farage cannot get in the Lords but a 27-year-old Welsh nationalist can",
        "description": "Plaid Cymru activist Carmen Smith has just been nominated as the UK&#39;s youngest peer aged just 27, but does her arrival suggest the Lords is not fit for purpose?"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/michael-gove-government-reform-jeremy-hunt-tories-b1138423.html",
        "title": "Michael Gove promises end to no-fault evictions by next general election",
        "description": "There have been continuous delays to the plan to ban section 21 evictions, first promised by the Tories in 2019."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-scotland-68268593",
        "title": "Watch: NHS must <b>reform</b>, says Scotland&#39;s new health secretary",
        "description": "New Scottish Health Secretary Neil Gray says the NHS must reform, improve and &quot;drive down&quot; waiting times. Mr Gray, who was appointed last week to replace Michael Matheson, told BBC Scotland&#39;s The Sunday Show that it was &quot;unacceptable&quot; so many patients felt they had no choice but to go private."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/farage-could-be-british-ambassador-to-us-even-under-labour/",
        "title": "Farage could be British ambassador to the US, even under a Labour government",
        "description": "Former UKIP leader said he would step up to the plate if asked, suggesting he could be a ‘friend’ to Donald Trump"
    },
    {
        "url": "https://www.lankaweb.com/news/items/2024/02/11/un-chief-urges-reform-of-imf-world-bank-stresses-bricss-role/",
        "title": "UN Chief Urges <b>Reform</b> of IMF, World Bank, Stresses BRICS’s Role",
        "description": "Since they don’t correspond to the power relations and to the global economy as it is today”, he said, it will be very important for those institutions to <b>reform</b> in order to represent today’s global economy, to be truly universal and truly inclusive”."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-sunak-trans-joke-brianna-ghey-2895221?ico=most_read_by_subscribers",
        "title": "Brianna Ghey’s father calls on Sunak to apologise for ‘degrading’ trans ‘joke’",
        "description": "Some Tory MPs have also complained to their whips over the remarks amid calls for Sunak to apologise, i understands. The Tory <b>Reform</b> Group (TRG) of at least a dozen moderate MPs and 10 senior peers said: “This Government has got to stop using the trans ..."
    },
    {
        "url": "https://www.ndtv.com/world-news/france-plans-to-revoke-birthplace-citizenship-in-mayotte-5040017",
        "title": "France Plans To Revoke Birthplace Citizenship In Mayotte",
        "description": "French authorities on Sunday announced a controversial plan to amend the Constitution to revoke birthplace citizenship on the French Indian Ocean island of Mayotte, which has been struggling with social unrest and a crippling migration crisis."
    },
    {
        "url": "https://www.modernghana.com/news/1291838/france-to-revoke-birthright-citizenship-in-oversea.html",
        "title": "France to revoke birthright citizenship in overseas Mayotte to stem immigration",
        "description": "Children born on the French Indian Ocean territory of Mayotte will no longer automatically qualify for citizenship of France, Interior Minister Grald Darmanin announced during a visit to the overseas department on Sunday."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/housing-secretary-no-fault-evictions-general-election-b2494302.html",
        "title": "Michael Gove pledges to end no-fault evictions before general election",
        "description": "The renters reform bill has been delayed multiple times due to opposition in and outside of the Conservative party"
    },
    {
        "url": "https://www.heraldscotland.com/news/24112197.neil-gray-bring-forward-nhs-scotland-reforms-cabinet/?ref=rss",
        "title": "Neil Gray to bring forward NHS Scotland reforms to Cabinet",
        "description": "Scotland’s new Health Secretary has said it will be “challenging” to keep the NHS free at the point of need in years to come."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865486/nigel-farage-politics-return-to-conservative-party",
        "title": "Nigel Farage&#39;s return to politics &#39;could go either way&#39; as &#39;desperate&#39; Tories circle",
        "description": "Nigel Farage made the comments during an interview where he said &quot;desperate&quot; Conservative MPs contact him several times a day."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68267106.amp",
        "title": "No-fault eviction ban by next election, Michael Gove promises",
        "description": "No-fault evictions will be &quot;outlawed&quot; in England by the next general election, Housing Secretary Michael Gove has told the BBC. The Conservatives first promised to end the right of landlords to evict tenants without needing a reason in 2019."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-urged-provide-update-32099363",
        "title": "Humza Yousaf urged to provide update on overhauling role of Lord Advocate",
        "description": "Jack believes the law officer&#39;s dual role is a conflict of interest and is keen to pass legislation at Westminster to assist on any decoupling. The Lord Advocate, who is currently Dorothy Bain, is currently head of the prosecution service and the Government’s top legal adviser."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68261697?at_medium=RSS&at_campaign=KARANGA",
        "title": "NHS Scotland must <b>reform</b> and improve - Neil Gray",
        "description": "The new health secretary says it is &quot;unacceptable&quot; that so many people faced with long waits have gone private."
    },
    {
        "url": "https://www.thenational.scot/news/24112177.neil-gray-pushes-nhs-reform-first-interview-health-secretary/",
        "title": "Neil Gray pushes for NHS <b>reform</b> in first interview as Health Secretary",
        "description": "SCOTLAND’S new Health Secretary Neil Gray has said he will be taking plans for NHS reform to the cabinet in the coming weeks in his"
    }
]