[
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/25/australia-news-live-education-universities-anthony-albanese-peter-dutton-cost-of-living-bushfires?page=with:block-65da6df88f08cb21f92a94e0&filterKeyEvents=false",
        "title": "News live: Labor out to ‘finish’ Gonski education model not break it, Jason Clare says; Australia supports latest strikes on Houthis in Yemen",
        "description": "Follow live"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sadiq-khan-lee-anderson-muslim-racism-b2501956.html",
        "title": "Sadiq Khan calls Tories morally rotten and says PM’s silence on Lee Anderson makes Muslims fair game",
        "description": "London mayor says Islamophobia is tolerated from the top after former Tory deputy chair’s “anti-Muslim” GB News rant"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/donald-trumps-ally-steve-bannon-32205159",
        "title": "Donald Trump’s ally Steve Bannon predicts &#39;nationalist uprising&#39; in UK to install Nigel Farage as PM",
        "description": "Steve Bannon, who was Trump’s chief strategist in the White House, thinks Keir Starmer&#39;s Labour will crush the Tories - but Nigel Farage&#39;s Reform party will turn into &#39;a populist party, just like MAGA&#39; and take over the Conservative"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/24/bbc-should-be-proud-be-progressive-tim-davie/",
        "title": "BBC should be proud to be progressive, director general told staff",
        "description": "Richard Tice, the leader of <b>Reform</b> UK, said: “Tim Davie’s comments confirm how deeply embedded Left-wing ideology is at the BBC. These comments prove the BBC is not fit for purpose and should be immediately defunded.” Robin Aitken, a former senior ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/23/suburban-women-60-could-decide-next-election-think-tank/",
        "title": "Suburban women in their sixties could decide the next election",
        "description": "The analysis, titled Behind the Voting Intention, also found those who have abandoned the Tories in favour of <b>Reform</b> UK are highly unlikely to return to Rishi Sunak’s party. Twenty-three per cent of those surveyed voted Labour and plan to do so again ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/24/lee-anderson-whip-suspended-sadiq-khan-islamists/",
        "title": "Farage woos Anderson after Tory suspended over Khan comments",
        "description": "Lee Anderson has had the Conservative whip withdrawn after claiming that “Islamists” have “got control” of Sadiq Khan. On Saturday afternoon, a spokesman for the Chief Whip Simon Hart said: “Following his refusal to apologise for comments made yesterday, the Chief Whip has suspended the Conservative whip from Lee Anderson MP.”"
    },
    {
        "url": "https://www.asianimage.co.uk/news/24142342.reform-leader-tice-wants-legistlate-supposed-sharia-law-threats/",
        "title": "<b>Reform</b> leader Tice wants to legistlate supposed Sharia Law threats",
        "description": "Reform UK leader Richard Tice said the country is at the “Everest base camp of sectarian politics” as he said political leaders, the establishment and the police were all in fear of extremists."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/24/rural-right-wing-voters-yougov-poll-conservatives-reform-uk/",
        "title": "Rural Right-wing voters abandon Tories in huge switch to <b>Reform</b> UK",
        "description": "Former Conservative voters living in the countryside are shifting allegiance to Richard Tice’s party, suggests poll by Labour think tank"
    },
    {
        "url": "https://www.express.co.uk/news/world/1870446/uk-pulls-out-of-european-union-energy-charter-treaty",
        "title": "UK forced to pull out of major energy deal after European Union infighting",
        "description": "The UK government says it is withdrawing from the controversial Energy Charter Treaty after efforts to modernise it ended in stalemate."
    },
    {
        "url": "https://www.thetimes.co.uk/article/reform-uk-rally-manifesto-policies-richard-tice-f7ww2svj2?ilc=timesradio:morefromthetimes",
        "title": "I thought <b>Reform</b> UK’s rally would be a circus. It was more of a wake",
        "description": "It’s the first sunny Saturday of the year at Doncaster racecourse as Richard Tice takes to the stage at <b>Reform</b> UK’s spring conference. The party leader is framed by two vast portraits of his own face, smiling beatifically against a Union flag backdrop."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nigel-farage-says-lee-anderson-32203795",
        "title": "Nigel Farage says Lee Anderson is welcome to join <b>Reform</b> UK after he&#39;s suspended by Tories",
        "description": "Lee Anderson could be tempted to join Nigel Farage&#39;s party, formerly known as the Brexit Party, after he was suspended by the Conservatives over a slur on Sadiq Khan"
    },
    {
        "url": "https://www.malaymail.com/news/malaysia/2024/02/24/bersih-to-demonstrate-near-parliament-for-reform-demands/119796",
        "title": "Bersih to demonstrate near Parliament for <b>reform</b> demands",
        "description": "KUALA LUMPUR, Feb 24 — The Coalition for Clean and Fair Elections (Bersih) today announced a gathering near Parliament this Tuesday to push the political coalitions in power to deliver on previously promised demands. In a post on Twitter, the electoral ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/reform-uk-rally-manifesto-policies-richard-tice-f7ww2svj2",
        "title": "I thought <b>Reform</b>’s rally would be a circus. It was more of a wake",
        "description": "With a new slogan ‘Ready to SAVE Britain’, the party is luring disillusioned voters on both sides of the political fence. So what actually is their manifesto?"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13121385/lee-anderson-suspended-carol-vorderman-conservatives-sadiq-khan.html",
        "title": "Carol Vorderman mocks Lee Anderson as &#39;30p Lee&#39; after he was suspended for refusing to apologise over &#39;Islamophobic&#39; comments about Sadiq Khan - as she and others wonder if he ...",
        "description": "The former Countdown and BBC radio presenter hit out at Anderson as &#39;30p Lee&#39; - after his comments suggesting people in poverty should be able to make meals costing that much - on Saturday."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/24/nigel-farage-reform-uk-conference-doncaster-party",
        "title": "‘When’s Nigel coming back?’ Farage absence looms large over <b>Reform</b> UK conference",
        "description": "In Doncaster, at the insurgent rightwing party’s ‘biggest ever’ gathering, one absence is on everybody’ lips"
    },
    {
        "url": "https://leftfootforward.org/2024/02/reform-uk-existential-threat-to-the-tories-or-here-today-gone-tomorrow/",
        "title": "<b>Reform</b> UK: Existential threat to the Tories or here today, gone tomorrow?",
        "description": "Emboldened by two byelections successes, Reform UK seeks to capitalise on voter disenchantment with the ruling party. But how much of a threat are they to the Tories?"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-broken-britain-reform-uk-manifesto-2924690",
        "title": "Tories have ‘broken Britain’, says <b>Reform</b> UK leader as he unveils manifesto",
        "description": "Richard Tice promised his Reform UK party would &#39;save Britain&#39;, as he hit out against &#39;sinking Sunak&#39; and &#39;Starmageddon&#39;"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/will-lee-anderson-join-reform-conservative-whip-suspended-369287/",
        "title": "Lee Anderson suspended by Tories – will he defect to <b>Reform</b>?",
        "description": "Where does Lee Anderson&#39;s political future lie? After he had the whip suspended on Saturday, some feel a defection is on the cards."
    },
    {
        "url": "https://uk.news.yahoo.com/reform-uk-piles-fresh-pressure-144424111.html",
        "title": "<b>Reform</b> UK piles fresh pressure on Rishi Sunak with radical promises on tax and immigration",
        "description": "Labour and Tory governments have broken promise after promise... they have destroyed trust in our democracy and let down the British people.’"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870400/nigel-farage-lee-anderson-suspended-reform",
        "title": "Nigel Farage calls on &#39;cancelled&#39; Lee Anderson to join <b>Reform</b> and destroy the Tories",
        "description": "EXCLUSIVE: Nigel Farage has told Lee Anderson he should quit the Tories and join Reform UK after being dramatically suspended."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/24141946.reform-leader-tice-says-plans-fundamental-nhs-reforms-not-privatisation/",
        "title": "<b>Reform</b> leader Tice says plans for fundamental NHS reforms are not privatisation",
        "description": "Richard Tice told delegates at the party’s spring conference his objective was to get waiting lists down to zero."
    },
    {
        "url": "https://www.heraldscotland.com/news/12298212.spare-a-thought-for-the-farmers/",
        "title": "Spare a thought for the farmers",
        "description": "AMID all the assessments of the Labour Government&#39;s first year in office, spare a thought for the farmers. The last 12 months have been"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13120999/Reform-Party-raise-40p-income-tax-threshold-70-000-says-leader-Richard-Tice-unveils-tax-slashing-draft-election-manifesto.html",
        "title": "<b>Reform</b> Party would raise 40p income tax threshold to £70,000 says leader Richard Tice as he unveils &#39;tax slashing&#39; draft election manifesto",
        "description": "The draft election manifesto was unveiled today, with Mr Tice stating that he promises to reverse Rishi Sunak&#39;s stealth tax."
    }
]