[
    {
        "url": "https://www.thesun.co.uk/news/25704604/nigel-farage-general-election-reform-uk/",
        "title": "Nigel Farage ‘not getting involved in general election battle for <b>Reform</b>’",
        "description": "NIGEL Farage has told colleagues he is not getting involved in the general election battle for Reform UK, sources told The Sun on Sunday. The Brexit supremo is thought to have privately decided to"
    },
    {
        "url": "https://www.thesun.co.uk/news/25702086/tony-parsons-labour-crime-sadiq-khan/",
        "title": "Labour will be even worse than the Tories at cracking down on crime – just look at clueless Sadiq Khan",
        "description": "WHEN a young mother, 31, and her daughters, aged eight and three, were taken to hospital after a chemical substance was thrown at them, the appalling attack was described on the BBC’s breaking"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "Labour ditches radical reforms as it prepares ‘bombproof’ election manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/anyone-but-peter-bone-voters-turn-to-labour-and-reform-uk-as-wellingborough-byelection-nears",
        "title": "‘Anyone but Peter Bone’: voters turn to Labour and <b>Reform</b> UK as Wellingborough byelection nears",
        "description": "While Labour is favourite to snatch the Northamptonshire seat from the Tories, Sunak’s party faces a battle even to take second place, if local opinion is anything to go by"
    },
    {
        "url": "https://www.independent.com.mt/articles/2024-02-03/local-news/278-rehabilitated-themselves-after-drug-court-judgment-150-did-not-Justice-Minister-6736258324",
        "title": "278 rehabilitated themselves after drug court judgment, 150 did not - Justice Minister",
        "description": "The Minister for Justice and Reform of the Construction Sector, Jonathan Attard, said that since the introduction of the Drug Court in 2015, 278 individuals have successfully completed the treatment"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082",
        "title": "Tories planning for two back-to-back general elections",
        "description": "The Conservatives are preparing for the possibility of a tight election result leading to a second being called quickly afterwards"
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/new-look-board-announced-by-scottish-land-commission/",
        "title": "New-look board announced by Scottish Land Commission",
        "description": "Former MSP and SNP President, Michael Russell, has joined the Scottish Land Commission as Chair The Scottish Government announced the appointment of the new Chair and two other new members to the"
    },
    {
        "url": "https://inews.co.uk/opinion/david-cameron-no-threat-rishi-sunak-2884522?ico=best_of_opinion",
        "title": "David Cameron is no threat to Rishi Sunak",
        "description": "In the latest Sisyphean effort to stabilise his government, Rishi Sunak abandoned his pledge to be the change agent from “the 30-year political status quo” by signing up the man who had been prime minister for seven of those years."
    },
    {
        "url": "https://metro.co.uk/2024/02/03/popular-tv-presenter-tells-viewers-joining-ukrainian-army-air-20218620/",
        "title": "Moment TV host quits live on air and declares ‘I’m off to fight Putin’",
        "description": "At the end of his news programme Window and Facts, Orest Drymalovsky, 29, told ICTV viewers: ‘That’s all for now. And for me it’s a personal finish today. This was my last broadcast before I am mobilised to the Armed Forces of Ukraine .’"
    },
    {
        "url": "https://www.belfastlive.co.uk/news/what-stormont-return-mean-derry-28557496",
        "title": "What will Stormont return mean for Derry? Sinn Fein and SDLP set out their stall",
        "description": "Infrastructure, jobs, university provision and cross border links high on agenda for two largest parties in Derry"
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12754537.crofters-landowners-join-forces-reform-bill/",
        "title": "Crofters and landowners join forces against <b>reform</b> Bill",
        "description": "Scotland&#39;s crofters and landowners, regularly at odds throughout history, have joined forces in a &quot;landmark alliance&quot; to oppose the Scottish Government&#39;s crofting <b>reform</b> Bill. The Scottish Crofting Foundation (SCF) and the Scottish Rural Property and ..."
    },
    {
        "url": "https://ca.news.yahoo.com/wales-political-system-poses-great-220015343.html",
        "title": "New Wales political system poses great danger - Wigley",
        "description": "A reform of Wales&#39; political system poses &quot;a very great danger&quot;, a former leader of Plaid Cymru has said. Dafydd Wigley was reacting to plans to bring in a so-called closed list PR system for Cardiff Bay from 2026. The plans were approved in principle by the Senedd this week."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-04/sibling-sexual-abused-survivor-laura-rowe-nt-supreme-court/103396840",
        "title": "Childhood sexual abuse survivor Laura Rowe speaks out following NT Supreme Court trial of brother Kent",
        "description": "Child sexual abuse survivor Laura Rowe speaks out following the conviction of her brother. She says the justice system needs to be overhauled to make it easier for others to navigate."
    },
    {
        "url": "https://www.thejournal.ie/medicines-ip-protection-irish-meps-6287670-Feb2024/",
        "title": "Government parties&#39; MEPs pick opposing sides in Brussels row with big pharma over drug costs",
        "description": "MEPS FROM GOVERNMENT coalition parties have taken opposing sides in a row between Brussels and big pharma over plans to cut the price of medicines by reducing patent protection on new drugs, boosting access to cheaper generic medicines."
    },
    {
        "url": "https://english.almayadeen.net/news/politics/argentina-s-lower-chamber-approves-milei-s-reform-bill",
        "title": "Argentina&#39;s lower chamber approves Milei&#39;s <b>reform</b> bill",
        "description": "The bill was approved in a vote of 144 in favor and 109 against, moving it to the next stage of voting in the Senate."
    },
    {
        "url": "https://news.yahoo.com/renewed-calls-pass-rail-safety-185506424.html",
        "title": "Renewed calls to pass rail safety <b>reform</b> one year after East Palestine train derailment",
        "description": "Shortly after the crash Senators from Ohio and Pennsylvania, both Democrats and Republicans, introduced a new bill to boost safety measures for trains carrying dangerous materials. It would create requirements for detectors that take the temperature of each railcar wheel as it passes. This was an issue in the East Palestine crash."
    },
    {
        "url": "https://www.scmp.com/news/china/military/article/3250840/chinas-fujian-province-steps-defence-mobilisation-reforms-bid-improve-war-readiness?campaign=3250840&module=perpetual_scroll_0&pgtype=article",
        "title": "China’s Fujian province steps up defence mobilisation reforms to improve war readiness",
        "description": "The southeastern province merged its military-civil fusion office, which is tasked with integrating civilian resources as part of China’s military build-up, with its defence mobilisation department in a structural <b>reform</b> this week, according to the ..."
    },
    {
        "url": "https://www.salon.com/2024/02/03/remember-the-rules-liberals-only-the-right-gets-to-mock-america/",
        "title": "Remember the rules, liberals: Only the right gets to mock America",
        "description": "“Take a step back, be honest,” Dimon implored Americans without a hint of self-consciousness, during a Jan. 17 interview with CNBC from the World Economic Forum in Davos, Switzerland. “Trump was kind of right about NATO,&quot; he continued, &quot;kind of right about immigration. Tax reform worked.”"
    },
    {
        "url": "https://inews.co.uk/news/civil-service-richard-tice-reform-2886189",
        "title": "‘No-one, especially the Tories, is laughing at us now,’ says <b>Reform</b> leader",
        "description": "In an interview with i, the Reform Party leader says his &#39;medium-term&#39; plan to take the Tories&#39; place as the threat from the right to Labour"
    },
    {
        "url": "https://www.wokingnewsandmail.co.uk/news/woking-united-reform-church-achieves-dream-of-being-solar-powered-663754",
        "title": "Woking United <b>Reform</b> Church achieves dream of being solar powered",
        "description": "A Woking church has achieved its dream of powering its entire building using electricity generated by the sun, following the installation of 134 solar roof panels and eight large storage batteries."
    },
    {
        "url": "https://www.heraldscotland.com/news/12008873.change-is-big-in-japan-cautious-optimism-is-emerging-for-1999/",
        "title": "Change is big in Japan Cautious optimism is emerging for 1999",
        "description": "IF they plan to hang on to their remaining credibility, Japan&#39;s lawmakers should avoid bold resolutions to turn the economy round in 1999. The"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862293/reform-uk-tories-barnsley-rishi-sunak",
        "title": "&#39;We are talking to MPs&#39;: Dispirited Tories ready to jump ship, says <b>Reform</b> UK recruiter",
        "description": "EXCLUSIVE: David White says he is getting calls from everyone from parish councillors to mayors of district and borough councils."
    },
    {
        "url": "https://farming.co.uk/news/vmd-new-plan-published-to-reform-veterinary-medicines-regulations",
        "title": "Farming News - VMD: New plan published to <b>reform</b> Veterinary Medicines Regulations",
        "description": "Regulations to be made more effective and maintain the UK as an attractive place to develop and market veterinary medicines. Further measures to help tackle antimicrobial resistance, building on the success government and industry have achieved. Plans ..."
    },
    {
        "url": "https://www.politico.eu/article/uk-election-2024-saving-conservatism-center-must-hold/",
        "title": "Saving Conservatism: The center must hold",
        "description": "As the specter of populism now stretches across the West, it’s diminishing our collective ability to check the advance of authoritarianism."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13040171/reform-uk-donation-crispin-odey-sexual-misconduct.html",
        "title": "<b>Reform</b> UK admits it accepted a £10,000 donation from Tory donor Crispin Odey who is facing sexual misconduct claims",
        "description": "Crispin Odey (left) gave money to Richard Tice&#39;s (right) party last August - but Reform initially logged his donation as coming from a city think tank the IIMI."
    },
    {
        "url": "https://uk.news.yahoo.com/argentine-presidents-reforms-pass-first-231847122.html",
        "title": "Argentine president&#39;s reforms pass first test in Congress",
        "description": "Argentine lawmakers took a first step Friday toward approving President Javier Milei&#39;s sweeping economic, social and political reform package, which has sparked angry opposition protests.But opposition deputy Leandro Santoro pointed to the economic and social crisis of 2001 as an example of the risks of free-market reforms."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/02/argentinas-lower-house-votes-for-javier-mileis-sweeping-reform-package",
        "title": "Argentina’s lower house votes for Javier Milei’s sweeping <b>reform</b> package",
        "description": "Far-right president’s measures aimed at tackling the country’s severe economic problems passed easily despite public protests"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/education-secretary-department-for-education-reading-andrew-matthews-house-of-commons-b1135375.html",
        "title": "Ofsted ‘must make changes in areas highlighted by Ruth Perry inquest’",
        "description": "“Ofsted must ensure it continues to listen and <b>reform</b> through 2024.” Aside from reforming the single-word judgement and improving support for school leaders, the Education Committee also made recommendations on “inadequate” judgements based on ..."
    },
    {
        "url": "https://www.scmp.com/news/china/military/article/3250840/chinas-fujian-province-steps-defence-mobilisation-reforms-bid-improve-war-readiness",
        "title": "China’s Fujian province steps up defence mobilisation reforms in bid to improve war readiness",
        "description": "The southeastern province merges departments as part of nationwide push to boost coordination between armed forces and civilians."
    },
    {
        "url": "https://www.truebluela.com/2024/2/3/23648034/mlb-economic-reform-committee-sham-athletics-mets-padres-dodgers",
        "title": "The MLB economic <b>reform</b> committee is a sham",
        "description": "What a difference 90 days made. On February 19, 2023, the League announced the creation of an Economic <b>Reform</b> Committee. Commissioner Manfred said that the committee, made up entirely of owners, was formed to address several issues: “It came out of a ..."
    },
    {
        "url": "https://www.brisbanetimes.com.au/politics/nsw/how-votes-trumped-values-inside-the-minns-government-s-factions-20240130-p5f15c.html",
        "title": "How votes trumped values: Inside the Minns government’s factions",
        "description": "Senior Labor cabinet ministers Jo Haylen (left) and Rose Jackson are both long-time advocates for drug <b>reform</b>.Credit: James Brickwood As one senior Labor source said of the grouping: “The coalition that eventually amassed around Minns were people who ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/03/popular-tv-presenter-tells-viewers-joining-ukrainian-army-air-20218620/?ico=trending-module_category_news_item-4",
        "title": "Moment TV host quits live on air and declares ‘I’m off to fight Putin’",
        "description": "Ukraine is seeking to <b>reform</b> its mobilisation laws to enable more people to be called up to the army. Mr Drymalovsky said: ‘We have no right to enjoy a peaceful life while the best give theirs for it. ‘Believe in the Armed Forces of Ukraine ..."
    }
]