[
    {
        "url": "https://www.jpost.com/opinion/article-787243",
        "title": "We must renew the social contract - opinion",
        "description": "When the war began, it seemed that the different sectors in Israeli society were finally uniting, but as time has gone on that optimism is fading."
    },
    {
        "url": "https://www.huffpost.com/entry/chiefs-players-gun-law-reform_n_65ce28fae4b02493f349186f",
        "title": "Chiefs Players Call For Gun <b>Reform</b> After Super Bowl Parade Shooting",
        "description": "Some Kansas City Chiefs players demanded more gun control Wednesday after a mass shooting darkened the team’s Super Bowl victory parade in Kansas City, Missouri. At least one attendee died and at least 21 were wounded while three suspects were taken into custody."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/nigel-farage-threatens-scupper-natwest-share-sale-culture/",
        "title": "Nigel Farage threatens to scupper NatWest share sale unless it changes culture",
        "description": "Reform UK president says he will make life ‘very, very difficult’ for the bank’s incoming boss unless he receives a ‘fuller apology’"
    },
    {
        "url": "https://www.dailymail.co.uk/yourmoney/401k/article-13087897/401K-student-loan-repayments-match-biden.html",
        "title": "Can YOU boost your 401(K) by paying off your student loan? New Biden scheme offers generous retirement perk to attract Gen Z and millenial workers - these companies offer it",
        "description": "Student loan borrowers may now be able to have their monthly debt payments matched into their 401(K) as part of a sweeping reform of the system."
    },
    {
        "url": "https://uk.style.yahoo.com/germany-film-funding-reform-set-195409560.html",
        "title": "Germany’s Film Funding <b>Reform</b> Set to Boost Industry With Tax Incentive",
        "description": "Germany’s film and TV sectors are eagerly awaiting the biggest reform in the history of German film funding this year, and while the government of Chancellor Olaf Scholz struggles to navigate a major budget crisis,"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/councils-slam-broken-system-theyre-28642893",
        "title": "Durham County Council slams &#39;broken&#39; system as &#39;difficult decisions&#39; having to be made",
        "description": "Councils have warned that the level of new funding will only prevent a financial crisis in the short term and have called for a long-term settlement alongside reform of the finance system."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24123356.north-east-labour-candidate-kim-mcguinness-accused-racial-slur/",
        "title": "North East Labour candidate Kim McGuinness accused of ‘racial slur’",
        "description": "Labour’s candidate for North East mayor Kim McGuinness has been accused of using a “racial slur” in a historic social media post."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-north-east-mayor-candidate-28642025",
        "title": "Labour North East mayor candidate Kim McGuinness accused of using &#39;racial slur&#39; in historic social media post",
        "description": "Northumbria Police and Crime Commissioner Kim McGuinness, who is standing to be North East mayor, has apologised for an &quot;offensive&quot; online remark made in 2011"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/analysis-the-lack-of-appetite-for-reform-among-stormonts-big-two-means-change-is-some-way-off-FJ6FDU76BRHJZHOUEYAWTG4DVA/",
        "title": "Analysis: The lack of appetite for <b>reform</b> among Stormont’s big two means change is some way off",
        "description": "Relatively new legislation means there’ll be a six month cooling-off period rather than immediate collapse, however, once that expires there’ll be an election or we’ll be back to the sort of ‘indirect rule’ scenario that prevailed from February 2020 to earlier this month."
    },
    {
        "url": "https://inews.co.uk/news/politics/how-surviving-tory-big-beasts-opposition-2903719",
        "title": "How a Tory opposition could look after the general election",
        "description": "Rishi Sunak is hoping the polls narrow before the election, but if they don&#39;t the Tories are facing a spell in opposition"
    },
    {
        "url": "https://bylinetimes.com/2024/02/15/another-new-anti-immigration-pressure-group-is-launched-from-tufton-street-and-met-with-reams-of-media-coverage/",
        "title": "Another New Anti-Immigration Pressure Group is Launched from Tufton Street and Met with Reams of Media Coverage",
        "description": "The mysterious case of a tiny new ‘think tank’ launching – and being immediately granted gullible coverage from right-wing papers"
    },
    {
        "url": "https://www.itv.com/news/granada/2024-02-15/thousands-back-esther-gheys-calls-for-online-reform",
        "title": "Brianna Ghey&#39;s mother receives thousands of messages of support in calls for online <b>reform</b>",
        "description": "Esther Ghey said Brianna&#39;s tragic death was a &quot;stark reminder of the dangers that unrestricted technology use can pose to our children&quot;. | ITV News Granada"
    },
    {
        "url": "https://www.standard.co.uk/business/build-to-rent-housing-michael-gove-john-lewis-brownfield-b1139422.html",
        "title": "We must unlock a build-to-rent revolution in London to help house our young people",
        "description": "Planning reform is urgently needed before Michael Gove’s stark warning about the threat to democracy comes true"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088625/Stop-Boats-stop-Reform-UK-Poll-finds-immigration-priority-insurgent-partys-backers-Rishi-Sunak-faces-fifth-2019-Tory-voters-defecting-Nigel-Farage-outfit.html",
        "title": "&#39;Stop the Boats&#39; to stop <b>Reform</b> UK? Poll finds immigration is top priority for insurgent party&#39;s backers - as Rishi Sunak faces a fifth of 2019 Tory voters defecting to Nigel ...",
        "description": "A YouGov survey of more than 4,000 people revealed 19 per cent of those who previously supported the Tories would switch to the party founded by Nigel Farage."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/call-for-reform-to-prevent-future-stormont-powersharing-collapses-SVBIJKTJI5DURO5TPQ6DGFMVB4/",
        "title": "Call for <b>reform</b> to prevent future Stormont powersharing collapses",
        "description": "Micheal Martin spoke of his desire to see changes to the Stormont system as he addressed the Dail on Wednesday."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/dup-says-ireland-needs-training-on-belfast-agreement-after-michael-martin-calls-for-stormont-reform-4519254",
        "title": "DUP says Ireland needs ‘training’ on Belfast Agreement after Michael Martin calls for Stormont <b>reform</b>",
        "description": "It follows comments from Ireland’s deputy Prime Minister that &quot;realities of today are not those of 1998 and that the time has come for reform&quot;."
    },
    {
        "url": "https://www.heraldscotland.com/news/24122899.scotlands-mutant-tax-system-needs-reform/?ref=rss",
        "title": "Scotland&#39;s mutant tax system needs <b>reform</b>",
        "description": "Who would design an income tax system like Scotland’s from scratch? South of the border, there are three bands and a personal allowance."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-boasts-protecting-second-amendment-161508446.html",
        "title": "Trump boasts about protecting Second Amendment – hours after Kansas City parade shooting",
        "description": "Republican front-runner boasted about protecting Second Amendment hours after at least one victim was killed and dozens more injured in shooting at Super Bowl Parade"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/first-minister-rejects-charge-executive-unwilling-to-make-hard-calls-on-finance-110616/",
        "title": "First Minister rejects charge Executive unwilling to make hard calls on finance",
        "description": "Michelle O’Neill said the settlement offered by the Treasury did not go far enough to put Northern Ireland on a stable financial footing."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1866832/Reform-UK-tory-switchers-one-in-five?ref=todayheadlines.live",
        "title": "<b>Reform</b> UK popularity surges with 2019 Tory voters",
        "description": "One in five 2019 Conservative voters now plan on voting for Richard Tice’s <b>Reform</b> Party, according to a new poll signalling growing support for the right-wing party. 19 percent saying they intend to back <b>Reform</b> represents an increase on similar polling ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/first-minister-uk-government-northern-ireland-government-stormont-b1139427.html",
        "title": "First Minister rejects charge Executive unwilling to make hard calls on finance",
        "description": "Michelle O’Neill said the settlement offered by the Treasury did not go far enough to put Northern Ireland on a stable financial footing."
    },
    {
        "url": "https://www.telegraph.co.uk/us/news/2024/02/15/kansas-city-attack-super-bowl-parade-travis-kelce/",
        "title": "Travis Kelce ‘heartbroken’ over Kansas City shooting as police arrest three suspects",
        "description": "Three have been arrested in relation to the shooting at a victory parade for the Kansas City Chiefs following their Super Bowl win"
    },
    {
        "url": "https://www.racplus.com/news/eu-f-gas-reforms-granted-final-regulatory-approvals-15-02-2024/",
        "title": "EU f-gas reforms granted final regulatory approvals",
        "description": "Reforms of the EU&#39;s F-Gas Regulation are expected to be implemented within the next three months after receiving final approval from both European Council"
    },
    {
        "url": "https://uk.news.yahoo.com/germany-film-funding-reform-set-195409560.html",
        "title": "Germany’s Film Funding <b>Reform</b> Set to Boost Industry With Tax Incentive",
        "description": "Germany’s film and TV sectors are eagerly awaiting the biggest reform in the history of German film funding this year, and while the government of Chancellor Olaf Scholz struggles to navigate a major budget crisis,"
    }
]