[
    {
        "url": "https://www.express.co.uk/news/politics/1869834/Nigel-Farage-democracy-warning-Rochdale-by-election",
        "title": "Nigel Farage blasts latest Rochdale farce and warns &#39;our democracy is failing&#39;.",
        "description": "The Rochdale by-election descended further into farce tonight as a candidate was refused entry to a hustings. <b>Reform</b> UK’s Simon Danczuk was barred from entering the meeting at Wardleworth Community Centre. Security refused to let Mr Danczuk enter despite ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/22/uk-withdraws-investment-treaty-put-net-zero-under-threat/",
        "title": "UK withdraws from investment treaty that put net zero under threat",
        "description": "Graham Stuart, the minister of state for energy security and net zero, said the treaty was “outdated” and “in urgent need of <b>reform</b>”, but said “talks have stalled and sensible renewal looks increasingly unlikely”. “Remaining a member would ..."
    },
    {
        "url": "https://theshillongtimes.com/2024/02/23/call-for-reforms/",
        "title": "Call for reforms",
        "description": "After the veto, the demand for <b>reform</b> of UN organs has become shriller. The United States is moving, at the time of writing, an alternative resolution calling for a temporary ceasefire linked to the release of hostages held by Hamas since 7 October 2023."
    },
    {
        "url": "https://asia.nikkei.com/Spotlight/Comment/Japan-s-record-high-stocks-kick-into-high-gear-corporate-reform-race",
        "title": "Japan&#39;s record-high stocks kick into high gear corporate <b>reform</b> race",
        "description": "TOKYO -- The market rejoiced as the Nikkei Stock Average surpassed Thursday the all-time high it had reached at the height of Japan&#39;s asset bubble in December 1989. As pundits ponder what has changed during the long 34-year wait -- often described as the ..."
    },
    {
        "url": "https://riverheadlocal.com/2024/02/22/thiele-ida-reform-a-priority-for-state-legislature-this-session/",
        "title": "Thiele: IDA <b>reform</b> a priority for State Legislature this session",
        "description": "Assembly Member Fred Thiele, who chairs the Assembly’s local governments committee, says his committee is reviewing more than a dozen bills directed at IDA reform. “We are looking to develop a"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-manchester-68373939",
        "title": "Rochdale by-election candidates discuss the town&#39;s needs",
        "description": "The debate did not take place after two other participants withdrew before it was due to be broadcast. <b>Reform</b> UK&#39;s Simon Danczuk said his &quot;only priority&quot; was Rochdale and tackling crime in the town was vital. George Galloway of the Workers Party for ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/22/brazil-urges-united-nations-reform-g20?ref=upstract.com",
        "title": "Brazil puts <b>reform</b> of UN at heart of its G20 presidency",
        "description": "International bodies are gripped by paralysis, Brazil tells meeting of foreign ministers, while David Cameron blasts ‘Putin and his cronies’ Brazil has put the Bermuda triangle of international diplomacy – <b>reform</b> of the United Nations and other ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869792/reform-uk-conservative-general-election-polling",
        "title": "<b>Reform</b> UK surge in bombshell poll as gap closes with Tories on brink of landslide defeat",
        "description": "Reform UK has narrowed the gap with the Conservatives in a bombshell new poll, that saw the Tories sink to new lows in the latest voting intention poll. The latest YouGov/Times poll shows the Tories on 20 percent, a four percentage point drop from the last poll on February 14-15."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/co-op-calls-for-urgent-legislative-reform-to-protect-frontline-workers-4528809",
        "title": "Co-op calls for urgent legislative <b>reform</b> to protect frontline workers",
        "description": "The report outlines the stark realities faced by shopworkers and retailers and calls for urgent legislative <b>reform</b> to protect frontline workers and communities. Did you know with a Digital subscription to Yorkshire Post, you can get access to all of our ..."
    },
    {
        "url": "https://www.globalwaterintel.com/global-water-intelligence-magazine/25/2/general/new-zealand-utility-reform-struggles-with-cost-of-capex",
        "title": "New Zealand utility <b>reform</b> struggles with cost of capex",
        "description": "The new centre-right government has axed an unpopular utility consolidation plan. Local councils may still need to band together to find funds for investment, reports Ed Cullinane."
    },
    {
        "url": "https://www.railnews.co.uk/news/2024/02/22-rail-reform-bill-where-do.html",
        "title": "Rail <b>Reform</b> Bill: where do we go now?",
        "description": "Governments usually behave as if they will be in power indefinitely, which may explain why a ‘draft’ Rail <b>Reform</b> Bill has been published. Bills receive three ‘Readings’ in the Commons: the first is a formality, and the second is the opportunity for ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/22/police-urge-olaf-scholz-to-scrap-monster-cannabis-reforms/",
        "title": "Police urge Olaf Scholz to scrap ‘monster’ cannabis reforms",
        "description": "Critics say planned legislation to decriminalise growing and possessing the drug would create a deluge of court cases"
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24137973.reform-uk-candidate-henley-fired-offensive-posts/",
        "title": "<b>Reform</b> UK candidate for Henley fired for &#39;offensive&#39; posts",
        "description": "The <b>Reform</b> UK parliamentary leader has fired the party&#39;s election candidate for Henley and Thame after his “inappropriate ” social media posts. David Carpin, who was due to stand for the right-wing populist party at the general election, compared ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/sinn-fein-says-it-is-open-to-reform-on-ability-to-block-powersharing-at-stormont-4529667",
        "title": "Sinn Fein says it is open to <b>reform</b> on ability to block powersharing at Stormont",
        "description": "The Economy Minister said his party recognised that the veto was a “continued problem” and was keen to find agreement with other parties to <b>reform</b> the structures. Mr Murphy said the Stormont’s Assembly and Executive Review Committee was the ..."
    },
    {
        "url": "https://bernews.com/2024/02/social-justice-bermuda-urges-cannabis-reform/",
        "title": "Social Justice Bermuda Urges Cannabis <b>Reform</b>",
        "description": "“Options for further <b>reform</b> including re-tabling the CLA inclusive of central medical/research use provision would make such a bill compliant with the UN Single Convention and also likely pass HE’s desk. Failing that, options include tabling a ..."
    },
    {
        "url": "https://bernews.com/2024/02/minister-rabain-furbert-press-conference/",
        "title": "Video: Minister Rabain &amp; Furbert Press Conference",
        "description": "“The Ministry is progressing with Education <b>Reform</b> and the transformation of the Bermuda Public School System from a three-tier to a two-tier system. This <b>reform</b> isn’t just structural; it’s about creating a nurturing environment that caters to our ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/brazil-call-reform-un-it-starts-its-g20-presidency",
        "title": "Brazil calls for <b>reform</b> of UN as it takes up G20 presidency",
        "description": "One of Brazil’s key proposals, set by President Luiz Inacio “Lula” da Silva, is a <b>reform</b> of global governance institutions such as the UN, the World Trade Organisation and multilateral banks, where he wants to push for stronger representation of ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/education/teaching-unions-launch-petition-against-28684379",
        "title": "Teaching unions launch petition against shorter school summer holiday",
        "description": "With the new curriculum, additional learning needs <b>reform</b>, behaviour and attendance challenges, Welsh Government need to be supporting schools and making sure families have accessible holiday activities and free school meals, not changing the structure of ..."
    },
    {
        "url": "https://www.bmj.com/content/384/bmj.q476",
        "title": "Scottish NHS faces uncertain future as demand outstrips activity",
        "description": "To deliver effective <b>reform</b> the government needs to lead on the development of a clear national strategy for health and social care. It should include investment in measures that tackle the causes of ill health, reducing long term demand on the NHS ..."
    }
]