[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "More to do despite by-election wins, says Starmer Curtice: By-elections leave Tories &#39;with mountain to climb&#39; Could <b>Reform</b> surge sink Tory election hopes? Despite the massive swings to Labour, he told BBC Breakfast his party were merely &quot;credible ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "General election is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the party must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    },
    {
        "url": "https://www.thesun.co.uk/news/26011656/voters-disgusted-by-rochdale-by-election-chaos/",
        "title": "Voters ‘disgusted’ by Rochdale by-election chaos",
        "description": "Could Rochdale be the most toxic by-election ever? Eleven men are standing in the Greater Manchester seat in two weeks’ time.   And the three front runners have all been booted out of Labour at"
    },
    {
        "url": "https://www.modernghana.com/news/1293325/kenyas-president-ruto-appointed-au-champion-for.html",
        "title": "Kenya’s President Ruto appointed AU Champion for Institutional <b>Reform</b>",
        "description": "The African Union AU has appointed Kenyan President William Ruto as its new Champion for Institutional Reform."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867891/laura-kuenssberg-reform-uk-nigel-farage-election",
        "title": "Laura Kuenssberg pinpoints &#39;important evidence&#39; over threat of Nigel Farage and <b>Reform</b> UK",
        "description": "While recent by-elections may on the surface appear to be Labour victories, the specifics of the votes reveal Reform UK could be increasing their hold over British politics."
    },
    {
        "url": "https://bernews.com/2024/02/ministry-of-education-allocated-142-6m-budget/",
        "title": "Ministry Of Education Allocated $142.6M Budget",
        "description": "The Ministry of Education has been allocated $142.6 million, Premier David Burt announced in the Budget, with capital funding increased by 40% to $6.4 million to support Education Reform projects. The relevant extract of the 2024 Budget statement said,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/17/rishi-sunak-tories-traditional-values-win-election-poll/",
        "title": "Sunak must embrace traditional Conservative values for Tories to win election, poll suggests",
        "description": "Poll likely to fuel concerns over Rishi Sunak’s leadership as Labour leads with 22 percentage points over Conservatives"
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/reform-uk-rishi-sunak-byelection-putin-b2497954.html",
        "title": "Rishi Sunak cannot afford to become consumed by by-election defeats",
        "description": "The Reform UK bandwagon may appear to be picking up speed. In Wellingborough, Ben Habib won 13 per cent of the vote and in Kingswood, Rupert Lowe won 10 per cent. This suggests that national opinion polls, putting the party on an average of 10 per cent, are accurate."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867694/rishi-sunak-general-election-tories-keir-starmer",
        "title": "‘Tory MPs hunting for jobs because they sense humiliating defeat is inevitable’ – pollster",
        "description": "“In American sports parlance (thanks, Taylor Swift), Rishi Sunak is now 1/6 in Conservative by-election defences, his sole victory coming in Boris Johnson ’s symbolic former seat, while the five defeats (four to Labour and one to the Lib Dems) rank as the 2nd, 3rd, 4th, 7th and 9th worst by-election Conservative swings to Labour since the war.”"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13094803/DAN-HODGES-unpalatable-truth-longer-Rishi-waits-call-election-worse-Tories.html",
        "title": "DAN HODGES: It&#39;s an unpalatable truth, but the longer Rishi waits to call an election, the worse it will be for the Tories",
        "description": "In the immediate aftermath of their dual implosion in Kingswood and Wellingborough, Tory MPs were dispatched to put a brave public face on the results."
    },
    {
        "url": "https://uk.news.yahoo.com/reform-party-hopes-snatching-working-082818461.htmlrip.ie",
        "title": "<b>Reform</b> Party hopes of snatching working class vote at general election doomed, say pollsters",
        "description": "Exclusive: Britain’s leading pollster has poured cold water on the former Brexit Party’s hopes of stealing working class votes from Keir Starmer"
    },
    {
        "url": "https://www.independent.co.uk/voices/rishi-sunak-lose-next-nine-months-b2497893.html",
        "title": "If Rishi Sunak is going to lose, what should he do in the next nine months?",
        "description": "The prime minister could do the right things, which would mean no tax cuts, writes John Rentoul... but will he?"
    },
    {
        "url": "https://www.politics.co.uk/5-minute-read/2024/02/17/friend-or-foe-the-conservative-party-misjudges-nigel-farage-at-its-peril/",
        "title": "Friend or foe? The Conservative Party misjudges Nigel Farage at its peril",
        "description": "As they are busy engaging with Nigel Farage, are Conservatives misreading the very threat that he poses to their party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-election losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://inews.co.uk/news/politics/wounded-sunak-income-tax-gamble-reform-by-election-2910867?ITO=msn",
        "title": "Wounded Sunak prepares income tax cut gamble after <b>Reform</b> by-election surge",
        "description": "The Prime Minister wants to see cuts to income tax or national insurance at the upcoming Budget as he seeks to close a large polling gap with Labour"
    },
    {
        "url": "https://inews.co.uk/news/politics/were-fking-up-so-much-no-10-despair-after-tories-double-defeat-2911108",
        "title": "‘We’re f**king up so much’: No 10 despair after Tories’ double defeat",
        "description": "But in the immediate aftermath of the Tories’ double defeat, there was little evidence of any serious manoeuvres against Sunak. How long that will hold remains to be seen, particularly if next month’s Budget fails to shift the polls and flights to Rwanda do not take off."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/come-together-sunak-tells-conservatives-101359242.html",
        "title": "‘Come together’ Sunak tells Conservatives after by-election blows",
        "description": "Rishi Sunak has called on British conservatives to “come together” after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/how-a-recession-and-by-election-misery-sent-rishi-sunak-back-to-square-one_uk_65cf0264e4b043f1c0aaaf9e?d_id=7311830&ncid_tag=fcbklnkukhpmg00000001",
        "title": "How A Recession And By-Election Misery Sent Rishi Sunak Back To Square One",
        "description": "Election expert Sir John Curtice said the Tories were “staring defeat in the face at the general election”, not least because the party is leaking voters to both Labour and <b>Reform</b> UK. The right-wing party secured 10% of the vote in Kingswood and 13% in ..."
    },
    {
        "url": "https://www.kalw.org/2024-02-17/the-hottest-trend-in-american-cities-zoning-reform",
        "title": "The hottest trend in American cities? Zoning <b>reform</b>",
        "description": "The rules that dictate what can be built and where were often meant to be exclusionary, experts say. With homes too few and rents too high, many cities are loosening rules to encourage more housing."
    },
    {
        "url": "https://nypost.com/2024/02/17/us-news/nyc-mom-jane-duncan-fakes-covid-cough-to-ward-off-mentally-ill-knife-wielding-menace/",
        "title": "NYC mom fakes COVID cough to escape deranged knife-wielding menace: ‘What I want is <b>reform</b>’",
        "description": "A deranged West Village vagrant pulled a knife on a 52-year-old native recently but she managed to escape by claiming she had COVID, while coughing in his direction."
    },
    {
        "url": "https://www.livemint.com/opinion/online-views/reversal-of-pricing-reforms-for-oil-psus-is-capping-their-stocks-upside-11708166773775.html",
        "title": "Reversal of pricing reforms for oil PSUs is capping their stocks’ upside",
        "description": "The current rally in their stock prices could have been far bigger and longer-lasting if the UPA government’s reforms in energy-product prices had been made real and not reversed in practice by the BJP government."
    },
    {
        "url": "http://www.chinaview.cn/africa/20240218/3f2d4b12a7ae4d129c61163b4e9d81e1/c.html",
        "title": "Ethiopian PM urges international financial <b>reform</b> for developing countries",
        "description": "ADDIS ABABA, Feb. 17 (Xinhua) -- Ethiopian Prime Minister Abiy Ahmed on Saturday called for reforms to the international financial system to enhance access to finance for developing countries. &quot;The international financial architecture treats the world ..."
    },
    {
        "url": "https://andina.pe/Ingles/noticia-perus-fa-min-presents-proposal-to-reform-un-security-council-veto-system-974779.aspx",
        "title": "Peru&#39;s FA Min presents proposal to <b>reform</b> UN Security Council veto system",
        "description": "&quot;  Affairs Minister Javier Gonzalez-Olaechea on Saturday presented the Peruvian proposal to reform the United Nations Security Council veto system —within the framework of his participation in the main program of the &lt;a href=&quot;  60th Munich Security Conference."
    },
    {
        "url": "https://www.bangkokpost.com/opinion/opinion/2744064",
        "title": "Wheelchair quest spurs <b>reform</b>",
        "description": "In a remarkable display of resolve, Monthon Phetsang manoeuvred his wheelchair through highway traffic for hundreds of kilometres to reclaim his rights as a disabled citizen. By doing so, the 48-year-old man has single-handedly exposed the bureaucratic hurdles endured by millions of disabled people in Thailand."
    },
    {
        "url": "https://indianexpress.com/article/india/how-long-will-5-members-override-188-nations-india-on-unsc-reform-9167230/",
        "title": "How long will 5 members override 188 nations: India on UNSC <b>reform</b>",
        "description": "India&#39;s Permanent Representative at the UN Ambassador Ruchira Kamboj, speaking at the Inter-Governmental Negotiations on Security Council Reform on Friday, stressed that “equity” must be the cornerstone of global efforts to reform the 15-nation UN body."
    },
    {
        "url": "https://andina.pe/Ingles/noticia-peru-fa-min-presents-proposal-to-reform-un-security-council-veto-system-974779.aspx",
        "title": "Peru: FA Min presents proposal to <b>reform</b> UN Security Council veto system",
        "description": "&quot;  Affairs Minister Javier Gonzalez-Olaechea on Saturday presented the Peruvian proposal to reform the United Nations Security Council veto system —within the framework of his participation in the main program of the &lt;a href=&quot;  60th Munich Security Conference."
    },
    {
        "url": "https://news.yahoo.com/reform-party-proven-stay-200000826.html",
        "title": "The <b>Reform</b> party has proven that it is here to stay",
        "description": "Kingswood is not in the top 200 Reform-friendly seats. It’s a suburb of a heavily left-leaning Bristol, with a demographic that would be nowhere near our target list for a general election. We entered the race on January 16,"
    },
    {
        "url": "https://news.webindia123.com/news/Articles/World/20240217/4169729.html",
        "title": "&#39;India supports comprehensive <b>reform</b> of UNSC across all five clusters...&#39;: Ruchira Kamboj",
        "description": "Stressing on the concept of &quot;equal opportunity&quot;, India&#39;s permanent ambassador to the United Nations said that equity demands that every nation, irrespective of its size or power be afforded an equal opportunity to shape global decision-making."
    },
    {
        "url": "https://www.ft.com/content/71d04a38-0b7b-4b05-980c-226188b9457e",
        "title": "Skyrocketing Arm share price shows need for UK <b>reform</b>",
        "description": "Essential digital access to quality FT journalism on any device. All discounts based on monthly full price over contract term. Cancel subscription renewal anytime. SAVE 40% ON YEAR 1 $468 $279 for 1 year $23.25 monthly equivalent SAVE 25% ON 6 MONTHS $234 ..."
    },
    {
        "url": "https://faroutmagazine.co.uk/noel-gallagher-turned-down-chance-to-reform-oasis/",
        "title": "Noel Gallagher “turned down” chance to <b>reform</b> Oasis, according to Liam Gallagher",
        "description": "Liam Gallagher has claimed that his brother Noel turned down an offer to reunite Britpop icons Oasis. The idea was proposed by Liam for the anniversary tour of their seminal debut album Definitely Maybe."
    },
    {
        "url": "https://www.politics.co.uk/week-in-review/2024/02/17/week-in-review-rishi-sunak-is-stuck-in-a-political-doom-loop/",
        "title": "Week-in-Review: Rishi Sunak is stuck in a political doom loop",
        "description": "If this was a bad week for Keir Starmer, then what might a good one look like?  With Westminster occupied by Labour’s £28 billion travails and closely scrutinising the electoral ramifications of its Rochdale debacle,"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68305798?at_bbc_team=editorial&at_link_id=2CE7C298-CC92-11EE-BB70-1B8C4B3AC5C4&at_format=link&at_ptr_name=twitter&at_campaign_type=owned&at_link_type=web_link&at_link_origin=BBCPolitics",
        "title": "John Curtice: By-election results leave Tories with mountain to climb",
        "description": "Tory gloom deepens after double poll blow Could <b>Reform</b> surge sink Tory election hopes? More to do despite by-election wins, says Starmer When is the next general election? History is not guaranteed to repeat itself, but between them these two results ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/hmrc-rejects-new-tax-rules-28651112",
        "title": "HMRC rejects new tax rules after being branded &#39;utterly extraordinary&#39;",
        "description": "The Public Accounts Committee recommendation for the taxman department followed “utterly extraordinary” decisions over Making Tax Digital programme."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68323136?at_link_id=5FCCC172-CD5F-11EE-BB70-1B8C4B3AC5C4&at_bbc_team=editorial&at_format=link&at_ptr_name=twitter&at_link_type=web_link&at_campaign_type=owned&at_link_origin=BBCNorthampton",
        "title": "Wellingborough by-election: Five things we learned",
        "description": "The dust has settled, 30,000-odd votes have been counted and Wellingborough has a new MP. The election was called after a recall petition ousted the former member Peter Bone, whose partner was chosen as the Conservative candidate. But what have we learned during the Northamptonshire constituency&#39;s by-election?"
    },
    {
        "url": "https://inews.co.uk/news/politics/nigel-farage-flirts-political-comeback-reform-uk-by-election-success-2910862?ITO=msn",
        "title": "Nigel Farage flirts with political comeback after <b>Reform</b> UK by-election success",
        "description": "While the party is still polling around 10 per cent nationally, its electoral prospects could see a major boost if Mr Farage returns to the fold. The former Ukip leader is currently the president of Reform UK, which counts businessman and arch Brexiteer Richard Tice as its leader."
    },
    {
        "url": "https://www.thenational.scot/politics/24126004.kate-forbes-radical-land-reform-critical-scotland/",
        "title": "Kate Forbes: Radical land <b>reform</b> is critical for Scotland",
        "description": "THE land reform debate is centuries old and often highly emotive, but it is one that many communities across Scotland and particularly"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867752/Reform-UK-leader-rules-out-election-pact",
        "title": "<b>Reform</b> UK leader Richard Tice rules out election pact with Rishi Sunak",
        "description": "Reform UK leader Richard Tice has ruled out an election pact with Rishi Sunak and the Conservative Party. Reform - which was founded as the Brexit Party - recorded its best by-election results on Thursday, polling 13% in Wellingborough, Northants, and 10% in Kingswood."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-lead-firm-reform-gains-060000431.html",
        "title": "Labour’s Lead Is Firm, <b>Reform</b> Gains: Five Lessons From the By-Elections",
        "description": "The Labour Party handed the governing Conservatives two thumping defeats in a pair of special elections on Thursday in a setback for Prime Minister Rishi Sunak that reinforces the sense that the opposition is on course to win power at a general election due in the next year."
    },
    {
        "url": "https://cowboystatedaily.com/2024/02/17/wyoming-woman-wants-reform-after-her-dog-jester-dies-in-beaver-trap/",
        "title": "Wyoming Woman Wants Trapping <b>Reform</b> After Her Dog Dies In Beaver Trap",
        "description": "And while wrestling with grief over losing Jester, she said his death has also fired her up to push for trapping regulation <b>reform</b>. She’s already written to Game and Fish and the Wyoming Legislature. Despite her sadness and anger, Baker said she doesn ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24126044.come-together-sunak-tells-conservatives-twin-by-election-blow/",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "The losses to Labour and an emboldened <b>Reform</b> UK party came as a twin blow to the Prime Minister, with the results the latest in a series of by-election defeats for Mr Sunak. The results mean the Conservative Government has endured more by-election losses ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/16/tory-mps-warn-sunak-veering-further-right-would-be-politically-disastrous",
        "title": "Tory MPs warn Sunak veering further right would be ‘politically disastrous’",
        "description": "Leading members of party’s One Nation caucus caution against any ‘attempt to become the <b>Reform</b> party’ Rishi Sunak has been warned by leading One Nation group Conservatives it would be “politically disastrous” to veer further to the right after ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/misery-sunak-tories-suffer-electoral-defeat-two-safe-seats-20290963/?ico=trending-post-strip_item_4",
        "title": "Here’s what the by-election results mean for the Tory and Labour parties",
        "description": "The newly-minted Labour MP secured 11,151 votes, compared to the Tories tally of 8,675. Elsewhere throughout the night, the <b>Reform</b> party came in a comfortable third place in both elections, including scoring 13% of the vote share in Wellingborough- their ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/rishi-sunak-conservatives-reform-party-unity-byelection-defeats",
        "title": "Sunak urges right-leaning voters to unite to keep Starmer out of No 10",
        "description": "Prime minister calls for unity after heavy losses to Labour and Reform UK electoral gains"
    },
    {
        "url": "https://inews.co.uk/news/politics/nigel-farage-flirts-political-comeback-reform-uk-by-election-success-2910862",
        "title": "Nigel Farage flirts with political comeback after <b>Reform</b> UK by-election success",
        "description": "While the party is still polling around 10 per cent nationally, its electoral prospects could see a major boost if Mr Farage returns to the fold. The former Ukip leader is currently the president of Reform UK, which counts businessman and arch Brexiteer Richard Tice as its leader."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-sitting-pretty-as-chances-for-tories-are-bitty-2911482?ico=related_article_inline",
        "title": "Starmer sitting pretty as chances for Tories are bitty",
        "description": "Sir Keir Starmer is playing it cool. He would only go as far as to say that his party is a “credible contender” for power. Those in Labour who study the numbers closely are less hesitant: they know that, as things stand, Sir Keir could win a majority as big as Tony Blair’s was in 1997."
    }
]