[
    {
        "url": "https://uk.news.yahoo.com/us-senate-unveils-text-border-010149020.html",
        "title": "US Senate unveils text of border security, Ukraine aid bill",
        "description": "US senators on Sunday released the text of a much-anticipated deal that would unlock billions in new aid for Ukraine and Israel while tightening US border laws -- although its prospects for becoming law are unclear."
    },
    {
        "url": "https://www.landlordtoday.co.uk/breaking-news/2024/2/renters-reform-bill--no-progress-in-parliament-for-at-least-another-two-weeks",
        "title": "Renters <b>Reform</b> Bill - government reveals another Commons.delay",
        "description": "The Renters Reform Bill will not go for its Third Reading in the House of Commons for at least another fortnight."
    },
    {
        "url": "https://www.lettingagenttoday.co.uk/breaking-news/2024/2/political-uncertainty-suggests-ongoing-landlord-exodus-says-knight-frank",
        "title": "Political uncertainty suggests ongoing landlord exodus, says Knight Frank",
        "description": "Prime London rental values fell closer to their longer-term average in January, as supply continued to increase."
    },
    {
        "url": "https://www.retail-week.com/people/political-parties-must-commit-to-apprenticeship-levy-reform-says-brc/7045515.article",
        "title": "Political parties must commit to apprenticeship levy <b>reform</b>, says BRC",
        "description": "The British Retail Consortium (BRC) warned that a reform of the apprenticeship levy is &quot;vital&quot; for the future growth of the economy and has called on the UK&#39;s political parties to commit to this in their manifestos ahead of the general election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/m-and-s-adds-to-calls-for-reform-of-the-apprenticeship-levy-f60d9lhkv",
        "title": "Marks &amp; Spencer joins calls for apprenticeship levy <b>reform</b>",
        "description": "Marks &amp; Spencer joins calls for apprenticeship levy reform, with high costs and lack of guidance cited by businesses as main barriers to taking on trainees"
    },
    {
        "url": "https://www.bbc.com/news/business-68027592",
        "title": "China can now monitor government-funded projects 24/7",
        "description": "Some Chinese developers must now install monitoring equipment at their projects, under official measures which took affect this month. The rules apply to firms that have received at least 30 million yuan ($4.2m; £3.3m) of government funding. It comes as authorities move to support China&#39;s crisis-hit property industry."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/bipartisan-senate-ukraine-immigration-deal-b2490274.html",
        "title": "Bipartisan Senate group releases text of Ukraine-immigration agreement",
        "description": "The group—comprised of Republican Senator James Langford of Oklahoma, Independent Senator Kyrsten Sinema of Arizona and Democratic Senator Chris Murphy of Connecticut—released the text of the legislation on Sunday night after months of back-and-forth. The bill’s total price tag is approximately $118bn"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/04/nigel-farage-joining-tories-popular-conservatives-liz-truss/",
        "title": "Nigel Farage ‘open-minded’ about joining Tories after next election",
        "description": "Former Ukip leader hints at move as he prepares to attend launch event for Liz Truss’s Popular Conservatives group next week"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13044619/Tory-activists-strike-Reform-UK-Government-Conservative.html",
        "title": "Fed-up Tory activists &#39;are on strike and turning to <b>Reform</b> UK&#39; as 90% say Government is &#39;not Conservative enough&#39;",
        "description": "Claire Bullivant (centre), editor of the Conservative Post news site, said widespread disaffection with the Government was making it hard to persuade activists to campaign for the party."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862948/tory-members-survey-rishi-sunak-reform",
        "title": "Tory members threaten to vote <b>Reform</b> unless one of these three people replaces Rishi Sunak",
        "description": "EXCLUSIVE: A major survey of registered Conservative members when Rishi Sunak became leader suggests party activists will go on strike at the general election."
    },
    {
        "url": "https://www.thesun.co.uk/news/25717113/trevor-kavanagh-uncontrolled-immigration-election/",
        "title": "Uncontrolled immigration is the Tories’ fault – and it will cost them the election",
        "description": "THE Tories’ last pale hope of victory expired on Tuesday. It was put out of its misery by official figures showing the bulging UK population is set to soar by 6.6million over 12 years. If this"
    },
    {
        "url": "https://www.lbc.co.uk/news/sadiq-khan-lose-may-election/",
        "title": "Sadiq Khan warns &#39;I could lose&#39; May mayoral election as he hints at 2036 Olympics bid for London",
        "description": "Green Zoe Garbett took 11% of the vote, while the Liberal Democrats’ Rob Blackie had 7. <b>Reform</b> UK’s Howard Cox was 4%, with 3% for other candidates. Sadiq Khan is the preferred candidate in both inner London and outer London - denting Hall&#39;s chances of ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-lords-undiluted-labour-2889350?ico=related_stories",
        "title": "<b>Reform</b> of the Lords will go ahead undiluted, says Labour",
        "description": "Labour would not be drawn over which pledges would be in the manifesto but insisted it was not scaling back commitments"
    },
    {
        "url": "https://inews.co.uk/opinion/liz-truss-margaret-thatcher-2888892?ico=related_article_inline",
        "title": "Will Liz Truss ever stop trying to be Margaret Thatcher?",
        "description": "The latest clique to raise its standard is the self-styled Popular Conservatives, which will be staging a big launch in Westminster this week. Its leader, counterintuitively, is Liz Truss, best known for her pioneering work in the field of very unpopular Conservatism indeed."
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/news/24094353.russell-takes-reins-scottish-land-reform-group/",
        "title": "Russell takes the reins at Scottish Land <b>Reform</b> group",
        "description": "The Scottish Government has officially announced the appointment of Michael Russell, a former MSP, as the new chair of the Scottish Land"
    },
    {
        "url": "https://www.express.co.uk/life-style/cars/1862606/tiktok-trend-driving-law-valentines-day",
        "title": "TikTok date night driving trend could see couples fined £2,500 this Valentine’s Day",
        "description": "As couples plan their Valentine&#39;s Day activities, a driving expert has warned that one currently trending on TikTok may have unromantic consequences."
    },
    {
        "url": "https://www.heraldscotland.com/news/24096379.lords-reform-starmer-throwing-another-promise-bonfire/?ref=rss",
        "title": "Lords <b>reform</b>: Starmer &#39;throwing another promise on the bonfire&#39;",
        "description": "KEIR Starmer has been accused of “throwing another promise on the bonfire” to win power after a report that Labour’s plans for Lords"
    },
    {
        "url": "https://uk.news.yahoo.com/education-reform-orthodox-yeshivas-threatened-184400156.html",
        "title": "Education <b>reform</b> at orthodox yeshivas threatened by NY state decision: critics",
        "description": "A newly state-approved accrediting agency for yeshivas is facing blowback from skeptics who worry it’ll be used to bypass quality checks such as school visits or standardized tests. Merkos L’Inyonei Chinuch,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-liz-truss-popcon-tory-b2490208.html",
        "title": "Nigel Farage to attend Liz Truss’s latest comeback bid with launch of ‘Popular Conservatism’",
        "description": "Nigel Farage is planning to attend the launch of Liz Truss’s new “Popular Conservatism” project this week, as the former prime minister attempts to rally right-wing Tory MPs."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/prisoners-killing-themselves-behind-bars-28491647",
        "title": "Prisoners &#39;killing themselves behind bars&#39; after being given &#39;wicked&#39; sentences",
        "description": "According to the United Group for <b>Reform</b> of IPP, 14 IPP prisoners remained at HMP Liverpool as of July 2022. READ MORE: Man arrested at Liverpool Central over lack of valid ticket despite shelling out £120 for train journey Henry Rossi, a human rights ..."
    },
    {
        "url": "https://www.foodingredientsfirst.com/news/speciesism-in-ai-built-in-biases-hinder-animal-welfare-reform-and-plant-based-diets.html",
        "title": "Speciesism in AI: Built-in biases hinder animal welfare <b>reform</b> and plant-based diets",
        "description": "The proliferation of AI systems is exacerbating the issue of speciesism and undermining animal welfare reform as well as the transition to plant-based diets, warn animal protection groups. Incoming regulation,"
    },
    {
        "url": "https://www.skynews.com.au/australia-news/politics/lots-of-different-ways-to-reform-tax-system-allegra-spender/video/06c32241b285d159ad4f36cf00694536",
        "title": "‘Lots of different ways’ to <b>reform</b> tax system: Allegra Spender",
        "description": "Independent MP Allegra Spender says there are “lots of different ways” to make the tax system work better for the country. “For me the biggest three issues with the tax system are firstly that intergenerational equity piece – we’ve got younger people who are locked out of housing,"
    },
    {
        "url": "https://www.thestar.com.my/business/business-news/2024/02/05/argentinas-lower-house-of-congress-approves-mileis-omnibus-bill",
        "title": "Argentina’s lower house of congress approves Milei’s omnibus bill",
        "description": "Argentina’s lower house of congress approved President Javier Milei’s omnibus reform package last Friday afternoon, passing the first test of his ability to govern with an opposition-controlled legislature."
    },
    {
        "url": "https://www.crikey.com.au/2024/02/05/peter-dutton-stage-three-tax-cuts-coalition-albanese/",
        "title": "Dutton blew his ‘tax <b>reform</b>’ cobra strike. But what about a python squeeze?",
        "description": "Even Peter Dutton&#39;s political allies have helped derail his efforts to hold Labor accountable for its stage three tax cut changes. His next move will be telling."
    },
    {
        "url": "https://www.fox5ny.com/news/fashion-week-black-history-month",
        "title": "Models push for <b>reform</b> ahead of New York Fashion Week",
        "description": "Ahead of Fashion Week, and during Black History Month, models are bringing attention to the abuses and predatory behavior they say is running rampant in the fashion industry. On top of that, models now face the new threat of artificial intelligence. Next ..."
    },
    {
        "url": "https://www.thenational.scot/news/24096203.keir-starmers-labour-set-ditch-plans-abolish-house-lords/",
        "title": "Keir Starmer&#39;s Labour &#39;set to ditch plans to abolish House of Lords&#39;",
        "description": "LABOUR have been slammed for dumping another key promise to voters after reports suggested the party is set to row back on plans to abolish"
    },
    {
        "url": "https://www.eadt.co.uk/news/24096128.suffolk-send-resignations-welcomed-opposing-parties/",
        "title": "Suffolk SEND resignations welcomed by opposing parties",
        "description": "The resignations of three Suffolk county councillors from their cabinet and deputy cabinet roles has been welcomed by opposition parties."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13043429/Nigel-Farage-fuels-fevered-rumours-Tory-comeback-plans-attend-launch-Liz-Trusss-new-PopCon-group-week.html",
        "title": "Nigel Farage fuels fevered rumours of Tory comeback as he plans to attend launch of Liz Truss&#39;s new &#39;PopCon&#39; group this week",
        "description": "Nigel Farage is set to be at the event on Tuesday as Liz Truss and senior figures including Jacob Rees-Mogg lay out their aims."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/german-economy-minister-suggests-corporate-101758735.html",
        "title": "German economy minister suggests corporate tax <b>reform</b> - Welt am Sonntag",
        "description": "German Economy Minister Robert Habeck has floated the idea of a reform of the country&#39;s corporate taxes as one way to take pressure off companies that are facing numerous challenges, including high energy costs."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-68187286",
        "title": "New Wales political system poses great danger - Wigley",
        "description": "A reform of Wales&#39; political system poses &quot;a very great danger&quot;, a former leader of Plaid Cymru has said. Dafydd Wigley was reacting to plans to bring in a so-called closed list PR system for Cardiff Bay from 2026. The plans were approved in principle by the Senedd this week."
    },
    {
        "url": "https://www.heraldscotland.com/news/24094925.domestic-abuse-victim-failed-system-demands-legal-reform/?ref=rss",
        "title": "Domestic abuse victim failed by system demands legal <b>reform</b>",
        "description": "Victoria McNulty is calling for justice system reform after her ex-partner battered her in her home which left her suffering from PTSD. Today she"
    },
    {
        "url": "https://www.independent.com.mt/articles/2024-02-04/blogs-opinions/The-real-victims-6736258280",
        "title": "The real victims",
        "description": "The drug reform being proposed by the government is a means of giving more options for the court to deal with cases as they deem fit,” Robert Abela bluffed. The truth is that"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/kingswood-election-candidates-listed-six-9073291",
        "title": "Kingswood by-election candidates listed as all six now confirmed",
        "description": "Nominations are closed and the Lib Dems, Greens and UKIP now have candidates, joining Conservatives, Labour and Reform UK on the ballot paper"
    },
    {
        "url": "https://www.ft.com/content/0dcf0275-a271-442f-b69b-f058b0f6a434",
        "title": "The waning influence of Iran’s leading moderate Hassan Rouhani",
        "description": "The pro-reformist’s absence from the running for the Assembly of Experts highlights the hardliners’ grip on power"
    },
    {
        "url": "https://www.advertiserandtimes.co.uk/news/plan-to-build-homes-on-church-site-is-thrown-out-9351134/",
        "title": "Plan by United Reformed Church Wessex Synod to build five houses on land at Walkford United Reformed church is refused",
        "description": "Plans to demolish part of a former church and build five houses in its courtyard have been refused over concerns it would destroy a “little oasis”."
    }
]