[
    {
        "url": "https://www.theguardian.com/global/live/2024/jan/30/australia-news-live-queensland-weather-floods-storms-flooding-stage-three-tax-cuts-anthony-albanese-peter-dutton-nemesis-abc-malcolm-turnbull-tony-abbott-victoria-nsw-politics?page=with:block-65b80edb8f08610684b7a015",
        "title": "Australia news live: Sydney Harbour shark attack victim ‘stable’ in hospital; fresh floods after intense rain in Queensland",
        "description": "I think broad-based tax <b>reform</b>, big structural changes, that is the kind of thing that you would take to an election and quite frankly, given where we are in the electoral cycle, we wouldn’t be able to get it done in time anyway. So, you know ..."
    },
    {
        "url": "https://www.retailgazette.co.uk/blog/2024/01/union-morrisons-angry-pension/",
        "title": "Morrisons: Union ‘angry and disappointed’ by pension changes",
        "description": "Retail trade union Usdaw is &quot;angry and disappointed&quot; with Morrisons&#39; refusal to consider alternative proposals for pension scheme <b>reform</b>. Retail trade union Usdaw is “angry and disappointed” with Morrisons’ refusal to consider alternative proposals ..."
    },
    {
        "url": "https://www.mlive.com/public-interest/2024/01/michigan-making-progress-on-child-welfare-system-reform.html",
        "title": "Michigan making progress on child welfare system <b>reform</b>",
        "description": "“Michigan’s child welfare system made significant and noteworthy progress in recent years, particularly with regard to face-to-face visits with children in foster care,” said Joe Ryan, professor in the School of Social Work and director of the Child and Adolescent Data Lab at the University of Michigan, in a prepared statement."
    },
    {
        "url": "https://philosophynow.org/issues/160/Edmund_Burke_and_the_Politics_of_Reform",
        "title": "Edmund Burke &amp; the Politics of <b>Reform</b>",
        "description": "But the two impulses – conservatism and <b>reform</b> – are not contradictory if there are things to conserve in society as well as things to change. For instance, if a society has a functioning democracy, concerned citizens should be as active in its ..."
    },
    {
        "url": "https://www.modernghana.com/news/1288897/ndc-prefers-election-date-change-to-take-effect.html",
        "title": "NDC prefers election date change to take effect from 2028",
        "description": "The opposition National Democratic Congress NDC has supported the change in the day for national elections but wants the reform to begin in 2028."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/29/bbc-staff-hire-candidates-dismissive-diversity-inclusion/",
        "title": "BBC staff are being told not to hire candidates who are ‘dismissive’ of diversity and inclusion",
        "description": "“This is why <b>reform</b> of the BBC is so difficult; the broadcaster consists of a workforce lacking in diversity of opinion and who are completely dismissive of those with different viewpoints.” The broadcaster said it had replaced the recruitment ..."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/29/navigating-healthcare-challenges-in-pakistan-a-call-for-reform/",
        "title": "Navigating Healthcare Challenges in Pakistan: A call for <b>reform</b>",
        "description": "Pakistan, a country with a rich cultural tapestry and a history shaped by various influences, faces considerable challenges in its healthcare sector. Despite commendable efforts, several factors contr"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861005/rishi-sunak-immigration-referendum-general-election",
        "title": "Rishi Sunak handed blueprint for shock election win with &#39;radical offer&#39; on immigration",
        "description": "A leading academic said the PM could &quot;pull off one of the biggest shocks&quot; in the history of general elections by promising a referendum on reducing immigration."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/czrl3r90kgko",
        "title": "Castletown property rates to rise 9% from April",
        "description": "Residents in Castletown are facing an above-inflation rate rise from April, the local authority has confirmed. Ratepayers face a hike of 9% in their domestic rates and 8.9% in the refuse rate. That equates to an average town rate rise of £38."
    },
    {
        "url": "https://www.modernghana.com/news/1288897/ndc-refers-election-date-change-to-take-effect.html",
        "title": "NDC refers election date change to take effect from 2028",
        "description": "The opposition National Democratic Congress NDC has supported the change in the day for national elections but wants the reform to begin in 2028."
    },
    {
        "url": "https://www.standard.co.uk/news/londoners-diary/olly-robbins-alleged-remainer-keir-starmer-labour-government-cabinet-secretary-b1135479.html",
        "title": "Who is Olly Robbins? Allegedly pro-EU official tipped to run Keir Starmer&#39;s government",
        "description": "At Oxford, Robbins attended the traditionally centre-Left Hertford College. In the New Labour years, when Robbins worked for Tony Blair and Gordon Brown, he was one of the so-called “Hertford Four” – the four civil servants who controlled intelligence access to the Prime Minister and who had all attended the Oxford college."
    },
    {
        "url": "https://www.investing.com/news/forex-news/argentina-markets-edge-lower-after-mileis-key-reform-bill-diluted-3286243",
        "title": "Argentina markets edge lower after Milei&#39;s key <b>reform</b> bill diluted",
        "description": "BUENOS AIRES (Reuters) - Argentina&#39;s bond, currency and stock markets edged lower on Monday, though they avoided a sharp slide after the government was forced to pull a key fiscal section from its major &quot;omnibus&quot; bill aimed at reforming the country&#39;s embattled economy."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/rte-publishes-list-of-10-highestpaid-presenters-for-2022-b1135401.html",
        "title": "RTE publishes list of 10 highest-paid presenters for 2022",
        "description": "RTE has published the earnings of its 10 highest-paid presenters for 2022, showing that Ryan Tubridy earned 515,000 euro (£439,950). The list is to be published annually following a controversy last year where the Irish public service broadcaster admitted misstating the fees it paid to its former star presenter."
    },
    {
        "url": "https://www.kentonline.co.uk/dartford/news/new-housing-estate-residents-to-have-power-to-change-managem-300906/",
        "title": "Dartford MP Gareth Johnson helps amend bill to give residents of new housing estates power to change management companies",
        "description": "Dartford MP Gareth Johnson has welcomed news that the government has tabled amendments to the Leasehold and Freehold <b>Reform</b> Bill to offer vital protection to residents against the actions of property management companies. Dartford MP Gareth Johnson has ..."
    },
    {
        "url": "https://www.landlordzone.co.uk/news/leading-education-thinktank-attacks-governments-rental-reforms",
        "title": "Leading education thinktank slams Government&#39;s rental reforms",
        "description": "The Renters (Reform) Bill will reduce rather than enhance housing rights for students, according to the former CEO of student housing charity Unipol. Writing for education think-tank HEPI, Martin Blakey (pictured) says the legislation will be the first time that any government has sought to compel students sharing a home to be joint tenants."
    },
    {
        "url": "https://fortune.com/2024/01/29/salt-caucus-house-members-states-california-connecticut-are-missing-the-pointand-taxes-politics-congress/",
        "title": "SALT Caucus House members from states like California and Connecticut are missing the point–and could end up raising taxes for everyone next year",
        "description": "That’s a laudable aim, but their method of achieving it is backward. Instead of advocating for the <b>reform</b> of burdensome income taxes in their own states, SALT Caucus members are holding federal tax relief hostage just to undo a 2017 law that capped the ..."
    },
    {
        "url": "https://www.mirror.co.uk/money/broadcaster-reveals-10-highest-paid-31993698.amp",
        "title": "Broadcaster reveals 10 highest paid presenters with one earning £439,950",
        "description": "Kevin Bakhurst, the director-general of RTE, pledged to limit salaries at his level as part of his <b>reform</b> plan for the financially struggling station. He admitted that high salaries paid to presenters had been a &quot;toxic&quot;, &quot;corrosive&quot; issue and said their ..."
    },
    {
        "url": "https://www.itv.com/news/channel/2024-01-29/lyndon-farnham-faces-further-challenges-as-he-picks-new-top-team",
        "title": "The Challenge of Consensus : Lyndon Farnham&#39;s top picks",
        "description": "Farnham&#39;s picks include ministers from the previous government - even Farnham&#39;s defeated rival for the top job Ian Gorst gets a nomination - as well as members of <b>Reform</b> Jersey and the Constables. Credit: ITV News Channel Building consensus is at the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/daywatch-appeals-skyrocket-courts-grapple-124200370.html",
        "title": "Daywatch: Appeals skyrocket as courts grapple with bond <b>reform</b>",
        "description": "In October in Livingston County, Judge Jennifer Bauknecht issued a lengthy decision following a detention hearing just weeks after cash bail was abolished across the state. “All right. Since its founding, this country has used monetary bonds in ..."
    },
    {
        "url": "https://www.getsurrey.co.uk/news/surrey-news/extra-funding-announced-crucial-council-28512238",
        "title": "Extra funding announced for crucial council services in Surrey but &#39;difficult decisions&#39; remain",
        "description": "Additional government funding for local councils will “go some way” towards easing the pain felt by local authorities struggling to balance their books - although calls remain for greater <b>reform</b>. Communities Secretary Michael Gove announced that ..."
    },
    {
        "url": "https://www.dnsassociates.co.uk/blog/companies-house-reforms-major-changes-for-companies-partnerships-and-directors",
        "title": "Companies House <b>reform</b> - Major changes for companies, partnerships and directors in 2024",
        "description": "This wide-reaching <b>reform</b> of company legislation introduces a series of changes designed to improve company information, reduce crime, improve corporate transparency and strengthen Companies House powers in the UK. It is believed it will deliver ..."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/money/pensions-and-retirement/jeremy-hunt-pension-plan-risk-2870370?ico=in-line_link",
        "title": "Jeremy Hunt’s ‘pot-for-life’ pension plan sparks concern over risk to savers",
        "description": "Advisers, providers and experts have said that other policy changes should take priority, as savers may not be equipped to make adequate decisions under a <b>reform</b> where they are given more flexibility. It comes as the Government consultation closes on ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145863.welfare-reforms-a-disgrace-says-cleric/",
        "title": "Welfare reforms &#39;a disgrace&#39; says cleric",
        "description": "ONE of Britain&#39;s most senior Catholic figures has criticised the Government&#39;s welfare <b>reform</b> programme as a &quot;disgrace&quot; that is driving people to destitution. In one of the most strongly worded attacks yet by a senior church figure, Vincent Nichols ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145602.unite-bosses-back-labour-plans-reform-unions-link/",
        "title": "Unite bosses back Labour plans to <b>reform</b> unions link",
        "description": "Leaders of Unite have backed plans to <b>reform</b> the historic link between Labour and the unions. The executive of Unite held a special meeting to discuss a paper drawn up for Labour leader Ed Miliband by Lord Collins, a former union and party official."
    }
]