[
    {
        "url": "https://uk.news.yahoo.com/naomi-baker-da-vinchi-star-220458443.html",
        "title": "Naomi Baker &amp; Da’Vinchi To Star In Romantic Drama ‘Hard Feelings’ From Writer-Director Jo Hatcher",
        "description": "EXCLUSIVE: Naomi Baker (All American: Homecoming) and Da’Vinchi (BMF) have been tapped to star in Hard Feelings, an indie romantic drama marking the first feature of writer-director Jo Hatcher. Selected for the 2021 Sundance Screenwriters Intensive,"
    },
    {
        "url": "https://www.modernghana.com/news/1289445/the-gambia-is-seeking-cooperation-with-ecowas-on.html",
        "title": "The Gambia is seeking cooperation with ECOWAS on judicial reforms",
        "description": "The President of the Commission of the Economic Community of West African States ECOWAS, Dr Omar Alieu Touray received this Tuesday, January 30, 2024, in Abuja, Nigeria, Mr."
    },
    {
        "url": "https://www.thetimes.co.uk/article/faragist-masterplan-will-go-horribly-wrong-720bzv59w",
        "title": "Faragist masterplan will go horribly wrong",
        "description": "Disaffected Tories tempted to back Reform UK risk handing Labour a 200-seat majority and untrammelled power"
    },
    {
        "url": "https://ifamagazine.com/labour-puts-pensions-guidance-and-isa-reform-front-and-centre-of-financial-services-agenda-in-its-financing-growth-plan/",
        "title": "Labour puts pensions, guidance and ISA <b>reform</b> front-and-centre of financial services agenda in its ‘Financing Growth’ plan",
        "description": "In response to Labour&#39;s plan revealed today, the team at AJ Bell have clearly been looking at the detail and have shared the following synopsis with us as"
    },
    {
        "url": "https://www.newsletter.co.uk/business/report-public-sector-leaders-want-a-pragmatic-and-collegiate-northern-ireland-executive-that-focuses-on-key-priorities-to-improve-public-services-4500434",
        "title": "Report: Public sector leaders want a &#39;pragmatic and collegiate&#39; Northern Ireland Executive that focuses on key priorities to improve public services",
        "description": "State of the State survey also found that the NI government ‘is the least trusted of the UK’s administrations’"
    },
    {
        "url": "https://www.irishnews.com/news/world/james-biden-agrees-to-interview-with-house-republicans-probing-the-president-GBGCGM5WBJN4DODITDDWGZOQ6M/",
        "title": "James Biden agrees to interview with House Republicans probing the president",
        "description": "James Biden will appear before House Republicans for a private interview next month as lawmakers seek to regain some momentum in their months-long impeachment inquiry into his brother, President Joe Biden."
    },
    {
        "url": "https://www.itv.com/news/channel/2024-01-31/emergency-government-taskforce-created-to-tackle-housing-crisis",
        "title": "Jersey&#39;s Housing Minister creates emergency taskforce to tackle property &#39;crisis&#39;",
        "description": "Jersey&#39;s new Housing Minister, Deputy Sam Mézec, has created a &#39;Housing Crisis Emergency Taskforce&#39; in response to the island&#39;s pressured property market. | ITV News Channel"
    },
    {
        "url": "https://www.doncasterfreepress.co.uk/news/politics/reform-uk-to-hold-huge-rally-in-doncaster-as-general-election-draws-nearer-4500283",
        "title": "<b>Reform</b> UK to hold huge rally in Doncaster as General Election draws nearer",
        "description": "Reform UK is to hold a huge spring rally in Doncaster – as a General Election draws nearer. The gathering, which is expected to draw more than 1,000 supporters, will take place at Doncaster Racecourse on February 24."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/whats-on/food-drink-news/masterchefs-tom-kerridge-under-fire-28544893",
        "title": "Masterchef&#39;s Tom Kerridge under fire for selling £20 jacket potato at his fancy pub",
        "description": "The Masterchef star, 50, is serving up his Baked Potato &quot;Raclette&quot; with Sauce Reform for £19.50 at his restaurant The Coach in Marlow, Buckinghamshire. He&#39;s since been slammed for &#39;taking the p***&#39; with the prices."
    },
    {
        "url": "https://www.modernghana.com/news/1289476/major-mahama-case-were-taking-measures-to-reform.html",
        "title": "Major Mahama case: We’re taking measures to <b>reform</b> jury system – AG",
        "description": "The Attorney General Godfred Yeboah Dame has attributed the delays during Major Maxwell Mahama rsquo;s trial to a faulty juror system, which he said the government is taking measures to reform."
    },
    {
        "url": "https://www.heraldscotland.com/news/24088150.scottish-government-procrastinating-important-decisions-warn-msps/",
        "title": "Scottish Government &#39;procrastinating&#39; on important decisions warn MSPs",
        "description": "Shona Robison’s budget has been criticised by Holyrood’s Finance and Public Administration Committee, with MSPs warning that some"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24088132.young-reporter-secondary-education-need-reform-charlotte-herring/",
        "title": "Young Reporter Does Secondary Education Need <b>Reform</b>? Charlotte Herring",
        "description": "For the past two centuries, the UK has been following the same educational doctrine, with minor alterations, to meet Government standards. However, teachers and students are beginning to call for major changes, as they feel the system is no longer working ..."
    },
    {
        "url": "https://uk.news.yahoo.com/johnson-says-ukraine-aid-border-190544670.html",
        "title": "Johnson says Ukraine aid and border policy <b>reform</b> ‘likely’ to be split",
        "description": "Sen. Chris Murphy (D-Conn.), one of the negotiators of the border policy <b>reform</b>, said there’s still consensus on keeping border policy reforms as part of the larger national security supplemental, which includes aid for Ukraine, Israel and Taiwan."
    },
    {
        "url": "https://www.thegrocer.co.uk/wholesalers/fwd-calls-for-apprenticeship-levy-reform-to-boost-skills-training/687752.article",
        "title": "FWD calls for apprenticeship levy <b>reform</b> to boost skills training",
        "description": "The Federation of Wholesale Distributors is advocating to <b>reform</b> the government apprenticeship levy. The key proposed changes focus on flexible skills-based courses, quicker processes around updates such as tech and HGV training, and shorter off-the-job ..."
    },
    {
        "url": "https://www.bmj.com/content/384/bmj.q239",
        "title": "Sidney Wolfe: public health leader who campaigned for <b>reform</b> across the US health system",
        "description": "Depending on your perspective, Sidney Wolfe was either a “gadfly” or a giant in US health advocacy for half a century. It didn’t start that way. His first degree was in chemistry, but a summer job with a chemical company resulted in almost daily ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/trade-unions-challenge-welsh-govts-school-year-reforms",
        "title": "Trade unions challenge Welsh government&#39;s school year reforms",
        "description": "A COALITION of trade unions and education, farming and tourism organisations called on the Welsh government today to scrap its <b>reform</b> of the school year. The 11 organisations include NASUWT Cymru, NEU Cymru, Unison Cymru/Wales, GMB Wales, the National ..."
    },
    {
        "url": "https://www.jdsupra.com/legalnews/current-congressional-attempts-at-5425919/",
        "title": "Current Congressional Attempts at Patent <b>Reform</b>",
        "description": "In recent years, Congress has considered potential new laws for patent <b>reform</b>, typically changes to the system supported by patent owners. Two main areas of focus are “Section 101” and the “PTAB.” Below is a summary of two such efforts currently ..."
    },
    {
        "url": "https://www.thenewdaily.com.au/news/politics/australian-politics/2024/02/01/biggest-political-donors-revealed",
        "title": "Biggest political donors revealed amid calls for <b>reform</b>",
        "description": "A mining tsar, environmental advocate and lobby group rank among Australia&#39;s major political donors with calls to improve funding integrity and transparency."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/31/northern-ireland-dup-sinn-fein-stormont-pmqs-rishi-sunak-keir-starmer-latest-politics-updates?page=with:block-65ba6f338f0820d0f275ac69",
        "title": "Brexiters and unionists raise concerns but MPs largely back No 10’s plan for Northern Ireland – UK politics live",
        "description": "The newly-published proposals include a commitment to removing checks on goods moving from GB to NI"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-uk-green-energy-2030-2880978?ITO=msn",
        "title": "Labour plans to fix UK’s green energy problem by 2030 – but doubts are growing",
        "description": "The party has pledged for all electricity generation to come from low-carbon sources by 2030, which has been plunged into doubt following fresh delays to the nuclear energy development at Hinkley Point. Energy firm EDF announced last week that the si te could be subject to further delays and more costs due to Brexit and inflation."
    },
    {
        "url": "https://www.standard.co.uk/business/ftse-100-ipo-market-b1136108.html",
        "title": "Ringing in the changes - will regulatory <b>reform</b> boost the UK’s IPO market?",
        "description": "Much has been made of the ‘parlous’ state of the UK’s IPO market of late. Some commentators have described the US listings of companies such as ARM and CRH as ‘blows’ to London, citing better valuations and liquidity prospects in the US,"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24085553.flick-drummond-welcomes-ofsted-reform-recommendations/",
        "title": "Flick Drummond welcomes Ofsted <b>reform</b> recommendations",
        "description": "MEON Valley MP FLICK Drummond has welcomed the Education Select Committee’s recommendations to reform Ofsted. A review of Ofsted’s single-word judgements such as ‘outstanding or ‘inadequate’ is among a series of proposals the cross-party committee, on which Ms Drummond sits, has issued to the watchdog and the Government in a new report."
    },
    {
        "url": "https://www.civilserviceworld.com/professions/article/dluhc-perm-sec-quizzed-over-staffsatisfaction-and-25-turnover",
        "title": "DLUHC perm sec quizzed over staff satisfaction and 25% turnover",
        "description": "Department for Levelling Up, Housing and Communities permanent secretary Sarah Healey has said that high turnover at the organisation is partly due to low pay in comparison with other parts of government."
    },
    {
        "url": "https://www.scotsman.com/news/crime/trials-scotland-lord-advocate-dorothy-bain-warns-jury-system-changes-could-make-it-far-more-difficult-to-find-people-guilty-4499775",
        "title": "Trials Scotland: Lord Advocate Dorothy Bain warns jury system changes could make it &#39;far more difficult&#39; to find people guilty",
        "description": "The Scottish Government has previously been accused of &quot;arrogantly&quot; ignoring the views of the legal profession as it considers plans to reform rape trials"
    },
    {
        "url": "https://leftfootforward.org/2024/01/who-funds-the-reform-uk-party/",
        "title": "Who funds the <b>Reform</b> UK Party?",
        "description": "Formerly known as the Brexit Party before its rebrand, the party saw a funding peak during the 2019 election year, when the House of Commons reported that the Party received the highest average value per donation, at £461,111, however registered only received nine donations from two individuals."
    },
    {
        "url": "https://www.itv.com/news/westcountry/2024-01-31/kingswood-by-election-all-you-need-to-know",
        "title": "Kingswood by-election: All you need to know",
        "description": "The Kingswood by-election will take place on Thursday 15 February. It was triggered by the resignation of Conservative MP Chris Skidmore, who quit in protest against government proposals to boost North Sea oil and gas drilling."
    },
    {
        "url": "https://www.cypnow.co.uk/news/article/children-s-commissioner-radical-reform-of-send-needed-to-end-delays-supporting-children",
        "title": "Children&#39;s commissioner: Radical <b>reform</b> of SEND needed to end delays supporting children",
        "description": "Children’s Commission for England Dame Rachel de Souza is calling for “radical reform” of the special educational needs and disabilities (SEND) system to ensure delays around support for families are addressed."
    },
    {
        "url": "https://www.ft.com/content/ed960d70-6248-4254-b688-76275c5324b2",
        "title": "Rishi Sunak’s ‘Italian Job’ moment",
        "description": "Wobbles damage the prime minister but Tory critics have no solutions — and are implicated in the years of chaos"
    },
    {
        "url": "https://www.fleetnews.co.uk/news/reform-of-heavy-vehicle-testing-regime-for-earned-recognition-members",
        "title": "<b>Reform</b> of heavy vehicle testing regime for Earned Recognition members",
        "description": "Further work will have to be carried out before any reform of the heavy vehicle testing regime for operators who are part of DVSA’s Earned Recognition scheme."
    }
]