[
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/disillusioned-true-blue-tory-defects-richard-tice-reform/",
        "title": "‘Disillusioned true blue Tory’ to stand as MP for Richard Tice’s <b>Reform</b> UK",
        "description": "But after jumping ship to <b>Reform</b> UK at the end of 2022, Mr White, 59, is preparing to stand against the Conservatives and a shadow Labour minister candidate in the new constituency of Barnsley East at this year’s general election. Mr White, a councillor ..."
    },
    {
        "url": "https://www.cornwalllive.com/news/uk-world-news/royal-mail-could-scrap-saturday-9047728?int_source=nba",
        "title": "Royal Mail &#39;could scrap Saturday post&#39; as part of radical Ofcom overhaul",
        "description": "Keith Williams, the non-executive chair of Royal Mail&#39;s owner International Distributions Services, said at the time &quot;urgent <b>reform</b>&quot; was needed. He added: &quot;The government has now been approached to seek an early move to five day letter delivery ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860619/tory-plotters-rishi-sunak-may-coup-comment",
        "title": "Tory plotters warned that May day coup against Rishi Sunak is &#39;too late&#39; to oust the PM",
        "description": "But the biggest worry of all is Wellingborough which has become a test for how far <b>Reform</b> UK&#39;s vote has grown. Currently Richard Tice&#39;s party is getting between 9 and 13 percent in the polls. Enough, as Ms Badenoch noted today, to wipe the Tories out by ..."
    },
    {
        "url": "https://www.ft.com/content/c766eea0-08bd-47a7-a162-6640a693264f?trk=public_post_comment-text",
        "title": "Argentina’s unions pledge ‘total strike’ as Javier Milei pushes economic reforms",
        "description": "But he said that, though he held talks with Milei officials soon after the president took office last month, “nothing we agreed was reflected in the labour <b>reform</b> they suddenly presented, which breaks Argentina’s social contract”. Milei’s ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "R eform UK is now polling consistently in joint third alongside the Liberal Democrats amid anger at the Conservatives over their handling of illegal migration, The Telegraph’s tracker shows. Richard Tice’s party is holding on to a 10 per cent share of national voting intention, which puts it on an equal footing with the Lib Dems."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68117596.amp",
        "title": "Laura Kuenssberg: What do voters think of party leaders? Not a lot",
        "description": "&quot;It&#39;s like he&#39;s reading from a script when he talks,&quot; Lib Dem-supporting Rebecca said. While <b>Reform</b> UK voter Tracy thinks Mr Sunak has &quot;no personality&quot;. Voters have also taken notice of the Conservative in-fighting. Image caption, Sheila said there was ..."
    },
    {
        "url": "https://uk.news.yahoo.com/key-border-deal-negotiator-says-150044416.html",
        "title": "Key border deal negotiator says bipartisan agreement has been reached, could be ready next week",
        "description": "“Republicans have said openly they want to pass border and immigration <b>reform</b>,” he said. “All of a sudden, they are against border and immigration <b>reform</b> because they are afraid it’s actually going to pass and many Republicans in the House and some ..."
    }
]