[
    {
        "url": "https://betting.betfair.com/politics/uk-politics/wellingborough-by-election-odds-could-reform-breakthrough-destabilise-rishi-sunak-090224-171.html",
        "title": "Wellingborough By-Election Odds: Could <b>Reform</b> breakthrough destabilise Rishi Sunak?",
        "description": "Even assuming Labour get 50%, that leaves over 40% expected for parties of the Right. Thus the 15% under/over line in our <b>Reform</b> Vote Share market looks a realistic target. Whilst nowhere near the levels achieved by Farage with UKIP or the Brexit Party ..."
    },
    {
        "url": "https://www.thesun.co.uk/money/25854577/improve-rental-health-fight-back-over-no-fault-evictions/",
        "title": "Easiest way for renters to fight back against no-fault evictions as ban reforms are on ‘life support’",
        "description": "THOUSANDS more renters were forced out of their homes through hated no-fault evictions last year compared with 2022. The number of notices served in England in 2023 shot up by almost a third to"
    },
    {
        "url": "https://www.intellinews.com/tashkent-stock-exchange-raising-its-game-on-marked-gains-in-reform-and-retail-311882/",
        "title": "Tashkent Stock Exchange raising its game on marked gains in <b>reform</b> and retail",
        "description": "Delving into pivotal shifts of Uzbekistan&#39;s capital market throughout 2023, Odil Musaev, managing director at investment banking boutique Alkes"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865388/reform-uk-rishi-sunak-wellingborough-kingswood-by-elections",
        "title": "‘He’s toast!’ <b>Reform</b> taunts Rishi Sunak as PM fights for Brexiteer vote in by-elections",
        "description": "Reform UK candidate Ben Habib believes Rishi Sunak cannot fight back as Conservatives try to hold on to Wellingborough and Kingswood seats in by-elections."
    },
    {
        "url": "https://www.theguardian.com/money/2024/feb/10/its-literally-giving-somebody-money-for-nothing-the-battle-to-reform-property-leaseholds",
        "title": "‘It’s literally giving somebody money for nothing’: the battle to <b>reform</b> property leaseholds",
        "description": "Michael Gove, the housing secretary, has pledged to tackle ground rents as part of the leasehold <b>reform</b> bill now making its way through parliament. He has described the system as “feudal”. The new legislation will ban leaseholds on new houses in ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24110097.asn-reform-scotland-set-hold-protest-greenock/",
        "title": "ASN <b>Reform</b> Scotland set to hold protest in Greenock",
        "description": "A PORT Glasgow mum is leading a national protest to end inequality in education for children with additional support needs in Inverclyde"
    },
    {
        "url": "https://www.politico.eu/article/european-council-parliament-strike-provisional-deal-eu-fiscal-rule-framework/",
        "title": "Council, Parliament strike provisional deal on EU fiscal-rules framework",
        "description": "Negotiators for the European Council and the European Parliament struck an eleventh-hour deal on the <b>reform</b> of the bloc&#39;s economic governance framework early Saturday morning. &quot;The new rules [...] will safeguard balanced and sustainable public finances ..."
    },
    {
        "url": "https://www.wrexham.com/news/final-touches-added-to-long-awaited-bill-to-reform-wales-bus-services-247022.html",
        "title": "Final touches added to long awaited bill to <b>reform</b> Wales’ bus services",
        "description": "Mark Drakeford said the bill will enable all levels of government to work with communities to design and deliver the services they need. ‌﻿​﻿‌﻿‌﻿​﻿​﻿​﻿‌﻿‍﻿‌﻿​﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿​﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿​"
    },
    {
        "url": "https://inews.co.uk/news/politics/tech-companies-amazon-business-rates-labour-2900121?ico=more_from_this_author",
        "title": "Big tech faces higher rates under Labour to help high street shops",
        "description": "Labour will reveal plans to increase taxes on large technology companies in its election manifesto, i understands. The party has scrapped plans for a new levy on digital services which would have forced US-based firms to pay more tax in Britain."
    },
    {
        "url": "https://www.independent.com.mt/articles/2024-02-10/local-news/Public-consultation-on-drug-reform-White-Paper-concludes-6736258494",
        "title": "Public consultation on drug <b>reform</b> White Paper concludes",
        "description": "In a statement, the Ministry for Justice said that submissions from stakeholders and citizens, among others, showed a positive response in the public consultation on the <b>reform</b> aimed at achieving a fair and effective balance between the interests of ..."
    },
    {
        "url": "https://www.independent.co.uk/news/qatar-ap-fifa-amnesty-international-doha-b2494041.html",
        "title": "Post-World Cup, Qatar is pressing ahead with labor reforms but concerns for migrant workers remain",
        "description": "The enduring image of the 2022 World Cup was Lionel Messi holding aloft soccer’s biggest prize in Qatar&#39;s spectacular Lusail Stadium"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/10/labour-starmer-plan-new-storm-workers-rights-regulations/",
        "title": "Inside Labour’s plan for a storm of regulations at work",
        "description": "The proposed changes include introducing “day one” workers’ rights, ending zero-hour contracts, banning fire and rehire practices, bringing in a “right to switch off” for workers, increasing the minimum wage and beefing up laws that block companies from blacklisting union workers."
    }
]