[
    {
        "url": "https://www.baltimoresun.com/2024/02/14/maryland-democrats-ticket-scalping-bill/",
        "title": "Maryland Democrats target live-event scalpers with ticket <b>reform</b> bill",
        "description": "State lawmakers are proposing legislation that cracks down on ticket scalping in Maryland, hoping to stop unfair ticket prices and bad actors in the resale market."
    },
    {
        "url": "https://www.huffpost.com/entry/parkland-victims-parents-gun-reform-kansas-shooting_n_65cd4e5be4b02493f348ab9c",
        "title": "Parkland Victim&#39;s Parents End Up Talking About Kansas Shooting During CNN Anniversary Interview",
        "description": "The parents were scheduled for an on-set interview with CNN to discuss their gun reform work just as news broke about the Kansas City shooting."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-faces-electoral-tests-risk-000100344.html",
        "title": "Sunak Faces Electoral Tests That Risk Encouraging Tory Plotters",
        "description": "Still, much of the political focus will be on the <b>Reform</b> UK party and its ability to siphon off support from the Conservatives. That is the nightmare scenario for many Tory Members of Parliament, who fear a split in the right-wing vote will facilitate a ..."
    },
    {
        "url": "https://www.landlordtoday.co.uk/breaking-news/2024/2/generation-rent-activists-link-brownfield-homes-with-section-21",
        "title": "Generation Rent activists link Brownfield Homes with Section 21",
        "description": "Generation Rent has given a qualified thumbs up to Housing Secretary Michael Gove’s ideas for homes on brownfield land."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24120912.sunak-braced-double-by-election-test-wellingborough-kingswood/",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/us-trade-chief-looks-incremental-001015696.html",
        "title": "US trade chief looks for incremental <b>reform</b> at WTO meeting",
        "description": "U.S. Trade Representative Katherine Tai said on Wednesday that she is taking a &quot;pragmatic&quot; approach to the World Trade Organization&#39;s next ministerial meeting, aiming for incremental but meaningful improvements that sustain the trade body&#39;s reform momentum."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-68292604",
        "title": "French citizenship row engulfs Indian Ocean island of Mayotte",
        "description": "A speck of France in the Indian Ocean has become the latest battleground over the laws on immigration. A French possession since 1841, the tiny island of Mayotte is now a département or county of the Republic which means, in theory, that the same rules apply there as in the Moselle or Maine-et-Loire, or anywhere else in France."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-wellingborough-peter-bone-government-jewish-b1139237.html",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.which.co.uk/news/article/which-campaign-brings-clearer-food-pricing-and-more-budget-groceries-aTPdN4q6ZCEl",
        "title": "Which? campaign brings clearer food pricing and more budget groceries",
        "description": "The Competition and Markets Authority (CMA), which is the regulator for the grocery sector, has also told supermarkets to make prices clearer. And the government has promised to revamp the rules around unit pricing. Get a firmer grip on your finances with the expert tips in our Money newsletter – it&#39;s free weekly."
    },
    {
        "url": "https://www.lettingagenttoday.co.uk/breaking-news/2024/2/housing-courts-the-best-way-to-counter-threat-of-s21-removal--claim",
        "title": "Housing Courts the best way to counter threat of S21 removal - claim",
        "description": "Within the Renters <b>Reform</b> Bill, the proposal to remove Section 21 has proven both complicated and a subject that has lacked the defined clarity which is needed. Back in November, just before the bill was to gain its second reading within parliament ..."
    }
]