[
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-sinking-feeling-58-mps-32156072",
        "title": "&#39;Tories sinking feeling as 58 MPs announce plans to abandon Conservative ship&#39;",
        "description": "Some 58 Tory MPs have already announced they are quitting next time around but the figure could top 100 – by some counts even 150"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/sunak-warned-against-playing-footsie-with-farage-and-reform-uk-100315/",
        "title": "Sunak warned against ‘playing footsie’ with Farage and <b>Reform</b> UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://okcfox.com/news/local/oklahomans-rally-at-state-capitol-advocating-for-medical-freedoms-and-reform-state-representative-justin-jj-humphrey-covid19-pandemic-coronavirus-medical-professionals-oklahoma-lawmaker-covid-vaccine",
        "title": "Oklahomans rally at State Capitol advocating for medical freedoms and <b>reform</b>",
        "description": "Oklahomans gathered on Saturday for a Medical Freedom Rally at the State Capitol, with speakers ranging from people who lost their loved ones, to doctors and st"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "Rishi Sunak warned against &#39;playing footsie&#39; with Nigel Farage and <b>Reform</b> UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-patten-prime-minister-nigel-farage-labour-neil-kinnock-b1139917.html",
        "title": "Sunak warned against ‘playing footsie’ with Farage and <b>Reform</b> UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13098085/JK-Rowling-donates-Scottish-feminist-campaigners-help-Supreme-Court-appeal-against-definition-woman.html",
        "title": "JK Rowling donates £70,000 to Scottish feminist campaigners to help their Supreme Court appeal against the definition of &#39;woman&#39;",
        "description": "Harry Potter author JK Rowling has donated £70,000 to a feminist campaign to help their Supreme Court appeal against the definition of a woman."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868055/Pollster-john-curtice-Labour-government",
        "title": "Pollster John Curtice predicts &#39;trouble&#39; for Labour within months of getting keys to No10",
        "description": "<b>Reform</b> UK secured an unexpectedly high number of votes, reaching 13 percent in Wellingborough and 10.4 percent in Kingswood. Analysts have highlighted that for every voter who supported the Conservative Party in 2019 but have now switched to Labour ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/opinion/24121411.lack-council-tax-reform-slammed-labour-msp-katy-clark/",
        "title": "Lack of council tax <b>reform</b> slammed by Labour MSP Katy Clark",
        "description": "THE Scottish Government has now passed Stage 1 of its budget for the next year. Incredibly, ministers have had the gall to describe it"
    },
    {
        "url": "https://www.scotsman.com/news/politics/sunak-defended-after-by-election-defeats-set-against-difficult-backdrop-4523157",
        "title": "Sunak defended after by-election defeats set against ‘difficult backdrop’",
        "description": "A Conservative minister has defended Rishi Sunak and the party after two by-election defeats, saying they were set against a “very difficult backdrop”. The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened Reform UK party, were the latest blow to the Prime Minister."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/18/database-police-officer-background-checks",
        "title": "New US background database unlikely to stop police misconduct, critics warn",
        "description": "Experts say new DoJ program intended to track backgrounds of federal police unlikely to solve problem of ‘wandering officers’"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hcnjnb",
        "title": "Can the Tories win back the <b>Reform</b> vote?",
        "description": "&#39;A vote for Reform is a vote to let Labour in&#39; says Conservative minister Today, we look at where the Conservatives go now after big byelection losses in the week, and how the West might respond to the death of the Russian opposition leader Alexei Navalny."
    },
    {
        "url": "https://uk.news.yahoo.com/more-150-landlord-repossession-claims-190000875.html",
        "title": "More than 150 landlord repossession claims threatened renters in Bucks last year",
        "description": "Landlords in Buckinghamshire filed more than 150 repossession claims last year, new figures show. Across England and Wales, landlord repossession claims rose by more than a tenth in the three months to December 2023 compared with the same period in 2022,"
    },
    {
        "url": "https://www.lse.co.uk/news/uk-pm-rishi-sunak-defended-after-bruising-by-election-defeats-249f05hdkob0x3k.html",
        "title": "UK PM Rishi Sunak defended after bruising by-election defeats",
        "description": "The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened <b>Reform</b> UK party, were the latest blow to the prime minister. The Conservative government has endured more by-election losses than any administration since ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/safety-rwanda-bill-flights-asylum-seekers-michael-tomlinson/",
        "title": "Flights carrying asylum seekers to Rwanda will leave when law is passed, says Michael Tomlinson",
        "description": "Minister for illegal migration says ‘planes will take off’ as soon as Safety Bill has been ratified in Parliament"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868006/conservatives-reform-pact-nigel-farage",
        "title": "Tory MP pinpoints why &#39;false strategy&#39; pact with Nigel Farage and <b>Reform</b> UK is doomed",
        "description": "A senior Tory MP has insisted his party should not entertain a pact with Nigel Farage and Reform UK at the next general election. Tobias Ellwood, who represents Bournemouth East, insisted the centre ground is where ballots are won."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-minister-maria-caulfield-pocketed-32153255",
        "title": "Tory minister Maria Caulfield pocketed £8,000 pay-off then returned to job seven weeks later",
        "description": "Maria Caulfield received £7,920 in severance when she was sacked as a Health Minister in September 2022, but kept the money when she returned to her old department weeks later"
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-best-result-rishi-sunak-election-2909342?ico=more_from_this_author",
        "title": "<b>Reform</b>’s best-ever election result is not Sunak’s biggest concern",
        "description": "<b>Reform</b> UK secured its best ever by-election results on Friday, in a result that will give the Conservatives even more cause for concern ahead of the general election. The party scored double-digit vote shares to come third in both Wellingborough and ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13078995/Ofsted-Ruth-Perry-inadequate-failing-school.html",
        "title": "EXCLUSIVEInteractive map reveals Ofsted&#39;s worst-rated primary schools in England - is YOUR child&#39;s on the list?",
        "description": "So far in 2024, some 725 primary schools have received an Ofsted report. Most have been in the Good (66 per cent)  or Outstanding (16.7 per cent) categories."
    }
]