[
    {
        "url": "https://www.cityam.com/labour-well-unashamedly-champion-financial-services-as-party-plots-rulebook-reform/",
        "title": "Labour: We’ll ‘unashamedly champion’ financial services as party plots rulebook <b>reform</b>",
        "description": "Conservative ministers have similarly pushed ahead with regulatory <b>reform</b> efforts to try and revive the UK’s appeal as a financial centre. City minister Bim Afolami told City A.M.’s Bonds &amp; Ballots series last week the government was looking to spur a ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/argentina-court-rules-milei-labor-191536320.html",
        "title": "Argentina Court Rules Milei’s Labor <b>Reform</b> Unconstitutional",
        "description": "(Bloomberg) -- An Argentine court ruled that the labor <b>reform</b> President Javier Milei tried to implement through decree is unconstitutional, the latest blow to his plans to overhaul South America’s second-largest economy. Most Read from Bloomberg Musk ..."
    },
    {
        "url": "https://www.thestranger.com/news/2024/01/30/79364743/council-president-sara-nelson-opposes-effort-to-increase-voter-turnout",
        "title": "Council President Sara Nelson Opposes Effort to Increase Voter Turnout",
        "description": "Seattle City Council President Sara Nelson, ever out of sync with local Democrats, expressed “real strong concern” for a pair of bills in the Legislature that would give jurisdictions the option to switch their local elections from odd to even years, a reform that passed with overwhelming support in a 2022 King County ballot initiative."
    },
    {
        "url": "https://www.irishnews.com/news/world/argentinian-court-overturns-mileis-labour-rules-in-blow-to-his-reform-plans-5VPJ6IL2GJPHZHIZVDLPRH4GRY/",
        "title": "Argentinian court overturns Milei’s labour rules in blow to his <b>reform</b> plans",
        "description": "An Argentine court on Tuesday overturned labour rules proposed by President Javier Milei that would make it easier to sack workers, in a new blow to the leader’s efforts to shake up regulations that he says have hampered the country’s struggling ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25614722/labour-town-halls-foreign-nationals-social-housing/",
        "title": "Labour-led town halls favouring foreign nationals for social housing over Brits, reveals data",
        "description": "LABOUR-led town halls are favouring foreign nationals for social housing over Brits, fresh data has revealed. Fourteen of the top 20 councils that let a higher proportion of their social homes to"
    },
    {
        "url": "https://www.ross-shirejournal.co.uk/news/local-democracy-new-ross-shire-community-councillors-reveal-340731/",
        "title": "Ross-shire community councils <b>reform</b> – with elections triggered for two",
        "description": "FOUR Ross-shire community councils which had fallen into abeyance have reformed after a call for candidates. And there will potentially be an election to two others– Nigg and Shandwick and Dornie and District– after more nominations than vacancies ..."
    },
    {
        "url": "https://uk.news.yahoo.com/reform-uk-ready-general-election-115321043.html",
        "title": "<b>Reform</b> UK will be ready for general election, Tice says",
        "description": "<b>Reform</b> UK leader Richard Tice says his party will be ready for a general election and urged Labour to stand aside, as he claims he did for the Conservatives in 2019."
    }
]