[
    {
        "url": "https://www.hamhigh.co.uk/news/24066185.chris-arnold-says-jury-service-unfair-needs-reform/",
        "title": "Chris Arnold says jury service unfair and needs <b>reform</b>",
        "description": "Approximately two decades ago, I did my first stint of jury service – an experience both intriguing and somewhat chaotic. My reflection on the system leans toward scepticism and a firm belief that it is unjust to jurors and in dire need of <b>reform</b>."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13013187/DAN-HODGES-Rishi-call-bluff-rebels-John-Major.html",
        "title": "DAN HODGES: Rishi has to call the bluff of rebels just like John Major did - or else suffer death by a thousand cuts",
        "description": "It will be a series of interventions, based around different trigger points. The polls are going to continue to get worse. &#39;<b>Reform</b> [formerly Ukip] will continue to gain ground. We&#39;ve got by-elections coming up – they will be a disaster. And then we&#39;ve ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/27/terrorists-money-launderers-trespassers-social-housing/",
        "title": "Terrorist money launderers have right to social housing, Government says",
        "description": "Consultation aiming to restrict eligibility rules does not bar those convicted under certain extremism charges"
    },
    {
        "url": "https://www.ctvnews.ca/mobile/politics/trudeau-and-singh-s-teams-quietly-planning-electoral-reform-legislation-1.6744379?clipId=104056",
        "title": "Trudeau and Singh&#39;s teams quietly planning electoral <b>reform</b> legislation",
        "description": "As progress on some measures in the Liberal-NDP confidence-and-supply agreement continue to play out publicly, the two parties have quietly been in talks to table electoral <b>reform</b> legislation before the next federal vote. Leading these negotiations on the ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-defence-secretary-to-face-questions-as-uk-sends-military-assets-to-the-middle-east-12593360?postid=6589138.",
        "title": "Politics latest: More names of plotters trying to oust Rishi Sunak expected to be revealed; <b>Reform</b> UK surges in polls",
        "description": "With <b>Reform</b> now level pegging with the Lib Dems in the Sky News poll tracker (see post at 7.54), their analysis is that the Tory party faces possible extinction if Nigel Farage joins the election campaign. So anything is worth a try. The Plot - led by a ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-inquiry-money-sunak-coup-2876275",
        "title": "Tory HQ probe into money behind Sunak coup amid <b>Reform</b> donor concerns",
        "description": "Conservatives will strip the whip from those working with mysterious group - including Lord Frost - if they have accepted funds from Reform donors"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860263/rishi-sunak-wellingborough-byelection-ben-habib-reform",
        "title": "Rishi Sunak set to be rocked by &#39;seismic&#39; by-election as <b>Reform</b> unleashes volunteer army",
        "description": "The <b>Reform</b> UK candidate has given an exclusive interview to Express.co.uk following his declaration that the by-election in Brexit heartlands is &quot;a referendum on the Sunak government&quot;. It comes as Tory MPs have privately said they are looking closely at ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/tory-party-rishi-sunak-nigel-farage-coup/",
        "title": "The plotters, the coup and Farage’s path to the Tory throne",
        "description": "Does Canada offer a blueprint for the predicted Conservative electoral wipeout – and a saviour to &#39;unite the Right&#39; rising from the flames?"
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-inquiry-money-sunak-coup-2876275?ITO=msn",
        "title": "Tory inquiry into money behind Sunak coup bid amid <b>Reform</b> donor concerns",
        "description": "Conservatives will strip the whip from those working with mysterious group - including Lord Frost - if they have accepted funds from Reform donors"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860103/nigel-farage-general-election-poll",
        "title": "POLL: Do you think Nigel Farage could win a general election? Vote here",
        "description": "Nigel Farage has revealed his aim would be to win a general election if he makes a political comeback. Speculation is high over whether the former Ukip leader, who is currently honorary president of Reform UK, will return to frontline politics."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68098173?at_campaign=Social_Flow&at_link_id=7D9971FC-BC5F-11EE-A6F5-7BF054826ABF&at_ptr_name=twitter&at_medium=social&at_bbc_team=editorial&at_link_origin=BBCPolitics&at_link_type=web_link&at_campaign_type=owned&at_format=link",
        "title": "Council tax bands need overhauling, northern business group says",
        "description": "&quot;If he was given free rein, I think we could have seen state council tax <b>reform</b> before the general election, but I&#39;m not sure No 10 necessarily have the reforming zeal that perhaps Michael does.&quot; NPP has also called for additional council tax bands to be ..."
    },
    {
        "url": "https://www.ekklesia.co.uk/2024/01/27/a-better-fairer-social-care-system-in-england-is-affordable/",
        "title": "A better, fairer social care system in England is affordable",
        "description": "ENDING the cycle of broken promises to <b>reform</b> social care funding in England must be a priority for the next government, a Health Foundation report says. Currently, Government only covers the costs of care for people with the highest needs and lowest means."
    },
    {
        "url": "https://www.heraldscotland.com/news/24067513.juryless-rape-trial-pilot-doubt-lawyers-prepare-boycott/?ref=twtrec",
        "title": "Juryless rape trial pilot in doubt as lawyers prepare to boycott",
        "description": "The Herald understands the Scottish Solicitor Bar Association (SSBA) is set to ballot members on the controversial proposal in the new Victims, Witnesses and Justice <b>Reform</b> (Scotland) Bill. They said it would be tantamount to professional misconduct for a ..."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/analysis-tax-reform-is-the-task-no-party-wants-to-take-on-4494837",
        "title": "Analysis: Tax <b>reform</b> is the task no party wants to take on",
        "description": "At a time of high inflation, state pensions go up while the value of your wages go down. Nobody likes taxes, they’re unfair, but nobody wants to <b>reform</b> them. Earlier this week Rachel Reeves told The Yorkshire Post that she is not looking for a major ..."
    }
]