[
    {
        "url": "https://www.thenational.scot/politics/24102390.supine-distasteful-rishi-sunak-believes-human-life-cheap/",
        "title": "Supine and distasteful Rishi Sunak believes human life is cheap",
        "description": "IAN Murray confirmed on BBC’s Question Time from Glasgow what most of us already knew, that there is “no difference” in the stances of Anas Sarwar and <b>Keir Starmer</b>, even over Middle East policies, as neither politician is actually calling for an ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/how-wish-grown-a-time-internet-20234415/?preview_id=20234415",
        "title": "How I wish I’d grown up in a time without the internet",
        "description": "(Credits: Getty Images/iStockphoto) So, the Labour Party is worried that Muslims are turning away over its stance on Israel’s war in Gaza and will not vote for Sir <b>Keir Starmer</b> in the next election. As a woman of colour, where does that leave us Afro ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/06/keir-starmer-labours-28bn-green-investment-desperately-needed",
        "title": "<b>Starmer</b> ‘unwavering’ over Labour green pledge despite claims party dropping it",
        "description": "Labour leader says £28bn green investment ‘desperately needed’ after sources said last week Labour were planning to ditch policy"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/labour-28bn-green-pledge-confusion-tories-election/",
        "title": "Labour’s £28bn green pledge confusion ‘gives Tories election hope’",
        "description": "Strategists believe leadership’s uncertain approach could bode well for Conservatives if replicated in campaign"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/clare-haughey-challenges-michael-shanks-32061068",
        "title": "Clare Haughey challenges Michael Shanks on prioritising bankers’ bonuses over child benefits",
        "description": "This stems from October when Labour’s Shadow Chancellor Rachel Reeves criticized the Tories for scrapping bankers’ bonus cap, before later U-turning, alongside Labour not committing to ending the two-child benefit cap – which is affecting 1.5 million children."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?page=with%3Ablock-65c1fa588f08001288228f86",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/king-charles-health-updates-cancer-news/",
        "title": "Prince Harry updates — Duke meets King Charles without Meghan as Buckingham Palace announces monarch’s cancer diagnosis",
        "description": "KING Charles has been diagnosed with cancer, Buckingham Palace announced in a statement. The King, 75, has started treatment and was advised by doctors to cancel front line duties. In its"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863804/Keir-Starmer-BAME-pay-rights",
        "title": "<b>Keir Starmer</b> slapped down with humiliating fact check over latest woke policy",
        "description": "The Labour leader has pledged full equal pay for ethnic minorities, but has left embarrassed thanks to one key fact."
    },
    {
        "url": "https://www.itv.com/news/2024-02-06/meta-to-label-ai-created-images-on-facebook-and-instagram",
        "title": "Facebook and Instagram to label AI images to curb disinformation ahead of global elections",
        "description": "A number of prominent politicians, including Prime Minister Rishi Sunak, Labour leader Sir <b>Keir Starmer</b> and Mayor of London Sadiq Khan have been the targets of manipulated media or deepfakes in recent months. In a blog post on the announcement, Sir Nick ..."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24098436.sunak-insists-brighter-future-ahead-amid-doubts-economic-growth/",
        "title": "Sunak insists there is ‘brighter future ahead’ amid doubts over economic growth",
        "description": "Prime Minister Rishi Sunak acknowledged it was not clear whether his promise to grow the economy would be met or if GDP had flatlined."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13048271/Camilla-stepping-royal-duties-King-Charles-cancer.html",
        "title": "Queen Camilla, 76, is the &#39;steady hand on the tiller&#39; who&#39;s stepping up the pace of her royal duties amid Charles&#39; cancer diagnosis, despite saying it&#39;s &#39;very tiring&#39; - and ...",
        "description": "Following news from Buckingham Palace that King Charles has cancer, Queen Camilla is faces a tough time as she steps up and takes on increasing duties/"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/rishi-sunak-latest-news-rwanda-bet-starmer-green-dup/",
        "title": "‘We’ve failed to take on Left-wing extremists,’ Truss tells Popular Conservatism group launch – live updates",
        "description": "Rishi Sunak said he was “taken totally by surprise” by a £1,000 bet with Piers Morgan on the Government’s Rwanda policy. Mr Morgan bet the Prime Minister £1,000 to a refugee charity that Rwanda migrant deportation flights would not take off before the next general election."
    },
    {
        "url": "https://uk.news.yahoo.com/hunt-claims-tax-rises-needed-195754252.html",
        "title": "Hunt claims tax rises needed to fund Labour’s £28bn green spending pledge",
        "description": "Mr Hunt’s remarks came as Labour leader Sir <b>Keir Starmer</b> said the funding package is “desperately needed” for his party’s mission to achieve clean power by 2030. Labour originally promised in 2021 to invest £28 billion a year until 2030 in green ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863748/Sir-Keir-Starmer-Tax-Bombshell-Green",
        "title": "Sir <b>Keir Starmer</b>&#39;s green plan risks landing families with £1,400 tax bombshell",
        "description": "Sir Keir Starmer’s £28 billion green plans would lead to a £1,400 tax bombshell for the average family, the Chancellor warned. Labour’s leader was accused of a “triple flip flop” after again changing course on his clean energy pledge."
    },
    {
        "url": "https://www.irishnews.com/news/uk/meta-to-label-images-on-facebook-and-instagram-which-were-created-by-ai-XLRXLP3MQZJQPGB7E3SWSID6L4/",
        "title": "Meta to label images on Facebook and Instagram which were created by AI",
        "description": "A number of prominent politicians, including Prime Minister Rishi Sunak, Labour leader Sir <b>Keir Starmer</b> and Mayor of London Sadiq Khan have been the targets of manipulated media or deepfakes in recent months. In a blog post on the announcement, Sir Nick ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24100639.starmer-adds-confusion-labours-28bn-green-investment/?ref=rss",
        "title": "<b>Starmer</b> adds to confusion over Labour&#39;s £28bn green investment",
        "description": "Sir Keir Starmer has denied scaling back Labour’s commitment to green investment, despite the party moving away from their promise to spend"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13050795/Labour-green-investment-Keir-Starmer-shadow-chancellor-Reeves.html",
        "title": "Labour shambles on £28bn green investment drive as <b>Keir Starmer</b> insists the policy is &#39;desperately needed&#39; - despite shadow chancellor Rachel Reeves warning the government ...",
        "description": "Labour&#39;s shambles over the £28billion green investment drive deepened today after <b>Keir Starmer</b> insisted the policy is &#39;desperately needed&#39;. Sir <b>Keir</b> said he was &#39;unwavering&#39; over the party&#39;s plans for cleaner energy by 2030, denying they were being ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/keir-starmer-says-28bn-desperately-28577698",
        "title": "<b>Keir Starmer</b> says £28bn is &#39;desperately needed&#39; for Labour&#39;s green energy mission",
        "description": "Sir <b>Keir Starmer</b> has said £28 billion is &quot;desperately needed&quot; for Labour&#39;s mission to achieve clean power by 2030 amid confusion over the party&#39;s commitment to the investment pledge. The Labour leader insisted he had been &quot;unwavering&quot; in relation to the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-28-billion-investment-desperately-093254231.html",
        "title": "<b>Starmer</b>: £28 billion investment ‘desperately needed’ for our clean power mission",
        "description": "Sir <b>Keir Starmer</b> has said £28 billion is “desperately needed” for Labour’s mission to achieve clean power by 2030 amid confusion over the party’s commitment to the investment pledge. The Labour leader insisted he had been “unwavering” in ..."
    },
    {
        "url": "https://www.voice-online.co.uk/news/uk-news/2024/02/06/exclusive-black-groups-shut-out-from-labours-launch-of-its-race-equality-plans/",
        "title": "EXCLUSIVE: Black groups shut out from Labour’s launch of its Race Equality plans",
        "description": "However, Black MPs, community media and leading campaign groups were not invited, leading to accusations from party members we spoke to that the Labour party intentionally excluded them in a bid to censor opportunities to grill party leader <b>Keir Starmer</b> ..."
    },
    {
        "url": "https://www.businessgreen.com/news/4170894/enormous-achievement-confirms-uk-emissions-halved-1990",
        "title": "&#39;Enormous achievement&#39;: Data confirms UK emissions have halved since 1990",
        "description": "In related, the internal party row over Labour&#39;s pledge to ramp up annual climate spending to £28bn a year during the second half of the next Parliament to help deliver on the UK&#39;s climate goals took another twist today, after <b>Keir Starmer</b> voiced his ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/piers-morgan-gary-lineker-send-support-king-charles-cancer-diagnosis-20229406/?ico=metro-posts_article_whats-trending-now",
        "title": "Piers Morgan and Gary Lineker send messages of support to King Charles after cancer diagnosis",
        "description": "Labour leader Sir <b>Keir Starmer</b> has wished the King ‘all the very best for his recover’ after he was diagnosed with a form of cancer. Sir <b>Keir</b> tweeted: ‘On behalf of the Labour Party, I wish His Majesty all the very best for his recovery."
    },
    {
        "url": "https://www.ft.com/content/8c6dd30b-d528-40fd-9c95-e41875cfc734?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "King Charles diagnosed with cancer",
        "description": "Labour leader Sir <b>Keir Starmer</b> also wished the monarch a speedy recovery. “On behalf of the Labour party, I wish His Majesty all the very best for his recovery. We look forward to seeing him back to swift full health,” he said. Heir to the throne ..."
    },
    {
        "url": "https://www.standard.co.uk/news/tech/nick-clegg-facebook-instagram-keir-starmer-meta-b1137444.html",
        "title": "Meta to label images on Facebook and Instagram which were created by AI",
        "description": "The social media platform said it is developing tools which will detect AI-generated images and label them when posted on one of its apps."
    },
    {
        "url": "https://www.thenational.scot/news/24101254.popcon-liz-truss-claims-britain-full-secret-conservatives/",
        "title": "PopCon: Liz Truss claims Britain is &#39;full of secret Conservatives&#39;",
        "description": "The survey showed that 65% of voters had an unfavourable view of her, putting her behind Boris Johnson, Rishi Sunak and <b>Keir Starmer</b>. Chris Hopkins, political research director at Savanta, told HuffPost UK: “It is ironic that Popular Conservatism couldn ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13051651/This-just-beginning-Liz-Truss-vows-galvanise-secret-Tories-Britain-launches-new-Popular-Conservatism-group-swipe-Rishi-Sunak-failing-left-wing-extremists.html",
        "title": "&#39;This is just the beginning!&#39;: Liz Truss vows to &#39;galvanise secret Tories&#39; across Britain as she launches new Popular Conservatism group with swipe at Rishi Sunak for failing ...",
        "description": "The former prime minister, who spent 49 days in Downing Street before standing down amid economic turmoil, claimed Tories had &#39;not taken on the Left enough&#39;."
    },
    {
        "url": "https://www.nme.com/news/music/big-special-announce-debut-album-and-share-new-single-dust-off-start-again-radar-3583236",
        "title": "Big Special announce debut album and share brutal new single ‘Dust Off / Start Again’",
        "description": "Big Special have announced plans to release their debut album &#39;Postindustrial Hometown Blues&#39; and shared new single &#39;Dust Off/Start Again&#39;."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/palestine-protesters-disrupt-labours-west-28579695",
        "title": "Palestine protesters disrupt Labour&#39;s West Midlands mayoral launch over Gaza ceasefire stance",
        "description": "Outside the venue, protesters jeered and chanted &#39;shame on you&#39; in anger over Labour&#39;s refusal to call for an immediate ceasefire in Gaza. Instead, Keir Starmer and the Labour Party is calling for a &#39;sustainable ceasefire&#39;, which includes the destruction of Hamas."
    },
    {
        "url": "https://uk.news.yahoo.com/liz-truss-claims-britain-full-141412611.html",
        "title": "Liz Truss claims Britain is &#39;full of secret Conservatives&#39; at PopCon launch",
        "description": "The survey showed that 65% of voters had an unfavourable view of her, putting her behind Boris Johnson, Rishi Sunak and <b>Keir Starmer</b>. Chris Hopkins, political research director at Savanta, told HuffPost UK: “It is ironic that Popular Conservatism couldn ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/analysis-improving-uk-economy-no-134145044.html",
        "title": "Analysis-Improving UK economy would be no election game-changer for Sunak",
        "description": "The Labour Party led by <b>Keir Starmer</b> is proposing little significant change in economic policy, however, making it harder for Sunak to alarm voters. Kellner said Labour&#39;s landslide win in 1997 under Tony Blair may turn out to be a more apt comparison."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-we-desperately-need-to-ramp-up-green-investment-7lhvmjgnx",
        "title": "<b>Keir Starmer</b>: We desperately need to ramp up green investment",
        "description": "Labour’s plan to invest £28 billion in green infrastructure is “desperately needed”, Sir Keir Starmer has said as he denied he is scaling back his manifesto before the next election. The Labour leader recommitted himself to delivering the spending plans in an interview with Times Radio and suggested that they are at the heart of his pledge to ensure the UK has clean power by 2030."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/labour-fury-after-rishi-sunak-suggests-keir-starmer-is-a-terrorist-sympathiser_uk_65c1cface4b069b665dc9235?d_id=7268156&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Labour Fury After Rishi Sunak Suggests <b>Keir Starmer</b> Is A &#39;Terrorist Sympathiser&#39;",
        "description": "These things speak to people’s values.” But a spokesman for <b>Starmer</b> described the PM’s remarks as “desperate nonsense”. He added: “<b>Keir Starmer</b> oversaw the first ever prosecution of senior members of Al-Qaeda, the jailing of the airline liquid ..."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-lessons-banking-crash-2890353?ico=most_popular",
        "title": "<b>Keir Starmer</b> has forgotten the lessons of the banking crash",
        "description": "This was quite a startling U-turn. Just three months ago, Reeves lambasted the Tories, saying the move “tells you everything you need to know about this Government”. The fact that Labour is now backing such a move presumably also tells us everything we need to know about a Labour government and its priorities."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/insight-rubble-british-railway-town-060002166.html",
        "title": "INSIGHT-Rubble in British railway town raises red flags for PM Sunak",
        "description": "Labour leader <b>Keir Starmer</b> has said, if elected, he won&#39;t revive the northern leg of HS2, describing the budget as &quot;blown&quot; and citing the fact that contracts are already being cancelled. Instead, he says he would stick with Sunak&#39;s Northern Powerhouse Rail ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rachel-reeves-treasury-laura-trott-british-b1137347.html",
        "title": "<b>Starmer</b>: £28 billion investment ‘desperately needed’ for our clean power mission",
        "description": "Sir <b>Keir Starmer</b> said he had been ‘unwavering’ in relation to the party’s green energy plans. Labour leader Sir <b>Keir Starmer</b> has said the investment is ‘desperately needed’ to achieve clean power by 2030 (PA) Sir <b>Keir Starmer</b> has said £28 ..."
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/02/06/is-keir-starmer-sleepwalking-into-a-conservative-trap-on-labours-28bn-green-pledge/",
        "title": "Is <b>Keir Starmer</b> sleepwalking into a Conservative trap on Labour’s £28bn green pledge?",
        "description": "In this way, research from focus groups and polling repeatedly suggests that <b>Starmer</b> is most exposed — not as fiscal rules-confounding, eco-zealot — but as a leader, frankly, who stands for very little. Sir <b>Keir</b> has repeatedly demonstrated his ..."
    },
    {
        "url": "https://www.thesun.co.uk/money/25755608/labour-green-pledge-in-chaos-starmer-confusion/",
        "title": "Labour’s green pledge in CHAOS as Sir <b>Keir Starmer</b> appears at odds with his own shadow chancellor on £28bn spending",
        "description": "LABOUR’S flagship green pledge was thrown into fresh chaos today as Sir Keir Starmer appeared at odds with his own shadow chancellor.  The party leader said a £28billion-a-year spending spree"
    },
    {
        "url": "https://metro.co.uk/2024/02/06/king-charles-blunder-shocks-sky-news-viewers-cancer-diagnosis-20231056/?ico=trending-post-strip_item_2",
        "title": "Sky News viewers shocked at King Charles blunder after cancer diagnosis",
        "description": "The likes of Piers Morgan, Sir <b>Keir Starmer</b> and Gary Lineker have been leading messages of support for the 75-year-old, who will be stepping back from his duties as he undergoes treatment. Shortly after the news broke, Sky News US correspondent Martha ..."
    }
]