[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/sunak-warns-reform-voters-put-starmer-number-10/",
        "title": "You will put <b>Starmer</b> in No 10, Sunak warns Reform voters",
        "description": "Credit: Matt Pover/GB News Rishi Sunak has told Reform UK supporters that they will put Sir <b>Keir Starmer</b>’s Labour Party into Number 10 unless they vote Conservative in a plea on live television. Answering questions from voters in County Durham on GB News ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/rochdale-by-election-labour-received-new-information-about-azhar-ali-before-withdrawing-support/",
        "title": "Rochdale by-election: Labour received &#39;new information&#39; about Azhar Ali before withdrawing support",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving new information about comments he is alleged to have made."
    },
    {
        "url": "https://www.thetimes.co.uk/article/starmers-public-sector-fat-cats-will-drag-us-down-gb5srvt0t",
        "title": "<b>Starmer</b>’s public-sector fat cats will drag us down",
        "description": "Labour’s plan to protect top workers from pensions raid shows an obsession with managerialism"
    },
    {
        "url": "https://www.thescottishsun.co.uk/sport/11968833/inside-scottish-labour-leader-anas-sarwar-leadership-jose-mourinho/",
        "title": "Inside Scottish Labour leader Anas Sarwar’s leadership style – inspired by legendary football manager",
        "description": "“I hope people see that in me, winning for a purpose.” But an SNP spokesperson highlighted comments where Mr Sarwar said Labour leader <b>Keir Starmer</b> must deliver a “popular” government for Scottish Labour to win in the 2026 Holyrood electio"
    },
    {
        "url": "https://www.lep.co.uk/news/politics/azhar-ali-labours-former-rochdale-by-election-candidate-criticised-by-preston-jewish-faith-leader-over-israel-attack-comments-4515431",
        "title": "Azhar Ali: Labour&#39;s former Rochdale by-election candidate criticised by Preston Jewish faith leader over Israel attack comments",
        "description": "A Jewish community leader in Preston says comments made by a senior Lancashire county councillor alleging Israel deliberately allowed the 7th October terrorist attack have given fuel to “demons” on social media spreading other unsubstantiated claims about the state."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24115262.labour-withdraws-support-azhar-ali-israel-claims/",
        "title": "Labour withdraws support for Azhar Ali after Israel claims",
        "description": "Labour has withdrawn its support for Pendle&#39;s Azhar Ali as the Rochdale by-election candidate following criticism of remarks he made about Israel"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rochdale-byelection-azhar-ali-mp-israel-gaza-b1138734.html",
        "title": "<b>Starmer</b> withdraws support for Rochdale by-election candidate after &#39;deeply offensive&#39; anti-Israel rant",
        "description": "Labour finally acts after spending much of Monday trying to defend Azhar Ali - with party suspending him pending an investigation"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/streets-rochdale-labour-problem-28617781",
        "title": "On the streets of Rochdale Labour have a problem",
        "description": "The town has been caught up in controversy after Labour&#39;s former candidate who wants to be the next MP made &#39;deeply offensive&#39; comments about Israel - but there are other things occupying voters&#39; mind"
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-withdraw-support-rochdale-byelection-candidate-azhar-ali",
        "title": "Labour Withdraws Support For Rochdale By-Election Candidate Azhar Ali",
        "description": "Labour has withdrawn their support for Rochdale by-election candidate Azhar Ali, after widespread criticism of remarks he had made about Israel."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865978/rishi-sunak-keir-stamer-labour-conservatives-general-election",
        "title": "Rishi Sunak issues warning over Labour as Brits urged not to fall for <b>Keir Starmer</b>&#39;s &#39;con&#39;",
        "description": "Rishi Sunak vowed to fix the social care system, slash NHS waiting lists and continue to ease the cost of living crisis if the Tories win the next general election."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-remarks/",
        "title": "Rochdale by-election: Labour withdraws support for candidate Azhar Ali after &#39;antisemitism&#39; remarks",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving an official complaint over his antisemitic remarks."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?page=with:block-65ca86678f08e47ce3f316cc",
        "title": "Rishi Sunak tells voters he is ‘absolutely’ committed to Rwanda during Q&amp;A on GB News – live updates",
        "description": "Prime minister faces one-hour grilling from voters following day of campaigning in Yorkshire"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865966/keir-starmer-labour-party-rochdale-by-election",
        "title": "<b>Keir Starmer</b> finally cuts ties with Labour by-election candidate after fresh row explodes",
        "description": "Keir Starmer had faced accusations he was protecting a &quot;racist crank&quot; after his party rallied round MP hopeful Azhar Ali."
    },
    {
        "url": "https://www.thenational.scot/news/24115029.keir-starmer-faces-general-election-challenge-palestine-activists/",
        "title": "<b>Keir Starmer</b> faces General Election challenge from Palestine activists",
        "description": "A PRO-PALESTINE activist will challenge Keir Starmer’s seat as campaigners attempt to oust the Labour leader in the next General Election"
    },
    {
        "url": "https://www.thenational.scot/news/24115029.keir-starmer-faces-challenge-palestine-activist-andrew-feinstein/",
        "title": "<b>Keir Starmer</b> faces challenge from Palestine activist Andrew Feinstein",
        "description": "A PRO-PALESTINE activist will challenge Keir Starmer’s seat as campaigners attempt to oust the Labour leader from his seat."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-stands-conspiracy-theory-164601031.html",
        "title": "<b>Keir Starmer</b> stands by ‘conspiracy theory’ candidate in Labour antisemitism row",
        "description": "Shadow minister said Azhar Ali ‘fell for an online conspiracy theory’ when he suggested Israel had allowed the October 7 Hamas attack to happen"
    },
    {
        "url": "https://uk.news.yahoo.com/sir-keir-starmer-slammed-tin-082134999.html",
        "title": "Sir <b>Keir Starmer</b> slammed for &#39;tin-eared&#39; response to anti-Israel rant by Labour Rochdale by-election candidate",
        "description": "Sir Keir Starmer came under growing pressure on Monday to cut adrift Labour’s Rochdale by-election candidate for claiming Israel deliberately allowed the October 7 massacre of more than 1,200 citizens by Hamas to happen."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/snp-westminster-leader-urges-pm-and-sir-keir-starmer-to-back-gaza-ceasefire-99836/",
        "title": "SNP Westminster leader urges PM and Sir <b>Keir Starmer</b> to back Gaza ceasefire",
        "description": "SNP Westminster leader Stephen Flynn has written to the Prime Minister and Labour leader urging them to back an immediate ceasefire in Gaza amid mounting concern over a planned Israeli ground invasion of Rafah. Mr Flynn said that such action there would “amount to waging a war in the largest refugee camp in the world.”"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/azhar-ali-labour-israel-rochdale-keir-starmer-b1138735.html",
        "title": "Labour withdraws support for Rochdale candidate after Israel claims",
        "description": "“<b>Keir Starmer</b> has changed Labour so that it is unrecognisable from the party of 2019. “We understand that these are highly unusual circumstances, but it is vital that any candidate put forward by Labour fully represents its aims and values. “Given ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rod-stewart-gives-scathing-verdict-32088184?int_source=nba",
        "title": "Rod Stewart gives scathing verdict on the Tories and says Labour &#39;deserve a crack&#39;",
        "description": "Sir Rod Stewart has said that <b>Keir Starmer</b> “deserves a crack” at running the country. The former Tory supporter raised concerns about how the Conservative party had switched Prime Minister twice without giving voters a say. The Do Ya Think I&#39;m Sexy?"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-row/",
        "title": "Rochdale by-election: Labour withdraws support for candidate Azhar Ali after &#39;antisemitism&#39; row",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving an official complaint over his antisemitic remarks."
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/labour-support-election-candidate-withdrawn-9095523",
        "title": "Labour support for by-election candidate withdrawn after Israel claims",
        "description": "The Labour by-election candidate who made remarks about Israel has had party support withdrawn. Azhar Ali was set to fight the Rochdale by-election for Labour this month (February 29)."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/labour-withdraws-support-rochdale-candidate-by-election/",
        "title": "Labour withdraws support for Rochdale by-election candidate",
        "description": "Sir Keir Starmer had faced pressure to cut ties with Azhar Ali, who claimed Israel had allowed Oct 7 attacks to take place"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/labour-drop-rochdale-mp-candidate-28619786",
        "title": "Labour drop Rochdale MP candidate over Israel comments",
        "description": "Labour has withdrawn its support for Rochdale by-election candidate Azhar Ali after criticism of remarks about Israel, a party spokesperson said."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/breaking-labour-ditches-rochdale-election-32110350",
        "title": "Labour ditches Rochdale by-election candidate Azhar Ali over offensive Israel claims",
        "description": "Azhar Ali had been picked as Labour&#39;s candidate for the Rochdale by-election on February 29, but has been dumped over his claim Israel allowed the October 7 attacks"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13075527/Labour-WITHDRAWS-support-Rochdale-election-candidate-Azhar-Ali-criticism-remarks-Israel.html",
        "title": "BREAKING NEWSLabour WITHDRAWS support for Rochdale by-election candidate Azhar Ali after criticism of remarks about Israel",
        "description": "<b>Keir Starmer</b> has changed Labour so that it is unrecognisible from the party of 2019. &#39;We understand that these are highly unusual circumstances but it is vital that any candidate put forward by Labour fully represents its aims and values. &#39;Given that ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25894231/keir-starmer-ditches-azhar-ali-israel/",
        "title": "<b>Keir Starmer</b> finally ditches candidate who blames Israel for October 7 massacre in huge U-turn",
        "description": "SIR KEIR Starmer has ditched his Rochdale by-election candidate who peddled a anti-Israel online conspiracy theory. The Labour leader withdrew the party’s support for Azhar Ali after he was"
    },
    {
        "url": "https://news.sky.com/story/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-row-13070338",
        "title": "Rochdale by-election: Labour received &#39;new information&#39; about Azhar Ali before withdrawing support",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving &quot;new information&quot; about comments he is alleged to have made."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-unrest-labours-rochdale-by-election-candidate-2902738?ico=related_stories",
        "title": "<b>Starmer</b> faces growing unrest over Rochdale candidate’s anti-Israel comments",
        "description": "Sir Keir Starmer is facing growing unrest from within his own party following his decision to stand by Labour’s candidate for Rochdale who allegedly claimed Israel deliberately allowed the 7 October attacks."
    }
]