[
    {
        "url": "https://www.dailymail.co.uk/news/article-13124751/Rishi-Sunak-UK-violence-intimidation-Gaza-vote.html",
        "title": "Rishi Sunak vows the UK will not &#39;bend to the threat of violence and intimidation&#39; and says the Gaza vote farce sent a dangerous signal that intimidation work",
        "description": "Questions remain over why he broke with protocol after he had meetings with Labour leader Sir <b>Keir Starmer</b> before making his decision. Some Tory MPs have accused Sir Lindsay of bowing to intimidation from protesters. Shadow international development ..."
    },
    {
        "url": "https://news.sky.com/story/lee-anderson-row-blunts-rishi-sunaks-moral-authority-on-racism-13081294",
        "title": "Lee Anderson row blunts Rishi Sunak&#39;s moral authority on racism",
        "description": "The PM has failed to quell the Tory racism row - meaning he&#39;s less able to speak with authority on the issue and blunting a potential avenue of attack."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/25/uks-enemies-could-use-ai-deepfakes-to-try-to-rig-election-says-james-cleverly",
        "title": "UK’s enemies could use AI deepfakes to try to rig election, says James Cleverly",
        "description": "A number of deepfake audios imitating <b>Keir Starmer</b>, the Labour leader, and the mayor of London, Sadiq Khan, were shared online last year. There have been cases of deepfake BBC News videos purporting to examine Rishi Sunak’s finances. It comes as major ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/25/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Sir Keir Starmer will talk up Labour’s housing pledges on a visit to the West Midlands, promising it would deliver a “future built in Britain, by Britain, for Britain” if it wins power."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-outlines-desire-for-patriotic-economy-through-boosting-home-ownership-13080985",
        "title": "Sir <b>Keir Starmer</b> outlines desire for &#39;patriotic economy&#39; through boosting home ownership",
        "description": "Sir <b>Keir Starmer</b> has outlined his desire to run a &quot;patriotic economy&quot; through boosting home ownership and creating the &quot;next generation&quot; of new towns if Labour wins the election. The Labour leader will promise to deliver a &quot;future built in Britain ..."
    },
    {
        "url": "https://www.thenational.scot/news/24142684.labour-mp-denies-keir-starmer-intimidated-speaker/",
        "title": "Labour MP denies <b>Keir Starmer</b> &#39;intimidated&#39; Speaker",
        "description": "LABOUR have denied trying to intimidate the Speaker over the Gaza ceasefire vote – despite reports claiming Keir Starmer fixed a private"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/keir-starmer-accuses-weak-rishi-sunak-of-harbouring-extremists-in-his-party/",
        "title": "<b>Keir Starmer</b> accuses &#39;weak&#39; Rishi Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "Sir Keir Starmer has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for Islamophobic comments."
    },
    {
        "url": "https://www.theguardian.com/books/2024/feb/25/keir-starmer-the-biography-tom-baldwin-review-labour-cant-win-to-cant-lose-making-of-a-labour-leader?ref=upstract.com",
        "title": "<b>Keir Starmer</b>: The Biography by Tom Baldwin review – from ‘can’t win to can’t lose’: the making of a Labour leader",
        "description": "An insightful and illuminating biography of Keir Starmer is revelatory about the challenging childhood that shaped his character while acknowledging the fact that he remains hard to pin down"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/keir-starmer-accuses-weak-sunak-of-harbouring-extremists-in-his-party/",
        "title": "<b>Keir Starmer</b> accuses &#39;weak&#39; Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "Sir <b>Keir Starmer</b> has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for &quot;Islamophobic&quot; comments. The Labour leader said Rishi Sunak&#39;s &quot;weakness&quot; allowed Lee Anderson &quot;to act with impunity&quot; and that he ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/angela-rayner-hits-back-tory-32208574",
        "title": "Angela Rayner hits back at Tories and says buying her council house was &#39;proud moment&#39;",
        "description": "Angela Rayner hit back at claims of hypocrisy after details of the sale of her former council home were reported in a new biography of Labour&#39;s Deputy leader by billionaire Tory peer Michael Ashcroft"
    },
    {
        "url": "https://news.sky.com/story/keir-starmer-accuses-weak-sunak-of-harbouring-extremists-in-his-party-13080553?dcmp=snt-sf-twitter",
        "title": "<b>Keir Starmer</b> accuses &#39;weak&#39; Rishi Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "Sir <b>Keir Starmer</b> has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for &quot;Islamophobic&quot; comments. The Labour leader said Rishi Sunak&#39;s &quot;weakness&quot; allowed Lee Anderson &quot;to act with impunity&quot; and that he ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26178780/keir-starmer-yielding-mob-rule-bullying-alarming-labour-regime/",
        "title": "<b>Keir Starmer</b>’s yielding to mob rule &amp; bullying of Speaker shows alarming way Labour regime will operate under pressure",
        "description": "THE road to hell, they say, is paved with good intentions. Last week, for perhaps the best possible motives, the Speaker of the House of ­Commons, the Leader of HM Loyal Opposition and the Met"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/muslim-islamophobia-conservatives-lee-anderson-b2502248.html",
        "title": "Muslim group demands Tories investigate ‘structural Islamophobia’",
        "description": "It comes as new figures show the number of Islamophobic incidents has skyrocketed since the 7 October attack on Israel by Hamas and the retaliatory Israeli bombardment of Palestine. London charity Islamophobia Response Unit (IRU) said there was a 365 per cent increase in reports of Islamophobia in October."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870644/keir-starmer-labour-immigration-plan-election",
        "title": "&#39;<b>Keir Starmer</b>&#39;s immigration plan lacks substance to avoid jeopardising election&#39;",
        "description": "Sir <b>Keir Starmer</b>’s election strategy is already perfectly clear to those paying attention: to give as little substance as possible to his policies for as long as possible. This is to avoid jeopardising his party’s considerable lead in the polls."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870639/Sir-Keir-Starmer-Immigration-Rwanda-Migrants",
        "title": "Labour&#39;s open door to immigration would mean an extra 250,000 migrants coming to Britain",
        "description": "Sir <b>Keir Starmer</b>’s open door approach to immigration would mean an extra 250,000 migrants coming to Britain, a major new report warns. Cosying up to Brussels by joining an EU-wide returns agreement would increase net immigration by almost 130,000 a year ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24143150.snp-think-can-trust-keir-starmer-grant-referendum/",
        "title": "Why do the SNP think we can trust <b>Keir Starmer</b> to grant a referendum?",
        "description": "The SNP leadership strategy naively relies on the trust and kindness of the next likely UK prime minister, <b>Keir Starmer</b>, who some SNP MPs are now suddenly calling “a bare-faced liar”. The Westminster-will-give-a-referendum strategy has hit the buffers ..."
    },
    {
        "url": "https://www.oxfordstudent.com/2024/02/25/just-stop-oil-and-palestine-protests-at-oxford-labour-fundraiser/",
        "title": "Just Stop Oil and Palestine protests at Oxford Labour fundraiser",
        "description": "On the 23rd of February, a fundraising event by Labour MP Anneliese Dodds taking place in Cowley was met with protests from various activist groups, including Just Stop Oil (JSO) and other organisations in support of Palestine."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/crisis-deepens-as-deputy-pm-refuses-to-say-whether-lee-anderson-is-racist-while-embattled-mp-tweets-dog-house-beer-photos/",
        "title": "Crisis deepens as deputy PM refuses to say whether Lee Anderson is &#39;racist&#39; - while embattled MP tweets &#39;Dog House&#39; beer photos",
        "description": "He&#39;s actually given our capital city away to his mates.&quot; Labour leader Sir <b>Keir Starmer</b> said it was &quot;right&quot; that Mr Anderson lost the whip for what he called an &quot;appalling racist and Islamophobic outburst&quot;, while former Conservative chancellor Sir Sajid ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13123373/Lee-Anderson-suspension-row-provokes-vitriolic-left-wing-attacks-Keir-Starmer-accuses-Tories-harbouring-extremists-Muslim-Council-Britain-chief-says-party-Islamophobia-problem.html?ns_campa",
        "title": "Lee Anderson suspension row provokes vitriolic left-wing attacks as <b>Keir Starmer</b> accuses Tories of harbouring &#39;extremists&#39; and Muslim Council of Britain demands probe into ...",
        "description": "The &#39;Red Wall&#39; MP had the Tory whip stripped from him yesterday after refusing to apologise for his claim that London mayor Sadiq Khan is controlled by &#39;Islamists&#39;."
    },
    {
        "url": "https://www.ft.com/content/6de680af-834e-4a14-a3f3-38b277b5d472",
        "title": "Citizens’ assemblies could help repair our toxic political culture",
        "description": "Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%."
    },
    {
        "url": "https://www.lbc.co.uk/news/sadiq-accuses-sunak-enabling-islamophobia-lee-anderson/",
        "title": "Sadiq Khan accuses Rishi Sunak of &#39;enabling anti-Muslin hate&#39; in the Conservative Party",
        "description": "Sadiq Khan has accused Rishi Sunak of &quot;enabling anti-Muslim hatred&quot; after he failed to explicitly condemn Lee Anderson for saying that the London mayor was being controlled by Islamists."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/25/uk-premier-rishi-sunak-accused-of-harboring-extremists-as-islamophobia-row-escalates/",
        "title": "UK premier Rishi Sunak accused of ‘harboring extremists’ as Islamophobia row escalates",
        "description": "In an article he penned for The Observer, labour leader Keir Starmer accused Sunak of harboring “extremists in his party” and other senior Conservatives were condemned for “"
    },
    {
        "url": "https://news.stv.tv/politics/oliver-dowden-says-he-does-not-believe-anderson-intended-to-be-islamophobic",
        "title": "Oliver Dowden says he does not believe Anderson &#39;intended&#39; to be Islamophobic",
        "description": "Former deputy party chairman Lee Anderson lost the Tory whip after refusing to apologise for the remarks on ‘Islamists’."
    },
    {
        "url": "https://news.stv.tv/politics/snp-to-propose-fresh-gaza-ceasefire-motion-after-house-of-commons-chaos-on-wednesday",
        "title": "SNP to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "Last Wednesday’s angry scenes in the Commons meant an SNP motion calling for a ceasefire and accusing Israel of subjecting Gaza to &#39;collective punishment&#39;, a war crime, was not voted on."
    },
    {
        "url": "https://inews.co.uk/news/politics/why-tories-think-labour-poll-lead-wrong-2922670",
        "title": "Why Tories think the polls have got Labour’s lead wrong – like they did in ’92",
        "description": "Survey after survey points to Starmer landslide. But there is a belief among Tories that pollsters could end up with egg on their faces, again"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/25/commons-gaza-chaos-mps-israel-hamas-war-british-democracy-uk",
        "title": "‘People want our government to do something’: Commons Gaza chaos was the day British democracy failed",
        "description": "Bemusement and anger swept the UK as MPs accused each other of bad faith and bias instead of calling for decisive action on the Israel-Hamas war"
    },
    {
        "url": "https://inews.co.uk/news/rupert-murdoch-labour-keir-starme-2913677?ico=most_popular",
        "title": "Murdoch is leaning towards backing Labour – but doubts remain over <b>Starmer</b>",
        "description": "There remains scepticism over whether Sir Keir Starmer can maintain the party&#39;s strong lead over the Conservatives in the run up to the election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/25/lee-anderson-not-islamophobic-sadiq-khan-says-oliver-dowden/",
        "title": "Lee Anderson was not trying to be Islamophobic, says Oliver Dowden",
        "description": "The Deputy Prime Minister said Mr Anderson would have been able to keep the whip and stay in the Conservative Party if he had apologised"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13122053/Tories-plot-oust-Sir-Lindsay-Hoyle.html",
        "title": "Tories plot to oust Sir Lindsay Hoyle to stop him becoming Sir <b>Keir Starmer</b>&#39;s &#39;patsy&#39; if Labour wins the General Election",
        "description": "One MP last night warned that if the Speaker &#39;was prepared to do Sir Keir&#39;s bidding now, what would he be like if Labour had a Commons majority?&#39;."
    },
    {
        "url": "https://uk.news.yahoo.com/rachel-reeves-under-fire-over-163455992.html",
        "title": "Rachel Reeves under fire over call on police to crack down on anti-Zionists",
        "description": "A TOP Labour MP suggested the police should do “everything within their powers” to crack down on anti-Zionists in Britain."
    },
    {
        "url": "https://www.lbc.co.uk/news/oliver-dowden-lee-anderson-didnt-mean-to-be-islamophobic/",
        "title": "Deputy PM says Lee Anderson &#39;didn&#39;t intend to be Islamophobic&#39; by saying that Khan was controlled by Islamists",
        "description": "The Deputy Prime Minister has told LBC that Lee Anderson did not mean to be Islamophobic when he said that Sadiq Khan was &quot;controlled by Islamists&quot;. Mr Anderson, the former deputy chairman of the Conservative party, was suspended on Saturday after refusing ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24142374.ceasefire-vote-chaos-fanned-flames-far-right/?ref=rss",
        "title": "Ceasefire vote chaos fanned the flames of the Far Right",
        "description": "While politicians’ fears for their safety may be real, the spectre of violence raised by <b>Keir Starmer</b> and Lindsay Hoyle was always in danger of becoming a self-fulfilling prophecy. As we have now seen, it paved the way for the conflation of anti-genocide ..."
    },
    {
        "url": "https://www.standard.co.uk/business/money/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit-b1141414.html",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Sir <b>Keir</b> will be joined by deputy leader Angela Rayner on a trip to a housing development. Sir <b>Keir Starmer</b> will highlight Labour’s housebuilding pledges on a trip to the West Midlands (Jordan Pettitt/PA) Sir <b>Keir Starmer</b> will talk up Labour’s housing ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/build-movement-on-the-streets-not-in-parliament/",
        "title": "Build movement on the streets, not in parliament",
        "description": "<b>Keir Starmer</b>’s continued protection of Israel’s genocide in Gaza—and murderous failure to stand up for the Palestinians—has created a movement outside of Labour. In electoral terms, some 70 councillors across England have quit the party and are ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/george-galloways-message-muslim-voters-28697592",
        "title": "George Galloway&#39;s message to Muslim voters in Rochdale ahead of by-election",
        "description": "The candidate also claimed Sir <b>Keir Starmer</b> could be &#39;forced out&#39; as Labour leader if his party loses the vote. Mr Ali will still appear on the ballot paper next to Labour&#39;s logo, but due to his suspension from the party, he would sit in Parliament as an ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/councillor-leaves-labour-over-palestine/",
        "title": "Ex-Labour councillor puts Labour under fire over Gaza",
        "description": "But <b>Keir Starmer</b>’s murderous position on Gaza wasn’t the defining reason Habib tore his membership up. He says he was in an “ongoing battle to fight institutional racism” within Labour. “It’s been a long process over the last couple of year ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/pat-mcart-wonders-what-northern-28702443",
        "title": "Pat McArt wonders what Northern Ireland&#39;s forefathers would make of Irish largesse",
        "description": "It would seem to the cynics out there, of which I am one, that in order to avoid another damaging revolt amongst his MPs over a ceasefire, the Labour leader Sir <b>Keir Starmer</b> leaned on Sir Lindsay, his former party colleague, to upend parliamentary convention."
    },
    {
        "url": "https://morningstaronline.co.uk/article/tories-toxic-racism-and-islamophobia-risks-fuelling-more-hate-on-the-streets",
        "title": "Tories’ ‘toxic racism and Islamophobia’ risks fuelling more hate on the streets",
        "description": "Labour Party leader Sir <b>Keir Starmer</b> accused Mr Sunak of harbouring “extremists in his party.” Mr Anderson’s comments were soon followed by an article in the Daily Telegraph by former home secretary Suella Braverman. She wrote: “The Islamists ..."
    },
    {
        "url": "https://www.ft.com/content/8d915476-4254-49a6-a4da-9e8849da9a50",
        "title": "UK deputy PM declines to say if Lee Anderson comments over Sadiq Khan were racist",
        "description": "On Sunday, Labour leader Sir <b>Keir Starmer</b> waded into the Anderson row, accusing Sunak of harbouring “extremists in his party” and allowing Tory MPs to “act with impunity”. “What does it say about the prime minister’s judgment that he made Lee ..."
    },
    {
        "url": "https://www.thecomet.net/news/national/24142433.pms-silence-tacit-endorsement-vile-remarks-anderson-says-mayor/",
        "title": "PM’s silence is ‘tacit endorsement of vile remarks’ by Anderson, says mayor",
        "description": "Following his suspension, Sir <b>Keir Starmer</b> accused the PM of harbouring “extremists” in the party and said his “weakness” allows MPs to “act with impunity”. Mr Anderson said in a statement later: “Following a call with the Chief Whip ..."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24142371.anderson-tory-whip-suspended-refusal-apologise-islamist-claim/",
        "title": "Anderson has Tory whip suspended after ‘refusal to apologise’ for Islamist claim",
        "description": "Following his suspension, Sir <b>Keir Starmer</b> accused the PM of harbouring “extremists” in the party and said his “weakness” allows MPs to “act with impunity”. A spokesperson for Mr Hart said: “Following his refusal to apologise for comments ..."
    }
]