[
    {
        "url": "https://www.thetimes.co.uk/article/609a5a2f-e1c1-4c2e-9c5a-e9aeec2f657d?shareToken=d24eba5853aab0588d1194dd548f0fe5",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "Tim Bonner of the Countryside Alliance said that Labour was, “at its core an urban party” and that its focus on hunting was “utterly bizarre”, adding: “This shows that the party hasn’t progressed at all and that underneath <b>Keir Starmer</b>’s ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-william-says-too-many-have-been-killed-israel-gaza-conflict-1723566",
        "title": "Prince William Says &#39;Too Many Have Been Killed&#39; In Israel Gaza Conflict",
        "description": "This news comes after Labour Party Leader <b>Keir Starmer</b> called for &quot;an immediate humanitarian ceasefire&quot; in Gaza. The ceasefire backing comes as <b>Starmer</b> was threatened by the biggest rebellion amongst Labour MPs since he headed the Party in 2020."
    },
    {
        "url": "https://www.thesun.co.uk/news/26120571/nigel-farage-labour-britain-ambassador-us/",
        "title": "Nigel Farage urges incoming Labour government to appoint him as Britain’s ambassador to US ‘in the national interest’",
        "description": "NIGEL Farage has offered to work with an incoming Labour government to build bridges between Donald Trump and <b>Keir Starmer</b>. The close-ally of the former President warned the Special Relationship would be put under huge strain if - as the polls indicate ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/22/protest-exclusion-zones-mps-offices-sunak-adviser/",
        "title": "Introduce protest exclusion zones around MPs’ offices, says Sunak adviser",
        "description": "Lord Walney&#39;s recommendation comes as politicians have been targeted by pro-Palestinian protesters in their constituencies"
    },
    {
        "url": "https://news.sky.com/video/accusations-sir-keir-starmer-put-pressure-on-the-commons-speaker-ahead-of-the-gaza-commons-debate-dismissed-as-complete-garbage-13078566",
        "title": "Accusations Sir <b>Keir Starmer</b> put pressure on the Commons Speaker ahead of the Gaza Commons debate dismissed as &quot;complete garbage&quot;.",
        "description": "Accusations Sir <b>Keir Starmer</b> put pressure on the Commons Speaker ahead of the Gaza Commons debate dismissed as &quot;complete garbage&quot;. Nick Thomas-Symonds spoke to Sky&#39;s Sophy Ridge, blaming Conservative MPs for &#39;fleeing the field&#39;"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13115267/EDEN-CONFIDENTIAL-Royal-revamp-hooligans-clobber-Stone-Island-Cassius-Taylor-hired-help-transform-brands-image.html",
        "title": "EDEN CONFIDENTIAL: Royal revamp for hooligans&#39; top clobber Stone Island as Cassius Taylor is hired to help transform the brand&#39;s image",
        "description": "I can disclose that Cassius Taylor has been recruited by Stone Island, the brand beloved of football hooligans."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-accusations-against-starmer-complete-garbage-speaker-probably-safe-in-role-12593360",
        "title": "Politics latest: Accusations against <b>Starmer</b> &#39;complete garbage&#39;; Speaker &#39;probably safe&#39; in role",
        "description": "Meanwhile, <b>Keir Starmer</b> has denied applying undue pressure on him. News is moving fast here in Westminster as the Speaker faces pressure after yesterday&#39;s chaos in the Commons over the Gaza ceasefire votes. This post has the very latest figure for how many ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26120535/harry-cole-joe-biden-weakness-donald-trump-reelection/",
        "title": "The world is craving decisive leadership after years of ‘weakness’ under Biden. But can we cope with Trump 2.0?",
        "description": "A LOT of nice, well-meaning people are quivering like smacked blancmanges at the idea of a new Trump presidency, I am not quite sure why they are so alarmed,” Boris Johnson tells me. “When you"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1869818/eu-plan-brexit-trade-deal-keir-starmer",
        "title": "EU plan Brexit stitch-up with <b>Keir Starmer</b> - including major changes to trade deal",
        "description": "They told the i paper their hopes are pinned on a potential Sir Keir Starmer premiership - a prospect that seems more likely by the day. The possibility of drawing closer to the EU has not been welcomed by some Brexiteers, who have said it would mean Britons &quot;take more pointless EU regulations with no say in them&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-sussex-68371594",
        "title": "<b>Starmer</b> determined to build on green belt land in South East",
        "description": "Sir <b>Keir Starmer</b> says he is &quot;determined&quot; to build houses on green belt land in the South East of England. Visiting Three Bridges railway station in Crawley, the Labour leader said he understood the concerns of residents who were worried about pressure on ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24138599.speaker-keir-starmer-questions-answer-meeting/",
        "title": "Speaker and <b>Keir Starmer</b> both have questions to answer about meeting",
        "description": "<b>KEIR Starmer</b> has admitted that he had a meeting with the Speaker on Wednesday and that he “urged” the Speaker to allow the Labour amendment on Gaza. The Labour Chief Whip was also present, and according to Ian Murray on Radio Scotland today ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/alexei-navalnys-mother-sees-sons-body-and-accuses-russia-of-forcing-secret-funeral-without-mourners/",
        "title": "Alexei Navalny&#39;s mother sees son&#39;s body and accuses Russia of forcing secret funeral without mourners",
        "description": "Sir <b>Keir Starmer</b> has &quot;categorically&quot; denied threatening Sir Lindsay Hoyle to select Labour&#39;s amendment in the Gaza ceasefire debate in a move that unleashed parliamentary chaos. Cause of long COVID brain fog could be from leaky blood vessels, study says ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68368320",
        "title": "Speaker&#39;s handling of Gaza vote very concerning, says Rishi Sunak",
        "description": "Prime Minister Rishi Sunak has said Sir Lindsay Hoyle&#39;s decision to depart from convention during a debate on the Gaza conflict was &quot;very concerning&quot;. The Commons Speaker is facing pressure to quit, after chaotic scenes in Parliament and acrimonious debate."
    },
    {
        "url": "https://inews.co.uk/culture/books/keir-starmer-biography-tom-baldwin-review-2921474?ico=related_article_inline",
        "title": "<b>Keir Starmer</b>: The Biography reveals a man who’s not boring – just human",
        "description": "Why do we need a biography of <b>Keir Starmer</b>? It was a question the Labour leader asked himself when he set out to write his own account – eventually concluding that it would look a bit vain. But the man who had been helping him, former journalist and ..."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13114305/RICHARD-LITTLEJOHN-politicians-lost-plot-human-tragedy-Israel-Gaza.html",
        "title": "RICHARD LITTLEJOHN: Self-obsessed. Grandstanding. Our political class has lost the plot and tried to make the tragedy of Israel and Gaza all about THEM",
        "description": "Not for the first time, the politicians have taken complete leave of their senses. They have managed to make the human tragedy unfolding in Israel and Gaza all about them."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?page=with:block-65d703a28f08aff1ffae317f",
        "title": "Uk politics: Sunak ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – as it happened",
        "description": "The speak is due to hold talks with the parties to clear the air after Gaza ceasefire debate descended into chaos"
    },
    {
        "url": "https://www.telegraph.co.uk/money/investing/how-to-get-rich-invest-keir-starmer-labour/",
        "title": "How to get rich from <b>Keir Starmer</b> in Number 10",
        "description": "It may seem odd to start this article in China, given its on the consequences for investors if Sir <b>Keir Starmer</b> becomes prime minister. But just before Christmas, Beijing gave us an object lesson in how the actions of governments can decimate share prices."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/commons-chaos-live-speaker-lindsay-32184083",
        "title": "Lindsay Hoyle LIVE: Commons Speaker issues apology as more than 60 MPs call for him to quit",
        "description": "Dozens of MPs have signed a motion of no confidence in Commons Speaker Sir Lindsay Hoyle after he helped Keir Starmer dodge a rebellion over a Gaza ceasefire vote"
    },
    {
        "url": "https://www.itv.com/news/meridian/2024-02-22/sir-keir-starmer-aims-to-smash-blue-wall-by-winning-over-souths-tory-voters",
        "title": "Sir <b>Keir Starmer</b> aims to smash &#39;blue wall&#39; by winning over Tory voters in the South",
        "description": "Sir <b>Keir Starmer</b> has revealed his plan to target “traditional Conservative voters” in the South of England ahead of the next general election. The Labour leader said he hopes the party will break through the so-called ‘blue wall’ of Tory ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-22/commons-speaker-under-pressure-after-gaza-vote-chaos",
        "title": "<b>Starmer</b> denies he threatened Speaker over chaotic Gaza ceasefire vote",
        "description": "MPs stormed out after Sir Lindsay Hoyle broke convention by selecting a Labour amendment for debate. | ITV National News"
    },
    {
        "url": "https://www.thenational.scot/politics/24138471.ruthless-keir-starmer-will-stop-nothing-pursuit-power/",
        "title": "Ruthless <b>Keir Starmer</b> will stop at nothing in the pursuit of power",
        "description": "The only thing that Labour’s leadership is now interested in is power for the benefit of those at the top of the party."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/22/keir-starmer-lindsay-hoyle-gaza-ceasefire-vote-analysis",
        "title": "<b>Starmer</b>’s lobbying of Hoyle draws criticism amid Gaza vote fallout",
        "description": "Labour leader wins muted victory over ceasefire vote as he focuses on MPs’ safety"
    },
    {
        "url": "https://metro.co.uk/2024/02/22/will-young-really-enthused-possible-plan-become-mp-20329205/?ico=more_text_links",
        "title": "Will Young wants to become an MP and is ‘really enthused’ by political career",
        "description": "Will Young is ‘enthused’ by the idea of becoming an MP (Picture: Karwai Tang/WireImage) ‘I’m going to text old K-dog [<b>Keir Starmer</b>],’ he then joked, before explaining why he was impressed with the Labour party at the moment. ‘This isn’t a ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/top-tory-simon-hart-warned-32189514?s=04",
        "title": "Top Tory Simon Hart warned Lindsay Hoyle he would &#39;unleash hell&#39; in bid to pressure Speaker",
        "description": "Tory MPs have lined up to accuse <b>Keir Starmer</b> of strong-arming Sir Lindsay Hoyle into making his decision, even though he has categorically denied this. But now it has emerged that behind the scenes Mr Hart was putting pressure on Sir Lindsay not to allow ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/24137758.sir-keir-starmer-visits-siemens-factory-sussex/",
        "title": "Sir <b>Keir Starmer</b> visits Siemens factory in Sussex",
        "description": "Sir Keir Starmer has said Labour is committed to tackling homelessness in Sussex and will “fight” for every vote in the county as he visited"
    },
    {
        "url": "https://www.heraldscotland.com/news/24137978.yousaf-warns-labour-will-raid-north-east-oil-windfall-tax/?ref=rss",
        "title": "Yousaf warns Labour will &#39;raid the north east&#39; with oil windfall tax",
        "description": "The Scottish Labour leader attacked Mr Yousaf after the SNP leader said he would oppose Sir <b>Keir Starmer</b>’s proposal for an increased windfall tax on oil and gas companies in a speech earlier this week. Speaking at First Minister’s Questions ..."
    },
    {
        "url": "https://uk.news.yahoo.com/bodyguards-death-threats-real-impact-135600869.html",
        "title": "From bodyguards to death threats - the real impact of chaos in the Commons",
        "description": "The first real crisis of Sir Lindsay Hoyle&#39;s time as Speaker was on full display as he was forced to apologise for how a debate on Gaza descended into chaos. While he expressed regret for how his decision to allow a Labour amendment on the SNP&#39;s ceasefire motion had angered MPs,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869623/Keir-Starmer-Denies-threatening-Lindsay-Hoyle",
        "title": "‘I absolutely didn&#39;t threaten him’: <b>Keir Starmer</b> dodges crucial question after Commons row",
        "description": "The leader of the Opposition has been hounded by Penny Mordaunt this morning, and others, with continuing accusations he bent the arm of Sir Lindsay Hoyle."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/lindsay-hoyle-speaker-what-happens-quit-145508436.html",
        "title": "What happens if Lindsay Hoyle quits as speaker?",
        "description": "He disregarded warnings from the House of Commons clerk over the unprecedented move, which provoked uproar in the chamber – particularly among Tories and the SNP, whom accused Hoyle of helping Labour leader Sir <b>Keir Starmer</b> avoid a large rebellion from ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/commons-speaker-apologises-for-gaza-vote-chaos-as-starmer-denies-pressuring-him/a1525488014.html",
        "title": "Commons Speaker apologises for Gaza vote chaos as <b>Starmer</b> denies pressuring him",
        "description": "Commons Speaker Sir Lindsay Hoyle has reiterated his apology for his handling of the Gaza ceasefire debate, while Sir <b>Keir Starmer</b> “categorically” denied threatening him to select Labour’s amendment in a move that unleashed chaos."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mps-prime-minister-keir-starmer-gaza-snp-b1140961.html",
        "title": "Sunak criticises Hoyle’s handling of Gaza ceasefire vote as ‘concerning’",
        "description": "Sir Lindsay has come under pressure amid accusations he helped Sir <b>Keir Starmer</b> avoid another damaging revolt over the Middle East issue by selecting Labour’s amendment. More than 60 MPs have signed a so-called early day motion tabled by a Tory MP ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/mps-who-called-sir-lindsay-28687582",
        "title": "The MPs who have called for Sir Lindsay Hoyle to quit",
        "description": "Sir Lindsay came close to tears on Wednesday evening as he apologised to MPs amid angry scenes after helping <b>Keir Starmer</b> dodge a revolt. Mr <b>Starmer</b> had faced the threat of frontbenchers resigning so they could back an SNP-led motion demanding an ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/paedophile-killer-jailed-murder-11-28687102",
        "title": "Paedophile killer jailed for murder of 11-year-old Wesley Neailey wins legal battle that could see him freed",
        "description": "But now he has been granted a personal Parole Board hearing after taking his case to the High Court. Read more: Sir <b>Keir Starmer</b> quotes South Tyneside postmaster in calling for greater transparency surrounding Post Office scandal Keep up to date with all ..."
    },
    {
        "url": "https://socialistworker.co.uk/news/striking-junior-doctors-angry-at-welsh-labours-pay-insult/",
        "title": "Striking junior doctors angry at Welsh Labour’s pay insult",
        "description": "There’s a danger the walkouts are occasional events directed mainly at hoping for change if <b>Keir Starmer</b> becomes prime minister. The doctors’ strikes should be part of a much wider battle over NHS pay. All the health unions are now launching claims for ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24131542.labour-call-immediate-humanitarian-ceasefire-gaza/?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "Labour to call for &#39;immediate humanitarian ceasefire&#39; in Gaza",
        "description": "It is a significant shift for Sir <b>Keir Starmer</b> and his shadow cabinet, who have long resisted using the word immediate. They will be hoping the change in position will stave off an expected rebellion on Wednesday when the SNP use their opposition day slot ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-calls-for-immediate-humanitarian-ceasefire-in-gaza-369025/?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "Labour calls for ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "Sir <b>Keir Starmer</b> has previously called for a “ceasefire that lasts” in the Middle East, but stopped short of using the word “immediate”. The Labour leader’s position on the conflict has long caused unease among some in his party, with dozens of ..."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-losing-muslim-voters-2905991?ico=in-line_link",
        "title": "<b>Keir Starmer</b> is on the brink of losing Muslim voters for good",
        "description": "‘What is shamefully overdue from <b>Starmer</b> is a robust call for an immediate and permanent ceasefire’ (Photo: Henry Nicholls/AFP) This month, I’ve found myself wondering if Sir <b>Keir Starmer</b> stares wistfully into his morning brew, questioning whether ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?page=with:block-65d715898f08aff1ffae3224",
        "title": "Uk politics: Sunak ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – as it happened",
        "description": "PM implies he is willing to draw a line under Gaza ceasefire vote chaos"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/exonerating-guilty-people-price-worth-paying-to-resolve-post-office-scandal-government-says/",
        "title": "Exonerating guilty people &#39;price worth paying&#39; to resolve Post Office scandal, government says",
        "description": "<b>Starmer</b> &#39;categorically&#39; denies threatening Commons Speaker over Gaza ceasefire vote Sir <b>Keir Starmer</b> has &quot;categorically&quot; denied threatening Sir Lindsay Hoyle to select Labour&#39;s amendment in the Gaza ceasefire debate in a move that unleashed parliamentary ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/gaza-crisis-threatens-commons-speaker",
        "title": "Gaza crisis threatens commons Speaker",
        "description": "Over 60 Scottish National Party and Tory MPs signalled no confidence in Sir Lindsay after he broke procedural conventions to suit Labour leader <b>Keir Starmer</b>’s political convenience, with the SNP pressing for an early debate on his future. The farcical ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/singer-young-says-i-might-28686319",
        "title": "Singer Will Young says &#39;I might become an MP&#39; after vowing to leave UK if Tories stay in power",
        "description": "Honestly, I had a moment. My God, I could become an MP. I&#39;m really enthused by it. I&#39;m going to text old K dog (<b>Keir Starmer</b>). &quot;This isn&#39;t a sales pitch for Labour, but I genuinely do feel hope when I&#39;m around the people in Labour, when I talk to them ..."
    }
]