[
    {
        "url": "https://news.yahoo.com/government-fails-seize-benefits-brexit-170000767.html",
        "title": "If Government fails to seize the benefits of Brexit, the Blob will gleefully drag us back into the bloc",
        "description": "Do you remember the Great Tomato Shortage of 2023? For a few weeks in February and March, our supermarket shelves were bereft of those gleaming, crimson, umami-flavoured globes. A combination of high energy prices and cold weather had caused a dearth across Europe."
    },
    {
        "url": "https://www.theguardian.com/business/2024/jan/27/to-get-to-net-zero-we-may-have-to-sell-off-the-uks-future",
        "title": "To get to net zero, we may have to sell off the UK’s future",
        "description": "Joe Biden has done it for the US. Why not <b>Keir Starmer</b> in the UK? Transforming the economy will come at an outsize cost. Worse, it’s an escalating cost that is way beyond the public finances of Britain and possibly even the EU. There is money on offer ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h7j7p0",
        "title": "What do voters think of Sunak and <b>Starmer</b>? The focus group results are in!",
        "description": "Today, we look at what’s going on in voters’ minds. The Sunday with Laura Kuenssberg show, along with the polling company More In Common have organised a series of focus groups to understand public opinion and what’s going on behind the opinion polls with a range of voters in the north west of England."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-london-68117976",
        "title": "Merton Labour councillor quits over Israel-Gaza posts",
        "description": "A councillor in south London who was suspended by the Labour Party over her comments on the Israel-Gaza conflict has resigned from the party. Councillor Caroline Charles said she was &quot;kicked out&quot; for calling for a &quot;ceasefire now&quot; on social media."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13013187/DAN-HODGES-Rishi-call-bluff-rebels-John-Major.html",
        "title": "DAN HODGES: Rishi has to call the bluff of rebels just like John Major did - or else suffer death by a thousand cuts",
        "description": "They will continue to attack and undermine the PM until enough MPs decide it&#39;s time for another party leadership contest, or for the General Election to allow the British people to decide it&#39;s time for Sir <b>Keir Starmer</b> and Labour to put the Tory party and ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-labour-green-manifesto-sunak-election-plans-b2485919.html",
        "title": "<b>Keir Starmer</b> is about to make up his mind about Labour’s £28bn albatross – its green manifesto",
        "description": "The party is likely to focus on what it wants to achieve instead of the arbitrary £28bn number, writes John Rentoul"
    },
    {
        "url": "https://leftfootforward.org/2024/01/could-the-tories-still-win/",
        "title": "Could the Tories still win?",
        "description": "Could 2024 become remembered for the British people ‘hurling the findings of the opinion polls back into the faces of the pollsters,’ as Times’ journalist George Clarke wrote following the Tories’ shock win in 1970?"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/brexit-uk-food-shortages-eu-imports-b2485561.html",
        "title": "Parma hams and Spanish chorizos to disappear from UK shelves due to new Brexit checks, Rishi Sunak warned",
        "description": "Exclusive: Specialist meats and cheeses suppliers could ditch UK altogether, say industry chiefs – amid fresh warning fruit and veg prices set to spike"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-defence-secretary-to-face-questions-as-uk-sends-military-assets-to-the-middle-east-12593360?postid=6589138.",
        "title": "Politics latest: More names of plotters trying to oust Rishi Sunak expected to be revealed; Reform UK surges in polls",
        "description": "They went on to say it is &quot;disturbing&quot; that some former special advisers &quot;seemingly want to spend the year attacking the Conservative Party essentially which benefits no colleague whatsoever and hands the keys to <b>Keir Starmer</b> to 10 Downing Street&quot;."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68116535",
        "title": "&#39;Nice guy but weak&#39;: Voters on Rishi Sunak and Sir <b>Keir Starmer</b>",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts on the Prime Minister, Rishi Sunak, and the leader of the opposition, Sir Keir Starmer. They&#39;re all from areas that swung from Labour to Conservative in the last general election, and have been speaking to the BBC&#39;s Laura Kuenssberg."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-mind-labour-163619181.html",
        "title": "Voices: <b>Keir Starmer</b> is about to make up his mind about Labour’s £28bn albatross – its green manifesto",
        "description": "Rishi Sunak was sharper at the most recent Prime Minister’s Questions than at the previous two. He fought back against <b>Keir Starmer</b>’s ridicule by mocking the leader of the opposition’s inability to decide whether he was committed to £28bn a year of ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next general election? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/27/mother-emma-webber-of-stabbed-nottingham-university-student-calls-for-inquiry-valdo-calocane",
        "title": "Mother of stabbed Nottingham university student calls for inquiry",
        "description": "Emma Webber describes ‘fury’ at sentence received by Valdo Calocane for deadly rampage last June"
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24078757.sir-keir-starmer-rules-renationalising-thames-water/",
        "title": "Sir <b>Keir Starmer</b> rules out renationalising Thames Water",
        "description": "The man tipped to be the country’s next Prime Minister has said it is “time for a rethink” about how water companies behave."
    },
    {
        "url": "https://www.itv.com/thismorning/articles/the-traitors-crowns-winner-in-dramatic-final-episode",
        "title": "The Traitors crowns winner in dramatic final episode... but who prevailed?",
        "description": "Labour leader Sir <b>Keir Starmer</b> joins us live in the studio to talk about his vision for Britain&#39;s future ahead of the general election. Charles, 75, was seen entering the private London Clinic in central London on Friday morning with the Queen at his side."
    },
    {
        "url": "https://www.lbc.co.uk/news/former-police-officer-assaulted-nottingham-killer-a-year-before-rampage/",
        "title": "Former police officer believes he was assaulted by triple killer Valdo Calocane one year before deadly Nottingham attacks",
        "description": "Such incidents have led to calls for a public inquiry to take place into the circumstances that led to last year’s attacks, a proposal which has been backed by Labour leader Sir <b>Keir Starmer</b>. The brother of Grace O&#39;Malley-Kumar, James Grace O&#39;Malley ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/rochdale-byelection-could-become-toxic-labour",
        "title": "Labour Fears Extremists Will Target Rochdale By-Election",
        "description": "There are fears the by-election in the Labour safe seat of Rochdale could be heated, with the town&#39;s recent history with child sex exploitation"
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24078516.sir-keir-starmer-speaks-thames-water-supply-chaos/",
        "title": "Sir <b>Keir Starmer</b> speaks out after Thames Water supply chaos",
        "description": "The man tipped to be the country’s next Prime Minister has said it is “time for a rethink” about how water companies behave after"
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-tory-plot-threat-2876230?ico=editors_picks",
        "title": "The plot against Sunak: Why ‘second rate’ Tories could still pose threat to PM",
        "description": "Despite the latest bout of Conservative infighting, some in Labour are still nervous about potential weakness in the so-called &#39;Red Wall&#39;"
    },
    {
        "url": "https://www.shropshirestar.com/news/features/2024/01/27/political-column-january-27/",
        "title": "Toby Neal on politics: Upset Tories should realise lampooning those in power is an age-old tradition",
        "description": "Derek was a former Fleet Street editor who spoke with a Cockney accent and was dubbed &quot;Sid Yobbo&quot; by Private Eye, an unfair stereotype – he was actually an opera lover – which was perpetuated by the satirical BBC Week Ending radio show."
    },
    {
        "url": "https://www.thenational.scot/politics/24078603.mhairi-black-icjs-ruling-will-mean-nothing-dont-step/",
        "title": "Mhairi Black: The ICJ&#39;s ruling will mean nothing if we don&#39;t step up",
        "description": "AS I write this, the International Court of Justice (ICJ) is discussing South Africa’s submission that it believes Israel is responsible"
    },
    {
        "url": "https://www.thesun.co.uk/news/25535861/british-oil-tanker-marlin-luanda-hit-houthi-rebels-fire/",
        "title": "‘British’ oil tanker Marlin Luanda hit in Iran-backed Houthi rebels strike sparking fire off Yemen coast",
        "description": "A ‘BRITISH’ oil tanker was tonight hit by Houthi rebels strikes off the Yemen coast. The Iran-backed rebels claimed the chilling revenge attack on the Marlin Luanda ship, which burst"
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/c035gp160jro",
        "title": "Ex-lord mayor quits party over Israel-Gaza stance",
        "description": "“I am a proud, lifelong anti-racist campaigner,” he told the Local Democracy Reporting Service. Mr Rahman criticised Labour leader Sir <b>Keir Starmer</b>’s stance on the Israel-Gaza conflict, highlighting what he called Sir <b>Keir</b>&#39;s &quot;unquestioning support ..."
    },
    {
        "url": "https://uk.news.yahoo.com/everyone-knows-tories-failed-says-001711017.html",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "Sir <b>Keir Starmer</b> paid a visit to Tilehurst in Reading on Friday to outline his plans to tackle anti-social behaviour as the Reading Chronicle was invited to interview him. One of the main topics on the agenda is Labour&#39;s expected victory which will see the ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13012567/new-law-zombie-knives-machetes-illegal-critics.html",
        "title": "New law to make zombie knives and machetes illegal a &#39;ban in name only&#39;, critics say",
        "description": "We will continue to invest in youth services that have prevented thousands of violent injuries.&#39; Sir <b>Keir Starmer</b>, meanwhile, has unveiled Labour&#39;s own plan to crack down on crime, calling on parents to intervene if they discover their children are ..."
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/national/mother-of-barnaby-webber-vows-to-have-happy-home-again-and-backs-public-inquiry-98611/",
        "title": "Mother of Barnaby Webber vows to have happy home again and backs public inquiry",
        "description": "Sir <b>Keir Starmer</b>, a former head of the Crown Prosecution Service, called the deaths “absolutely awful” as he backed the demand for an inquiry into the case. Mrs Webber told The Times her family “fully support” the calls for a public inquiry."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/24077512.valdo-calocanes-sentence-change-reviewed-appeal-court/",
        "title": "How could Valdo Calocane’s sentence change if reviewed by appeal court?",
        "description": "Labour leader Sir <b>Keir Starmer</b> added his voice to calls for an inquiry into any failings that led to the attacks after the families of the three people Calocane killed reacted angrily to the sentencing, accusing prosecutors of a “fait accompli” in ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-akshata-murty-doorstep-2869086?ico=in-line_link",
        "title": "Special agent Murty: Sunak’s wife deployed as Tories’ doorstep secret weapon",
        "description": "The difference with <b>Keir Starmer</b>’s PMQs attacks on the Prime Minister, however, was based on his record in government. They cite the fact he held a “fireside chat” with billionaire Elon Musk last year, as well as his private jet “habit”."
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24078539.keir-starmer-pledges-bring-respect-back-reading/",
        "title": "<b>Keir Starmer</b> pledges to bring respect back to Reading",
        "description": "Sir <b>Keir Starmer</b> has today outlined new measures to stamp out antisocial behaviour. Citing his experience as Director of Public Prosecutions, <b>Starmer</b> will pledge that “no-one will be above the law in a Britain that I lead, and no crime or ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/hatred-margaret-thatcher-still-burns-31959010?int_source=nba",
        "title": "&#39;Hatred&#39; of Margaret Thatcher &#39;still burns bright&#39; in Scots mining communities 40 years on, says MP",
        "description": "The Midlothian MP also hit out at Labour’s Sir <b>Keir Starmer</b> for ignoring his calls for a pardon in Scotland for those convicted of offences relating to the 1984-1985 strike to be extended south of the border. “People have not forgotten what went on."
    },
    {
        "url": "https://www.palatinate.org.uk/labour-on-cronyism-time-for-a-crackdown/",
        "title": "Labour on cronyism: time for a crackdown?",
        "description": "Sir <b>Keir Starmer</b>’s declaration that he wants to “crack down on cronyism” is at once an attack on Conservative Party history, the conduct of the current government and an allusion to the Labour government that looks increasingly likely to control the ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13012079/Parents-role-play-stopping-children-carrying-knives-Labour-leader-Keir-Starmer-warns-unveils-plan-tackle-epidemic-end-apology-letters-let-youths-blades-dodge-charges.html",
        "title": "Parents have a role to play in stopping their children from carrying knives, Labour leader <b>Keir Starmer</b> warns as he unveils plan to tackle &#39;epidemic&#39; - and end &#39;apology letters ...",
        "description": "Parents have a role to play to ensure their children do not carry knives, Sir <b>Keir Starmer</b> said yesterday as he launched a crime crackdown. Speaking exclusively to the Daily Mail, the Labour leader suggested parents should consider handing knives into ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/state-crumbling-tories-conservative-party-pretend-tax-cuts-b1135033.html",
        "title": "Tax cuts in this economy? This Tory obsession is a fiscal scorched earth strategy aimed at Labour",
        "description": "Moreover, tax cuts pose a challenge to Labour. Partly because Sir <b>Keir Starmer</b> can’t go into an election in the middle of a cost-of-living crisis and oppose a cut to the basic rate of income tax. But also because the more money the Tories allocate to tax ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25537574/parents-must-stop-kids-blighting-neighbourhoods-sir-keir-starmer/",
        "title": "Parents must step up to stop their kids blighting neighbourhoods with anti-social behaviour, Sir <b>Keir Starmer</b> says",
        "description": "PARENTS must step up to stop their kids blighting neighbourhoods with disruptive anti-social behaviour, Sir Keir Starmer says. The Labour leader issued a ‘war on yobs’ intent on causing misery as"
    },
    {
        "url": "https://www.thesun.co.uk/news/25538255/nottingham-grace-omalley-kumar-george-cross/",
        "title": "Heroic Nottingham victim Grace O’Malley-Kumar ‘deserves posthumous George Cross’, says former top cop",
        "description": "HEROIC Grace O’Malley-Kumar should get a posthumous George Cross, a former senior Met cop said earlier today. Grace, who gave her life to try to save pal Barnaby Webber, merits the non-military"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/outrage-100-lions-shot-dead-31979046",
        "title": "Outrage as 100 lions shot dead by British trophy hunters since 2015 - and it could even more",
        "description": "Figures released by the Government show 80% of the lions shot by Britons were bred to be killed in enclosed fields in what is known as ‘&quot;canned hunting&quot;"
    },
    {
        "url": "https://www.thelondoneconomic.com/news/israel-must-comply-with-profoundly-serious-icj-ruling-in-full-lammy-says-367655/",
        "title": "Israel must comply with ‘profoundly serious’ ICJ ruling in full, Lammy says",
        "description": "Labour has hardened its tone towards the Israeli PM in recent weeks, with leader Sir <b>Keir Starmer</b> describing Mr Netanyahu’s opposition to the establishment of a Palestinian state when the war ends as “unacceptable”. Foreign Secretary Lord David ..."
    },
    {
        "url": "https://www.standard.co.uk/news/crime/dave-charlie-daily-mail-nottingham-keir-starmer-b1135198.html",
        "title": "Mother of Barnaby Webber vows to have happy home again and backs public inquiry",
        "description": "Sir <b>Keir Starmer</b>, a former head of the Crown Prosecution Service, called the deaths “absolutely awful” as he backed the demand for an inquiry into the case. Mrs Webber told The Times her family “fully support” the calls for a public inquiry."
    },
    {
        "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/suspended-former-east-riding-liberal-9060927",
        "title": "Suspended former East Riding Liberal Democrat leader&#39;s defection to Labour sparks &#39;bullying&#39; and &#39;behaviour&#39; row",
        "description": "The charges were set to be investigated at a regional level. But Cllr Nolan has now left the party entirely to join Labour, despite previously being critical of them and leader <b>Keir Starmer</b>. The councillor, who was first elected 20 years ago, said he had ..."
    },
    {
        "url": "https://inews.co.uk/opinion/david-cameron-rishi-sunak-change-everything-2865971?ico=most_read_by_subscribers",
        "title": "Can David Cameron solve the ‘Rishi riddle’?",
        "description": "Moderate Tories on the other hand, who dislike the monomaniacal focus on these issues, flirt with tactical voting in southern seats, or perhaps consider a new romance with Sir <b>Keir Starmer</b>’s Labour. Rishi Sunak is focused and dogged in his desire to help ..."
    }
]