[
    {
        "url": "http://www.chinaview.cn/20240118/9094d4152e874e1a9eeccf0f7843f1c5/c.html",
        "title": "British lawmakers pass PM&#39;s Rwanda bill",
        "description": "<b>Keir Starmer</b>, leader of the main opposition Labour Party, said earlier Wednesday that Sunak has been &quot;brutally exposed by his own MPs yet again&quot; and called the government&#39;s plan &quot;a farce.&quot; The British government said that it has given Rwanda 240 million ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/times-letters-obesity-crisis-and-fears-about-the-nanny-state-fbtwwv5kq",
        "title": "Times letters: Obesity crisis and fears about the nanny state",
        "description": "Sir, As far as childhood obesity goes, Alice Thomson is right to believe that voters may welcome a little nannying (“Starmer right to assert his inner Mary Poppins”, Jan 17). For the past 30 years"
    },
    {
        "url": "https://www.ibtimes.co.uk/sunak-defends-rwanda-plan-pmqs-starmer-goes-offensive-ahead-crucial-vote-1722804",
        "title": "Sunak Defends Rwanda Plan At PMQS As <b>Starmer</b> Goes On The Offensive Ahead Of Crucial Vote",
        "description": "Two deputy chairmen of the Conservatives resigned from their roles as they joined dozens of Tory right-wingers in backing amendments to toughen the scheme."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12976309/DAILY-MAIL-COMMENT-Tories-sense-Rwanda.html",
        "title": "DAILY MAIL COMMENT: At 11th hour, Tories see sense on Rwanda",
        "description": "After a nail-biting day of cajoling, reassuring, phone-calling, arm-twisting and - let&#39;s not be coy - threats by the whips, Tory MPs backed Rishi Sunak&#39;s flagship Rwanda migrant plan."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856939/tory-wimps-rishi-sunak-rwanda-comment",
        "title": "How Rishi Sunak beat the Tory right with Priti Patel&#39;s deal, <b>Starmer</b>&#39;s PMQs and MP &#39;wimps&#39;",
        "description": "ANALYSIS: Rishi Sunak has won a major victory and defeated the right of his party meaning he now will almost certainly lead the Tories into the next election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sir-tony-lloyd-labour-mp-rochdale-dies-xdqvnqlsc?ilc=timesradio:morefromthetimes",
        "title": "Sir Tony Lloyd, Labour MP for Rochdale, dies at 73",
        "description": "Sir <b>Keir Starmer</b>, the Labour leader, said that Lloyd’s death was a “terrible loss”, writing on Twitter/X: “We will remember his deep commitment to Labour values and his decency.”"
    },
    {
        "url": "https://www.heraldscotland.com/news/24057403.sunak-survives-rwanda-rebellion-melts-away/?ref=rss",
        "title": "Sunak survives as Rwanda rebellion melts away",
        "description": "Labour has accused Rishi Sunak of being “in office but not in power,” after the Prime Minister saw off a rebellion over his flagship Rwanda plan."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/17/conservatives-release-better-call-saul-keir-starmer-attack/",
        "title": "Conservatives release Better Call Saul-themed <b>Keir Starmer</b> attack advert",
        "description": "Sir Keir came under fire on Wednesday for once acting on behalf of Hizb ut-Tahrir, an Islamist extremist group"
    },
    {
        "url": "https://www.ibtimes.co.uk/sunak-says-uk-ready-strike-houthis-rebels-once-more-1722770",
        "title": "Sunak Says UK Is Ready To Strike Houthis Rebels Once More",
        "description": "Rishi Sunak contradicts Grant Shapps as he warns that the UK is ready to strike Yemeni rebels once more if the group continue to hold hostages and attack shipments."
    },
    {
        "url": "https://www.politico.eu/article/rishi-sunak-rwanda-bill-vote-win/",
        "title": "Rishi Sunak wins Rwanda bill vote after facing down rebels",
        "description": "The Safety of Rwanda (Asylum and Immigration) Bill passed its third reading Wednesday evening with 320 MPs voting in support, and 276 voting against, giving the government a comfortable majority of 44. Only 11 Conservative MPs voted against the bill, including former Home Secretary Suella Braverman and former immigration minister Robert Jenrick."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68012008",
        "title": "Rwanda plan: What’s next after Sunak wins vote?",
        "description": "Rishi Sunak’s flagship Rwanda plan has passed a key vote amongst MPs by 320 votes to 276. Enough MPs backed the government&#39;s key Safety of Rwanda Bill, meaning a touted rebellion by a group of Conservative MPs failed to materialise."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rwanda-deportation-bill-passes-as-tory-rebellion-collapses-4482668",
        "title": "Rwanda deportation bill passes as Tory rebellion collapses",
        "description": "The Rwanda Bill has passed through the House of Commons after a Tory rebellion over the policy collapsed, in a significant victory for Prime Minister Rishi Sunak. MPs on the right of the party had sought compromises from Downing Street over the legislation, only to buckle when it came to the vote."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-has-won-the-immigration-battle-but-hes-losing-the-election-war-2860531?ico=related_article_inline",
        "title": "Sunak has won the immigration battle but he’s losing the election war",
        "description": "Rishi Sunak has won an important victory in the House of Commons. But he is losing the battle that really matters – for the hearts and minds of the public. It is without doubt a victory for the Prime Minister to have pushed his Safety of Rwanda Bill through the Commons, although he faces a real fight to get it through the Lords."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/parliament-hold-minutes-silence-memory-28465720",
        "title": "Parliament to hold a minute&#39;s silence in memory of Rochdale MP Sir Tony Lloyd",
        "description": "MPs will hold a minute&#39;s silence on Thursday (January 18) in memory of Tony Lloyd following his death aged 73. The Rochdale MP died &#39;peacefully&#39; and &#39;surrounded&#39; by his loved ones on Wednesday morning, his family announced."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/17/rishi-sunak-latest-news-rwanda-rees-mogg-farage/?utmsource=email",
        "title": "Rwanda Bill passes as only 11 Tory MPs rebel",
        "description": "Brendan Clarke-Smith, who won the Red Wall seat of Bassetlaw at the last general election, left his position on Tuesday to support amendments aimed at toughening the Prime Minister’s proposals, including one that would direct British courts to ignore ECHR rulings in specific cases."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/17/rwanda-president-efforts-to-implement-asylum-plan-cannot-drag-on",
        "title": "Rwanda president: efforts to implement asylum plan cannot ‘drag on’",
        "description": "Paul Kagame also says he would be happy for the scheme to be scrapped"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/17/starmer-writes-to-civil-service-chief-to-request-start-of-access-talks/",
        "title": "<b>Starmer</b> writes to civil service chief to request start of access talks",
        "description": "It is understood the talks about a potential change of government after the election could start before the end of January."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/17/labour-request-talks-with-civil-service-in-preparation-for-no-10",
        "title": "Labour request talks with civil service in preparation for No 10",
        "description": "<b>Keir Starmer</b> writes cabinet secretary, to begin so-called access talks ahead of possible election victory Labour has formally requested talks with the civil service in preparation for government if the party wins the election, with discussions expected to ..."
    },
    {
        "url": "https://www.thenational.scot/news/24057163.keir-starmer-slammed-new-gaza-ceasefire-u-turn/",
        "title": "<b>Keir Starmer</b> slammed over new Gaza ceasefire U-turn",
        "description": "KEIR Starmer has been slammed over another policy U-turn – after appearing to shift his stance on a ceasefire in Gaza."
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/01/rishi-sunaks-hollow-victory",
        "title": "Tories pray for electoral salvation. Will St Boris intercede?",
        "description": "Remember, the public doesn’t trust the Conservatives on immigration, and the infighting this week (plus <b>Keir Starmer</b>’s jibes) have only further eroded the government’s authority."
    },
    {
        "url": "https://uk.news.yahoo.com/york-mps-seat-change-hands-050000665.html",
        "title": "York MP&#39;s seat would change hands if general election was &#39;tomorrow&#39;, survey says",
        "description": "“While the mood is certainly difficult and the Government must listen to the concerns of voters, there is no appetite for a Labour government led by <b>Keir Starmer</b>. “Ultimately though, the only poll that counts is election day and I will continue to work ..."
    },
    {
        "url": "https://www.counterfire.org/article/no-one-does-polarisation-like-trump/",
        "title": "No one does polarisation like Trump",
        "description": "While infrastructure and other spending seems big by European standards – and is a far more ambitious package than that offered by <b>Keir Starmer</b> in Britain – it meant only a modest improvement for most working people and going backwards for others."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/simon-case-rishi-sunak-keir-starmer-prime-minister-conservatives-b1133090.html",
        "title": "<b>Starmer</b> writes to civil service chief to request start of access talks",
        "description": "It is understood the talks about a potential change of government after the election could start before the end of January."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-tony-lloyd-keir-starmer-210406570.html",
        "title": "Sir Tony Lloyd: <b>Keir Starmer</b> pays tribute to Rochdale MP who died age 73",
        "description": "Keir Starmer paid tribute to RochdaleMP Sir Tony Lloyd, who passed on Wednesday 17 January, aged 73. The Labour MP for Rochdale, “died peacefully” at home on Wednesday morning, his family said. The veteran MP had an untreatable form of leukaemia,"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25397535/sunak-wins-rwanda-vote-rebellion-melts/",
        "title": "Rishi Sunak WINS crunch vote on Rwanda as Tory rebellion fizzles out – marking huge boost for PM’s migration plan",
        "description": "RISHI Sunak has tonight WON a crunch vote on his Rwanda plan after seeing off a Tory revolt. The PM successfully rammed his flagship migration legislation past its final Commons hurdle by 320"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12975645/Rishi-Sunak-Rwanda-Bill-Commons-Tory-rebels-Channel-migrants-boats.html",
        "title": "Rishi Sunak lives to fight another day as his Rwanda Bill CLEARS the Commons with Tory rebels shying away from collapsing the government - but now the PM faces guerrilla ...",
        "description": "Rishi Sunak&#39;s flagship legislation was given its third reading by MPs after rebels stopped short of inflicting a defeat that could potentially have collapsed the government."
    },
    {
        "url": "https://www.ft.com/content/f1be3899-1054-4f1d-b870-fc357f3edbfa",
        "title": "Live news: US court lifts stay on Apple Watch sales ban",
        "description": "A US appeals court has lifted its stay on a sales ban on two editions of the Apple Watch, creating another hurdle in the tech giant’s legal dispute with health technology company Masimo over patents for its blood oxygen tracking function. The dollar hit a one-month high as traders slashed expectations for a March interest rate cut in the US."
    },
    {
        "url": "https://www.politics.co.uk/parliament/keir-starmer-pays-tribute-to-sir-tony-lloyd-veteran-labour-mp-who-has-died-aged-73/",
        "title": "<b>Keir Starmer</b> pays tribute to Sir Tony Lloyd, veteran Labour MP, who has died aged 73",
        "description": "Speaking in a point of order in the House of Commons this evening, Labour leader Keir Starmer paid tribute to Sir Tony Lloyd who it has been announced died today age 73. Starmer said: “I’m grateful for this point of order,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-rebels-win-rwanda-vote-b2480397.html",
        "title": "Rattled PM faces down rebels to win crunch Rwanda vote",
        "description": "Revolt melted away as Tory MPs accused of ‘wimping out’ of vote that could have put Rishi Sunak’s leadership in jeopardy"
    },
    {
        "url": "https://www.itv.com/watch/news/we-will-not-be-forgiven-if-were-not-ready-inside-sir-keir-starmers-bid-to-become-pm/2r1kcjb",
        "title": "&#39;We will not be forgiven if we&#39;re not ready&#39;: Inside Sir <b>Keir Starmer</b>&#39;s bid to become PM",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://morningstaronline.co.uk/article/maybe-you-should-ask-for-your-money-back",
        "title": "Maybe you should ask for your money back?",
        "description": "Fresh humiliations for Sunak as Rwandan president makes embarrassing offer ahead of crunch vote on refugees fiasco"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/tributes-paid-to-former-shadow-ni-secretary-tony-lloyd-following-death-CJUCXA3QTNB5TDIZWPSFMOF3OU/",
        "title": "Tributes paid to former shadow NI Secretary Tony Lloyd following death",
        "description": "Former shadow Secretary of State for the north Tony Lloyd will be remembered for his “strong affinity and connection with Ireland” following his death at the age of 73. The Labour MP for Rochdale died on Wednesday morning, his family confirmed."
    },
    {
        "url": "https://www.heraldscotland.com/news/24057294.veteran-labour-mp-sir-tony-lloyd-died/",
        "title": "Veteran Labour MP Sir Tony Lloyd has died",
        "description": "Labour leader Sir <b>Keir Starmer</b> paid tribute to the veteran politician’s “desire to make the world a better, fairer place” and called his passing a “terrible loss”. Prime Minister Rishi Sunak said his thoughts were with Sir Tony’s family, ..."
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-rattled-by-rwanda-ridicule-2859536",
        "title": "Rishi rattled by Rwanda ridicule",
        "description": "The PM suffered a multiple motorway pile-up of ridicule in PMQs as Keir Starmer repeatedly asked an unanswerable question"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68007463",
        "title": "Rwandan president Paul Kagame suggests UK could get money back",
        "description": "Rwanda&#39;s President Paul Kagame has said he could return money to the UK if no asylum seekers are sent to his country under his deal with the government. The UK has paid £240m to Rwanda, with a further £50m to come. So far, no asylum seekers have been sent to the country."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-lincolnshire-68007571.amp",
        "title": "Bronson Battersby: Review after boy, two, and dad found dead",
        "description": "A two-year-old boy and his dad have been found dead at a property in Skegness, prompting a &quot;rapid review&quot;. Bronson Battersby was found alone in the house with his 60-year-old dad, named locally as Kenneth,"
    },
    {
        "url": "https://news.sky.com/story/tories-defend-better-call-keir-attack-ad-that-seeks-to-highlight-labour-leaders-legal-past-13050372",
        "title": "Tories defend &#39;Better Call <b>Keir</b>&#39; attack ad that seeks to highlight Labour leader&#39;s legal past",
        "description": "The Conservative Party has defended a controversial attack ad targetting Sir <b>Keir Starmer</b>, which seeks to draw attention to the Labour leader&#39;s advice to an Islamist group. The ad - which plays on the legal crime drama Better Call Saul - said: &quot;Are you a ..."
    },
    {
        "url": "https://www.telegraph.co.uk/health-fitness/conditions/bones-joints/bad-teeth-dentist-supervised-brushing-starmer-heart-health/",
        "title": "‘Having bad teeth nearly killed me’",
        "description": "As <b>Keir Starmer</b> calls for supervised brushing in schools, one man describes how a routine appointment lead to a near-fatal heart condition ‘I wish I&#39;d known then about the correlation between the teeth and the heart, and had looked after them better’ I ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/red-every-sense-sir-tony-28464277",
        "title": "A red in every sense, Sir Tony Lloyd was a pillar of Greater Manchester politics - and a staunch campaigner for justice for its citizens",
        "description": "Sir Tony Lloyd, who has died aged 73, was quietly spoken, always sharply dressed and had a long political career. He was the first - albeit interim - Greater Manchester mayor in 2015, a post he held for two years. The roots of his political passion lay in the Spanish Civil War of the 1930s."
    },
    {
        "url": "https://www.itv.com/news/2024-01-17/sunak-faces-crunch-vote-as-rwanda-plan-dealt-fresh-blow-by-senior-resignations",
        "title": "Rwanda: No10 urges Tories to &#39;get behind this Bill&#39; ahead of crunch vote",
        "description": "MPs are currently debating Rishi Sunak&#39;s Rwanda plan ahead of a crucial vote on Wednesday evening | ITV National News"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/starmer-better-call-keir-tories_uk_65a8114ee4b00bbb446d9353",
        "title": "Tories Mocked For &#39;Better Call <b>Keir</b>&#39; Attack On <b>Starmer</b>",
        "description": "The Conservative Party has faced ridicule after likening Keir Starmer to Bob Odenkirk’s character in the hit US TV show Better Call Saul. Highlighting the Labour leader’s time as a criminal defence barrister is gearing up to be one of the Tory election attack lines in the run-up to this year’s vote."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25399105/sunak-set-to-win-rwanda-rebellion-fizzles/",
        "title": "Rishi Sunak on course to WIN crunch Rwanda vote as Tory rebellion fizzles out",
        "description": "RISHI Sunak looks set to WIN tonight’s make-or-break Rwanda vote after a Tory revolt fizzled out. Most of the rightwingers threatening to oppose the PM have reluctantly agreed to back him"
    },
    {
        "url": "https://morningstaronline.co.uk/article/refugees-victims-tory-infighting",
        "title": "Refugees victims of Tory infighting",
        "description": "One Tory, Giles Watling, even proposed an armed invasion of northern France to block refugees seeking to cross the Channel. “This is a defence of the realm matter and we need British boots on the ground,” he told MPs."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/breaking-veteran-labour-mp-sir-31904797.amp",
        "title": "Veteran Labour MP Sir Tony Lloyd dies aged 73 after leukaemia battle",
        "description": "Rochdale MP Sir Tony Lloyd died peacefully at home after leaving hospital last week to spend time with his family when doctors said his illness had become untreatable"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-rwanda-bill-tory-rebellion-commons-votes-resignations-12593360?postid=7081103",
        "title": "Politics live: Braverman joins rebel warnings to Sunak ahead of defining night for Rwanda plan",
        "description": "It comes after the prime minister was told off during a feisty exchange with Sir <b>Keir Starmer</b> at PMQs. Rwanda treaty does not make country safe for asylum seekers, peers warn Rishi Sunak&#39;s Rwanda treaty does not make it a safe country to send asylum ..."
    },
    {
        "url": "https://uk.news.yahoo.com/bruised-sunak-survives-key-vote-220251865.html",
        "title": "Bruised Sunak Survives Key Vote on His UK Immigration Policy",
        "description": "Rishi Sunak’s signature plan to deport asylum-seekers survived a key vote in Parliament, but not before the British prime minister suffered a series of blows to his authority that damaged his hopes of avoiding defeat at a general election later this year."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/king-charles-to-attend-hospital-for-prostate-treatment/",
        "title": "King Charles to attend hospital for prostate treatment",
        "description": "The King will go to hospital next week where he will be treated for an enlarged prostate. The 75-year-old monarch&#39;s condition is benign but his public engagements will be postponed while he recuperates after the corrective procedure in a few days, Buckingham Palace has announced."
    },
    {
        "url": "https://www.theguardian.com/society/2024/jan/17/labour-should-revive-its-inspired-sure-start-scheme",
        "title": "Labour should revive its inspired Sure Start scheme",
        "description": "Letters: Dr Sebastian Kraemer praises the children’s centres that provided for the poorest preschool children. Plus letters from John Anderson, Janet Lail, Gabrielle Palmer and a group of charities"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/sir-tony-lloyd-veteran-labour-mp-for-rochdale-dies-aged-73/",
        "title": "Sir Tony Lloyd: Veteran Labour MP for Rochdale dies aged 73",
        "description": "Labour leader Sir <b>Keir Starmer</b> said: &quot;The death of Sir Tony Lloyd today is a terrible loss. I know the entire Labour Party, and many beyond the party, join me in sending our deepest condolences to Tony&#39;s wife, Judith, his children, Siobhan, Angharad ..."
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/01/17/pmqs-verdict-keir-starmer-cant-lose-as-long-as-the-rwanda-plan-looms/",
        "title": "PMQs verdict: <b>Keir Starmer</b> can’t lose as long as the Rwanda plan looms",
        "description": "The opinions in Politics.co.uk&#39;s Comment section are those of the author. <b>Keir Starmer</b>, sensing an opening, continued. In fact, he asked the prime minister to detail the whereabouts of “lost” asylum seekers a further two times before he arrived at his ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24056382.labour-defends-starmers-legal-advice-hizb-ut-tahrir-tory-attack/",
        "title": "Labour defends <b>Starmer</b>’s legal advice to Hizb ut-Tahrir after Tory attack",
        "description": "Labour has defended Sir <b>Keir Starmer</b>’s decision to advise the soon-to-be-banned Islamist group Hizb ut-Tahrir during his legal career after Rishi Sunak used the case as an attack line against the Opposition leader. It is a “fundamental principle” of ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/stand-sit-down-commons-speaker-143959533.html",
        "title": "&#39;When I Stand Up, You Sit Down&#39;: Commons Speaker Brutally Slaps Down Rishi Sunak",
        "description": "Rishi Sunak was slapped down by the Commons Speaker on Wednesday after he brandished a “prop” attacking <b>Keir Starmer</b> during PMQs. Lindsay Hoyle told the PM: “When I stand up, please sit down.” The clash came during feisty exchanges between Sunak ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/veteran-labour-mp-sir-tony-lloyd-dies-commons-b1133020.html",
        "title": "Veteran Labour MP Sir Tony Lloyd dies at the age of 73",
        "description": "Sir <b>Keir Starmer</b> was among those paying tribute. The Labour leader said: &quot;The death of Sir Tony Lloyd today is a terrible loss. &quot;We will remember his deep commitment to Labour values and his decency. &quot;May he rest in peace.&quot; Sir Tony first entered ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tony-lloyd-labour-rachel-reeves-rochdale-rishi-sunak-b2480262.html",
        "title": "Labour MP Sir Tony Lloyd dies days after announcing terminal cancer diagnosis",
        "description": "Labour leader Sir <b>Keir Starmer</b> Labour leader Sir <b>Keir Starmer</b> paid tribute to the veteran politician’s “desire to make the world a better, fairer place” and called his passing a “terrible loss”. Prime Minister Rishi Sunak said his thoughts were ..."
    },
    {
        "url": "https://www.thenational.scot/news/24056854.veteran-labour-mp-tony-lloyd-dies-aged-73-blood-cancer-battle/",
        "title": "Veteran Labour MP Tony Lloyd dies aged 73 after blood cancer battle",
        "description": "Labour leader <b>Keir Starmer</b> led tributes to Lloyd, praising “his desire to make the world a better, fairer place”. He said: “The death of Sir Tony Lloyd today is a terrible loss. I know the entire Labour Party, and many beyond the Party, join me in ..."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/24054515.poll-two-bradford-tory-mps-lose-election-today/",
        "title": "Poll: Two Bradford Tory MPs would lose if election was today",
        "description": "The results of the model, which uses data from 14,110 respondents answering between December 12, 2023, and January 4, 2024, would see <b>Keir Starmer</b> enter Downing Street having secured a 120-seat majority, with Labour winning 385 Commons seats. This would be ..."
    }
]