[
    {
        "url": "https://www.wsws.org/en/articles/2024/01/25/lvbd-j25.html",
        "title": "Britain’s top army general issues call for conscription and “whole of nation mobilisation” for war",
        "description": "Leader Sir <b>Keir Starmer</b> has openly backed Israel’s genocide in Gaza, branding protests in defence of the Palestinian people as “hate marches” and opposition to Israel’s fascist government as “antisemitism” that must be eradicated. Yesterday ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/no-10-halts-police-funding-plans-over-electoral-basklash-concern",
        "title": "Downing Street Halts New Police Funding Plan Over Fears Of Election Backlash",
        "description": "A long-planned new formula for how the police are funded has been put on hold over concern among ministers that it could result in some local"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/police-targeted-miners-just-post-31969361",
        "title": "&#39;Police targeted miners just as the Post Office went for postmasters - now time for justice&#39;",
        "description": "Fire Brigades Union leader Matt Wrack is calling on the Government to overturn convictions from the 1984 Miners&#39; Strike and offer compensation"
    },
    {
        "url": "https://www.churchtimes.co.uk/articles/2024/26-january/news/uk/timms-warns-labour-not-to-support-assisted-dying",
        "title": "Timms warns Labour not to support assisted dying",
        "description": "In an article published on the Labour List website on Wednesday, Sir Stephen writes that it is “myth” that support for the legalisation of assisted dying is a left-wing position “in contrast to uncompassionate, reactionary Conservatives who wish to condemn those suffering to undignified deaths”."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-trap-reverse-tax-cuts-slash-public-services-2874208?ico=related_stories",
        "title": "Labour’s spending trap: reverse Tory tax cuts or slash public services",
        "description": "Shadow Chancellor Rachel Reeves has rejected calls to raise taxes in order to pay for higher spending, other than a small number of specific tax increases such as imposing VAT on private school fees. She said last week: “I would like taxes to be lower on working people.”"
    },
    {
        "url": "https://www.thenational.scot/politics/24075815.let-humza-yousaf-goad-keir-starmer-making-look-bad/",
        "title": "Let Humza Yousaf goad <b>Keir Starmer</b> into making himself look bad",
        "description": "AS a dedicated supporter of independence, I would like to suggest to Brian Lawson (Letters, Jan 23) that Humza Yousaf’s offer of cooperation"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/drew-hendry-our-mp-faces-toughest-battle-to-hold-on-to-his-340230/",
        "title": "COLIN CAMPBELL: Our MP faces toughest battle to hold on to his seat",
        "description": "Councillor Angus MacDonald and MP Drew Hendry. Drew Hendry has entered his 10th year as MP for the Inverness constituency, and the question looms large as to whether or not he wil"
    },
    {
        "url": "https://morningstaronline.co.uk/article/blair-and-hague-push-sale-nhs-records-private-firms",
        "title": "Blair and Hague push for sale of NHS records to private firms",
        "description": "TONY BLAIR and William Hague came under fire today after they pushed the sale of NHS medical records to private firms. In a joint report, the former political rivals called for the creation of a new NHS data trust “to capitalise on the opportunities of health data” which could be treated as a “competitive asset.”"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/government-yvette-cooper-keir-starmer-idris-elba-labour-b1134817.html",
        "title": "No 10 defends September date for zombie-style blades ban",
        "description": "Labour has called the ban ‘too little, too late’ and promised instead a wider crackdown on the availability of dangerous knives."
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/24074995.lvs-ascot-parents-hit-back-vat-raid-national-campaign/",
        "title": "LVS Ascot parents hit back against VAT raid with national campaign",
        "description": "Parents from an Ascot private school have launched a campaign against a VAT raid proposed by Labour stating that this would disadvantage"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/25/uk-politics-latest-news-updates-covid-inquiry-nicola-sturgeon-humza-yousaf-knife-crime",
        "title": "Ed Balls says <b>Starmer</b> should perform ‘big U-turn’ and drop £28bn as size of green jobs plan – as it happened",
        "description": "Former shadow chancellor says people need to hear Labour say they are commitment to ‘sound public finances’ over worries about taxation increase"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006587/Mark-Drakeford-warns-Keir-Starmer-against-King-Canute-outgoing-Minister-says-tide-going-one-direction-handing-powers-Cardiff-hailing-report-Welsh-independence-viable-option.html",
        "title": "Mark Drakeford warns <b>Keir Starmer</b> against being &#39;King Canute&#39; as outgoing First Minister says &#39;tide is only going in one direction&#39; on handing more powers to Cardiff after ...",
        "description": "The Labour politician told Sir Keir, his party leader, that &#39;the tide is only going in one direction&#39; on further devolution."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/prime-minister-rishi-sunak-visits-east-sussex-village-to-campaign-with-lewes-mp-maria-caulfield-4493065",
        "title": "Prime Minister Rishi Sunak visits East Sussex village to campaign with Lewes MP Maria Caulfield",
        "description": "Prime Minister Rishi Sunak came to East Sussex last week to campaign with Lewes MP Maria Caulfield. He visited the village of Willingdon to meet Mrs Caulfield and Conservative activists as part of a campaign session for the incumbent Lewes MP."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006903/Rishi-Sunak-progress-Tory-rebels-Farage-Reform-Labour.html",
        "title": "Rishi Sunak insists he is making &#39;progress&#39; as Tory rebels plot to replace him with the party just SEVEN points ahead of Nigel Farage&#39;s Reform while Labour has a lead of 34 in ...",
        "description": "Two polls released today gave Labour a huge lead in its main target seats, and gave the Conservatives a narrowing lead over third-placed Reform UK."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/25/uk-politics-latest-news-updates-covid-inquiry-nicola-sturgeon-humza-yousaf-knife-crime?page=with:block-65b28c888f08472b2b0765e9",
        "title": "Ed Balls says <b>Starmer</b> should perform ‘big U-turn’ and drop £28bn as size of green jobs plan – UK politics live",
        "description": "Former shadow chancellor says people need to hear Labour say they are commitment to ‘sound public finances’ over worries about taxation increase"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1859820/penny-mordaunt-rishi-sunak-labour",
        "title": "Penny Mordaunt slaps down Labour as she launches passionate Rishi Sunak defence",
        "description": "Penny Mordaunt slapped down Labour as she launched a passionate defence of Rishi Sunak in the Commons today. The Commons Leader insisted the Prime Minister &quot;doesn&#39;t just get Britain, he represents the best of Great Britain&quot;."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mark-drakeford-westminster-gordon-brown-king-first-minister-b1134830.html",
        "title": "Labour should not play ‘King Canute’ with devolved policing in Wales – Drakeford",
        "description": "The outgoing First Minister said colleagues in Westminster would have a responsibility to show the ‘journey has begun’ towards justice devolution."
    },
    {
        "url": "https://www.miltonkeynes.co.uk/news/crime/keir-starmer-mocks-governments-knife-ban-announcement-during-milton-keynes-visit-4492932",
        "title": "<b>Keir Starmer</b> mocks Government&#39;s knife ban announcement during Milton Keynes visit",
        "description": "Sir Keir Starmer mocked the Government for its latest announcement during his own media event in Milton Keynes. Sir Starmer joked that the Government has announced plans to ban zombie-style knives on 16 different occasions prior to its latest pledge, acknowledging two previous crackdown’s in the past seven years."
    },
    {
        "url": "https://uk.news.yahoo.com/yvette-cooper-uk-knife-crime-135814082.html",
        "title": "Yvette Cooper: UK knife crime &#39;an epidemic&#39;",
        "description": "Labour leader, Sir <b>Keir Starmer</b>, and shadow home secretary, Yvette Cooper, visit Milton Keynes Police Station as Labour is focusing on a youth programme to tackle knife crime. Fresh legislation will be laid in Parliament on Thursday in order to close what ..."
    },
    {
        "url": "https://www.thenational.scot/news/24073300.keir-starmer-refuses-call-israeli-war-crime-palestinian-man/",
        "title": "<b>Keir Starmer</b> refuses to call out Israeli &#39;war crime&#39; against Palestinian man",
        "description": "<b>KEIR Starmer</b> has refused to say whether or not the killing of a Palestinian man walking under a white flag was a war crime. We previously told how ITV obtained footage of the moment a man part of a group in a Gaza “safe zone” was shot dead in the ..."
    },
    {
        "url": "https://www.thesun.co.uk/who/sir-keir-starmer/page/56/",
        "title": "Sir <b>Keir Starmer</b>",
        "description": "Sir <b>Keir Starmer</b> is the Labour leader and has been the MP for Holborn and St Pancras since 2015. ©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. &quot;The Sun&quot;, &quot;Sun&quot;, &quot;Sun Online&quot; are registered ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-pledges-100m-initiative-guide-144141023.html",
        "title": "Labour pledges £100m initiative to guide youth from crime",
        "description": "Sir <b>Keir Starmer</b> and Yvette Cooper visit police in Milton Keynes as they announce a new youth programme to tackle knife crime. Labour have pledged £100 million for a nationwide initiative to support young people at risk of being drawn into violence."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/mancunian-way-time-become-player-28511618",
        "title": "The Mancunian Way: Time to become a player",
        "description": "&quot;He&#39;s clearly well plugged in to what Labour is thinking nationally - he recently presented a series of podcasts about what <b>Keir Starmer</b> would do while in power,” Rob said, adding that Mr Waugh’s previous work on child sexual exploitation (CSE ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1859411/Keir-Starmer-take-the-knee",
        "title": "<b>Keir Starmer</b> slammed after standing by his infamous ‘taking the knee’ photo for BLM",
        "description": "He said his question dodging “It makes a mockery of Sir <b>Keir Starmer</b>’s attacks on ‘culture wars’ when he has taken the knee for BLM and will virtue signal to these groups at the first opportunity. “He can’t provide honest answers on this ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/keir-starmer-accuses-tories-of-salting-the-ground-by-spending-billions-on-tax-cuts_uk_65b13271e4b09e7f5b9e0519",
        "title": "<b>Keir Starmer</b> Accuses Tories Of &#39;Salting The Ground&#39; By Spending Billions On Tax Cuts",
        "description": "<b>Keir Starmer</b> has accused the Tories of planning to spend billions of pounds on tax cuts so there is no money left for an incoming Labour government. He said Jeremy Hunt and Rishi Sunak want to “salt the ground” in the upcoming Budget, where the ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-ill-crack-down-on-knife-crime-05p7b6pb5",
        "title": "<b>Keir Starmer</b>: I’ll crack down on knife crime",
        "description": "Youngsters found carrying knives will no longer escape punishment by writing an apology letter under a Labour government, Sir Keir Starmer has announced. The Labour leader set out proposals to give each knife crime offender a bespoke plan to tackle their reoffending."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24071925.sir-keir-starmer-reveals-plans-tackling-knife-crime/",
        "title": "Sir <b>Keir Starmer</b> reveals plans for tackling knife crime",
        "description": "Proposals to stop lives being lost on the streets by tackling knife crime, shaped following a meeting with mothers of North East murder victims, have been announced by Sir <b>Keir Starmer</b>. The Labour leader heard powerful testimonies from Zoey McGill and ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24070162.really-comparing-johnson-sturgeon-seriously/?ref=eb",
        "title": "Are we really comparing Johnson and Sturgeon? Seriously?",
        "description": "No change there then. I NOTE that Humza Yousaf wishes to set &quot;political differences&quot; aside, and work together with Sir <b>Keir Starmer</b> following this year&#39;s General Election (&quot;Yousaf invites <b>Starmer</b> for ‘respectful’ indy talks&quot;, The Herald, January 22)."
    },
    {
        "url": "https://inews.co.uk/news/media/wilfred-frost-david-son-sky-news-nepo-baby-2848637?ico=in-line_link",
        "title": "Call me a nepo baby but I’ve proved myself, says David Frost’s son Wilfred",
        "description": "I couldn’t be prouder of him.” Wilfred Frost interviewed Sir <b>Keir Starmer</b> when he deputised as presenter of Sky News’ Sunday politics show (Photo: Sky UK Limited) It’s hardly surprising Mr Frost acquired a passion for the family trade. From a young ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/rishi-sunak-latest-news-farage-tory-leadership-election/",
        "title": "Politics latest news: Tories ‘serve no purpose’, says Farage after Reform records highest ever support",
        "description": "Nigel Farage claimed the Red Wall will desert the Tories at the next general election with Rishi Sunak as leader. Mr Farage said that with Mr Sunak leading the Conservative Party “the Red Wall is completely and utterly gone”."
    },
    {
        "url": "https://www.telegraph.co.uk/columnists/2024/01/25/real-problem-with-bbc-left-wing-comedy/",
        "title": "These days, the real elite are the progressive Left – and satire is suffering",
        "description": "The purpose of satire is to mock the elite, but today’s political comedians almost invariably share the elite’s beliefs"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/simon-clarke-penny-mordaunt-prime-minister-great-britain-keir-starmer-b1134798.html",
        "title": "Mordaunt hails Sunak as ‘best of Britain’ after Tory calls for him to be ousted",
        "description": "The Commons Leader sought to rouse support for the Prime Minister just days after Sir Simon Clarke called for him to be replaced."
    },
    {
        "url": "https://www.miltonkeynes.co.uk/news/politics/keir-starmer-hails-police-operation-tackling-knife-crime-on-visit-to-milton-keynes-4492808",
        "title": "<b>Keir Starmer</b> hails police operation tackling knife crime on visit to Milton Keynes",
        "description": "Sir Keir Starmer praised the work of police officers based in Milton Keynes for their approach to knife crime. Yesterday (24 January), the Labour Leader announced his plans to combat knife crime and today visited officers and youth groups to see what can done to eradicate the fatal crime."
    },
    {
        "url": "https://tfn.scot/opinion/we-are-co-architects-not-the-emergency-plumber",
        "title": "We are co-architects, not the emergency plumber",
        "description": "We see every day how approaches to reserved matters like immigration, social security and the economy impact on people and communities in Scotland, with charities, community organisations and faith groups having to step in to support people living in poverty,"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/features/barbie-hillary-clinton-oscars-snub-greta-gerwig-b2484838.html",
        "title": "This Barbie is… Hillary Clinton? Politicians playing film critic is always excruciating",
        "description": "The former US presidential candidate shared her support for ‘Barbie’ after the film was ‘snubbed’ in this week’s Oscar nominations. Her post is pure weapons-grade cringe, writes Louis Chilton – but at"
    },
    {
        "url": "https://morningstaronline.co.uk/article/editorial-strangelove-warpath",
        "title": "Editorial: Sir Patrick Sanders: Strangelove on the warpath with a laughable ‘Dad’s Army’ plan",
        "description": "GENERAL SIR PATRICK SANDERS is literally on the warpath. The chief of the general staff is urging the country to brace itself for armed conflict with Russia."
    },
    {
        "url": "https://inews.co.uk/news/politics/johnson-braverman-tories-sunak-coup-plot-2871939?ico=in-line_link",
        "title": "Johnson and Braverman silent as Tories distance themselves from Sunak coup plot",
        "description": "Suella Braverman and Boris Johnson remained silent over whether they backed the latest bid to remove Rishi Sunak as other potential Conservative leadership contenders said they would stand by the Prime Minister."
    },
    {
        "url": "https://news.sky.com/story/home-secretary-james-cleverly-defends-delay-in-plan-to-toughen-up-zombie-knives-ban-13055715",
        "title": "Third crackdown on zombie knives introduced - but Labour says it&#39;s &#39;too little too late&#39;",
        "description": "The government announced it was going to introduce new regulations on the blades five months ago after they were first banned in 2016."
    },
    {
        "url": "https://www.ft.com/content/5160efba-1a09-49fe-b87c-aeef85240210",
        "title": "Britain needs to get better at measuring growth",
        "description": "Chancellor Jeremy Hunt delivered, by his own account, “110 growth measures” in his Autumn Statement, and Labour leader Keir Starmer promises growth will be his government’s “obsession”. Now it is time to get specific."
    }
]