[
    {
        "url": "https://www.thescottishsun.co.uk/news/11900126/snp-labour-westminster-poll-results/",
        "title": "New poll makes grim reading for SNP as huge Labour boost predicted",
        "description": "LABOUR’S election hopes have been boosted by another poll showing them neck and neck with Nats. The bitter rivals would be locked on 23 seats each in the Westminster vote expected later this year,"
    },
    {
        "url": "https://www.ft.com/content/07bb0c18-00db-4981-93cb-3a6c29c7335d",
        "title": "Live news: US money market assets top $6tn for the first time",
        "description": "US money market assets topped $6tn for the first time, according to the Investment Company Institute. Assets in short-term money funds, which predominantly hold government debt, have continued to rise in 2024 after claiming inflows of more than $1tn in 2023."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rishi-sunak-latest-news-hunt-frost-farage-blair/?utmsource=email",
        "title": "<b>Starmer</b> to press ahead with Labour plans to ‘level-up workers’ rights’",
        "description": "Rachel Reeves has refused to give a commitment to lift income tax thresholds. The shadow chancellor said the tax burden is the “highest it has been in 70 years” but it would be “damaging” to promise tax cuts without knowing how they would be paid for."
    },
    {
        "url": "https://www.ibtimes.co.uk/ex-pm-boris-johnson-attacks-rishi-sunaks-new-brexit-deal-1723151",
        "title": "Ex-PM Boris Johnson Attacks Rishi Sunak&#39;s New Brexit Deal",
        "description": "A YouGov survey of 14,000 respondents forecasted that the Tories will hold on to just 169 seats, while Labour will claim 385. This would deliver Sir <b>Keir Starmer</b>&#39;s party a majority of 120 seats in the upcoming General Election."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/former-rochdale-mp-simon-danczuk-28554289",
        "title": "Former Rochdale MP Simon Danczuk is standing in a by-election for his old seat",
        "description": "Former Rochdale MP Simon Danczuk has announced he is seeking to reclaim his old seat in Parliament. The ex-Labour MP will represent Reform UK - the party founded by former UKIP leader Nigel Farage - at the Rochdale by-election later this month."
    },
    {
        "url": "https://www.thetimes.co.uk/article/why-labours-drawn-to-a-canadian-conservative-6gjw3cb0l",
        "title": "Why Labour’s drawn to a Canadian conservative",
        "description": "Last month a small group of Sir <b>Keir Starmer</b>’s parliamentary candidates took a trip to the United States. In time Westminster will come to know these people as the rising stars of Labour’s 2024 intake: Zubir Ahmed, the consultant cardiologist from ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-labours-economic-policy-least-said-bs020l2gl",
        "title": "The Times view on Labour’s economic policy: Least Said",
        "description": "The party’s lead in the polls owes more to the Conservatives’ taste for self-destruction than an appealing prospectus. It has many questions to answer"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/ex-mp-simon-danczuk-suspended-for-sexting-to-fight-byelection-for-reform",
        "title": "Ex-MP Simon Danczuk suspended for sexting to fight byelection for Reform",
        "description": "Former Labour member likely to be up against George Galloway in contest for Rochdale seat"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68174557",
        "title": "UK Covid inquiry in Scotland: Three weeks in 90 seconds",
        "description": "The UK Covid 19 inquiry has spent three weeks in Edinburgh looking at the decisions made in Scotland during the pandemic."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-risks-raining-popular-enthusiasm-32024264",
        "title": "&#39;Labour risks raining on popular enthusiasm if it keeps kowtowing to overpaid bankers&#39;",
        "description": "The Labour Party might be on a charm offensive with the fatcats in high finance, but Mirror columnist Paul Routledge asks if it&#39;s really necessary to be cosying quite so close to the bankers"
    },
    {
        "url": "https://news.sky.com/story/bleak-economic-backdrop-and-raw-politics-explain-labours-looming-climbdown-on-green-investment-pledge-13061618",
        "title": "Bleak economic backdrop and raw politics explain Labour&#39;s looming climbdown on green investment pledge",
        "description": "With the prospect of an election win within Labour&#39;s grasp, Rachel Reeves doesn&#39;t seem to want to take the risk of sticking to Labour&#39;s green investment pledge. New economic forecasts in the March budget could well be her escape route."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862245/Jeremy-Hunt-National-Insurance-cut-budget",
        "title": "Jeremy Hunt plans to cut 1p off National Insurance in major Spring Budget move",
        "description": "Jeremy Hunt is considering cutting an extra penny off National Insurance in a Spring Budget giveaway. Speaking to the Daily Express, the Chancellor vowed he would prioritise tax cuts that boost growth."
    },
    {
        "url": "https://www.counterfire.org/article/shattered-nation-inequality-and-the-geography-of-a-failing-state-book-review/",
        "title": "Shattered Nation: Inequality and the Geography of A Failing State – book review",
        "description": "Danny Dorling’s new book, Shattered Nation, contains a wealth of data on the impact of inequality on British society over the last fifty years, finds Graham Kirkwood Britain is a failing state."
    },
    {
        "url": "https://inews.co.uk/opinion/business-cant-get-enough-labour-corbyn-2885171?ico=most_popular",
        "title": "Business can’t get enough of Labour – it’s like Corbyn never existed",
        "description": "Smart business leaders don’t want to micromanage every decision; they want political calm, good ministers in post, and to be left alone to run their businesses – this is what Labour offers"
    },
    {
        "url": "https://www.thenational.scot/news/24092051.pro-business-labour-pledge-not-increase-corporation-tax/",
        "title": "&#39;Pro-business&#39; Labour pledge not to increase corporation tax",
        "description": "Labour will not hike the rate of corporation tax during its first term, shadow chancellor Rachel Reeves said as she promised to"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/leadership-lessons-tony-blair-book-deacon-labour-starmer/",
        "title": "Leadership lessons from Tony Blair (*as imagined by Michael Deacon)",
        "description": "The former PM is contractually bound to produce 99,867 words on everything he knows about ‘leadership’. Please spare us"
    },
    {
        "url": "https://www.thenational.scot/news/24091584.keir-starmer-woos-fat-cats-instead-helping-poor/",
        "title": "<b>Keir Starmer</b> woos fat cats instead of helping the poor",
        "description": "“ Labour is the party of business,” Keir Starmer proclaimed in front of a room of city fat cats this afternoon. Well, they’re certainly not a party serious about tackling poverty."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-government-cap-corporation-tax-124529142.html",
        "title": "Labour government will cap corporation tax for five years, says Rachel Reeves",
        "description": "Shadow chancellor also defends move to allow unlimited bonuses for bankers and Labour’s apparent retreat on £28bn green spending pledge"
    },
    {
        "url": "https://www.gg2.net/labour-will-cap-corporation-tax-at-25-per-cent-if-it-wins-election/",
        "title": "Labour will cap corporation tax at 25 per cent if it wins election",
        "description": "LABOUR will cap corporation tax at 25 per cent if it wins the next election and will look to cut that rate if needed, the party’s finance policy chief Rachel"
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/02/keir-starmer-rachel-reeves-28bn-pledge",
        "title": "How Rachel Reeves is making Labour the party of business",
        "description": "Labour’s commitment to increase green investment to £28bn a year has overshadowed the party for months. Caged in by strict, self-imposed fiscal rules, its messaging on the policy has become confused."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/harriet-harman-urges-party-leaders-to-address-mps-safety",
        "title": "Harriet Harman urges party leaders to address MPs’ safety",
        "description": "Labour MP says Rishi Sunak and Keir Starmer must agree on ensuring election campaign is not marred by threats"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862240/Rachel-Reeves-10-times-28-billion",
        "title": "Rachel Reeves refuses 10 times to say if Labour is sticking with £28 billion green splurge",
        "description": "Rachel Reeves has refused ten times in a single interview to say whether Labour is standing by it’s plan to splurge £28 billion on green investment. The Shadow Chancellor faced a bruising showdown on Sky News, in which Beth Rigby failed to get a firm commitment despite asking again and again."
    },
    {
        "url": "https://www.standard.co.uk/news/health/labour-party-children-nhs-keir-starmer-england-b1136387.html",
        "title": "Children ‘pay the price’ of dentistry issues, experts warn",
        "description": "Children are “continuing to pay the price” for issues in NHS dentistry after a survey of 10 and 11 years olds found one in six has experienced tooth decay. There were also disparities between deprived and affluent areas,"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/keir-starmer-says-government-lost-9071387",
        "title": "<b>Keir Starmer</b> says ‘government has lost control’ on knife crime in visit to Bristol school",
        "description": "Labour leader Keir Starmer has pledged action on knife crime if his party gets into power. He was speaking during a visit to Hanham Woods Academy today (Thursday)"
    },
    {
        "url": "https://bylinetimes.com/2024/02/01/keir-starmer-and-the-labour-party-press-and-pundits-running-out-of-dirty-tricks/",
        "title": "<b>Keir Starmer</b> and the Labour Party – Press and Pundits Running Out of Dirty Tricks",
        "description": "Subscribe to our newsletter for exclusive editorial emails from the Byline Times Team."
    },
    {
        "url": "https://www.voice-online.co.uk/news/uk-news/2024/02/01/keir-starmer-doesnt-care-about-black-people/",
        "title": "“<b>Keir Starmer</b> doesn’t care about Black people”",
        "description": "“They take us for granted” he said. “It’s pretty obvious that Keir Starmer doesn’t care about black people. Look at how they deal with Diane Abbott. They’ve shown their cards really internally and externally, policy wise.”"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/reeves-refuses-clarify-28bn-green-170000474.html",
        "title": "Reeves refuses to clarify £28bn green spending pledge",
        "description": "Sir <b>Keir Starmer</b>’s party has been insisting it was not dropping the pledge amid suggestions the scale of the spending was being axed. Labour has grown unsure about the £28 billion a year in green projects that it set out in 2021 amid Tory attacks on ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/letters/labour-party-bankers-bonus-cap-tax-cuts-general-election-b2488712.html",
        "title": "Labour’s decision on bankers’ bonuses confirms our worst fears",
        "description": "<b>Keir Starmer</b> and Rachel Reeves don’t appear to be far removed from the lefty end of the Tory party, and if that continues to be the case they’ll find those of us teetering on the middle ground will stick with the Tory devil they know. <b>Starmer</b> needs to ..."
    },
    {
        "url": "https://www.snp.org/broken-brexit-britains-new-harmful-import-controls/",
        "title": "Broken Brexit Britain’s new harmful import controls",
        "description": "🥀 Whether Westminster is Labour or Tory, neither are offering Scotland real change. Labour and <b>Keir Starmer</b> are committed to keeping the bedroom tax, the cruel two-child cap and are devoted to a hard Brexit."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/24091790.greenwich-council-meeting-evacuated-pro-palestine-protests/",
        "title": "Greenwich Council meeting evacuated after pro-Palestine protests",
        "description": "Pro-Palestinian protests saw a Greenwich Council meeting evacuated after they began shouting from the public gallery."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155026/rochdale-byelection-former-labour-mp-simon-danczuk-bids-to-become-rochdales-first-reform-mp",
        "title": "Rochdale by-election: former Labour MP Simon Danczuk bids to become Rochdale&#39;s first Reform MP",
        "description": "Former Rochdale MP Simon Danczuk is trying his hand at becoming the town’s MP again, by standing for Reform UK."
    },
    {
        "url": "https://www.faber.co.uk/journal/five-of-the-worlds-worst-cities-real-and-imagined/",
        "title": "Five of the World&#39;s Worst Cities – Real and Imagined",
        "description": "We asked Des Fitzgerald, Author of The City of Today is a Dying Thing, for a list of five notable cities around the world. He sent us back a much more interesting selection – five terrible cities!"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033977/Alarm-bells-Rishi-Sunak-poll-Reform-UK-new-high.html",
        "title": "Alarm bells for Rishi Sunak as poll shows Reform UK hitting new high of 14% support in the Red Wall - and a FIFTH of 2019 Tory voters are backing the Nigel Farage-founded party",
        "description": "Research by Redfield &amp; Wilton Strategies suggested the Nigel Farage-founded party is picking up significant support in the crucial election battleground."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/to-build-trust-with-voters-keir-starmer-must-be-honest-with-them",
        "title": "To build trust with voters, <b>Keir Starmer</b> must be honest with them",
        "description": "Letters: The Labour leader must have the courage to make clear the link between taxes and robust public services, writes Peter Riddle. Plus letters from Martin Wicks, Dr Stefan Hawlin and Bernie Evans"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/01/jeremy-hunt-tax-cuts-conservatives-labour-uk-politics",
        "title": "<b>Starmer</b> says Labour would level up workers’ rights in way not attempted for decades – as it happened",
        "description": "Labour leader tells conference that reforms ‘may not please everyone in room’"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68164524",
        "title": "Labour promise not to raise corporation tax if elected",
        "description": "Shadow chancellor Rachel Reeves and party leader Keir Starmer are meeting business leaders at an event in London."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rishi-sunak-latest-news-hunt-frost-farage-blair/",
        "title": "<b>Starmer</b> warns businesses he will &#39;level up&#39; workers&#39; rights",
        "description": "Jeremy Hunt has rebuked the boss of the UK’s economic watchdog after he appeared to liken last year’s public finance forecasts to a “work of fiction”. The Chancellor said Richard Hughes, the chairman of the Office for Budget Responsibility, was “wrong” and the comment “shouldn’t have been said”."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/sir-keir-starmer-promises-stability-and-no-corporation-tax-hikes-under-a-labour-government/a1343502104.html",
        "title": "Sir <b>Keir Starmer</b> promises &#39;stability&#39; and no corporation tax hikes under a Labour government",
        "description": "Sir Keir Starmer said Labour will not change the rate of corporation tax during its first term, as he sought to reassure company bosses that the party&#39;s &quot;pro-business&quot; policies would provide &quot;stability&quot; in the UK economy."
    },
    {
        "url": "https://www.itv.com/news/2024-02-01/how-rachel-reeves-learned-to-love-bankers",
        "title": "How Rachel Reeves learned to love bankers",
        "description": "ITV News&#39; Robert Peston speaks to the shadow chancellor about Labour’s decision to back the removal of the cap on bankers’ bonuses. | ITV National News"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-corporation-tax-pledge-rachel-reeves-business-city-starmer-b1136292.html",
        "title": "Labour makes surprise 25% corporation tax pledge in new City charm offensive",
        "description": "Party also vows to get more women into boardrooms, saying financial services can&#39;t thrive by &#39;ignoring the talents of half of the workforce&#39;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033669/The-new-prawn-cocktail-offensive-Keir-Starmer-makes-bid-jettison-Corbyn-era-cosies-businesses-1-000-head-Labour-conference-party-ruling-corporation-tax-hike-U-turn-bankers-bonuses.html",
        "title": "The new prawn cocktail offensive? <b>Keir Starmer</b> makes another bid to jettison Corbyn era as he cosies up to businesses at £1,000-a-head Labour conference - with party ruling ...",
        "description": "The Green Prosperity pan is no exception to that,&#39; she said. In response to Labour&#39;s business conference today, Treasury minister Ms Trott said: &#39;Sir <b>Keir Starmer</b> has demonstrated live in front of the country&#39;s most senior business leaders that his ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25658518/simon-karen-danczuk-mp-candidate-rochdale/",
        "title": "Sext shame MP Simon Danczuk is standing as Reform candidate after remarrying in wake of split from Karen Danczuk",
        "description": "FORMER Labour MP Simon Danczuk is standing as the Reform Party’s candidate in the Rochdale byelection. He is the first famous politician to defect to the party, which was founded by Nigel Farage"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68170566?at_medium=RSS&at_campaign=KARANGA",
        "title": "Has Labour dropped its £28bn green investment plan?",
        "description": "The money is there to fund Labour&#39;s &quot;green prosperity plan&quot;, a suite of their most important plans for government, including a vast programme of retrofitting homes with insulation, battery factories, clean steel plants, and a publicly-owned clean power generation company."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68170890",
        "title": "Badenoch claims media is &#39;trying to fuel gossip&#39;",
        "description": "The business secretary blames the media for reports of a plot for her to replace Rishi Sunak as a “nonsense story”."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862170/aspana-begum-labour-party-warning",
        "title": "Labour MP Apsana Begum tears into own party with warning her treatment ‘cannot continue’",
        "description": "The hard-left MP has blasted Labour over a two-and-a-half-year process that she claims has caused her distress and damaged health."
    },
    {
        "url": "https://www.politico.eu/article/britain-learned-love-keir-starmer-boring-snoring-right-hand-woman-rachel-reeves-labour-shadow-chancellor/",
        "title": "Labour’s ‘boring, snoring’ Rachel Reeves is winning over Brits",
        "description": "LONDON — She was once a Labour Party outcast, dismissed by Jeremy Corbyn as too right-wing and famously derided by a TV executive as “boring, snoring.” But now Rachel Reeves is on course to be Britain’s first female chancellor, via a close partnership with leader Keir Starmer which shows no signs of cracking under pressure as the election looms."
    },
    {
        "url": "https://www.irishnews.com/life/supervised-toothbrushing-in-schools-and-nurseries-is-a-good-idea-its-proven-to-reduce-tooth-decay-2ZUZV36PCJABTN6NPGT4ODIIDU/",
        "title": "Supervised toothbrushing in schools and nurseries is a good idea – it’s proven to reduce tooth decay",
        "description": "When Labour leader Keir Starmer announced the party’s intention to expand toothbrushing programmes in nurseries and schools, he faced criticism for planning to take away responsibility from parents and place further burden on schools."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-cools-on-its-28bn-green-investment-plan-3skp92pnw?ilc=timesradio:morefromthetimes",
        "title": "Labour cools on its £28bn green investment plan",
        "description": "I can’t pledge we’ll hit that particular level,’ shadow business secretary warns, as party blames ‘damage from Truss mini budget’ on backtrack"
    },
    {
        "url": "https://inews.co.uk/news/politics/be-bold-now-or-risk-a-tory-comeback-starmers-lesson-from-australia-2883214?ico=editors_picks",
        "title": "Be bold now or risk a Tory comeback – <b>Starmer</b>’s lesson from Australia",
        "description": "Labour&#39;s decision not to risk upsetting bankers by capping their bonuses is the latest example of a safety first pre-election strategy. But Australian politics reveal how that can backfire"
    },
    {
        "url": "https://www.camdennewjournal.co.uk/article/labour-intensive",
        "title": "Labour intensive",
        "description": "Jon Cruddas’s account of Labour’s past century is like a penitent Blairite’s history lesson, says George Binette"
    },
    {
        "url": "https://www.cityam.com/labour-playing-bazball-as-starmer-says-business-fingerprints-on-plans-for-power/",
        "title": "Labour playing ‘Bazball’ as <b>Starmer</b> says business ‘fingerprints’ on plans for power",
        "description": "The Labour Party is playing “Bazball”, as SIr Keir Starmer has vowed businesses have their “fingerprints” on the party’s plans for power."
    },
    {
        "url": "https://www.landlordzone.co.uk/news/labour-landslide-would-be-good-for-landlords-say-leading-figure",
        "title": "Labour landslide &#39;best outome for PRS&#39; say landlording expert",
        "description": "“The problem Keir Starmer has is that he has quite a few Corbynista left-wing loons in his party,” explains Bhattacharya. “If Labour win with a relatively small majority he will always have to pander to what that Corbynista wing of the party has to say – that would be the worst outcome.”"
    },
    {
        "url": "https://www.opendemocracy.net/en/labour-city-banks-finance-2m-donations-bankers-bonuses-u-turn-rachel-reeves/",
        "title": "Finance firms gave Labour £2m in two years before banker bonuses U-turn",
        "description": "Exclusive: Labour’s ‘love letter to the City’ policies come after influx of cash and donations in kind from sector"
    },
    {
        "url": "https://socialistworker.co.uk/news/kirklees-councillor-i-voted-starmer-in-2019-i-left-over-his-support-for-israels-war-crimes/",
        "title": "Kirklees councillor: ‘I voted <b>Starmer</b> in 2019, I left over his support for Israel’s war crimes’",
        "description": "Rage at Keir Starmer’s support for Israel’s brutality in Gaza is still causing an exodus from the party. Councillors in London, Yorkshire,"
    },
    {
        "url": "https://www.politics.co.uk/5-minute-read/2024/02/01/rishi-sunak-and-the-long-shadow-of-conservative-psychodrama/",
        "title": "Rishi Sunak and the long shadow of Conservative psychodrama",
        "description": "When Rishi Sunak was gushed into Downing Street in October 2022, surrounded by the rumble of Liz Truss’ collapsed premiership, he faced a profound dilemma. As he acknowledged on the steps of No 10, the terms of his accession meant he was forced to assume the role of “fix it” prime minister: he was"
    },
    {
        "url": "https://uk.news.yahoo.com/pro-business-labour-pledge-not-182250709.html",
        "title": "&#39;Pro-business&#39; Labour pledge not to increase corporation tax",
        "description": "Labour will not hike the rate of corporation tax during its first term, shadow chancellor Rachel Reeves said as she promised to be “pro-business”."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24090516.penny-mordaunt-urged-reveal-traitor-faithful-amid-tory-plots/",
        "title": "Penny Mordaunt urged to reveal if she is a traitor or faithful amid Tory plots",
        "description": "Labour shadow Commons leader Lucy Powell raised questions about Ms Mordaunt’s ‘bizarre’ defence of the Prime Minister."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24087568.snp-way-labour-inheriting-indy-nightmare/",
        "title": "SNP is on way out, but Labour is inheriting an indy nightmare",
        "description": "Will I in future? I don’t know. Will I vote Labour? I don’t know. For social democrats, there’s little to admire in <b>Keir Starmer</b>. Yet I want an end to this disgraceful Conservative Government. So Labour lures me. Meanwhile, my trust in the SNP has ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/keir-starmer-labour-business-conference-rachel-reeves-b1136445.html",
        "title": "Labour is the &#39;party of business&#39; declares <b>Keir Starmer</b> (and every leader before him)",
        "description": "Labour is the party of business. Don&#39;t take my word for it, <b>Keir Starmer</b> said it this afternoon. Addressing Labour&#39;s Business Conference (sponsored by Bloomberg, in a declaration of message discipline), the leader talked of a new partnership with business ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/apsana-begum-slams-labour-over-treatment",
        "title": "Apsana Begum slams Labour over her treatment",
        "description": "LABOUR was slammed today by MP Apsana Begum over its treatment of her as a domestic abuse survivor and Britain’s only hijab-wearing MP. “I am still waiting for the outcome of a Labour Party process in which I have engaged in good faith over two and a half years regarding my ex-husband,"
    }
]