[
    {
        "url": "https://www.cityam.com/labour-would-host-annual-investment-summit-says-jonathan-reynolds/",
        "title": "Labour would host annual investment summit, says Jonathan Reynolds",
        "description": "Labour leader Sir <b>Keir Starmer</b> told CityA.M. in an interview last year that the City of London was a “force for good” and that improving relations with business was a “matter of personal pride” for him. <b>Starmer</b>, shadow chancellor, Rachel Reeves and ..."
    },
    {
        "url": "https://news.sky.com/story/labours-28bn-green-pledge-still-the-level-of-ambition-says-shadow-business-secretary-13058508",
        "title": "Labour&#39;s £28bn green pledge still the &#39;level of ambition&#39;, says shadow business secretary",
        "description": "However, there are some within Labour who want Sir <b>Keir Starmer</b> to ditch the pledge altogether as a means to stop Tory attacks going into an election that will be heavily dominated by the cost of living crisis. Former shadow chancellor Ed Balls predicted ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-normal-neil-kinnock-2876233?ico=more_from_this_author",
        "title": "Rishi Sunak not normal enough to pull off Major-style victory, says Neil Kinnock",
        "description": "Ex-Labour leader recalls 1992 battle with John Major and says current PM could never carry off his opponent&#39;s famous &#39;megaphone moment&#39;"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-private-school-tax-wealthy-poorer-children-grammars-2875633?ico=related_stories",
        "title": "Labour private school tax will see wealthy push out poorer children at grammars",
        "description": "Private tutoring companies have revealed they are already preparing for a surge in interest in state selective schools from parents who could be priced out of the fee-paying sector as soon as next year if Sir <b>Keir Starmer</b>’s party wins the next general ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/the-threatened-return-of-donald-trump-endangers-the-uk-most-vital-interests",
        "title": "The threatened return of Donald Trump endangers the UK’s most vital interests",
        "description": "British politicians are deluding themselves if they think that the so-called ‘special relationship’ will protect us"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/police-officers-sent-investigate-only-31986861.amp",
        "title": "Police officers sent to investigate only one in five shoplifting offences",
        "description": "Stealing items valued at £200 or more can lead to a maximum sentence of seven years. <b>Keir Starmer</b> has said that if he gets into power he will bring back local patrols with 13,000 extra officers and PCSOs. Labour has pledged that stronger sentences will be ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860622/badenoch-sends-warning-rebel-tory-mps-plotting-oust-sunak",
        "title": "Kemi Badenoch sends chilling warning to rebel Tory MPs plotting to oust Rishi Sunak",
        "description": "I did so because I worked with him the Treasury, I knew he had a handle on the economy.” Ms Badenoch also tore into Labour leader Sir <b>Keir Starmer</b> for stoking “culture wars” and wanting to “smear” British history. “The only people who are ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24079851.uk-politics-entering-dangerous-new-phase/",
        "title": "UK politics is entering a dangerous new phase",
        "description": "This ruling then has consequences for Joe Biden and Rishi Sunak but also for <b>Keir Starmer</b>. If Tony Blair’s New Labour came in on a wave of popular enthusiasm for renewal and was later tarnished by the Iraq War, <b>Starmer</b>’s Neo Labour will arrive on a ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/ian-blackford-insists-nicola-sturgeon-and-humza-yousaf-trusted-by-public-as-labour-surges-to-biggest-lead-over-snp-for-a-decade-4495575",
        "title": "Ian Blackford insists Nicola Sturgeon and Humza Yousaf trusted by public as Labour surges to biggest lead over SNP for a decade",
        "description": "Ian Blackford has insisted Nicola Sturgeon and Humza Yousaf are trusted by the public as a poll found Labour had surged to its biggest lead over the SNP for a decade. Research by Nostat put Labour on 36 per cent, up three points since its last poll in October, with the SNP on 33 per cent, down four points."
    },
    {
        "url": "https://www.newsletter.co.uk/news/crime/police-concern-at-knives-being-imported-into-ni-disguised-as-belt-buckles-4495668",
        "title": "Police concern at knives being imported into NI disguised as belt buckles",
        "description": "Meanwhile, Sir <b>Keir Starmer</b> has said a Labour government would launch a £100 million youth programme aimed at tackling the rise in knife crime. The new plan, an echo of New Labour’s SureStart childcare scheme, would see a nationwide targeted programme ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/labour-downing-street-starmer-brown-blair?ref=mc.news",
        "title": "Thinking small may get Labour into No 10. It could also stop it from staying there",
        "description": "And besides, <b>Keir Starmer</b>’s accelerated timetable suits his marketing as the kind of leader keen on preparedness, prudence, and technocratic efficiency. At which point, an inevitable warning: the content of Labour’s plan for government, in all ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/tory-government-has-failed-the-public-admits-nadine-dorries-367692/",
        "title": "‘Tory government has failed the public’, admits Nadine Dorries",
        "description": "We and the MPs in my party have not helped them.” | Nadine Dorries Dr. Allin-Khan hit back at suggestions that <b>Keir Starmer</b>, the leader of the opposition, is ‘too boring’ to become Prime Minister. She responded by taking a direct swipe at politicians ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/kemi-badenoch-tory-leadership-plotters-not-friends/",
        "title": "Kemi Badenoch: Tory leadership plotters are not my friends",
        "description": "Recent polling results from YouGov found that voters in more than three quarters of parliamentary seats would prefer Sir <b>Keir Starmer</b> as prime minister over Mr Sunak, and his popularity sunk to an all time low last month. However, the Business Secretary ..."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/martin-lewiss-warning-on-broken-westminster-system-should-be-heeded-the-yorkshire-post-says-4495625",
        "title": "Martin Lewis&#39;s warning on broken Westminster system should be heeded: The Yorkshire Post says",
        "description": "It was striking in the focus groups that there were not only generally dim views of both Rishi Sunak and <b>Keir Starmer</b> but also a widespread sense across voters of all persuasions that public services are on their knees and the country is going in the wrong ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13015789/No-trade-deal-Starmer-Labours-shadow-business-secretary-douses-hopes-post-Brexit-agreement-Donald-Trump-President-again.html",
        "title": "No US trade deal under <b>Starmer</b>? Labour&#39;s shadow business secretary douses hopes of post-Brexit agreement even if Donald Trump becomes President again",
        "description": "But, with an expectation that Britain&#39;s general election will be held shortly after the US contest, Mr Reynolds poured cold water on the prospect of an incoming Labour administration under Sir <b>Keir Starmer</b> doing a deal with Mr Trump. The shadow business ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/labours-28bn-green-investment-pledge-remains-level-of-ambition-reynolds-M36DTSOM5JN3REM6GGTAB3JJQQ/",
        "title": "Labour’s £28bn green investment pledge remains ‘level of ambition’ – Reynolds",
        "description": "However, party leader Sir <b>Keir Starmer</b> previously hinted he could scale down the investment given the financial picture he would inherit if he becomes prime minister while the party was forced to deny allegations it had axed the pledge last week."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next general election? The dates Rishi Sunak is considering",
        "description": "Mr Sunak has not, however, ruled out a May election and Sir <b>Keir Starmer</b>’s party is readying itself for the possibility of an early poll to ensure it is not wrong-footed if the Prime Minister gambles on going to the country in the spring. That leaves ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24074640.sick-collateral-damage-lefts-thrust-power/?ref=rss",
        "title": "We are sick of being collateral damage in the Left&#39;s thrust for power",
        "description": "I AM surprised that Neil Mackay (&quot;I don&#39;t think there&#39;s a genuine left-winger in the SNP&quot;, January 21) should believe that Mick Lynch &quot;has become a symbol of hope for the Left&quot;, given Jeremy Corbyn&#39;s treatment by Sir <b>Keir Starmer</b> and the right-wingers in ..."
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/01/28/israel-on-trial/",
        "title": "Israel on Trial",
        "description": "This ruling then has consequences for Joe Biden and Rishi Sunak but also for <b>Keir Starmer</b>. If Tony Blair’s New Labour came in on a wave of popular enthusiasm for renewal and was later tarnished by the Iraq war, <b>Keir Starmer</b>’s Neo Labour will arrive on ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/latin-america-is-at-the-heart-of-the-rise-of-the-global-south-packed-adelante-conference-hears",
        "title": "Latin America is at the heart of the rise of the Global South, a packed Adelante conference hears",
        "description": "Ms Barnard blasted current Labour leader Sir <b>Keir Starmer</b> for his “record of despair.” She said Labour had become “the sibling to US hegemony” and that it needed to remember “it’s supposed to be the voice of working people in Parliament and not ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/politics/why-would-you-want-vote-28526080",
        "title": "&#39;Why would you want to vote for him?&#39;Jeremy Miles asks in race for First Minister",
        "description": "Get the best user experience with WalesOnline’s Premium app on Apple or Android If he won the election Mr Miles said he believed he would have a good relationship with <b>Keir Starmer</b> as First Minister. Asked about Unite&#39;s change of process, Mr Gething told ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-68116535?at_format=link&at_bbc_team=editorial&at_ptr_name=facebook_page&at_campaign=Social_Flow&at_medium=social&at_campaign_type=owned&at_link_type=web_link&at_link_origin=BBC_Politics&at_link_id=20970232-BD11-11EE-B4A1-1B1787A28522",
        "title": "&#39;Nice guy but weak&#39;: Voters on Rishi Sunak and Sir <b>Keir Starmer</b>",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts on the prime minister, Rishi Sunak, and the leader of the opposition, Sir <b>Keir Starmer</b>. They&#39;re all from areas that swung from Labour to Conservative in the ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/short-videos/news/britain-keir-starmer-recovers-from-glitter-attack-at-labour-party-conference/shorttakes/107209733.cms",
        "title": "Britain: <b>Keir Starmer</b> recovers from &#39;glitter attack&#39; at Labour Party conference",
        "description": "<b>Keir Starmer</b> ignored the &#39;glitter attack&#39; attack and moved ahead. During the Labour Party conference in Liverpool, UK, <b>Keir Starmer</b>, the leader of the Labour Party, experienced an unexpected &#39;glitter attack&#39; from an angry protester as he started his address."
    },
    {
        "url": "https://inews.co.uk/news/politics/wealth-tax-labour-public-services-neil-kinnock-2877272?ico=related_article_inline",
        "title": "Wealth tax could be imposed by Labour to boost public services, says Neil Kinnock",
        "description": "However, he added that Sir <b>Keir Starmer</b> was no longer taking these constituencies “for granted” and the repelling effect of Jeremy Corbyn has gone."
    },
    {
        "url": "https://www.gulftoday.ae/opinion/2024/01/28/starmer-is-about-to-make-up-his-mind-about-green-plans",
        "title": "<b>Starmer</b> is about to make up his mind about green plans",
        "description": "Rishi Sunak was sharper at the most recent Prime Minister’s Questions than at the previous two. He fought back against Keir Starmer’s ridicule by mocking the leader of the opposition’s inability to decide whether he was committed to £28bn a year of green investment some day."
    },
    {
        "url": "https://www.irishtimes.com/world/uk/2024/01/28/i-dont-want-a-welsh-army-mark-drakeford-on-his-love-for-devolution-and-republicanism-but-not-independence/",
        "title": "‘I don’t want a Welsh army’: Mark Drakeford on his love for devolution and republicanism, but not independence",
        "description": "“I realised that you had to change the system and politics was the vehicle to do it.” Current UK Labour leader, <b>Keir Starmer</b>, appears on course for Downing Street on a platform much closer to the Blairite political centre. That moves it away from the ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/who-is-nadine-dorries-what-role-parliament-bbc-367689/",
        "title": "Nadine Dorries left red-faced after being told to ‘pipe down’ on BBC show",
        "description": "Dr. Allin-Khan hit back at suggestions that <b>Keir Starmer</b>, the leader of the opposition, is ‘too boring’ to become Prime Minister. She responded by taking a direct swipe at politicians who are more interested in reality TV. She mentioned the show ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-reynolds-keir-starmer-labour-government-sky-news-b1135299.html",
        "title": "Labour’s £28bn green investment pledge remains ‘level of ambition’ – Reynolds",
        "description": "Labour remains committed to invest £28 billion a year in green projects as its “level of ambition”, the shadow business secretary has said. Jonathan Reynolds conceded the investment may not be seen until the latter part of the next parliament and that “circumstances do change”."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/labour-downing-street-starmer-brown-blair",
        "title": "Thinking small may get Labour into No 10. It could also stop it from staying there",
        "description": "Unlike Brown and Blair, who made bold changes as soon as they entered Downing Street, Starmer seems determined to offer as little as possible, says Guardian columnist John Harris"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/martin-lewis-would-rather-wire-nipples-to-electrodes-than-become-pm-after-focus-groups-hail-finance-expert-4495591",
        "title": "Martin Lewis &#39;would rather wire nipples to electrodes&#39; than become PM after focus groups hail finance expert",
        "description": "Each of the groups expressed considerable pessimism about the direction of the country and how public services are operating, with largely negative views given about Rishi Sunak and <b>Keir Starmer</b>. Did you know with a Digital subscription to Yorkshire Post ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24074640.sick-collateral-damage-lefts-thrust-power/",
        "title": "We are sick of being collateral damage in the Left&#39;s thrust for power",
        "description": "I AM surprised that Neil Mackay (&quot;I don&#39;t think there&#39;s a genuine left-winger in the SNP&quot;, January 21) should believe that Mick Lynch &quot;has become a symbol of hope for the Left&quot;, given Jeremy Corbyn&#39;s treatment by Sir <b>Keir Starmer</b> and the right-wingers in ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24079574.poll-labour-surges-ahead-take-biggest-lead-snp/",
        "title": "Poll: Labour surges ahead to take biggest lead over SNP",
        "description": "READ MORE: General Election: The Scots politicians at risk of losing their seats It is Scottish Labour’s strongest poll performance since the day after the independence referendum in 2014 and would hand Sir <b>Keir Starmer</b> a significant boost in his attempt ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-68121804",
        "title": "Watch: Martin Lewis or Carol Vorderman - voters&#39; ideas for PM",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts with Laura Kuenssberg. Hear their suggestions of who should be prime minister are some names you may have heard of but not necessarily for their political backgrounds."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-south-yorkshire-68097394",
        "title": "Rother Valley: Red wall voters look set to perform about-turn",
        "description": "Since its creation in 1918, the parliamentary seat of Rother Valley had always returned a Labour MP, but all that changed when the so-called red wall crumbled in 2019. With another election due later in 2024, the BBC asked voters in the constituency whether time had changed their voting intentions."
    },
    {
        "url": "https://uk.news.yahoo.com/voters-savage-sunak-starmer-during-101607875.html",
        "title": "Voters savage Sunak and <b>Starmer</b> during focus group",
        "description": "Voters didn’t shy away from expressing their opinions on both Rishi Sunak and <b>Keir Starmer</b> in a segment from Sunday with Laura Kuenssberg. Voters of both Labour and Conservative weren’t afraid to be direct and voice their frustration about the state of ..."
    },
    {
        "url": "https://uk.news.yahoo.com/martin-lewis-rather-wire-nipples-101226180.html",
        "title": "Martin Lewis Would Rather &#39;Wire My Nipples To Electrodes&#39; Than Be Prime Minister",
        "description": "While the focus group members pro-actively brought up Lewis’ name, many members were scathing about Sunak and Labour leader <b>Keir Starmer</b>. The prime minister was seen as out of touch by many and labelled an “incompetent cretin”. While <b>Starmer</b> did not ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/28/if-we-win-we-have-to-be-ready-labour-prepares-for-first-100-days-as-tories-slide-into-chaos?ref=upstract.com",
        "title": "‘If we win, we have to be ready’: Labour prepares for first 100 days as Tories slide into chaos",
        "description": "In the week an unruly former Conservative minister was slapped down for suggesting yet another change of leader, the opposition was readying itself for government under Starmer’s rigid control"
    },
    {
        "url": "https://www.thenational.scot/news/24078980.general-election-snps-katy-loudon-runs-rutherglen-defeat/",
        "title": "General Election: SNP&#39;s Katy Loudon runs again after Rutherglen defeat",
        "description": "When Labour’s Michael Shanks won by more than double the number of votes polled by the SNP, it was hailed as a “seismic” night by Sir <b>Keir Starmer</b>’s party. Just three months later, Loudon is preparing to get back into the fray of campaigning ..."
    },
    {
        "url": "https://news.sky.com/story/adam-boulton-are-we-in-for-one-of-the-dirtiest-election-campaigns-ever-13056641",
        "title": "Adam Boulton: Are we in for one of the &#39;dirtiest&#39; election campaigns ever?",
        "description": "Fiery exchanges between Rishi Sunak and Sir Keir Starmer at Prime Minister&#39;s Questions suggest the Conservatives and Labour are preparing to take the gloves off."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/labour-8-billion-deliver-green-060000418.html",
        "title": "Labour Would Need £8 Billion to Deliver Green Plan Within Rules",
        "description": "(Bloomberg) -- The Labour Party needs to find at least £8 billion ($10 billion) to deliver its green-investment plan, a new analysis shows, underscoring why UK opposition leader <b>Keir Starmer</b> may be mulling changes to the initiative. Most Read from ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sue-gray-labours-game-changer-with-a-brief-to-stop-the-splits-d09vrh78r",
        "title": "Stop the splits and spot banana skins: Sue Gray’s missions in Labour",
        "description": "Sir <b>Keir Starmer</b> missed Tuesday’s weekly shadow cabinet meeting because of a briefing with security officials. While the event was chaired by Angela Rayner, the deputy leader, the person whose authority is most acutely felt whenever the leader is absent ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/ed-milliband-keir-starmer-labour-government-david-interview-9xktbwg6w",
        "title": "Ed Miliband: ‘My relationship with David is not precisely what it was’",
        "description": "No 10 used to have a nickname for Ed Miliband. It was the early 2000s and he was a political aide in his early thirties working at the Treasury. “I was the go-between between the two sides — Gordon Brown’s office and Tony Blair’s office,” he says ..."
    },
    {
        "url": "https://www.thecanary.co/uk/2024/01/28/kuenssberg-starmer-changed-his-mind/",
        "title": "Laura Kuenssberg suggest habitual liar <b>Keir Starmer</b> is just someone who ‘changes his mind’",
        "description": "How does a person turn into this? Maybe Reynolds has an awareness of all the freebies that <b>Keir Starmer</b> has accepted from wealthy interests – more than every Labour leader since 1997 combined according to openDemocracy – and he knows he’s on the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/scottish-labour-takes-biggest-lead-31985786",
        "title": "Scottish Labour takes biggest lead over SNP in a decade according to poll results",
        "description": "Yousaf had a net trust score of minus 25, while Sturgeon was on minus 19. Sarwar was on minus 17 while UK Labour leader <b>Keir Starmer</b> was on minus 24. In 2019, Labour only took one of the 59 Scottish seats, with the SNP winning 48. The number of Scottish ..."
    },
    {
        "url": "https://londonlovesbusiness.com/labour-takes-42-of-vote-share-vs-27-for-the-conservatives/",
        "title": "Labour takes 42% of vote share vs 27% for the Conservatives",
        "description": "@2023 - All Right Reserved."
    },
    {
        "url": "https://www.thesun.co.uk/news/25549301/reform-party-job-lee-anderson/",
        "title": "I was offered a £400,000 Reform Party job but I’ve turned it down to stick with Rishi Sunak, says Lee Anderson",
        "description": "LEE ANDERSON has told warring Tories to “stick with Rishi” – as he talks publicly for the first time about being offered a £400,000 package to defect to Reform UK. The Tory big beast caused a"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13014503/This-straw-Hilarious-memes-Keir-Starmer-alienated-Lancashire-pledging-introduce-zero-tolerance-zones-hotpot-areas.html",
        "title": "&#39;This is the last straw&#39;: Hilarious memes show how <b>Keir Starmer</b> has &#39;alienated the whole of Lancashire&#39; after pledging to introduce &#39;zero-tolerance zones in hotpot areas&#39;",
        "description": "Sir <b>Keir Starmer</b> has stoked the fury of Lancastrians after he tweeted there would be zero-tolerance in &#39;hotpot areas&#39;. The comedy typo was made during a pledge on X, formerly Twitter, to create 13,000 extra police officers and PCSOs. It meant the Labour ..."
    },
    {
        "url": "https://www.thesun.ie/news/12078129/labour-teaching-white-privilege/",
        "title": "Labour’s idea to teach ‘divisive white privilege’ in UK schools could spark bitter conflict in classrooms like in the US",
        "description": "Are there things we regret?’ ” In response, Rishi Sunak decided to ramp up the culture war attacks on Labour leader Sir <b>Keir Starmer</b> and told Parliament: “He talks about . . . what Britain values. This from a man who takes the knee ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25547070/tony-parsons-justice-system-valdo-calocane/",
        "title": "Our justice system has apparently decriminalised murder for Nottingham killer Valdo Calocane",
        "description": "Possibly not. The Tories are on course for a historic kicking because they are losing support on two sides – to <b>Keir Starmer</b>’s Labour on the left and Reform UK on the right. Vote Labour – get Labour. Vote Reform – get Labour too. But that double ..."
    },
    {
        "url": "https://www.itv.com/thismorning/articles/mollie-reveals-status-of-friendship-with-harry-after-tense-traitors-finale",
        "title": "Mollie reveals status of friendship with Harry after tense Traitors finale",
        "description": "The Traitors finalist Mollie Pearce has said she was “hurt in the moment” when her close friend Harry Clark stole the whole £95,150 prize pot by deceiving her."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860508/prime-minister-rishi-sunak-over-50s-voters-winning-election",
        "title": "Prime Minister Rishi Sunak pledges support for ‘crucial’ over-50s voters",
        "description": "The Prime Minister told the Express he wants to unlock new job opportunities, boost healthcare, help with personal finances and put &quot;money back into people&#39;s pockets&quot;."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/business-support-shift-labour-keir-starmer-over-rish-sunak/",
        "title": "Labour gains business support as half of leaders prefer <b>Starmer</b>-led Government",
        "description": "Opinium poll unveils shift in business sentiment, with a quarter of Tory-supporting business leaders favouring Labour under Sir Keir Starmer"
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24078541.israel-must-comply-profoundly-serious-icj-ruling-full-lammy-says/",
        "title": "Israel must comply with ‘profoundly serious’ ICJ ruling in full, Lammy says",
        "description": "Labour has hardened its tone towards the Israeli PM in recent weeks, with leader Sir <b>Keir Starmer</b> describing Mr Netanyahu’s opposition to the establishment of a Palestinian state when the war ends as “unacceptable”. Foreign Secretary Lord David ..."
    },
    {
        "url": "https://www.yahoo.com/news/comic-plotters-against-rishi-sunak-190000526.html",
        "title": "The comic plotters against Rishi Sunak are tragically right about the evils facing Britain",
        "description": "This was weaponised, not very successfully, to encourage revolt against the Rwanda Bill. If faced with a choice between Rishi Sunak and Sir <b>Keir Starmer</b>, many would prefer a better leader than either, YouGov unsensationally found. The article, containing ..."
    },
    {
        "url": "https://www.yahoo.com/news/keir-starmer-labour-complicit-woke-173559406.html",
        "title": "<b>Keir Starmer</b>’s Labour is complicit in the woke takeover of Britain’s institutions",
        "description": "I can’t recall a Leader of the Opposition who makes such vacuous speeches, devoid of policy or a plan, as Sir <b>Keir Starmer</b>. He was at it again this week when he took to the stage to give us his views on the culture wars. “All in life is art and ..."
    },
    {
        "url": "https://bylinetimes.com/2024/01/24/rishi-sunak-stumbles-as-he-takes-the-knee-to-the-culture-warriors/?mc_cid=98900f637e&mc_eid=ec867bae15",
        "title": "Rishi Sunak Stumbles as he Takes the Knee to the Culture Warriors",
        "description": "There was a curious moment at today’s Prime Minister’s Questions when Rishi Sunak appeared to suggest that <b>Keir Starmer</b>’s decision to publicly show solidarity with black victims of racism was somehow unBritish. “He [<b>Starmer</b>] talks about what ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/veteran-labour-mp-tony-lloyd-31859993?int_source=nba",
        "title": "Labour MP Tony Lloyd has &#39;untreatable&#39; leukaemia and will &#39;spend time left with family&#39;",
        "description": "The 73-year-old MP also said his office will remain open &quot;to support my constituents&quot;. Sir <b>Keir Starmer</b> paid tribute to Sir Tony, who he said was &quot;admired and respected&quot; across the party. The Labour leader said: &quot;I am deeply saddened by the update today ..."
    }
]