[
    {
        "url": "https://www.bbc.com/news/uk-wales-68338278",
        "title": "General election: Cost of living help among voters&#39; pleas",
        "description": "With a general election looming, voters in a key Welsh battleground have highlighted the cost of living as one of the key issues. Tara Mellor from Geek&#39;s Barbers says she is &quot;working extra hours, trying to cut back, doing meal plans, turning the heating down, but it doesn&#39;t seem to be making much of an impact&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13102073/open-door-illegal-migration-flights.html",
        "title": "DAILY MAIL COMMENT: Another open door to illegal migration",
        "description": "While all eyes are on asylum seekers crossing the Channel, thousands more migrants may be entering Britain because of criminally lax security at some airports."
    },
    {
        "url": "https://www.thesun.co.uk/news/26048657/jeremy-hunt-fuel-duty-budget/",
        "title": "Jeremy Hunt would be crazy not to extend 5p fuel duty cut in next month’s Budget",
        "description": "Folly on fuel JEREMY Hunt would be crazy not to extend the 5p fuel duty cut in next month’s Budget. Treasury wonks doubtless believe the Chancellor has been “generous” long enough — that drivers"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/help-labour-succeed-ex-tory-minister-nick-boles/",
        "title": "I’ll do all I can to help Labour succeed, says ex-Tory minister",
        "description": "Nick Boles, who quit Conservatives over ‘refusal to compromise’ on Brexit, is helping Sir Keir Starmer’s party prepare for government"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868481/Labour-uturn-citizens-assembly-Sue-Gray",
        "title": "Flip-flopping Labour commits humiliating policy U-turn in just 12 hours",
        "description": "Chief of Staff Sue Gray revealed Labour&#39;s latest policy to undermine Parliament in favour of ‘citizens assemblies&#39;."
    },
    {
        "url": "https://www.thetimes.co.uk/article/give-us-more-referendums-not-citizens-assemblies-8q0p5nc8z",
        "title": "Give us more referendums, not citizens’ assemblies",
        "description": "Sue Gray, Keir Starmer’s chief of staff, is much taken with the idea of citizens’ assemblies as a way of unpicking constitutional and political knots. She sees their use in Ireland, where they paved"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/former-minister-tobias-ellwood-calls-for-new-legislation-to-stop-protesters-visiting-mps-houses/",
        "title": "Former minister Tobias Ellwood calls for new legislation to stop protesters visiting MPs&#39; houses",
        "description": "An MP has called for new legislation to stop protesters visiting MPs&#39; houses following reports that Just Stop Oil plans to occupy politicians&#39; homes ahead of the next general election."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/michael-shanks-believes-gaza-ceasefire-32160852",
        "title": "Michael Shanks believes Gaza ceasefire ‘is an essential next step’ as Scottish Labour motion passes",
        "description": "This comes after the Scottish Labour Party&#39;s conference passed a motion calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.thenational.scot/politics/24129455.seeing-low-petty-blows-westminster/",
        "title": "We are seeing some very low and petty blows from Westminster",
        "description": "The most notable thing to come out of the weekend was Anas Sarwar telling an interviewer, in essence, that the people of Scotland should vote Labour in order to protect Scotland from <b>Keir Starmer</b>. Sarwar vowed that he&#39;d stand up to <b>Starmer</b> on issues on ..."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-weakness-exposed-again-2913720?ico=more_from_this_author",
        "title": "<b>Keir Starmer</b>’s weakness could soon be exposed again",
        "description": "Several shadow ministers have been heard using the formulation that Labour would “ban ‘exploitative’ zero-hours contracts”, which suggests that “non-exploitative’” zero-hours contracts will continue, despite the fact that many workers and trade unions see them as inherently exploitative."
    },
    {
        "url": "https://news.sky.com/story/donald-trump-breaks-silence-on-alexei-navalnys-death-but-makes-no-mention-of-vladimir-putin-13075720",
        "title": "Donald Trump breaks silence on Alexei Navalny&#39;s death - but makes no mention of Vladimir Putin",
        "description": "Several world leaders, including US President Joe Biden, have directly blamed the Russian government for the death of the prominent Kremlin critic."
    },
    {
        "url": "https://www.thenational.scot/news/24130064.tories-move-forward-ban-overseas-care-workers-bringing-family-uk/",
        "title": "Tories move forward with ban on overseas care workers bringing family to the UK",
        "description": "TORY plans to ban overseas care workers from bringing family members to the UK have been described as “populist idiocy”."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68337764",
        "title": "Post Office &#39;secrecy must end&#39; says Labour",
        "description": "Faith in the government over a series of scandals is “hanging by a thread”, the shadow business secretary says."
    },
    {
        "url": "https://www.middleeasteye.net/news/war-gaza-israel-has-gone-too-far-wes-streeting-says",
        "title": "War on Gaza: &#39;Israel has gone too far&#39; in self-defence, says Wes Streeting",
        "description": "Streeting’s comments came after Labour leader <b>Keir Starmer</b> called for a “ceasefire that lasts” at the Scottish Labour conference in Glasgow on Sunday, in an abrupt U-turn on the party&#39;s stance on the issue. The party leader has repeatedly refused to ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/19/keir-starmer-risks-biggest-rebellion-of-his-leadership-over-gaza-vote-mps-warn",
        "title": "<b>Keir Starmer</b> risks biggest rebellion of his leadership over Gaza vote, MPs warn",
        "description": "Labour backbenchers urge party not to whip them against SNP’s motion calling for immediate ceasefire"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24129262.starmer-urges-focus-discipline-welcomes-new-labour-mps-parliament/",
        "title": "<b>Starmer</b> urges focus and discipline as he welcomes new Labour MPs to Parliament",
        "description": "Gen Kitchen and Damien Egan were sworn in as MPs on Monday after winning the Wellingborough and Kingswood by-elections."
    },
    {
        "url": "https://morningstaronline.co.uk/article/yousaf-join-big-oil-slam-labour-windfall-tax-plans",
        "title": "Yousaf joins big oil to slam Scottish Labour&#39;s windfall tax plans",
        "description": "FIRST MINISTER Humza Yousaf branded Labour a “wolf in a red rosette” today as he took the side of oil and gas executives in slamming the party’s tax plans."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-under-growing-pressure-131107087.html",
        "title": "<b>Keir Starmer</b> under growing pressure to back immediate Gaza ceasefire as Momentum launches campaign",
        "description": "Exclusive: The left-wing campaigning group is preparing for a ‘lobbying blitz’ to put pressure on MPs to back the SNP’s call for an immediate ceasefire in Gaza"
    },
    {
        "url": "https://inews.co.uk/news/politics/triple-lock-pension-labour-manifesto-commitment-2914271?ico=related_article_inline",
        "title": "Triple lock pension set to be Labour manifesto commitment",
        "description": "Labour will commit to the future of the triple lock on the state pension in its general election manifesto, i understands. The party is set to confirm that if it is elected, it will continue to increase the state pension each year by the same level as inflation, average earnings growth or 2.5 per cent – whichever is highest."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24129659.keir-starmers-glasgow-speech-said-labour-policy/",
        "title": "<b>Keir Starmer</b>&#39;s Glasgow speech said more about Labour policy",
        "description": "Sir Keir Starmer, in his speech on Sunday in Glasgow, acknowledged that positive polling is not enough to rely on. He acknowledged that - however unlikely - the possibility of a Conservative win at the next General Glection cannot and should not be ruled out."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/labour-backtracks-sue-gray-citizen-assembly-whitehall-keir/",
        "title": "Labour backtracks over Sue Gray’s announcement on citizen assemblies that will bypass Whitehall",
        "description": "Labour has backtracked on plans to create dozens of citizens’ assemblies to deliberate on new laws following a backlash against the “stupid idea”. Sue Gray, the party’s chief of staff, had said in an interview that she would introduce the measure as part of efforts to devolve power from Whitehall."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7256297",
        "title": "Politics live: Army applications soar after warnings of possible war conscription",
        "description": "Labour leader Sir <b>Keir Starmer</b> has welcomed the party&#39;s newest MPs to parliament this afternoon (see 14.30 post). He said Gen Kitchen&#39;s victory in Wellingborough and Damien Egan&#39;s in Kingswood last Thursday &quot;was a message being sent&quot; by voters that they ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/labour-councillor-cleared-party-after-28660520",
        "title": "Labour councillor cleared by party after anti-Semitic cartoon was posted on his social media",
        "description": "The Labour Party investigated the claim and lifted Coun Rabnawaz Akbar&#39;s suspension after evidence he was hacked"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26040449/trigger-warnings-dont-belong-in-british-books/",
        "title": "Trigger warnings don’t belong in British books and theatres, Culture Sec says",
        "description": "TRIGGER warnings on the works of Shakespeare are a Bard idea and fiction should not be “whitewashed”, the Culture Secretary warned today. Snowflake campaigners have called for the"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/former-snp-official-backed-humza-32162077",
        "title": "Former SNP official backed by Humza Yousaf quits party to join Labour",
        "description": "She introduced UK Labour leader <b>Keir Starmer</b> before his speech at the Scottish party conference on Sunday. Donnelly and Thomson have reportedly been spoken about as potential future MSPs. The SNP told the Times: &quot;[We are] the only party with a positive ..."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24128055.israels-actions-gaza-gone-beyond-reasonable-self-defence----streeting/",
        "title": "Israel’s actions in Gaza have gone ‘beyond reasonable self-defence’ — Streeting",
        "description": "The SNP’s Westminster chief Stephen Flynn has said he has offered to meet Labour leader Sir <b>Keir Starmer</b> on Monday to discuss the vote, which is scheduled to take place on Wednesday. The motion comes in the wake of a row over the Rochdale by-election ..."
    },
    {
        "url": "https://uk.news.yahoo.com/origins-keir-starmers-tell-biography-133004461.html",
        "title": "The origins of <b>Keir Starmer</b>&#39;s new tell-all biography",
        "description": "The Biography by journalist Tom Baldwin is out on February 29 and extracts have appeared over the weekend. It will be a must-read for politicos, with new details of Starmer’s life, including his tough relationship with his father and his mother’s illness."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-by-tom-baldwin-review-this-biography-should-be-called-nightmares-from-my-father-087q7xpp3",
        "title": "<b>Keir Starmer</b> by Tom Baldwin review — this biography should be called Nightmares From My Father",
        "description": "The making of ‘Superboy’: the great revelation of this biography is just how traumatic a childhood the Labour leader suffered"
    },
    {
        "url": "https://www.counterfire.org/article/if-theres-one-thing-labour-needs-it-is-to-be-pushed-around-by-protesters-weekly-briefing/",
        "title": "If there’s one thing Labour needs it is to be ‘pushed around by protesters’ – weekly briefing",
        "description": "<b>Keir Starmer</b> came very close to doing so at the Scottish Labour Party conference, where he was under real pressure from his own supporters because they are fearful of electoral losses to the SNP. Wes Streeting has now said publicly that Israel has gone ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-israel-wes-streeting-gaza-snp-b1139987.html",
        "title": "Israel’s actions in Gaza have gone ‘beyond reasonable self-defence’ — Streeting",
        "description": "The shadow health secretary confirmed Labour is ‘considering’ its options on whether to back an SNP-led vote this week on an immediate ceasefire."
    },
    {
        "url": "https://morningstaronline.co.uk/article/vote-end-genocide-campaigners-tell-mps-ahead-wednesdays-vote",
        "title": "‘Vote to end this genocide,’ campaigners tell MPs ahead of Wednesday&#39;s vote",
        "description": "Labour&#39;s Wes Streeting finally admits that Israel’s actions in Gaza have gone ‘beyond reasonable self-defence’"
    },
    {
        "url": "https://www.scotsman.com/news/politics/israel-gaza-snps-stephen-flynn-deeply-confused-over-anas-sarwar-labour-whip-claim-around-ceasefire-vote-4524553",
        "title": "Israel-Gaza: SNP&#39;s Stephen Flynn &#39;deeply confused&#39; over Anas Sarwar Labour whip claim around ceasefire vote",
        "description": "SNP Westminster leader Stephen Flynn has said he is “deeply confused” as to why Anas Sarwar claimed Labour whips had been in contact with his party about its Gaza motion."
    },
    {
        "url": "https://www.thenational.scot/politics/24129165.will-keir-starmer-run-questions-prime-minister/",
        "title": "Will <b>Keir Starmer</b> run from questions as prime minister too?",
        "description": "WHAT did we learn from the Labour Party in Scotland’s Spring Conference? Anas Sarwar appears to have lied to Martin Geissler on the BBC’s"
    },
    {
        "url": "https://www.irishnews.com/news/uk/starmer-urges-focus-and-discipline-as-he-welcomes-new-labour-mps-to-parliament-HO6UWYRXAZPUDPS6SFYBCOWRTQ/",
        "title": "<b>Starmer</b> urges focus and discipline as he welcomes new Labour MPs to Parliament",
        "description": "Sir <b>Keir Starmer</b> joked that Labour would need “a bigger hall” as he welcomed his party’s two newest MPs to Parliament on Monday. The Labour leader praised Gen Kitchen and Damien Egan for their victories in Wellingborough and Kingswood last week ..."
    },
    {
        "url": "https://www.snp.org/first-minister-humza-yousafs-speech-on-the-energy-sector-in-aberdeen/",
        "title": "First Minister Humza Yousaf’s speech on the energy sector in Aberdeen",
        "description": "The weak and indecisive <b>Keir Starmer</b> finally pressured into ditching his pledge. While they were still supporting the policy – Labour claimed it would create 50,000 jobs in Scotland alone. Something they were willing to throw away without a second ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/triple-lock-pension-labour-manifesto-commitment-2914271?ico=more_from_this_author",
        "title": "Triple-lock pension set to be Labour manifesto commitment",
        "description": "Keir Starmer is planning to keep the policy if he becomes PM, amid fears over pensioner poverty in housing crisis"
    },
    {
        "url": "https://news.sky.com/story/former-minister-tobias-ellwood-calls-for-new-legislation-to-stop-protesters-visiting-mps-houses-13075718",
        "title": "Former minister Tobias Ellwood calls for new legislation to stop protesters visiting MPs&#39; houses",
        "description": "Tobias Ellwood has called for new laws amid suggestions from Just Stop Oil that it plans to target MPs&#39; houses in the run-up to the next election."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/starmer-should-wary-final-furlong-32163502",
        "title": "&#39;<b>Starmer</b> should be wary of a final furlong fall - Labour needs to get its act together&#39;",
        "description": "Darren Lewis says the Labour Party appears convinced it needs only to turn up to win a general election – because it’s not the Tories"
    }
]