[
    {
        "url": "https://www.dailymail.co.uk/columnists/article-12895371/JAN-MOIR-tours-best-Peter-Pan-pantos-delighted-report-Julian-Clarys-cheeky-smut-Jennifer-Saunderss-saucy-innuendo-theres-one-area-British-life-PC-killjoys-havent-cancelled.html",
        "title": "JAN MOIR tours the best Peter Pan pantos and is delighted to report that, from Julian Clary&#39;s cheeky smut to Jennifer Saunders&#39;s saucy innuendo, there&#39;s one area of British ...",
        "description": "The Palladium had only one, and even then it was neutral. &#39;Where does it leave us if Rishi Sunak and <b>Keir Starmer</b> are marooned on a desert island? Better off,&#39; grumbled one character. Elsewhere there were a few jibes at Prime Minister Sunak, some laughs at ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/4df3b3eb-27c5-4f22-95f0-36f1d505c877?shareToken=91ff394f86a06c268c06e47289f26deb",
        "title": "This was the year women fought back and won",
        "description": "Once again, grassroots women organised — despite efforts by LGBT Labour to silence, even expel them — while MPs like Tonia Antoniazzi, Shabana Mahmood and Diana Johnson told Sir <b>Keir Starmer</b> that unless Labour dropped self-ID, every election ..."
    },
    {
        "url": "https://www.ft.com/content/bcf1f1f5-a38f-4078-98f8-ab1ff7378895",
        "title": "Tony Blair think-tank revenues hit $140mn as governments pay for advice",
        "description": "Former UK prime minister’s institute set to expand to over 40 states as growth continues despite criticism of Saudi work"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/un-vote-gaza-israel-ceasefire-hamas-david-cameron-uk-b1128793.html",
        "title": "Lord Cameron says watered-down UN vote on Gaza signals &#39;greater unity&#39; over response",
        "description": "Lord David Cameron has said there is “greater unity” over the response to the crisis in Gaza after the UN Security Council adopted a watered-down resolution calling for the immediate acceleration of aid deliveries to civilians."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-baroness-mone-ppe-labour-government-pandemic-transparency-12593360?postid=6959916",
        "title": "Politics latest: Rishi Sunak questioned about family visa changes after Home Office climbdown",
        "description": "Nandy fails to deny reports <b>Starmer</b> considering scaling back £28bn a year green energy pledge There are reports this evening that Sir <b>Keir Starmer</b> is potentially looking at scaling back his pledge that a Labour government would invest up to £28bn a year ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/voters-have-mixed-loyalties-after-peter-bone-downfall-btj536q5m?ilc=timesradio:morefromthetimes",
        "title": "Voters have mixed loyalties after Peter Bone downfall",
        "description": "Residents in the Wellingborough and Rushden seat are not automatically supporting Labour, as Reform UK looks to split the vote"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12893355/Keir-Starmer-Churchill-Truss-military-fatigues-photoshoot-Estonia.html",
        "title": "&#39;He looks like Gareth from The Office&#39;: <b>Keir Starmer</b> dons military fatigues for troop visit photoshoot as he follows in the footsteps of Rishi Sunak and Boris Johnson",
        "description": "Keir Starmer was pictured in camouflage gear posing alongside British troops as he made a pre-Christmas visit to Estonia yesterday."
    },
    {
        "url": "https://www.thenational.scot/news/24007873.keir-starmer-mocked-embarrassing-christmas-card-detail/",
        "title": "<b>Keir Starmer</b> mocked for embarrassing Christmas card detail",
        "description": "<b>KEIR Starmer</b> seems to have struggled to get much right these past few months. From heaping praise on Margaret Thatcher to U-turning on who knows how many pledges, it now seems even a normal Christmas card is a step too far for him. The Labour leader has ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24005996.keir-starmer-victoria-beckham-class-common/",
        "title": "<b>Keir Starmer</b> and Victoria Beckham have class in common",
        "description": "Keir Starmer is the son of a toolmaker. You will likely already know this because he’s told us. He’s told us time and again."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-mocked-social-media-121021514.html",
        "title": "<b>Keir Starmer</b> mocked as social media users point out bizarre Christmas card detail",
        "description": "KEIR Starmer seems to have struggled to get much right these past few months. From heaping praise on Margaret Thatcher to U-turning on who knows how many pledges, it now seems even a normal Christmas card is a step too far for him."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-record-060000433.html",
        "title": "<b>Keir Starmer</b>’s record",
        "description": "Sir Keir Starmer makes much of his time as director of public prosecutions (DPP), a post he is proud to have occupied before he entered Parliament. But before that elevated role, he was known more as a defence lawyer,"
    },
    {
        "url": "https://www.churchtimes.co.uk/articles/2023/22-december/news/uk/starmer-praises-work-of-churches",
        "title": "<b>Keir Starmer</b> praises work of churches",
        "description": "At the reception, the Labour leader, Sir Keir Starmer, praised churches around the country for their social work both in the UK and abroad, saying that the Church was “good news for young and old, both far and near”."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-military-photo-estonia-b2468597.html",
        "title": "<b>Keir Starmer</b> channels Thatcher with military photo op",
        "description": "<b>Keir Starmer</b> wants to follow Margaret Thatcher’s footsteps into No 10, but for now the Labour leader is echoing her symbolic gestures on the battlefield. Sir <b>Keir</b> donned some striking combat fatigues on a visit to troops stationed in Estonia – the ..."
    },
    {
        "url": "https://www.independent.co.uk/sport/football/european-super-league-juventus-premier-league-prime-minister-aleksander-ceferin-b2468471.html",
        "title": "Ange Postecoglou: European Super League constructed by people detached from game",
        "description": "Labour leader Sir <b>Keir Starmer</b> has also vowed he will “make sure the European Super League doesn’t happen” if he becomes Prime Minister, but Postecoglou believes the plans are a non-starter if fans are not on board. “The response it got the first ..."
    },
    {
        "url": "https://news.sky.com/story/amp/sir-keir-starmer-strongly-in-favour-of-two-state-solution-after-calls-for-him-to-snub-israeli-ambassador-13035550",
        "title": "Sir <b>Keir Starmer</b> &#39;strongly in favour&#39; of two-state solution after calls for him to snub Israeli ambassador",
        "description": "Image: Labour leader Sir <b>Keir Starmer</b> has been visiting British troops at the Tapa Nato base in Estonia Sir <b>Keir Starmer</b> has insisted he is &quot;strongly in favour&quot; of a two-state solution after calls from the Labour Muslim Network to cut ties with Israel&#39;s UK ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/michelle-mone-should-be-kicked-out-of-the-house-of-lords-for-good-says-keir-starmer_uk_658042a5e4b0e142c0be99f4?d_id=7105147&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Michelle Mone Should Be Kicked Out Of The House Of Lords, Says <b>Keir Starmer</b>",
        "description": "Speaking today, <b>Starmer</b> said: “I think this is a shocking disgrace from top to bottom and as every day goes past there are more questions that need to be answered. “There are now suggestions that there was early private contact with members of the ..."
    },
    {
        "url": "https://www.nme.com/news/music/big-special-share-cover-of-infinitely-relevant-stop-the-cavalry-to-raise-money-for-gaza-children-3562917",
        "title": "Big Special share cover of “infinitely relevant” ‘Stop The Cavalry’ to raise money for Gaza children",
        "description": "Big Special have shared a cover of Jona Lewie’s Christmas Classic &#39;Stop The Cavalry&#39; as a way to raise money for the children in Gaza."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/22/bishop-says-sinister-euthanasia-lobby-deadly-agenda/",
        "title": "Bishop says ‘sinister euthanasia lobby’ is pushing ‘deadly agenda’",
        "description": "A bishop is set to accuse the “sinister euthanasia lobby” of pushing “a deadly agenda”. In his Christmas homily, the Rt Rev Mark Davies, the Bishop of Shrewsbury, will warn against distorting Christian values of mercy to push for changes in the law regarding assisted suicide and euthanasia."
    },
    {
        "url": "https://morningstaronline.co.uk/article/f/hope-palestine-hope-left",
        "title": "Hope for Palestine is hope for the left",
        "description": "The British left can be proud that it never abandoned Palestine to be more acceptable to the Establishment — today it is Palestine and the huge rebellion it has inspired that is breathing life into our movement,"
    },
    {
        "url": "https://morningstaronline.co.uk/article/f/christmas-cancelled-now-its-time-action-time-sanctions",
        "title": "Christmas is cancelled: Now it’s time for action, time for sanctions",
        "description": "HUGH LANNING on why our new year task and resolution must be to turn the massive public support and sympathy for Palestine into a veritable political tsunami to shift Western politics"
    },
    {
        "url": "https://www.express.co.uk/comment/columnists/carole-malone/1848429/esther-rantzen-assisted-dying-debate",
        "title": "Let&#39;s get behind Esther and the millions who deserve a better death, says Carole Malone",
        "description": "<b>Keir Starmer</b> says she has his support, as have other MPs. And some in the Church are already softening their stance. Esther herself says that in the days since she talked about signing up for Dignitas, she’s heard tales of intolerable suffering and her ..."
    },
    {
        "url": "https://www.asianimage.co.uk/news/24008955.want-move-gaza-massacres---wont/",
        "title": "They want you to move on from the Gaza massacres - Why we won&#39;t",
        "description": "As the massacre of Gaza continues, I look on with dismay, sympathy and boiling anger on behalf of the valiant Palestinian people. The sheer"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/22/keir-starmer-considers-scaling-back-labour-28bn-pounds-green-plans",
        "title": "<b>Keir Starmer</b> considers scaling back Labour’s £28bn green plans",
        "description": "Insiders fear further watering down of party’s flagship economic policy could leave leader open to charges of ‘flip-flopping’ by Tories"
    },
    {
        "url": "https://www.snp.org/only-the-snp-can-get-the-tories-out-in-scotland/",
        "title": "Only the SNP can get the Tories out of Scotland",
        "description": "Of the six seats the Tories do hold in Scotland the SNP was in second place in all of them with Labour no-where near winning. Only a vote for the SNP can beat the Tories in those seats. Votes switching from Labour to the SNP would help the Tories hang on to those seats."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-calm-down-its-christmas/",
        "title": "London Playbook PM: Calm down … it’s Christmas",
        "description": "So it seems … it’s a political trap for <b>Keir Starmer</b>, who will now be asked whether the plan will be reversed under Labour. “The principle here is absolutely right,” Sunak said. “If people are bringing dependents into this country they must be ab ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12894309/Keir-Starmer-Lords-peers-retire-abolishing-House-Labour.html",
        "title": "Now &#39;Sir U-Turn&#39; <b>Keir Starmer</b> might only make peers retire at age 80 instead of abolishing the House of Lords in his first term",
        "description": "Mandatory retirement for octogenarian peers could be on the cards should Labour win the next general election."
    },
    {
        "url": "https://www.football365.com/news/spurs-boss-postecoglou-super-league-created-people-detached-football-all-about",
        "title": "Spurs boss Postecoglou: Super League created by people ‘detached’ from what football ‘is all about’",
        "description": "Tottenham boss Ange Postecoglou reckons ideas like the European Super League come from individuals who are “detached from what this game is all about”."
    },
    {
        "url": "https://www.theguardian.com/society/2023/dec/22/when-life-becomes-intolerable-i-want-out-britons-views-on-assisted-dying?ref=upstract.com",
        "title": "‘When life becomes intolerable, I want out’: Britons’ views on assisted dying",
        "description": "In England, Wales and Northern Ireland you can face prison for helping someone end their life. Some want the law to change"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/analysis-a-fatigued-tory-party-must-be-able-to-stomach-a-brutal-election-campaign-in-2024-4456653",
        "title": "Analysis: A fatigued Tory party must be able to stomach a brutal election campaign in 2024",
        "description": "All elections are tests of how the two main parties are viewed in the mind of the electorate, but next year’s general election will be a far more existential exercise for Rishi Sunak’s Conservatives."
    },
    {
        "url": "https://inews.co.uk/opinion/michael-goves-impossible-housing-dilemma-2821522?ico=best_of_opinion",
        "title": "Michael Gove’s impossible housing dilemma",
        "description": "He must navigate the contradictory politics of a party that is notionally pro-free markets, but prevents the free building of housing in its backyard"
    },
    {
        "url": "https://www.christian.org.uk/news/mp-celebrates-growing-support-for-assisted-suicide-among-colleagues/",
        "title": "MP celebrates ‘growing support’ for assisted suicide among colleagues",
        "description": "An MP and campaigner for assisted suicide believes support for assisted suicide is growing among his parliamentary colleagues, and that those in favour are “getting towards a majority”."
    },
    {
        "url": "https://www.heraldscotland.com/politics/19904259.boris-johnsons-future-predicted-polling-guru-john-curtice/?ref=habersitesi.org",
        "title": "Boris Johnson&#39;s future predicted by polling guru John Curtice",
        "description": "The beleaguered leader was left wounded by the partygate saga – with the police investigation still hanging over his head – and his refusal to apologise for a slur made against Sir <b>Keir Starmer</b> over the failure to prosecute Jimmy Savile. Some 15 Tory ..."
    }
]