[
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-67719251?at_medium=RSS&at_campaign=KARANGA",
        "title": "Glenys Kinnock funeral: Big Labour names pay tribute",
        "description": "Major Labour Party figures from across the decades have gathered for the funeral of Glenys Kinnock. Her husband, ex-party leader Neil, current leader Sir Keir Starmer and ex-prime ministers Sir Tony Blair and Gordon Brown were among those there."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/14/the-guardian-view-on-mark-drakeford-devolutions-frustrated-fan",
        "title": "The Guardian view on Mark Drakeford: devolution’s frustrated fan",
        "description": "His Labour successor, who is expected to be chosen by March, will be hoping to work alongside a <b>Keir Starmer</b>-led Labour administration instead. The timing of Mr Drakeford’s announcement confirms that Labour wants the Welsh succession sorted before the ..."
    },
    {
        "url": "https://inews.co.uk/opinion/rottweiler-kemi-badenoch-can-be-the-next-tory-leader-if-she-doesnt-bite-her-own-2809951",
        "title": "Kemi Badenoch can be the next Tory leader – but she is her own worst enemy",
        "description": "The Business and Trade Secretary’s ruthless attack on a Labour MP endears her to some colleagues, but worries others"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/labour-figures-gather-for-funeral-of-friend-and-feminist-glenys-kinnock-95554/",
        "title": "Labour figures gather for funeral of ‘friend and feminist’ Glenys Kinnock",
        "description": "Baroness Glenys Kinnock was hailed as a friend, feminist and major political figure as Labour leaders and party members gathered in north London for her funeral."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tony-blair-gordon-brown-keir-starmer-labour-neil-kinnock-b1127091.html",
        "title": "Labour figures gather for funeral of ‘friend and feminist’ Glenys Kinnock",
        "description": "Baroness Glenys Kinnock was hailed as a friend, feminist and major political figure as Labour leaders and party members gathered in north London for her funeral."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-tony-blair-join-31676421",
        "title": "<b>Keir Starmer</b> and Tony Blair join mourners at Labour &#39;matriarch&#39; Glenys Kinnock&#39;s funeral",
        "description": "Figures from across Labour&#39;s past and present, including Gordon Brown, Alastair Campbell, Lord Mandelson and Ed Balls, all attended the service in north London"
    },
    {
        "url": "https://www.gg2.net/foreign-policy-matters-to-labours-muslim-voters/",
        "title": "Foreign policy matters to Labour’s Muslim voters",
        "description": "POLITICAL analysts said the impact on Muslim voters of Labour party leader Sir Keir Starmer’s stance on the Israel-Palestine conflict will only become clear"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/tony-blair-gordon-brown-neil-kinnock-keir-starmer-stephen-kinnock-b1127033.html",
        "title": "Labour figures gather for funeral of Glenys Kinnock",
        "description": "Labour figures from across the decades, including former prime ministers Sir Tony Blair and Gordon Brown, have gathered in north London for the funeral of Baroness Glenys Kinnock. Her husband and former Labour leader Neil Kinnock arrived for the service in Golders Green with son and MP Stephen and daughter Rachel."
    },
    {
        "url": "https://inews.co.uk/news/where-tony-blair-now-former-pm-leaving-office-2809695?ico=most_popular",
        "title": "Where is Tony Blair now? What former PM has done since leaving office",
        "description": "The final six episodes of the sixth and last season of The Crown are now available to watch on Netflix. As well as covering the death of Diana, and the burgeoning romance between Prince William and Kate Middleton, the series also covers former prime minister Sir Tony Blair ’s tenure."
    },
    {
        "url": "https://www.socialistparty.org.uk/articles/119210/14-12-2023/pcs-election-result-shows-battle-for-the-future-of-the-union-is-on/",
        "title": "PCS election result shows battle for the future of the union is on",
        "description": "After a hard-fought campaign the results of the PCS general secretary and assistant general secretary elections have been announced"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/14/blackpool-mp-scott-benton-faces-commons-suspension-over-lobbying-scandal",
        "title": "MP Scott Benton faces Commons suspension over lobbying scandal",
        "description": "Committee on standards’ recommendation of 35-day suspension could trigger byelection"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-insists-am-not-161819418.html",
        "title": "Rishi Sunak insists: I am not tetchy… I am passionate",
        "description": "The prime minister mounted a defence against claims he is irritable and bad-tempered, suggesting instead he is ‘passionate’ and gets ‘frustrated’ when things do not work the way he wants them to"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/14/sunak-faces-another-by-election-as-lobbying-scandal-mp-face/",
        "title": "By-election looms as Tory MP faces suspension from Parliament",
        "description": "The Commons watchdog recommended Scott Benton be kicked out for 35 days after he offered to table questions for a gambling firm"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-sitting-on-fence-amid-mounting-attacks-on-trade-unions-bennett-365032/",
        "title": "Labour ‘sitting on fence’ amid mounting attacks on trade unions – Bennett",
        "description": "Natalie Bennett has accused Labour of &#39;sitting on the fence&#39; amid &#39;mounting&#39; government attacks on trade unions."
    },
    {
        "url": "https://www.newsletter.co.uk/news/people/private-eyes-ian-hislop-on-politics-in-2023-it-was-supposed-to-be-the-year-of-the-grown-ups-4446142",
        "title": "Private Eye’s Ian Hislop on politics in 2023: ‘It was supposed to be the year of the grown-ups’",
        "description": "He’s had fun with the Duke of Sussex, mocked Boris Johnson and made Rishi Sunak and Donald Trump the butt of his jokes this year – and there’s plenty more satire to come in 2024 if Private Eye editor and Have I Got News For You?"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-67692529.amp",
        "title": "Drakeford resignation: Who will be Wales&#39; next first minister?",
        "description": "Sir <b>Keir Starmer</b> declined to repeat his assertion - made in 2022 - that Welsh Labour was his &quot;blueprint for power.&quot; And he had more than one opportunity to repeat it."
    }
]