[
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/10/lord-mandelson-friendship-jeffrey-epstein-keir-starmer/",
        "title": "Why Mandelson’s links to Epstein could come back to haunt <b>Starmer</b>",
        "description": "Sir Keir urged to suspend the former MP from Labour over his poor judgement - but his election experience could be too valuable to surrender"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1854330/keir-starmer-post-office-scandal-investigation",
        "title": "<b>Keir Starmer</b>&#39;s role in Post Office scandal must be investigated, demands former minister",
        "description": "Former Brexit minister David Jones has demanded that the Crown Prosecution Service&#39;s actions in the Post Office scandal are investigated."
    },
    {
        "url": "https://www.thenational.scot/politics/24040609.scottish-labour-simply-not-understand-democracy/",
        "title": "Scottish Labour simply does not understand democracy",
        "description": "Sarwar actually had the unmitigated gall to describe another party pointing out the shortcomings and hypocrisy of <b>Keir Starmer</b>&#39;s centre right Labour party as &quot;dirty tricks&quot;. It appears that in Sarwar&#39;s eyes, the aim of the SNP and other independence ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/cost-of-hs2-could-soar-to-nearly-67-billion/",
        "title": "Cost of HS2 London to Birmingham line could soar to nearly £67 billion, according to chairman",
        "description": "The boss of HS2 has now told MPs that the cost of the rail project, connecting London and Birmingham, could soar to as much as £66.6 billion."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-accused-of-trying-to-take-glory-with-new-post-office-law-12593360?postid=7042546",
        "title": "Politics latest: Gary Lineker challenged to run against Tory MP in Stoke-on-Trent North",
        "description": "We should probably warn you here of some risqué material coming up.... Last night, security minister Tom Tugendhat addressed a meeting of Tory MPs and joked that &quot;<b>Keir Starmer</b> has adopted more positions than the Kama Sutra, but never held any of them ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-67938713",
        "title": "Post Office scandal: Jailed postmaster unconvinced by plan",
        "description": "On Wednesday, Prime Minister Sunak revealed the UK government is to bring in a new law to &quot;swiftly exonerate and compensate victims&quot; of the scandal - it lasted from 1999 and 2015 and saw 736 sub-postmasters unfairly prosecuted due to a faulty IT system."
    },
    {
        "url": "https://inews.co.uk/opinion/tax-cut-no-longer-electoral-elixir-tories-think-2847370?ico=more_from_this_author",
        "title": "Tax cuts are no longer the electoral elixir the Tories think they are",
        "description": "After years of tax rises, creaking public services and the cost of living crisis, 2p off national insurance isn’t cutting it with voters - yet"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/10/sub-postmasters-taken-court-by-cps-keir-starmer/",
        "title": "Sub-postmasters taken to court by CPS while <b>Starmer</b> was in charge",
        "description": "Three of 11 cases found resulted in convictions while Sir Keir, now the Labour leader, was director of public prosecutions"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1854272/nigel-farage-labour-general-election",
        "title": "&#39;Here&#39;s the truth of it&#39;: Nigel Farage makes dire Labour general election prediction",
        "description": "The former Ukip and Brexit Party leader said he believes Sir <b>Keir Starmer</b> is set for 10 years in Downing Street due to anger at the Tories. He also insisted Reform UK is going to play a key part in &quot;realigning the centre right of British politics&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12948049/CPS-prosecuted-sub-postmasters-Horizon-Sir-Keir-Starmer.html",
        "title": "CPS prosecuted sub-postmasters based on Horizon evidence while Sir <b>Keir Starmer</b> was in charge - with one jailed for almost two years - as Labour insists cases &#39;did not go to ...",
        "description": "The Crown Prosecution Service prosecuted at least three sub-postmasters for theft and fraud caused by the Post Office Horizon system while Sir <b>Keir Starmer</b> was in charge. The CPS has been linked to up to 38 cases where it brought criminal cases linked to ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24041363.general-election-surviving-year-election-politicking/",
        "title": "General Election: Surviving the year of election politicking",
        "description": "Labour’s <b>Keir Starmer</b> called the Prime Minister “Mr Nobody”. Mr Sunak said Sir <b>Keir</b> “chooses the criminal gangs over the British people every time”. It was depressingly dense. Too stupid even for leaflets, and that’s saying something."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/10/does-keir-starmer-really-need-john-mcdonnells-advice",
        "title": "Does <b>Keir Starmer</b> really need John McDonnell’s advice?",
        "description": "Letters: Readers respond to the former shadow chancellor’s warning to the current leader of the Labour party"
    },
    {
        "url": "https://www.politics.co.uk/parliament/rishi-sunak-after-four-years-keir-starmer-is-still-all-slogans-and-no-plan/",
        "title": "Rishi Sunak: ‘After four years, <b>Keir Starmer</b> is still all slogans and no plan’",
        "description": "At Prime Minister’s Questions today, Rishi Sunak accused Labour leader <b>Keir Starmer</b> of being “all slogans and no plan”. The prime minister said: “Last week we had, I’d say, yet another half hour speech from the honourable gentleman. And what a ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-making-the-best-of-bad-news/",
        "title": "London Playbook PM: Making the best of bad news",
        "description": "MAKING THE BEST OF BAD NEWS: Rishi Sunak heads into the evening with a rare spring in his step after seizing the narrative on the Post Office scandal and making his government look responsive in tackling a horrific injustice."
    },
    {
        "url": "https://morningstaronline.co.uk/article/campaigners-condemn-revelation-sir-keir-is-parroting-washington-line-on-the-gaza-crisis",
        "title": "Campaigners condemn revelation Sir <b>Keir</b> is ‘parroting Washington’s line’ on the Gaza crisis",
        "description": "CAMPAIGNERS have condemned revelations that Labour is taking direction from Washington on the Gaza crisis. Confirming what has long been obvious, party leader Sir Keir Starmer has told Labour MPs that he is in regular contact with US national security adviser Jake Sullivan."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67939327",
        "title": "Post Office scandal: New law pledged but issues remain",
        "description": "The BBC&#39;s political editor Chris Mason on how a TV drama has &quot;turbocharged&quot; political interest in the Post Office scandal."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/post-office-scandal-keir-starmer-b2476524.html",
        "title": "Postmasters prosecuted by CPS while <b>Keir Starmer</b> was in charge",
        "description": "Sir Keir Starmer has been dragged into the Post Office scandal after the Crown Prosecution Service (CPS) revealed it had prosecuted postmasters while the Labour leader was in charge."
    },
    {
        "url": "https://www.thenational.scot/news/24040929.nicola-sturgeon-slams-timed-keir-starmer-general-election-warning/",
        "title": "Nicola Sturgeon slams &#39;timed <b>Keir Starmer</b>&#39; in General Election warning",
        "description": "The former first minister hit out at a &quot;timid&quot; <b>Keir Starmer</b> and his party in her column for The National’s sister paper The Glasgow Times. Sturgeon’s comments come after her successor as SNP leader, Humza Yousaf, also said that <b>Starmer</b> does not need ..."
    },
    {
        "url": "https://www.politics.co.uk/parliament/post-office-scandal-rishi-sunak-announces-law-to-quash-convictions-of-horizon-victims/",
        "title": "Post Office scandal: Rishi Sunak announces law to quash convictions of Horizon victims",
        "description": "Rishi Sunak has announced new legislation to exonerate wrongly convicted Post Office branch managers.   He told the House of Commons today: “I can announce that we will introduce new primary legislation to make sure that those convicted as a result of the Horizon scandal are swiftly exonerated."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12947325/Justice-Post-Office-victims-Rishi-Sunak-convictions-Horizon-compensation.html",
        "title": "After decades of hell, FINALLY... justice for the Post Office victims: Rishi Sunak says new law will quash convictions for HUNDREDS whose lives were wrecked if they sign simple ...",
        "description": "In a moment many must have feared would never come, Rishi Sunak told the Commons that the government will take drastic action to &#39;right the wrongs&#39;."
    },
    {
        "url": "https://bylinetimes.com/2024/01/10/labours-andy-burnham-says-just-50-people-run-the-uk-as-mayor-hits-out-at-westminster-and-sunaks-scrappage-of-hs2/",
        "title": "Labour’s Andy Burnham Says Just ‘50 People Run the UK’ as Mayor Hits Out at Westminster and Sunak’s Scrappage of HS2",
        "description": "The Greater Manchester Mayor wants the UK to adopt a new codified constitution, proportional representation and an overhauled House of Lords"
    },
    {
        "url": "https://news.sky.com/story/new-law-to-be-introduced-to-exonerate-wrongly-convicted-post-office-scandal-victims-13045242?dcmp=snt-sf-twitter",
        "title": "Horizon scandal: Post Office scandal victims to be exonerated and compensated as Rishi Sunak proposes new law",
        "description": "It is not clear exactly how the mechanics of the Commons overturning hundreds of prosecutions will work. Sir <b>Keir Starmer</b>, the Labour leader, indicated earlier this week that his party would support an attempt through law to overturn the convictions."
    },
    {
        "url": "https://uk.news.yahoo.com/nicola-sturgeon-hits-labour-fallacy-160822080.html",
        "title": "Nicola Sturgeon hits out at Labour &#39;fallacy&#39; in General Election warning",
        "description": "The former first minister hit out at a &quot;timid&quot; <b>Keir Starmer</b> and his party in her column for The National’s sister paper The Glasgow Times. Sturgeon’s comments come after her successor as SNP leader, Humza Yousaf, also said that <b>Starmer</b> does not need ..."
    },
    {
        "url": "https://uk.news.yahoo.com/post-office-scandal-exposed-elite-185500101.html",
        "title": "The Post Office scandal has exposed the elite’s shocking contempt for Middle England",
        "description": "Shockingly, the dreadful Crown Prosecution Service, which does too little to fight real crime, launched prosecutions in several cases, some when Sir <b>Keir Starmer</b> was in charge. But more than 700 cases were brought by the Post Office itself in private ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/10/keir-starmer-tory-traps-labour-conservative",
        "title": "<b>Keir Starmer</b> dodging Tory traps is a sign of good judgment, not timidity",
        "description": "Or rather, the unfamiliar climate provokes doubts in the polling forecast: a hard anti-Tory rain, followed by a spell of <b>Keir Starmer</b> in Downing Street. The needles have flickered but not moved much for over a year. The consistency of Labour’s lead ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/10/keir-starmer-conspiracy-theory/",
        "title": "TERFs make up <b>Keir Starmer</b> trans son conspiracy following interview mix-up",
        "description": "Transphobes have come up with the idea that Labour leader <b>Keir Starmer</b> has a trans son, following a mix-up during an interview about his two teenage children. <b>Starmer</b> slipped-up during an interview when talking about the potential pressure his 15-year-old ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-keir-starmer-prime-minister-britain-boris-johnson-b1131463.html",
        "title": "Rishi Sunak branded a ‘Mr Nobody who doesn’t get Britain’ in PMQs clash",
        "description": "Sir <b>Keir Starmer</b> labelled Rishi Sunak a “Mr Nobody” who “simply doesn’t get Britain” as the pair clashed over the Government’s Rwanda asylum plan. The Labour leader accused the Prime Minister of not believing in the Rwanda “gimmick” and ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/esther-mcvey-rishi-sunak-prime-minister-keir-starmer-horizon-b1131488.html",
        "title": "Arise Sir Alan Bates? No 10 backs knighthood for Horizon campaigner",
        "description": "I&#39;m sure that is something the public would regard as entirely appropriate and we would support Sir <b>Keir Starmer</b>, Labour leader Senior minister Esther McVey said she wants to see Mr Bates knighted “as soon as possible”. “Anybody can nominate him and ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/snow-forecast-uk-2024-live-31830189?int_source=nba",
        "title": "UK weather: Snow flurries and ice to hit overnight as Met Office issues cold warning",
        "description": "Staying cold throughout with temperatures below average.&quot; 19:34 Joseph Gamp <b>Starmer</b> criticises Government’s response to flooding Labour leader Sir <b>Keir Starmer</b> has said the Government’s response to flooding is not “good enough” and vowed he would ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-criticised-lack-planning-2000-properties-flooded-storm-henk-2843676?ico=in-line_link",
        "title": "Sunak criticised for lack of planning as 2,000 properties flooded by Storm Henk",
        "description": "Labour leader Sir <b>Keir Starmer</b> said Government response to flood risk “wasn’t quick enough”, adding: “Get ahead of this with a taskforce. That’s what I would do.” Asked if Labour would provide more money for flood prevention, Sir <b>Keir</b> said ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/01/the-problem-with-rishi-sunaks-new-election-strategy",
        "title": "Can the One Nation caucus reclaim the Tory party?",
        "description": "These apply to a greater or lesser extent whatever the election, but they feel particularly pertinent now, as Rishi Sunak and <b>Keir Starmer</b> prepare for the campaign that will define 2024. “Let Us Finish the Job” was very much the theme of Sunak’s ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/snow-hit-amid-uk-minus-31828312?int_source=nba",
        "title": "Where snow will hit and when amid UK minus 4C temperatures shown in new weather maps",
        "description": "Labour has accused the Government of being &quot;asleep at the wheel&quot; over flood warnings with leader Sir <b>Keir Starmer</b> vowing to make flood defences &quot;fit for purpose&quot;, writing on social media that &quot;people&#39;s lives shouldn&#39;t be upended by extreme rain&quot;."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-01-10/downing-street-backs-knighthood-for-post-office-campaigner-mr-bates",
        "title": "No 10 backs knighthood for Alan Bates after campaign to expose Post Office scandal",
        "description": "Rishi Sunak’s spokesman said the honour for former sub-postmaster Alan Bates would be &quot;common sense&quot;. | ITV News Wales"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/post-office-scandal-new-law-b2476352.html",
        "title": "Post Office scandal: How will the new law to exonerate victims of Horizon work?",
        "description": "After weeks of mounting speculation about how the government intends to respond to the Horizon Post Office scandal, Rishi Sunak has announced the government will introduce legislation to exonerate 700 victims accused of theft and fraud."
    },
    {
        "url": "https://www.lep.co.uk/news/watch-as-chorley-born-speaker-sir-lindsay-hoyle-makes-big-mistake-in-parliament-4473136",
        "title": "Speaker Sir Lindsay Hoyle makes big mistake in House of Commons as he addresses Labour leader <b>Keir Starmer</b>",
        "description": "The Speaker of the House of Commons, Chorley born politican Sir Lindsay Hoyle, has made a major slip up in front of parliament."
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/01/10/pmqs-verdict-keir-starmer-steals-sunaks-flip-flop-attacks/",
        "title": "PMQs verdict: <b>Keir Starmer</b> steals Sunak’s ‘flip flop’ attacks",
        "description": "The first question at PMQs today did not come from some lucky MP listed on the order paper — rather, it emanated from a chorus of Conservative backbenchers who collectively queried: “Where is Ed Davey?"
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-position-gaza-shaped-by-united-states-approach-israel-palestine",
        "title": "Labour Has Consulted US Over Its Gaza Approach",
        "description": "Labour has consulted with US government figures over its approach to Gaza, and has been influenced by the US position, PoliticsHome understands."
    },
    {
        "url": "https://leftfootforward.org/2024/01/rishi-sunak-ridiculed-as-mr-nobody-by-keir-starmer-during-heated-pmqs/",
        "title": "Rishi Sunak ridiculed as ‘Mr Nobody’ by <b>Keir Starmer</b> during heated PMQs",
        "description": "Prime Minister Rishi Sunak endured yet another bruising PMQs this afternoon, as he was blasted as ‘Mr nobody’ by Labour leader Keir Starmer. The Labour leader took aim at Sunak over his failed multiple resets and U-turns, as the Tory leader tries to prevent yet more infighting in his party and tries to turn his party’s fortunes around."
    },
    {
        "url": "https://www.radiotimes.com/tv/drama/post-office-scandal-victims-convictions-exonerated-newsupdate/",
        "title": "Post Office scandal victims to have convictions &quot;swiftly exonerated&quot; after TV drama",
        "description": "The Prime Minister says the government will bring in a new law to &quot;swiftly exonerate and compensate victims&quot; of the Post Office scandal."
    },
    {
        "url": "https://www.businessgreen.com/news/4162224/keir-starmer-touts-climate-action-uks-single-biggest-opportunity",
        "title": "<b>Keir Starmer</b> touts climate action as UK&#39;s &#39;single biggest opportunity&#39;",
        "description": "Labour leader promises to tackle the UK&#39;s environmental challenges, as he accuses PM of &#39;weaponising&#39; climate policies"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67934124",
        "title": "Sir <b>Keir Starmer</b> says Rishi Sunak originally was against Rwanda plan",
        "description": "Labour leader Sir Keir Starmer said documents from 2022 showed prime minister Rishi Sunak wanted to scale back plans to send asylum seekers to Africa."
    },
    {
        "url": "https://www.socialistparty.org.uk/articles/119736/10-01-2024/starmer-tread-lightly-in-power-join-the-fight-for-socialist-change/",
        "title": "<b>Starmer</b>: ‘tread lightly’ in power – join the fight for socialist change",
        "description": "Labour leader Keir Starmer, likely to be prime minister by the end of the year, laid out his pitch to the country in a speech on 4 January"
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-67934124",
        "title": "Sir <b>Keir Starmer</b> says Rishi Sunak was originally against Rwanda plan",
        "description": "Labour leader Sir <b>Keir Starmer</b> said documents from 2022 showed prime minister Rishi Sunak wanted to scale back plans to send asylum seekers to Africa. Mr Sunak says neither Sir <b>Keir</b> had seen the documents in question and that “an effective deterrence ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rishi-sunak-pmqs-keir-starmer-post-office-4472667?page=2",
        "title": "PMQs live: Rishi Sunak promises to exonerate subpostmasters caught up in Horizon scandal",
        "description": "Stephen Flynn says subpostmasters never &quot;stood a chance against Westminster&quot;, because obviously he&#39;s going to link it back to independence. Calls it a &quot;plague on all their houses&quot;. Taking a softball question from a Tory MP, Rishi Sunak says that he is &quot;cutting your taxes&quot;. In reality, he&#39;s raised them in the UK to a record high."
    },
    {
        "url": "https://www.politico.eu/article/rishi-sunak-westminster-pmq-scorecard-bags-a-win-with-new-help-for-post-office-victims/",
        "title": "PMQs scorecard: Sunak bags a win with new help for Post Office victims",
        "description": "The prime minister (finally) bumped up compensation and vowed to quash convictions for those falsely accused because of IT blunders, as he sparred with Labour’s Keir Starmer."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24040116.york-politicians-unite-call-national-free-school-meals-plan/",
        "title": "York politicians unite to call for national free school meals plan",
        "description": "LABOUR and Liberal Democrat councillors in York have united to call on national party leaders to include a ‘free school meals for every primary school child’ pledge in their general election manifestos."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1854155/Keir-Starmer-racism-PMQs-Zahawi",
        "title": "<b>Keir Starmer</b> sparks ‘dog whistle’ race row at PMQs with claims PM ‘doesn’t get Britain’",
        "description": "EXCLUSIVE - The Labour leader&#39;s attack at PMQs has been slammed as racist after he accused Rishi Sunak of not ‘getting&#39; Britain."
    },
    {
        "url": "https://www.itv.com/news/2024-01-10/three-strikes-and-youre-out-sunak-issued-warning-over-rwanda-bill",
        "title": "&#39;Three strikes and you&#39;re out&#39;: Sunak issued warning over Rwanda Bill",
        "description": "Former Home Office minister Robert Jenrick said the public will &quot;rightly be furious&quot; if the prime minister fails once again to send asylum seekers to Rwanda. | ITV National News"
    },
    {
        "url": "https://www.newstatesman.com/politics/the-staggers/2024/01/pmqs-review-keir-starmer-turns-the-flip-flop-charge-back-on-rishi-sunak",
        "title": "We don’t need a British West Wing – we’re already living in it",
        "description": "At the first PMQs of 2024, Rishi Sunak and <b>Keir Starmer</b> each came armed with political attack lines that we are sure to hear repeated ad nauseam as polling day draws closer. First, and by far most importantly, we got a crucial update on the Post Office ..."
    },
    {
        "url": "https://www.socialistparty.org.uk/articles/119726/10-01-2024/pcs-broad-left-network-our-union-must-be-stronger-on-gaza/",
        "title": "PCS Broad Left Network: ‘Our union must be stronger on Gaza’",
        "description": "We also need an organised political opposition to the Israeli armed offensive. <b>Keir Starmer</b>’s stance shows clearly that the Labour leadership is unwilling to play this role. Trade unions could convene an open meeting under a ‘Stop the War’ umbrella ..."
    }
]