[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67737116",
        "title": "Laura Kuenssberg: end of year",
        "description": "Rishi Sunak&#39;s hoped for turnaround didn&#39;t happen. Despite several restarts, refreshes, reboots, promises of the &#39;real Rishi&#39; coming out, the prime minister has not been able to shake his party out of the doldrums in the polls."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/prince-harry-piers-morgan-phone-hack-perjury-b2465201.html",
        "title": "Top judge says anyone who lied to phone hacking inquiry should be prosecuted for perjury",
        "description": "A top judge has said anyone who lied to the phone hacking inquiry should be prosecuted for perjury after a court found there could be “no doubt&quot; editors at Mirror Group Newspapers knew about intercepted voicemails."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1845992/poll-best-tory-prime-minister",
        "title": "POLL: Who is the best Tory Prime Minister? Vote here",
        "description": "Sir Anthony Eden (1955-1957) - Credited as being a great Foreign Secretary and Churchill&#39;s right-hand man, he is best remembered for the Suez crisis which saw Britain&#39;s influence drop in the world and led to him being replaced as Tory leader and PM while away recovering from health issues."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/23993784.mp-judith-cummins-anti-social-fireworks-spiking/",
        "title": "MP Judith Cummins on anti-social fireworks and spiking",
        "description": "In this week&#39;s MP&#39;s column, Bradford South MP Judith Cummins discusses the anti-social use of fireworks and spiking."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/23993434.oxford-pupils-stage-protest-teachers-alleged-cut/",
        "title": "Oxford pupils stage protest over teacher&#39;s alleged cut",
        "description": "Dozens of pupils rallied behind their school gates today in a classroom protest staged against the school’s reported suspension of a"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23993710.policing-cant-done-cheap-get-bobbies-back-beat/",
        "title": "Policing can&#39;t be done on the cheap. Get bobbies back on the beat",
        "description": "I WAS not surprised to learn that Police Scotland proposes to close 29 police stations in an effort to save money. Since Police Scotland"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23992659.independence-devolution---tensions-within-united-kingdom/",
        "title": "Independence, devolution – and the tensions within this United Kingdom",
        "description": "Against that, a political calculation that Sir <b>Keir Starmer</b>’s focus would not be primarily or even substantively upon Scottish matters. That it might, indeed, be in his interests to assuage England rather than Scotland. Truly, uncertain times."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-headache-soon-starmer-nightmare-060000903.html",
        "title": "Rishi’s headache will soon be <b>Starmer</b>’s nightmare",
        "description": "It’s no secret that the Labour Party is revelling in the revival of Tory “psychodrama”. They’ve admitted as much."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/opinion/columnists/voters-care-about-opportunity-not-pathetic-division-politics-and-culture-wars-justine-greening-4445775",
        "title": "Voters care about opportunity, not pathetic division politics and culture wars - Justine Greening",
        "description": "Of course, that is something that the Opposition Labour Party now understands. The more Sir <b>Keir Starmer</b> has talked about ‘breaking down barriers’ to opportunity, the better he has done in the opinion polls. And behind all of this is a reality - the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-tory-campaign-questionnaire-b2464963.html",
        "title": "Rishi Sunak accused of misleading public over Tory campaign questionnaire landing on doorsteps",
        "description": "The leaflets, branded potentially misleading and “routine party propaganda”, asks who voters backed at the last election and who they would prefer as prime minister - Sunak or Starmer. It is delivered alongside a letter headed “Rishi Sunak Prime Minister”, which twice asks: “What are your priorities for Britain? Tell the prime minister”."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-falling-short-five-060000250.html",
        "title": "Rishi Sunak Is Falling Short on His Five Pledges to British Voters",
        "description": "Rishi Sunak began 2023 asking UK voters to judge him by five pledges. As the year ends, the prime minister can only claim victory on one, leaving him an uphill battle to deliver ahead of a general election due within 14 months."
    },
    {
        "url": "https://morningstaronline.co.uk/article/safe-passage-for-refugees-is-vital",
        "title": "Safe passage for refugees is vital",
        "description": "This week has once again reminded us of the importance of building opposition to the Tories’ racist offensive, writes Stand Up to Racism’s SAMIRA ALI ahead of Monday’s demo"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12870515/DAILY-MAIL-COMMENT-Starmer-lets-slip-true-colours.html",
        "title": "DAILY MAIL COMMENT: Shifty <b>Starmer</b> lets slip his true colours",
        "description": "On the economy, health and much else, there is a gaping void. Yesterday, however, the mask slipped and we got a chilling glimpse of life under a Labour government."
    },
    {
        "url": "https://www.thenational.scot/politics/23993263.made-keir-starmer-grimace-westminster-christmas-party/",
        "title": "How I made <b>Keir Starmer</b> grimace at a Westminster Christmas party",
        "description": "These sorts of events are part and parcel of the culture in Westminster. Political parties lay on booze and snacks to curry favour with journalists. Their purpose is to meet people and Labour’s offices were packed with hacks hoping to get the phone numbers of people who will likely be key players in the next government."
    },
    {
        "url": "https://inews.co.uk/opinion/binning-blackpool-sleazy-mp-easy-tackling-poverty-harder-2810844",
        "title": "Binning Blackpool’s sleazy MP is the easy bit – tackling its poverty is harder",
        "description": "Sunak is set for fresh by-election blues. While Starmer may pass the electoral test, the policy challenge is more difficult"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/broken-britain-lost-essential-services-31667904.amp",
        "title": "EXCLUSIVE: &#39;Broken Britain&#39; of lost essential services revealed - how does your area fare?",
        "description": "It reveals the profound gaps where 2019 promises have failed our hardest hit communities. <b>Keir Starmer</b>&#39;s speech [on Monday] makes clear Labour understands the magnitude of the challenge. That will need to be matched by painstaking work needed to develop an ..."
    },
    {
        "url": "https://www.politico.eu/article/rushi-sunak-giorgia-meloni-love-united-kingdom-italy-prime-minister/",
        "title": "Why Rishi Sunak loves Italy’s Giorgia Meloni",
        "description": "Meloni entered politics through neo-fascist youth movements, and is on the record as having praised dictator Benito Mussolini as “a good politician,” claiming that “everything he did, he did for Italy.” She has since accepted that he made “mistakes,” including imposing race laws."
    },
    {
        "url": "https://www.ft.com/content/b2f4adae-7434-4611-8e3d-6b5c40030c8d",
        "title": "Transcript: Tory turmoil — Sunak stumbles towards end of year",
        "description": "This is an audio transcript of the Political Fix podcast episode: ‘Tory turmoil: Sunak stumbles towards end of year’ Robert Shrimsley The collapse in Tory discipline over next year is gonna be the thing to watch for. That’s the biggest problem."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-rishis-italian-schmoozing/",
        "title": "London Playbook PM: Rishi’s Italian schmoozing",
        "description": "Sounds kinda cool: The “festival” takes place at the Castel Sant’Angelo in Rome, which is quite literally a fortress built as a mausoleum for Emperor Hadrian, the dude who ordered a wall with his namesake be built to keep the pesky Scots out of his Roman empire. Check out what it looks like."
    },
    {
        "url": "https://www.standard.co.uk/news/crime/london-old-bailey-taylor-holloway-met-police-b1127292.html",
        "title": "Three men jailed for life after footballer murdered in rival gangs feud",
        "description": "Three men have been jailed for life for the murder of a young footballer who was fatally shot in the head during a long-standing gang feud. Taylor Cox, 19, died in hospital after suffering an unsurvivable injury when he was shot in an alleyway in Hornsey, north London, on June 8 2021."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/15/prince-harrys-victory-puts-the-spotlight-back-on-nervous-newspapers",
        "title": "Prince Harry’s victory puts the spotlight back on nervous newspapers",
        "description": "The Duke of Sussex’s determination to have his day in court over phone hacking has once again lifted the lid on media standards"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/15/digested-week-some-things-are-almost-worth-dying-for-though-not-rwanda-shane-macgowan",
        "title": "Digested week: Some things are almost worth dying for – though not Rwanda",
        "description": "Shane MacGowan’s funeral offers food for thought while Rishi Sunak’s immigration policy is not deranged enough for some"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/15/rishi-sunak-news-latest-rwanda-tories-george-osborne/",
        "title": "Politics latest news: Channel migrant death &#39;stark reminder&#39; of small boats danger, says No10",
        "description": "A small boat incident in the Channel that resulted in the death of a migrant serves as a “stark reminder” of the danger of the crossings and of the need to stop the journeys, Downing Street said. One migrant has died while another was in a critical condition after a boat sank in the English Channel overnight ."
    },
    {
        "url": "https://www.express.co.uk/entertainment/theatre/1846097/Rory-Stewart-Labour-Lord-Alastair-Campbell-Rest-Is-Politics",
        "title": "Former Tory minister Rory Stewart confesses he will defect to Labour on one condition",
        "description": "Former Conservative minister and Prime Ministerial candidate Rory Stewart admitted to Alastair Campbell during The Rest Is Politics Live&#39;s event that he would serve in Sir Keir Starmer&#39;s Labour government."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tory-tweet-finger-middle-bbc-labour-immigration-attack-backfire-b1127271.html",
        "title": "Tory tweet using image of BBC news anchor giving middle finger to attack Labour may have backfired, new study",
        "description": "A Tory tweet using an image of a BBC news anchor giving the middle finger to attack Labour over immigration may have backfired, according to new research. The move sparked a row among Conservative MPs, with Centrist parliamentarians urging the party’s HQ to take down the post but Rightwingers defending it."
    },
    {
        "url": "https://news.sky.com/story/just-stop-oil-activists-told-to-stay-away-from-keir-starmers-home-after-christmas-carol-protest-13030986",
        "title": "Just Stop Oil activists told to stay away from <b>Keir Starmer</b>&#39;s home after Christmas carol protest",
        "description": "Demonstrators were moved on by police after singing climate change-themed Christmas carols outside the Labour leader&#39;s north London home."
    },
    {
        "url": "https://www.thenational.scot/news/23992567.labour-councillors-resign-right-wing-rhetoric-mirroring-tories/?sent_id=PREVIEW&secret=PREVIEW",
        "title": "Labour councillors resign over &#39;right-wing rhetoric&#39; and &#39;mirroring&#39; of Tories",
        "description": "SEVERAL Labour councillors have resigned their whip over the party&#39;s increasingly &quot;right-wing rhetoric&quot;, spelling more trouble for"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-sussex-67726989.amp",
        "title": "Hastings Borough Council: Leader and five other councillors quit Labour",
        "description": "The leader of Hastings Borough Council, and five other councillors, have resigned from the Labour Party and set up an independent group. They said the party no longer provided the &quot;policies, support or focus on local government&quot; they needed."
    },
    {
        "url": "https://www.theargus.co.uk/news/23991874.hastings-council-leadership-leaves-labour-party-become-independents/",
        "title": "Hastings Council leadership leaves Labour Party to become independents",
        "description": "Hastings Borough Council leader Paul Barnett is one of the councillors who have left the party and will now sit as independents. The councillors say they will now “concentrate on standing up for Hastings” but the Labour Party has called for the six councillors to resign."
    },
    {
        "url": "https://news.sky.com/story/just-stop-oil-protester-jailed-for-six-months-for-peaceful-march-on-londons-brent-cross-flyover-13030991",
        "title": "Just Stop Oil protester jailed for six months for &#39;peaceful&#39; march on London&#39;s Brent Cross Flyover",
        "description": "A group called Lawyers are Responsible claims the sentence shows the &quot;increasingly repressive&quot; way climate protesters are dealt with."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12868475/Labour-denies-planning-windfall-tax-pay-28billion-green-spending.html",
        "title": "Labour denies claim it is planning another windfall tax to pay for its £28billion green spending spree if it wins the next election",
        "description": "Reports suggested that the party was looking at another punitive strike on business as it seeks ways to fund its £28billion-per year plan to make Britain more green."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/jso-protesters-in-christmas-carol-stunt-outside-sir-keir-starmer-s-home-106092/",
        "title": "JSO protesters in Christmas carol stunt outside Sir <b>Keir Starmer</b>’s home",
        "description": "Just Stop Oil protesters were moved on by police when they turned up outside the family home of Sir Keir Starmer to sing Christmas carols with a climate change-themed twist. The protest group shared footage on X, formerly Twitter, showing “carollers” being directed to leave the vicinity of the Labour leader’s house in north London on Thursday."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/labour-enjoys-twice-as-much-support-among-voters-as-the-tories-new-poll-reveals_uk_657c0af8e4b036ecab448944/",
        "title": "Labour Has Twice As Much Support Among Voters As The Tories, New Poll Reveals",
        "description": "Labour support among the public is now double that of the Conservatives, according to a new poll. The Techne UK survey puts <b>Keir Starmer</b>’s party in 44%, well ahead of the Tories on 22%. Significantly, the poll was carried out in the past week ..."
    },
    {
        "url": "https://www.thebookseller.com/rights/the-bodley-head-scoops-pogrund-and-maguires-book-on-labour-under-starmer",
        "title": "The Bodley Head scoops Pogrund and Maguire&#39;s book on Labour under <b>Starmer</b>",
        "description": "The Bodley Head has snapped up a new book by Patrick Maguire and Gabriel Pogrund, which tells the inside story of Labour under Keir Starmer."
    },
    {
        "url": "https://www.bignewsnetwork.com/news/274061283/uk-tories-plotting-boris-johnsons-comeback-daily-mail",
        "title": "UK Tories plotting Boris Johnson&#39;s comeback Daily Mail",
        "description": "The ex-British PM is seen by some Tory rebels as being the most formidable opponent to Keir Starmers Labour according to a report Tory r"
    },
    {
        "url": "https://ca.news.yahoo.com/opinion-im-addicted-old-bbc-160020056.html",
        "title": "OPINION - I&#39;m addicted to old BBC election night broadcasts — this is what I&#39;ve learnt",
        "description": "On reflection, David Owen was probably too “leading man handsome” to help the SDP break the mould of British politics. And yet I wish I weren’t so superficial that my main takeaway from the more-than 75 hours of viewing is that no matter how far back in time I travelled,"
    },
    {
        "url": "https://www.radiohc.cu/en/noticias/internacionales/342103-ico-complaint-seeks-answers-from-prosecutors-over-deleted-assange-emails",
        "title": "ICO complaint seeks answers from prosecutors over deleted Assange emails",
        "description": "The Crown Prosecution Service (CPS) is facing fresh pressure to explain why it deleted key emails exchanged with Swedish prosecutors over WikiLeaks founder Julian Assange. A lawyer representing an Italian investigative journalist has complained to the Information Commissioner&#39;s Office that the CPS has given inconsistent explanations for deleting the emails."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2023/dec/15/channel-crossings-people-smugglers-labour-rishi-sunak-keir-starmer-conservatives-uk-politics-latest",
        "title": "More needs to be done to disrupt people smugglers, says Labour after one person dies in Channel crossing – as it happened",
        "description": "Anneliese Dodds calls for more action to break up human trafficking gangs that are facilitating boat crossings"
    },
    {
        "url": "https://www.breakingnews.ie/world/jso-protesters-in-christmas-carol-stunt-outside-sir-keir-starmers-home-1565071.html",
        "title": "Just Stop Oil protesters in Christmas carol stunt outside <b>Keir Starmer</b>&#39;s home",
        "description": "Just Stop Oil protesters were moved on by police when they turned up outside the family home of British Labour Party leader Sir Keir Starmer to sing Christmas carols with a climate change-themed twist."
    },
    {
        "url": "https://inews.co.uk/opinion/rottweiler-kemi-badenoch-next-tory-leader-doesnt-bite-own-2809951",
        "title": "Kemi Badenoch can be the next Tory leader – but she is her own worst enemy",
        "description": "The Business and Trade Secretary’s ruthless attack on a Labour MP endears her to some colleagues, but worries others"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/15/just-stop-oil-holds-protest-outside-keir-starmers-house/",
        "title": "Just Stop Oil holds protest outside <b>Keir Starmer</b>’s house",
        "description": "Eco-activists target the Labour leader and demand that he takes action by banning oil and gas exploration in the UK"
    },
    {
        "url": "https://leftfootforward.org/2023/12/astonishing-poll-shows-just-how-little-faith-the-public-has-in-the-tories/",
        "title": "Astonishing poll shows just how little faith the public has in the Tories",
        "description": "More people believe the moon landings were faked than are confident the government can tackle the big issues facing the UK"
    },
    {
        "url": "https://www.victoriaadvocate.com/climate-activists-serenade-keir-starmer-at-his-doorstep-in-london-uk/video_40ade81a-6ca2-5c81-84d6-1f81d9d849ed.html",
        "title": "Climate Activists Serenade <b>Keir Starmer</b> at His Doorstep in London, UK",
        "description": "This footage was filmed and produced 13 December 2023. In a climate-focused demonstration, supporters of Just Stop Oil gathered outside <b>Keir Starmer</b>&#39;s London residence, urging the Labour leader to commit to canceling all new oil and gas licences ..."
    }
]