[
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-67825269",
        "title": "Newspaper headlines: Tory election plans and &#39;NHS parking scandal&#39;",
        "description": "The front pages carry a range of stories, including different ways the Tories may seek to &quot;woo&quot; voters ahead of the election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/only-6-percent-of-voters-think-tories-have-done-a-good-job-wp8wmq2wl?ilc=timesradio:morefromthetimes",
        "title": "Only 6% of voters think Tories have ‘done a good job’",
        "description": "Declining support for Rishi Sunak bodes well for Sir Keir Starmer, but voters still unsure whether Labour is fit for office"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12902315/Labours-migrant-removal-plan-replace-Rwanda-scheme-fail-stop-boats-Tory-minister-says.html",
        "title": "Labour&#39;s migrant removal plan to replace the Rwanda scheme will fail to stop the boats, Tory minister says",
        "description": "Sir Keir Starmer, who has said he will scrap the Government&#39;s deal with Kigali if he becomes prime minister, is considering plans for &#39;offshore processing&#39;."
    },
    {
        "url": "https://www.thesun.co.uk/news/25167826/keir-starmer-immigration-plan-labour-void/",
        "title": "Sir <b>Keir Starmer</b> knows Labour has a void where a plan for stopping the small boats should be",
        "description": "Migrants stunt LABOUR love to denounce the Tories’ Rwanda migrants scheme as a “gimmick”. Their latest so-called alternative is worse — it is a blatant, cynical stunt. Keir Starmer knows his party"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12901751/The-world-awash-cash-invest-make-Britain-better-says-departing-L-G-boss-Nigel-Wilson.html?mrn_rm=rta",
        "title": "&#39;The world is awash with cash - we can invest it to make Britain better&#39;, says departing L&amp;G boss Nigel Wilson",
        "description": "In his 11 years running investment giant Legal &amp; General, Nigel Wilson (pictured) has used his £1.2trillion balance sheet to reshape our cities."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12902179/Keir-Starmer-frontbenchers-spring-general-election-Rishi-Sunak-2024.html",
        "title": "<b>Keir Starmer</b> tells his frontbenchers to prepare for a spring general election after Rishi Sunak confirms one will be held in 2024",
        "description": "Shadow ministers have been told to have their policy proposals ready by mid-January so that the party can have a full manifesto by February 8, insiders have said."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/26/rishi-sunak-end-inheritance-tax-spring-ahead-of-election/",
        "title": "Sunak plots to end inheritance tax in spring ahead of election",
        "description": "The overall tax burden is heading to its highest level for around 70 years, with a freeze on many tax threshold levels used to recover money spent in the Covid pandemic. But in November’s Autumn Statement, Mr Sunak and Jeremy Hunt, the Chancellor, signalled a change in approach, delivering the biggest single package of tax cuts since the 1980s."
    },
    {
        "url": "https://www.thesun.co.uk/news/25167583/keir-starmer-blasted-rwanda-immigration/",
        "title": "<b>Keir Starmer</b> blasted for ‘flip-flopping’ AGAIN on plans to tackle small boats – as he draws up ‘Rwanda alternative’",
        "description": "SIR Keir Starmer has been blasted for flip-flopping once again on his plans for tackling illegal migration. In a major U-turn, the Labour chief is understood to be drawing up “watertight”"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-plans-play-class-190000345.html",
        "title": "<b>Keir Starmer</b> plans to play the class card, just as Wilson did 60 years ago",
        "description": "We are about to enter a general election year, and although it is conceivable that Rishi Sunak will wait until Jan 28, 2025, the very end of the term allowed, he would be mad to do so. Prime Ministers behind in the polls always hope that by waiting almost until the last possible moment – John Major in 1997,"
    },
    {
        "url": "https://www.bbc.com/news/uk-67822631.amp",
        "title": "Labour considers processing asylum seekers overseas",
        "description": "The Labour party is considering processing some asylum claims overseas if it forms the next government. Sir Keir Starmer has been looking over new plans for Labour&#39;s asylum policy, a spokesman told the BBC. Asked last week if his party would consider processing asylum claims outside of the UK, Sir Keir said he would look at any plan that works."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/26/end-government-by-whatsapp-urges-former-gchq-head",
        "title": "End government by WhatsApp, urges former GCHQ head",
        "description": "It will also strengthen demands for Labour, which is ahead in the polls, to set out its plans. <b>Keir Starmer</b>’s party has promised to overhaul the government ethics system and improve transparency but has not set out how it would rethink Whitehall’s ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1849280/labour-keir-starmer-rwanda-immigration",
        "title": "Inside <b>Keir Starmer</b>&#39;s &#39;alternative Rwanda plan&#39; which could involve help from the EU",
        "description": "Sir Keir Starmer&#39;s plans lie in stark contrast to Rishi Sunak&#39;s current Government policy - but his left-wing critics don&#39;t think his plans go far enough."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-countryside-alliance-hunting-boxing-day-b1129034.html",
        "title": "Labour urged not to crack down on hunting laws amid Boxing Day parades",
        "description": "Labour has been urged to abandon any plans to reopen the issue of hunting with new legal reforms, as tens of thousands of people gathered for annual Boxing Day parades. An estimated 180 meets took place across the country on Tuesday this year, according to campaign group the Countryside Alliance."
    },
    {
        "url": "https://inews.co.uk/news/politics/fears-sunak-starmer-charismalow-voter-turnout-2822260?ico=in-line_link",
        "title": "Sunak and <b>Starmer</b> urged to offer disillusioned voters something to vote for",
        "description": "Both Sir Keir Starmer and Rishi Sunak are under pressure to offer voters a more compelling reason to go out and vote for the party amid fears it could cost them at the ballot box."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/26/labour-warned-against-dancing-to-tory-tune-by-offshoring-asylum-claims",
        "title": "Labour warned against ‘dancing to Tory tune’ by offshoring asylum claims",
        "description": "Reports party is considering options for processing asylum claims overseas criticised by SNP, charities and pressure groups"
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-brands-uk-labours-alternative-to-rwanda-plans-inhumane-and-immoral-4458110",
        "title": "SNP brands UK Labour&#39;s alternative to Rwanda plans &#39;inhumane&#39; and &#39;immoral&#39;",
        "description": "The SNP have branded Labour’s alternative immigration plans to Rwanda “inhumane and immoral”, as the offshore processing of asylum seekers firms as a key battleground in the build-up to next year’s general election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-warned-to-end-running-attack-on-rural-communities-vkt7t6xtl",
        "title": "Labour warned to end ‘running attack’ on rural communities",
        "description": "Labour has been warned to end its “running attack” on rural communities as tens of thousands of people are set to gather for Boxing Day hunt parades. Sir Keir Starmer’s party, which is widely tipped to win the next general election,"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-warned-against-rwanda-asylum-policy-labour-left-2824849?ico=more_from_this_author",
        "title": "<b>Starmer</b> warned against adopting Rwanda-style asylum policy by Labour left",
        "description": "The Opposition is willing to consider sending asylum seekers abroad to have their claims processed but would not settle refugees outside Britain permanently"
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/teesworks-claims-buses-conspiracy-theories-28331189",
        "title": "Teesworks claims, buses and conspiracy theories: Take our 2023 Northern politics Christmas quiz",
        "description": "On Teesside, Tory mayor Ben Houchen&#39;s Teesworks regeneration site was mired in corruption claims and in Greater Manchester Andy Burnham took back control of the local bus network. But how much do you remember about some of the quirkier stories from politics in the North from last year, as featured in the daily Northern Agenda newsletter?"
    },
    {
        "url": "https://tellymix.co.uk/tv/660223-big-fat-quiz-of-the-year-2023-lineup-date.html",
        "title": "Big Fat Quiz Of The Year 2023 lineup and date",
        "description": "Those on the lineup for this year’s competition are: Rosie Jones and Katherine Ryan Mo Gilligan and Kevin Bridges Richard Ayoade and Mel Giedroyc They’ll be facing questions including what made <b>Keir Starmer</b> stand out this year? Which sports event ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/26/keir-starmer-labour-momentum-asylum-seekers-offshoring/",
        "title": "<b>Starmer</b> under fire from Momentum over interest in ‘offshoring’ asylum seekers",
        "description": "Left-wing group accuses Labour leader of aping inhumane Tory policies with &#39;disturbing’ interest in processing asylum seekers overseas"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/boxing-day-hunts-thousands-gather-31750338",
        "title": "Boxing Day hunts: Thousands gather at controversial meets as protesters call for ban",
        "description": "Tens of thousands of people have gathered at more than 200 meet locations across the UK for the controversial annual Boxing Day hunt parades, including protesters calling for the &#39;smokescreen&#39; sport t"
    },
    {
        "url": "https://www.middleeasteye.net/opinion/uk-elections-2024-sunak-far-right-conservative-movement-threat-political-stability",
        "title": "UK election 2024: Sunak’s far right movement is a threat to political stability",
        "description": "Expect British politics to lurch towards the extreme right in 2024 as Prime Minister Rishi Sunak battles for political survival. Opinion polls predict Sunak will suffer a landslide defeat at the next general election - which must be held by January 2025 at the latest."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848899/keir-starmer-hunting-ban-countryside-general-election",
        "title": "<b>Keir Starmer</b> told to end &#39;war on countryside&#39; over Boxing Day Hunts to win election",
        "description": "EXCLUSIVE - A former Labour MP has said countryside voters are key to the party&#39;s election hopes - but one stumbling block could dash Sir Keir&#39;s ambitions."
    },
    {
        "url": "https://nehandaradio.com/2023/12/26/uk-labour-party-considers-processing-asylum-seekers-overseas/",
        "title": "UK Labour Party considers processing asylum seekers overseas",
        "description": "The opposition Labour Party in the UK is considering plans to process some asylum claims overseas to discourage many from making the dangerous journey across the Channel in boats."
    },
    {
        "url": "https://news.yahoo.com/labour-urged-not-crack-down-173207679.html",
        "title": "Labour urged not to crack down on hunting laws amid Boxing Day parades",
        "description": "Labour has been urged to abandon any plans to re-open the issue of hunting with new legal reforms, as tens of thousands of people gathered for annual Boxing Day parades. An estimated 180 meets took place across the country on Tuesday this year, according to campaign group the Countryside Alliance."
    },
    {
        "url": "https://www.dannydorling.org/?p=10024",
        "title": "For All Those – Public Sector Sensitivities",
        "description": "People change their minds, young people form their first opinions of international events at times like this, and of their elders, some say ‘it is too complex – you would not understand, others reply – ‘try’. I’ll end this short piece with a part of a poem, by Suheir Hammad. (6)"
    },
    {
        "url": "https://theindependent.sg/rwanda-bill-what-is-the-labour-partys-alternative-plan/",
        "title": "Rwanda Bill: What is the Labour Party’s alternative plan?",
        "description": "When the previous administration introduced the Rwanda Bill in 2022, the Labour Party immediately denounced the plan. The Labour leader, Keir Starmer, in particular, criticized it, saying that the plan was ‘unworkable’ and ‘extortionate’ for taxpayers."
    },
    {
        "url": "https://theprint.in/world/uk-pm-rishi-sunak-marks-christmas-with-quirky-home-alone-skit-4/1901101/",
        "title": "UK PM Rishi Sunak marks Christmas with quirky ‘Home Alone’ skit",
        "description": "Rishi Sunak marked the Christmas holidays with a quirky skit inspired by the 1990s Hollywood film ‘Home Alone’, posted on social media with the message “Merry Christmas from Downing Street” to highlight the British Prime Minister’s humorous side over the festive period."
    },
    {
        "url": "https://novaramedia.com/2023/12/26/20-rightwingers-you-dont-know-but-should/",
        "title": "20 Rightwingers You Don’t Know but Should",
        "description": "This year we’ve heard endlessly from 30p Lee and Cruella Braverman, but what about Britain&#39;s lesser-known rightwing headbangers? As the Westminster circus rolls out of town, meet the B-list baddies poisoning our politics."
    },
    {
        "url": "https://www.independent.co.uk/climate-change/news/labour-countryside-alliance-steve-reed-government-worcestershire-b2469412.html",
        "title": "Labour warned against strengthening hunt laws amid Boxing Day parades",
        "description": "Labour has been warned to end its “running attack” on rural communities, as tens of thousands of people are set to gather for Boxing Day hunt parades. Sir Keir Starmer’s party, which is widely tipped to win the next general election, has in the past called for “loopholes” in hunting legislation to be closed."
    },
    {
        "url": "https://www.thenational.scot/news/24011536.john-curtice-tories-now-fighting-two-fronts-ahead-election/",
        "title": "John Curtice: Tories now ‘fighting on two fronts’ ahead of election",
        "description": "RISHI Sunak has been unable to reverse the damage to the Tories caused by Boris Johnson and Liz Truss, according to polling expert John Curtice."
    },
    {
        "url": "https://uk.news.yahoo.com/biden-too-busy-snubbing-britain-110000903.html",
        "title": "Biden is too busy snubbing Britain to lead the West against China",
        "description": "It is close to losing its position as the world’s largest economy. It is facing challenges in key industries from aerospace to technology and pharmaceuticals. And its grip on the global trading system is weakening."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-considers-rwanda-migrant-plan-31749830",
        "title": "Labour considers Rwanda migrant plan alternative to process asylum claims overseas",
        "description": "Labour Party chiefs are looking at ways of ensuring asylum applications are dealt with before people reach the UK after vowing to scrap the Rwanda deal if they are elected"
    },
    {
        "url": "https://www.ndtv.com/world-news/uk-pm-rishi-sunak-shares-home-alone-inspired-video-in-quirky-christmas-wish-larry-the-cat-4745349",
        "title": "UK PM Rishi Sunak Shares Home Alone-Inspired Video In Quirky Christmas Wish",
        "description": "Rishi Sunak marked the Christmas holidays with a quirky skit inspired by the 1990s Hollywood film &#39;Home Alone&#39;, posted on social media with the message &quot;Merry Christmas from Downing Street&quot; to highlight the British Prime Minister&#39;s humorous side."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/ghosts-of-reshuffles-past/",
        "title": "Ghosts of reshuffles past",
        "description": "BOXING DAY MEETS: The Mirror’s Ben Glaze writes that fox hunting could shoot up the political agenda in the next election campaign if the Tories try and use the issue as a way to appeal to their grassroots. The Countryside Alliance is warning Labour against trying to cancel Boxing Day hunts — the Sun has a write-up."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/26/keir-starmer-tells-labour-frontbench-to-ready-policies-for-spring-election",
        "title": "<b>Keir Starmer</b> tells Labour frontbench to ready policies for spring election",
        "description": "Exclusive: Labour leader wants to finalise manifesto in February and move to campaign footing in anticipation of May vote"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/25/sunak-starmer-truss-cameron-christmas-traditions/",
        "title": "Watch: Rishi Sunak stars in Home Alone inspired Christmas video",
        "description": "Liz Truss, the former prime minister, said that she watches the 1982 Steven Spielberg film ET, as well as the musical The Sound Of Music, starring Julie Andrews. “I always well up when ET is presumed dead in the river,” she said. Foreign Secretary Lord Cameron said that his festive season is similar to the rest of the country."
    },
    {
        "url": "https://www.thenational.scot/news/24011363.labour-considering-offshore-asylum-processing-plans/",
        "title": "Labour &#39;considering offshore asylum processing plans&#39;",
        "description": "LABOUR are reportedly considering plans to have asylum claims processed abroad as an alternative to the Tories’ Rwanda plan."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-67764196",
        "title": "The political A to Z of Northern Ireland in 2023",
        "description": "With no power-sharing government in Northern Ireland in the entirety of 2023, you&#39;d be forgiven for thinking there wasn&#39;t much to say about the year in politics."
    },
    {
        "url": "https://www.aol.com/voters-only-final-decision-closer-000100090.html",
        "title": "Voters will only make final decision closer to general election, says Ross",
        "description": "The Scottish Conservative leader said he will ‘do everything I can’ to ensure Rishi Sunak remains Prime Minister."
    },
    {
        "url": "https://www.deccanherald.com/world/rishi-sunak-marks-christmas-with-quirky-home-alone-skit-2825549",
        "title": "Rishi Sunak marks Christmas with quirky ‘Home Alone’ skit",
        "description": "London: Rishi Sunak marked the Christmas holidays with a quirky skit inspired by the 1990s Hollywood film Home Alone, posted on social media with the message “Merry Christmas from Downing Street” to highlight the British Prime Minister’s humorous side over the festive period. ADVERTISEMENT"
    },
    {
        "url": "https://theweek.com/culture-life/people-of-the-year-2023",
        "title": "People of the year 2023",
        "description": "Time magazine names Taylor Swift as its 2023 Person of the Year . Sultan Al Jaber, head of the UAE&#39;s state oil company, presides over the Cop28 climate summit in Dubai. The Home Secretary, James Cleverly, flies to Rwanda to sign a new asylum-seeker treaty. Robert Jenrick quits as immigration minister, saying that the new Rwanda plan won&#39;t work."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/23907199.year-swindon-politics-2023-shows-brutal-politics-can/",
        "title": "The year in Swindon politics: 2023 shows how brutal politics can be",
        "description": "If you need any confirmation of what a brutal business politics can be, just ask David Renard. At the start of 2023 Mr Renard was in his tenth year as leader of Swindon Borough Council, and was a leading spokesman on environment for the Local Government Association."
    },
    {
        "url": "https://www.cityam.com/the-political-faces-we-said-goodbye-to-this-year/",
        "title": "Political deaths in 2023: The famous faces we said goodbye to this year",
        "description": "From Betty Boothroyd and Nigel Lawson, to Glenda Jackson and Alistair Darling, we look back at those we lost from Westminster in 2023."
    },
    {
        "url": "https://www.hexham-courant.co.uk/news/24009068.everything-north-east-mayoral-election-2024-explained/",
        "title": "Everything on North East mayoral election 2024 explained",
        "description": "There is currently a North of Tyne mayor, Jamie Driscoll, who was elected in 2019 after Northumberland, Newcastle and North Tyneside broke away to form their own combined authority. His term will end in May and the North of Tyne Combined Authority will be abolished to make way for the new one."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24009381.fill-economic-cup-social-cheer/?ref=rss",
        "title": "Let&#39;s fill the economic cup with some social cheer",
        "description": "The social enterprise model of putting purpose on par with profits could be one way of lifting the UK&#39;s flagging economy"
    },
    {
        "url": "https://www.walesonline.co.uk/news/news-opinion/bold-predictions-what-happen-welsh-28319588",
        "title": "The bold predictions for what will happen in Welsh politics in 2024",
        "description": "Two predictions for the price of one to start with. In 2024 there will almost certainly be a general election. The latest possible date a poll could be held is January 28, 2025, but it has been reported that Prime Minister Rishi Sunak told a gathering of journalists before Christmas that &quot;2024 will be an election year&quot;."
    },
    {
        "url": "https://www.politico.eu/article/christmas-present-westminster-worst-politics-merchandise-conservative-labour-lib-dem/",
        "title": "Need a late Christmas present? Try Westminster’s worst political merch",
        "description": "Show people you really don’t care with these belated ‘gifts,’ courtesy of genuine adults tasked with running the country."
    },
    {
        "url": "https://www.thenationalnews.com/opinion/comment/2023/12/26/sunaks-joke-starmers-time-will-2024-seal-the-deal-for-labour/",
        "title": "Sunak&#39;s joke, <b>Starmer</b>&#39;s time: Will 2024 seal the deal for Labour?",
        "description": "If the opinion polls are correct, <b>Keir Starmer</b> will become UK Prime Minister in 2024. Rishi Sunak Attends PMQs Rishi Sunak has been British Prime Minister for one year. Here The National looks back at his time in No 10 Downing Street. Getty Images It has ..."
    }
]