[
    {
        "url": "https://www.dailymail.co.uk/news/article-13069671/Outrage-Labour-candidate-claims-Israel-deliberately-allowed-1-400-citizens-massacred-October-7-order-green-light-invade-Gaza.html",
        "title": "Outrage after Labour candidate claims Israel deliberately allowed 1,400 of its citizens to be massacred on October 7 in order to give it the &#39;green light&#39; to invade Gaza",
        "description": "Azhar Ali, who is defending a Labour majority of more than 9,000 in Rochdale on February 29, claimed Israel allowed Hamas to massacre its own citizens."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/tory-by-election-councillor-only-one-year-new-homes-fight/",
        "title": "Tory by-election candidate says he will only do the job for a year",
        "description": "Sam Bromiley is running to replace Tory MP Chris Skidmore, who quit over a bill to guarantee annual oil and gas licensing rounds"
    },
    {
        "url": "https://www.thesun.co.uk/news/25857992/sir-kier-starmer-boost-unions-militant-chaos-labour/",
        "title": "Sir Kier <b>Starmer</b>’s plans to boost unions could open the door to militant chaos in Labour’s first 100 days",
        "description": "LABOUR have vowed to give trade unions sweeping new powers if they win the General Election — sparking fears Britain could be crippled by even more strikes in a year. Sir Keir Starmer plans to"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13069293/Northern-Irelands-new-minister-claims-Hamas-future-partner-peace-Middle-East.html",
        "title": "Northern Ireland&#39;s new first minister says Hamas will be a &#39;future partner for peace&#39; in the Middle East as she draws comparisons with &#39;dialogue&#39; held between republicans and ...",
        "description": "But she put pressure on <b>Keir Starmer</b> to allow a border poll to go ahead if he becomes Prime Minister later this year. Such a poll is at the discretion of the Government, but there are criteria within the Good Friday Agreement (GFA) that says one should ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/10/tories-conservative-byelection-defeats-sunak-leadership-death-spiral",
        "title": "We’ve given up the fight, say top Tories as byelection defeats loom",
        "description": "<b>Keir Starmer</b> now has an 11-point lead with regard to who voters think would make the best prime minister. The Tory campaign has been hamstrung in Wellingborough, where the local party insisted on selecting the partner of ousted Tory MP Peter Bone ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-says-rishi-sunak-32096300",
        "title": "<b>Keir Starmer</b> says Rishi Sunak lacks &#39;courage&#39; to say sorry to Brianna Ghey&#39;s mum over trans joke",
        "description": "The Labour leader - clearly still furious about the exchange in PMQs - said Rishi Sunak had broken the first rule of being Prime Minister - &quot;to make every single citizen feel safe and respected in the"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865388/reform-uk-rishi-sunak-wellingborough-kingswood-by-elections",
        "title": "‘He’s toast!’ Reform taunts Rishi Sunak as PM fights for Brexiteer vote in by-elections",
        "description": "Reform UK candidate Ben Habib believes Rishi Sunak cannot fight back as Conservatives try to hold on to Wellingborough and Kingswood seats in by-elections."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-pledges-500000-new-32095906",
        "title": "<b>Keir Starmer</b> pledges 500,000 new green jobs &#39;where you live&#39; - full back to work plan",
        "description": "The Labour leader and Shadow Chancellor Rachel Reeves showed a united front - outlining the huge infrastructure investments still planned for the party&#39;s green plan, despite scaling back the headline"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25857095/voters-angry-labour-28billion-eco-uturn-starmer/",
        "title": "Labour hit by furious voter backlash over his £28 billion eco U-turn",
        "description": "VOTERS reckon Sir Keir Starmer “flip flops too often” after his £28billion green U-turn, snap focus groups have revealed. Labour have been plunged into crisis after they announced they were"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hb7nc1",
        "title": "Are the Politics of Climate Change Going Out of Fashion?",
        "description": "Today we look at why Labour has U-turned on £28 billion of green spending ahead of the next general election and how attitudes towards climate policies have shifted in recent years. Paddy and Laura also discuss the upcoming by-elections in Kingswood and Wellingborough and what voters in both constituencies are most concerned about."
    },
    {
        "url": "https://www.thetimes.co.uk/article/tony-blair-meetings-sue-gray-labour-keir-starmer-vxtkxnz7l",
        "title": "Tony Blair and Sue Gray: the heavyweights fighting for <b>Starmer</b>’s ear",
        "description": "The former prime minister was a key player in the internal debate that led to the party leader’s decision to ditch its £28bn eco spending pledge"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/10/labour-green-pledge-u-turn-threatened-plan-for-growth",
        "title": "The Observer view: Labour’s green U-turn has threatened its plan for growth",
        "description": "The party’s decision to drop a commitment to spending £28bn a year will have a negative effect on its other investment plans"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/bma-offers-to-call-off-action-in-return-for-increased-strike-mandate-110246/",
        "title": "BMA offers to call off action in return for increased strike mandate",
        "description": "Thousands of medics will strike in England for five days from 7am on February 24 until 11.59pm on February 28."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/labour-net-zero-target-not-achievable-experts-say-2030/",
        "title": "Labour&#39;s green target &#39;unachievable&#39; after ditching £28bn pledge, say experts",
        "description": "The commitment to decarbonising electricity generation by the end of the decade was already considered highly ambitious, but experts said that Sir Keir Starmer’s decision to ditch the party’s £28 billion green investment plan made it all but impossible."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/rishi-sunak-earned-2-2m-164559416.html",
        "title": "Rishi Sunak earned £2.2m and paid £508,000 in tax, documents show",
        "description": "Rishi Sunak has published his tax documents, showing that he paid more than £500,000 in UK tax last year, as his total income rose to £2.2m."
    },
    {
        "url": "https://www.thetimes.co.uk/article/62cd1602-338e-4206-b609-e6e56a0a91ba?shareToken=38108603728dfa974f51eb5210bd5e6c",
        "title": "I’ll use whatever pronouns I think courteous",
        "description": "Did Sir <b>Keir Starmer</b> make political capital too by using Esther Ghey’s grief to parry Sunak’s dig about him being unable to define a woman? Maybe. But he at least reminded us what is increasingly lost in this toxic debate: it concerns real lives."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24111615.labour-rejects-dodgy-civil-servant-costing-windfall-tax-plans/",
        "title": "Labour rejects ‘dodgy’ civil servant costing of windfall tax plans",
        "description": "The opposition party said the analysis ‘fundamentally misunderstands’ its policy to tax the excess profits of oil and gas giants."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-enjoy-shortest-170346896.html",
        "title": "Voices: Will <b>Keir Starmer</b> enjoy the shortest ever honeymoon as prime minister?",
        "description": "I think the problem the Labour Party should start worrying about is how to maintain popularity after they win.” <b>Keir Starmer</b>’s ruthlessness in doing what it takes to win the election, and to take nothing for granted, is admirable in its way."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865253/keir-starmer-election-warning-labour-party?ref=todayheadlines.live",
        "title": "<b>Keir Starmer</b> says Labour must &#39;fight like we&#39;re five points behind&#39; in election warning",
        "description": "Labour holds an opinion poll lead of about 20 points over the Conservatives ahead of an election this year - but Sir Keir Starmer is not taking anything for granted."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-reveals-very-sassy-first-conversation-with-his-wife-13067835",
        "title": "Sir <b>Keir Starmer</b> reveals &#39;very sassy&#39; first conversation with his wife",
        "description": "Sir Keir Starmer&#39;s first conversation with his future wife ended with her snapping &quot;Who the f*** does he think he is?&quot; The Labour leader told British Vogue that he didn&#39;t have the &quot;best of starts&quot; with his now spouse, Victoria."
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-labour-honeymoon-prime-minister-b2494047.html",
        "title": "Will <b>Keir Starmer</b> enjoy the shortest ever honeymoon as prime minister?",
        "description": "<b>Keir Starmer</b>’s ruthlessness in doing what it takes to win the election, and to take nothing for granted, is admirable in its way It is amazing how many things that would be a problem if you were not 20 points ahead in the opinion polls are not a problem ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/9/",
        "title": "Prince Harry updates — Duke and Meghan ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "Opposition leader Sir <b>Keir Starmer</b> added: &quot;On behalf of the Labour Party, I wish His Majesty all the very best for his recovery. &quot;We look forward to seeing him back to swift full health.&quot; The Palace declined to confirm the type of cancer. The diagnosis ..."
    },
    {
        "url": "https://www.thenational.scot/news/24111691.pro-palestine-protesters-confront-ian-murray-labour-meeting/",
        "title": "Pro-Palestine protesters confront Ian Murray at Labour meeting",
        "description": "Masquerading as campaign posters for the Labour Party itself, the posters take aim at Murray’s backing of <b>Keir Starmer</b>’s position on Gaza. Murray recently agreed with the leader and said that a “humanitarian truce” could provide the conditions for ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-labour-party-keir-starmer-government-jeremy-hunt-b1138369.html",
        "title": "Labour rejects ‘dodgy’ civil servant costing of windfall tax plans",
        "description": "The opposition party said the analysis ‘fundamentally misunderstands’ its policy to tax the excess profits of oil and gas giants."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13068711/DAN-HODGES-Keir-Starmer-bloody-nose-thanks-conflict-raging-2-500-miles-away.html",
        "title": "DAN HODGES: Will <b>Keir Starmer</b> get a bloody nose thanks to a conflict raging 2,500 miles away?",
        "description": "A dingy used-car auction garage on Crawford Street in Rochdale doesn&#39;t exactly feel like it&#39;s at the epicentre of a game-changing electoral crusade."
    },
    {
        "url": "https://www.cityam.com/rishi-sunak-earned-2-2m-and-paid-508000-in-tax-documents-show/",
        "title": "Rishi Sunak earned £2.2m and paid £508,000 in tax, documents show",
        "description": "Rishi Sunak has published his tax documents, showing that he paid more than £500,000 in UK tax last year, as his total income rose to £2.2m."
    },
    {
        "url": "https://inews.co.uk/news/energy-drinks-addictive-high-sugar-ban-2900474?ico=most_popular",
        "title": "High-sugar energy drinks ‘addictive as cocaine’ but ban won’t work expert warns",
        "description": "Consumption of energy drinks can have an impact on a child&#39;s blood pressure, heart rate, sleep, anxiety, and mood, experts have said"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68261445",
        "title": "Kuenssberg: Are the politics of climate change going out of fashion?",
        "description": "One climate leader points to the package for cleaner steel at Port Talbot, or new laws on electric vehicles, for example, but adds that the government is &quot;green hushing&quot; - taking action but playing it down because &quot;they don&#39;t want any coverage of it&quot;."
    },
    {
        "url": "https://inews.co.uk/opinion/tories-paying-price-rishi-the-robot-2899206",
        "title": "The Tories are paying the price for Rishi the robot",
        "description": "This wasn’t supposed to be the difficult week for Rishi Sunak. Next week there will be two by-elections in seats vacated by Conservatives, and possibly bad inflation figures, both of which could lead to more unrest in all wings of the Conservative Party."
    },
    {
        "url": "https://www.independent.co.uk/politics/rishi-sunak-trans-brianna-ghey-by-election-tory-b2494034.html",
        "title": "Rishi Sunak braces for testing week of by-elections and economic woe after trans row",
        "description": "Party unity and the Conservative’s electoral prospects are under threat as two bruising by-elections and grim economic forecasts loom"
    },
    {
        "url": "https://www.thenational.scot/news/24111355.new-lords-include-tory-donors-msp-youngest-ever-life-peer/",
        "title": "New Lords include Tory donors, MSP and youngest ever life peer",
        "description": "Sir <b>Keir Starmer</b> recently U-turned on a pledge to replace the upper chamber of the Westminster parliament in the first five years after taking power. The list also includes one new Plaid Cymru peer – and at the age of 27 Carmen Smith will become the ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/starmer-faces-rising-criticism-over-plans-drop-28-billion-green-investment-pledge-1723326",
        "title": "<b>Starmer</b> Faces Rising Criticism Over Plans To Drop £28 Billion Green Investment Pledge",
        "description": "Starmer is expected to argue that it will not affect specific pledges on improving home energy efficiency and decarbonising the national grid by 2030."
    },
    {
        "url": "https://www.fool.co.uk/2024/02/10/barratt-buys-redrow-is-this-a-once-in-a-decade-chance-to-buy-cheap-shares/",
        "title": "Barratt buys Redrow: is this a once-in-a-decade chance to buy cheap shares?",
        "description": "That’s a fair chunk of time for the housing crisis to worsen and even for politicians to wade in. <b>Keir Starmer</b> has already spoken of “getting Britain building again”. In short, this takeover has plenty of hurdles to clear. I think the markets agree."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/mp-tells-of-homophobic-death-threat-and-self-doubt-before-suicide-attempt-110249/",
        "title": "MP tells of homophobic death threat and self-doubt before suicide attempt",
        "description": "Conservative MP Elliot Colburn this week shared his emotional experience of an attempt to take his own life at Prime Minister’s Questions."
    },
    {
        "url": "https://metro.co.uk/2024/02/10/rishi-sunak-earned-2-200-000-last-year-paid-tax-rate-a-teacher-20256464/?ico=trending-post-strip_item_4",
        "title": "Rishi Sunak earned £2,200,000 last year but paid same tax rate as a teacher",
        "description": "Labour leader Sir <b>Keir Starmer</b> is expected to follow Mr Sunak’s example by publishing his tax return. Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-says-spring-step-110724333.html",
        "title": "Rishi Sunak says he has ‘spring in my step’ after Labour’s £28m net-zero climbdown",
        "description": "The climbdown had been widely anticipated as officials urged the Labour leader <b>Keir Starmer</b> to reconsider the 2021 pledge due to tight borrowing conditions and inflated spending costs. The prime minister has now claimed that the opposition’s flagship pol ..."
    }
]