[
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-vows-to-continue-to-confront-difficult-challenges-as-parliament-returns-107471/",
        "title": "Sunak vows to ‘continue to confront difficult challenges’ as Parliament returns",
        "description": "A Downing Street source said the Prime Minister was determined to ‘not take the easy way out’ in a year that is likely to see a general election."
    },
    {
        "url": "https://www.heraldscotland.com/news/24033172.keir-starmer-says-worrying-children-keeps-night/?ref=rss",
        "title": "<b>Keir Starmer</b> says worrying about his children keeps him up at night",
        "description": "Keir Starmer has said he loses sleep worrying about the impact of his job on his two teenage children as his party prepares for government."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1852980/sir-keir-starmer-goalkeeper-london",
        "title": "Sir <b>Keir Starmer</b> suffers humiliation as he&#39;s crushed during heavy football defeat",
        "description": "Starmer and his London-based team were defeated 14-8 during the match, which saw him ship two goals while playing between the sticks."
    },
    {
        "url": "https://news.stv.tv/politics/keir-starmer-kept-up-at-night-worrying-about-impact-being-labour-leader-has-on-his-family",
        "title": "<b>Keir Starmer</b> kept up at night worrying about job’s impact on his family",
        "description": "The Labour leader said he wants to &#39;desperately try to protect&#39; his two teenage children and keep them out of the public eye."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24032803.sir-keir-starmer-kept-night-worrying-jobs-impact-family/",
        "title": "Sir <b>Keir Starmer</b> kept up at night worrying about job’s impact on his family",
        "description": "Sir <b>Keir Starmer</b> said he is kept up at night worrying about the impact of his job on his family. As the general election approaches, Sir <b>Keir</b> said he wants to “desperately try to protect” his two teenage children and keep them out of the public eye."
    },
    {
        "url": "https://www.thesun.co.uk/news/25279098/trevor-kavanagh-keir-starmer-loophole-journalism/",
        "title": "<b>Keir Starmer</b> must never be forgiven for using a spurious medieval loophole to put investigative journalism in the dock",
        "description": "SIR <b>Keir Starmer</b> has called on Scotland Yard to probe sex abuse claims against Prince Andrew. Many will agree the Duke of York has questions to answer about his relationship with billionaire paedophile Jeffrey Epstein and allegations of under-age sex orgies."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/parliament-keir-starmer-prime-minister-mps-downing-street-b1130806.html",
        "title": "Sunak vows to ‘continue to confront difficult challenges’ as Parliament returns",
        "description": "A Downing Street source said the Prime Minister was determined to ‘not take the easy way out’ in a year that is likely to see a general election."
    },
    {
        "url": "https://www.counterfire.org/article/war-crimes-and-genocide-deafening-silence-and-double-standards-weekly-briefing/",
        "title": "War crimes and genocide: deafening silence and double standards – weekly briefing",
        "description": "Lindsey German on the ongoing imperialist onslaught and the junior doctors at home How much longer is our government going to collude with the genocide going on in Palestine?"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/snow-hit-amid-uk-minus-31828312",
        "title": "Where snow will hit and when amid UK minus 4C temperatures shown in new weather maps",
        "description": "The amber health alert, which covers the North West, West and East Midlands, and South West England, has been issued as cold weather increases the risks of heart attacks, strokes and chest infections"
    },
    {
        "url": "https://morningstaronline.co.uk/article/h-online-only-cp-statement",
        "title": "Communists welcome ongoing mass protests against Sunak and <b>Starmer</b>&#39;s moral bankruptcy on Gaza",
        "description": "THE Communist Party of Britain have welcomed the ongoing mass protests against the moral bankruptcy of politicians, including Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer, who refuse to condemn Israeli war crimes in Gaza."
    },
    {
        "url": "https://www.thesun.co.uk/news/25278920/rishi-sunak-keir-starmer-no-plan-general-election/",
        "title": "Rishi Sunak slams <b>Keir Starmer</b> as having ‘no plan’ as he kicks off months of general election campaigning",
        "description": "RISHI Sunak will today warn Britain to “stick to the plan” as he kicks off months of general election campaigning. The PM will say Labour leader Sir Keir Starmer will “go back to square one”, with"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12936517/Still-think-youre-safe-pair-hands-Sir-Keir-Labour-leaders-goalkeeping-skills-leave-lot-desired-defends-pledge-spend-28-billion-year-green-initiatives.html",
        "title": "Still think you&#39;re a safe pair of hands, Sir <b>Keir</b>? The Labour leader&#39;s goalkeeping skills leave a lot to be desired after he defends his pledge to spend £28 billion a year on ...",
        "description": "&#39;If they want that fight on borrow to invest, I&#39;m absolutely up for that.&#39; But Tory party chairman Richard Holden said last night: &#39;This morning Sir Keir Starmer recommitted to his 2030 energy promise and acknowledged it requires government spending to deliver. Labour&#39;s own costing of this promise is £28billion every year."
    },
    {
        "url": "https://www.ft.com/content/204be24d-c66b-435f-85e6-2cd1e826cb3a",
        "title": "Politics class: Rishi Sunak seeks to harvest political advantage with autumn poll strategy",
        "description": "Read our full range of politics picks here. AQA Component 1, Section 3.1.2.3: Political parties: factors affecting electoral outcomes Edexcel Component 1, Section 2.4: UK political parties in context: various factors that affect party success Rishi Sunak has given a strong indication that the general election will be in the second half of 2024."
    },
    {
        "url": "https://www.itv.com/news/2024-01-07/amber-cold-warning-what-does-it-mean-and-where-does-it-cover",
        "title": "Amber cold warning: What does it mean, where does it cover, and how could it impact your health?",
        "description": "An amber cold health alert has been issued for parts of England throughout the week as temperatures are set to plummet. | ITV National News"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12936325/ANDREW-PIERCE-David-Cameron-hoping-Donald-Trump-beaten-one-presidential-rivals-revealed-former-Prime-Minister-told-ministers-GOP-frontrunner.html",
        "title": "ANDREW PIERCE: David Cameron may be hoping Donald Trump will be beaten by one of his presidential rivals after it is revealed the former Prime Minister told his ministers to ...",
        "description": "Lord Cameron&#39;s surprise return to frontline politics as Foreign Secretary has raised many an eyebrow, given his litany of diplomatic errors."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/07/tube-strikes-sadiq-khan-labour-boris-johnson/",
        "title": "Khan caves in to unions over TfL strikes in &#39;foretaste&#39; of Labour government",
        "description": "Sadiq Khan on Sunday night bowed to rail unions by offering a bumper pay deal to avoid London Underground strikes in what Boris Johnson said gave a “foretaste” of life under a Labour government."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11760312/snp-government-international-offices-wont-close-labour-keir-starmer/",
        "title": "SNP Government’s international offices are safe if Labour win Election as <b>Keir Starmer</b> promises not to close them",
        "description": "KEIR Starmer will not close the SNP Government’s international offices in a clear break from Tory threats to effectively axe the overseas hubs, it has emrerged. David Cameron told SNP ministers"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/07/rishi-sunak-says-he-wants-to-cut-workers-taxes-this-year-and-may-reduce-benefits?ref=biztoc.com",
        "title": "Sunak says he wants to reduce workers’ taxes this year and may cut benefits",
        "description": "PM sets up possibility of income tax coming down in March and says control of welfare is a priority"
    },
    {
        "url": "https://news.sky.com/video/drawing-up-the-battle-lines-at-the-start-of-an-election-year-13043778",
        "title": "Drawing up the battle lines at the start of an election year",
        "description": "Drawing up the battle lines at the start of an election year The two candidates for Prime Minister, Rishi Sunak and Sir <b>Keir Starmer</b>, have been outlining the policies they think will win them victory in an election."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/07/ministers-call-former-post-office-chief-exec-lose-cbe/",
        "title": "Ministers call for former Post Office chief exec to lose CBE",
        "description": "Rishi Sunak is under pressure to intervene in the Post Office honours row as a petition calling for the former chief executive to lose her CBE approaches one million signatures."
    },
    {
        "url": "https://www.channel4.com/news/sunak-hints-at-further-tax-cuts",
        "title": "Sunak hints at further tax cuts",
        "description": "Today things got a bit more personal, as Sir Keir Starmer accused the Prime Minister of putting vanity before the country by declining to set a date for the vote."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/most-memorable-moments-caught-camera-28337158",
        "title": "Most memorable moments caught on camera in 2023",
        "description": "A number of memorable moments were caught on camera in 2023. The ECHO has made a compilation of some of the most shocking moments that were filmed last year. From Eurovision to shocking CCTV footage, they are here in this compilation for you to relive."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/uk-weather-snow-forecast-met-office-b2474652.html",
        "title": "UK weather: Snow and ice as temperatures plunge below freezing in week-long cold snap",
        "description": "Britons can expect an overnight freeze on Sunday, forecasters have said. with temperatures dropping as low as -4C in parts of the country. Sleet and snow showers are due on Monday, with temperatures during the day struggling to get above 4C."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1853012/esther-rantzen-assisted-dying-petition",
        "title": "Esther Rantzen calls for people to back &#39;urgent&#39; assisted dying petition",
        "description": "Dame Esther Rantzen today issues an impassioned plea to legalise assisted dying in Britain, saying: &quot;For patients like me, it is urgent.&quot;"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-rishi-sunak-government-keir-starmer-laura-kuenssberg-b1130753.html",
        "title": "Welfare reforms to fund pre-election tax cuts about ‘fairness’, Sunak suggests",
        "description": "The Prime Minister said Britain’s welfare system ‘is not working’ and that he wants to ensure ‘everybody who can work does work’."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/tories-accused-of-caving-by-picking-partner-of-disgraced-ex-mp-for-by-election-107464/",
        "title": "Tories accused of ‘caving’ by picking partner of disgraced ex-MP for by-election",
        "description": "Peter Bone had reportedly threatened to stand against the Tories if Helen Harrison was not selected in Wellingborough."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-spending-plans-drive-britain-213000851.html",
        "title": "<b>Starmer</b>’s spending plans would drive Britain to the brink of disaster",
        "description": "And in this respect at least, <b>Keir Starmer</b> is ahead of the game. For the one way in which he has shown his party to be a Labour government in waiting is he already presides over a fiscal mess. In opposition, the mess is merely an embarrassment, but in ..."
    },
    {
        "url": "https://www.theguardian.com/business/2024/jan/07/talk-of-labours-unexploded-tax-bombshell-is-wearing",
        "title": "Forget talk of Labour’s ‘tax bombshell’. It’s Tory policy that needs a watchful eye",
        "description": "Can Labour under <b>Keir Starmer</b> be trusted to do better? At the start of yet another crunch year in British politics, Rishi Sunak will be hoping the latter question resonates with voters, as the Tory election machine revs up to cast “Slippery <b>Starmer</b>” as ..."
    }
]