[
    {
        "url": "https://uk.news.yahoo.com/letters-bbc-expect-yet-more-000100378.html",
        "title": "Letters: How can the BBC expect yet more cash from hard-pressed taxpayers?",
        "description": "SIR – Sir <b>Keir Starmer</b>’s praise of Thatcherite ideals (report, December 4) is a last-ditch attempt to make it look like the Labour Party has moved on to the unoccupied political middle ground. The big difference between Sir <b>Keir</b> and Tony Blair is that ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12825315/Tories-election-war-footing-possible-spring-election-despite-party-popular-Liz-Truss.html",
        "title": "Tories on election &#39;war footing&#39; for a possible spring election... despite the party being even less popular now than it was under Liz Truss",
        "description": "Richard Holden insisted that victory ‘is really within our grasp’ as he said voters would come to see that Rishi Sunak is on their side, compared with ‘slippery’ Sir <b>Keir Starmer</b>. But, before a crackdown was announced by Home Secretary James ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/sunak-suffers-first-commons-defeat-as-mps-vote-for-infected-blood-compensation-body/",
        "title": "Sunak suffers first Commons defeat as MPs vote for infected blood compensation body",
        "description": "Rishi Sunak has suffered his first defeat in the House of Commons since becoming prime minister, as MPs voted to establish a compensatory body for victims of the infected blood scandal."
    },
    {
        "url": "https://www.express.co.uk/comment/columnists/leo-mckinstry/1842091/sir-keir-starmer-labour-economics",
        "title": "Sir <b>Keir Starmer</b> deceives with his &#39;safe, centrist&#39; illusion, says Leo McKinstry",
        "description": "Sir <b>Keir Starmer</b> is stepping up his campaign to present himself as a safe, centrist leader who can be trusted with our economy and national defences. It is a remarkable exercise in political reinvention by the former radical lawyer. At the last general ..."
    },
    {
        "url": "https://www.denbighshirefreepress.co.uk/news/national/23967159.labours-28bn-green-plans-subject-fiscal-rules-says-starmer/",
        "title": "Labour’s £28bn green plans subject to fiscal rules, says <b>Starmer</b>",
        "description": "Sir Keir Starmer used a speech to warn that a Labour administration will not be able to ‘turn on the spending taps’."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/james-cleverly-commons-migration-plan_uk_656e0c6ee4b0dcfcc980e43d?d_id=6954539&ncid_tag=fcbklnkukhpmg00000008",
        "title": "Laughter In The Commons As James Cleverly Hails &#39;Great&#39; Tory Government",
        "description": "It has echoes of an idea put forward by <b>Keir Starmer</b> last week, who said he would “scrap” what he called a “perverse wage cutting policy”. In the Commons, Cleverly appeared to mock Labour’s “great idea”. He told MPs: “We have put forward ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/04/a-good-idea-keir-starmer-praise-margaret-thatcher-19924201/?ico=metro-posts_working-metro_whats-trending-now",
        "title": "Was it a good idea for <b>Keir Starmer</b> to praise Margaret Thatcher?",
        "description": "In today’s MetroTalk readers have been left questioning who exactly the Labour leader stands for…(Maja Smiejkowska/PA Wire) The answer seems to be a unanimous ‘no’ from our readers. Cautious he might be, but who exactly was the Labour leader ..."
    },
    {
        "url": "https://www.thenational.scot/news/23967211.keir-starmer-denies-taking-uk-thatcherite-future/",
        "title": "<b>Keir Starmer</b> denies he&#39;s taking UK to &#39;Thatcherite future&#39;",
        "description": "KEIR Starmer has denied he will take the country towards a “Thatcherite future” – as he insisted has “not in the business of"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-prevented-shadow-cabinet-210734053.html",
        "title": "<b>Keir Starmer</b> prevented a shadow cabinet minister from criticising Thatcher",
        "description": "<b>KEIR Starmer</b>’s team of advisors prevented a shadow cabinet minister from criticising Margaret Thatcher. In an exclusive by the Independent, it was revealed that Sam Tarry – then the shadow minister for transport – was prevented from attacking ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2023/12/keir-starmer-praise-margaret-thatcher",
        "title": "It only gets worse for Rishi Sunak",
        "description": "“Margaret Thatcher sought to drag Britain out of its stupor by setting loose our natural entrepreneurialism. Tony Blair reimagined a stale, outdated Labour Party into one that could seize the optimism of the late 1990s. A century ago, Clement Attlee wrote that Labour must be a party of duty and patriotism, not abstract theory.”"
    },
    {
        "url": "https://www.politicshome.com/news/article/keir-starmer-says-labour-government-bring-new-era-obsession-growth",
        "title": "<b>Keir Starmer</b> Says Labour Would Bring In &quot;New Era&quot; Of &quot;Obsession&quot; With Growth",
        "description": "Labour leader Keir Starmer has said that Britain is now in a “new era” that needs a “new economic consensus” with an “obsession” for growth and"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1841979/keir-starmer-eu-closer-ties-brexit",
        "title": "&#39;He just wants to rejoin!&#39; <b>Keir Starmer</b> promises even closer ties to the EU when he is PM",
        "description": "EXCLUSIVE: Tory MPs have warned that Sir Keir Starmer&#39;s secret plot to rejoin the EU has been exposed at a speech in London today."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/boris-johnson-what-he-said-about-the-big-covid-scandals-during-pandemic-171838909.html",
        "title": "Boris Johnson: What he said about the big COVID scandals during pandemic",
        "description": "He remained defiant as Labour leader Sir <b>Keir Starmer</b> grilled him on 1 December, 2021, about a Christmas party in Downing Street, telling MPs: &quot;What I can tell the right honourable gentleman is that all guidance was followed completely in No 10.&quot;"
    },
    {
        "url": "https://www.thenational.scot/news/23965984.labour-say-keir-starmer-conviction-politician-like-thatcher/",
        "title": "<b>Keir Starmer</b> is &#39;conviction politician&#39; like Margaret Thatcher, say Labour",
        "description": "LABOUR have insisted Keir Starmer is a “conviction politician” like Margaret Thatcher as he faces criticism for his praise for the former"
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-to-promise-better-bargain-for-uk-in-major-economic-speech-13022572?dcmp=snt-sf-twitter",
        "title": "Sir <b>Keir Starmer</b> to promise &#39;better bargain&#39; for UK in major economic speech",
        "description": "The Labour leader will declare that economic growth will be the party&#39;s &quot;obsession&quot; and that it will have to be &quot;ruthless&quot; with prudent spending."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/keir-starmer-isnt-for-turning-on-the-taps/",
        "title": "<b>Keir Starmer</b> isn’t for turning on the taps",
        "description": "Fresh from praising Margaret Thatcher, Keir Starmer today delivers a major speech in which he’ll warn a Labour government would not “turn on the spending taps.” In his first major economic pronouncement since the autumn statement,"
    },
    {
        "url": "https://www.thesun.co.uk/news/24947523/eu-silver-bullet-uk-economy-keir-starmer/",
        "title": "EU is not a ‘silver bullet’ to save Britain’s economy, says Sir <b>Keir Starmer</b>",
        "description": "THE EU isn’t a “silver bullet” to save Britain’s economy, Sir Keir Starmer said yesterday. In a speech in London the Labour chief insisted it would be a “mistake” to blame Britain’s cost of living"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/04/sir-keir-starmer-labour-may-not-meet-green-pledge/",
        "title": "<b>Starmer</b> suggests Labour may not meet flagship £28bn green pledge in first five years",
        "description": "Leader says plan to spend vast sum on clean energy projects will only happen if economic growth is strong enough"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12825019/stephen-glover-Keir-Starmer-Tory-Margaret-Thatcher.html",
        "title": "STEPHEN GLOVER: <b>Keir Starmer</b> is desperate to cosy up to Tory-inclined voters. That&#39;s why his clumsy embrace of Margaret Thatcher this week is just cynical nonsense",
        "description": "Strong stuff. He concluded by &#39;extending the hand of friendship&#39; to Tories everywhere. There are two ways to test whether Sir <b>Keir Starmer</b> was being sincere - or calculatingly cynical. The first is to examine whether he has ever shown any fondness for the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-67608097?at_medium=RSS&at_campaign=KARANGA",
        "title": "Labour won&#39;t turn on spending taps, says <b>Starmer</b>",
        "description": "In June, shadow chancellor Rachel Reeves said the £28bn pledge would not be met at the beginning of a Labour term of government. A senior source in the Labour leader&#39;s office said the decision was made because of the state of the public finances."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/04/keir-starmer-economic-stagnation-political-extremism-labour",
        "title": "Public spending is not the only lever Labour can pull, says <b>Starmer</b>",
        "description": "Labour leader refuses to rule out keeping planned cuts to government departments if he wins power"
    },
    {
        "url": "https://www.politico.eu/article/ranked-europe-most-rizz-politicians/",
        "title": "Europe’s most ‘rizz’ politicians, ranked",
        "description": "She may not have the rizz of a Barack Obama (10/10 rizz), but Metsola is the EU’s most rizz president. Sure, European Commission chief Ursula von der Leyen has a certain star quality, but she loses points for her anti-wolf crusade."
    },
    {
        "url": "https://www.ft.com/content/68d79c63-8823-4610-a136-6845c5bc5a94",
        "title": "Labour leaves open prospect of cuts to public sector after election",
        "description": "The UK economy is suffering from a “sprained ankle” rather than a broken leg, chancellor Jeremy Hunt said on Monday as he sought to play up the country’s strengths, including technological innovation and education."
    },
    {
        "url": "https://uk.movies.yahoo.com/knew-mrs-thatcher-starmer-no-185128471.html",
        "title": "I knew the Iron Lady – <b>Starmer</b> is no Thatcher",
        "description": "In our sister paper on Sunday, Sir Keir Starmer wrote, “Margaret Thatcher sought to drag Britain out of its stupor by setting loose our natural entrepreneurism”."
    },
    {
        "url": "https://www.thenational.scot/news/23967645.billboard-scottish-town-slams-keir-starmer-blair-disguise/",
        "title": "Billboard in Scottish town slams <b>Keir Starmer</b> as Blair in disguise",
        "description": "A BILLBOARD depicting Keir Starmer as Tony Blair in disguise in a Scooby Doo-style parody has appeared in a Scottish town."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/04/the-broken-state-of-uk-economy-is-clear-hunt-and-starmer-solutions-are-less-so?ref=biztoc.com",
        "title": "The broken state of UK economy is clear; Hunt and <b>Starmer</b>’s solutions are less so",
        "description": "Resolution Foundation report underlines lack of progress by Tories but Labour proposals seem woolly"
    },
    {
        "url": "https://morningstaronline.co.uk/article/b/starmer-offers-more-austerity-pain-for-britain",
        "title": "<b>Starmer</b> offers more austerity pain for Britain",
        "description": "AUSTERITY is Labour’s economic agenda, Sir Keir Starmer announced today in a further lurch to the right. A Labour government will not “turn on the spending taps,” the Labour leader said in remarks aimed at appeasing the City and the Treasury."
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-claim-nhs-not-safe-under-westminster-control-as-uk-government-unveil-plans-to-slash-net-migration-4433501",
        "title": "SNP claim NHS ‘not safe’ under Westminster control as UK Government unveil plans to slash net migration",
        "description": "The SNP have warned the NHS is “not safe” after the UK Government unveiled plans to slash net migration. “Failure on the immigration system and failure on the economy – it is another example of the total chaos at the heart of this Government."
    },
    {
        "url": "https://news.sky.com/story/keir-starmers-economic-plan-risks-him-looking-more-like-a-david-cameron-tribute-act-than-an-heir-to-blair-13022984",
        "title": "<b>Keir Starmer</b>&#39;s economic plan risks him looking more like a David Cameron tribute act than an heir to Blair",
        "description": "Starmer said his economic plan would be a &quot;hard path to walk&quot; given the state of the fiscal situation he will inherit if he wins the next election. But will pinning everything on economic growth allow him to avoid making cuts to public spending?"
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-speech-fact-check-policy-labour-gcb7dgmjh",
        "title": "<b>Keir Starmer</b> speech: How would Labour fund its policies?",
        "description": "Sir Keir Starmer may have pledged that Labour will not “turn on the spending taps” if it wins the next election but the party still has an ambitious package of policy pledges — of which not all have a"
    },
    {
        "url": "https://metro.co.uk/2023/12/04/a-good-idea-keir-starmer-praise-margaret-thatcher-19924201/?ico=metro-posts_housing_whats-trending-now",
        "title": "Was it a good idea for <b>Keir Starmer</b> to praise Margaret Thatcher?",
        "description": "Kissinger a peace maker? The guy was a political wheeler-dealer who would call for ceasefires and peace treaties to get the US out of sticky situations in foreign lands and save face and to hell with the dangers to the natives left behind. Peter, Birmingham"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-67616563",
        "title": "Margaret Thatcher&#39;s legacy not celebrated in Wales - Drakeford",
        "description": "First Minister Mark Drakeford has declined to repeat Sir <b>Keir Starmer</b>&#39;s praise for Margaret Thatcher. In a newspaper article, Sir <b>Keir</b> credited the late Conservative prime minister for effecting &quot;meaningful change&quot; and for setting loose Britain&#39;s &quot;natural ..."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-to-promise-better-bargain-for-uk-in-major-economic-speech-13022572",
        "title": "<b>Starmer</b> says he is not in &#39;business&#39; of spending cuts - but does not explicitly rule them out",
        "description": "The Labour leader said economic growth will be the party&#39;s &quot;obsession&quot; and that it will have to be &quot;ruthless&quot; with prudent spending."
    },
    {
        "url": "https://thebristolcable.org/2023/12/its-time-for-bristol-open-safer-drug-consumption-facility-overdose-prevention-centre/",
        "title": "Scotland has opened the UK’s first safer drug consumption facility – Bristol should be next",
        "description": "Glasgow, where the UK drug death crisis is worst, has opened a life-saving overdose prevention centre. What does this mean for other cities?"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23967324.establishments-interests-safe-hands-labour-snp/",
        "title": "Establishment&#39;s interests safe in hands of Labour and SNP",
        "description": "There&#39;s a view prevalent in some sections of the wider Yes movement that MI5 spooks have been active within the SNP for many years. It"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/jeremy-hunt-uk-economy-brexit-b2458042.html",
        "title": "Jeremy Hunt blames Brexit for years of turmoil",
        "description": "Britain’s economy may be suffering from a “sprained ankle”, chancellor Jeremy Hunt has suggested – as he rejected the diagnosis of a “broken leg”. His comments came during an appearance at the Resolution Foundation conference, as the influential think tank published a report revealing the huge scale of Britain’s economic problems."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-speech-latest-news-labour-economy-resolution-foundation-rgpf9ldst?ilc=timesradio:morefromthetimes",
        "title": "<b>Keir Starmer</b> speech: Labour will stop UK ‘going backwards’",
        "description": "Sir Keir Starmer has laid out his economic plans for government as he vows not to “turn on the spending taps” if Labour is elected. In a speech at the Resolution Foundation, an independent think tank,"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/blueprint-for-ending-economic-stagnation-has-a-glaring-omission/",
        "title": "Blueprint for ending economic stagnation has a glaring omission",
        "description": "If you want a sensible document with some interesting and well-reasoned ideas for what we ought to do about the UK economy (and some brilliant charts), you could hardly do better than read the Resolution Foundation&#39;s book/report on the topic,"
    },
    {
        "url": "https://www.heraldscotland.com/news/23967343.keir-starmer-defends-praise-margaret-thatcher/",
        "title": "<b>Keir Starmer</b> defends praise for Margaret Thatcher",
        "description": "Sir Keir Starmer has defended his praise of Margaret Thatcher, insisting that acknowledging her “driving sense of purpose” is not the same"
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/money/pensions-and-retirement/threat-pension-triple-lock-sunak-starmer-2790463?ico=in-line_link",
        "title": "Threat to pensions triple lock grows amid Sunak and <b>Starmer</b> ‘standoff’",
        "description": "The Conservatives and Labour are &#39;each waiting for the other to blink&#39; when it comes to their policy on the triple lock, says an ex-minister"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-insists-doesnt-agree-31595543",
        "title": "<b>Keir Starmer</b> insists he doesn&#39;t agree with what Margaret Thatcher did in bid to defuse row",
        "description": "Labour leader Keir Starmer sparked a row by hailing the divisive Tory PM Margaret Thatcher for bringing about &#39;meaningful change&#39; and &#39;setting loose our natural entrepreneurialism&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/paying-thatchers-cruelty-starmer-thinking-2790117?ico=best_of_opinion",
        "title": "We’re still paying for Thatcher’s cruelty – what was <b>Starmer</b> thinking?",
        "description": "<b>Keir Starmer</b>’s praise of Margaret Thatcher in The Sunday Telegraph, in which he credited Thatcher with delivering “meaningful change”, “to drag Britain out of its stupor by setting loose our natural entrepreneurialism” has caused upset in Labour ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-defends-praise-margaret-193329882.html",
        "title": "<b>Keir Starmer</b> defends praise for Margaret Thatcher: ‘She had a mission’",
        "description": "Sir <b>Keir Starmer</b> has defended his praise for Margaret Thatcher in a Daily Telegraph article over the weekend. Taking questions from reporters on Monday 4 December, the Labour leader said he was simply trying to distinguish between post-war prime ministers ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/knew-mrs-thatcher-starmer-no-185128471.html",
        "title": "I knew Mrs Thatcher – <b>Starmer</b> is no Thatcher",
        "description": "In our sister paper on Sunday, Sir <b>Keir Starmer</b> wrote, “Margaret Thatcher sought to drag Britain out of its stupor by setting loose our natural entrepreneurism”. The praise was hardly effusive, but it has provoked angry reactions from the Labour Left ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/04/rishi-sunak-news-latest-bbc-tv-licence-fee-keir-starmer/?utmsource=email",
        "title": "As it happened: James Cleverly rejects calls to put a cap on migrant numbers",
        "description": "Sir <b>Keir Starmer</b> was asked by The Telegraph’s Nick Gutteridge whether, if growth is slower than expected, the £28bn in green investment is a figure that might never be actually reached. “We will ramp up to that and get to that in the second half of ..."
    },
    {
        "url": "https://www.ft.com/content/2798044d-f290-4356-b968-91ce3ea70308",
        "title": "Labour to discuss agenda for government with civil service within weeks",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Labour party leader Sir <b>Keir Starmer</b> is expected to ask UK Prime Minister Rishi Sunak within weeks for permission to start formal talks with the civil service about ..."
    },
    {
        "url": "https://uk.yahoo.com/news/sunak-now-polling-worse-truss-114707010.html",
        "title": "Sunak Now Polling Worse Than Truss With Key UK Voters",
        "description": "The report will pile pressure on Sunak, who has failed to close the gap with Labour leader <b>Keir Starmer</b>, leading to reports of increasing frustration in Downing Street and among senior ministers in the Cabinet. Sunak is due to make a decision on a new ..."
    },
    {
        "url": "https://www.standard.co.uk/news/londoners-diary/rishi-sunak-cabinet-ranking-keir-starmer-ten-pledges-dropped-b1124716.html",
        "title": "Rishi Sunak and <b>Keir Starmer</b> upset their party members",
        "description": "Prime Minister Rishi Sunak and leader of the opposition <b>Keir Starmer</b> are both testing the patience of their party memberships, it seems. A new survey of Conservative Party members, out last night, shows the PM hitting rock bottom with a minus 25 net ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/labour-s-ps28bn-green-plans-subject-to-fiscal-rules-says-starmer-b1124691.html",
        "title": "Labour’s £28bn green plans subject to fiscal rules, says <b>Starmer</b>",
        "description": "Sir <b>Keir Starmer</b> used a speech to warn that a Labour administration will not be able to ‘turn on the spending taps’. Sir <b>Keir Starmer</b> has insisted that Labour’s scaled-back pledge to spend £28 billion a year on green initiatives would be subject to ..."
    },
    {
        "url": "https://socialistworker.co.uk/features/starmers-speech-shows-labour-is-marching-ever-rightwards/",
        "title": "<b>Starmer</b>’s speech shows Labour is marching ever rightwards",
        "description": "Sir <b>Keir Starmer</b> has made it even more abundantly clear to the Labour left that his party is no place for them. He chose the right wing Sunday Telegraph newspaper last weekend, to applaud the brutal ruling class warrior Margaret Thatcher. “Margaret ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/keir-starmer-labour-tax-spending-policy-economy-b2458274.html",
        "title": "What do we know about Labour’s tax and spending plans?",
        "description": "Sir <b>Keir Starmer</b> has warned that an incoming Labour government would face “huge constraints” and would not be able to “turn on the spending taps.” In a speech to the Resolution Foundation conference, the Labour leader gave us a glimpse of his ..."
    },
    {
        "url": "https://www.channel4.com/news/uk-households-10-per-cent-poorer-than-in-france-resolution-foundation-says",
        "title": "UK households ’10 per cent poorer than in France’, Resolution Foundation says",
        "description": "The Labour leader Sir <b>Keir Starmer</b> has warned that the party won’t “quickly turn on the spending taps” if they win the next general election – insisting that economic growth must raise living standards in every community. His speech came as a ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-london-67616854.amp",
        "title": "Met Police investigates Enfield North MP&#39;s office vandalism",
        "description": "Hundreds of people protested outside Labour leader Sir <b>Keir Starmer</b>&#39;s constituency office in north London on 18 November, calling for a ceasefire. The CCTV image released by police shows someone with curly brown hair wearing a black hoodie and blue facemask."
    }
]