[
    {
        "url": "https://www.standard.co.uk/news/politics/government-opposition-party-keir-starmer-instagram-mps-b1137282.html",
        "title": "Labour urges ministers to close ‘glaring loopholes’ in knife crime plans",
        "description": "The party wants to see ninja swords included in a ban of dangerous weapons and tech bosses face criminal sanctions for allowing online knife sales."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-scrap-popular-labour-policies-2890921?ico=related_article_inline",
        "title": "Why does <b>Keir Starmer</b> want to scrap popular Labour policies?",
        "description": "The latest reported U-turn, on the pledge to spend £28bn a year on green investment, is the biggest yet. The policy was one of Labour’s most bold and genuinely interesting pledges. It was also popular: a poll last year found that 52 per cent of voters backed it, while only 30 per cent disagreed. But with boldness comes risk, and so it had to go."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/destroy-spa-pool-captain-tom-moores-daughter-new-video-game-20229238/?ico=metro-posts_home_whats-trending-now",
        "title": "Destroy the spa pool of Captain Tom Moore’s daughter in new Duke Smoochem video game mod",
        "description": "After previously depicting Labour leader <b>Keir Starmer</b> killing an alpaca, as well as George Osborne’s wedding, mod creator Dan Douglas has now tackled another UK event from the headlines. This time around he’s set his sights on Captain Sir Tom Moore’s ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-promises-patient-health-records-in-one-place-under-labour-j56bhnb72",
        "title": "<b>Keir Starmer</b> promises patient health records in one place under Labour",
        "description": "Sir Keir Starmer has pledged to introduce “patient passports” to provide a digital record of every patient’s health information if Labour wins the next election. The Times Health Commission proposed developing a single digital health record which patients could take with them wherever they are treated within the NHS."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/keir-starmer-out-touch-public-32043833",
        "title": "&#39;<b>Keir Starmer</b> is out of touch with the public if he wants to scrap a cap on bankers&#39; bonuses&#39;",
        "description": "In his regular column for the Daily Record, Stephen Flynn says the moral compass of too many MPs is firmly back stuck behind the walls of Westminster"
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/02/05/address-to-vigil-for-palestinian-health-workers-killed-in-gaza/",
        "title": "Address to Vigil for Palestinian Health Workers Killed in Gaza",
        "description": "Isn’t it strange that someone can be imprisoned for a lifetime under the Terrorism Act for supporting a proscribed organisation, but the leader of the Opposition, Sir <b>Keir Starmer</b>, can champion collective punishment? Who can ever forget that first ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/mum-ninja-sword-victim-ronan-32050627",
        "title": "Mum of ninja sword victim Ronan Kanda demands terrifying weapons are finally banned",
        "description": "Pooja Kanda, whose son Ronan was murdered in June 2022, wants a clampdown on websites selling blades online. Labour believes tech firm bosses should be held responsible"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/rishi-sunak-keir-starmer-hizb-ut-tahrir-proscribe-islam/",
        "title": "Sunak suggests <b>Starmer</b> ‘on side’ of Islamist group and ‘terrorist sympathiser’",
        "description": "Rishi Sunak has said Sir Keir Starmer was “on the side” of a major Islamist group and suggested he was a “terrorist sympathiser”. Asked whether he thought the Labour leade"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/king-charles-cancer-diagnosis-rishi-sunak-wishes-monarch-full-and-speedy-recovery/",
        "title": "King Charles cancer diagnosis: Rishi Sunak wishes monarch &#39;full and speedy recovery&#39;",
        "description": "Rishi Sunak has wished the King a speedy recovery after Buckingham Palace announced he was diagnosed with a form of cancer."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/king-charles-diagnosed-with-cancer-and-has-started-treatment-buckingham-palace-says/",
        "title": "King Charles diagnosed with cancer and has started treatment, Buckingham Palace says",
        "description": "Labour leader Sir <b>Keir Starmer</b> also issued a get well message to the head of state. King Charles cancer diagnosis: Prince Harry to travel to UK to see monarch &#39;in coming days&#39;&#39; The Duke of Sussex has spoken to the King about his cancer diagnosis and will ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/green-party-overtakes-tories-second-most-popular-voters-under-30-1723235",
        "title": "The Green Party Overtakes The Tories As The Second Most Popular For Voters Under 30",
        "description": "A YouGov poll revealed that for voters aged 18 to 24, the Green Party is nine per cent more popular than the Conservative Party and 12 per cent ahead of the Liberal Democrats."
    },
    {
        "url": "https://www.thesun.co.uk/sport/25741963/labour-keir-starmer-pie-snatcher-football/",
        "title": "Sir <b>Keir Starmer</b> branded ‘pie snatcher’ after warning football fans to watch what they eat",
        "description": "SIR Keir Starmer was branded a ‘pie snatcher’ after warning football fans to watch what they eat to help the beautiful game go green. The Labour chief says there are “little things”"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/the-longest-hour-piers-morgans-excruciating-interview-with-rishi-sunak?ref=biztoc.com",
        "title": "The longest hour: Piers Morgan’s excruciating ‘interview’ with Rishi Sunak",
        "description": "Prime minister joined UK Sun God for an exchange of awkward blokey bants, unbased claims and bonfire of vanities"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68208157",
        "title": "King Charles III diagnosed with cancer, Buckingham Palace says",
        "description": "King Charles has been diagnosed with a form of cancer, says Buckingham Palace. It is not prostate cancer, but was discovered during his recent treatment for an enlarged prostate. The type of cancer has not been revealed, but the palace said the King began &quot;regular treatments&quot; on Monday."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-king-and-pm-to-continue-weekly-audiences-as-concerned-biden-reveals-plans-to-call-12593360",
        "title": "Politics latest: King and PM to continue weekly audiences - as &#39;concerned&#39; Biden reveals plans to call",
        "description": "After hearing from the Labour and SNP leadership, we&#39;ve also had statements from other opposition parties about the King&#39;s health. Lib Dem leader Sir Ed Davey said his party joins &quot;the rest of the nation in wishing a full and quick recovery to His Majesty ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048479/Prince-Harry-London-King-Charles-Meghan-children-set-stay-LA-following-monarchs-cancer-diagnosis.html",
        "title": "Prince Harry will fly back to London to be by King Charles&#39; side TODAY but &#39;Meghan and children will stay in LA&#39; following monarch&#39;s cancer diagnosis",
        "description": "Labour leader Sir <b>Keir Starmer</b> tweeted: &#39;On behalf of the Labour Party, I wish His Majesty all the very best for his recovery. &#39;We look forward to seeing him back to swift full health.&#39; Commons Speaker Sir Lindsay Hoyle told MPs: &#39;I know the whole House ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12142470/rishi-sunak-king-charles-cancer-diagnosis/",
        "title": "Rishi Sunak wishes King Charles a ‘full and speedy recovery’ after his cancer diagnosis",
        "description": "RISHI Sunak wished the King “a full and speedy recovery” tonight. The Prime Minister said: “I have no doubt he’ll be back to full strength in no time and I know the whole"
    },
    {
        "url": "https://www.thetimes.co.uk/article/voters-back-expanding-sugar-tax-boost-healthy-living-times-health-commission-j6pmkwqck",
        "title": "Voters back wider sugar tax and measures to boost healthy living",
        "description": "Sir <b>Keir Starmer</b>, the Labour leader, has committed to adopting its key recommendation for digital “patient passports” that would allow seamless transfer of people’s health data across services, should his party win power. A further recommendation is ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24099467.king-diagnosed-cancer-palace-announces/",
        "title": "King diagnosed with cancer, Palace announces",
        "description": "The King has been diagnosed with a form of cancer, Buckingham Palace has announced. The Palace confirmed the disease, which is not prostate cancer, was discovered while the King was being treated in hospital for an enlarged prostate."
    },
    {
        "url": "https://uk.news.yahoo.com/watch-live-view-buckingham-palace-195817531.html",
        "title": "Watch live view of Buckingham Palace after King Charles cancer diagnosis announced",
        "description": "Watch a live view of Buckingham Palace on Monday 5 February following the announcement that King Charles III has been diagnosed with a form of cancer. The palace confirmed the disease, which is not prostate cancer,"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/rishi-sunak-out-of-touch-bet-rwanda-plan-labour?ref=biztoc.com",
        "title": "Sunak ‘out of touch’ for betting £1,000 on Rwanda plan’s success, says Labour",
        "description": "PM also criticised for saying ‘the facts speak for themselves’ when asked if Keir Starmer was a terrorist sympathiser"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/05/king-charles-cancer-type-diagnosis-treatment-william-harry/",
        "title": "King Charles has cancer: Everything we know so far",
        "description": "The monarch faces more treatment after the health issue was discovered while he was being treated for an enlarged prostate in hospital"
    },
    {
        "url": "https://metro.co.uk/2024/02/05/moment-bbc-broke-news-king-charles-cancer-diagnosis-20229721/?ico=trending-post-strip_item_1",
        "title": "The moment BBC broke news of King Charles’ cancer diagnosis",
        "description": "The Palace has not specified which cancer King Charles has been diagnosed with but confirmed it was not prostate cancer, while messages of support for the 75-year-old have been pouring in from leading figures including Sir <b>Keir Starmer</b> and Gary Lineker."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-news-treatment-b2490937.html?page=4",
        "title": "King Charles cancer - latest: Monarch steps back from public duties after diagnosis, Buckingham Palace says",
        "description": "Labour leader Sir <b>Keir Starmer</b> has wished the King &quot;all the very best for his recovery&quot; after he was diagnosed with a form of cancer. Sir <b>Keir</b> tweeted: &quot;On behalf of the Labour Party, I wish His Majesty all the very best for his recovery. &quot;We look forward ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/kate-garraway-shares-daughters-brave-final-words-to-derek-draper_uk_65c0fa2be4b0dbc806ad7435?d_id=7265481&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Kate Garraway Shares Daughter&#39;s &#39;Brave&#39; Final Words To Derek Draper",
        "description": "The17-year-old also helped carry her father’s coffin at Derek’s funeral on Friday 2 January, where former prime minister Sir Tony Blair, musician Sir Elton John and Labour leader Sir <b>Keir Starmer</b> were among the names in attendance. Kate shared ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-wishes-king-charles-200000690.html",
        "title": "Rishi Sunak wishes King Charles a &#39;full and speedy recovery&#39;",
        "description": "&quot;I have no doubt he’ll be back to full strength in no time and I know the whole country will be wishing him well.&quot; Sir <b>Keir Starmer</b>, the leader of the Labour Party, has also sent his best wishes to the monarch. The 61-year-old politician wrote on X ..."
    },
    {
        "url": "https://www.channel4.com/news/are-british-muslims-losing-faith-in-starmers-labour",
        "title": "Are British Muslims losing faith in <b>Starmer</b>’s Labour?",
        "description": "A new poll suggests that over a quarter fewer British Muslims would back Sir <b>Keir Starmer</b>’s Labour party. We have been visiting some constituencies where independents are now standing against Labour incumbents."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24099521.sunak-wishes-king-speedy-recovery-well-wishes-pour-politicians/",
        "title": "Sunak wishes King ‘speedy recovery’ as well wishes pour in from politicians",
        "description": "Well wishes for the King have poured in from across the political spectrum after Buckingham Palace announced he was diagnosed with a form of cancer. Charles has begun a schedule of regular treatments and has been advised to postpone his public-facing duties."
    },
    {
        "url": "https://inews.co.uk/news/khan-promises-wont-be-changes-ulez-2888930?ito=facebook_share_article-top",
        "title": "Sadiq Khan promises there won’t be any changes to Ulez scheme",
        "description": "Amid outcry from some of the newly included boroughs, Labour leader Sir <b>Keir Starmer</b> distanced himself from the London Mayor when Ulez was blamed for costing the party the Uxbridge by-election. But Mr Khan maintained that he and his party leader can agree ..."
    }
]