[
    {
        "url": "https://www.ibtimes.co.uk/labour-rush-find-alternative-asylum-plan-before-rwanda-flights-take-off-1722402",
        "title": "Labour Rush To Find Alternative Asylum Plan Before Rwanda Flights Take Off",
        "description": "While Rishi Sunak continues to push his emergency Rwanda Treaty, Keir Starmer is considering processing asylum applications from overseas."
    },
    {
        "url": "https://www.thenational.scot/politics/24013437.house-lords-represents-scotland-stands/",
        "title": "The House of Lords represents all that Scotland stands against",
        "description": "The National published an article by former SNP advisor Stephen Noon in which he argued that Yes supporters and"
    },
    {
        "url": "https://uk.news.yahoo.com/crowds-gather-traditional-boxing-day-180000592.html",
        "title": "Crowds gather for traditional Boxing Day hunt meets",
        "description": "Scores of people gathered to watch the traditional Boxing Day hunt meets in communities across the region. In Great Ayton, a huge crowd turned out to see the Cleveland Hunt on High Green. The traditional stirrup cup was served from the Royal Oak Hotel to those following the hounds."
    },
    {
        "url": "https://morningstaronline.co.uk/article/environmentalists-blast-sir-keir-reported-green-policy-u-turn",
        "title": "Environmentalists blast Sir <b>Keir</b>&#39;s reported green policy U-turn",
        "description": "In June, shadow chancellor Rachel Reeves announced a U-turn on pledges to spend £28bn a year until 2030 on projects to fulfil Labour’s green promises. In an attempt to prove “fiscal responsibility,” she instead suggested that Labour would “ramp up” investment over time, eventually reaching £28bn annually after 2027."
    },
    {
        "url": "https://inews.co.uk/opinion/labour-knows-big-mistake-immigration-2825966?ico=related_article_inline",
        "title": "Labour knows it made a big mistake on immigration",
        "description": "What a difference the prospect of a new year containing a general election makes. Labour’s asylum and immigration proposal is a prime example of a plan in a rapid phase of mutation, as Sir Keir Starmer prepares to outline his thinking on this thorny issue."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1849540/labour-plan-stop-boats",
        "title": "Labour&#39;s plan to stop the boats will be a gift to people traffickers, says Esther Krakue",
        "description": "Sir <b>Keir Starmer</b> has been one of the most vocal critics of the Government’s Rwanda scheme, labelling it “a gimmick” and a piece of “political performance art”. But after more than two years of sidestepping the issue, it must have suddenly dawned ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2023/12/27/in-pictures-royals-in-wales-and-the-hunt-began-for-a-new-first-minister-in-2023/",
        "title": "In Pictures: Royals in Wales and the hunt began for a new first minister in 2023",
        "description": "And in December, Welsh First Minister Mark Drakeford announced he is standing down as Labour leader, triggering the contest to find his successor. The 69-year-old politician, who has been Wales’ leader since December 2018, said he hoped his replacement could be in place before Easter 2024."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/south-wales-cardiff-keir-starmer-workers-princess-b1129228.html",
        "title": "In Pictures: Royals in Wales and the hunt began for a new first minister in 2023",
        "description": "And in December, Welsh First Minister Mark Drakeford announced he is standing down as Labour leader, triggering the contest to find his successor. The 69-year-old politician, who has been Wales’ leader since December 2018, said he hoped his replacement could be in place before Easter 2024."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/27/labour-dig-in-and-fight-for-your-green-pledges",
        "title": "Labour, dig in and fight for your green pledges",
        "description": "Letters: David Curtis, Neil Blackshaw and John Filby encourage Keir Starmer to hold fast, while David Reed suggests change won’t happen without cross-party agreement"
    },
    {
        "url": "https://inews.co.uk/news/local-councillors-developers-affordable-housing-2820338",
        "title": "The Yimbys tackling the affordable homes crisis by forcing developers to change",
        "description": "Local councillors are taking on developers in efforts to get vital affordable housing built amid an acute shortage."
    },
    {
        "url": "https://www.sharecast.com/news/political-news/uk-spring-budget-set-for-march-6-fuelling-election-speculation--15703246.html",
        "title": "UK spring Budget set for March 6, fuelling election speculation",
        "description": "Britain&#39;s spring budget statement will be delivered on March 6, the Treasury announced on Wednesday, amid suggestions the government may axe inheritance tax in an attempt to narrow a large opinion poll deficit ahead of a General Election which must be called by January 2025."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/27/jeremy-hunt-announces-6-march-as-date-for-spring-budget?ref=biztoc.com",
        "title": "Jeremy Hunt fuels election speculation as 6 March spring budget announced",
        "description": "Chancellor has asked the OBR to prepare forecasts for the economy and public finances to be presented to parliament"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/27/spring-budget-held-march-6-jeremy-hunt/",
        "title": "Spring Budget to be held on March 6",
        "description": "By holding the fiscal statement in early spring, there is more time for any tax cuts to be felt by voters ahead the next general election"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/inside-year-uk-politics-rishi-31744129.amp",
        "title": "Inside the year in UK politics: Rishi Sunak&#39;s gaffe-filled 2023 as Boris Johnson quits in a strop",
        "description": "After the unprecedented chaos of 2022, which saw Boris Johnson and Liz Truss brought down by their own failings, Rishi Sunak&#39;s efforts to steady the ship have repeatedly been tested"
    },
    {
        "url": "https://www.blackpoolgazette.co.uk/news/people/2023-in-review-a-look-back-at-what-dominated-the-headlines-from-a-devastating-war-to-a-growing-rift-between-the-sussexes-and-royals-4458616",
        "title": "2023 in review: A look back at what dominated the headlines from a devastating war to a growing rift between the Sussexes and Royals",
        "description": "A prime minister battling to turn round his party’s fortunes in the polls, economic gloom, industrial strife and a growing rift between the Sussexes and working royals have all characterised 2023."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12903643/Poll-voters-Tories-Labour-not-fit-run-country.html",
        "title": "A plague on both their houses: New poll finds voters don&#39;t think Tories OR Labour are fit to run the country with just 28 per cent giving backing to <b>Keir Starmer</b>&#39;s party ahead ...",
        "description": "While just 15 per cent of voters believe the Tories are fit to govern currently, only 28 per cent feel the same about the opposition. More than four in 10 say Labour are not worthy of government."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/spring-budget-jeremy-hunt-when-b2469935.html",
        "title": "Chancellor Jeremy Hunt announces date for 2024 Spring Budget",
        "description": "Chancellor Jeremy Hunt has announced the date for the 2024 spring Budget, as the Conservatives scramble to appease voters with tax cuts ahead of the upcoming general election."
    },
    {
        "url": "https://bmmagazine.co.uk/news/sunak-set-to-end-inheritance-tax-in-spring-ahead-of-election/",
        "title": "Sunak set to end inheritance tax in spring ahead of election",
        "description": "The government is considering axing inheritance tax in three months’ time in a pre-election giveaway to boost Rishi Sunak’s chances of victory."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/liverpool-council-boss-football-future-28318366",
        "title": "Liverpool Council boss on football, the future and fixing the city",
        "description": "Cllr Robinson spoke to the ECHO days after commissioners gave their latest verdict on progress at Liverpool Council. They heaped praise on the new council boss and chief executive Andrew Lewis for the speed of change since both men took the reigns. While this wasn’t lost on the council leader, he refused to get carried away."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1849388/Election-poll-Labour-Tories-weak-support",
        "title": "Boost for Tories as just 15 percent of voters say they are ‘certain’ to back Labour",
        "description": "Just 15 percent of Britons say they are “certain” to vote Labour, well below the 40 percent mark that the party consistently polls at. This means the Tories have a hope of eating into Labour support between now and the expected General Election in 2024."
    },
    {
        "url": "https://www.lse.co.uk/news/general-election-looms-for-uk-leaders-sunak-and-starmer-in-2024-rm8yho3t4bavbzw.html",
        "title": "General election looms for UK leaders Sunak and <b>Starmer</b> in 2024",
        "description": "The stakes for both Sunak and Keir Starmer are high: the general election expected in 2024 could see Labour return to power for the first time since 2010 or pave the way for a period of Tory rule lasting almost two decades."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/happy-betwixtmas-to-you-and-yours/",
        "title": "Happy Betwixtmas to you and yours",
        "description": "LONG READ HEAVEN: Betwixtmas is the perfect time to catch up on all those long reads everyone was talking about and which you pretended to have plowed through but secretly put on the backburner while you spent your commute doomscrolling X. Here’s Playbook’s baker’s dozen of the best (with lots of help from ace Playbook reporter Noah Keate)."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-must-end-war-hunting-060000935.html",
        "title": "<b>Starmer</b> must end the war on hunting",
        "description": "People from many walks of life turned out for the annual Boxing Day meets, a testament to the important role that hunts still play in rural areas today. Many remain angry at Tony Blair’s Hunting Act,"
    },
    {
        "url": "https://www.cityam.com/year-in-review-rogue-ministers-and-fiscal-headaches-how-did-sunak-do-in-2023-2/",
        "title": "Year in review: Rogue ministers and fiscal headaches, how did Sunak do in 2023?",
        "description": "As 2023 limps to an end, and Sunak nears the deadline for his &quot;five pledges&quot;, Eliot Wilson takes a look at the year that was in UK politics."
    },
    {
        "url": "https://www.ft.com/content/2726620e-b6e5-4547-b358-ff4fe175171e",
        "title": "Labour pledges to tighten right-to-buy as part of UK housing overhaul",
        "description": "Pennycook says new government would liberalise planning, reinstate council targets and release ‘lower-quality’ greenbelt"
    },
    {
        "url": "https://www.thenational.scot/politics/24012032.financial-markets-confidence-built-shifting-sands/",
        "title": "Financial markets’ confidence is built on shifting sands",
        "description": "SO goodbye 2023 and good riddance. But I doubt if 2024 will be any better. In fact, I suspect it’s going to be a lot worse. Let’s take a"
    },
    {
        "url": "https://www.theargus.co.uk/news/23997903.three-way-fight-looms-mid-sussex-ahead-election/",
        "title": "Three-way fight looms in Mid Sussex ahead of election",
        "description": "Today, we look at the newly redrawn Mid Sussex constituency, which has undergone a radical transformation due to boundary changes. East Grinstead, along with villages such as Scaynes Hill and West Hoathly, have broken away to form part of a new constituency, while Mid Sussex has expanded south to include Hassocks, Pyecombe and Fulking."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/much-loved-figures-welsh-life-28297061",
        "title": "The much-loved figures in Welsh life who died in 2023",
        "description": "Just days ago Brian Price, who captained Wales, beat the All Blacks with Newport, and played for the British and Irish Lions, died at the age of 86. The famed lock forward from Deri near Bargoed was an all-time Wales great and was famed for his lineout jumping."
    },
    {
        "url": "https://www.politico.eu/article/westminster-pestminster-harassment-parliament-misconduct-sexual/",
        "title": "How Westminster became Pestminster",
        "description": "Take the case of Geraint Davies, a long-serving Labour MP whose inappropriate conduct was well known in the halls of Westminster long before POLITICO reported last summer that the 63-year-old had been accused of sexually harassing junior female colleagues during his decades in parliament."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/nhs-the-times-the-sun-prime-minister-daily-express-b1129127.html",
        "title": "What the papers say – December 27",
        "description": "Wednesday’s front pages feature headlines from the Boxing Day sales to the latest political moves in Westminster. The Sun focuses on those who braved Tuesday’s sales, as well as detailing the best spots where you can still nab a bargain."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-67825269.amp",
        "title": "Newspaper headlines: Tory election plans and &#39;NHS parking scandal&#39;",
        "description": "The front pages carry a range of stories, including different ways the Tories may seek to &quot;woo&quot; voters ahead of the election."
    },
    {
        "url": "https://morningstaronline.co.uk/article/labours-environmental-backsliding-gets-worse-world-heats",
        "title": "Editorial: Labour&#39;s environmental backsliding gets worse as the world heats up",
        "description": "Not <b>Keir Starmer</b>’s Christmas message, which stood in a longstanding ruling-class tradition of mouthing Christian pieties while failing to spot any implications for the here and now. Priests and ministers across the world saw the need to mention Israeli ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/only-6-percent-of-voters-think-tories-have-done-a-good-job-wp8wmq2wl?ilc=timesradio:morefromthetimes",
        "title": "Only 6% of voters think Tories have ‘done a good job’",
        "description": "Declining support for Rishi Sunak bodes well for Sir Keir Starmer, but voters still unsure whether Labour is fit for office"
    },
    {
        "url": "https://www.thesun.co.uk/news/25167826/keir-starmer-immigration-plan-labour-void/",
        "title": "Sir <b>Keir Starmer</b> knows Labour has a void where a plan for stopping the small boats should be",
        "description": "Migrants stunt LABOUR love to denounce the Tories’ Rwanda migrants scheme as a “gimmick”. Their latest so-called alternative is worse — it is a blatant, cynical stunt. Keir Starmer knows his party"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12901751/The-world-awash-cash-invest-make-Britain-better-says-departing-L-G-boss-Nigel-Wilson.html",
        "title": "&#39;The world is awash with cash - we can invest it to make Britain better&#39;, says departing L&amp;G boss Nigel Wilson",
        "description": "In his 11 years running investment giant Legal &amp; General, Nigel Wilson (pictured) has used his £1.2trillion balance sheet to reshape our cities."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12902179/Keir-Starmer-frontbenchers-spring-general-election-Rishi-Sunak-2024.html",
        "title": "<b>Keir Starmer</b> tells his frontbenchers to prepare for a spring general election after Rishi Sunak confirms one will be held in 2024",
        "description": "Shadow ministers have been told to have their policy proposals ready by mid-January so that the party can have a full manifesto by February 8, insiders have said."
    }
]