[
    {
        "url": "https://www.irishnews.com/news/uk/uk-pledges-250m-boost-for-ukrainian-artillery-as-war-enters-third-year-WAMACREDMRMXPID6ALUFT6WD4U/",
        "title": "UK pledges £250m boost for Ukrainian artillery as war enters third year",
        "description": "Also speaking on the second anniversary of the conflict, Labour leader Sir <b>Keir Starmer</b> praised Ukraine’s “strength, resilience and courage” and recommitted his party to supporting their resistance to the Russian invasion. He said: “When I met ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/?ico=related-posts",
        "title": "Adam Hills rages that government should be ‘f***ing ashamed’ over Gaza in blistering rant",
        "description": "‘This is my CBE. It belongs in the dustbin, with [Rishi] Sunak and [<b>Keir] Starmer</b>,’ she blazed. If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-vows-support-ukraine-until-223000957.html",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "“We are prepared to do whatever it takes, for as long as it takes, until they prevail.” Labour leader Sir <b>Keir Starmer</b>, who hopes to enter Number 10 after the general election this year, said Britain would always support Ukraine “no matter who is in ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-beaten-teen-protecting-171252538.html",
        "title": "<b>Keir Starmer</b> was ‘beaten up’ as a teen after protecting gay friend",
        "description": "Graham’s dad, who ran the Diamond Inn down the road, did that ‘You’re no son of mine’ thing and threw him out&quot; The post Keir Starmer was ‘beaten up’ as a teen after protecting gay friend appeared first on Attitude."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-biography-things-learned-facts-m8jzxmr79?ilc=timesradio:morefromthetimes",
        "title": "11 things we learnt from <b>Keir Starmer</b>’s biography",
        "description": "Next week the first authoritative biography of the Labour leader, written with his co-operation, will be published. Serialised in The Times the book by Tom Baldwin reveals new facts and insights about Starmer’s family,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/keir-starmer-used-every-trick-32189555",
        "title": "<b>Keir Starmer</b> used every trick in the book to stop his MPs voting on the SNP ceasefire motion",
        "description": "The SNP has been pressing the UK government and parliament to support an immediate ceasefire in Gaza and Israel for months. In November, we tabled a vote in the House of Commons calling for a ceasefire but it failed because Rishi Sunak and <b>Keir Starmer</b> ordered Tory and Labour Party MPs to oppose it - and threatened them with sanctions if they voted for the SNP motion."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24141549.labour-demands-truss-anderson-lose-whip-pair-rebuked-senior-tory/",
        "title": "Labour demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "The PM is being pressed by Sir <b>Keir Starmer</b>’s party to “show some leadership” and take action over the remarks. A failure to do so would amount to “allowing the divisive, deluded and dangerous views of the far-right into mainstream British politics ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68388542",
        "title": "Ukraine war: UK reaffirms Ukraine support on war anniversary",
        "description": "Political leaders in the UK have reaffirmed their support for Ukraine ahead of the second anniversary of Russia&#39;s full-scale invasion. Prime Minister Rishi Sunak said Britain was prepared to do &quot;whatever it takes, for as long as it takes&quot; to help Ukraine achieve victory."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/uk-vows-to-support-ukraine-until-they-prevail-as-war-enters-third-year-111303/",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "Prime Minister Rishi Sunak said Britain was prepared to do ‘whatever it takes, for as long as it takes’ to help the country."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-ashworth-liz-truss-rishi-sunak-labour-steve-bannon-b1141263.html",
        "title": "Labour demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth condemned remarks made by the pair as ‘egregious’."
    }
]