[
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7291768",
        "title": "Politics latest: Anderson releases first statement about Islamophobia row since criticism from PM",
        "description": "There have been accusations levelled at Sir <b>Keir Starmer</b> that he &quot;threatened&quot; the Speaker in order to convince him to break convention - something both the Speaker&#39;s office and the Labour leader have denied. But senior Labour MP Sir Chris Bryant admitted ..."
    },
    {
        "url": "https://bmmagazine.co.uk/news/sir-keir-starmer-advocates-patriotic-economy-with-focus-on-homeownership-boost/",
        "title": "Sir <b>Keir Starmer</b> Advocates ‘Patriotic Economy’ with Focus on Homeownership Boost",
        "description": "Labour leader Sir Keir Starmer has unveiled plans for what he terms a &quot;patriotic economy,&quot; with a primary focus on bolstering home ownership"
    },
    {
        "url": "https://www.thelondoneconomic.com/news/george-galloway-now-clear-leader-to-take-rochdale-by-election-seat-369366/",
        "title": "George Galloway now clear leader to take Rochdale by-election seat",
        "description": "“<b>Keir Starmer</b> has changed Labour so that it is unrecognisable from the party of 2019. “We understand that these are highly unusual circumstances, but it is vital that any candidate put forward by Labour fully represents its aims and values. “Given ..."
    },
    {
        "url": "https://www.thenational.scot/news/24144354.murdochs-uk-papers-leaning-towards-backing-labour-next-election/",
        "title": "Murdoch&#39;s UK papers &#39;leaning towards backing Labour at next election&#39;",
        "description": "It would mean The Times and The Sun could back Labour and help <b>Keir Starmer</b> win the keys to Downing Street. The Sun’s support of Labour and Tony Blair ahead of the 1997 election, where the party won a landslide, has been widely credited for assisting the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-lee-anderson-poured-petrol-123032920.html",
        "title": "OPINION - Lee Anderson has poured petrol on the fires of hatred and Rishi Sunak should condemn his racist remarks",
        "description": "More than two days on from Lee Anderson’s vile racist, anti-Muslim and Islamophobic remarks, we have yet to hear the Prime Minister call it what it is: Islamophobic, anti-Muslim hate and racist. Remarkably,"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/angela-rayner-says-buying-council-28704629",
        "title": "Angela Rayner says buying her council house was &#39;proud moment&#39; as she hits back at Tories",
        "description": "It comes as Sir Keir Starmer and Ms Rayner visit a housing development in the West Midlands on Monday (February 26). The Labour leader will hit out at the Tories’ record on housing and the decision by Rishi Sunak to scrap national house building targets."
    },
    {
        "url": "https://www.irishnews.com/life/irish-language/dinnseanchas-agus-seanfhocal-fingal-donegal-and-not-sending-a-blacksmith-to-make-shoes-TGBUQGQWC5HGHOBBGJBQTS6W2M/",
        "title": "Dinnseanchas agus seanfhocal: Fingal, Donegal and not sending a blacksmith to make shoes",
        "description": "Fine Gall, the territory or tribe of the Galls or Danes; and the same territory is still well known by the name of Fingal, and the inhabitants are locally called Fingallians. “Donegal is mentioned in several of our Annals,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/26/lord-mandelson-leaves-synagogue-event-early-labour/",
        "title": "Lord Mandelson leaves synagogue event early after row over Labour’s anti-Semitism problem",
        "description": "Lord Mandelson, the former &quot;spin doctor&quot; to Sir Tony Blair, is understood to be advising Sir <b>Keir Starmer</b> Credit: ANDREW MILLIGAN/PA Lord Mandelson left a synagogue event early on Sunday night after a row broke out over Labour’s anti-Semitism problem."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13126263/Paddy-McGuinness-defends-Question-Time-appearance-saying-opportunity-working-class-voices-heard-BBC-faced-dumbing-backlash-booking.html",
        "title": "Paddy McGuinness defends Question Time appearance saying it was an &#39;opportunity for working class voices to be heard&#39; - after BBC faced &#39;dumbing down&#39; backlash over his booking",
        "description": "Paddy, who has also presented Question of Sport, caused a stir when he claimed on the show he &#39;admired&#39; the timing of Sir <b>Keir Starmer</b>&#39;s latest U-turn and stuck the boot into the Tories. Simon Trimnell wrote in reaction to the booking: &#39;Paddy McGuinness ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/lee-anderson-refuses-apologise-islamist-comments/",
        "title": "Lee Anderson refuses to apologise for &#39;Islamist&#39; comments as he doubles down on criticism of Sadiq Khan",
        "description": "Labour leader Sir <b>Keir Starmer</b> said earlier that Rishi Sunak was harbouring &quot;extremists&quot; in his party, adding that it was right that Mr Anderson had been suspended for an &quot;appalling racist and Islamophobic outburst&quot;. Mohammed Amin, a former chairman of the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68400775",
        "title": "Rishi Sunak urges MPs not to inflame debate amid Lee Anderson row",
        "description": "However, Labour leader Sir <b>Keir Starmer</b> accused the prime minister of being &quot;too weak&quot; to call Mr Anderson&#39;s comments Islamophobic. Earlier in the morning, Mr Sunak&#39;s Transport Secretary Mark Harper was asked if Mr Anderson could be readmitted as a ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/26/rishi-sunak-lee-anderson-islamophobia-row-conservatives-tories-keir-starmer-labour-uk-politics-live?topics=PERSON%3AKeir+Starmer",
        "title": "PM says Lee Anderson’s comments ‘not acceptable’ but denies Tory party has Islamophobic tendencies – UK politics live",
        "description": "Rishi Sunak gave interviews to local stations in Yorkshire where he is chairing his cabinet meeting this morning"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870782/Chris-Bryant-Labour-SNP-Hoyle",
        "title": "&#39;Charlatan!&#39; Chris Bryant sparks calls for probe into Labour manipulation of Commons rules",
        "description": "Mr Bryant’s key role came just after PMQs, when he deliberately filibustered an uncontroversial 10 minute rule motion in order to allow Sir <b>Keir Starmer</b> and others more time to lobby Sir Lindsay Hoyle to change the rules and allow a vote on Labour’s ..."
    },
    {
        "url": "https://www.thenational.scot/news/24143545.humza-yousaf-hits-keir-starmer-ahead-pro-eu-campaign-day/",
        "title": "Humza Yousaf hits out at <b>Keir Starmer</b> ahead of pro-EU campaign day",
        "description": "SNP leader Humza Yousaf has hit out at Labour ahead of a pro-EU campaign event being held in Glasgow five years after Sir Keir Starmer stated"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13125929/Angela-Rayner-breaks-cover-amid-questions-ownership-former-council-house.html",
        "title": "Angela Rayner breaks cover amid questions around her ownership of a former council house ... to go and push Labour&#39;s housing plans as the party braces for Rochdale by-election ...",
        "description": "Labour&#39;s top team will put on a united front in the West Midlands as the Tories demand cops probe whether Ms Rayner broke rules when she owned a house bought using &#39;Right To Buy&#39;."
    },
    {
        "url": "https://www.lbc.co.uk/news/rishi-sunak-mark-harper-islamophobia-politics-sadiq-khan/",
        "title": "PM denies Tories have &#39;Islamophobic tendencies&#39; as minister says Lee Anderson&#39;s comments were &#39;profoundly wrong&#39;",
        "description": "Labour leader Sir <b>Keir Starmer</b> said earlier that Rishi Sunak was harbouring &quot;extremists&quot; in his party, adding that it was right that Mr Anderson had been suspended for an &quot;appalling racist and Islamophobic outburst&quot;. Mohammed Amin, a former chairman of the ..."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7290182",
        "title": "Politics latest: Rishi Sunak under pressure to address Lee Anderson suspension as Tory MPs label it &#39;final nail in the party&#39;s coffin&#39;",
        "description": "His move was interpreted by critics as an &quot;overtly political decision&quot; designed to help Sir <b>Keir Starmer</b> fend off a rebellion from his own backbenchers, and there were angry scenes as both SNP and Conservative MPs stormed out of the Commons chamber in protest."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/26/former-conservative-party-chair-urges-rishi-sunak-to-call-out-islamophobia/",
        "title": "Former Conservative Party chair urges Rishi Sunak to ‘call out’ Islamophobia",
        "description": "A former Conservative cabinet minister has called on the prime minister to speak out against Islamophobia amid a row over Lee Anderson’s comments referencing Islamists and Sadiq Khan.  Lee Anderson, the Ashfield MP who was the Conservative Party deputy chairman until last month,"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit-369323/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Labour leader Sir <b>Keir Starmer</b> will talk up Labour’s housing pledges on a visit to the West Midlands, promising it would deliver a “future built in Britain, by Britain, for Britain” if it wins power. The party leader is expected to say he would run a ..."
    },
    {
        "url": "https://www.politico.eu/article/labour-gets-boozy-with-the-city/",
        "title": "Labour gets boozy with the City",
        "description": "Presented by Nationwide By JAMES FITZGERALD with HANNAH BRENTON and ELEANOR MYERS PRESENTED BY View in your browser or listen to audio SNEAK PEEK — Rachel Reeves schmoozes City bigwigs at"
    },
    {
        "url": "https://www.scotsman.com/news/opinion/letters/readers-letters-thwarting-parliamentary-debate-no-was-to-fix-gaza-4532569",
        "title": "Readers&#39; Letters: Thwarting parliamentary debate no was to fix Gaza",
        "description": "Sir <b>Keir Starmer</b> admitted that he had &quot;urged&quot; Sir Lindsay to widen the debate, glossing over the many connotations of &quot;urged&quot;. When the leader of Sir Lindsay&#39;s former party urged him to consider his proposed changes to the SNP bill, intentionally or not ..."
    },
    {
        "url": "https://news.stv.tv/scotland/yousaf-criticises-labour-ahead-of-pro-eu-campaign-event",
        "title": "Yousaf criticises Labour ahead of pro-EU campaign event",
        "description": "The event comes five years after Labour leader Sir <b>Keir Starmer</b> stated he would push for a second vote on Brexit. SNP leader Humza Yousaf has hit out at Labour ahead of a pro-EU campaign event being held in Glasgow five years after Sir <b>Keir Starmer</b> stated ..."
    },
    {
        "url": "https://news.stv.tv/politics/snp-calls-on-opposition-parties-to-support-fresh-ceasefire-motion-in-house-of-commons",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24142588.cannot-solve-gaza-problem-can-solve/",
        "title": "We cannot solve the Gaza problem. But we can solve our own",
        "description": "I WRITE as a long-term critic of the Israeli state’s treatment of the Palestinians, but welcomed Kevin McKenna’s recent balanced commentary"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/26/charities-warned-over-public-culture-wars-by-watchdog/",
        "title": "Charities warned over fighting &#39;public battles&#39; around culture wars",
        "description": "And last month Sir <b>Keir Starmer</b>, the Labour leader, gave a speech accusing the Tories of going to war with charities by criticising woke behaviour. In his speech Mr Fraser will condemn those who use the charity sector to score political points and will ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/02/inside-the-labour-lefts-split",
        "title": "The runaway Speaker",
        "description": "It was in December 1982, in the aftermath of the titanic struggle between Tony Benn and Denis Healey for Labour’s deputy leadership, that the party’s left split. Those who had supported Benn formed the “hard left” Socialist Campaign Group, while those who had backed Healey, such as Neil Kinnock, remained in the “soft left” Tribune Group."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/labour-chasing-rural-vote-starmer-051700600.html",
        "title": "Labour are chasing the rural vote, but <b>Starmer</b> is no champion of the shires",
        "description": "The Labour leader will have his work cut out convincing voters in the countryside that he has their interests at heart, says"
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-to-reach-out-to-other-parties-on-ceasefire-as-mps-reveal-safety-concerns-4532588",
        "title": "SNP to reach out to other parties on ceasefire as MPs reveal safety concerns",
        "description": "SNP Westminster leader Stephen Flynn has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh ceasefire motion. Last week, Commons Speaker Sir Lindsay Hoyle publicly apologised to the SNP ..."
    },
    {
        "url": "https://www.ft.com/content/db1999d0-0f77-4a1a-9ba2-60cc038388f1",
        "title": "Labour’s worker rights shake-up leaves UK business on edge",
        "description": "Overhaul planned by main opposition party could backfire and end up harming employees and bosses, say executives"
    },
    {
        "url": "https://inews.co.uk/news/politics/deepfakes-provide-perfect-storm-for-election-manipulation-james-cleverly-warns-2925827?ITO=msn",
        "title": "Deepfakes provide ‘perfect storm’ for election manipulation James Cleverly warns",
        "description": "Last year Sir <b>Keir Starmer</b> was also subject to a malicious deepfake audio recording. Mr Cleverly told The Times that “increasingly today the battle of ideas and policies takes place in the ever-changing and expanding digital sphere”. “The landscape ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/snp-gaza-speaker-labour-bryant-b2502532.html",
        "title": "SNP demands investigation into Labour ‘dirty tricks’ Gaza vote as senior MP admits delaying debate",
        "description": "The party’s Cabinet Office spokesman Kirsty Blackman said: “These damning revelations show Sir <b>Keir Starmer</b> pulled every dirty trick in the Westminster book to wreck the SNP’s vote on an immediate ceasefire in Gaza and Israel. “After months of ..."
    },
    {
        "url": "https://www.thebookseller.com/books/books-in-the-media-tom-baldwins-biography-of-starmer-turns-heads",
        "title": "Books in the Media: Tom Baldwin&#39;s biography of <b>Starmer</b> turns heads",
        "description": "This week Tom Baldwin’s biography of the current Labour Party leader <b>Keir Starmer</b> was widely reviewed across the nationals while Carys Davies’ third novel was picked in the Observer."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/snp-seek-support-labour-lib-28705625",
        "title": "SNP to seek support from Labour and Lib Dems for immediate Gaza ceasefire",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/the-tories-self-destruction-is-a-gift-to-labour",
        "title": "Inside the Labour left’s split",
        "description": "Support 110 years of independent journalism. Conservative divisions are helping to keep <b>Keir Starmer</b>’s party’s lead solid even as it endures its own woes. By Freddie Hayward So where are we? The Budget is next week. We have the Rochdale by-election on ..."
    },
    {
        "url": "https://uk.news.yahoo.com/snp-reach-labour-libdems-ahead-050000069.html",
        "title": "SNP reach out to Labour and LibDems ahead of another Gaza ceasefire debate",
        "description": "Stephen Flynn, the party’s leader in Westminster, has written to Labour leader <b>Keir Starmer</b> and Liberal Democrat leader Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-parliamentarians-ask-labour-support-32208428",
        "title": "SNP calls on Labour to back plans to ban unpaid trial shifts",
        "description": "An SNP MP and MSP have jointly written to the leadership of the Labour Party asking for support in an attempt to ban unpaid trial shifts. In a letter addressed to UK Labour leader <b>Keir Starmer</b> and Scottish Labour leader Anas Sarwar, Stewart McDonald and Kevin Stewart said they were concerned that Labour was not addressing the practice."
    },
    {
        "url": "https://bmmagazine.co.uk/marketing/surge-in-political-ad-spending-on-facebook-and-instagram-signals-intensified-digital-campaigning/",
        "title": "Surge in Political Ad Spending on Facebook and Instagram Signals Intensified Digital Campaigning",
        "description": "Labour leader Sir <b>Keir Starmer</b> has unveiled plans for what he terms a “patriotic economy,” with a primary focus on bolstering home ownership and revitalising communities through the creation of new towns. Leslie Kenny, Founder &amp; CEO of Oxford ..."
    },
    {
        "url": "https://www.thesun.co.uk/video/tvandshowbiz/4791198/trailer-for-1983-movie-risky-business-starring-tom-cruise-and-rebecca-de-mornay/",
        "title": "Trailer for 1983 movie Risky Business starring Tom Cruise and Rebecca De Mornay",
        "description": "Trailer for 1983 movie Risky Business starring Tom Cruise and Rebecca De Mornay By-election blow as Labour wins victories in two Tory strongholds and <b>Keir Starmer</b> hails… ©News Group Newspapers Limited in England No. 679215 Registered office: 1 London ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rebel-village-manchesters-last-rural-28577503",
        "title": "&#39;Rebel&#39; village is Manchester&#39;s last rural hideaway - with a giant neighbour",
        "description": "But with Sir <b>Keir Starmer</b> vowing that any future Labour government would not revive the cancelled plans, it appears Ringway is safe for now. And although Mr Oddie fears the village will be &#39;subsumed at some stage&#39;, he hopes it stays as it is for a good few ..."
    },
    {
        "url": "https://inews.co.uk/news/rupert-murdoch-labour-keir-starme-2913677?ico=editors_picks",
        "title": "Murdoch is leaning towards backing Labour – but doubts remain over <b>Starmer</b>",
        "description": "The Murdochs’ UK newspapers are potentially leaning towards backing Labour if Sir <b>Keir Starmer</b> maintains the party’s strong lead over the Conservatives, sources close to the father-and-son media moguls say. Two senior sources familiar with the views of ..."
    },
    {
        "url": "https://www.gg2.net/tories-suspend-mp-anderson-over-islamophobic-comments/",
        "title": "Tories suspend MP Anderson over ‘Islamophobic’ comments",
        "description": "Khan and Labour leader <b>Keir Starmer</b>, who both branded Anderson’s outburst “racist” and “Islamophobic”, also directed their criticism at Sunak, who has not commented on the scandal. Khan hit out at the “deafening silence” from the Tory leader ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26188601/small-boat-crossings-surge-past-2000/",
        "title": "Small boat crossings surge past 2,000 mark this year as Rishi Sunak faces pressure on illegal migration",
        "description": "MORE than 2,000 illegal migrants have arrived on small boats already this year after one of the busiest days so far yesterday. A total 290 people crossed the Channel in five dinghies on Sunday"
    },
    {
        "url": "https://uk.news.yahoo.com/snp-demands-investigation-labour-dirty-115726662.html",
        "title": "SNP demands investigation into Labour ‘dirty tricks’ Gaza vote as senior MP admits delaying debate",
        "description": "The disruption was aimed at giving Labour leader Sir <b>Keir Starmer</b> time to convince Commons speaker Sir Lindsay Hoyle to allow MPs a vote on Labour’s amendment to the SNP motion. The SNP accused Labour of using “every dirty trick in the book” to wreck ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/26/northern-councils-hs2-money-fix-potholes/",
        "title": "Northern councils given HS2 money to fix potholes",
        "description": "Government to use savings from controversial scrapping of high speed rail link to fund local transport improvements"
    },
    {
        "url": "https://www.cityam.com/labour-are-chasing-the-rural-vote-but-starmer-is-no-champion-of-the-shires/",
        "title": "Labour are chasing the rural vote, but <b>Starmer</b> is no champion of the shires",
        "description": "The Labour leader will have his work cut out convincing voters in the countryside that he has their interests at heart, says Eliot Wilson"
    },
    {
        "url": "https://inews.co.uk/news/politics/deepfakes-provide-perfect-storm-for-election-manipulation-james-cleverly-warns-2925827?ico=related_article_inline",
        "title": "Deepfakes provide ‘perfect storm’ for election manipulation James Cleverly warns",
        "description": "Deepfakes provide the “perfect storm” for those looking to disrupt the upcoming general election, James Cleverly has warned. The Home Secretary said the age of technologies generated by artificial intelligence (AI) misleading and disrupting important democratic decisions was “already in play”."
    },
    {
        "url": "https://www.counterfire.org/article/when-you-cant-defend-your-rotten-politics-blame-the-muslims-weekly-briefing/",
        "title": "When you can’t defend your rotten politics, blame the Muslims – weekly briefing",
        "description": "Lindsey German on crisis, war and racism The failure of most politicians to do anything about the genocide in Gaza was only too obvious during the Westminster fiasco on Wednesday."
    },
    {
        "url": "https://www.heraldscotland.com/politics/westminster/24142935.yousaf-exerts-pressure-starmer-anti-brexit-message/",
        "title": "Yousaf exerts pressure on <b>Starmer</b> with anti-Brexit message",
        "description": "Humza Yousaf will today seek to turn up the pressure on Labour taking an anti-Brexit message onto the general election campaign trail."
    },
    {
        "url": "https://www.heraldscotland.com/news/24143009.flynn-writes-starmer-ahead-new-gaza-ceasefire-motion/",
        "title": "Flynn writes to <b>Starmer</b> ahead of new Gaza ceasefire motion",
        "description": "The SNP’s Westminster leader has said he will seek support from opposition parties in order to secure an immediate ceasefire in Gaza and"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-snp-uk-parliament-gaza-un-security-council-b1141427.html",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion",
        "description": "SNP Westminster leader Stephen Flynn has called for opposition leaders Sir Keir Starmer and Sir Ed Davey to support a fresh ceasefire motion."
    },
    {
        "url": "https://www.lbc.co.uk/news/rishi-revolt-lee-anderson/",
        "title": "Rishi&#39;s revolt over Anderson suspension as Red Wall MPs brief of support for the sacked deputy chair",
        "description": "Rishi Sunak is facing a revolt for sacking Lee Anderson after Red Wall MPs briefed that they have seen waves of support for the sacked Tory following his dismissal in an Islamophobia row."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/the-rise-threatening-behaviour-towards-32211105",
        "title": "&#39;The rise of threatening behaviour towards are teachers is another example of Tory failure&#39;",
        "description": "Teachers say children as young as seven are throwing furniture, ripping posters from walls and storming out of classrooms"
    },
    {
        "url": "https://www.itv.com/news/2024-02-25/snp-calls-on-opposition-parties-to-support-fresh-ceasefire-motion",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion after Commons chaos",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-coventry-warwickshire-68383298.amp",
        "title": "Warwickshire solar farm row pits &#39;builders against blockers&#39;",
        "description": "Solar power is a key part of the government&#39;s energy strategy, with plans to develop 70GW of it by 2035. Sir <b>Keir Starmer</b>&#39;s party is upping the ante, saying it wants more than triple solar power to 50 GW by 2030. Image caption, Labour councillor Chris King ..."
    }
]