[
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-labour-leader-general-election-biography-v706kqcd2",
        "title": "The private life of <b>Keir Starmer</b> — his wife and family reveal all",
        "description": "Having been granted unprecedented access, Tom Baldwin’s new biography explores what the Labour leader is really like away from the limelight"
    },
    {
        "url": "https://www.itv.com/news/2024-02-16/scottish-labour-mps-should-be-whipped-in-gaza-ceasefire-vote-snp",
        "title": "Scottish Labour MPs should be whipped in Gaza ceasefire vote – SNP",
        "description": "Scottish Labour leader Anas Sarwar has said both he and UK party leader Sir <b>Keir Starmer</b> want to see an immediate end to the violence. During a previous Westminster vote on the issue in November, Labour lost 10 shadow ministers and parliamentary aides who ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/your-three-minute-digest-jdr5rx6cg",
        "title": "Your three-minute digest",
        "description": "Sir Keir Starmer paid £99,431 in tax last year, mostly from the sale of a field used as a donkey sanctuary. On top of his salary as an MP and leader of the Labour Party, totalling £128,291, he"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13093961/Could-Rochdale-Muslims-enraged-war-Gaza-sweep-Putin-loving-firebrand-George-Galloway-House-Commons.html",
        "title": "Could Rochdale Muslims enraged by the war in Gaza sweep Putin-loving firebrand George Galloway back into the House of Commons?",
        "description": "The bigger picture is that Sir <b>Keir Starmer</b>’s response to the controversy has triggered a serious crisis in his leadership, notwithstanding the thumping double by-election victory in Kingswood and Wellingborough yesterday. His decision not to immediately ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/starmer-set-to-attend-major-munich-security-conference-100245/",
        "title": "<b>Starmer</b> set to attend major Munich security conference",
        "description": "Sir Keir Starmer is expected to be at a major security conference in Germany on Saturday for talks and meetings with world leaders. The Labour leader will arrive at the Munich Security Conference fresh from two by-election victories, with Sir Keir expected to use the major annual event to stress his party’s commitment to Nato and defence."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24126044.come-together-sunak-tells-conservatives-twin-by-election-blow/",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "Mr Sunak, who had sought to play down the losses as “difficult” mid-term elections, on Friday night called on right-wing and conservative voters to unite to keep Sir <b>Keir Starmer</b> out of Number 10. Writing in the Telegraph, he said: “Later this year ..."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-paid-nearly-163100000-in-tax-last-year-documents-show-13073213",
        "title": "Sir <b>Keir Starmer</b> paid nearly £100,000 in tax last year, documents show",
        "description": "Sir Keir Starmer paid £99,431 in tax last year, according to a summary released by the Labour Party. The release, published on Friday, showed that the Labour leader paid £44,308 in income tax in 2022/23."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/labour-leader-sir-keir-starmer-28650230",
        "title": "Labour leader Sir <b>Keir Starmer</b> paid more than £99,000 in tax last year",
        "description": "Labour leader Sir Keir Starmer paid £99,431 in tax last year - after making £275,000 in capital gains. A summary released by Labour on Friday showed that the Labour leader paid £44,308 in income tax in 2022/23. He also paid £52,688 in capital gains tax, after the sale of a field in December 2022 which he partly owned."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-tax-return-capital-gains-labour-leader-b1139726.html",
        "title": "<b>Keir Starmer</b> paid more than £99,000 in tax, latest return shows",
        "description": "Reports at the time put the sale at £400,000. According to the latest tax summary, Sir Keir gained £275,739 from the land sale. Rishi Sunak published a summary of his own tax affairs earlier this month, showing that he paid more than £500,000 in UK tax last year, with his total income rising to £2.2 million."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/16/keir-starmer-paid-99400-in-uk-tax-on-404000-of-income-labour-reveals",
        "title": "<b>Keir Starmer</b> paid £99,400 in UK tax on £404,000 of income, Labour reveals",
        "description": "Details about leader’s finances for 2022-23 come after Rishi Sunak revealed he paid at least £508,000 of tax on £2.2m-plus"
    },
    {
        "url": "https://inews.co.uk/news/politics/keir-starmer-paid-99k-tax-last-year-2911192?ico=related_stories",
        "title": "<b>Keir Starmer</b> paid £99k in tax last year, figures released by Labour show",
        "description": "Keir Starmer paid more than £99,000 in tax last year, new figures released by Labour show. According to the figures, the Labour leader paid £99,431 overall in tax last year."
    },
    {
        "url": "https://www.lbc.co.uk/opinion/views/sir-keir-starmers-week-from-hell-gives-the-tories-hope-double-byelection-defeat/",
        "title": "Sir <b>Keir Starmer</b>&#39;s week from hell gives the Tories hope again - even after double by-election defeats",
        "description": "Their mistakes play into Tory attacks that Labour don&#39;t have a plan, and Sir Keir Starmer is &#39;flip flopper&#39; and a risk for people to vote for him. Next month&#39;s Budget - if the Chancellor can announce some tax cuts - it will give them more clear water to divide themselves from Labour."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/national/24124007.keir-starmer-admits-last-week-bumpy-insists-labour-changed-party/",
        "title": "<b>Keir Starmer</b> admits last week was ‘bumpy’ but insists Labour is a changed party",
        "description": "Sir <b>Keir Starmer</b> acknowledged the last week had been “bumpy” but insisted he was prepared to make “ruthless” decisions as he seeks to show Labour is a changed party. Earlier this week, an antisemitism row forced the Labour leader to drop support ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/labour-party-by-elections-wellingborough-kingswood-keir-starmer-b1139619.html",
        "title": "The Standard View: Labour is on course for power, but is the party ready to govern?",
        "description": "After what was widely acknowledged to be one of the worst weeks of Sir <b>Keir Starmer</b>’s leadership — in which Labour once again became embroiled in antisemitism and the leader himself was accused of indecision over Rochdale candidate Azhar Ali — the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-keir-starmer-david-lammy-munich-john-healey-b1139756.html",
        "title": "<b>Starmer</b> set to attend major Munich security conference",
        "description": "Sir Keir Starmer is expected to be at a major security conference in Germany on Saturday for talks and meetings with world leaders. The Labour leader will arrive at the Munich Security Conference fresh from two by-election victories,"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/come-together-sunak-tells-conservatives-after-twin-by-election-blow-100244/",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/after-rishi-sunaks-latest-election-32147266",
        "title": "&#39;After Rishi Sunak&#39;s latest by-election blows we have to say - give us a general election now&#39;",
        "description": "No amount of Tory spin can hide how ­disastrously their party performed in what were previously two safe Conservative seats - it&#39;s time we have a general election"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/keir-starmer-admits-last-week-was-bumpy-but-insists-labour-is-a-changed-party-110671/",
        "title": "<b>Keir Starmer</b> admits last week was ‘bumpy’ but insists Labour is a changed party",
        "description": "An antisemitism row forced the Labour leader to drop support for Azhar Ali, the party’s candidate for the upcoming Rochdale by-election."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-defends-delay-suspending-parliamentary-101606828.html",
        "title": "<b>Starmer</b> defends delay in suspending parliamentary candidates over Israel comments",
        "description": "Sir Keir Starmer defended his judgement after Labour suspended two parliamentary candidates over their remarks about Israel. The Labour leader spoke to BBC Breakfast on Friday morning, 16 February, following a tumultuous week for the party."
    },
    {
        "url": "https://www.thesun.co.uk/news/25972507/keir-starmer-fail-tackle-anti-semitism-labour/",
        "title": "Just 3% of voters think Sir <b>Keir Starmer</b> has successfully tackled anti-Semitism in Labour Party",
        "description": "JUST three per cent of voters think Sir Keir Starmer has successfully tackled anti-Semitism in the Labour Party. The bombshell survey for The Times came as it emerged anti-Jewish racism incidents"
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/16/by-elections-keir-starmer-on-course-to-be-next-pm-after-victories-in-wellingborough-and-kingswood/",
        "title": "By-elections: <b>Keir Starmer</b> ‘on course’ to be next PM after victories in Wellingborough and Kingswood",
        "description": "The Labour Party has inflicted two by-election defeats on the government, overturning large majorities to win in Wellingborough and Kingswood. Labour overturned majorities of 11,220 (Kingswood) and 18,"
    }
]