[
    {
        "url": "https://inews.co.uk/news/politics/labour-backdate-vat-school-fees-stop-avoidance-phillipson-2844344",
        "title": "Labour will backdate VAT on school fees to stop avoidance, Phillipson says",
        "description": "Shadow Education Secretary Bridget Phillipson says there is &#39;precedent&#39; for retrospective legislation to close tax loophole"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12944591/Bond-market-vigilantes-ready-pounce-politicians-make-rash-election-promises.html",
        "title": "Bond market vigilantes ready to pounce if politicians make rash election promises",
        "description": "Vivek Paul, UK chief investment strategist at Blackrock, raised the spectre of a repeat of the carnage seen in UK in September 2022."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853879/tory-civil-war-One-Nation-group",
        "title": "Tory civil wars reignites as One Nation group launch fight back against right wingers",
        "description": "A Tory MP has reignited a civil war within the party by taking a swipe at right-wing colleagues in other factions. One Nation MP Matt Warman joked at an event on Tuesday night that his group does not need to pretend there are “five families” of MPs to “make ourselves look bigger than we are”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/09/keir-starmer-children-sky-tv-mistake-son-daughter/",
        "title": "<b>Starmer</b> says he has two sons in TV interview when he actually has a boy and a girl",
        "description": "The Labour leader made the gaffe while paying tribute to his family for their support while talking to Sky&#39;s Sir Trevor Phillips"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/09/post-office-horizon-scandal-fujitsu-rishi-sunak-conservatives-labour-uk-politics-live?page=with:block-659d2e338f08785f75c2e28d",
        "title": "Reports PM privately thinks Rwanda plan won’t work are why costs must be published, Yvette Cooper says – as it happened",
        "description": "Yvette Cooper opens debate that, if passed, would force government to publish confidential documents about costs of Rwanda scheme"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/bar-council-keir-starmer-horizon-mps-wales-b1131300.html",
        "title": "MPs could review private prosecutions after Horizon scandal – Bar Council chair",
        "description": "There is a case for Parliament to “review wholesale” the role of companies in bringing private prosecutions following the Post Office Horizon scandal, the new chairman of the Bar Council has said."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25302840/kids-lockdown-school-labour-education/",
        "title": "Kids are ‘still haunted’ by missing school in lockdown, Labour education chief says",
        "description": "Conservative chairman Richard Holden said: “This is typical political opportunism and hypocrisy from Sir <b>Keir Starmer</b>’s Labour Party which fought tooth and nail to keep schools closed for longer during the pandemic.” Yet Labour secured a boost as ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24038747.humza-yousaf-indy-economic-speech-fails-carve-path/?ref=rss",
        "title": "Humza Yousaf: Indy economic speech fails to carve path",
        "description": "The Scottish Government insists that the SNP winning a majority of Scottish seats would give them the authority to open up talks with the UK Government, likely under <b>Keir Starmer</b>, about separation. It is quite clear to anyone with half a brain that whether ..."
    },
    {
        "url": "https://www.itv.com/news/2024-01-09/who-has-questions-to-answer-over-the-post-office-horizon-scandal",
        "title": "Who has questions to answer over the Post Office Horizon scandal?",
        "description": "Post Office CEO Paula Vennells and Keir Starmer have all been mentioned as people who have questions to answer over the scandal. | ITV National News"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/09/starmer-work-new-labour-office-freezing-parliament-building/",
        "title": "<b>Starmer</b> ‘choosing to work in new Labour offices rather than freezing Parliament building’",
        "description": "Labour leader has designated offices on parliamentary estate but reportedly chooses to work regularly in party’s HQ in Southwark"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/michael-shanks-speaks-out-after-31840266",
        "title": "Michael Shanks speaks out after activists protested his &#39;humanitarian pause&#39; Gaza stance at town hall",
        "description": "Demonstrators gathered outside of the Rutherglen Town Hall yesterday to protest Michael Shanks and Sir Keir Starmer&#39;s &#39;humanitarian pause&#39; stance on the Gaza conflict."
    },
    {
        "url": "https://www.snp.org/with-independence-scotland-can-escape-westminsters-cruel-and-callous-austerity/",
        "title": "With independence, Scotland can escape Westminster’s cruel and callous austerity",
        "description": "The policies of Labour and the Tories are now indistinguishable – and they&#39;re both happy to hand struggling families out to dry."
    },
    {
        "url": "https://www.bristol247.com/news-and-features/news/dan-norris-to-seek-selection-as-labour-parliamentary-candidate/",
        "title": "Dan Norris to seek selection as Labour parliamentary candidate",
        "description": "The metro mayor for the West of England has confirmed his intention to seek selection as Labour’s parliamentary candidate for North East Somerset &amp; Hanham. Dan Norris was an MP for the former Wansdyke constituency in Somerset before returning to politics when he was elected as the regional mayor in May 2021."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/09/the-delicate-aroma-of-a-cover-up",
        "title": "The delicate aroma of a cover-up",
        "description": "Letters: Les Bright ponders on the state of the Whitehall drinks cabinet; plus a letter from Geoff Smith on trust in politicians"
    },
    {
        "url": "https://uk.news.yahoo.com/cps-refuses-reveal-starmer-role-215434007.html",
        "title": "CPS refuses to reveal <b>Starmer</b>’s role in wrongful Post Office prosecutions",
        "description": "The Crown Prosecution Service is refusing to reveal Sir <b>Keir Starmer</b>’s role in the wrongful prosecution of subpostmasters after admitting it took at least 27 victims to court. The CPS said it was combing through historic files and had found at least 27 ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/when-next-byelections-mp-chris-skidmore-resigns-b1107076.html",
        "title": "When are the next by-elections? MP Chris Skidmore resigns",
        "description": "Chris Skidmore has resigned as an MP to protest against the Government’s oil and gas drilling plans in the North Sea. His resignation letter said: “The choice before us is whether to invest in the industries of the future or to be tied to the industries of the past."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67926799",
        "title": "Israel should turn water back on in Gaza - Lord Cameron",
        "description": "The UK foreign secretary is asked whether Israel is breaking international law by turning off the water supply in Gaza."
    },
    {
        "url": "https://news.stv.tv/scotland/former-post-office-boss-paula-vennells-to-hand-back-cbe-amid-horizon-scandal",
        "title": "Former Post Office boss to hand back CBE over Horizon scandal",
        "description": "More than 700 sub-postmasters having received criminal convictions for allegations such as theft and false accounting."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67919190?at_format=link&at_medium=social&at_link_origin=BBC_Politics&at_ptr_name=facebook_page&at_link_id=507C2194-AED9-11EE-A61B-406487A28522&at_campaign=Social_Flow&at_bbc_team=editorial&at_link_type=web_link&at_campaign_type=owned",
        "title": "Labour aims to force ministers to publish Rwanda documents",
        "description": "Why does the UK want to send asylum seekers to Rwanda? Can the new Rwanda bill work and what could stop it? Sir <b>Keir Starmer</b>&#39;s party also want the government to publish papers revealed by the BBC which suggest Rishi Sunak had initially wanted to scale back ..."
    },
    {
        "url": "https://www.lynnnews.co.uk/news/town-councillor-announces-bid-to-become-new-west-norfolk-mp-9347834/",
        "title": "Liberal Democrat Rob Colwell to run for North West Norfolk MP at next general election",
        "description": "Rob Colwell has been selected as the Liberal Democrat Parliamentary Candidate for North West Norfolk in the next general election."
    },
    {
        "url": "https://uk.news.yahoo.com/ex-post-office-boss-paula-131946468.html",
        "title": "Ex-Post Office boss Paula Vennells hands back CBE after Horizon scandal uproar",
        "description": "Disgraced former Post Office boss Paula Vennells is handing back her CBE with immediate effect over her handling of the Horizon IT scandal. The ex-chief executive had come under immense pressure to give up the honour, awarded to her when she stepped down in 2019."
    },
    {
        "url": "https://news.sky.com/story/justice-secretary-in-talks-with-senior-judges-to-expedite-appeals-of-those-convicted-in-post-office-scandal-13044507",
        "title": "Post Office scandal: Law to quash convictions being &#39;actively&#39; considered by government",
        "description": "Two former justice secretaries have called for legislation to override the convictions, although other options mooted include a mass appeal, or removing the Post Office from the appeals process."
    },
    {
        "url": "https://inews.co.uk/news/education/labour-backdate-vat-school-fees-stop-avoidance-phillipson-2844344",
        "title": "Labour set to backdate VAT on school fees to stop avoidance, Phillipson says",
        "description": "Shadow Education Secretary Bridget Phillipson says there is &#39;precedent&#39; for retrospective legislation to close tax loophole"
    },
    {
        "url": "https://www.irishnews.com/news/business/its-the-economy-stupid-WWNVLODGTJBDZI3NBR34TACVWM/",
        "title": "It’s the economy, stupid!",
        "description": "Every economic commentator over the last few years has spent at least some time lamenting the parlous state of our public finances and the impact this is having on the quality of public services delivered. However very few seem to be asking more fundamental questions about how we have ended up in this situation."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/boris-johnson-lbc-chair-bolted-floor-b2475477.html",
        "title": "Studio guest chair bolted to floor after Boris Johnson tried to dodge cameras",
        "description": "The guest chair in an LBC studio was bolted to the floor after Boris Johnson tried to duck cameras during difficult interviews while he was London mayor, it has emerged. LBC Radio also films politicians and other guests when they are interviewed and sometimes shares clips of the interviews online."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/media/harry-cole-slammed-for-shameful-article-linking-starmer-to-baby-killer-366591/",
        "title": "Harry Cole slammed for ‘shameful’ article linking <b>Starmer</b> to baby killer",
        "description": "Like clockwork, The Sun has launched its first attacks on the Labour leader as the next general election nears."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/local-news/leicestershire-rogue-trader-warning-storm-9022976",
        "title": "Leicestershire rogue trader warning as Storm Henk repairs begin",
        "description": "Leicestershire residents are being warned to be on their guard against rogue traders. Last week, the county was hit hard as Storm Henk battered the country."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67923813",
        "title": "Post Office scandal: Governments didn&#39;t act quickly enough - Michael Gove",
        "description": "Postmasters have been &quot;failed by governments&quot; says Levelling Up Secretary Michael Gove, but &quot;now action is being taken&quot;."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/government-actively-considering-using-legislation-to-quash-all-horizon-scandal-considerations/",
        "title": "Government &#39;actively considering&#39; using legislation to quash all Horizon scandal considerations",
        "description": "The government is actively considering using legislation to quash all the Horizon scandal convictions, according to the justice secretary."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853661/Keir-Starmer-death-penalty-baby-killers",
        "title": "<b>Keir Starmer</b> campaigned to save baby killers and axe murderers from the death penalty",
        "description": "A Ugandan axe killer who killed his girlfriend in front of her children was also defended by Sir Keir and was spared execution thanks to a change in the law championed by the Labour leader. His interventions happened between 2002 and 2014, during his time as a lawyer, Director of Public Prosecutions, and his attempts to become a Labour candidate."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/over-200000-people-demand-general-31837907?ruid=50afc1ab-f950-4dd0-94b8-eac25f63d72b",
        "title": "Over 200,000 people demand general election now as &#39;squatter&#39; Rishi Sunak puts off vote",
        "description": "He accused <b>Keir Starmer</b> of &quot;sniping from the sidelines&quot; and lacking a proper plan - but failed to acknowledge that he hasn&#39;t met the majority of the five pledges he made to the nation at the start of 2023. Mr <b>Starmer</b> used his New Year speech last week to ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/09/post-office-horizon-scandal-ministers-scramble-quash-convictions-20085131/?ico=metro-posts_africa_whats-trending-now",
        "title": "Ministers scramble to speed up overturning of Post Office Horizon convictions",
        "description": "Former Post Office sub-postmasters outside the High Court (Picture: Peter MacDiarmid/Shutterstock) The Post Office minister has promised to ‘leave no stone unturned’ in speeding up justice for the hundreds of sub-postmasters wrongfully convicted in the ..."
    },
    {
        "url": "https://socialistworker.co.uk/letters/letters-trust-in-the-struggle-not-labour-and-keir-starmer/",
        "title": "Letters—Trust in the struggle, not Labour and <b>Keir Starmer</b>",
        "description": "Instead of putting trust in <b>Keir Starmer</b> to deliver change, it’s strikes like ours and the growth of grassroots networks that give hope. Our strike lasted 13 weeks throughout the summer of last year. It was prompted by the huge rise in inflation and cost ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-position-gaza-shaped-by-united-states-approach-israel-palestine",
        "title": "Labour Has Consulted US Over Its Gaza Approach",
        "description": "At a regular meeting of the Parliamentary Labour Party on Monday night, Labour leader <b>Keir Starmer</b> told MPs he is in regular contact with Jake Sullivan, the US National Security Adviser. Senior Labour and US diplomatic figures are also understood to have ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/green-party-election-candidares-constituencies-share-of-vote-b2475720.html",
        "title": "Could this be a breakthrough election for the Green Party?",
        "description": "The move will boost their national profile and vote share, and allows them to fully capitalise on anger at the government’s pollution of waterways and Labour’s move to the centre ground (as well as <b>Keir Starmer</b>’s stance on the Israel-Hamas war)."
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/01/09/peace-babies-generation-yes-and-the-end-of-britain/",
        "title": "Peace Babies, Generation Yes and the End of Britain",
        "description": "We can forget about that unfortunate last decade as if it didn’t happen at all. But putting such great expectations onto the shoulders of such a figure as <b>Keir Starmer</b> and his programme is deeply problematic for the media class and their supporters in ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/plaid-plan-new-bill-fair-funding-wales",
        "title": "Plaid plan for new Bill for fair funding for Wales",
        "description": "“The track record of the Conservative UK government is they haven’t, and they won’t, but we’ve heard nothing from Sir <b>Keir Starmer</b> to suggest that a Labour government would either.” Mr ap Iorwerth also wanted the Senedd to have greater powers ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/editorial-strike-action-works-london-dispute-proves",
        "title": "Editorial: Strike action works, and the London Underground dispute proves it",
        "description": "If only. In fact, <b>Keir Starmer</b> has been conspicuous in his lack of support for support for workers taking action to protect their living standards over the last 18 months. At one level, the Telegraph may simply be cross that it has been denied the ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25290381/",
        "title": "Sir <b>Keir Starmer</b> worked for free as a lawyer to save baby killers and axe murderers",
        "description": "SIR <b>Keir Starmer</b> worked for free as a lawyer to help scores of twisted killers around the world — including a monster who buried his two-year-old stepchild alive. The Labour leader boasted last week about his decades of international experience."
    },
    {
        "url": "https://www.cheshire-live.co.uk/news/chester-cheshire-news/rishi-sunak-booed-heckled-leaves-28398974?int_source=nba",
        "title": "Rishi Sunak is booed and heckled as he leaves Stockport restaurant",
        "description": "One attendee asked what his message would be to people who are thinking about voting for <b>Keir Starmer</b>, to which Mr Sunak said &quot;don&#39;t&quot;, arguing that any vote that is not for him at the next general election is one for the Labour leader."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-67886864.amp",
        "title": "Politicians primed for change in the year ahead",
        "description": "You can change these settings by clicking “Ad Choices / Do not sell my info” in the footer at any time. Labour leader Sir <b>Keir Starmer</b> and Scottish MP Michael Shanks are hoping to see a resurgence for their party this year A Conservative government in ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/politics/plaid-cymru-want-high-earners-28414995",
        "title": "Plaid Cymru wants high earners to pay more tax",
        "description": "Plaid Cymru leader Rhun ap Iorwerth has said high earners should pay more tax and called for Wales to be given the powers to create different tax bands to England."
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/news/politics/opinion-politics-should-be-about-service-4471538",
        "title": "OPINION: Politics should be about service",
        "description": "<b>Keir</b> has clearly changed not just the face but function of the Labour Party for the better, alongside representing a proven ability to strategically run a public department. In my opinion it clearly makes him the natural choice to serve as Prime Minister ..."
    },
    {
        "url": "https://bylinetimes.com/2024/01/09/starmers-refusal-to-confront-the-press-isnt-just-a-mistake-its-irresponsible/",
        "title": "‘<b>Starmer</b>’s Refusal to Confront the Press Isn’t Just a Mistake – It’s Irresponsible’",
        "description": "If the Labour Leader does not embrace media reform now, he never will – and the entire country will be far worse off as a result, writes Brian Cathcart"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67919190",
        "title": "Labour aims to force ministers to publish Rwanda documents",
        "description": "Sir Keir Starmer&#39;s party want ministers to disclose the cost of sending asylum seekers to the African country."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-warns-labour-mps-115913729.html",
        "title": "Labour now has more than double support of Tories as <b>Starmer</b> extends poll lead",
        "description": "Labour has increased its huge poll lead over the Conservatives, with the latest YouGov survey putting Sir Keir Starmer ’s party on more than double the support of the Tories. The opposition has received a five-point poll bounce, increasing its lead over Rishi Sunak ’s party to a mammoth 24 points."
    },
    {
        "url": "https://news.stv.tv/scotland/horizon-scandal-government-to-respond-to-calls-to-pardon-wrongly-convicted-postmasters",
        "title": "Government to respond to calls to pardon wrongly convicted postmasters",
        "description": "More than 700 sub-postmasters having received criminal convictions for allegations such as theft and false accounting."
    },
    {
        "url": "https://www.cityam.com/ex-post-office-boss-paula-vennells-to-hand-back-cbe/",
        "title": "Ex-Post Office boss Paula Vennells to hand back CBE",
        "description": "Former Post Office boss Paula Vennells has said she will hand back her CBE with immediate effect amid the ongoing Horizon IT scandal."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-tories-labour-polls-gap_uk_659d25bce4b0bfe5ff64ad3d",
        "title": "Another Blow For Sunak As Tories Slump To Less Than Half Of Labour&#39;s Points In The Polls",
        "description": "YouGov found that it’s not just a party issue either; the public still favour <b>Keir Starmer</b> as PM over Sunak. Around 30% of voters back the Labour leader, compared to 18% who support No.10′s current occupant. A third YouGov poll also found three ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12942577/Rishi-Sunak-poll-Labour-Nigel-Farage-Reform-election-Lib-Dems.html",
        "title": "Misery for Rishi as poll shows Labour 24 POINTS ahead - enough for a massive 360 majority - while separate survey shows Reform UK leapfrogging Lib Dems amid buzz about Nigel ...",
        "description": "Rishi Sunak faced fresh misery today as a poll showed Labour&#39;s lead surging to 24 points - while separate research suggested Reform UK is benefiting from buzz about a Nigel Farage comeback. YouGov&#39;s first survey of 2024 saw backing for Keir Starmer&#39;s party rising from 43 per cent to 46 per cent."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/24037048.no-stone-unturned-post-office-horizon-scandal-says-mp/",
        "title": "&#39;No stone unturned&#39; in Post Office Horizon scandal, says MP",
        "description": "North Yorkshire MP and Postal Services minister Kevin Hollinrake says those responsible for the Post Office Horizon scandal must be held to account."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/war-gaza-west-stand-dock-alongside-israel-genocide-court",
        "title": "War on Gaza: The West will stand in the dock alongside Israel at the genocide court",
        "description": "Israel’s allies aren’t just turning a blind eye to Gaza’s killing fields. They have cheered on the bloodshed, provided diplomatic cover and supplied the arms"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12942077/Labour-Manchester-mayor-Andy-Burnham-slams-Keir-Starmer-28bn-green-investment-plan.html",
        "title": "Labour Manchester mayor Andy Burnham slams <b>Keir Starmer</b> for watering down £28bn a year green investment plan as he says leader should &#39;stick to his guns&#39; and plough money into ...",
        "description": "Burnham told Sir Keir to &#39;stick to your guns&#39; after the opposition leader said he may scale down the investment given the bleak financial picture he would inherit if he becomes prime minister."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67893447",
        "title": "Prime Minister&#39;s Questions: Which subjects dominated in 2023?",
        "description": "Thirteen of those questions on health were about NHS waiting lists. The prime minister made cutting waiting lists one of his priorities at the start of last year, but waits for non-emergency treatment in England rose to 7.71m in October 2023, almost half a million higher than they were at the start of the year."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24036910.justice-secretary-talks-judges-quashing-horizon-convictions/",
        "title": "Justice Secretary in talks with judges over quashing Horizon convictions",
        "description": "The Justice Secretary was holding crunch talks with judges on Tuesday on expediting clearing the names of hundreds of subpostmasters who were wrongfully convicted in the Horizon scandal. Work and Pensions Secretary Mel Stride,"
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24036248.ministers-scramble-speed-overturning-post-office-convictions/",
        "title": "Ministers scramble to speed up the overturning of Post Office convictions",
        "description": "Labour Party leader Sir <b>Keir Starmer</b> said that the convictions need to be looked at again (Stefan Rousseau/PA) And he said that “full and final” compensation has already been paid to 64% of those affected, as he vowed that securing justice was his ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/who-win-next-general-election-polls-092628332.html",
        "title": "Who will win the next general election? Latest polls and odds",
        "description": "With Rishi Sunak having said he is planning to call the next general election in the second half of this year, everything is pointing to Sir <b>Keir Starmer</b>’s Labour forming the UK’s next government. Here, Yahoo News UK looks at how the polls have changed ..."
    }
]