[
    {
        "url": "https://www.ibtimes.co.uk/labour-proposes-extension-equal-pay-rights-black-asian-minority-staff-1723273",
        "title": "Labour Proposes Extension of Equal Pay Rights to Black, Asian and Minority Staff",
        "description": "<b>Keir Starmer</b> initially pledged a race equality act in 2020 and established a task force chaired by Doreen Lawrence. However, the party&#39;s lack of specific details raised concerns about its dedication to addressing structural racism. Shadow women and ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/starmer-to-announce-scaling-back-of-28-billion-a-year-green-pledge-110049/",
        "title": "<b>Starmer</b> ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "An announcement on the party’s flagship green prosperity plan is expected to be made on Thursday. Sir Keir Starmer is due to confirm that the pledge is being scaled back due to the changed economic landscape since it was first unveiled in 2021, according to multiple reports."
    },
    {
        "url": "https://inews.co.uk/news/labour-drop-green-28bn-pledge-starmer-2895718",
        "title": "Labour to confirm dropping £28bn a year green investment pledge",
        "description": "Labour will confirm it is dropping a pledge to spend £28bn a year on green investment if it enters government, following weeks of confusion about the flagship policy. Sir Keir Starmer had originally promised in 2021 to invest £28bn annually until 2030 on green projects if Labour came to power."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864329/Keir-Starmer-green-investment-plan-scrapped",
        "title": "Sir <b>Keir Starmer</b> expected to confirm scaling back of £28bn green pledge",
        "description": "Sir Keir Starmer is set to confirm on Thursday that Labour is scaling back a £28 billion green investment pledge following weeks of uncertainty. The Labour leader will announce the latest u-turn despite insisting for weeks that he intended to meet the commitment."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/07/keir-starmer-to-announce-scaling-back-of-28bn-green-investment-plan",
        "title": "<b>Starmer</b> to announce scaling back of £28bn green investment plan",
        "description": "Labour leader to say move is down to economic uncertainty caused by Tory government, sources say"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864263/keir-starmer-anti-israel-mob-protests-labour-event",
        "title": "<b>Keir Starmer</b> &#39;running scared&#39; of anti-Israel mob as he pulls out of event at last minute",
        "description": "Sir <b>Keir Starmer</b> was accused of &quot;running scared&quot; of anti-Israel protesters after he pulled out of reception in Birmingham for his West Midlands Mayor candidate Richard Parker this evening at the last minute. Decision was communicated to attendees at the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/sir-keir-starmer-meets-brianna-28588116",
        "title": "Sir <b>Keir Starmer</b> meets Brianna Ghey&#39;s mother in Parliament",
        "description": "Sir Keir Starmer has met with the mother of murdered teenager Brianna Ghey in Parliament, in the wake of the sentencing of her daughter&#39;s killers. Esther Ghey is now campaigning for under-16s to be blocked from accessing social media on smartphones and for stronger parental controls to flag potentially harmful searches to parents."
    },
    {
        "url": "https://www.politics.co.uk/parliament/pmqs-keir-starmer-calls-shame-after-pm-makes-transgender-dig/",
        "title": "PMQs: <b>Keir Starmer</b> calls ‘shame’ after PM makes transgender dig",
        "description": "At prime minister’s questions today, Labour leader Keir Starmer called “shame” after Rishi Sunak made a dig at his stance of self-identification. In an exchange about the PM’s pledge to cut NHS waiting times,"
    },
    {
        "url": "https://www.thenational.scot/news/24103491.former-scottish-labour-minister-keir-starmer-can-ignore-muslims/",
        "title": "Former Scottish Labour minister: &#39;<b>Keir Starmer</b> can ignore Muslims&#39;",
        "description": "A FORMER Scottish Labour MP and minister has been accused of Islamophobia by the Muslim Association of Britain"
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/opinion/comment/24100451.letters-keir-starmer-specialises-making-u-turns/",
        "title": "Letters: &#39;<b>Keir Starmer</b> specialises in making u-turns&#39;",
        "description": "The script has been edited and they will not be investing £28 billion every year on green initiatives. In yet another U-turn by <b>Keir Starmer</b>, he and his lieutenants are rewriting their scripts in an effort to cosy up to big business and avoid bad reviews ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/07/labour-power-party-keir-starmer?ref=mc.news",
        "title": "<b>Keir Starmer</b>’s method has worked so far – now begins his toughest test",
        "description": "Election campaigns are about making the political weather. And on that crucial test, Labour is struggling, says the Guardian columnist Rafael Behr"
    },
    {
        "url": "https://www.thetimes.co.uk/article/your-three-minute-digest-gfcjdxs5g",
        "title": "Your three-minute digest",
        "description": "Sir Keir Starmer will scale back Labour’s £28 billion green spending pledge within weeks despite saying the investment is “desperately needed”. The Labour leader is preparing to announce a new"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rachel-reeves-labour-keir-starmer-gdp-treasury-b1137797.html",
        "title": "<b>Starmer</b> ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "An announcement on the party’s flagship green prosperity plan is expected to be made on Thursday. Sir Keir Starmer is due to confirm that the pledge is being scaled back due to the changed economic landscape since it was first unveiled in 2021, according to multiple reports."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-prime-minister-labour-rishi-sunak-laura-trott-b1137785.html",
        "title": "Brianna Ghey’s father demands apology from Sunak over transgender jibe",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender joke in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.channel4.com/news/sunak-trans-jibe-calls-for-pm-to-apologise-over-comments-in-pmqs",
        "title": "Sunak trans jibe: calls for PM to apologise over comments in PMQs",
        "description": "Rishi Sunak is facing calls to apologise for making a transgender dig at Sir Keir Starmer during PMQs, while Brianna Ghey’s mother was visiting parliament. The Labour leader accused him of shameful behaviour, while Brianna’s father, Peter Spooner, said the comments were “dehumanising” and “degrading”."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/brianna-gheys-father-demands-apology-28589994",
        "title": "Brianna Ghey’s father demands apology from Rishi Sunak over &#39;dehumanising&#39; transgender remark",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender remark in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.ft.com/content/abb231af-bb95-4264-9209-3864fac0e464",
        "title": "Labour set to ditch target to spend £28bn a year on green investment",
        "description": "Starmer is poised to use a set piece event to drop the £28bn figure from Labour’s “green prosperity plan”, blaming the worsening public finances under the Conservative government. “There will be an announcement tomorrow,” said a Labour spokesperson."
    },
    {
        "url": "https://www.thesun.co.uk/news/25793766/electric-vehicles-truth-tackle-climate-change/",
        "title": "Green tech like EVs turns out to be a very uncunning plan… we need the truth to tackle climate change",
        "description": "SALES of electric cars are falling sharply. Monthly forecourt purchases of these vehicles, which will save the world from burning to bits, fell 17 per cent at the end of last year when compared"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-needs-steady-ship-2895650",
        "title": "<b>Starmer</b> needs to steady his ship",
        "description": "The Labour leader may look like he is cruising, but to lead an effective government he will need to get his own house in order"
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/sister-of-transwoman-who-died-awaiting-gender-affirming-care-criticises-sunak",
        "title": "Sister of transwoman who died awaiting gender-affirming care criticises Sunak&#39;s &#39;devastating&#39; jibe",
        "description": "The prime minister has come under pressure to apologise for accusing Sir Keir Starmer of having difficulty in &#39;defining a woman&#39;. | ITV National News"
    },
    {
        "url": "https://uk.news.yahoo.com/uks-sunak-criticised-over-trans-195454796.html",
        "title": "UK&#39;s Sunak criticised over trans jibe",
        "description": "Opposition politicians demanded UK Conservative Prime Minister Rishi Sunak apologise Wednesday for making a jibe about transgender people in parliament.A spokeswoman for Sunak declined to apologise when pressed by reporters after,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/labour-weaponised-brianna-ghey-murder-says-kemi-badenoch/",
        "title": "Labour weaponised Brianna Ghey murder, says Kemi Badenoch",
        "description": "Rishi Sunak criticised for saying Keir Starmer has difficulty ‘defining a woman’ while the trans teenager’s mother attended PMQs"
    },
    {
        "url": "https://www.thetimes.co.uk/article/cbis-call-to-labour-over-workers-rights-falls-on-deaf-ears-jf5mnl9rg",
        "title": "CBI’s call to Labour over workers’ rights falls on deaf ears",
        "description": "MPs and unions hit back after business lobby group warns of potential damage to productivity from employment plans"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/sunak-strike-crackdown-could-breach-brexit-trade-deal/",
        "title": "Sunak strike crackdown could breach Brexit trade deal, EU claims",
        "description": "The European Union has accused Britain of potentially breaching the Brexit trade deal with Rishi Sunak’s crackdown on strikes. Brussels is considering whether to trigger a formal dispute with No 10 over the introduction of minimum service levels."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7196461",
        "title": "Politics latest: Tory MP tells Sunak to meet Brianna Ghey&#39;s family after &#39;disgraceful&#39; transgender jibe",
        "description": "The first topic we are discussing tonight on Politics Hub With Sophy Ridge is the criticism levelled at Rishi Sunak for aiming a political jibe about transgender people at Labour leader Sir <b>Keir Starmer</b> - while murder victim Brianna Ghey&#39;s mother Esther ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/clapham-chemical-attack-suspects-injuries-could-be-fatal-if-untreated-police-say-as-they-reveal-last-sighting-near-londons-vauxhall-bridge/",
        "title": "Clapham chemical attack suspect&#39;s injuries could be &#39;fatal&#39; if untreated, police say, as they reveal last sighting near London&#39;s Vauxhall Bridge",
        "description": "Police have said the Clapham chemical attack suspect&#39;s injuries could be fatal if they remain untreated - as they revealed he was last seen crossing London&#39;s Vauxhall Bridge at 11pm and then walking next to the River Thames on the night of the incident."
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/hunt-admits-treasurys-costing-of-labour-energy-efficiency-plans-may-be-wrong",
        "title": "Chancellor admits Treasury&#39;s costing of Labour&#39;s energy efficiency plans may not be correct",
        "description": "Peston challenged the assumptions that Treasury officials were given by the chancellor’s aides when making the calculations, in particular that a Labour government would not means-test any grants given to homeowners or share the costs with energy companies."
    },
    {
        "url": "https://news.sky.com/video/share-13066288",
        "title": "Sunak doesn&#39;t need to apologise for transgender jibe, says minister",
        "description": "Rishi Sunak has been criticised for aiming a political jibe about transgender people at Labour leader Sir Keir Starmer - while murder victim Brianna Ghey&#39;s mother Esther attended PMQs."
    },
    {
        "url": "https://www.thenational.scot/news/24105222.rishi-sunak-defends-trans-joke-in-front-brianna-gheys-mother/?sent_id=PREVIEW&secret=PREVIEW",
        "title": "Rishi Sunak defends making trans joke in front of Brianna Ghey&#39;s mother",
        "description": "During an exchange with Labour leader <b>Keir Starmer</b>, the Prime Minister attempted to skewer his opponent over the breaking of previous campaign promises. He said: “We are bringing the waiting lists down for the longest waiters and making progress ..."
    }
]