[
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmers-christmas-message-full-31740218",
        "title": "<b>Keir Starmer</b>&#39;s Christmas message in full as he thanks NHS, postal and hospitality workers",
        "description": "During the holidays many of you will be serving your community, and our country…On behalf of the Labour Party, I send my heartfelt thanks and gratitude to all of you for what you do.“"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12897365/Boost-Rishi-Sunak-increases-hopes-tax-cuts.html",
        "title": "Boost for Rishi Sunak as &#39;Santa rally&#39; increases hopes of tax cuts in Spring Budget providing dose of optimism for struggling families",
        "description": "Rising share values are a signal of optimism on markets and will bring a dose of Christmas cheer to millions of British savers - including those with pension plans - and business leaders."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153667/sun-says-keir-starmer-green-pledge/",
        "title": "Sneaky Sir <b>Keir Starmer</b> cannot be allowed to pull the wool over the eyes of voters",
        "description": "Keir must not fool voters on eco plans SLIPPERY Sir Keir Starmer is quietly trying to wriggle out of his reckless £28 billion eco splurge. The Labour leader is now plotting behind the scenes to"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nhs-dentistry-rotting-decay-after-31741388",
        "title": "&#39;NHS dentistry is rotting and in decay after 13 years of Tory neglect&#39;",
        "description": "The Tories may be happy to wave goodbye to the vital public service of NHS dentistry, writes Shadow Healthy Secretary Wes Streeting, but Labour won’t let that happen."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848736/dyson-rishi-sunak-liz-truss",
        "title": "James Dyson praises Liz Truss in stinging swipe at Rishi Sunak as UK on brink of recession",
        "description": "Recent stats show the UK economy shrank in the last quarter, painting a damning image of Mr Sunak&#39;s current economic strategy."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/23/assisted-dying-drugs-patients-not-take-oregon-suicide/",
        "title": "Third of patients given lethal drugs under right-to-die laws ‘do not take them’",
        "description": "Studies of US states show many prescribed assisted dying pills change their mind and experts say prescription is used as ‘insurance policy’"
    },
    {
        "url": "https://www.thetimes.co.uk/article/swords-squirrels-and-psychodrama-tim-shipmans-2023-political-awards-kk3r0v9ss",
        "title": "Swords, squirrels and psychodrama: Tim Shipman’s 2023 political awards",
        "description": "Britain’s political pantomime reached a fever pitch in 2023 — with arrests, embarrassing explanations, cringeworthy TV gaffes and chaotic photo ops"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/23/labour-mp-abused-racial-charged-taxpayer-equality-training/",
        "title": "Labour MP who abused journalist ‘with racial overtones’ charged taxpayers for equality training",
        "description": "Sir Keir Starmer faces calls from within party to withdraw whip from Neil Coyle for second time over ‘outrage’"
    },
    {
        "url": "https://www.theguardian.com/society/2023/dec/23/two-former-health-secretaries-join-calls-for-new-law-on-assisted-dying",
        "title": "Two former health secretaries join calls for new law on assisted dying",
        "description": "Senior Conservative and Labour figures said they would back changes to legislation on the issue in England and Wales"
    },
    {
        "url": "https://www.thenational.scot/news/24010051.tony-blair-institute-rakes-140-million-revenues-2023/",
        "title": "Tony Blair Institute rakes in $140 million in revenues during 2023",
        "description": "FORMER prime minister Tony Blair’s institute is set to make $140 million in annual revenues after providing advice to more than 40"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-considers-scrapping-labours-135206434.html",
        "title": "<b>Keir Starmer</b> considers scrapping Labour&#39;s £28bn green investment plans",
        "description": "KEIR Starmer is reportedly considering scaling back Labour ’s £28 billion green investment plans. The Labour leader has long promised that, if elected prime minister, his party would invest £28 billion in green capital investment every year until 2030."
    },
    {
        "url": "https://uk.news.yahoo.com/britain-money-running-keir-starmer-180028384.html",
        "title": "Britain’s money is running out. <b>Keir Starmer</b> will have one year to fix it",
        "description": "Assume that the opinion polls are right. Suppose that, at some point in 2024, Sir Keir Starmer wins a three-figure majority. What then?"
    },
    {
        "url": "https://www.thenational.scot/news/24009880.labour-mp-charges-taxpayers-equality-course-racial-incident/",
        "title": "Labour MP charges taxpayers for equality course after racial incident",
        "description": "Neil Coyle, who rejoined <b>Keir Starmer</b>’s party after having the whip restored earlier this year, claimed £295 in expenses for the course, as first reported by The Independent. The MP for Bermondsey and Old Southwark was suspended from Labour last year ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/labour-green-investment-plan-starmer-reeves-b2468788.html",
        "title": "The green problem that Labour still needs to tackle",
        "description": "Keir Starmer and Rachel Reeves may think they are so far ahead in the opinion polls that they can afford to ignore their £28bn problem, writes John Rentoul"
    },
    {
        "url": "https://www.heraldscotland.com/sport/24009697.postecoglou-super-league-constructed-people-detached-football/",
        "title": "Postecoglou: Super League constructed by people detached from football",
        "description": "Tottenham Ange Postecoglou insists the European Super League has been constructed by people detached from game."
    },
    {
        "url": "https://www.christiantoday.com/article/warnings.sounded.against.assisted.suicide.amid.fresh.calls.for.law.change/141201.htm",
        "title": "Warnings sounded against assisted suicide amid fresh calls for law change",
        "description": "Critics of a change to the law have warned against introducing assisted suicide because of the risk to vulnerable people. They point to countries like Canada, Belgium and the Netherlands where legalisation has been a &quot;slippery slope&quot; towards ever expanding criteria, including assisted suicide for mental health issues and minors."
    },
    {
        "url": "https://www.theguardian.com/lifeandstyle/2023/dec/23/from-bleak-sunak-to-bad-santa-the-best-and-worst-political-christmas-cards",
        "title": "From bleak Sunak to bad Santa: the best and worst political Christmas cards",
        "description": "Keir Starmer has his eyes on the prize, Liz Truss looks serene and Boris Johnson lives down to expectations"
    },
    {
        "url": "https://inews.co.uk/sport/football/chelsea-fans-livid-christmas-eve-journeys-wolves-2822607",
        "title": "‘Total disrespect’: Chelsea fans livid at Christmas Eve journeys to play Wolves",
        "description": "Thousands of Chelsea fans face convoluted journeys to the Midlands on the first Christmas Eve Premier League game in 28 years"
    },
    {
        "url": "https://uk.yahoo.com/news/labour-mp-charges-taxpayers-equality-130002545.html",
        "title": "Labour MP charges taxpayers for equality course after suspension over racial slur",
        "description": "Neil Coyle, who rejoined <b>Keir Starmer</b>’s party after having the whip restored earlier this year, claimed £295 in expenses for the course, as first reported by The Independent. The MP for Bermondsey and Old Southwark was suspended from Labour last year ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-67806080.amp",
        "title": "Christmas silent nights welcome after bruising NI political talks",
        "description": "At the same time, relations between the Democratic Unionist Party (DUP) and Northern Ireland Secretary Chris Heaton-Harris were left battered and bruised after he apparently blindsided the party at Hillsborough. Christmas can be a testing time for relationships but we didn&#39;t expect this."
    },
    {
        "url": "https://www.politicshome.com/news/article/nigel-farage-reform-rishi-sunak-nightmare",
        "title": "Nigel Farage Could Turn Rishi Sunak&#39;s Reform Problem Into An Absolute Nightmare",
        "description": "The possibility of Reform taking crucial votes from the Conservative party at the 2024 general election is a headache for Prime Minister Rishi"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848261/keir-starmer-labour-rishi-sunak-tories-election",
        "title": "<b>Keir Starmer</b> warned he&#39;s as unpopular as Labour leaders who never became PM",
        "description": "Neither the Labour leader nor Rishi Sunak are popular with voters, suggested Sir John Curtice, as Britain gears up for 2024 general election."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/how-labour-plans-to-goad-bottler-sunak-into-calling-a-spring-election_uk_658558b5e4b03e698a12c4d1?d_id=7108139&ncid_tag=fcbklnkukhpmg00000001",
        "title": "How Labour Plans To Goad &#39;Bottler&#39; Sunak Into Calling A Spring Election",
        "description": "Rishi Sunak this week confirmed what the world and his wife already knew - the general election will take place next year. Addressing political journalists at a Christmas reception in Downing Street,"
    },
    {
        "url": "https://news.sky.com/story/the-week-we-try-to-predict-all-of-2024-13034884",
        "title": "The Week... We try to predict all of 2024",
        "description": "Two of Westminster&#39;s best-connected journalists, Sky News&#39;s Sam Coates and Politico&#39;s Jack Blanchard, usually guide us through their predictions of how British politics will play out over the next seven days - but in this episode they attempt to predict an entire"
    },
    {
        "url": "https://www.expressandstar.com/news/voices/opinions/toby-neal/2023/12/23/christmas-classics-youll-barely-believe/",
        "title": "Christmas classics you’ll barely believe",
        "description": "FIFTY SHADES OF GREY. Slick and well-groomed leading man Sir Keir Starmer the Charmer goes through various contortions as he adopts multiple positions in this controversy-free movie. Despite the subject matter this was the verdict of the critics: &quot;Uninteresting,&quot; &quot;intentionally dull,&quot; and &quot;devoid of any excitement whatsoever.&quot;"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-67809048.amp",
        "title": "Newspaper headlines: &#39;Christmas getaway hell&#39; and UN backs more Gaza aid",
        "description": "The Telegraph leads on an interview with businessman Sir James Dyson, who tells the paper the UK needs to focus on growth rather than cutting inflation. He also praises the policies of Liz Truss and Kwasi Kwarteng, adding that wealth generation and growth had become &quot;dirty words&quot;."
    },
    {
        "url": "https://www.bridgwatermercury.co.uk/your_say/inthespotlight/23938358.bridgwater-year-review-biggest-stories-2023/",
        "title": "Bridgwater year in review: The biggest stories of 2023",
        "description": "As the year draws to a close, the Bridgwater Mercury takes a look back at some of the biggest and quirkiest stories we covered."
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/scottish-parliament-has-become-a-job-creation-scheme-for-mediocre-party-activists-susan-dalgety-4454583",
        "title": "Scottish Parliament has become a job creation scheme for mediocre party activists – Susan Dalgety",
        "description": "Whether Sir <b>Keir Starmer</b> will prove to be the knight in shining armour that Sommerville hopes is a matter of conjecture. Faced with his own bulging in-tray, piled high with evidence of the chaos caused by 14 years of Tory in-fighting and incompetence ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153570/sir-keir-starmer-green-warning-u-turn/",
        "title": "<b>Keir Starmer</b> accused of trying to ‘pull wool over people’s eyes’ amid talk he is set to U-turn on £28bn green splurge",
        "description": "SIR <b>Keir Starmer</b> has been accused of trying to “pull the wool over people’s eyes” amid talk he is preparing to flip flop on his £28billion green splurge. Labour made promises to spend the massive sum on eco projects by 2028. But leader Sir <b>Keir</b> and ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/96793cf2-95b3-4baf-8532-c18a362fb3b5?shareToken=0a9f28459f1a279bc7650383d81c0351",
        "title": "Live facial-recognition cameras catch 22 criminals in one day",
        "description": "A change in government is unlikely to influence it, unless a libertarian wave sweeps over Sir <b>Keir Starmer</b> and he decides to pass European-style legislation banning its use. But in the meantime, the fate of those criminals on the police watchlist will be ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12893007/british-army-orders-400-soldiers-recruitment-offices.html",
        "title": "Army moves hundreds of troops from front line to recruitment offices because force is shrinking too quickly after falling by more than 3,000 troops in last year",
        "description": "It&#39;s an outrage.&#39; Speaking of the woes, John Healey, Labour&#39;s shadow defence secretary - who was this week out in Estonia with <b>Keir Starmer</b> visiting UK troops- told The Times: &#39;Over 13 years Conservative ministers have cut the army to its smallest size ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-military-photo-estonia-b2468597.html",
        "title": "<b>Keir Starmer</b> channels Thatcher with military photo op",
        "description": "<b>Keir Starmer</b> wants to follow Margaret Thatcher’s footsteps into No 10, but for now the Labour leader is echoing her symbolic gestures on the battlefield. Sir <b>Keir</b> donned some striking combat fatigues on a visit to troops stationed in Estonia – the ..."
    },
    {
        "url": "https://inews.co.uk/culture/film/ken-loach-keir-starmer-man-no-principles-2805455?ito=facebook_share_article-top",
        "title": "Ken Loach: ‘<b>Keir Starmer</b> is a man of no principles’",
        "description": "but saves particular ire for Labour leader <b>Keir Starmer</b>. “<b>Starmer</b> is meant to be a human rights lawyer. How can’t he say, ‘Stop the killing now,’ and [why does he] still suggest no sanctions? He’s a man of no principles.” Rather than trying to ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23037639.nicola-sturgeon-detests-tories-detest-politics/?ref=habersitesi.org",
        "title": "Nicola Sturgeon detests the Tories but we should detest these politics",
        "description": "WELL, hasn&#39;t that been a useful exercise? We now know <b>Keir Starmer</b> doesn&#39;t detest the Tories but &quot;fundamentally disagrees&quot; with them. Anyone paying even a passing glance worth of attention probably already knew the latter but likely hadn&#39;t thought to care ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12895561/Will-Keir-Starmer-water-28bn-green-plans.html",
        "title": "Will &#39;flip-flop&#39; <b>Keir</b> water down £28bn green plans? Labour leader considers scaling back policy amid fears it will be seized upon by Tories at the general election",
        "description": "The Labour leader had pledged to borrow the vast sum to pay for green initiatives - including investing in jobs and energy independence."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24009550.labour-mp-suspended-racial-incident-charged-taxpayers-equality-course/",
        "title": "Labour MP suspended for racial incident ‘charged taxpayers for equality course’",
        "description": "Neil Coyle, who rejoined Sir Keir Starmer’s party after having the whip restored earlier this year, claimed £295 in expenses for the course."
    }
]