[
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-covid-inquiry-live-31643920",
        "title": "Covid Inquiry RECAP: Rishi Sunak denies calling free school meal parents &#39;freeloaders&#39;",
        "description": "Rishi Sunak, who was branded &#39;Dr Death&#39; by Government scientists, issued an apology to bereaved families at the start of his Covid Inquiry grilling"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/starmer-to-say-his-changes-to-labour-have-been-for-working-people-105723/",
        "title": "<b>Starmer</b> to say his changes to Labour have been ‘for working people’",
        "description": "Sir Keir Starmer will say his changes to Labour have been to “restore the party to the service of working people”, as he gives a keynote speech marking the four-year anniversary of the 2019 election. The Labour leader will on Tuesday appeal directly to Tory voters, promising a government dedicated to economic stability and the rule of law."
    },
    {
        "url": "https://www.thenational.scot/news/23981261.keir-starmer-set-attack-tory-broken-promises-immigration/",
        "title": "<b>Keir Starmer</b> set to attack Tory &#39;broken promises&#39; on immigration",
        "description": "And, according to The Sun, Starmer is set to hit out at the Tories for breaking promises on immigration. He is also understood to claim that ministers have thrown open jobs to those coming from abroad rather than creating jobs and training those in the UK."
    },
    {
        "url": "https://socialistworker.co.uk/news/tory-rows-over-the-rwanda-plan-could-sink-sunak/",
        "title": "Tory rows over the Rwanda plan could sink Sunak",
        "description": "Its leadership may not say this outright, but that’s the message. <b>Keir Starmer</b>’s consistent line is that Labour would “smash the smuggling gangs” to stop the crossings in the English Channel and secure Britain’s borders. For him this means being ..."
    },
    {
        "url": "https://www.ft.com/content/9c2df35f-555a-4c34-84e6-93e125d6c410?trk=public_post_comment-text",
        "title": "Britain won’t rejoin the EU for decades — if ever",
        "description": "Worse, it would divert attention and energy away from tackling many other economic and social challenges. Sir <b>Keir Starmer</b> knows this. Most important, the outcome would not be the UK’s to decide. The EU would want to be quite confident that the new ..."
    },
    {
        "url": "https://www.livemint.com/specials/green-protectionism-comes-with-big-risks-11702283729325.html",
        "title": "Green protectionism comes with big risks",
        "description": "Industrial policy is being tasked not just with firming up supply chains and redistribution, but also with accelerating the green transition. The solution is subsidies. Already these exist at scale, and with some success."
    },
    {
        "url": "https://www.wsws.org/en/articles/2023/12/11/itsg-d11.html",
        "title": "UK government snubs key NATO ally Greece over stolen Parthenon sculptures",
        "description": "The statues and friezes, which formed part of the Parthenon temple built in the fifth century BC, are known in the UK as the “Elgin marbles” because they were removed in the early 1800s by Lord Elgin,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jeremy-corbyn-conservative-keir-starmer-prime-minister-tory-party-b1126287.html",
        "title": "<b>Starmer</b> to say his changes to Labour have been ‘for working people’",
        "description": "Sir Keir Starmer will say his changes to Labour have been to “restore the party to the service of working people”, as he gives a keynote speech marking the four-year anniversary of the 2019 election. The Labour leader will on Tuesday appeal directly to Tory voters, promising a government dedicated to economic stability and the rule of law."
    },
    {
        "url": "https://www.economist.com/britain/2023/12/11/britain-needs-more-houses-does-the-industry-want-to-build-them",
        "title": "Britain needs more houses. Does the industry want to build them?",
        "description": "B ritain’s politicians are beginning to compete to put up more houses. Sir Keir Starmer, Labour’s leader, pledges to be a “builder, not a blocker”: his party promises to o"
    },
    {
        "url": "https://insidecroydon.com/2023/12/11/calls-for-ruskin-house-to-cancel-tasteless-keir-aoke-event/",
        "title": "Calls for Ruskin House to cancel ‘tasteless’ <b>Keir</b>-aoke event",
        "description": "Trades unionists in Croydon are calling on the management of Ruskin House – the HQ of trades unionism in the borough as well as the offices of the Morning Star newspaper – to cancel a"
    },
    {
        "url": "https://speakerpolitics.co.uk/opinion/beyond-bricks-and-mortar-understanding-the-housing-crisis-in-the-uk/",
        "title": "Beyond Bricks and Mortar: Understanding the Housing Crisis in the UK",
        "description": "The Right to Buy scheme, popularised by Thatcher, continued by Blair, and turbocharged by Cameron, is also a major contributor. Those in social housing were able to buy their houses at a discounted rate, which whilst increasing homeownership, significantly diminished the availability of affordable housing."
    },
    {
        "url": "https://www.itv.com/news/wales/2023-12-11/tough-times-have-led-to-drop-in-popularity-for-first-minister",
        "title": "First Minister says &#39;tough times&#39; have led to fall in popularity",
        "description": "Mark Drakeford addressed recent poll findings as he reflected on the past year with ITV Wales&#39; Sharp End. | ITV News Wales"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/dont-boil-cut-broccoli_uk_65772f59e4b0881b7917ed9d",
        "title": "Here&#39;s Why You Should Never Boil Chopped Broccoli",
        "description": "Of course, nutritionists say boiling broccoli means you lose a lot of nutrients in the water, so if you choose to steam it instead, simply trim the stem of the entire head so the"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/11/rishi-sunak-latest-news-rwanda-plan-grant-shapps-live/",
        "title": "Politics latest news: Tory rebels urge Sunak to pull Rwanda Bill",
        "description": "Only one in 200 migrant appeals against being sent to Rwanda would succeed under the Government’s new deportation plan, Grant Shapps has claimed. The Defence Secretary said Home Office modelling suggested the “vast majority” of appeals from asylum seekers attempting to block being sent to Rwanda would fail."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-mp-presents-bill-suspend-144122187.html",
        "title": "Labour MP presents bill to suspend UK arms sales to Israel",
        "description": "A LABOUR MP is set to present a bill to parliament to suspend the sale of arms to Israel. On Monday, Zarah Sultana, Labour MP for Coventry South, announced she would be presenting the Arms Trade (Inquiry and Suspension) Bill."
    },
    {
        "url": "https://www.varsity.co.uk/interviews/26664",
        "title": "‘We’ve got to make it harder for the charlatans’: Alastair Campbell on why and how politics needs to change",
        "description": "Abby Reyes sits down with the former spin doctor to discuss ‘disagreeing agreeably’, why the Tories need ‘jail’ and what Labour can improve on"
    },
    {
        "url": "https://www.thenational.scot/news/23982139.zarah-sultana-presents-bill-suspend-arms-sales-israel/",
        "title": "Zarah Sultana presents bill to suspend arms sales to Israel",
        "description": "A LABOUR MP is set to present a bill to parliament to suspend the sale of arms to Israel. On Monday, Zarah Sultana, Labour MP for Coventry South, announced she would be presenting the Arms Trade (Inquiry and Suspension) Bill."
    },
    {
        "url": "https://www.aljazeera.com/news/2023/12/11/rwanda-row-pm-sunak-who-pledged-to-stop-the-boats-faces-crucial-test",
        "title": "Rwanda row: PM Sunak, who pledged to ‘stop the boats’, faces crucial test",
        "description": "Sunak’s Conservatives criticise the plan to deport refugees from the UK to Rwanda as contradicting international law."
    },
    {
        "url": "https://www.biznews.com/global-citizen/2023/12/11/%F0%9F%94%92-ending-stagnation-report-reveals-britains-economic-decline-matthew-brooker",
        "title": "🔒 Ending stagnation report reveals Britain’s economic decline, urges critical reforms – Matthew Brooker",
        "description": "In the wake of a revelation by London-based think tank The Resolution Foundation, Matthew Brooker dissects Britain&#39;s stark economic decline."
    },
    {
        "url": "https://morningstaronline.co.uk/article/b/corbyn-joins-pro-palestine-protest-liverpool",
        "title": "Corbyn joins pro-Palestine protest in Liverpool",
        "description": "HUNDREDS gathered outside Liverpool Metropolitan Cathedral today to call for an end to Israel’s bombardment of Gaza. Among the speakers was Haneen Awaad, a Palestinian Liverpudlian from Scousers for Palestine, and former Labour leader Jeremy Corbyn."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2023/12/rishi-sunak-problems-go-much-deeper-than-rwanda-bill",
        "title": "Sunak’s insistence he’s in control only proves he’s not",
        "description": "Conservative infighting risks obscuring any policy successes the Prime Minister enjoys."
    },
    {
        "url": "https://www.scmp.com/news/world/europe/article/3244609/nigel-farage-eyeing-return-uk-politics-maybe",
        "title": "Is Nigel Farage eyeing a return to UK politics? Maybe",
        "description": "The Brexit figurehead has in recent weeks teased the idea of rejoining the struggling ruling Conservative party, which he quit 30 years ago in protest over its stance on Europe."
    },
    {
        "url": "https://bylinetimes.com/2023/12/11/major-political-reform-could-secure-key-labour-target-voters-study-suggests/",
        "title": "Major Political Reform Could Secure Key Labour Target Voters, Study Suggests",
        "description": "Focus groups emphasised the lack of trust in politicians to deliver reform, but the findings point to a vote-winning opportunity for political parties, especially Labour, if they are able to prove that they are serious about reforming how politics is conducted, the campaign groups argue."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23980309.victory-sarwar-next-year-build-path-victory/",
        "title": "Victory for Sarwar? Next year could build the path to victory",
        "description": "It is May 9th 2026 – a Saturday, late in the afternoon. Scotland’s political correspondents gather in stately gardens, sitting before a"
    },
    {
        "url": "https://www.politico.eu/article/behind-the-scenes-cop28-climate-change-summit-billionaire-businessman-andrew-forrest/",
        "title": "Behind the scenes: A billionaire at COP28",
        "description": "Australian tycoon Andrew Forrest has made a big bet — that after building a mining empire, his next fortune will come from the green transition."
    },
    {
        "url": "https://uk.style.yahoo.com/want-survive-apocalypse-forget-government-100000664.html",
        "title": "Want to survive the apocalypse? Forget the Government’s new website, take my advice instead",
        "description": "It was at a visit this week to Porton Down, that science and technology campus in Wiltshire (where boffins create viruses and store vials of cholera, when they’re not fishing inside the brains of captured aliens) that Deputy PM Oliver Dowden let slip that he’s compiling a long and scary and frightening and secret list that he’ll reveal next year."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/11/next-uk-election-set-to-be-most-unequal-in-60-years-study-finds?trk=public_post_comment-text",
        "title": "Next UK election set to be most unequal in 60 years, study finds",
        "description": "Voter turnout gap between top and bottom earners growing since 60s, says IPPR thinktank"
    },
    {
        "url": "https://menafn.com/1107569041/Plan-by-Conservative-rebels-to-destabilize-UK-PMs-government-to-reinstall-Boris-as-leader",
        "title": "Plan by Conservative rebels to destabilize UK PM`s government to reinstall Boris as leader",
        "description": "A reported plan among Conservative rebels to destabilize United Kingdom Prime Minister Rishi Sunak&#39;s government and reinstall Boris Johnson as leader"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/rishi-sunak-heads-into-a-perilous-week/",
        "title": "Rishi Sunak heads into a perilous week",
        "description": "Listen to the latest episode of Politics at Jack and Sam’s, with our Jack Blanchard and Sky’s Sam Coates, to get the full rundown on what’s coming up in the political week ahead. HE COULD DO WITHOUT THIS: Prime Minister Rishi Sunak takes to the stand at the COVID probe in Dorland House,"
    },
    {
        "url": "https://www.thesun.co.uk/news/25007536/rishi-sunak-rwanda-bill-brexit/",
        "title": "Rishi’s Rwanda bill is beginning to feel a lot like Brexit…but this time Boris Johnson won’t be riding to Tories’ rescue",
        "description": "TOMORROW is the fourth anniversary of the biggest election earthquake in a generation. Only one party leader will mark that milestone with a punchy speech about Brexit and lowering migration — and"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/tory-plot-could-see-johnson-and-farage-return-in-leadership-tie-up-364852/",
        "title": "Tory plot could see Johnson and Farage return in leadership tie-up",
        "description": "&quot;The plan is we get him into the Lords, give him some brief like we did with Cameron, then go to the country with the dream team.&quot;"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23980222.letters-court-ruling-really-dark-day-devolution/",
        "title": "Letters: Court ruling really is a dark day for devolution",
        "description": "Humza Yousaf has declared the Court of Session ruling a “dark day for devolution” and indeed it is. Voters of all political colours who"
    },
    {
        "url": "https://uk.movies.yahoo.com/labour-prawn-cocktail-offensive-worked-060000418.html",
        "title": "Companies are rattled by Labour’s plans – but no one is sticking their head above the parapet",
        "description": "Save the prawns!” Tory grandee Lord Heseltine once joked, taking a shot at Labour’s so-called prawn cocktail offensive in the early 1990s as the party wined and dined big business."
    },
    {
        "url": "https://uk.style.yahoo.com/labour-prawn-cocktail-offensive-worked-060000418.html",
        "title": "Labour’s prawn cocktail offensive has worked – now it’s time for the main course",
        "description": "Save the prawns!” Tory grandee Lord Heseltine once joked, taking a shot at Labour’s so-called prawn cocktail offensive in the early 1990s as the party wined and dined big business."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/opinion/23977024.msp-stuart-mcmillan-thanks-contribution-kiltmas/",
        "title": "MSP Stuart McMillan thanks all for contribution to Kiltmas",
        "description": "INVERCLYDE MSP Stuart McMillan has used part of his Monday column in the Tele to thank all who contribute to the 12 Days of Kiltmas for"
    },
    {
        "url": "https://www.thenationalnews.com/world/uk-news/2023/12/11/sunak-rwanda-bill-covid-inquiry/",
        "title": "Rishi Sunak faces Rwanda bill dissent before Covid inquiry grilling",
        "description": "Meanwhile, sacked home secretary Suella Braverman echoed Mr Jenrick by raising concerns that the legislation does not tackle the issue of temporary Rule 39 injunctions from the European Court of Human Rights, which stopped last year’s flight."
    },
    {
        "url": "https://www.bbc.com/news/blogs-the-papers-67678102.amp",
        "title": "Newspaper headlines: Sunak &#39;fights for his future&#39; ahead of Rwanda vote",
        "description": "The PM could face threats to his leadership if MPs oppose his migration plans, several of Monday&#39;s front pages predict."
    },
    {
        "url": "https://www.deccanherald.com/opinion/is-britain-ready-to-be-honest-about-its-decline-2805728",
        "title": "Is Britain ready to be honest about its decline?",
        "description": "Britain has strengths, particularly in services. The country is the world’s second-largest exporter of services after the US. This pillar of growth goes well beyond financial services, whose share of exports fell to 9% last year from 12 per cent in 2022."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/succession-star-brian-cox-blasts-31639869",
        "title": "Succession star Brian Cox blasts Tory Government over &#39;awful&#39; Rwanda policy on asylum seekers",
        "description": "The legendary Scottish actor said it was time for a &quot;total rethink&quot; on how the UK handles refugees arriving in the country."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12848217/Chatter-grows-dream-ticket-Boris-Johnson-Nigel-Farage-supporters-former-PM-claim-need-ex-Brexit-Party-leader-leaves-Im-Celebrity-place.html",
        "title": "Chatter grows of a &#39;dream ticket&#39; of Boris Johnson and Nigel Farage as supporters of the former PM claim &#39;we need him back more than anything&#39; and the ex-Brexit Party leader ...",
        "description": "A group of Tory MPs who &#39;regret&#39; ousting Boris Johnson are behind an extraordinary bid to bring him back in the hope of saving the election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/voters-unconvinced-by-parties-growth-plans-z8n8hgz75",
        "title": "Voters unconvinced by parties’ growth plans",
        "description": "Neither the Conservatives nor Labour are seen as having a credible strategy to revive the economy, according to a YouGov poll"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844104/boris-johnson-mp-elections-conservatives",
        "title": "Boris Johnson could save Conservative Party in elections new reports have shown",
        "description": "Tory MPs have hatched a plan to bring Boris Johnson back in a bid to save the party from an election wipeout, reports have suggested"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844106/rishi-sunak-new-rwanda-bill-migration",
        "title": "Rishi Sunak&#39;s new Rwanda bill ‘stands on side of british people&#39;",
        "description": "Former home secretary Suella Braverman, who was sacked by Mr Sunak last month, raised concerns that the legislation does not tackle the issue of temporary Rule 39 injunctions from the European Court of Human Rights, which stopped last year’s flight."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/christmas-coming-early-starmer-hell-31642727",
        "title": "&#39;Christmas is coming early for <b>Starmer</b> but he’ll need to wait longer for the election&#39;",
        "description": "Deranged Tories calling for the return of Boris Johnson on a nightmare ticket with Nigel Farage are lost in the past."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/tories-cannot-govern-while-fighting-like-rats-in-a-sack-says-keir-starmer-364850/",
        "title": "Tories cannot govern while ‘fighting like rats in a sack’, says <b>Keir Starmer</b>",
        "description": "Starmer will argue that the Tories have shredded their ability to govern the nation as they&#39;re are “fighting like rats in a sack”."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rwanda-bill-rishi-sunak-tory-starmer-immigration-b2461521.html?page=6",
        "title": "Rwanda bill - live: Sunak’s immigration agenda to face Tory rebels in key vote",
        "description": "David Cameron deployed to fend off rebellion as Gove insists Sunak ‘not contemplating’ general election if he loses Commons vote"
    },
    {
        "url": "https://www.cryptopolitan.com/united-kingdom-is-never-returning-to-the-eu/",
        "title": "Why the United Kingdom is never returning to the EU",
        "description": "The United Kingdom’s decision to leave the European Union, a bold step taken in 2016, marked a significant shift in the nation’s trajectory. Despite the changing tide of public opinion and the emergence of “Bregret” among voters,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12848243/Tories-win-just-130-seats-general-election-polling-guru-warns-amid-party-infighting.html",
        "title": "The Tories could win just 130 seats in the next general election, polling guru warns amid yet more party infighting",
        "description": "The Tories could win just 130 seats in the next election - their worst ever result - if the party fails to unite, a polling guru has warned."
    },
    {
        "url": "https://www.thesun.co.uk/news/25007909/keir-starmer-tories-broken-promises-migration/",
        "title": "Sir <b>Keir Starmer</b> will accuse Tories of seven years of broken promises on migration",
        "description": "SIR Keir Starmer will tomorrow accuse the Tories of seven years of broken promises on migration. The Labour leader will use a speech on the fourth anniversary of the 2019 General Election to"
    },
    {
        "url": "https://www.livemint.com/news/world/pm-rishi-sunaks-officials-in-delhi-to-discuss-india-uk-fta-report-11702202115674.html",
        "title": "PM Rishi Sunak&#39;s officials in Delhi to discuss India-UK FTA: Report",
        "description": "Both countries are heading into an election year in 2024 and signing off on a trade agreement with India will bolster Sunak’s electoral pitch to voters showing signs of anti-incumbency towards his gov"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/10/the-guardian-view-on-labour-and-the-climate-crisis-the-28bn-question-deserves-an-answer",
        "title": "The Guardian view on Labour and the climate crisis: the £28bn question deserves an answer",
        "description": "Editorial: Sir Keir Starmer has popular plans to green the economy but electoral support is the crucial precondition for to make them a reality"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-warns-tories-ability-31641659",
        "title": "<b>Keir Starmer</b> warns Tories&#39; ability to govern has &#39;collapsed&#39; as Rishi Sunak faces civil war",
        "description": "As the PM Rishi Sunak faces a perilous week with the Covid Inquiry and a Tory civil war over Rwanda the Labour leader Keir Starmer says: &#39;Their ability to govern has collapsed&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/labours-respons-rwanda-plan-gutless-shameful-2802046?ico=best_of_opinion",
        "title": "Labour’s response to the Rwanda scheme is gutless and shameful",
        "description": "Labour’s alternative policy is that they would use “British policing and British intelligence to smash the gangs trafficking people across the Channel”. But this is likely to prove as effective as British policing and intelligence has in smashing the drug traffickers in the decades long failure that is the “war on drugs”."
    }
]