[
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13097747/Oil-gas-giants-crisis-talks-Labours-windfall-tax.html",
        "title": "Oil and gas giants in crisis talks over Labour&#39;s windfall tax",
        "description": "Industry group Offshore Energies UK (OEUK) said Labour leader Sir <b>Keir Starmer</b>&#39;s policy would be a &#39;hammer blow&#39;. It had previously warned it could cost 42,000 jobs and wipe £26billion off the sector&#39;s economic value. The organisation will hold ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/i-call-keir-1001-election-32155887",
        "title": "&#39;I will call <b>Keir</b> at 10.01 on election night to make sure the North gets what it deserves&#39;",
        "description": "Today, as he looks forward to <b>Keir Starmer</b> achieving a similar election triumph for Labour, Steve is the Liverpool Metro Mayor and has power and influence – which he intends to use. He says: “We’re trying to schedule a call in to <b>Keir</b> for one minute ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "Rishi Sunak warned against &#39;playing footsie&#39; with Nigel Farage and Reform UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/rochdale-by-election-referendum-gaza/",
        "title": "Rochdale by-election is referendum on Gaza, says Muslim charity boss",
        "description": "Last week, Sir <b>Keir Starmer</b> was forced to withdraw his support for Labour’s candidate in the upcoming Rochdale by-election because of comments he made about Israel and Jewish people. Azhar Ali, the former candidate for Labour who is now running as an ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/was-a-lack-of-ukrainian-ammunition-to-blame-for-russia-taking-avdiivka/",
        "title": "Was a lack of Ukrainian ammunition to blame for Russia taking Avdiivka?",
        "description": "<b>Starmer</b> says &#39;fighting must stop now&#39; in Gaza conflict ahead of ceasefire vote Sir <b>Keir Starmer</b> called for a &quot;ceasefire that lasts&quot; in Gaza - ahead of a vote in the Commons which risks re-opening Labour divisions on the issue. &#39;Somebody will die&#39;: Rise of ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24127277.keir-starmer-needs-offer-scottish-voters-positive-action-power/",
        "title": "<b>Keir Starmer</b> needs to offer Scottish voters positive action for power",
        "description": "Sir Keir Starmer’s message was clear – change is needed and only his party can deliver it. But the UK Labour leader will need to offer Scottish voters something positive to cling onto ahead of polling day if his party’s former red heartland is to help him grab hold of the keys to Downing Street."
    },
    {
        "url": "https://www.heraldscotland.com/news/24127193.labour-leader-keir-starmer-demands-ceasefire-lasts-gaza/?ref=rss",
        "title": "Labour leader <b>Keir Starmer</b> demands &#39;ceasefire that lasts&#39; in Gaza",
        "description": "Sir Keir Starmer has called for “a ceasefire that lasts” in Gaza amid growing pressure for Labour to support an immediate end to the fighting."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-secretly-thought-quitting-32152315",
        "title": "<b>Keir Starmer</b> secretly thought about quitting as Labour leader after &#39;kick in the guts&#39;",
        "description": "A new biography of the Labour leader Keir Starmer claims he saw the loss of the Hartlepool by-election as a &#39;personal rejection&#39; and told his top advisers he would resign"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-talks-movingly-father-113837764.html",
        "title": "<b>Keir Starmer</b> talks movingly of his father’s death in new biography",
        "description": "Keir Starmer has spoken movingly of his late father’s death in a new biography of the would-be prime minister. The Labour leader has previously talked of how his relationship with his toolmaker father,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-wont-have-money-to-spend-thats-where-his-problems-will-start-vkjwl8kz8",
        "title": "<b>Keir Starmer</b> won’t have any money — that’s where his problems will start",
        "description": "The state of the economy makes uncertain Labour’s ambitious plans for areas like the NHS, housebuilding and workers’ rights"
    },
    {
        "url": "https://www.watfordobserver.co.uk/news/national/24126739.labour-ready-difficult-decisions-new-age-insecurity-starmer-says/",
        "title": "Labour ready for difficult decisions in new age of insecurity, <b>Starmer</b> says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/keir-starmer-reportedly-wanted-to-quit-after-2021-byelection-defeat",
        "title": "<b>Keir Starmer</b> reportedly wanted to quit after 2021 Hartlepool defeat",
        "description": "Labour leader thought loss to Tories in byelection meant party going backward, according to new biography"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-patten-prime-minister-nigel-farage-labour-neil-kinnock-b1139917.html",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/rochdale-by-election-referendum-gaza/?n=@",
        "title": "Rochdale by-election is referendum on Gaza, says Muslim charity boss",
        "description": "Mohammed Shafiq, CEO of the Ramadhan Foundation, says issue of Palestine will be ‘really powerful’ in the contest"
    },
    {
        "url": "https://www.channel4.com/news/starmer-calls-for-ceasefire-that-lasts-in-gaza",
        "title": "<b>Starmer</b> calls for ‘ceasefire that lasts’ in Gaza",
        "description": "For months now domestic politics have been unable to escape Gaza, especially when it comes to the issue of a ceasefire. But the language has evolved. Sir Keir Starmer is now calling for a “ceasefire that lasts” and must “happen now”."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868055/Pollster-john-curtice-Labour-government",
        "title": "Pollster John Curtice predicts &#39;trouble&#39; for Labour within months of getting keys to No10",
        "description": "Sir <b>Keir Starmer</b> is widely predicted to be entering No10 following the next general election as the Conservative party continues to languish in polls. But Professor Sir John Curtice said within 18 months they will be struggling as they haven’t “won the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/left-jobless-ostracised-judged--28637585",
        "title": "It left them jobless, ostracised and judged ... but it saved their lives",
        "description": "With anti-trans hate crime at a record high, the M.E.N&#39;s James Holt speaks to three inspirational people about their journey to becoming their true self"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-special-relationship-starmer-trump-2912536",
        "title": "Labour moves to protect ‘special relationship’ after <b>Starmer</b> swipe at Trump",
        "description": "Labour has pledged to work with “whomever is in the White House ” following the next US Presidential election after Sir Keir Starmer took a veiled swipe at Donald Trump."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097743/Jewish-actress-Tracy-Ann-Oberman-claims-Progressive-Left-fuelling-anti-Semitism-reveals-needs-round-clock-security-receiving-threats.html",
        "title": "Jewish actress Tracy-Ann Oberman claims the &#39;Progressive Left&#39; is &#39;fuelling anti-Semitism&#39; - as she reveals she needs round-the-clock security after receiving threats",
        "description": "The shocking figures come as Labour leader Sir <b>Keir Starmer</b> was forced to suspend two parliamentary candidates following a row over the Gaza conflict. He claimed this was so the country would have a &#39;green light to do whatever they bloody want&#39;."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868054/rachel-reeves-labour-gaza-hamas-leeds",
        "title": "Rachel Reeves flees from furious voter after she is ambushed on campaign trail",
        "description": "Sir Keir Starmer has consistently refused to back the idea of a ceasefire in Gaza without guarantees that it would hold."
    },
    {
        "url": "https://news.sky.com/story/tories-think-theyve-spotted-a-labour-weakness-and-are-scouring-for-opportunities-13075189",
        "title": "Tories think they&#39;ve spotted a Labour weakness - and are scouring for opportunities",
        "description": "The Conservative campaign is seeking Labour candidates&#39; comments about Israel and Gaza following the suspension of two MP-hopefuls last week after their comments about the Middle East."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68333327",
        "title": "<b>Starmer</b>: Gaza ceasefire &#39;must happen now&#39;",
        "description": "Labour leader Sir Keir Starmer has called for a &quot;ceasefire that lasts&quot; in the Israel-Gaza conflict, during a speech at the Scottish Labour conference in Glasgow. His remarks come a day after the conference passed a motion calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/sir-keir-starmer-calls-for-a-ceasefire-in-gaza-368915/",
        "title": "Sir <b>Keir Starmer</b> calls for a ceasefire in Gaza",
        "description": "Sir Keir Starmer has called for a ‘ceasefire that lasts’ in Gaza during a speech to the Scottish Labour conference."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13097317/DOMINIC-LAWSON-firms-Labour-win-power-jobs.html",
        "title": "DOMINIC LAWSON: You can virtually hear big firms sucking up to Labour, but if they win it&#39;ll be the sound of jobs gurgling down the plughole...",
        "description": "The Financial Times, in a report headlined ‘<b>Keir Starmer</b> and big business, a love story’, observed that once he and Rachel Reeves ‘had to visit companies at their offices. But as the election nears, with Labour well ahead in the polls, business is ..."
    },
    {
        "url": "https://www.gg2.net/rishi-sunak-appeals-tory-family-to-come-together/",
        "title": "Rishi Sunak appeals Tory family to come together",
        "description": "PRIME MINISTER Rishi Sunak on Saturday (17) made a direct appeal to voters to stick with his plan to turn things around as he made a plea for the Tory family"
    },
    {
        "url": "https://news.stv.tv/politics/tories-could-still-win-next-uk-election-starmer-warns-in-glasgow-speech",
        "title": "Tories could still win next election, <b>Starmer</b> warns in Glasgow speech",
        "description": "Keir Starmer has warned the Tories could still win the next UK general election – despite the party consistently polling around 20 points ahead of their rivals. Speaking to Scottish Labour members on the last day of the party’s conference in Glasgow, the Labour leader took aim at the SNP for claiming Labour is almost certain to win the next ballot."
    },
    {
        "url": "https://www.itv.com/watch/news/sir-keir-starmer-calls-for-a-ceasefire-that-lasts-in-gaza-as-he-rallies-scottish-voters/s64v2kn",
        "title": "Sir <b>Keir Starmer</b> calls for a &#39;ceasefire that lasts&#39; in Gaza as he rallies Scottish voters",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68331330",
        "title": "David Lammy says sorry for Labour&#39;s handling of Rochdale candidate row",
        "description": "David Lammy has said he is &quot;sorry&quot; for Labour&#39;s initial decision to back its Rochdale candidate after his comments on Israel first came to light. Labour stood by Azhar Ali at first, after he claimed Israel allowed Hamas&#39; attacks as a pretext to invade Gaza."
    },
    {
        "url": "https://www.ft.com/content/2f7f689d-2573-4aa6-8181-2d9684867675?shareType=nongift",
        "title": "Labour does not rule out supporting motion on Gaza ceasefire",
        "description": "Sir Keir Starmer has declared that “fighting must stop now” in Gaza, as Labour declined to rule out shifting its position on the Israel-Hamas war to back an “immediate” ceasefire in a House of Commons vote next week."
    },
    {
        "url": "https://inews.co.uk/news/starmer-gaza-ceasefire-now-2912337?ico=related_article_inline",
        "title": "<b>Starmer</b> calls for a Gaza ‘ceasefire that lasts’ and ‘must happen now’",
        "description": "Labour leader Sir Keir Starmer has called for a “ceasefire that lasts” in Gaza, insisting that it “must happen now”. In Glasgow for Scottish Labour’s conference, the party leader has come under fresh pressure for his stance on the crisis after members north of the border backed immediate calls for a ceasefire."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24127254.labour-cant-stop-fighting-second-ahead-general-election---starmer/",
        "title": "Labour ‘can’t stop fighting for a second’ ahead of general election – <b>Starmer</b>",
        "description": "The Labour leader warned his party that the ‘volatile’ nature of politics means the Tories could still win another term in power."
    },
    {
        "url": "https://www.cityam.com/uk-hints-at-fresh-sanctions-after-navalnys-death-in-russia/",
        "title": "UK hints at fresh sanctions after Navalny’s death in Russia",
        "description": "The UK could launch fresh sanctions against Russia after the death of Russian dissident Alexei Navalny, the foreign secretary has hinted."
    },
    {
        "url": "https://socialistworker.co.uk/news/are-the-left-and-the-palestine-movement-awash-with-antisemitism/",
        "title": "Are the left and the Palestine movement awash with antisemitism?",
        "description": "It is that Israel equals all Jews. So if you criticise Israel, then you are antisemitic. And because the left is more likely to be pro-Palestinian and against what Israel does, then to be left wing is also antisemitic."
    },
    {
        "url": "https://www.cityam.com/labour-faces-fresh-divisions-over-gaza-as-snp-bring-new-ceasefire-vote/",
        "title": "Labour faces fresh divisions over Gaza as SNP bring new ceasefire vote",
        "description": "Labour faces fresh divisions over the Israel-Gaza conflict as a second vote on calling for a ceasefire is set to take place this week."
    },
    {
        "url": "https://www.scotsman.com/news/politics/sir-keir-starmer-says-north-sea-oil-and-gas-will-continue-for-decades-to-come-during-scottish-labour-party-speech-4523081",
        "title": "Sir <b>Keir Starmer</b> says North Sea oil and gas will continue ‘for decades to come’ during Scottish Labour Party speech",
        "description": "Sir Keir Starmer has insisted work in the North Sea oil and gas sector will continue “for decades to come” as his party continues to face criticism from the industry. It came as the UK Labour leader made a direct appeal to Scots who “have found a new political home with the SNP” to return to his party."
    },
    {
        "url": "https://www.telegraph.co.uk/money/pensions/gordon-brown-ruined-retirement-generation/?gaa_at=la&gaa_n=AZsHK_mrU3cKMHDPdx3anLkUQ5jKiFRYsXrhUmKLEhufdL1sAPjh2nM1oXqUfB9XSZw%3D&gaa_ts=65d2479a&gaa_sig=XJFMZjjw4fI7jyL1-XDZL015SfET-N4YRcylpcyZLic9kqvf3o7TdoUodfyqIa7n9jXKpoKS6Y408mxMrrv6JA%3D%3D",
        "title": "How Gordon Brown ruined retirement for a generation",
        "description": "Sir <b>Keir Starmer</b> is planning to reimpose the £1.073m maximum cap on the amount that can be saved into pensions free of tax. Savings over this amount face a windfall tax under the so-called lifetime allowance. When Chancellor Jeremy Hunt unexpectedly ..."
    },
    {
        "url": "https://news.sky.com/story/neil-kinnock-labour-leader-who-lost-unlosable-election-predicts-starmer-will-end-up-in-no-10-13074719?dcmp=snt-sf-twitter",
        "title": "Neil Kinnock: Labour leader who lost &#39;unlosable&#39; election predicts <b>Starmer</b> will end up in No 10",
        "description": "Neil Kinnock: Labour leader who lost &#39;unlosable&#39; election predicts <b>Starmer</b> will end up in No 10 Former Labour leader Neil Kinnock has predicted a victory for Labour leader Sir <b>Keir Starmer</b> at the next election. But he said the UK&#39;s voting system made it too difficult to predict if this could mean a majority, despite polls in Labour&#39;s facour."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-says-fighting-gaza-161909142.html",
        "title": "<b>Keir Starmer</b> Says Fighting In Gaza &#39;Must Stop Now&#39; And Rafah Offensive &#39;Cannot Happen&#39;",
        "description": "<b>Keir Starmer</b> has said said the fighting in Gaza “must stop now” and told Israel not to launch an offensive in the city of Rafah. Speaking to the Labour Party’s Scottish conference on Sunday, <b>Starmer</b> called for a “ceasefire that lasts”."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/labour-seeking-snp-deal-to-avoid-new-gaza-ceasefire-rebellion?ref=todayheadlines.live",
        "title": "Labour seeking SNP deal to avoid new Gaza ceasefire rebellion",
        "description": "Party hopes for compromise wording after previous SNP motion saw 56 MPs defy <b>Keir Starmer</b> Labour is hoping to defuse a fresh crisis over <b>Keir Starmer</b>’s cautious stance on Gaza by rewording a Scottish National party motion calling for an immediate ceasefire."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-hartlepool-labour-the-times-holborn-b1139825.html?ref=todayheadlines.live",
        "title": "<b>Starmer</b> nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir <b>Keir Starmer</b> and his top team. Nearly two and a half years later, Sir <b>Keir</b> is now tipped to become the next prime minister with a poll lead far ahead of Rishi Sunak’s ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/general-election-conservative-tory-boris-johnson-leadership/",
        "title": "Tory Party under Boris Johnson could regain votes of ‘lost Conservatives’",
        "description": "Among the “lost Conservatives”, who said they won’t vote Tory at the next election but don’t know who to vote for, 52 per cent said they would vote for Mr Johnson over Sir Keir. This is compared to 39 per cent saying they would vote for the current Prime Minister over the Labour leader."
    },
    {
        "url": "https://morningstaronline.co.uk/article/b/war-or-peace-decison-time-starmer",
        "title": "War or peace: decison-time for <b>Starmer</b>",
        "description": "DECISION-TIME looms for Sir Keir Starmer as Scottish Labour united at the weekend to call for an immediate ceasefire in Gaza."
    }
]