[
    {
        "url": "https://www.fwi.co.uk/news/farm-policy/analysis-how-is-the-political-outlook-for-2024-shaping-up",
        "title": "Analysis: How is the political outlook for 2024 shaping up?",
        "description": "Renowned 16th-century philosopher Nostradamus, who is credited with predicting the rise of Adolf Hitler and the Covid-19 pandemic, had some pretty"
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-to-begin-access-talks-to-prepare-labour-for-government-pdfrstp0l",
        "title": "<b>Keir Starmer</b> to begin ‘access talks’ to prepare Labour for government",
        "description": "The opposition will meet with civil servants at the end of January to lay foundations for a possible victory in the general election"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12980829/QUENTIN-LETTS-hears-withering-views-Keir-Starmer-focus-group-ITV-documentary.html",
        "title": "&#39;I couldn&#39;t sit in a pub with him - he&#39;s just too boring&#39;: QUENTIN LETTS hears withering views on <b>Keir Starmer</b> from focus group in ITV documentary",
        "description": "What will Sir Keir Starmer do it he fails to become prime minister? Sir Keir, should he be rejected by voters later this year, dreams of a job in retail."
    },
    {
        "url": "https://www.ibtimes.co.uk/veteran-labour-mp-sir-tony-lloyd-dies-aged-73-following-announcement-untreatable-leukaemia-1722842",
        "title": "Veteran Labour MP Sir Tony Lloyd Dies Aged 73 Following Announcement of Untreatable Leukaemia",
        "description": "The long-serving politician, who had been the MP for Rochdale since 2017, was diagnosed with blood cancer four years ago."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-promises-save-uks-business-reputation-new-age-insecurity-1722806",
        "title": "Labour Promises To Save The UK&#39;s Business Reputation From &#39;A New Age Of Insecurity&#39;",
        "description": "As the next general election approaches, MP Rachel Reeves will introduce JP Morgan investors to Labour&#39;s plan to regrow the British economy."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12980831/Keir-Starmer-accused-erase-history-claiming-never-thought-Jeremy-Corbyn-Prime-Minister-campaigning-power.html",
        "title": "<b>Keir Starmer</b> is accused of &#39;trying to erase history&#39; after claiming he never thought Jeremy Corbyn would become Prime Minister despite campaigning to put him in power",
        "description": "Keir Starmer has claimed he never believed Jeremy Corbyn would be prime minister, despite tirelessly campaigning for years to put him in No 10."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/18/low-general-election-turnout-likely-with-dull-as-dishwater-sunak-and-starmer",
        "title": "Low general election turnout likely with ‘dull as dishwater’ Sunak and <b>Starmer</b>",
        "description": "Polling expert says similarity between two main parties and clear Labour lead also likely to suppress voting numbers"
    },
    {
        "url": "https://www.theguardian.com/tv-and-radio/2024/jan/18/keir-starmer-up-close-review-the-labour-leader-desperately-tries-to-prove-hes-sexy?ref=mc.news",
        "title": "<b>Keir Starmer</b>: Up Close review – the Labour leader desperately tries to prove he’s sexy",
        "description": "Over three months with Anushka Asthana, Starmer attempts to make the general public love him and let him move into Downing Street. There’s only one hitch"
    },
    {
        "url": "https://www.thetimes.co.uk/article/how-keir-starmer-plans-to-handle-a-donald-trump-win-mqp8vlrjm",
        "title": "How <b>Keir Starmer</b> plans to handle a Donald Trump win",
        "description": "Labour Party insiders concede that victory for the former US president could complicate the final stages of its general election campaign"
    },
    {
        "url": "https://www.lbc.co.uk/news/jeremy-hunt-hints-at-tax-cuts-ahead-in-march-budget/",
        "title": "Jeremy Hunt hints at tax cuts ahead in March Budget, as he admits voters are &#39;angry&#39;",
        "description": "Jeremy Hunt has hinted that the Budget in March could contain tax cuts, as he said that he would &quot;prioritise economic growth&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857353/Keir-Starmer-Nigel-Farage-Labour",
        "title": "<b>Keir Starmer</b> squirms over tough question about Nigel Farage: &#39;He&#39;s not in my head!&#39;",
        "description": "The Labour leader was quizzed about the threat of Nigel Farage and the immigration issue during a wide-ranging ITV interview this evening."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rwanda-bill-vote-rishi-sunak-results-tories-b2480641.html?page=18",
        "title": "Rwanda bill - latest: Rishi Sunak pleads with House of Lords to back deportation plan",
        "description": "Rishi Sunak is preparing for a showdown with the House of Lords, pleading with peers to back his Rwanda plan after it passed the Commons, suggesting it is what voters want. The prime minister described the bill as a “national priority” and urged the upper chamber to “do the right thing”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/i-would-never-be-mates-with-rishi-sunak-keir-starmer/",
        "title": "I’d never be mates with Sunak, says <b>Starmer</b>",
        "description": "Sir Keir Starmer has said he would never be “mates” with Rishi Sunak because the two are from “totally different worlds”. Sir Keir, the Labour leader, said that although he gets on “alright” with the Prime Minister, he would not be friends with him if circumstances were different."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmers-rarely-seen-wife-31909480",
        "title": "<b>Keir Starmer</b>&#39;s rarely-seen wife Lady Victoria - awkward row, NHS job and &#39;streetwise&#39; nature",
        "description": "Labour leader Keir Starmer has been married to his wife, Lady Victoria Starmer, for 15 years and she rarely appears in the limelight beside him - instead, choosing to keep her life private"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/colin-campbell-hard-times-are-stoked-up-by-24-hour-news-cyc-339409/",
        "title": "COLIN CAMPBELL: Hard times are stoked up by 24-hour news cycle",
        "description": "It’s almost impossible to get through a day without being cited of “broken Britain” supposedly falling apart. Have things ever been worse?"
    },
    {
        "url": "https://socialistworker.co.uk/news/first-use-of-anti-strike-laws-will-test-worker-strength/",
        "title": "First use of anti-strike laws will test worker strength",
        "description": "Train bosses in cahoots with the Tories are planning on using new anti-strike laws to ensure &quot;minimum levels of service&quot;"
    },
    {
        "url": "https://www.thenational.scot/news/24059968.scotland-not-mentioned-labour-party-campaign-bible/",
        "title": "Scotland not mentioned once in Labour Party &#39;campaign bible&#39;",
        "description": "THE Labour Party’s so-called General Election &quot;campaigning bible&quot; doesn’t mention Scotland once. The 24-page document has been sent to each of Labour’s election candidates – including those north of the border."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-progressive-politics-disaster-labour-150046999.html",
        "title": "OPINION - Labour and the Left need to escape the dead end of progressive politics",
        "description": "The idea of progress can be an illusion in politics too, especially if you are a “progressive”, the biggest misnomer since the German Democratic Republic. With a looming Labour election victory, the Left desperately needs coherence and instead it is anxious and atomised."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68022076",
        "title": "Seized Russian money could help Ukraine - Cameron",
        "description": "There is a “moral, political, legal, and economic case” for using money seized from Russia to help rebuild Ukraine, says the UK foreign secretary."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-sunak-vs-the-stats-cops/",
        "title": "London Playbook PM: Sunak vs the stats cops",
        "description": "SLEIGHT OF RED HANDED: Labour said Rishi Sunak was once more “caught red handed” nobbling numbers after official stats police gave the PM a slap on the wrist over his claims about asylum case backlogs."
    },
    {
        "url": "https://bylinetimes.com/2024/01/18/by-election-frenzy-kingswood-labour-candidate-damien-egan-on-public-services-in-freefall-upping-sticks-and-keir-starmer/",
        "title": "By-Election Frenzy: Kingswood Labour Candidate Damien Egan on Public Services in Freefall, Upping Sticks, and <b>Keir Starmer</b>",
        "description": "Chris Skidmore&#39;s resignation has sparked a scramble in the South West. Can Damien Egan take the seat - and muster some hope?"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-opens-up-over-31913510",
        "title": "<b>Keir Starmer</b> opens up over his &#39;distant&#39; relationship with dad Rodney in ITV show",
        "description": "Labour leader Keir Starmer admitted he regrets not talking to his dad about the distance between them before he died in 2018 - three years after he was elected to Parliament"
    },
    {
        "url": "https://www.thejc.com/news/keir-starmer-this-year-never-again-must-be-said-more-defiantly-a4gzqs54",
        "title": "<b>Keir Starmer</b>: This year ‘Never Again’ must be said more defiantly",
        "description": "The Labour Party leader made the remarks in a room of prominent Westminster figures, Holocaust survivors, religious and community leaders"
    },
    {
        "url": "https://www.snp.org/could-you-find-74000-to-pay-for-your-childrens-education-westminster-parties-dont-value-free-education/",
        "title": "Could you find £74,000 to pay for your children’s education? Westminster parties don’t value free education",
        "description": "Education is the key high living standards and better social mobility – Starmer&#39;s Labour want to chip away at everything Scotland has achieved."
    },
    {
        "url": "https://uk.news.yahoo.com/john-rentoul-answers-questions-tory-202020757.html",
        "title": "John Rentoul answers your questions as Tory popularity plummets in the polls",
        "description": "With so much contradictory information out there, chief political commenator John Rentoul has been answering reader questions on the polls, Conservative popularity amid the Rwanda bill vote and Labour"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68022192",
        "title": "SNP leader is uncomfortable with his party&#39;s name",
        "description": "Mr Yousaf told BBC Radio 4&#39;s Political Thinking with Nick Robinson podcast that he had concerns about his own party&#39;s title."
    },
    {
        "url": "https://inews.co.uk/news/politics/secret-talks-whitehall-starmer-government-2860224?ico=editors_picks",
        "title": "How secret talks will define what the next Labour government can actually do",
        "description": "This meeting never took place.’ Top civil servants will soon be talking to Labour. This is what they can expect"
    },
    {
        "url": "https://www.thenational.scot/politics/24057301.neoliberal-ideology-adopted-keir-starmer-wrecking-peoples-lives/",
        "title": "Neoliberal ideology adopted by <b>Keir Starmer</b> is wrecking people&#39;s lives",
        "description": "At neoliberalism’s core is the deficit myth that says government spending is limited to tax revenues and additional money must be borrowed from financial markets. Thatcher claimed: “There is no such thing as public money, there is only taxpayers’ money.”"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857022/Keir-Starmer-CPS-mistakes?ruid=b37d919f-60f9-4779-825c-a988d2fb3fe0",
        "title": "<b>Keir Starmer</b> accused of huge U-turn as &#39;CPS staff blamed for Post Office scandal errors&#39;",
        "description": "EXCLUSIVE: Sir Keir Starmer appears to have changed his mind over taking responsibility for failings in his previous role as DPP."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/keir-starmer-if-theyre-calling-you-boring-youre-winning",
        "title": "<b>Keir Starmer</b>: &quot;If they&#39;re calling you boring - you&#39;re winning&quot;",
        "description": "<b>Keir Starmer</b> looked a touch exasperated as I asked the question: &quot;People say you come across as a bit boring - what do you say to that?&quot; &quot;Well, if in the end that is the only bit of mud left to sling, then I&#39;m pretty comfortable,&quot; he responds - raising his ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/keir-starmer-post-office-scandal-cps-prosecutions-itv/",
        "title": "<b>Starmer</b> admits ‘mistakes’ after CPS criticised for pursuing postmasters",
        "description": "Labour leader insists he has ‘no skeletons in the closet’ as he faces questions over his role in the Post Office scandal"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/sir-keir-starmer-has-no-skeletons-waiting-to-come-out-this-general-election-97846/",
        "title": "Sir <b>Keir Starmer</b> has ‘no skeletons’ waiting to come out this general election",
        "description": "Labour leader Sir Keir Starmer has said he has “no skeletons in the closet” from his time in charge of the Crown Prosecution Service (CPS) ahead of the general election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/keir-starmer-labour-general-election-itv-b2480934.html",
        "title": "Sir <b>Keir Starmer</b> says there are ‘no skeletons’ in his closet ahead of general election",
        "description": "“If they want to attack me for decisions when I was director of public prosecutions, we had 7,000 staff, we made nearly a million decisions a year,” he said in an interview for ITV programme <b>Keir Starmer</b>: Up Close – Tonight, airing Thursday on IT"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68022074",
        "title": "Ex-deputy PM Therese Coffey chides Cooper over &#39;Kigali&#39; government",
        "description": "Therese Coffey is not impressed when the shadow home secretary refers to the Rwandan government by the name of the nation&#39;s capital."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rwanda-bill-vote-rishi-sunak-results-tories-b2480641.html",
        "title": "Rwanda bill - latest: Rishi Sunak pleads with House of Lords to back deportation plan – live",
        "description": "Rishi Sunak will hold a press conference this morning after seeing off a rightwing rebellion on his Rwanda plan. The prime minister is expected to give an update on the government’s immigration policies and take questions from the media."
    },
    {
        "url": "https://leftfootforward.org/2024/01/damning-poll-reveals-what-the-public-really-think-about-the-rwanda-scheme/",
        "title": "Damning poll reveals what the public really think about the Rwanda scheme",
        "description": "Rishi Sunak has staked his political future on getting the Rwanda scheme off the ground. Under the proposals, asylum seekers who arrive in the UK other than through an existing asylum scheme would be deported to Rwanda where their claim would then be processed."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/confidence-keir-starmer-labour-rishi-sunak-prime-minister-b1133255.html",
        "title": "Confidence in Tory leadership falls to levels last seen when Truss PM – poll",
        "description": "A clear majority of people surveyed expected Labour leader Sir Keir Starmer to replace Rishi Sunak as prime minister after the next election."
    },
    {
        "url": "https://www.newstatesman.com/spotlight/elections-spotlight/2024/01/civil-service-prepares-transitions-power-elections",
        "title": "“Once it’s gone, it’s gone”: How data in the cloud can help restore the natural world",
        "description": "Those preparations cover both the substance and the delivery of policy, explains Terence Burns, who was permanent secretary of HM Treasury, the most senior civil servant in that department, from 1991-98. The 79-year-old worked through the transition of Major to Blair."
    },
    {
        "url": "https://news.sky.com/story/politics-live-rishi-sunak-tries-to-make-a-bogeyman-at-utterly-bizarre-news-briefing-as-unusual-guest-takes-seat-12593360",
        "title": "Politics live: Rishi Sunak tries to &#39;make a bogeyman&#39; at &#39;utterly bizarre&#39; news briefing - as unusual guest takes seat",
        "description": "So, is there a key target voter in 2024 that can save Rishi Sunak from defeat or deliver Sir <b>Keir Starmer</b> a majority? If voters switched uniformly from Conservative to Labour in 2024, with others unchanged, then a swing of 12.7 percentage points would see ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rishi-sunaks-rwanda-bill-branded-unworkable-hugely-expensive-and-could-break-international-law-4483301",
        "title": "Rishi Sunak&#39;s Rwanda bill branded &#39;unworkable, hugely expensive, and could break international law&#39;",
        "description": "The Shadow Scotland Minister says the UK Government’s Rwanda bill is “unworkable, hugely expensive, and could break international law”. Scotland’s equalities minister is also accusing Rishi Sunak’s government of abdicating from its international and moral responsibilities over this legislation."
    },
    {
        "url": "https://uk.news.yahoo.com/conservative-voters-reform-poll-121202637.html",
        "title": "Grim poll shows Rishi Sunak&#39;s Conservatives leaking voters to Reform",
        "description": "According to a new poll from Savanta, the Tories are sitting on 27% – 17 points behind Labour, who are on 44%. Reform are polling at 7% in the poll – but it&#39;s here their voters are coming from that will raise alarm bells in Downing Street."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/full-list-general-election-seat-9037536",
        "title": "Full list of General Election seat forecast for Bristol - Tories headed for colossal losses",
        "description": "The Conservatives are being forecast to lose three out of five MPs they currently have in the Bristol area in the next General Election, according to a new model. YouGov found that Labour would win a large majority were the election to be held now, with Keir Starmer sitting on a 120-seat majority."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/red-every-sense-sir-tony-28464277",
        "title": "A red in every sense, Sir Tony Lloyd was a pillar of Greater Manchester politics - and a staunch campaigner for justice for its citizens",
        "description": "Sir Tony Lloyd, who has died aged 73, was quietly spoken, always sharply dressed and had a long political career. He was the first - albeit interim - Greater Manchester mayor in 2015, a post he held for two years. The roots of his political passion lay in the Spanish Civil War of the 1930s."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-rwanda-bill-tory-rebellion-commons-votes-resignations-12593360?postid=7086337",
        "title": "Politics live: Rishi Sunak delivers &#39;will of the people&#39; warning in &#39;utterly bizarre&#39; news conference",
        "description": "The PM then pivots to attack Labour and Sir <b>Keir Starmer</b> for opposing the Rwanda plan. The Times asks Rishi Sunak about his legal advice, which says it would be a breach of international law to ignore Rule 39 injunctions from Strasbourg. Mr Sunak says he ..."
    },
    {
        "url": "https://uk.news.yahoo.com/tories-hit-polling-low-not-112310765.html",
        "title": "Tories hit polling low not seen &#39;since Liz Truss’s time in Downing Street&#39;",
        "description": "THE Tories have hit a low in the polling not seen since Liz Truss’s final days in power. A new survey from YouGov predicted Rishi Sunak’s party would win just 20% of the vote. Keir Starmer’s Labour polled at 47%, a 27-point lead. YouGov said it was the largest lead for the party since Truss’s short-lived time in power."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24058167.city-york-council-many-highly-paid-directors/",
        "title": "&#39;City of York Council has too many highly-paid directors&#39;",
        "description": "If it is possible for City of York Council to function with just three directors instead of the five presently employed (York council set to cut top jobs to save cash, Press online, January 17) a huge question is raised."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/touching-moment-house-commons-falls-28467357",
        "title": "Touching moment House of Commons falls silent to remember Sir Tony Lloyd",
        "description": "MPs held a minute&#39;s silence in Parliament this morning (January 18) in memory of Sir Tony Lloyd. The Rochdale MP, who held several senior political roles in Greater Manchester, revealed last week that he had developed an &#39;aggressive and untreatable leukaemia&#39;."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-house-of-lords-prime-minister-downing-street-supreme-court-b1133171.html",
        "title": "Rishi Sunak urges Lords to ‘do the right thing’ and back Rwanda plan",
        "description": "Rishi Sunak has urged peers to “do the right thing” and back his Rwanda legislation as he prepares for a showdown with the House of Lords after winning Commons approval for his illegal migration plan."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/24056430.weston-political-parties-react-januarys-yougov-mrp-model/",
        "title": "Weston political parties react to January&#39;s YouGov MRP model",
        "description": "&quot;The results of the model, which uses data from 14,110 respondents answering between December 12 and January 4, would see <b>Keir Starmer</b> enter Downing Street having secured a 120-seat majority, with Labour winning 385 Commons seats. This would be a 183 ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/18/laura-pascal-labour-hackney-trans-suspension/",
        "title": "Labour candidate apologises for transphobia – then announces she is ‘gender critical’",
        "description": "Laura Pascal was all set to stand for <b>Keir Starmer</b>’s party in Hackney’s Cazenove ward by-election on Thursday (18 January). However, following allegations of transphobic social media use, she was “administratively suspended”, campaigning ceased and ..."
    },
    {
        "url": "https://www.thegrocer.co.uk/health/health-groups-in-fury-over-watered-down-junk-food-ad-ban/687255.article",
        "title": "Health groups in fury over ‘watered down’ junk food ad ban",
        "description": "There is a fear the government is washing their hands.” Last week Labour leader <b>Keir Starmer</b> repeated his commitment to ban junk food advertising, as he declared the party was “up for the fight in improving children’s health”. <b>Starmer</b> also rejected ..."
    },
    {
        "url": "https://inews.co.uk/opinion/tax-cut-no-longer-electoral-elixir-tories-think-2847370?ico=in-line_link",
        "title": "Tax cuts are no longer the electoral elixir the Tories think they are",
        "description": "And that something else was tax cuts. In his joust with Sir <b>Keir Starmer</b>, Sunak followed up on the message that he’s tried hard to push via a string of events in recent days: this is a Tory Government that marked the new year with a 2p cut in employees ..."
    },
    {
        "url": "https://www.middleeasteye.net/video/truth-about-racism-labour-party",
        "title": "The truth about racism in the Labour Party",
        "description": "How deep does racism run within the Labour Party? Since the start of the Gaza war, there’s been a growing anger within British Muslim communities at Labour’s perceived lack of leadership on the Palestinian issue,"
    },
    {
        "url": "https://www.scotsman.com/news/politics/rwanda-bill-rishi-sunak-insists-tory-party-completely-united-as-letters-of-no-confidence-go-in-4483384",
        "title": "Rwanda Bill: Rishi Sunak insists Tory party &#39;completely united&#39; as letters of no confidence go in",
        "description": "The UK Government passing its controversial Rwanda Bill appears, on paper, a clear win for the Prime Minister. Following the Boris Johnson playbook, he warned the House of Lords must not “frustrate the will of the people”, adding it was time to “take back control of our borders”. His eggs are all in the Rwanda basket and it could break very easily."
    }
]