[
    {
        "url": "https://www.itv.com/news/2024-02-22/commons-speaker-under-pressure-after-gaza-vote-chaos",
        "title": "Commons Speaker under pressure after Gaza vote chaos",
        "description": "His decision sparked fury from the Conservative and SNP benches, who accused him of helping Sir <b>Keir Starmer</b> avoid another damaging revolt over the Middle East issue. I apologise for how it’s ended up Sir Lindsay Hoyle Sir Lindsay issued an apology after ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110543/JOHN-MACLEOD-Camerons-return-like-Bobby-stepping-Dallas-shower-Tories-worse-bad-dream.html",
        "title": "JOHN MACLEOD: Cameron&#39;s return was like Bobby stepping out of the Dallas shower. But for the Tories, this is worse than a bad dream",
        "description": "And that want of experience, guile, perspective, resilience and backbone has hampered all of them – as it will hamper Sir <b>Keir Starmer</b>. But there is also the dark legacy of the long period of Labour government under Tony Blair and Gordon Brown."
    },
    {
        "url": "https://news.sky.com/story/what-happened-in-the-commons-today-and-can-the-speaker-be-sacked-13077878",
        "title": "What happened in the Commons today - and can the Speaker be sacked?",
        "description": "Raised voices, walk-outs, calls for resignations, even a few tears - it was a hairy day over in parliament on Wednesday and not the usual scenes expected from an opposition day debate. So what rattled Westminster and its MPs? And how did the Speaker, Sir ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/lindsay-hoyle-fighting-for-survival-after-controversial-ruling-sparks-snp-fury_uk_65d64cf8e4b0cc1f2f7a7b6d/",
        "title": "Lindsay Hoyle Fighting For Survival After Controversial Ruling Sparks SNP Fury",
        "description": "I do not want it to have ended like this.” Hoyle also said he was “offended” by Tory claims that he had come under pressure from Sue Gray, the former top civil servant who is now <b>Keir Starmer</b>’s chief of staff, to accept the Labour amendment."
    },
    {
        "url": "https://inews.co.uk/news/politics/the-gaza-vote-danger-for-keir-starmer-explained-2917739",
        "title": "The Gaza vote danger for <b>Keir Starmer</b>, explained",
        "description": "It represents a political challenge for Labour leader Sir <b>Keir Starmer</b>, who until now has resisted calls for an immediate ceasefire and suffered a Commons rebellion for doing so. Now, Labour has shifted its stance and backed a ceasefire but with ..."
    },
    {
        "url": "https://uk.style.yahoo.com/keir-starmer-beaten-teenager-trying-125552605.html",
        "title": "<b>Keir Starmer</b> was ‘beaten up’ as teenager trying to defend gay friend, biography reveals",
        "description": "Labour leader Keir Starmer was ‘beaten up’ as a teenager trying to protect his gay friend from a homophobic attack, a new biography reveals. Describing the incident to author Tom Baldwin for Keir Starmer: The Biography, the Labour leader discussed the violent run-in at a Cornwall night club in the 1980s."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-biography-main-points-labour-b2499777.html",
        "title": "<b>Keir Starmer</b>: Key revelations from the new biography of the Labour leader",
        "description": "Biographer Tom Baldwin suggests that allegations of antisemitism in the Labour Party weighed heavy on the new leader’s mind. Starmer says he got to a point where he considered leaving regularly: “I did question myself the whole time about whether I should stay on or leave. But I thought, on balance, it’s better to fight it from the inside.”"
    },
    {
        "url": "https://www.scotsman.com/arts-and-culture/books/book-review-keir-starmer-the-biography-by-tom-baldwin-4526951",
        "title": "Book review: <b>Keir Starmer</b>: The Biography, by Tom Baldwin",
        "description": "Tom Baldwin’s new biography, based on interviews with more than a hundred people – including Starmer, his friends, family and closest colleagues – offers a fascinating insight into this other, hidden side. It humanises a figure whose buttoned-up, cautious persona masks a life that has been anything but bland."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/21/the-hidden-life-of-keir-starmer",
        "title": "Emotional, messy and breathtakingly ruthless: the hidden life of <b>Keir Starmer</b>",
        "description": "The most working class leader of the Labour party for a generation, he is well ahead in the polls, but still a mystery to many. His biographer reveals what drives this unusual politician"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/starmer-dpp-tories-autobiography-prosecutions-b2499759.html",
        "title": "Tories would have made <b>Keir Starmer</b> DPP for another five years but he refused",
        "description": "Although having rebuked Sir Keir at the start of his tenure of DPP for being too political, Mr Grieve – who had the Tory whip removed by Boris Johnon after voting against his Brexit deal – is quoted in the book as describing him as “highly effective and someone who always behaved with great integrity”."
    },
    {
        "url": "https://inews.co.uk/news/politics-live-starmer-labour-rebellion-gaza-ceasefire-2917310?ico=above_article_ticker",
        "title": "Latest politics news: <b>Starmer</b> faces another Labour rebellion over Gaza ceasefire Commons vote",
        "description": "Sir Keir Starmer’s party has publicly shifted its stance to back a call for an “immediate humanitarian ceasefire”"
    },
    {
        "url": "https://www.telegraph.co.uk/books/non-fiction/review-keir-starmer-biography-tom-baldwin/?utmsource=email",
        "title": "From life above a ‘brothel’ to resignation thoughts, meet the real <b>Keir Starmer</b>",
        "description": "<b>Keir Starmer</b> working in his flat above a sauna and massage parlour in the 1980s Credit: Harper Collins When Sir <b>Keir Starmer</b>’s father was rushed to hospital in November 2018, his son, then Labour’s shadow Brexit secretary, dropped everything and came ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106985/Sir-Keir-Starmer-lived-brothel-circular-bed-graduating-university-biography.html",
        "title": "Sir <b>Keir Starmer</b> lived above a brothel with a circular bed after graduating from university, biography reveals",
        "description": "Sir <b>Keir Starmer</b> described the flat in north London as &#39;grotty&#39; and the father of one of his friends is said to have been concerned about being seen entering a brothel. <b>Keir Starmer</b>: The Biography details the more colourful parts of the leader&#39;s life ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/02/21/keir-starmer-labour-gay-friend-biography/",
        "title": "<b>Keir Starmer</b> was ‘beaten up’ defending gay friend from attack as a teen",
        "description": "Labour leader <b>Keir Starmer</b> was beaten up as a teenager while trying to defend a gay friend, according to a new biography. <b>Keir Starmer</b>: The Biography, written by Tom Baldwin, details how during the summer of 1980, after <b>Starmer</b> sat his A-levels ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/labours-uneasy-victory-over-gaza",
        "title": "When the lights went out",
        "description": "By Freddie Hayward “Disaster averted” was the appraisal of one shadow cabinet minister. <b>Keir Starmer</b> began the day on course for political defeat. By the end, parliament had adopted Labour’s position on the war in Gaza as its own. At the centre of ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68342446.amp",
        "title": "Labour&#39;s Damien Egan says West Country accent helped Kingswood win",
        "description": "On his first day in Parliament the two by-election victors were met by party leader Sir <b>Keir Starmer</b>, and cheered by scores of other Labour MPs. Damien Egan admits to a sense of wonder: &quot;I&#39;ve been in that chamber once, on a guided tour, so it&#39;s going to be ..."
    },
    {
        "url": "https://news.sky.com/story/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm-13077878",
        "title": "What happened in the Commons today - and can the Speaker be sacked?",
        "description": "Despite anger from his clerk, and feathers being spat by a number of MPs, Sir Lindsay decided both the government and Labour&#39;s amendments to the SNP&#39;s motion could and would be voted on, claiming he wanted to give the House as many options as possible when debating such an emotive topic."
    },
    {
        "url": "https://uk.yahoo.com/?_guc_consent_skip=1707809706",
        "title": "Yahoo UK | News, email and search",
        "description": "Conservative voters believe that only one alternative leader could beat Sir <b>Keir Starmer</b> at the next election, a new poll suggests. More famous faces swap their day jobs for oven gloves in The Great Celebrity Bake Off 2024. Here&#39;s everything we know about ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110961/keir-starmer-pledges-curb-number-people-benefits.html",
        "title": "<b>Keir Starmer</b> pledges to curb the number of people &#39;languishing&#39; on benefits and make work pay",
        "description": "In a toughly worded intervention, the Labour leader will warn that the soaring number of people on sickness benefits is &#39;choking off growth&#39;. Under new proposals, a Labour government would reform incapacity benefits to &#39;encourage&#39; hundreds of thousands of ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/long-term-sick-being-failed-32181011",
        "title": "Long-term sick being failed by Tories&#39; record NHS backlog, <b>Keir Starmer</b> says",
        "description": "People off work with long-term sickness are being failed by the Tories&#39; record NHS backlog and job centre red-tape, <b>Keir Starmer</b> will warn today. The Labour leader accused the government of writing off people who are unable to work because they are ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm/",
        "title": "Why was the Commons in chaos - and will the Speaker survive the storm?",
        "description": "Conservative MPs accused the Speaker - a Labour MP before taking on the role - of making an &quot;overtly political decision&quot; to help Sir <b>Keir Starmer</b> fend off a rebellion from his own MPs, who could back the SNP motion without a Labour alternative to support."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68362405.amp",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "A Commons debate on calls for a ceasefire in Gaza descended into chaos, after the Speaker was accused of allowing it to be &quot;hijacked&quot; by Labour. Sir Lindsay Hoyle sparked fury from the SNP and Conservatives when he broke with convention to allow a vote on a Labour motion for an &quot;immediate humanitarian ceasefire&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68358524",
        "title": "Rafah ground offensive ‘must not happen’ - Lammy",
        "description": "Shadow Foreign Secretary David Lammy has led the Labour Party&#39;s calls for an “immediate humanitarian ceasefire” in Gaza in the House of Commons"
    },
    {
        "url": "https://news.stv.tv/politics/stephen-flynn-calls-for-investigation-following-chaotic-gaza-vote-in-house-of-commons",
        "title": "Stephen Flynn calls for investigation following chaotic Gaza vote",
        "description": "The Commons Speaker was warned by his clerks that the move was unprecedented, and appeared in the chamber to apologise to MPs."
    },
    {
        "url": "https://news.sky.com/story/speaker-clinging-on-to-job-as-33-mps-sign-no-confidence-motion-after-commons-gaza-vote-descends-into-row-13077779",
        "title": "Speaker clinging on to job as 33 MPs sign no-confidence motion after Commons Gaza vote descends into row",
        "description": "An SNP opposition day starts with a row over Sir Lindsay Hoyle&#39;s decision to select a Labour amendment and ends with a mass walkout of MPs."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/results-uks-gazas-ceasefire-vote-revealed-20323318/?ico=trending-post-strip_item_4",
        "title": "UK government votes to call for an ‘immediate ceasefire’ in Gaza",
        "description": "The move meant Labour MPs were able to vote for Sir <b>Keir Starmer</b>’s updated stance. The SNP’s motion – which called for an immediate ceasefire, the release of all hostages held by Hamas and ‘an end to the collective punishment of the Palestinian ..."
    },
    {
        "url": "https://uk.news.yahoo.com/house-commons-sinks-chaos-over-212311445.html",
        "title": "House of Commons Sinks Into Chaos Over Israel-Hamas War Vote",
        "description": "Close Largest Covid Vaccine Study Yet Finds Links to Health Conditions Biden Touts $1.2 Billion in Student Loan Relief With Eye to 2024 The disarray was triggered after Speaker Lindsay Hoyle controversially allowed both <b>Keir Starmer</b>’s Labour Party and ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?filterKeyEvents=true&page=with:block-65d5e3568f08cee0954a5da1",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – UK politics live",
        "description": "By submitting your message, you are agreeing to share your details with us, which we may use in this blog. <b>Keir Starmer</b> starts by welcoming the new Labour MPs for Wellingborough and Kingswood. And he also pays tribute to Alexei Navalny. He asks Sunak if he ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-keir-starmer-quotes-south-28679995",
        "title": "Sir <b>Keir Starmer</b> quotes South Tyneside postmaster in calling for greater transparency surrounding Post Office scandal",
        "description": "Sir <b>Keir Starmer</b> has backed a former South Tyneside postmaster in calling for greater transparency surrounding the Post Office scandal and subsequent inquiry. The Labour leader asked Prime Minister Rishi Sunak if he would give postmasters &quot;the peace of ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-keir-starmer-hamas-b1140715.html",
        "title": "Labour amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "The developments meant Sir <b>Keir Starmer</b> avoided another damaging revolt over the Middle East issue. It had been expected that Sir Lindsay would select just the Government’s amendment seeking an “immediate humanitarian pause” to the Israel-Hamas ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/house-of-commons-snp-keir-starmer-gaza-commons-b1140724.html",
        "title": "SNP’s Stephen Flynn calls for investigation following chaotic Gaza vote",
        "description": "Mr Flynn told the PA news agency: “Every single member of Parliament knows that (Sir) Lindsay Hoyle was meeting with Sir <b>Keir Starmer</b> and Alan Campbell, the Labour chief whip, before a decision was taken today. “Indeed it was suggested to me that was a ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-post-office-cameron-government-horizon-b1140612.html",
        "title": "PM ignores calls to repeat ‘lying’ allegation aimed at ex-Post Office chairman",
        "description": "Labour leader Sir <b>Keir Starmer</b> pressed the Prime Minister in the Commons as he called for an investigation into whether or not the Government had been seeking to delay payments to subpostmasters affected by the scandal. Ms Badenoch accused Henry Staunton ..."
    }
]