[
    {
        "url": "https://www.thetimes.co.uk/article/labour-plots-watertight-alternative-to-rwanda-migrant-plan-bb7m9srzx",
        "title": "Labour plots ‘watertight’ alternative to Rwanda migrant plan",
        "description": "Sir Keir Starmer will set out his vision for the country next week as his party tries to combat Tory claims that it has no plan for the small boats crisis"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/25/conservative-mp-mike-freer-golders-green-suspected-arson/",
        "title": "Police investigate suspected arson attack on Tory MP’s office",
        "description": "Police are investigating a suspected arson attack at the office of Conservative MP Mike Freer. A fire ripped through the office in Finchley, north London, at about 7pm on Christmas Eve, leaving it a blackened wreck. Scotland Yard said the blaze started in an adjacent shed but have not yet identified a cause."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-cameron-prime-minister-liz-truss-coca-cola-b1128994.html",
        "title": "Sunak and <b>Starmer</b> share family festive traditions",
        "description": "Rishi Sunak has revealed that he takes charge of cooking the turkey on Christmas day, while Sir Keir Starmer heads to his local pub."
    },
    {
        "url": "https://www.theguardian.com/environment/2023/dec/25/the-weasel-words-of-cop28-can-be-easily-twisted",
        "title": "The weasel words of Cop28 can be easily twisted",
        "description": "Letters: It is well past time to find radical alternatives to this failed process, says John Foster, and Peter Allen backs citizens’ action"
    },
    {
        "url": "https://www.standard.co.uk/culture/taylor-swift-christmas-family-discussions-xmas-rishi-sunak-prince-harry-b1129006.html",
        "title": "&quot;What&#39;s the deal with that Taylor Swift then, eh?&quot; How to win at Christmas family discussions",
        "description": "Christmas dinner and heated discussion about Just Stop Oil So: how’s it going? Lunch all great? Eye-rolling at that M&amp;S Nut Roast for one all done? Socks gratefully received? Good. Now it’s time for your family to ask you to explain – kid-’splain,"
    },
    {
        "url": "https://inews.co.uk/opinion/the-unexploded-political-bombs-waiting-for-rishi-sunak-and-keir-starmer-in-2024-2816567?ico=related_article_inline",
        "title": "The unexploded political bombs waiting for Rishi Sunak and <b>Keir Starmer</b> in 2024",
        "description": "When Rishi Sunak and Keir Starmer deliver their New Year messages to the nation next week, both will set out their visions for Britain in the secure knowledge that 2024 is the year of the general election."
    },
    {
        "url": "https://inews.co.uk/opinion/reasons-left-hopeful-2024-2819443?ico=related_stories",
        "title": "Reasons for the left to be hopeful in 2024",
        "description": "You might think that being on the left of British politics is a fairly miserable affair – as both the Tories and Labour drift to the right. Within Keir Starmer’s Labour Party, the left has been marginalised and the policies that underpinned both Jeremy Corbyn’s leadership and Starmer’s leadership campaign have largely been junked."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-finally-learns-use-31746828.amp",
        "title": "Rishi Sunak finally learns to use contactless machine in Christmas miracle",
        "description": "The Prime Minister joked that he was &#39;nailing it&#39; as he successfully made contactless payments in a festive video - after a previous clip of him struggling to use his card went viral"
    },
    {
        "url": "https://thewire.in/world/how-the-israel-palestine-war-is-shifting-the-political-dynamics-in-britain",
        "title": "How the Israel-Palestine War Is Shifting the Political Dynamics in Britain",
        "description": "In line with the US, the entire British ‘political establishment’ has openly sided with Israel. Conversely, over the last two months, there has been a surge in protests and demonstrations led by diverse groups,"
    },
    {
        "url": "https://www.politico.eu/article/how-uk-rishi-sunak-keir-starmer-liz-truss-politicians-spend-christmas-day/",
        "title": "How Rishi Sunak, <b>Keir Starmer</b>, Liz Truss and more do Christmas",
        "description": "POLITICO London Playbook rounds up the festive traditions of Westminster’s power players — in their own words."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/top-10-gaffes-2023-tory-31663808.amp",
        "title": "Top 10 gaffes of 2023 as Tory MPs swear on tape, step on dogs and get police fines",
        "description": "As 2023 comes to a close, the Mirror has rounded up the worst gaffes and blunders of the year as the Tories hit the headlines for all sorts of ludicrous reasons"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847984/who-said-it-quiz-rishi-sunak-or-star-wars",
        "title": "Quiz: Who said it - Rishi Sunak or Star Wars?",
        "description": "Try our special quiz to see if you can tell the Prime Minister, perhaps Westminster&#39;s biggest Star Wars geek, apart from the epic sci-fi film saga"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848307/reform-uk-rishi-sunak-keir-starmer-tories-labour",
        "title": "Reform UK could be a bigger danger than the Tories realise, suggests polling expert",
        "description": "EXCLUSIVE: As many 2019 Tory voters are now defecting to Reform as they are defecting to Labour, Sir John Curtice pointed out."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/2023-british-politics-wrapped-how-much-of-this-nonsense-do-you-remember_uk_657b22c7e4b020f3b6741bfc?3qlb",
        "title": "2023 Politics Wrapped: How Much Of This Nonsense Do You Remember?",
        "description": "Nadhim Zahawi was sacked as Tory Party chairman after “a serious breach of the ministerial code” over his tax affairs. Sunak marked his first 100 days in office by being less popular at that point than his five predecessors (who made it that far). Labour headed into the year with a 26-point lead."
    },
    {
        "url": "https://www.politico.eu/article/ultimate-politico-christmas-gift-guide-cheesiest-political-swag/",
        "title": "The ultimate POLITICO Christmas gift guide for the cheesiest political swag",
        "description": "Whether you have a dedicated Irish Republican in your life or you’re just looking to spark heated conversations at the next Christmas party, this sweatshirt sold by the Sinn Féin Bookshop will do the trick. On it, the words “All I want for Christmas is a United Ireland” appear in a playful cursive font above a gift-wrapped Ireland without borders."
    },
    {
        "url": "https://www.theguardian.com/news/audio/2023/dec/25/revisited-from-blair-to-starmer-labours-path-to-power-part-1-podcast",
        "title": "Revisited: From Blair to <b>Starmer</b>: Labour’s path to power, part 1",
        "description": "Labour was a year out from an election after more than a decade out of power. Its leader, Tony Blair, was surrounded by advisers and strategists plotting their way to victory. Kiran Stacey hears how t"
    },
    {
        "url": "https://www.thetimes.co.uk/article/predictions-2024-what-to-expect-98vwjj2m9",
        "title": "2024 predictions: what Times experts expect from the new year",
        "description": "Long election battles in the UK and US, the march of artificial intelligence and a wealth of art and culture. See what’s in store for 2024"
    },
    {
        "url": "https://www.thenational.scot/news/national/24010837.yousaf-work-labour-gender-bill-election/",
        "title": "Yousaf: We’d work with Labour on gender Bill before election",
        "description": "It would also allow people to self-identify without obtaining a gender dysphoria diagnosis – a part of the legislation which UK Labour leader Sir <b>Keir Starmer</b> has previously described as “not the right way forward”. But he is in favour of modernising ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/christmas-zarach-bed-charity-child-poverty-b2469137.html",
        "title": "Your generosity has given children a Christmas to remember",
        "description": "Who could easily say, for example, which of Rishi Sunak, <b>Keir Starmer</b> or Ed Davey informed us that: “Christmas is a time of peace, joy, compassion, a time of hope and promise of a better world”? Or that “for me, the message of Christmas is for us to ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/child-poverty-independent-campaign-b2469046.html",
        "title": "As more go hungry, have we simply learned to live with child poverty?",
        "description": "Poverty is hardly new – it finds mention in the Bible, among other ancient texts – and it is persistent. Perhaps it is ineradicable, but it is obviously capable of amelioration, by small deeds as well as by great works by the state. Poverty is, above ..."
    }
]