[
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/nottingham-attacks-victims-families-visit-9065652",
        "title": "Nottingham attacks: Victims&#39; families visit Rishi Sunak as Prime Minister does not rule out public inquiry",
        "description": "Valdo Calocane stabbed students Barnaby Webber and Grace O’Malley-Kumar and school caretaker Ian Coates to death."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/two-more-arrests-after-teenagers-28534577",
        "title": "Two more arrests after teenagers stabbed to death in Bristol",
        "description": "Police have arrested two more men after two teenage boys were stabbed to death in Bristol."
    },
    {
        "url": "https://www.thesun.co.uk/news/25587624/railway-bosses-strike-bullies-claiming-bonuses-government-enforce-law/",
        "title": "Pathetic railway bosses give into strike bullies while claiming huge bonuses – why won’t the government enforce the law?",
        "description": "THE defeat of trade union militancy in the 1980s showed Margaret Thatcher at her most resolute. “You can never give in to blackmail. You can never give in to a strike that makes impossible"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68134496?at_medium=RSS&at_campaign=KARANGA%E2%80%A6",
        "title": "Nottingham attacks: Police face probe over killer&#39;s alleged assaults",
        "description": "A police force which was investigating alleged assaults by a triple killer weeks before the Nottingham attacks has referred itself to the watchdog. Barnaby Webber and Grace O&#39;Malley-Kumar, both 19, were fatally stabbed on 13 June along with Ian Coates, 65. Valdo Calocane was given a hospital order for the killings on Thursday."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25579806/keir-starmer-biden-trump-work-together/",
        "title": "Sir <b>Keir Starmer</b> reveals he will work with Donald Trump – despite claiming ex-President was unfit to lead",
        "description": "SIR <b>Keir Starmer</b> says he will work with Donald Trump - after once declaring the ex-US leader unfit to lead the world. The Labour leader makes a u-turn saying transatlantic ties are more important than the personalities at the top of government. He told The ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24081885.photos-labour-leader-keir-starmer-visits-golden-square-warrington/",
        "title": "PHOTOS: Labour leader <b>Keir Starmer</b> visits Golden Square in Warrington",
        "description": "WARRINGTON was visited by Labour leader Sir <b>Keir Starmer</b> this morning, Monday. The Leader of the Opposition popped into Iceland in Golden Square Shopping Centre. Here, he met with Richard Walker, executive chairman of the supermarket and a former Tory ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-visits-iceland-store-173147382.html",
        "title": "<b>Keir Starmer</b> visits Iceland store as chairman Richard Walker backs Labour",
        "description": "Sir <b>Keir Starmer</b> spoke to Iceland staff members at a Warrington store after the supermarket&#39;s executive chairman gave his backing to Labour. Richard Walker, who quit the Conservative party last October in a blow to Rishi Sunak, said Sir <b>Keir</b>&#39;s party was ..."
    },
    {
        "url": "https://uk.news.yahoo.com/photos-labour-leader-sir-keir-142138437.html",
        "title": "PHOTOS: Labour leader Sir <b>Keir Starmer</b> in Golden Square during Warrington visit",
        "description": "WARRINGTON was visited by Labour leader Sir Keir Starmer this morning, Monday. The Leader of the Opposition popped into Iceland in Golden Square Shopping Centre. Here, he met with Richard Walker, executive chairman of the supermarket and a former Tory donor, who quit the Conservative party last October."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7146396",
        "title": "Politics latest: <b>Keir Starmer</b> &#39;delighted&#39; as former Tory endorses Labour - as Sunak announces vape and tobacco crackdown",
        "description": "Pledge tracker: Is Sunak keeping his promises? One year ago, Rishi Sunak made five pledges for voters to judge him on. The prime minister met his pledge to halve inflation by the end of 2023 - even though there was a surprise increase in the 12 months to ..."
    },
    {
        "url": "https://www.standard.co.uk/news/health/james-nottingham-prime-minister-keir-starmer-rishi-sunak-b1135622.html",
        "title": "Nottingham victims’ families say Rishi Sunak has not ruled out public inquiry",
        "description": "David Webber said he and his wife were “horrified” there were no plans for an inquiry. The families met Labour leader Sir <b>Keir Starmer</b> at the party’s London headquarters earlier on Monday. Mr Webber’s parents have said they want to speak with ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/bristol-avon-and-somerset-police-flowers-keir-starmer-police-b1135585.html",
        "title": "Two further arrests made over deaths of teenagers in Bristol",
        "description": "The boys, named by police as Max Dixon, 16, and Mason Rist, 15, were attacked in Ilminster Avenue, in Knowle West, at about 11.20pm on Saturday."
    },
    {
        "url": "https://www.thenational.scot/politics/24082834.bbc-scotland-british-nationalism-needs-facts-scotland/",
        "title": "BBC Scotland and British nationalism: Who needs facts in Scotland?",
        "description": "It&#39;s a day of British nationalists being caught out for spreading misinformation about the Scottish Government."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/29/uk-sanctions-iranian-officials-over-plot-to-kill-journalist/",
        "title": "UK sanctions Iranian officials over plot to kill journalists on British soil",
        "description": "Members of Revolutionary Guard have assets frozen after 15 threats to assassinate fellow countrymen on British soil"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497?ITO=msn",
        "title": "Labour urges restraint in Middle East following deadly attack on US base",
        "description": "Starmer said those responsible for the attack should be &#39;held to account&#39; but expressed fears about conflict spreading in the region"
    },
    {
        "url": "https://www.thenational.scot/politics/24082906.neoliberal-approach-makes-us-customers-opposed-citizens/",
        "title": "Neoliberal approach makes us customers as opposed to citizens",
        "description": "Our FM is more than capable of discussing Scottish affairs and our concerns without a nanny. READ MORE: &#39;<b>Keir Starmer</b>&#39;s support for Tony Blair should be a warning sign for Scotland&#39; So why all the fuss? Could it be that he might bring benefit to the ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7148689",
        "title": "Politics latest: Tory MP quit six-figure minister role because he &#39;couldn&#39;t afford mortgage&#39;",
        "description": "And many of their lordships appear to agree. Labour leader Sir <b>Keir Starmer</b> today met with the families of Grace O&#39;Malley-Kumar, Barnaby Webber and Ian Coates, who were killed in Nottingham in June last year. They were killed in knife attacks by Valdo ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/29/liz-truss-rishi-sunak-ban-cigarettes-vaping-keir-starmer-michael-gove-uk-politics-latest?page=with:block-65b7a3f28f089280c4a14f1c",
        "title": "Ken Clarke tells peers he can’t support new Rwanda bill because overturning supreme court ruling ‘very dangerous’ – as it happened",
        "description": "Conservative former chancellor withdraws support for bill he backed previously"
    },
    {
        "url": "https://www.scotsman.com/news/world/drone-attack-jordan-rishi-sunak-urges-iran-to-de-escalate-tensions-as-lord-david-cameron-condemns-iran-backed-attacks-that-killed-three-us-troops-4496174",
        "title": "Drone attack Jordan: Rishi Sunak urges Iran to de-escalate tensions, as Lord David Cameron condemns Iran-backed attacks that killed three US troops",
        "description": "Sir <b>Keir Starmer</b> said those behind the drone strike should be “held to account”, but expressed fears about the febrile situation widening. Speaking during a visit to the north-west, the Labour leader said: “I am concerned about the possibility of ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13019221/bristol-stab-victim-lost-father-covid.html",
        "title": "Heartbreaking double tragedy for Bristol stab victim&#39;s family: Grandmother of one of two teens, 15 and 16, knifed to death in &#39;gang&#39; attack reveals youngster lost father to ...",
        "description": "Labour leader Sir <b>Keir Starmer</b> said the latest deadly stabbing was more evidence that knife crime was &#39;out of control&#39; in Britain. Recent figures from the Office for National Statistics (ONS) showed knife crimes have soared by 77 per cent from 27,498 in ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13019855/Potential-Labour-Minister-Wales-wants-UK-rejoin-EU-single-market.html",
        "title": "Potential Labour First Minister in Wales wants UK to rejoin EU single market and bring back freedom of movement to repair the &#39;damage&#39; Brexit has done to the economy in ...",
        "description": "However the comments from the Senedd member from Neath put him at odds with Sir <b>Keir Starmer</b>. While the UK Labour leader wants a closer relationship with the EU he has specifically ruled out rejoining the Single Market or the Customs Union. Speaking to ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68133057",
        "title": "Rochdale by-election triggered after Sir Tony Lloyd&#39;s death",
        "description": "Labour leader Sir <b>Keir Starmer</b> said everyone held him in &quot;high esteem&quot;. He was first elected to represent Stretford in 1983 and also served as MP for Manchester Central following boundary changes. He later returned for a second stint in the Commons and ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-its-getting-hotter-out-there/",
        "title": "London Playbook PM: It’s getting hotter out there",
        "description": "GETTING THE GANG TOGETHER: Rishi Sunak chairs his Cabinet at 9.30 a.m. and <b>Keir Starmer</b> does the same with the Shadow Cabinet. LIFE, OH LIFE: The Office for National Statistics updates its life expectancy stats for local areas, at 9.30 a.m. PANDEMIC ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24082256.sunak-defends-smoking-ban-plan-truss-brands-absurd/",
        "title": "Sunak defends smoking ban plan after Truss brands it &#39;absurd&#39;",
        "description": "READ MORE: Michael Gove: SNP wanted &#39;political points&#39; from Covid Labour leader Sir <b>Keir Starmer</b> told journalists the Prime Minister was only allowing his MPs a free vote on this to avoid a rebellion. He told journalists: “I’ve also got concerns that ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24082233.sir-keir-starmer-slams-shambles-government-warrington-visit/",
        "title": "Sir <b>Keir Starmer</b> slams ‘shambles’ of a Government on Warrington visit",
        "description": "LABOUR leader Sir <b>Keir Starmer</b> slammed the ‘shambles’ of a Government on a visit to Warrington as he vowed to tackle the cost of living crisis. The politician has promised Britain’s shoppers that a Labour government will ‘always value the pound in ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860950/mark-drakeford-eu-single-market-Jeremy-Miles",
        "title": "Frontrunner to replace Mark Drakeford blasted after backing rejoining EU&#39;s single market",
        "description": "Jeremy Miles, who is the favourite to take over from Mr Drakeford as Wales&#39;s first minister in March, said he would push &quot;strongly&quot; for that position if Sir <b>Keir Starmer</b> wins the next general election. But Welsh Conservatives leader Andrew RT Davies said ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24080869.sunak-urges-iran-de-escalate-militia-drone-strike-kill-us-troops/",
        "title": "Sunak urges Iran to de-escalate after militia drone strike kill US troops",
        "description": "Sir <b>Keir Starmer</b> said those behind the drone strike should be “held to account” but expressed fears about the febrile situation widening. We strongly condemn attacks by Iran-aligned militia groups against US forces. We continue to urge Iran to de ..."
    },
    {
        "url": "https://www.newhamrecorder.co.uk/news/national/24080833.tributes-laid-scene-teenage-boys-stabbed-death-bristol/",
        "title": "Tributes laid at scene where teenage boys were stabbed to death in Bristol",
        "description": "“We will do all we can to support the families and the local community, working with the police.” Labour leader Sir <b>Keir Starmer</b> described the two deaths as “devastating”. “My reaction to what happened in Bristol starts with the human reaction ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/29/liz-truss-rishi-sunak-ban-cigarettes-vaping-keir-starmer-michael-gove-uk-politics-latest?page=with:block-65b7a6f08f089280c4a14f5b&filterKeyEvents=false",
        "title": "Tory former minister says he resigned from government because he could not afford mortgage hike on £120,000 salary – live",
        "description": "By submitting your message, you are agreeing to share your details with us, which we may use in this blog. <b>Keir Starmer</b> has hinted that the Iceland supermarket boss Richard Walker could play a role supporting a Labour government. He made the comment as he ..."
    },
    {
        "url": "https://www.retail-week.com/grocery/iceland-boss-and-ex-conservative-donor-walker-backs-labour/7045477.article",
        "title": "Iceland boss and ex-Conservative donor Richard Walker backs Labour in next election",
        "description": "Iceland boss Richard Walker has formally backed the Labour Party and its leader Sir <b>Keir Starmer</b> to be the next prime minister. Former Conservative donor Walker, who previously sought to stand as a candidate for the Tories, quit the party last week and ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/nottingham-family-victoria-atkins-turner-nottinghamshire-police-b2486546.html",
        "title": "Family of Nottingham stabbing victim ‘disgusted’ by plan to avoid public inquiry",
        "description": "The couple attended a meeting with Sir <b>Keir Starmer</b> at Labour’s headquarters in London on Monday along with Ms O’Malley-Kumar’s father Dr Sanjoy Kumar and mother Sinead O’Malley as well as Mr Coates’ son James. The victims’ family members are ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-military-hollowed-years-under-funding-ex-defence-secretary-2876297?ico=in-line_link",
        "title": "UK military ‘hollowed out’ by years of under-funding, Ben Wallace warns",
        "description": "The UK military needs to be modernised as well as properly funded after 30 years of being “hollowed out”, former defence secretary Ben Wallace has said. Mr Wallace was responding to comments by the head of the US navy, who said the British Government ..."
    }
]