[
    {
        "url": "https://inews.co.uk/news/starmer-rules-out-resurrecting-hs2-northern-leg-if-labour-wins-election-2850238?ITO=msn",
        "title": "<b>Starmer</b> rules out resurrecting HS2 northern leg if Labour wins election",
        "description": "Sir Keir Starmer appears to have ended hopes of Labour resurrecting HS2’s northern leg after saying the party would not commit to taking the line to Manchester if it wins the next election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/starmer-has-defence-ready-over-his-legal-past-z6gxkbzs8",
        "title": "<b>Starmer</b> has defence ready over his legal past",
        "description": "Tory dossier on Labour leader’s career leaves him unfazed — his strategists have been planning the rebuttals since 2019"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/grant-shapps-red-sea-david-cameron-keir-starmer-john-healey-b1131841.html",
        "title": "PM holding full Cabinet call amid speculation of strike over Red Sea attacks",
        "description": "Rishi Sunak is holding a full Cabinet call on Thursday evening amid mounting speculation that UK and Western allies could take action against Houthi rebels following attacks in the Red Sea."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/manchester-evening-news-exclusive-interview-28432169",
        "title": "The Manchester Evening News&#39; exclusive interview with Labour leader Sir <b>Keir Starmer</b> - in full",
        "description": "EXCLUSIVE: In a wide-ranging interview, Sir Keir set out his plans for Greater Manchester if he becomes Prime Minister, his relationship with Andy Burnham and revealed how he&#39;d spend a day off in the"
    },
    {
        "url": "https://www.thesun.co.uk/news/25334063/sadiq-khan-mayoral-election-london-stabbings/",
        "title": "As London stabbings reach ten per week – will someone please end this Khanage?",
        "description": "TEN people a week are getting stabbed in London but the city mayor has far more important matters on his mind, apparently. Crime in the capital is up ten per cent since 2020, while there was “no"
    },
    {
        "url": "https://metro.co.uk/2024/01/11/sunak-prepares-announce-uk-strikes-houthi-forces-yemen-20102402/",
        "title": "Sunak prepares to announce UK strikes against Houthi forces in Yemen",
        "description": "In recent months, Houthi rebels in Yemen have been launching attacks on ships passing through the Red Sea - worrying the West."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/11/middle-east-crisis-live-updates-israel-gaza-war-hamas-palestine-south-africa-genocide-case-icj?filterKeyEvents=false&page=with:block-659fe1638f086f8ed62f2a74",
        "title": "Middle East crisis live: any attack on Houthis will ‘not go without response’, warns leader",
        "description": "Leader of Yemen’s Houthi group threatens the US and UK with even larger attacks in the Red Sea after US and UK forces intercepted an attack on Tuesday"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/11/crown-prosecution-service-tams-horizon-unsafe-convictions/",
        "title": "CPS involved in up to 99 Post Office convictions, leaked letter shows",
        "description": "The Crown Prosecution Service has admitted it may have been involved in 99 Post Office prosecutions involving the defective Horizon IT system, according to a leaked letter seen by The Telegraph."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-prime-minister-keir-starmer-cabinet-office-simon-case-b1131843.html",
        "title": "Sunak grants Labour permission to start access talks with civil service",
        "description": "Rishi Sunak has granted Sir Keir Starmer permission to start formal access talks with the civil service ahead of a general election this year. The meetings will be an opportunity for Labour to discuss its agenda for government and establish relationships with potential future colleagues in Whitehall."
    },
    {
        "url": "https://uk.news.yahoo.com/children-school-inspectors-back-tougher-195716242.html",
        "title": "Children need the school inspectors back at work, and tougher than ever",
        "description": "It has taken some time, but Labour has finally taken up the cause of the “ghost children”. It’s certainly a scandal. The idea of “home schooling” during lockdown was a cruel joke to those sharing one device per household,"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/labour-leader-keir-starmer-says-28431692",
        "title": "Labour leader <b>Keir Starmer</b> says he&#39;s ruled out bringing HS2 to the North",
        "description": "Labour will not bring HS2 to the North of England, Keir Starmer has said. The Labour leader told the Manchester Evening News today (January 11) that he has ruled out putting the ill-fated plans for a new high-speed railway line between Birmingham and Manchester back on track."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/sir-keir-starmer-makes-liverpool-28430300",
        "title": "Sir <b>Keir Starmer</b> makes Liverpool promise if he is elected Prime Minister",
        "description": "Sir Keir Starmer said Liverpool will be a priority if he is Prime Minister as he laid out plans to address serious health issues in the city."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/labour-leader-sir-keir-starmer-quizzed-by-nhs-staff-over-plans-for-health-service/a507476360.html",
        "title": "Labour leader Sir <b>Keir Starmer</b> quizzed by NHS staff over plans for health service",
        "description": "Labour leader Sir Keir Starmer and shadow health secretary Wes Streeting have been quizzed by hospital staff about their plans for the NHS. Visiting Alder Hey Children’s Hospital in Liverpool on Thursday,"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/keir-starmer-says-work-hand-28431951",
        "title": "<b>Keir Starmer</b> says he will work &#39;hand in glove&#39; with Andy Burnham and give him more power",
        "description": "The Labour leader promised to devolve more power to Greater Manchester, but did not specify what form of devolution he favours"
    },
    {
        "url": "https://inews.co.uk/opinion/brexiteer-boasts-global-britain-mirage-uk-eu-trade-matters-2849638?ico=more_from_this_author",
        "title": "Brexiteer boasts about global Britain were a mirage – UK-EU trade still matters",
        "description": "The latest figures disprove Leavers&#39; claims that distance doesn’t matter - and that non-EU partners would fill the gap"
    },
    {
        "url": "https://uk.news.yahoo.com/pro-eu-fanatics-silent-poland-190141875.html",
        "title": "Pro-EU fanatics are silent on Poland’s new illiberal turn",
        "description": "Imagine a scenario in which Sir Keir Starmer wins the next election, and immediately sacks the chairman and board of the BBC, sits by as former ministers are arrested on charges of abuses of power, says he will depose Andrew Bailey,"
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-rishi-sunak-mr-nobody-britain-b2477174.html",
        "title": "He should mind his language, but there’s nothing sinister about <b>Starmer</b>’s Sunak takedown",
        "description": "The Labour leader was criticised by a cabinet minister for saying Rishi Sunak ‘doesn’t get Britain’ – with the implication that it was a comment about race. Let’s give him the benefit of the doubt, sa"
    },
    {
        "url": "https://www.thenational.scot/politics/24044244.cant-let-england-ignore-political-division-across-union/",
        "title": "We can&#39;t let England ignore political division across the Union",
        "description": "The start point for our conversation this month was my column in last week’s National, in which I offered five reasons why no one in Scotland should vote for <b>Keir Starmer</b>’s Labour Party. READ MORE: Scots arrested at <b>Keir Starmer</b> protest call for BBC ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67950501?at_campaign=KARANGA&at_medium=RSS",
        "title": "I didn&#39;t know about Horizon prosecutions, says <b>Keir Starmer</b>",
        "description": "Sir Keir Starmer says he wasn&#39;t aware of the three Horizon cases brought against sub-postmasters by the Crown Prosecution Service when he led it. The Labour leader was director of public prosecutions from 2008 to 2013. Asked by the BBC if he should have been more curious, he said the CPS handled four million cases in that period."
    },
    {
        "url": "https://www.politico.eu/article/sadiq-khan-mayor-london-end-brexit-vow-silence/",
        "title": "Sadiq Khan says UK ‘vow of silence’ on Brexit failings must end",
        "description": "LONDON — Sadiq Khan will call for an end to British politicians’ “vow of silence” on the ill effects of leaving the EU as he tries to rally support ahead of this year’s London mayoral election."
    },
    {
        "url": "https://www.thenational.scot/news/24044121.scots-arrested-keir-starmer-protest-call-bbc-release-footage/",
        "title": "Scots arrested at <b>Keir Starmer</b> protest call for BBC to release footage",
        "description": "TWO Scots who were arrested at a protest in Glasgow condemning Keir Starmer’s stance on Gaza have called for the BBC to release footage of"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67943548",
        "title": "I&#39;m up for fight over nanny state accusations, says <b>Keir Starmer</b>",
        "description": "Sir Keir Starmer has said he is &quot;up for that fight&quot; over accusations Labour is embracing the &quot;nanny state&quot; as he announced proposals for supervised toothbrushing in schools. The Labour leader said tooth decay was the top reason children between six and 10 go to hospital and that the government had to act."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24044099.rochdale-politician-revealed-terminal-cancer-diagnosis/",
        "title": "Labour MP Sir Tony Lloyd reveals terminal cancer diagnosis",
        "description": "Labour MP Sir Tony Lloyd, aged 73, has announced that he has been receiving treatment for an &quot;aggressive and untreatable&quot; form"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-labour-wes-streeting-nhs-hospital-b1131725.html",
        "title": "Labour leader quizzed by NHS staff over plans for health service",
        "description": "Visiting Alder Hey Children’s Hospital in Liverpool on Thursday, Sir Keir Starmer said he wanted to turn around the health of children."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-testing-the-patience-of-patients/",
        "title": "London Playbook PM: Testing the patience of patients",
        "description": "Verdict from health bosses: NHS National Medical Director Stephen Powis praised his healthcare troops for working really hard to bring the numbers down … But the Royal College of Nursing pointed out that given the figures still remain really high in a strike-free month, the PM can’t blame striking staff for failing to reach his target."
    },
    {
        "url": "https://news.sky.com/story/labour-wont-stand-by-while-children-become-fatter-streeting-says-in-defence-of-nanny-state-reforms-13046290",
        "title": "Labour &#39;wont stand by while children become fatter&#39;, Streeting says, in defence of &#39;nanny state&#39; reforms",
        "description": "Labour has defended its &#39;nanny state&#39; reforms to child healthcare, including policies such as plans to introduce supervised tooth brushing in free breakfast clubs, saying it &quot;won&#39;t stand idly by&quot; while British children become more overweight,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12952865/Rishi-shuns-Davos-Sunak-dodges-ski-resort-business-schmooze-fest-snubs-World-Economic-Forum-second-year-row-Jeremy-Hunt-David-Cameron-set-attend.html",
        "title": "Rishi shuns Davos again: Sunak dodges ski resort business schmooze-fest as he snubs the World Economic Forum for a second year in a row - but Jeremy Hunt and David Cameron are ...",
        "description": "Downing Street tonight confirmed the Prime Minister will not be attending next week&#39;s World Economic Forum in Davos."
    },
    {
        "url": "https://www.lgcplus.com/politics/lgc-briefing/things-can-only-get-better-11-01-2024/",
        "title": "Things can only get better?",
        "description": "New Labour’s record in power could give local government some clues about what to expect from a Starmer administration, writes Jonathan Werran, chief"
    },
    {
        "url": "https://news.sky.com/story/the-by-election-battles-of-rishi-sunaks-premiership-13046025",
        "title": "The by-election battles of Rishi Sunak&#39;s premiership",
        "description": "With another two mid-term votes on the horizon for the prime minister, we take a look back at the raft of contests he has faced since taking over the Tories."
    },
    {
        "url": "https://morningstaronline.co.uk/article/politicians-scramble-to-keep-clear-as-fallout-from-post-office-scandal-goes-on",
        "title": "Politicians scramble to keep clear as fallout from Post Office scandal goes on",
        "description": "MAFIA methods and Fujitsu’s failings were under the spotlight today as politicians scramble to keep clear from the fallout of the Post Office scandal. Post Office investigator Stephen Bradshaw, being examined at the public inquiry into the crisis, denied acting like a “mafia gangster” in his pursuit of wrongly suspected subpostmasters."
    }
]