[
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24048135.david-cameron-hints-britain-strike-houthis-continue-attacking/",
        "title": "David Cameron hints Britain could strike again if Houthis continue attacking",
        "description": "Britain could strike Houthi targets in Yemen again if the rebel group continues to attack ships in the Red Sea, Foreign Secretary Lord David Cameron has suggested. Lord Cameron warned that the Iran-linked militants could force up prices in Britain if they are allowed to block the passage of container ships in the busy trade route."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/13/i-talked-to-keir-starmer-for-three-months-this-is-what-i-learned?ref=upstract.com",
        "title": "I talked to <b>Keir Starmer</b> for three months: this is what I learned",
        "description": "ITV’s deputy political editor had exclusive access to the Labour leader for a TV profile to be aired this week. Is he fit to be Britain’s next PM?"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/ae-doctors-emotional-plea-sir-28435869",
        "title": "A&amp;E doctor&#39;s emotional plea to Sir <b>Keir Starmer</b> over &#39;national scandal&#39; - as thousands of patients die",
        "description": "Among the wide-ranging topics – from the dangers of drill music to cracking down on knife crime – Sir Keir was faced with the stark reality of one of Greater Manchester’s experienced A&amp;E consultants telling him that after almost three decades in emergency medicine, they know ‘the system is truly broken’."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-britain-foreign-secretary-yemen-keir-starmer-b1132175.html",
        "title": "David Cameron hints Britain could strike again if Houthis continue attacking",
        "description": "Britain could strike Houthi targets in Yemen again if the rebel group continues to attack ships in the Red Sea, Foreign Secretary Lord David Cameron has suggested. Lord Cameron warned that the Iran-linked militants could force up prices in Britain if they are allowed to block the passage of container ships in the busy trade route."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12960237/Nigel-Farages-Reform-UK-draws-hit-list-ten-Conservative-MPs-defect-General-Election.html",
        "title": "Nigel Farage&#39;s Reform UK draws up hit list of ten Conservative MPs who may defect before the General Election",
        "description": "Reform UK, of which Mr Farage is honorary president, hopes to appeal to former Tory and Ukip voters who are disillusioned with Conservative policy over immigration and years of infighting. Potential defectors will wait to see whether the Government&#39;s Rwanda Bill fails to get flights off the ground, insiders said."
    },
    {
        "url": "https://www.thesun.co.uk/news/25353254/james-cleverly-labour-illegal-migration/",
        "title": "Labour are attempting a huge con on the public with their ‘policy’ to tackle illegal migration",
        "description": "LABOUR are attempting a huge con on the public. In trying to sound like they have a policy to tackle illegal migration, they are admitting what this Conservative Government has long known. This"
    },
    {
        "url": "https://www.thesun.co.uk/news/25353092/rishi-sunak-election-hopes-rwanda-vote/",
        "title": "Rishi Sunak’s election hopes rest on Rwanda vote this week &amp; Tories must rally together",
        "description": "Tory MPs need to rally over Rwanda RISHI Sunak’s election hopes are resting on a knife-edge vote this week. The PM knows his party’s future depends on steering the Rwanda legislation through the"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-accused-of-trying-to-take-glory-with-new-post-office-law-12593360?postid=7050851",
        "title": "Politics latest: Sunak and Zelenskyy sign security deal; &#39;biggest attack on UK navy in decades&#39; one reason for Yemen strikes - PM",
        "description": "&quot;That is absurd. &quot;No country behaves like that and <b>Keir Starmer</b> has himself welcomed what has happened.&quot; Sir Malcolm went on to say &quot;the conduct of foreign policy has never been for the House of Commons&quot;. Post Office lawyer &#39;doesn&#39;t know&#39; why full ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/12/sir-keir-rules-out-reviving-hs2s-cancelled-northern-leg/",
        "title": "<b>Starmer</b> rules out reviving HS2’s cancelled northern leg",
        "description": "Birmingham to Manchester route &#39;not going to happen&#39; as site won&#39;t be on the market before election, says Labour leader"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h4vv3l",
        "title": "Yemen strikes: The political fallout",
        "description": "Newscast brings you daily analysis of the latest political news stories from the BBC. It was presented by Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Hanna Ward. The technical producer was Jack Graysmark."
    },
    {
        "url": "https://www.thenational.scot/news/24047921.sunday-laura-kuenssberg-full-guest-list/",
        "title": "Who is on Sunday with Laura Kuenssberg: Full guest list",
        "description": "IN the second Sunday with Laura Kuenssberg show of 2024, Keir Starmer and David Cameron will both appear."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12959671/war-inside-Rishi-Sunak-airstrikes-Yemen-Houthi-rebels-trip-Ukraine.html",
        "title": "The inside story of how Rishi Sunak made the call on airstrikes in Yemen on Houthi rebels during a trip to Ukraine",
        "description": "When the RAF &#39;s bombs started falling on Houthi rebel positions in the early hours of Friday morning, the Prime Minister was preparing for bed in a blacked-out train in Ukraine."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/half-a-million-on-london-march-against-israeli-genocide/",
        "title": "Half a million on London march against Israeli genocide",
        "description": "People joined the Palestine march in London against Israeli genocide—and the US’s and Britain’s bombing of Yemen"
    },
    {
        "url": "https://www.nottinghampost.com/news/local-news/nottinghamshires-broken-roads-not-just-9031033",
        "title": "Nottinghamshire&#39;s broken roads are not just a threat to our vehicles",
        "description": "Photos of Ashfield councillors pointing at potholes have become the stuff of ridicule in certain quarters. Such is the frequency of these snaps that the point they are trying to make, highlighting the broken state of Nottinghamshire&#39;s roads, can often be lost."
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-houthi-rebels-labour-yemen-b2478192.html",
        "title": "<b>Keir Starmer</b>: Labour backs strikes on Houthi rebels to protect UK",
        "description": "Those who seek to damage Britain should be in no doubt as to the seriousness of our country’s resolve in response to their aggression"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/starmer-yemen-bombing-iran-britain-b2478179.html",
        "title": "<b>Keir Starmer</b> backs Yemen bombing and issues stern warning to ’terror sponsors’ Iran",
        "description": "Exclusive: In an article for The Independent, the Labour leader doubles down on support for UK and US action and demands Iran-backed rebels stop Red Sea attacks -as new missile strike turns up heat in"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67843756?at_medium=RSS&at_campaign=KARANGA",
        "title": "Kuenssberg: The thorny politics of Houthi strikes for Sunak and <b>Starmer</b>",
        "description": "The military action is instinctively trickier territory for Labour leader Sir Keir Starmer. Sir Keir Starmer says Labour backs the western military operation against Houthi rebels in the Red Sea. Labour nerves still jangle over what went so terribly wrong in Iraq, even after all these years."
    },
    {
        "url": "https://www.burytimes.co.uk/news/24047680.public-consultation-biodiversity-strategy-bury/",
        "title": "Public consultation on biodiversity strategy in Bury",
        "description": "Bury Council are drawing up the boroughs first biodiversity strategy to see what can be done to conserve and enhance it."
    },
    {
        "url": "https://leftfootforward.org/2024/01/how-britains-corrupt-political-funding-helps-the-right/",
        "title": "How Britain’s corrupt political funding helps the Right",
        "description": "With the 2024 general election set to be the dirtiest battle yet, the party which receives the most money from donors could be at a distinct advantage."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/13/london-lefty-or-bernard-manning-double-tories-cannot-demonise-keir-starmer-as-both",
        "title": "London lefty or Bernard Manning double? The Tories can’t demonise <b>Keir Starmer</b> as both",
        "description": "It’s obvious what the Labour leader meant by saying Rishi Sunak ‘didn’t get Britain’. Let’s drop the dog whistling and get back to politics"
    },
    {
        "url": "https://www.huffpost.com/entry/international-elections-2024_n_659d15ade4b075f4cfd3cc88",
        "title": "The World Is Watching U.S. Elections. Here&#39;s What Americans Should Be Watching.",
        "description": "The Taiwanese people went to the polls Saturday for presidential and legislative elections that will be closely watched by both the U.S., one of Taiwan’s biggest supporters on the world stage, and China, which poses a threat but is also the self-governing island’s largest trading partner."
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/charlie-whelan-i-still-rue-to-this-day-gordon-brown-ditheri-338800/",
        "title": "CHARLIE WHELAN: I still rue to this day Gordon Brown dithering over General Election timing",
        "description": "One of those badly advising Gordon Brown was from the USA and he convinced him to delay with the argument that if he waited until the last possible moment he would have been British Prime minister longer than JF Kennedy had been US President!"
    },
    {
        "url": "https://uk.yahoo.com/news/rishi-sunak-faces-triple-election-083045104.html",
        "title": "Rishi Sunak faces triple by-election washout, polling gurus warn",
        "description": "Exclusive: Rishi Sunak has been warned by Britain’s top pollsters that his party faces failure in three upcoming by-elections"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/lewis-goodall-general-election-prime-minister-b1131996.html",
        "title": "Lewis Goodall on when we&#39;ll actually get to elect a Prime Minister",
        "description": "Ulrika Jonsson says Sven-Goran Eriksson is &#39;not a decent person&#39; in deleted post after cancer diagnosis"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/13/backstabbing-deception-politics-boasts-john-bercow-traitors/",
        "title": "Backstabbing and deception are part of politics, boasts John Bercow as he joins The Traitors in US",
        "description": "Former Speaker tries to quell suspicions caused by his heavy breathing, and takes two tumbles in opening episodes"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmers-flip-flops-hope-tories-upbeat-nasty-campaign-kicks-off-2852710",
        "title": "‘<b>Starmer</b>’s flip-flops give us hope’: Tories upbeat as nasty campaign kicks off",
        "description": "A taste of what is to come arrived on Tuesday, when a story emerged in one of the country’s leading tabloids claiming Sir Keir Starmer had “saved” baby murderers and axe killers as a result of the Labour leader’s campaign to end the death penalty."
    },
    {
        "url": "https://inews.co.uk/news/media/wilfred-frost-david-son-sky-news-nepo-baby-2848637?ITO=msn",
        "title": "Call me a nepo baby but I’ve proved myself, says David Frost’s son Wilfred",
        "description": "Wilfred Frost is following in father Sir David&#39;s footsteps with a new Breakfast role at Sky News. &#39;I&#39;m proving myself on live TV every day, it&#39;s sink or swim&#39;"
    },
    {
        "url": "https://uk.news.yahoo.com/david-cameron-keir-starmer-alan-173609547.html",
        "title": "David Cameron, <b>Keir Starmer</b> and Alan Cumming to appear on Laura Kuenssberg show",
        "description": "IN the second Sunday with Laura Kuenssberg show of 2024, Keir Starmer and David Cameron will both appear. The Prime Minister appeared on the BBC’s flagship political programme last week where he was asked about a range of topics,"
    },
    {
        "url": "https://www.politics.co.uk/week-in-review/2024/01/13/week-in-review-how-ed-davey-found-himself-at-the-centre-of-the-post-office-storm/",
        "title": "Week-in-Review: How Ed Davey found himself at the centre of the Post Office storm",
        "description": "The phrase “of course, I regret… ” is a locution deployed by politicians when all other means of avoiding the phrase “I’m sorry” are exhausted. It is a choice chain of words: the “of course” shows the politician both as accepting,"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-contemptuous-governing-class-130000770.html",
        "title": "It’s <b>Keir Starmer</b> and the contemptuous governing class who don’t get Britain",
        "description": "It has been such an eventful week that you might well have missed what should have been a remarkable political event. At the first PMQs of the new year, Sir Keir Starmer, who was obviously determined to begin his election campaign with a bang,"
    },
    {
        "url": "https://www.newstatesman.com/ideas/2024/01/2010s-revolutionaries",
        "title": "From Bowling Alone to scrolling alone",
        "description": "Looking back, for all the talk of revolution and “we are the 99 per cent”, what exactly did the left achieve during those years? Four years on from the dawning of the Covid-19 pandemic, the contours of a complete historical conjuncture,"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24045545.snp-versus-labour-will-parties-set-stalls/",
        "title": "SNP versus Labour: How will parties set out their stalls?",
        "description": "Still, the Yousaf event is significant. It is driven by ambition, of course, but also by set-back and defeat, most recently in Rutherglen."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24046166.zelensky-hails-uk-support-2-5bn-military-aid-pledged-next-year/",
        "title": "Zelensky hails UK support with £2.5bn in military aid pledged for next year",
        "description": "The Prime Minister travelled to Kyiv on Friday to unveil the new funding, becoming the first foreign leader to visit Ukraine this year."
    }
]