[
    {
        "url": "https://www.thenational.scot/news/24030350.south-lanarkshire-police-hunt-group-assault-vandalisms/",
        "title": "South Lanarkshire: Police hunt group over assault and vandalisms",
        "description": "A man needed hospital treatment after he was assaulted by a group of men who vandalised two cars and the properties they were parked outside."
    },
    {
        "url": "https://news.sky.com/story/labours-latest-rishi-sunak-attack-ad-lands-on-tory-supporting-website-conservative-home-within-hours-13042566",
        "title": "Labour&#39;s latest Rishi Sunak attack ad lands on Tory-supporting website Conservative Home within hours",
        "description": "In its new ad to kick off the long campaign for the general election, Labour claims the prime minister&#39;s tax cuts constitute a &quot;raw deal&quot; for working people because of the impact of frozen tax thresholds."
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042?ico=related_stories",
        "title": "The general election will be swayed by foreign policy – good news for Sunak",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.nme.com/features/music-interviews/does-rock-n-roll-kill-braincells-chumbawambas-dunstan-bruce-3564483",
        "title": "Does Rock ‘N’ Roll Kill Braincells?! – Chumbawamba’s Dunstan Bruce",
        "description": "In Does Rock ‘N’ Roll Kill Braincells?!, we quiz an artist on their own career to see how much they can remember"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-packs-audience-tories-31811898",
        "title": "Rishi Sunak packs audience with Tories despite vowing to meet as many voters as possible",
        "description": "As the election year opens, the PM was said to be launching a campaign to reach out to as many voters as possible to brag about the good things the Tories have done"
    },
    {
        "url": "https://www.standard.co.uk/homesandproperty/property-news/primrose-hill-murder-park-security-neighbourhood-crime-b1130352.html",
        "title": "Primrose Hill: from glittering A-list hangout to battleground for public safety?",
        "description": "Primrose Hill exploded in popularity over lockdown. Now the tragic death of a teenager leaves residents searching for answers on how to make their park safe for everyone"
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042",
        "title": "The general election will be decided by foreign policy – good news for Sunak",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25260098/kate-garraway-fought-derek-draper-covid-death/",
        "title": "How Kate Garraway emotionally fought for Derek Draper on TV – taking on MPs &amp; campaigning amid husband’s Covid battle",
        "description": "KATE Garraway bravely fought for her husband Derek Draper during a number of emotional TV moments – before his tragic death. The Good Morning Britain presenter, 56, announced today that her"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/no-police-investigation-after-prince-andrew-among-scores-named-in-jeffrey-epstein-court-papers/",
        "title": "No police investigation after Prince Andrew among scores named in Jeffrey Epstein court papers",
        "description": "No investigation has been launched after Prince Andrew was among scores of people named as associates of Jeffrey Epstein in court papers unsealed by a US court, the Metropolitan Police have said."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-heckled-as-he-leaves-cafe-in-greater-manchester_uk_6598051de4b0912833afbac6",
        "title": "&#39;Boo, Resign&#39;: Rishi Sunak Heckled As He Leaves Cafe In Greater Manchester",
        "description": "Rishi Sunak has been booed, heckled and told to “resign” as he left a cafe in Stockport. The prime minister was meeting Conservative Party activists and members in the North West on Friday. In a video captured by the Manchester Evening News, Sunak was met with shouts of “boo”, “boo”, “leave now” and “resign”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12930381/Rishi-Sunak-election-Samoa-Commonwealth-summit-campaign.html",
        "title": "Rishi Sunak could spend a chunk of general election campaign in SAMOA at Commonwealth summit if he sets the poll date for November",
        "description": "A November 14 election date would mean a potentially awkward clash with the Commonwealth Heads of Government summit - CHOGM."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/natwest-boss-criticised-for-claiming-it-is-not-that-difficult-to-get-on-property-ladder/",
        "title": "NatWest boss criticised for claiming it is not &#39;that difficult&#39; to get on property ladder",
        "description": "The chairman of NatWest bank has come under fire after he claimed it is not that difficult for people to get on the property ladder in the UK."
    },
    {
        "url": "https://www.northumberlandgazette.co.uk/news/opinion/mary-glindon-mp-bring-on-the-election-4467749",
        "title": "Mary Glindon MP: Bring on the election",
        "description": "The primary role of government is to govern if I may state the obvious. Governments also set the basics of tax and spend that encourage or discourage economic growth from which tax is taken and services funded."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24029822.mr-bates-vs-post-office-actress-joins-calls-honours-removal/",
        "title": "Mr Bates vs The Post Office actress joins calls over honours removal",
        "description": "Bolton actress Amy Nutall is encouraging people to watch ITV’s latest drama based on the postmaster scandal of 1999"
    },
    {
        "url": "https://www.edie.net/the-mission-is-clear-starmer-reiterates-28bn-green-spending-plan/",
        "title": "‘The mission is clear’: <b>Starmer</b> reiterates £28bn green spending plan",
        "description": "Labour leader Keir Starmer reiterated his Party’s commitment to spurring £28bn of investment in green markets, stating that Labour would energise a “new Britain with foundations built to last”."
    },
    {
        "url": "https://www.thenational.scot/news/24030031.humza-yousaf-uk-government-must-hold-israel-account-gaza-war/",
        "title": "Humza Yousaf: UK Government must hold Israel to account for Gaza war",
        "description": "THE UK Government must make clear that Israeli action in Gaza has “gone way beyond a legitimate response” to the Hamas attack of October 7,"
    },
    {
        "url": "https://www.pulsetoday.co.uk/news/workload/only-three-icbs-meet-gp-recovery-plan-target-on-self-referrals/",
        "title": "Only three ICBs meet GP recovery plan target on self referrals",
        "description": "Only three ICBs met NHS England’s GP recovery target to expand self-referral pathways by the end of September, Pulse has found."
    },
    {
        "url": "https://uk.news.yahoo.com/pressure-grows-prince-andrew-police-115153326.html",
        "title": "Pressure grows for Prince Andrew police probe after new Jeffrey Epstein files bombshell",
        "description": "The head of the anti-monarchy group Republic said that he had reported the Duke of York to the Metropolitan Police"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rishi-sunak-greater-manchester-cafe-28395343",
        "title": "Rishi Sunak booed as he leaves Greater Manchester café",
        "description": "The Prime Minister is visiting Stockport in a trip to the region today, but several people shouted &#39;resign&#39; as he was leaving"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/05/latest-uk-politics-news-general-election-keir-starmer-rishi-sunak-labour-tories-live?topics=PERSON%3AKate+Garraway",
        "title": "<b>Keir Starmer</b> open to making government time available for private member’s bill to allow assisted dying – UK politics live",
        "description": "Labour leader says he would vote in favour of allowing the law as long as there were significant safeguards"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67891291",
        "title": "<b>Keir Starmer</b>: £28bn green pledge is &#39;confident ambition&#39;",
        "description": "Sir Keir Starmer has described Labour&#39;s policy of eventually spending £28bn a year on green energy projects a &quot;confident ambition&quot;. The party rowed back on its original pledge last year, saying it would &quot;ramp up&quot; to the reach the figure after 2027, rather than hitting it in the first year of a Labour government."
    },
    {
        "url": "https://www.newstatesman.com/business/economics/2024/01/rishi-sunak-business-figures-autumn-election",
        "title": "To win, the Tories need to defy electoral history",
        "description": "The most basic piece of advice in every management book (I’ve read them so you don’t have to!) is that people respect clear decision-making. That is after all the point of a leader, to decide, and in the cocktail of heuristics and biases that guides our hand at the ballot box, decisiveness is often a stronger ingredient than honesty."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/05/keir-starmer-met-police-prince-andrew-epstein/",
        "title": "<b>Starmer</b>: Met Police should look at Prince Andrew abuse allegations",
        "description": "Sir Keir Starmer has urged the Metropolitan Police to look at the sexual abuse allegations made against the Duke of York. The Labour leader was asked during an interview on LBC whether the force should investigate claims made in newly released US court documents ."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/05/sunak-and-starmer-congratulate-nick-ferrari-on-20-years-as-lbc-breakfast-host/",
        "title": "Sunak and <b>Starmer</b> congratulate Nick Ferrari on 20 years as LBC breakfast host",
        "description": "Nick Ferrari has been congratulated on his two decades as host of his LBC breakfast show by Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24029549.keir-starmer-rejects-criticism-labour-light-detailed-policy/",
        "title": "<b>Keir Starmer</b> rejects criticism of Labour as light on detailed policy",
        "description": "Sir Keir Starmer has hit out at critics accusing Labour of lacking detailed policies, as the party prepares for a gruelling general election campaign later this year. The Labour leader promised to meet the Tories’ “fire with fire” as he kicked off the new year with a major speech promising to boost growth and raise standards in British politics."
    },
    {
        "url": "https://uk.news.yahoo.com/humza-yousaf-says-israel-gone-124252052.html",
        "title": "Humza Yousaf says Israel has gone &#39;beyond a legitimate response&#39; in Gaza",
        "description": "Meanwhile, Labour leader, <b>Keir Starmer</b>, said Israel alone should not be allowed to decide what happens to Gaza once its war with Hamas is over. <b>Starmer</b> called for international involvement, including from neighbouring Arab countries, in the future of Gaza ..."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/nick-ferrari-ferrari-lbc-gordon-brown-boris-johnson-b1130524.html",
        "title": "Sunak and <b>Starmer</b> congratulate Nick Ferrari on 20 years as LBC breakfast host",
        "description": "Nick Ferrari has been congratulated on his two decades as host of his LBC breakfast show by Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-backs-police-probe-31812187",
        "title": "<b>Keir Starmer</b> backs police probe after Prince Andrew claims in Epstein files",
        "description": "The Labour leader was asked about newly released court documents that linked Prince Andrew to late paedophile Jeffrey Epstein and referred to sexual assault claims"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1852352/Keir-Starmer-election-tax-income",
        "title": "Sir <b>Keir Starmer</b> fails to commit to raising income tax thresholds if Labour wins election",
        "description": "Sir Keir Starmer refused to commit to tax cuts or unfreezing thresholds - but said he would reverse any cuts to inheritance tax the Tories might make."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/05/keir-starmer-28bn-green-investment-target-ambition?ref=biztoc.com",
        "title": "<b>Starmer</b> downgrades £28bn green investment target to an ‘ambition’",
        "description": "Labour says plan is subject to party’s fiscal rules of keeping debt falling as a percentage of GDP"
    },
    {
        "url": "https://www.camdennewjournal.co.uk/article/you-read-it-here-first",
        "title": "You read it here first…",
        "description": "Stuck for a read in 2024? Never fear. Lucy Popescu is here to steer you through the best upcoming titles in the first six months of the year"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/green-headache-for-labour-as-thangam-debbonaire-on-track-to-lose-her-bristol-seat-366336/",
        "title": "Green headache for Labour as Thangam Debbonaire on track to LOSE her Bristol seat",
        "description": "Twelve of the 14 city councillors in Bristol Central represent the Green Party, which is cause for concern for the deputy culture secretary."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-assisted-dying-law-b2473787.html",
        "title": "<b>Starmer</b> backs change in law on assisted dying",
        "description": "Keir Starmer has backed a change in the law on assisted dying as he indicated MPs could vote on the issue if he becomes prime minister. The Labour leader said he was an “advocate” for reform and warned the current law was not working."
    },
    {
        "url": "https://www.thenational.scot/news/24029572.keir-starmer-rejects-light-policy-criticisms-labour/",
        "title": "<b>Keir Starmer</b> rejects &#39;light on policy&#39; criticisms of Labour",
        "description": "KEIR Starmer has hit out at critics accusing Labour of lacking detailed policies, as the party prepares for a General Election campaign later"
    }
]