[
    {
        "url": "https://www.mirror.co.uk/news/uk-news/houthi-missile-hit-container-red-31889027",
        "title": "&#39;Houthi missile that hit US container in the Red Sea explosive proof conflict not over&#39;",
        "description": "The danger of escalation across the region, and Hamas-backing Houthi leaders citing the Israeli slaughter of Palestinians in Gaza for their own attacks, is a genuine concern"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12966673/QUENTIN-LETTS-martial-patriotism-emotion-north-London-socialist-Keir-Starmer.html",
        "title": "QUENTIN LETTS: Why martial patriotism is just an alien emotion to north London socialist <b>Keir Starmer</b>",
        "description": "There is a sound the Conservative benches make when our armed forces are in action. It is quite low - baritone, not basso profundo - and something between a grunt and a growl."
    },
    {
        "url": "https://www.politicshome.com/news/article/defence-secretary-grant-shapps-says-world-dangerous",
        "title": "Rishi Sunak Says UK Strikes Against Houthis Were Self Defence",
        "description": "Prime Minister Rishi Sunak urged people to not &#39;fall for the malign narrative&#39; that the UK strikes on the Houthis in Yemen were concerning the"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-rwanda-bill-commons-lee-anderson-rebellion-tory-b1132516.html",
        "title": "Sunak faces mounting pressure from Tory right over Rwanda bill as deputy party chairmen join rebellion",
        "description": "Lee Anderson and Brendan Clarke-Smith have signalled they will defy the PM to vote for amendments to harden controversial bill which returns to Commons on Tuesday"
    },
    {
        "url": "https://news.sky.com/story/beth-rigby-pm-might-win-this-rwanda-battle-but-has-he-already-lost-the-war-13049183",
        "title": "Beth Rigby: PM might win this Rwanda battle, but has he already lost the war?",
        "description": "The prime minister&#39;s best hope is that steady progress - on the boats, the economy, NHS waiting lists - can slowly turn the tide. But his prospects don&#39;t look good."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856011/Police-Labour-drug-gangs-criticism",
        "title": "Labour&#39;s policing plan could harm the fight against drug gangs, policing leader warns",
        "description": "Festus Akinbusoye, who is today revealing he is standing again to be Bedfordshire&#39;s Police and Crime Commissioner, said it must be chief constables - and local people - who decide where officers are deployed."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-a-labour-win-poll-position-tz2ns5nf0",
        "title": "The Times view on a Labour win: Poll Position",
        "description": "No objective observer of the Labour Party, which looks increasingly likely to form the next government, would discern from its leader the clarity of vision and charisma that made Sir Tony such a formidable electoral force."
    },
    {
        "url": "https://www.thetimes.co.uk/article/aping-farage-is-no-way-to-avert-a-tory-drubbing-cd9mnjwlk",
        "title": "Aping Farage is no way to avert a Tory drubbing",
        "description": "Conservatives who think they can mitigate electoral losses by shifting to the right forget the majority in their party"
    },
    {
        "url": "https://www.ibtimes.co.uk/conservatives-course-worst-electoral-defeat-since-1997-new-poll-suggests-1722737",
        "title": "Conservatives On Course For Worst Electoral Defeat Since 1997, New Poll Suggests",
        "description": "Sunak has said he plans to hold an election later in the year, which is widely expected to be in October or November, as a YouGov survey of 14,000 respondents forecasts that The Tories will hold on to just 169 seats,"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-now-party-wealth-creation-205149621.html",
        "title": "Labour is now the party of wealth creation",
        "description": "Trust. That is the very simple word I use when I am asked to sum up my job as shadow chancellor. It is my responsibility to ensure that the British people can look at me and say: “I can trust her with my money."
    },
    {
        "url": "https://uk.news.yahoo.com/ignore-poll-predicting-huge-tory-204209963.html",
        "title": "Ignore poll predicting huge Tory wipeout, says <b>Keir Starmer</b>",
        "description": "Labour candidates and MPs should disregard a poll suggesting the Tories could be on course for a 1997-style wipeout at the next general election, Sir Keir Starmer has said. A YouGov survey of 14,000 people,"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24051617.tory-mps-told-ignore-dire-polling-amid-warnings-election-wipeout/",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    },
    {
        "url": "https://indiatribune.com/uk-conservatives-heading-for-electoral-wipeout-on-scale-of-their-1997-defeat-by-labour/",
        "title": "UK Conservatives heading for electoral wipeout on scale of their 1997 defeat by Labour",
        "description": "The UK&#39;s Conservative Party is heading for an electoral wipeout on the scale of their 1997 defeat by Labour, the most authoritative opinion poll in five years has predicted, media reports said. The YouGov survey of 14,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/isaac-levido-mps-rishi-sunak-yougov-safety-b1132515.html",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    },
    {
        "url": "https://www.politicshome.com/news/article/reform-sets-up-tory-party-defections-unit",
        "title": "Reform Sets Up Tory Defections Unit",
        "description": "Right wing party Reform UK has set up a new unit focused on handling potential defections to its ranks as it tries to lure"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856031/isaac-levido-1922-lord-frost",
        "title": "Rishi Sunak&#39;s top advisor blasts Lord Frost for &#39;undermining Tories&#39; with shocking poll",
        "description": "The Tories&#39; top election strategist Isaac Levido has told Tory MPs to ignore the shock poll predicting an election wipeout, calling on them to stay united."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/15/tory-election-strategist-levido-hope-win-labour-poll-yougov/",
        "title": "Tory election strategist tells Cabinet &#39;there is still hope&#39; for general election win",
        "description": "The Australian strategist, charged with delivering a historic but unlikely fifth Tory election victory, said at the meeting that the British public was now widely aware of the five priorities for office which Mr Sunak set a year ago and that they chime with voter concerns."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/15/houthi-missile-strike-us-owned-cargo-ship-red-sea/",
        "title": "Houthis vow to target British ships in Red Sea",
        "description": "Rebels say they will expand their attacks after earlier striking an American-operated container vessel with missile"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-wont-tax-super-190536595.html",
        "title": "<b>Keir Starmer</b> &#39;won&#39;t tax super rich&#39; more to redistribute to poorest if PM",
        "description": "KEIR Starmer has said that he won’t tax the super rich more in order to redistribute to the poorest if prime minister."
    },
    {
        "url": "https://www.thenational.scot/news/24051567.keir-starmer-wont-tax-super-rich-redistribute-poor-pm/",
        "title": "<b>Keir Starmer</b> &#39;won&#39;t tax super rich&#39; more to redistribute to poor if PM",
        "description": "KEIR Starmer has said that he won’t tax the super rich more in order to redistribute to the poorest if prime minister."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/downing-street-election-guru-tells-tories-to-unite-or-face-defeat_uk_65a58519e4b06444b223d1ba",
        "title": "Downing Street Election Guru Tells Tories To Unite Or Face Defeat",
        "description": "Rishi Sunak’s election guru has warned Tory MPs they need to “get serious” or face being kicked out of government. Isaac Levido warned that voters would punish the warring party after a new poll showed Labour are on course for a landslide victory later this year."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67985452?at_link_origin=BBC_Scotland_News&at_bbc_team=editorial&at_medium=social&at_campaign=Social_Flow&at_ptr_name=facebook_page&at_link_id=3CDFA0A2-B3CA-11EE-BA32-072755826ABF&at_format=link&at_link_type=web_link&at_campaign_type=owned",
        "title": "Rishi Sunak: Strikes on Houthis intended as &#39;limited, single action&#39;",
        "description": "But the prime minister says the UK &quot;will not hesitate to protect our security&quot; following Houthi attacks on shipping."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67982650",
        "title": "I am determined to pass Rwanda bill, says Rishi Sunak",
        "description": "Prime Minister Rishi Sunak has said he is &quot;determined&quot; to get his Safety of Rwanda Bill into law, despite criticism from his own backbenchers. More than 50 Conservative MPs have backed amendments they say would toughen up the bill, which returns to the House of Commons on Tuesday."
    },
    {
        "url": "https://www.heraldscotland.com/news/24051505.rishi-sunak-refuses-rule-air-strikes-amid-esclation-fears/",
        "title": "Rishi Sunak refuses to rule out more air strikes amid esclation fears",
        "description": "Rishi Sunak has said joint US-UK air strikes on Houthi targets in Yemen last week were intended as a “limited single action” but refused to"
    },
    {
        "url": "https://inews.co.uk/opinion/tory-political-obliteration-rishi-sunak-2855589?ico=more_from_this_author",
        "title": "The Tories face political obliteration – and could be out of power for years",
        "description": "After 1997, the collective depression of the Conservative Party – which had thought itself fitted for decades in power and which instead suffered a bewildered inability to connect with the electorate’s changing mood – proved a major obstacle to its own ability to fight back."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/15/prospect-of-electoral-annihilation-makes-for-a-very-blue-monday-for-rish",
        "title": "Prospect of electoral annihilation makes for a very Blue Monday for Rish!",
        "description": "Poll suggests almost everyone has had enough of the Tories, as party prepares to tear itself in two over Rwanda bill"
    },
    {
        "url": "https://www.scotsman.com/news/politics/yemen-bombings-rishi-sunak-defends-uk-strikes-in-red-sea-amid-inflation-fears-as-snp-seek-answers-over-long-term-strategy-4479420",
        "title": "Yemen bombings: Rishi Sunak defends UK strikes in Red Sea amid inflation fears as SNP seek answers over long-term strategy",
        "description": "Rishi Sunak has insisted the UK must be “prepared to back our words with actions”, as a fresh strike against a US-owned ship in the Red Sea fuelled tensions and economists warned the conflict risked fuelling a new spike in inflation."
    },
    {
        "url": "https://www.chronicle.gi/shapps-makes-case-for-increased-western-defence-spending-in-pre-war-era/",
        "title": "Shapps makes case for increased western defence spending in ‘pre-war’ era",
        "description": "By David Hughes, PA Political Editor The UK is facing a “pre-war world” and the “peace dividend” that allowed successive governments to ease spending on defence is over, Grant Shapps has said. Before taking the role,"
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-tories-96-seats-data-2855594?ico=most_popular",
        "title": "Reform will not cost the Tories 96 seats – here’s what the data really shows",
        "description": "A new poll by the company suggests the Tories could be on course for a 1997-style wipe-out at the next general election, losing droves of seats to Labour"
    },
    {
        "url": "https://www.chronicle.gi/uk-will-back-words-with-actions-in-red-sea-says-sunak-as-attacks-continue/",
        "title": "UK will ‘back words with actions’ in Red Sea, says Sunak as attacks continue",
        "description": "By PA Reporters Rishi Sunak has warned that the UK Government remains “prepared to back our words with actions”, as missile attacks continued in the Red Sea despite last week’s air strikes against Houthi rebels."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24051440.conservative-leader-chris-steward-hits-lib-dems/",
        "title": "Conservative leader Chris Steward hits out at Lib Dems",
        "description": "The Conservative group leader on the City of York Council has accused the Liberal Democrats of trying to score “cheap political points”"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/15/rishi-sunak-uk-willing-further-military-action-houthis?ref=upstract.com",
        "title": "Rishi Sunak: UK willing to take further military action against Houthis",
        "description": "Prime minister addresses MPs hours after Yemen-based group fires on another container ship in Red Sea"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-mps-parliament-government-keir-starmer-b1132496.html",
        "title": "Sunak: It was necessary to strike Houthis at speed rather than recall Parliament",
        "description": "Rishi Sunak has defended his decision not to consult Parliament before approving RAF airstrikes against Houthi rebels, amid pleas to avoid escalation across the Middle East. The Prime Minister said sometimes there is a need to act “decisively” and the Government must have the power to act in such emergencies."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-tories-96-seats-data-2855594?ITO=msn",
        "title": "Reform will not cost the Tories 96 seats – here’s what the data really shows",
        "description": "A new poll by the company suggests the Tories could be on course for a 1997-style wipe-out at the next general election, losing droves of seats to Labour"
    }
]