[
    {
        "url": "https://www.mirror.co.uk/news/politics/around-16-million-low-paid-31789106",
        "title": "Around 1.6 million low-paid workers set to bear brunt of Tory stealth taxes",
        "description": "Labour&#39;s analysis says by 2024-2025 a family with two adults working full time on the National Living Wage will pay £1,320 more a year due to Tory stealth taxes"
    },
    {
        "url": "https://inews.co.uk/uncategorized/a-year-that-will-reshape-the-world-2834621?ico=related_stories",
        "title": "A year that will reshape the world",
        "description": "This year will be an epic test for democracy around the world. An unprecedented two billion people go to the polls. From India, Pakistan and Taiwan to the sham vote in Russia, the results will shape our planet’s future – and they have the potential to exacerbate global tensions or herald an era of renewed optimism."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12920515/ANDREW-NEIL-Putin-Xi-Kim-New-Year-threats-Wests-2024-year-despots.html",
        "title": "ANDREW NEIL: With Putin, Xi Jinping and Kim Jong Un issuing New Year threats, the West&#39;s woeful leadership crisis means 2024 could become the year of the despots",
        "description": "Even though there will be votes in over 60 countries, 2024 is more likely to be a year of crisis for democracy, which is in greater peril than at any time since the Cold War."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/02/reform-a-bigger-risk-to-tories-than-labour-lee-anderson/",
        "title": "Reform poses bigger threat to Tories than Labour, warns Lee Anderson",
        "description": "Red Wall MP tells Right-wing party’s leader to be ‘careful what you wish’ for as its popularity could put Keir Starmer in power"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/02/sir-keir-starmer-to-distance-himself-jeremy-corbyn-labour/",
        "title": "<b>Starmer</b> to distance himself from Corbyn in major speech",
        "description": "Labour leader will hit out at predecessor on Thursday as he vows his premiership would not be ‘vanity dressed up as virtue’"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/02/labour-crackdown-on-cronyism-could-send-public-fraudsters-to-jail-for-a-decade",
        "title": "Labour ‘crackdown on cronyism’ could send public fraudsters to jail for a decade",
        "description": "Party considering new offence of fraud against the public purse as Keir Starmer vows to clean up politics after public scandals"
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-income-tax-cut-tories-labour-economy-2834452",
        "title": "Sunak draws up income tax cut plan as Tories fight Labour on the economy",
        "description": "The Government is weighing up pre-election cuts to income tax as Rishi Sunak seeks to draw dividing lines with Labour on the economy. The Prime Minister will use his first public appearance of the year on Thursday to argue that he is cutting taxes on individuals – despite the overall tax burden heading for a record high."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/political-leaders-to-set-out-stall-and-start-campaigning-ahead-of-election-366108/",
        "title": "Political leaders to set out stall and start campaigning ahead of election",
        "description": "Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer are both set to make public appearances this week."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/02/how-can-keir-starmer-win-big-this-year-by-leading-with-love-and-ambition",
        "title": "How can <b>Keir Starmer</b> win big this year? By leading with love and ambition",
        "description": "It is time for a major political change - and Labour must resist the Tory call to idiocy and project a vision to tackle the climate, housing and NHS crises, writes Zoe Williams"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851200/lee-anderson-reform-uk-bigger-threat-than-labour",
        "title": "Lee Anderson warns of &#39;bigger threat than Labour&#39; that could help <b>Keir Starmer</b> win power",
        "description": "The Tory MP laid bare how Nigel Farage and his party had to be careful at the next election as Reform UK&#39;s presence could see Labour emerge victorious."
    },
    {
        "url": "https://morningstaronline.co.uk/article/editorial-left-and-election",
        "title": "As the general election looms, the left has choices to make",
        "description": "2024 is almost certainly a general election year. Westminster rumours of a May poll are rife, but the autumn remains the more likely option for beleaguered premier Rishi Sunak."
    },
    {
        "url": "https://morningstaronline.co.uk/article/sir-keir-risks-risks-destroying-the-labour-party-jon-cruddas-mp-warns",
        "title": "Sir <b>Keir</b> risks risks destroying the Labour Party, Jon Cruddas MP warns",
        "description": "LABOUR leader Sir Keir Starmer risks destroying the party, prominent back-bench MP Jon Cruddas has said this week. In a book published to mark the centenary of the election of the first Labour government, Mr Cruddas launched a coruscating critique of Sir Keir."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-is-the-true-heir-to-jacques-delors-vision-jghvv03mx",
        "title": "<b>Keir Starmer</b> is the true heir to Jacques Delors’ vision",
        "description": "It would, in time, be remembered as the speech that changed the Labour Party. But among the delegates in Bournemouth that September day were leftwingers who had spent years railing against the sort of thing they were now hearing from the conference stage ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-prime-minister-labour-jeremy-hunt-b1129944.html",
        "title": "Political leaders to set out stall and start campaigning ahead of election",
        "description": "Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer are both set to make public appearances this week."
    },
    {
        "url": "https://morningstaronline.co.uk/article/starmer-could-destroy-labour-mp-warns",
        "title": "<b>Starmer</b> Could Destroy Labour, MP Warns",
        "description": "LABOUR leader Sir Keir Starmer risks destroying the party, prominent back-bench MP Jon Cruddas has said this week. In a book published to mark the centenary of the election of the first Labour government, Mr Cruddas launched a coruscating critique of Sir Keir."
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/01/rishi-sunak-when-2024-general-election",
        "title": "The SNP will have nowhere to hide in 2024",
        "description": "It suits the Prime Minister to keep open the option of a May election but he risks being labelled a “bottler”."
    },
    {
        "url": "https://www.thestar.co.uk/news/politics/sheffield-council-leader-addresses-bankruptcy-fears-amid-huge-funding-challenges-4463428",
        "title": "Sheffield council leader addresses ‘bankruptcy’ fears amid huge funding challenges",
        "description": "However, Sir <b>Keir Starmer</b>, the leader of the opposition in parliament, is reportedly not ready to open the spending taps if he wins the election this year. So what would be different in funding local governments? Cllr Hunt said a Labour government would ..."
    },
    {
        "url": "https://www.ft.com/content/dbaab4bd-a094-490b-855e-2752c0ab87d2",
        "title": "Lib Dems look to gain from stealth tax hit in Tory heartlands",
        "description": "Research shows over 2mn in London and the South East will be pushed into higher tax bracket because of threshold freeze"
    },
    {
        "url": "https://www.kentonline.co.uk/news/opinion/for-first-time-in-years-tories-can-claim-tough-migration-a-299400/",
        "title": "Opinion: Drop in asylum seeker numbers appears to show Conservatives’ tough stance on small boats crisis is working, says Paul Francis",
        "description": "The Tories will be breathing a sigh of relief that a drop in small boat crossings appears to show its tough stance is working, writes Paul Francis."
    },
    {
        "url": "https://www.independent.co.uk/voices/labour-small-boats-starmer-sunak-migration-b2472161.html",
        "title": "‘Stop the boasts’ is a good soundbite to tackle immigration, but what would Labour actually do?",
        "description": "Would Keir Starmer and Yvette Cooper really be any better at dealing with asylum applications, asks John Rentoul"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-election-poll-labour-conservative-liberal-starmer-b1129892.html",
        "title": "Tories insist Rishi Sunak has ‘steep and narrow’ path to victory despite lagging in polls",
        "description": "Rishi Sunak will have to scale a “steep and narrow path” to pull off a General Election victory this year, says a senior Tory official. Alan Mabbutt, the Conservatives’ registered treasurer and legal officer, told party supporters that the election campaign would be “one of the hardest our party has ever fought”."
    },
    {
        "url": "https://www.ft.com/content/02e955a1-a4e6-4624-bc18-40758d9c2eca",
        "title": "How to heal the UK’s great education divide",
        "description": "To some extent it is healthy to bring such debates in to the open. But if these divides ossify, they can corrode trust and social cohesion. Finding a way to bring the two sides together, to unite around a shared social and political project, is one of the biggest challenges for Britain’s political leaders in the years ahead."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/a-general-election-in-may-a-one-third-probability-according-to-tory-chair-366084/",
        "title": "A General Election in May? A one-third probability, according to Tory chair",
        "description": "Richard Holden has recently shared insights hinting at the possibility of an earlier-than-expected general election in the spring."
    },
    {
        "url": "https://www.carbonbrief.org/daily-brief/sunak-under-fire-for-inexplicable-failure-to-appoint-new-climate-committee-chief/",
        "title": "Sunak under fire for ‘inexplicable’ failure to appoint new climate committee chief",
        "description": "Rishi Sunak has “come under fierce attack” for his failure to appoint a new chair of the UK’s CCC, after Lord Deben stood down from the role 18 months ago."
    },
    {
        "url": "https://socialistworker.co.uk/news/tories-and-labour-both-strive-to-attack-refugees-as-election-looms/",
        "title": "Tories and Labour both strive to attack refugees as election looms",
        "description": "Rishi Sunak and Keir Starmer jockey to be seen as the tougher one on migrants and refugees in hopes of gaining votes"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851006/Rishi-Sunak-presidential-general-election-campaign",
        "title": "Rishi Sunak bracing for ‘presidential’ election against <b>Keir Starmer</b> – and this proves it",
        "description": "The Tories have frequently been reportedly planning a &quot;Mano a mano&quot; election, and new data seems to suggest this is true."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12918493/War-taxes-Rishi-Sunak-vows-money-peoples-pockets-Labour-online-calculator-summer-election.html",
        "title": "War over taxes as Rishi Sunak vows to put &#39;more money in people&#39;s pockets&#39; while Labour creates new online &#39;calculator&#39; to show cost of Tory hikes - and two-thirds of voters ...",
        "description": "Rishi Sunak is expected to start trying to woo voters later this week with a pledge to put more cash back in their pockets."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-launches-tory-tax-calculator-31786297",
        "title": "Labour launches &#39;Tory tax calculator&#39; for Brits to work out how much worse off they are",
        "description": "Labour has launched a new online tool allowing people to calculate how much tax they pay, and plans to hammer Rishi Sunak with it ahead of the general election"
    },
    {
        "url": "https://www.politics.co.uk/opinion-former/press-release/2024/01/02/labour-urged-to-back-plan-for-justice-for-seriously-ill-firefighters/",
        "title": "Labour urged to back plan for justice for seriously ill firefighters",
        "description": "Keir Starmer is facing a call from the Fire Brigades Union to back financial support – alongside funding for health monitoring and prevention measures – for firefighters who have developed cancer and other diseases through their job."
    },
    {
        "url": "https://uk.news.yahoo.com/people-labour-risks-pushing-win-080000282.html",
        "title": "The people Labour risks pushing out if it wins the general election",
        "description": "In the run-up to the general election, Sir Keir Starmer will no doubt be looking back at Labour’s most successful leaders and asking himself how he can emulate their success."
    },
    {
        "url": "https://www.newsletter.co.uk/news/opinion/columnists/ruth-dudley-edwards-the-sane-are-making-progress-against-the-extreme-transactivists-4462592",
        "title": "Ruth Dudley Edwards: The sane are making progress against the extreme transactivists",
        "description": "The Celts have been madder than the English. The implications for biological women prisoners of SNP’s lunatic Gender Recognition Bill, which First Minister Mark Drakeford aspired to bring to Wales, helped bring down Nicola Sturgeon, and is leading to rethinking in the Republic, which introduced it sneakily in 2015."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/02/pm-says-uk-must-look-forward-with-pride-and-optimism-to-2024-as-poll-looms/",
        "title": "PM says UK must ‘look forward with pride and optimism’ to 2024 as poll looms",
        "description": "Mr Sunak will call a general election in 2024, with the Tories battling to hold on to power as opinion polls suggest a healthy Labour lead."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/02/labour-sets-50-british-food-pledge-to-woo-farmers/",
        "title": "Labour sets 50% British food pledge to woo farmers",
        "description": "The party said it would use government buying power to back agricultural businesses as it seeks to woo rural voters."
    },
    {
        "url": "https://www.propertyreporter.co.uk/is-intergenerational-equality-achievable-in-property.html",
        "title": "Is intergenerational equality achievable in property?",
        "description": "David Churchill, partner at Carter Jonas, looks at the challenges faced by younger aspiring homeowners and how, unfortunately, 2024 is unlikely to be any different for them."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/finance-2/tory-tax-calculator-shows-if-your-taxes-will-rise-even-after-national-insurance-cut-takes-effect-366048/",
        "title": "‘Tory tax calculator’ shows if your taxes will rise even after national insurance cut takes effect",
        "description": "The Labour party says voters will still be worse off even after the main rate of national insurance is reduced to 10 per cent on January 6."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/politics-stirs-and-yes-its-migration-again/",
        "title": "Politics stirs — and yes, it’s migration again",
        "description": "NEW YEAR’S RESOLUTION: Rishi Sunak is starting 2024 as he means to go on — by talking about migration again. The PM is using his first policy announcement of the year to claim he’s cleared “the legacy asylum backlog” … and the debate over it all feels like a drill for the election. Welcome to the next [?] months of your life."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-12890569/US-bonds-gold-AI-Net-Zero-invest-2024.html",
        "title": "Where should you invest in 2024? From the US, to bonds, gold, AI and Net Zero opportunities",
        "description": "Politics will dominate 2024 to a remarkable degree, especially while the tragic conflicts in Ukraine and Gaza remain unresolved. Elections in the US and at home in the UK could coincide next Autumn."
    },
    {
        "url": "https://uk.news.yahoo.com/time-running-discover-real-starmer-070000506.html",
        "title": "Time is running out to discover the real <b>Starmer</b>",
        "description": "New Year, new New Labour. That seems Britain’s likely fate in the general election that must be held before Christmas. As 2024 begins, it seems surprising that we still know so little about the man who,"
    },
    {
        "url": "https://www.civilserviceworld.com/professions/article/starmer-working-on-plans-to-tackle-civilservice-churn-and-other-news-you-may-have-missed-over-christmas",
        "title": "<b>Starmer</b> working on plans to tackle civil-service churn – and other news you may have missed over Christmas",
        "description": "Here are three stories that emerged over the festive period. Labour leader Sir <b>Keir Starmer</b> is working with new chief of staff Sue Gray on proposals to reduce churn in the civil service, with a particular focus on higher-level roles. According to the ..."
    }
]