[
    {
        "url": "https://www.thetimes.co.uk/article/ban-conversion-therapy-first-person-psd5njl8q",
        "title": "Conversion therapy? It must be banned. I should know",
        "description": "In the spring of 2021, as we dipped in and out of lockdowns, I found myself halfway through a course of six one-hour Zoom sessions with a counsellor who believed I could change my sexuality from gay to straight. I’d been referred to her after a ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68122275?at_medium=RSS",
        "title": "Bristol stabbings: Boys, 15 and 16, killed in stabbing attack named",
        "description": "Speaking during a visit to Warrington, Labour leader Sir <b>Keir Starmer</b> said tackling knife crime requires a &quot;laser focus&quot; as he described the incident as &quot;devastating&quot;. He added: &quot;We can&#39;t carry on with these awful stories of knife crime. We have to roll up ..."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-promises-to-fix-unprecedented-stagnation-as-labour-targets-business-voters-13060810",
        "title": "Sir <b>Keir Starmer</b> promises to &#39;fix unprecedented stagnation&#39; as Labour targets business voters",
        "description": "The leader will launch the party&#39;s &quot;plan for business&quot; on Thursday in front of hundreds of firms in central London."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24089072.labour-party-business-starmer-tell-company-chiefs/",
        "title": "Labour is ‘party of business’, <b>Starmer</b> to tell company chiefs",
        "description": "The Labour leader and shadow chancellor Rachel Reeves will seek to woo senior company executives and investors at event in London."
    },
    {
        "url": "https://www.pressandjournal.co.uk/fp/opinion/columnists/6358427/keir-starmer-nationalism-scotland-john-ferry-opinion/",
        "title": "John Ferry: A <b>Starmer</b> government should avoid leaning into Scottish or British nationalism",
        "description": "An icon of a desk calendar. An icon of a circle with a diagonal line across. An icon of a block arrow pointing to the right. An icon of a paper envelope. An icon of the Facebook &quot;f&quot; mark. An icon of the Google &quot;G&quot; mark. An icon of the Linked In &quot;in&quot; mark ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/plaid-cymru-leader-accuses-keir-starmer-of-being-disinterested-in-wales-98931/",
        "title": "Plaid Cymru leader accuses <b>Keir Starmer</b> of being ‘disinterested’ in Wales",
        "description": "Rhun ap Iorwerth fears a potential future Labour government would not hand powers to the Senedd that the people of Wales want to see."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24087403.labour-accuses-tories-laughing-warrington-iceland-employee/",
        "title": "Labour accuses Tories of ‘laughing at Warrington Iceland employee’",
        "description": "LABOUR leader Sir <b>Keir Starmer</b> has accused the Conservatives of &#39;laughing at an Iceland employee from Warrington&#39;. It comes following the Leader of the Opposition’s visit to Golden Square Shopping Centre in the town on Monday. Sir <b>Keir</b> met with employees ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-disinterested-wales-claims-160000275.html",
        "title": "<b>Keir Starmer</b> &#39;disinterested&#39; in Wales, claims Plaid Cymru leader",
        "description": "The leader of Plaid Cymru has accused Sir Keir Starmer of being “disinterested” in Wales, calling for Labour to be serious about delivering constitutional change if it comes to power."
    },
    {
        "url": "https://www.theguardian.com/politics/video/2024/jan/31/pmqs-keir-starmer-mortgages-increase-video",
        "title": "PMQs: <b>Keir Starmer</b> says mortgages have increased by an average £240 a month – video",
        "description": "The Labour leader has challenged the prime minister on rising mortgage rates across the UK"
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24086195.tilehurst-residents-share-worries-keir-starmer/",
        "title": "Tilehurst residents share their worries with <b>Keir Starmer</b>",
        "description": "On the positive sides, Chris, along with friends Stanley and Sandy, said there was much community spirit in Tilehurst. As a group they often meet to “put the world to rights” at the cafe. “We have a good old natter, we help each other out with issues, we talk about anything,” she said."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-opposition-labour-party-pledge-223300546.html",
        "title": "UK opposition Labour party pledge productivity fix in latest pitch to business",
        "description": "Britain&#39;s opposition Labour Party will pledge to fix Britain&#39;s stagnating productivity at a conference for businesses on Thursday, its latest charm offensive to companies and investors ahead of a national election expected this year."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/theyre-saying-daughters-lives-worth-32015061",
        "title": "&#39;They&#39;re saying our daughters&#39; lives worth less than those killed on streets - they deserve justice&#39;",
        "description": "Justice for our Daughters – to help the bid to stop domestic violence killers being jailed for a decade less than other murderers"
    },
    {
        "url": "https://5pillarsuk.com/2024/01/31/disgusting-cowards-labour-run-london-council-disrupted-over-gaza/",
        "title": "“Disgusting cowards!” Labour-run London council disrupted over Gaza",
        "description": "The protesters say party leader <b>Keir Starmer</b> justifying Israel’s collective punishment of two million Palestinians, and Labour’s refusals to call for a ceasefire in Gaza, will cost them at the next election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/31/labour-pledge-renationalising-rail-starmer-woos-business/",
        "title": "Labour pledges to push ahead with renationalising rail as <b>Starmer</b> launches drive to woo business",
        "description": "Shadow transport secretary says no compensation will be paid to operators when contracts lapse and network goes into public ownership"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/uk/labour-is-party-of-business-starmer-to-tell-company-chiefs/a898282473.html",
        "title": "Labour is ‘party of business’, <b>Starmer</b> to tell company chiefs",
        "description": "Sir Keir Starmer is set to pitch Labour as the party to reverse the UK’s slagging growth rates with a major address to hundreds of business leaders."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1861664/fly-tipping-labour-towns",
        "title": "Fly-tipping three times more likely in Labour-run towns new data shows",
        "description": "Labour-run councils reported a shocking average of 6,843 fly-tipping incidents as opposed to 2,428 in Tory councils."
    },
    {
        "url": "https://www.itv.com/news/2024-01-31/chancellor-says-less-room-for-tax-cuts-in-spring-budget-than-in-autumn",
        "title": "Chancellor says less room for tax cuts in spring Budget than in autumn",
        "description": "Every week Tom, Robert and Anushka dig into the biggest issues dominating the political agenda… Prime Minister Rishi Sunak’s party has been consistently behind Sir <b>Keir Starmer</b>’s Labour in opinion polls for more than a year, trailing by as much as 20 ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/nicola-sturgeon-reputation-snp-votes-covid-betrayal-2883150?ico=related_article_inline",
        "title": "Nicola Sturgeon loses reputation and SNP votes after Covid ‘betrayal’",
        "description": "Labour hopes to take a number of seats from Humza Yousaf’s party in this year’s general election, after being left with one in 2019"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/hunt-less-scope-for-tax-cuts-in-march-budget-than-in-the-autumn-98979/",
        "title": "Hunt: Less scope for tax cuts in March Budget than in the autumn",
        "description": "Jeremy Hunt said it is unlikely he will have “the kind of room that I had for those very big tax cuts” in the autumn statement. The Chancellor confirmed that he warned the Cabinet there is less scope for tax reductions in his March 6 Budget despite clamour within the Tory ranks for cuts to try to woo voters."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rachel-reeves-bankers-bonus-labour-starmer-b2487874.html?lid=f3e3db6717zu",
        "title": "Rachel Reeves sparks Labour backlash as she declares <b>Starmer</b> won’t cut bankers’ bonuses",
        "description": "Sir <b>Keir Starmer</b>’s top ally said that while the cap on bonuses was “the right thing to do to rebuild the public finances […] that has gone now and we don’t have any intention of bringing that back.” Former leader Jeremy Corbyn joined left-wing ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68155976.amp",
        "title": "<b>Keir Starmer</b> clashes with Rishi Sunak over Iceland worker&#39;s mortgage",
        "description": "You can change these settings by clicking “Ad Choices / Do not sell my info” in the footer at any time. Sir <b>Keir Starmer</b> has accused Rishi Sunak of &quot;laughing&quot; at an Iceland supermarket worker who is struggling to pay his mortgage. The Labour leader ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497?ico=more_from_this_author",
        "title": "Labour urges restraint in Middle East following deadly attack on US base",
        "description": "Labour leader Sir <b>Keir Starmer</b> said those responsible for the attack should be “held to account” but expressed fears about the conflict spreading across the region. “I am concerned about the possibility of escalation of an already dangerous situation ..."
    }
]