[
    {
        "url": "https://news.sky.com/story/bt-and-lloyds-chiefs-among-new-business-advisers-to-sunak-13060352",
        "title": "BT and Lloyds chiefs among new business advisers to Sunak",
        "description": "Allison Kirkby, who will become BT Group’s first female chief this week, will be named on Wednesday as one of 15 members of the prime minister’s 2024 business council, Sky News learns."
    },
    {
        "url": "https://www.ibtimes.co.uk/50-business-leaders-want-keir-starmer-next-prime-minister-1723098",
        "title": "50% Of Business Leaders Want <b>Keir Starmer</b> As Next Prime Minister",
        "description": "Corporate leaders have said that they would have more business confidence if the Labour Party win the next general election."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/tories-labour-age-vote-election_uk_65b96e59e4b01c5c3a3883a8",
        "title": "Only The Over-70s Would Vote Tory, Poll Finds",
        "description": "“The Tories are now the most popular party only among the over-70s, 43% of whom back the party. This is down from 67% in 2019, however, with Labour being the main beneficiaries, having increased their vote share among the oldest Britons from 14% to 23%."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-tories-butt-heads-over-shocking-london-knife-crime-figures-1723037",
        "title": "Labour And Tories Butt Heads Over Shocking London Knife Crime Figures",
        "description": "Prime Minister Rishi Sunak and Labour Leader <b>Keir Starmer</b> have since come head-to-head in a debate that discussed the current knife crime rate in London. A recent investigation, that studied the capital city specifically, found that the number of knife ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/30/keir-starmer-outlaw-conversion-therapy-labour-election/",
        "title": "<b>Starmer</b> to outlaw all forms of conversion therapy if Labour wins election",
        "description": "Sir <b>Keir Starmer</b> has vowed to outlaw all forms of conversion therapy if Labour wins the election. The Labour leader said his ban would be “trans inclusive”, meaning it would ban attempts to change someone’s gender identity as well as their sexuality ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24085962.rishi-sunak-simply-refused-answer-question-israeli-war-crime/",
        "title": "Rishi Sunak simply refused to answer question about Israeli war crime",
        "description": "PRIME Minister Rishi Sunak was unable to give an answer to the SNP’s Westminster leader Stephen Flynn in relation to the killing of a"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/keir-starmer-prime-minister-gaza-ursula-von-der-leyen-conservative-b1135901.html",
        "title": "Irish Labour Party criticises <b>Keir Starmer</b> over ‘disappointing’ stance on Gaza",
        "description": "If you’re going to be Prime Minister of the UK, either you’re against this stuff, or you just let it happen,’ an Irish parliamentarian said."
    },
    {
        "url": "https://www.thesun.co.uk/sport/25605446/piers-morgan-marcus-rashford/",
        "title": "Marcus Rashford needs a Sir Alex to put an arm around him and say a few home truths… but it’s down to him to get a grip",
        "description": "In fact, an Ipsos/MORI poll at the time revealed that the British public thought you (56%) and me (32%) were doing a better job of holding the Government to account during the pandemic than the actual leader of the opposition, Sir <b>Keir Starmer</b> (29% ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/cb82d029-f663-468f-bd45-af9c7ee28e0e?shareToken=d42e3e8e8e331be8c0d3d63b350896bb",
        "title": "Iran dissidents in UK at risk of assassination and kidnap",
        "description": "However, that could change if Labour wins the general election later this year, as Sir <b>Keir Starmer</b> has pledged to proscribe the IRGC. Yvette Cooper, the shadow home secretary, set out plans last year for an overhaul of Britain’s anti-terrorism ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-tories-election-tax-cuts-immigration-b2487561.html",
        "title": "Rishi Sunak’s fading election hopes hit by triple whammy",
        "description": "IMF rules out tax cuts, minister Kemi Badenoch caught in ‘Evil Plotters’ row, while Tory right claims six million rise in population makes mockery of Brexit"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/pcs-union-leader-mark-serwotka-32005107",
        "title": "PCS union leader Mark Serwotka given heart transplant after catching virus while washing dog",
        "description": "Union leader Mark Serwotka tells Kevin Maguire how his career and life were jeopardised when his heart was damaged in 2000 after catching a virus his dog got from a dead fox"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861399/Keir-Starmer-conversion-therapy-ban",
        "title": "<b>Keir Starmer</b> vows to ban &#39;psychologically damaging&#39; conversion therapy",
        "description": "Sir Keir branded it &quot;psychologically damaging abuse&quot; but promised his law tackling it would be &quot;trans-inclusive&quot;."
    },
    {
        "url": "https://www.heraldscotland.com/news/24085685.labour-ditch-green-fund-will-offer-scotland/",
        "title": "If Labour ditch green fund, what will it offer Scotland?",
        "description": "Earlier this month, Sir <b>Keir Starmer</b> said it was just “a confident ambition”. He’s obviously lost confidence. That may be because the Tories have been using it to beat Labour with for some time. Proof, they say, that <b>Starmer</b> in No 10 and Reeves ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-grandee-mandelson-warns-labour-171527971.html",
        "title": "Labour grandee Mandelson warns Labour lead is ‘artificial’ and will shrink before election",
        "description": "Peter Mandelson said people ‘are not pricing in sufficiently’ the possibility of Sir Keir failing to win a majority"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68145945",
        "title": "Covid texts to Sturgeon &#39;not available&#39; - Swinney",
        "description": "The first minister has invited Sir <b>Keir Starmer</b> to discuss working together if Labour wins power. The SNP&#39;s Westminster leader warns that US-UK air strikes in Yemen must not lead to a wider regional crisis. The health secretary was asked if anyone else had ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/30/trust-is-lost-muslim-voters-unhappy-with-labour-stance-on-gaza-war",
        "title": "‘Trust is lost’: Muslim voters unhappy with Labour’s stance on Gaza war",
        "description": "Party’s position has shifted with Keir Starmer now calling for a ‘sustainable ceasefire’ but for some voters it is too little too late"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/30/labour-acts-on-fears-muslims-will-not-vote-for-party-over-gaza-stance",
        "title": "Labour acts on fears Muslims will not vote for party over Gaza stance",
        "description": "Exclusive: Party launches outreach effort amid concerns it is losing support of normally loyal voters"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13023103/If-rail-firms-wont-stand-greedy-unions-cut-subsidies.html",
        "title": "ROSS CLARK: Fat cat train company bosses are betraying passengers just as badly as the greedy unions they&#39;re too lily-livered to stand up to",
        "description": "Unions shrieked that the Government&#39;s strike legislation was draconian. But the rail bosses it was designed to help are too lily-livered to implement it despite this week&#39;s walkout chaos"
    },
    {
        "url": "https://www.walesonline.co.uk/news/politics/what-latest-polling-tells-politics-28538526",
        "title": "What the latest polling tells us about politics in Wales right now",
        "description": "The latest Welsh Westminster voting intention poll continues to show Labour leading the Conservatives in Wales by 28%, which is three points up from the difference seen in the previous poll a month ago."
    },
    {
        "url": "https://www.retail-week.com/people/the-tories-have-a-major-problem-with-business-and-walkers-defection-proves-it/7045482.article",
        "title": "‘The Tories have a major problem with business and Richard Walker’s defection proves it’",
        "description": "The Iceland boss&#39;s damning indictment of the Conservatives and endorsement of Labour may be polarising in and of themselves, but it highlights the depth of the government&#39;s business troubles as it limps into an election year."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "Politics latest news: Reform UK backing among 2019 Tory voters reaches record high",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://www.miltonkeynes.co.uk/news/crime/fatal-stabbing-happens-just-hours-after-keir-starmer-visits-milton-keynes-to-discuss-knife-crime-4498525",
        "title": "Fatal stabbing happens just hours after <b>Keir Starmer</b> visits Milton Keynes to discuss knife crime",
        "description": "The murder, the latest in a grim list for the city over the past few years, took place just a few hours after Labour leader <b>Keir Starmer</b> and Shadow Home Secretary Yvette Cooper visited Central Milton Keynes police station on Thursday. And during the same ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/sir-keir-more-popular-than-sunak",
        "title": "Sir <b>Keir</b> more popular than Sunak",
        "description": "SIR KEIR STARMER finally cleared the lowest bar in political life today: he is more popular than Rishi Sunak. Pollster Ipsos found that the Labour leader now has a 13 per cent lead over the incumbent as to who might make the best prime minister."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24084828.independent-review-sentence-barnaby-webbers-killer/",
        "title": "Independent review into sentence of Barnaby Webber&#39;s killer",
        "description": "The families of the three victims who died yesterday (Monday, January 29) met with Prime Minister Rishi Sunak in 10 Downing Street and earlier in the day with Opposition leader <b>Keir Starmer</b>."
    },
    {
        "url": "https://www.tutor2u.net/politics/blog/party-leaders-and-voting-behaviour",
        "title": "Party leaders and voting behaviour",
        "description": "This chimes with polling from Ipsos, that has the Prime Minister on a net satisfaction rating of -44 and the leader of the opposition on -18. The importance of the party leader is debated by psephologists but there is no doubt that it has some effect on how voters cast their ballots."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13023635/Keir-Starmer-vows-ban-trans-conversion-therapy-PM-despite-fears-parents-teachers-criminalised-having-honest-discussions.html",
        "title": "<b>Keir Starmer</b> vows to ban trans &#39;conversion therapy&#39; if he becomes PM despite fears parents and teachers could be criminalised for having &#39;honest discussions&#39;",
        "description": "The Labour leader reiterated his party&#39;s commitment to a ban on &#39;all forms of conversion therapy&#39; at an LGBT+ event in Parliament last night."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24084670.letter-day-bring-labour---quickly-possible/",
        "title": "Letter of the Day: Bring on Labour – as quickly as possible",
        "description": "However, what kind of government would it be, and would it be good for Scotland? Yesterday, a correspondent feared that under Sir <b>Keir Starmer</b> a Labour administration would be “right-wing, anti-European and anti-immigration”. Read that letter here 👈 ..."
    },
    {
        "url": "https://www.thenational.scot/news/24084459.keir-starmer-faces-criticism-wearing-pride-badge/",
        "title": "<b>Keir Starmer</b> faces criticism for wearing Pride badge",
        "description": "KEIR Starmer has been criticised for wearing a progress Pride badge despite backtracking on self-identification for transgender people."
    },
    {
        "url": "https://uk.news.yahoo.com/betrayal-scotland-keir-starmer-panned-173059369.html",
        "title": "&#39;Betrayal of Scotland&#39;: <b>Keir Starmer</b> panned as Labour &#39;to ditch £28bn green pledge&#39;",
        "description": "<b>KEIR Starmer</b> has been accused of a “betrayal” of Scottish voters after reports that he was set to ditch a key green investment pledge. Labour have already watered down their promise to invest £28 billion in green projects every year while in power ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/jeremy-hunt-tax-cuts-budget-rishi-sunak-imf-b2487354.html",
        "title": "IMF warns Jeremy Hunt against further tax cuts in March Budget",
        "description": "The IMF said any tax cuts would be ‘very challenging to achieve’ considering Britain’s ageing population and mounting debt pile"
    },
    {
        "url": "https://www.leighjournal.co.uk/news/24084268.compassion-action-gets-shoutout-labour-leader-speech/",
        "title": "Compassion in Action gets a shoutout in Labour leader speech",
        "description": "A LEIGH based charity was given a shout out by Labour leader Kier Starmer in a speech declaring to get &quot;Britain&#39;s future back&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861206/labour-party-latest-sir-keir-starmer-school-warning",
        "title": "<b>Keir Starmer</b> warned over Labour Party&#39;s controversial plans to raid school VAT",
        "description": "Sir Keir Starmer has been warned by experts that poorer students could lose out under the Labour Party&#39;s new education plans - which have left many parents furious."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? <b>Starmer</b> opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/keir-starmer-person-rebuild-government-060000939.html",
        "title": "<b>Keir Starmer</b> is the right person to rebuild government’s vital relationship with business",
        "description": "We need clarity of direction from government and in the form of predictable policies. Labour’s missions as set out last year by <b>Keir Starmer</b> and the shadow cabinet go a long way to addressing this. An incoming government will also need consistency when ..."
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/01/30/england-in-a-room-and-england-as-britain/",
        "title": "England in a room – and England as Britain",
        "description": "This book has received much attention as Cruddas worked for Blair but was always independent minded and critical of New Labour, and for its less than entirely positive assessment of <b>Keir Starmer</b> (which has been repeatedly cited by Rishi Sunak at PMQs)."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/30/wes-streeting-single-sex-wards-labour-trans/",
        "title": "Labour’s Wes Streeting backs separate hospital wards for trans patients",
        "description": "Labour leader <b>Keir Starmer</b> has remained relatively quiet on the issue since Barclay’s announcement. In April last year, <b>Starmer</b> said he supported single-sex wards. Less than a month earlier, he stated that womanhood was “completely biological” for ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/arms-dealers-at-swanky-london-dinner-party-accused-of-dining-on-the-profits-of-genocide",
        "title": "Arms dealers at swanky London dinner party accused of ‘dining on the profits of genocide’",
        "description": "Labour leader Sir <b>Keir Starmer</b> has abandoned previous party policy to immediately recognise a Palestinian state and has suggested that this would be done eventually, only with Israeli approval. You can’t buy a revolution, but you can help the only daily ..."
    },
    {
        "url": "https://alkhaleejtoday.co/international/5823529/UK-Labour-Party-risks-losing-Muslim-voters-over-Gaza-war-stance.html",
        "title": "UK Labour Party risks losing Muslim voters over Gaza war stance",
        "description": "LONDON: The Labour Party in the UK has started surveying British Muslim voters amid growing concern among senior officials about the damage done to one of its strongest bases of support by the party’s stance on Gaza."
    },
    {
        "url": "https://www.breakingnews.ie/ireland/irish-labour-party-criticises-keir-starmer-over-disappointing-stance-on-gaza-1582100.html",
        "title": "Labour Party criticises <b>Keir Starmer</b> over ‘disappointing’ stance on Gaza",
        "description": "If you’re going to be prime minister of the UK, either you’re against this stuff, or you just let it happen,’ an Irish politician said"
    },
    {
        "url": "https://theconversation.com/labour-hasnt-won-a-uk-general-election-since-2010-will-2024-be-any-different-221611",
        "title": "Labour hasn’t won a UK general election since 2010. Will 2024 be any different?",
        "description": "This year’s election, then, looks increasingly like one Conservatives will lose – but it remains to be seen how well <b>Keir Starmer</b>’s Labour can win it. For some time, Labour has held a solid 20-point lead over the Tories in the polls, yet to take ..."
    },
    {
        "url": "https://www.wsws.org/en/articles/2024/01/30/dlhl-j30.html",
        "title": "Postal Workers Rank-and-File Committee meeting discusses a fighting strategy against the CWU-Royal Mail alliance",
        "description": "Robson told the meeting, “If Royal Mail cannot provide decent jobs or pay for its workforce or deliver a mail service that is fit for purpose, it must be placed into public ownership.”"
    },
    {
        "url": "https://news.yahoo.com/review-ordered-decision-accept-nottingham-123935759.html",
        "title": "Review ordered into decision to accept Nottingham triple killer’s manslaughter pleas",
        "description": "An independent review has been ordered into the Crown Prosecution Service’s decision to accept Nottingham triple killer Valdo Calocane’s guilty pleas to manslaughter and whether the families of the victims were sufficiently consulted."
    },
    {
        "url": "https://guardian.ng/news/uk-labour-party-suspends-british-nigerian-minister-over-gaza-genocide-remark/",
        "title": "UK Labour Party suspends British-Nigerian minister over Gaza genocide remark",
        "description": "A British-Nigerian member of the Labour Party, Kate Osamor, has been suspended from the party pending an investigation into her remarks where she made a comparison between the situation in Gaza and the Holocaust."
    },
    {
        "url": "https://www.newarab.com/news/uk-labour-mp-suspended-over-gaza-genocide-post",
        "title": "UK Labour MP suspended over Holocaust Memorial Day post that included Gaza",
        "description": "The Labour Party is set to investigate British MP Kate Osamor following a post that said Gaza should be remembered as a genocide on Holocaust Memorial Day."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-laughs-hes-grilled-32000159",
        "title": "Rishi Sunak laughs as he&#39;s grilled by ITV This Morning&#39;s Rylan on Tory election chances",
        "description": "The Prime Minister was quizzed by ITV This Morning&#39;s Rylan Clark and Rochelle Humes on when viewers will next head to the ballot box as polls show the Tories trailing Labour"
    },
    {
        "url": "https://socialistworker.co.uk/news/activists-stop-labour-event-to-call-for-ceasefire/",
        "title": "Activists stop Labour event to call for ceasefire",
        "description": "A protest was also held outside the event at the Village Hotel in Cheadle, which was attended by other Labour MPs in the area. James Harker, a pro-Palestine activist from Bolton, said afterwards, “As a former Labour member, I’m sickened by the way Angela Rayner and the majority of Labour MPs abstained on a ceasefire vote."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/01/labour-spending-rules-keir-starmer-government",
        "title": "Sunak’s smoking ban looks like legacy politics",
        "description": "Without economic growth, tensions between the leader and Rachel Reeves could emerge."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-absolutely-confident-he-will-win-the-general-election_uk_65b8d15be4b05c8779f60885",
        "title": "Rishi Sunak &#39;Absolutely&#39; Confident He Will Win The General Election",
        "description": "Rishi Sunak has said he is “absolutely” confident he will win the next general election, despite a new poll showing the Tories have fallen even further behind Labour. In an interview with ITV’s This Morning, the prime minister refused to be drawn on the exact date he planned to go to the country."
    },
    {
        "url": "https://www.newarkadvertiser.co.uk/news/disposable-vapes-ban-welcome-news-but-more-action-needed-9350707/",
        "title": "Government’s disposable vape ban welcomed by Nottinghamshire councillor amid fears for health of young people",
        "description": "The ban would be in place by early 2025. Labour leader <b>Keir Starmer</b> said his party had been calling for the ban for two years. Disposable vapes are set to be banned as part of plans to tackle the rising number of young people taking up vaping, the ..."
    },
    {
        "url": "https://www.cityam.com/sadiq-khan-starmer-attacking-sunak-for-betting-on-misery-wont-put-business-off-labour/",
        "title": "Sadiq Khan: <b>Starmer</b> attacking Sunak for ‘betting on misery’ won’t put business off Labour",
        "description": "Sadiq Khan has insisted Sir Keir Starmer’s attack on Rishi Sunak for “making millions from misery” won’t put businesses off the Labour Party."
    },
    {
        "url": "https://www.dailypost.co.uk/news/north-wales-news/labour-right-choice-communities-iceland-28536344",
        "title": "Labour &#39;right choice for communities where Iceland operates&#39; says supermarket boss and former Tory donor",
        "description": "Now Mr Walker has switched his support to Sir Keir Starmer’s party. Writing in The Guardian, he said: “Labour is the right choice for the communities across the country where Iceland operates - and the right choice for everyone in business who wants to see this country grow and prosper.”"
    },
    {
        "url": "https://uk.yahoo.com/news/support-labour-soars-voters-turn-101848112.html",
        "title": "Support For Labour Soars As Voters Turn Their Backs On Rishi Sunak",
        "description": "Sir Keir Starmer criticised the delay in abolishing disposable vapes and any move by Rishi Sunak to give Tory MPs a free vote on the matter. During a visit to Warrington in the north west, the Labour leader said: “Yes, I support the banning of disposable vapes, not least because of the impact they have on children.&quot;"
    },
    {
        "url": "https://news.yahoo.com/britains-most-capable-pm-starmer-070019569.html",
        "title": "<b>Keir Starmer</b> in record 13-point poll lead over Rishi Sunak as UK&#39;s &#39;most capable Prime Minister&#39;",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak Get info without leaving the page. in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://www.politico.eu/article/britains-potty-mouthed-parliament/",
        "title": "‘Shitshow!’ Britain’s potty-mouthed parliament",
        "description": "Britain’s straight-laced opposition leader Keir Starmer — the favorite to become prime minister later this year — added his own expletive to the record last week when he used his appearance at prime minister’s questions to repeat an anonymous briefing to a newspaper which had described the government’s childcare policy as a “shitshow.”"
    },
    {
        "url": "https://news.stv.tv/world/white-house-is-not-looking-for-a-war-with-iran-as-us-soldiers-named",
        "title": "White House is &#39;not looking for a war with Iran&#39; as US soldiers named",
        "description": "The US response to the drone strike in Jordan could be multi-levelled and sustained, US Secretary of State Anthony Blinken said Monday."
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, Labour’s silence over the cost of living crisis is deafening’",
        "description": "It comes following Labour leader, Sir <b>Keir Starmer</b>, confirming his party would not redistribute wealth from the richest to the poorest if they win the next general election, nor properly invest in renewable energy. BASC given permission to bring judicial ..."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/01/30/harriet-harman-says-its-ridiculous-and-embarrassing-labour-has-not-had-a-woman-leader/",
        "title": "Harriet Harman says it’s ‘ridiculous’ the Labour Party has not elected a woman leader",
        "description": "Veteran Labour MP Harriet Harman has said it is “ridiculous” and “embarrassing” that the Labour Party has yet to elect a woman leader.  Harman, a former deputy leader of the party who has also twice served as acting leader following election defeats,"
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24082724.fighting-talk-reading-tories-labour-leader-visit/",
        "title": "Fighting talk from Reading Tories after Labour leader visit",
        "description": "The local Conservative leader has accused Labour party leader Sir Keir Starmer of painting Reading ‘in the worst possible light’ in a"
    },
    {
        "url": "https://primeresi.com/academy-gardens-penthouse-finds-a-buyer/",
        "title": "Academy Gardens penthouse finds a buyer",
        "description": "An impressive deal has been sealed at one of Kensington&#39;s most prestigious apartment blocks, PrimeResi hears. A penthouse apartment at Academy Gardens has been tucked away by a boutique agency on"
    },
    {
        "url": "https://www.thelondoneconomic.com/news/environment/labours-28bn-green-pledge-set-to-be-consigned-to-the-dustbin-of-history-367783/",
        "title": "Labour’s £28bn green pledge set to be consigned to the dustbin of history",
        "description": "Labour’s famous or notorious £28bn – its promise to spend £28bn a year on climate-friendly investment – is set to be consigned to the dustbin of history, probably within days. The policies underlying that original £28bn pledge – to convert all power generation in the UK to…"
    },
    {
        "url": "https://primeresi.com/londons-super-prime-rental-market-picks-up-pace-as-hnw-buyers-elect-for-non-permanence/",
        "title": "London’s super-prime rental market picks up pace as HNW buyers elect for ‘non-permanence’",
        "description": "Knight Frank has recorded a sustained and substantial increase in the number super-prime tenancies being agreed in London. In 2023, the firm secured 108 big-ticket rentals in the capital – which is 10"
    },
    {
        "url": "https://www.lbc.co.uk/news/father-of-man-killed-tik-tok-influencer-mother-groomed/",
        "title": "Father of man killed by TikTok influencer and mother says he &#39;was groomed&#39; by the married older woman",
        "description": "She told Mr Hussain: &quot;I am sorry that this year you&#39;ll be gone, Saqib.&quot; Read more: <b>Keir Starmer</b> slams Diane Abbott as he condemns &#39;anti-Semitic&#39; letter amid calls to expel MP from Labour party Mr Thompson told the court that the others &quot;then became ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-wealth-tax-neil-kinnock-2879565?ico=most_popular",
        "title": "Labour rules out wealth tax despite call by Neil Kinnock",
        "description": "Labour has dismissed the suggestion of imposing a wealth tax on the richest minority to pay for public services. Former Labour Party leader Neil Kinnock told i in an interview last week that Labour could impose a wealth tax to raise funds for public services."
    },
    {
        "url": "https://www.nottinghampost.com/news/valdo-calocane-the-people-nottingham-9065221",
        "title": "Valdo Calocane: &#39;The people of Nottingham have a right to understand what happened&#39;",
        "description": "The solicitor of Nottingham attacks survivor Wayne Birkett says a public inquiry into the events leading up to June 13 last year is &#39;needed&#39;"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/shadow-chancellor-rachel-reeves-refuses-28536099",
        "title": "Shadow Chancellor Rachel Reeves refuses to repeat green spending pledge ahead of 2024 General Election",
        "description": "On Sunday, shadow business secretary Jonathan Reynolds described it as an &quot;ambition&quot;. Labour leader Sir <b>Keir Starmer</b> has previously hinted he could scale down the investment given the financial picture he would inherit if he became prime minister."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/mp-jonathan-gullis-takes-petition-9061435",
        "title": "&#39;Victory for our great city&#39; as clean air zones to be binned",
        "description": "&quot;I respect Councillor (Amjid) Wazir and Councillor Ashworth&#39;s bravery in sending a very clear message to Sir <b>Keir Starmer</b> and Angela Rayner that we in Stoke-on-Trent will not be part of the eco-mob who want to drag us back into the dark ages. Since 2019 I ..."
    },
    {
        "url": "https://www.gedlingeye.co.uk/health/gedling-councillor-welcomes-disposable-vapes-ban-but-says-more-action-needed/",
        "title": "Gedling councillor welcomes disposable vapes ban – but says ‘more action needed’",
        "description": "The ban would be in place by early 2025. Labour leader <b>Keir Starmer</b> said his party had been calling for the ban for two years. Disposable vapes are set to be banned as part of plans to tackle the rising number of young people taking up vaping, the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497",
        "title": "Labour urges restraint in Middle East following deadly attack on US base",
        "description": "Labour leader Sir <b>Keir Starmer</b> said those responsible for the attack should be “held to account” but expressed fears about the conflict spreading across the region. “I am concerned about the possibility of escalation of an already dangerous situation ..."
    }
]