[
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/02/15/what-the-papers-say--february-15/",
        "title": "What the papers say – February 15",
        "description": "The Sun hears from friends of radio star Steve Wright who say the BBC broke his heart when his Radio 2 programme was axed after 24 years. The Metro reports that the Government is planning a social media initiative, using TikTok influencers to discourage migrants from making illegal Channel crossings."
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/15/labour-urged-to-double-funding-in-publicly-owned-renewables?ref=biztoc.com",
        "title": "Labour urged to double funding in publicly owned renewables",
        "description": "Cash injection in Great British Energy should be increased to £30bn, thinktank says after <b>Keir Starmer</b> U-turn <b>Keir Starmer</b> is being urged to more than double Labour’s investment in publicly owned renewable energy to save consumers billions of pounds on ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68301697",
        "title": "Newspaper headlines: &#39;Worst antisemitism for 40 years&#39; and &#39;NHS nurses crisis&#39;",
        "description": "The Daily Mail also reports that British Jews suffered an &quot;explosion in hatred&quot; in the wake of the Hamas attack. The paper says that for the first time, the CST recorded at least one antisemitic incident for every police force in the UK, with the majority - more than 2,400 - in London."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13084271/STEPHEN-GLOVER-Labour-MPs-loyalty-Palestinian-Keir-Starmer-Azhar-Ali-Rochdale.html",
        "title": "STEPHEN GLOVER: How many Labour MPs feel a greater loyalty to the Palestinian cause than to <b>Keir Starmer</b>?",
        "description": "Is there a faction within the Labour Party, whose primary allegiance is neither to Labour nor to Britain - a group united by hatred of Israel, dislike of Jews and support for a &#39;Free Palestine&#39;?"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13085279/Starmer-Sutra-Tory-attack-ad-puts-Labour-leader-awkward-position.html",
        "title": "<b>Starmer</b> Sutra! Tory attack ad puts the Labour leader in an awkward position over his changing views",
        "description": "Posted on social media, it featured a mocked-up book cover showing Sir Keir Starmer struggling to pull off a handstand beneath a love heart."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sturgeon-resignation-accelerated-snp-s-poll-decline-say-experts-110553/",
        "title": "Sturgeon resignation accelerated SNP’s poll decline, say experts",
        "description": "The year since Nicola Sturgeon’s resignation announcement has accelerated a decline in the SNP’s opinion poll leads, experts have said. However, support for Scottish independence has hardly changed at all in the 12 months since Ms Sturgeon’s Bute House announcement, and has instead proved “stubbornly unwilling to fall”."
    },
    {
        "url": "https://www.businessgreen.com/news/4174279/study-labours-clean-energy-plans-save-gbp1bn-interest-payments",
        "title": "Study: Labour&#39;s clean energy plans could save up to £1bn on interest payments alone",
        "description": "Energy transition will be slower, costlier, and less secure without major public investment in renewables, think tank Common Wealth argues"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/sunak-braced-for-double-by-election-test-in-wellingborough-and-kingswood/",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://morningstaronline.co.uk/article/what-next-labour-left-cymru",
        "title": "What next for the Labour left in Cymru?",
        "description": "Politicians usually speak in vague terms and even when they do commit, as in the notorious 10 pledges of Sir <b>Keir Starmer</b>, whether we trust them or not to follow through is another matter. With the resignation of Mark Drakeford as leader of Welsh Labour ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1866855/keir-starmer-labour-snp-gaza-ceasefire",
        "title": "<b>Keir Starmer</b> faces prospect of new Labour rebellion as SNP pushes for fresh Gaza vote",
        "description": "Sir Keir Starmer faces the prospect of another Labour rebellion after the SNP confirmed it will try and force a fresh Commons vote on a Gaza ceasefire. The nationalist party said it would use an opposition day debate to call on the Government to back an immediate end to the fighting between Israel and Hamas."
    },
    {
        "url": "https://www.thesun.co.uk/news/25945469/keir-starmer-tackle-anti-semitism-rochdale-labour/",
        "title": "<b>Keir Starmer</b> is not a man of principle – he said he’d tackle anti-Semitism but was happy for one to stand in Rochdale",
        "description": "THE Labour Party is back in heaps of trouble – and this time its leader is making matters much, much worse. The party’s candidate for the Rochdale by-election, Azhar Ali, was recorded saying stuff"
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-sunak-labour-will-bounce-back-2905258?ico=in-line_link",
        "title": "<b>Keir Starmer</b> has made the worst mistake of his leadership so far",
        "description": "Starmer’s big mistake – probably the worst of his leadership so far – is to have delayed taking action from Saturday, when the news about Ali emerged, and waiting until Monday night, when reports emerged of a second recording."
    },
    {
        "url": "https://inews.co.uk/news/politics/keir-starmer-has-to-show-more-leadership-to-end-labours-new-antisemitism-crisis-2904745",
        "title": "<b>Keir Starmer</b> has to show more leadership to end Labour’s new antisemitism crisis",
        "description": "The first challenge Sir Keir Starmer set himself as Labour leader was to rid the party of antisemitism after a widespread perception that anti-Jewish hatred too often went unchecked under Jeremy Corbyn."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-speed-keir-starmer-transformed-162056538.html",
        "title": "OPINION - The speed with which <b>Keir Starmer</b> has transformed Labour is both his greatest success and clearest weakness",
        "description": "The three original members, Mutya Buena, Keisha Buchanan and Siobhan Donaghy each eventually left the group to be replaced in turn by a new singer, until none of the founder members remained. Much like the theoretical ship debated by ancient philosophers,"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68295796",
        "title": "Analysis: Tough week tests <b>Keir Starmer</b>&#39;s leadership",
        "description": "Labour will be hoping voters think Sir Keir has shown decisiveness but the crisis in Rochdale has raised questions."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-keir-starmer-urged-suspend-180400843.html",
        "title": "Sir <b>Keir Starmer</b> urged to suspend Labour members who attended meeting at centre of antisemitism row",
        "description": "Sir Keir Starmer has been urged to suspend any Labour member who was present at a meeting of activists where antisemitic comments were allegedly made. Mike Katz, the national chair of the Jewish Labour Movement (JLM),"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/anti-semitism-all-time-high-uk-jews-hamas-attack-october-7/",
        "title": "Anti-Semitism hits all-time high in ‘explosion of hatred’ against British Jews",
        "description": "Community Security Trust says two-thirds of incidents reported were on or after Oct 7 in what it calls a ‘celebration of Hamas’s massacre’"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7226410",
        "title": "Politics latest: <b>Starmer</b> targeted with Valentine&#39;s attack ad - as Cameron pleads with US not to give up on Ukraine",
        "description": "Sir <b>Keir Starmer</b> is grappling with a deepening antisemitism row within Labour, with another party figure having been &quot;spoken to&quot; over a meeting that saw two parliamentary candidates talk their way into suspensions. Elsewhere, Lord Cameron has pleaded with ..."
    }
]