[
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-starmers-praise-for-thatcher-iron-chatter-5zmdgkbms",
        "title": "The Times view on <b>Starmer</b>’s praise for Thatcher: Iron Chatter",
        "description": "It is not 1997, and Sir <b>Keir Starmer</b> is not Tony Blair. The national mood is not one of excitement for a new millennium, but of trepidation for what the next day or week may bring. Europe is not emerging from decades of cold war, but enmeshed in a new war ..."
    },
    {
        "url": "https://ca.news.yahoo.com/letters-labour-plans-nhs-anything-001500526.html",
        "title": "Letters: Are Labour’s plans for the NHS anything more than wishful thinking?",
        "description": "The issue is too big to carry on being used as a political weapon. SIR – You report (December 3) on Sir <b>Keir Starmer</b>’s praise of Margaret Thatcher. Not so many years ago, Sir <b>Keir</b> happily sat in the shadow cabinet, under a hard-Left Labour leader ..."
    },
    {
        "url": "https://www.itv.com/news/2023-12-03/starmer-labour-must-be-obsessed-with-growth-to-turn-economy-around",
        "title": "<b>Starmer</b>: Labour must be obsessed with growth to turn economy around",
        "description": "Sir <b>Keir Starmer</b> will argue that “growth must become Labour’s obsession” in government to drive Britain out of an economic situation that he will say is worse than after the financial crash. The Labour leader is set to pledge that, should his party ..."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/04/british-workers-missing-out-on-10700-a-year-as-living-standards-fall",
        "title": "British workers missing out on £10,700 a year as living standards fall",
        "description": "Report by Resolution Foundation and LSE calls for economic strategy rethink after 15 years of relative decline"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/03/labour-more-trusted-than-tories-to-grow-the-economy/?n=@",
        "title": "Labour more trusted than Tories to grow the economy",
        "description": "Poll findings will come as a major boost to Sir Keir Starmer as he prepares to set out plan to increase national wealth"
    },
    {
        "url": "https://www.counterfire.org/article/war-crime-is-the-rule-not-the-exception-weekly-briefing/",
        "title": "War crime is the rule, not the exception – weekly briefing",
        "description": "Lindsey German on imperial blowback at home and abroad I remember reading a review of Francis Ford Coppola’s film about the horror of the Vietnam war, Apocalypse Now, which asked how could this have happened in our lifetimes?"
    },
    {
        "url": "https://www.bbc.co.uk/news/business-67608097",
        "title": "&#39;Labour won&#39;t turn on spending taps&#39; says <b>Starmer</b>",
        "description": "Sir Keir Starmer is to warn that the UK will face &quot;huge constraints&quot; on public spending if his party win the next General Election. On Monday, he will say anyone expecting an incoming Labour government &quot;to quickly turn on the spending taps is going to be disappointed&quot;."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/03/keir-starmer-labour-wont-turn-on-spending-taps-wins-election",
        "title": "<b>Keir Starmer</b>: Labour ‘won’t turn on spending taps’ if it wins election",
        "description": "Labour leader to warn that Britain is in worst economic state for over 50 years and spending will need to be constrained Labour will not “turn on the spending taps” if it wins the next election, <b>Keir Starmer</b> will say on Monday, bolstering the view of ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/23965147.sunak-starmer-refuse-commit-pensions-triple-lock-beyond-election/",
        "title": "Sunak and <b>Starmer</b> refuse to commit to pensions triple lock beyond election",
        "description": "Rishi Sunak and Sir <b>Keir Starmer</b> have both refused to commit to maintaining the pensions triple lock beyond the next election, amid growing scepticism over the long-term sustainability of the policy. The Prime Minister stressed that his Government has ..."
    },
    {
        "url": "https://inews.co.uk/culture/television/starmer-can-kick-bbc-licence-fee-political-football-into-touch-2789439?ico=related_article_inline",
        "title": "<b>Starmer</b> can kick BBC licence fee political football into touch",
        "description": "removing the big stick Downing Street wields over the corporation. Whether Sir <b>Keir Starmer</b> is willing to give up that influence over the national broadcaster is another matter."
    },
    {
        "url": "https://inews.co.uk/news/politics/state-pension-triple-lock-in-doubt-sunak-starmer-wont-commit-2789614?ico=related_article_inline",
        "title": "State pension triple lock in doubt as Sunak and <b>Starmer</b> won’t commit to it",
        "description": "Sir <b>Keir Starmer</b>, who has also been attending the summit in Dubai, said: “This Government made the commitment on the triple lock and it’s for this Government to keep to its commitment. “We will set out our position as we get to the election."
    },
    {
        "url": "https://metro.co.uk/2023/12/03/rwanda-given-15-000-000-take-migrants-arrive-uk-19918830/?ico=trending-post-strip_item_1",
        "title": "Rwanda could be given £15,000,000 to take migrants who arrive in UK on small boats",
        "description": "Labour leader Sir <b>Keir Starmer</b> has dismissed the Rwanda policy as a ‘gimmick’ and accused the Tories of a ‘betrayal’ of their 2019 manifesto commitment to lower migration. Sir <b>Keir</b>, who is on course to become the next prime minister according to ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-faces-left-wing-091144176.html",
        "title": "<b>Keir Starmer</b> Faces Left-Wing Backlash After Praising Margaret Thatcher",
        "description": "The Labour leader said the former prime minister had &quot;sought to drag Britain out of its stupor&quot; as he made a pitch for Tory voters."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/sir-keir-starmer-criticised-for-crediting-margaret-thatcher-s-sense-of-purpose-94569/",
        "title": "Sir <b>Keir Starmer</b> criticised for crediting Margaret Thatcher’s ‘sense of purpose’",
        "description": "Sir Keir Starmer was accused of trying to “ride on the coattails” of Margaret Thatcher’s success by praising the former prime minister while appealing to Tory voters."
    },
    {
        "url": "https://uk.movies.yahoo.com/keir-starmer-caught-labour-backlash-132849660.html",
        "title": "<b>Keir Starmer</b> caught in Labour backlash after praising Margaret Thatcher",
        "description": "Left-wing MPs have attacked Sir <b>Keir Starmer</b> over his “Mandelsonian” ploy to woo Tory voters by praising Margaret Thatcher in his boldest bid yet to woo Tory voters. Angry backbenchers warned he risked alienating traditional supporters and branded his ..."
    },
    {
        "url": "https://www.bbc.com/news/business-67608097",
        "title": "&#39;Labour won&#39;t turn on spending taps&#39; says <b>Starmer</b>",
        "description": "Sir Keir Starmer is to warn that the UK will face &quot;huge constraints&quot; on public spending if his party win the next General Election. On Monday, he will say anyone expecting an incoming Labour government &quot;to quickly turn on the spending taps is going to be disappointed&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-wont-turn-spending-taps-223336465.html",
        "title": "Labour won&#39;t turn on spending taps if it wins UK election, <b>Starmer</b> says",
        "description": "A Labour government would not &quot;turn on the spending taps&quot; but will focus obsessively on growth because British Prime Minister Rishi Sunak&#39;s Conservatives have wrecked public finances, the party&#39;s leader Keir Starmer will say on Monday."
    },
    {
        "url": "https://www.clactonandfrintongazette.co.uk/news/national/23965147.sunak-starmer-refuse-commit-pensions-triple-lock-beyond-election/",
        "title": "Sunak and <b>Starmer</b> refuse to commit to pensions triple lock beyond election",
        "description": "The PM was evasive about the future of the policy, which has been criticised for becoming increasingly unaffordable."
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/national/23964773.former-labour-minister-mep-baroness-kinnock-dies/",
        "title": "Former Labour minister and MEP Baroness Kinnock dies",
        "description": "Labour leader Sir <b>Keir Starmer</b> called her a “true fighter” for the party as he paid tribute to her life and career. The 79-year-old had been diagnosed with Alzheimer’s six years ago. In a statement to PA news agency, her family said: “It is with ..."
    }
]