[
    {
        "url": "https://www.telegraph.co.uk/films/2024/02/26/keir-starmer-hampstead-teacher-bridget-jones-mad-about-boy/",
        "title": "From a Hampstead teacher to... <b>Keir Starmer</b>? Who’s who in the real-life Bridget Jones",
        "description": "Sir <b>Keir Starmer</b> has long been rumoured to be the inspiration for Mark Darcy, played by Colin Firth (right) Credit: Everett Collection / Rex Features In fact (spoiler alert!) Mad About the Boy begins four years after Mark Darcy’s tragic death ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/holyrood/24144297.lindsay-hoyle-right-fear---islamists-not-cause/",
        "title": "Lindsay Hoyle is right about fear - but Islamists are not the cause",
        "description": "Mr Sweeney has backed his staff, insisting they were genuinely afraid and the sense of threat was real. Protest is beautiful and the right to it must be sacrosanct but it speaks volumes - not least due to the frenzy created by Lindsay Hoyle&#39;s decision in parliament last week - that political staffers feel such disquiet in their workplace."
    },
    {
        "url": "https://www.heraldscotland.com/news/24145817.labour-accuse-yousaf-dangerous-rhetoric-traitors-row/?ref=rss",
        "title": "Labour accuse Yousaf of &#39;dangerous rhetoric&#39; in traitors row",
        "description": "Scottish Labour&#39;s deputy leader has criticised the First Minister after he defended sharing the front page of a newspaper describing Sir"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13127643/Voters-think-Labour-anti-Semitism-problem-wake-Rochdale-election.html",
        "title": "Voters still think Labour has an anti-Semitism problem in the wake of Rochdale election row with four-in-10 saying <b>Keir Starmer</b> has not yet rid the party of taint of Corbyn years",
        "description": "More than four-in-10 (41 per cent of voters) still believe the party has &#39;a problem&#39; with anti-Jewish hate, according to a new poll by Savanta."
    },
    {
        "url": "https://www.newburytoday.co.uk/news/former-aide-to-sir-keir-starmer-to-run-for-mp-in-west-berks-9354554/",
        "title": "Labour announces candidate to fight next election in Reading West and Mid Berks",
        "description": "A former aide to Sir <b>Keir Starmer</b>, the Labour leader, is to run for MP in West Berkshire. Labour is the latest party to declare a candidate for the new parliamentary seat of Reading West and Mid Berkshire. Olivia Bailey is to stand for Labour in the next ..."
    },
    {
        "url": "https://news.sky.com/story/more-than-40-of-public-think-labour-still-has-antisemitism-problem-poll-shared-with-sky-news-reveals-13081560",
        "title": "More than 40% of public think Labour still has antisemitism problem, poll shared with Sky News reveals",
        "description": "The survey by Savanta was carried out shortly after the party was forced to drop support for its candidate in the Rochdale by-election following comments he made about Israel."
    },
    {
        "url": "https://www.thenational.scot/news/24145185.labour-leader-keir-starmer-panned-patriotic-economy-pledge/",
        "title": "Labour leader <b>Keir Starmer</b> panned for &#39;patriotic economy&#39; pledge",
        "description": "I AM a Unionist. I don’t like nationalism. I don’t think it’s good … because I think for me nationalism is insular, it’s"
    },
    {
        "url": "https://www.thenational.scot/news/24145157.keir-starmer-wont-say-will-work-snp-gaza-ceasefire-moti/",
        "title": "<b>Keir Starmer</b> won&#39;t say if he will work with SNP on Gaza ceasefire motion",
        "description": "<b>KEIR Starmer</b> has declined to say whether Labour would work with the SNP on a new Gaza ceasefire motion. SNP Westminster leader Stephen Flynn has called for support among opposition parties for a fresh motion. It comes after a previous attempt to debate ..."
    },
    {
        "url": "https://news.sky.com/video/sir-keir-starmer-has-called-the-prime-minister-weak-as-the-tory-islamophobic-row-deepens-13081657",
        "title": "Sir <b>Keir Starmer</b> has called the Prime Minister &#39;weak&#39; as the Tory &#39;Islamophobic&#39; row deepens",
        "description": "Labour leader Sir Keir Starmer has called Rishi Sunak &#39;weak&#39; after the Prime Minister refused to say that Lee Anderson&#39;s comments were &#39;Islamophobic.&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/26/rishi-sunak-latest-news-yorkshire-cabinet-lee-anderson-khan/",
        "title": "Sunak ‘too weak’ to label Lee Anderson remarks Islamophobic, claims <b>Starmer</b> - live updates",
        "description": "Sadiq Khan’s “terrible record” should be the focus of Tory attacks rather than making “wrong” claims about him, Mark Harper said as he responded to the Lee Anderson row. Mr Anderson, the former deputy chairman of the Conservative Party, lost the Tory whip after failing to apologise for claiming “Islamists” had “got control” of the Mayor of London."
    },
    {
        "url": "https://www.shropshirestar.com/news/politics/2024/02/26/labour-would-run-patriotic-economy-starmer-says-on-shropshire-visit/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> says on Shropshire visit",
        "description": "Sir Keir Starmer talked up Labour&#39;s housing pledges on a visit to Shropshire, promising his party would deliver a &quot;future built in Britain, by Britain, for Britain&quot; if it wins power."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13125929/Angela-Rayner-breaks-cover-amid-questions-ownership-former-council-house.html",
        "title": "Angela Rayner breaks cover amid questions around her ownership of a former council house ... to go and push Labour&#39;s housing plans as the party braces for Rochdale by-election ...",
        "description": "Labour&#39;s top team will put on a united front in the West Midlands as the Tories demand cops probe whether Ms Rayner broke rules when she owned a house bought using &#39;Right To Buy&#39;."
    },
    {
        "url": "https://bmmagazine.co.uk/news/sir-keir-starmer-advocates-patriotic-economy-with-focus-on-homeownership-boost/",
        "title": "Sir <b>Keir Starmer</b> Advocates ‘Patriotic Economy’ with Focus on Homeownership Boost",
        "description": "Labour leader Sir Keir Starmer has unveiled plans for what he terms a &quot;patriotic economy,&quot; with a primary focus on bolstering home ownership"
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/the-tories-self-destruction-is-a-gift-to-labour",
        "title": "The Tories have become the Conspiracy Party",
        "description": "All of which is occurring while threats against MPs are increasing. The Sunday Times reported that three female MPs now need bodyguard protection. Beneath the parliamentary minutiae, the threats faced by MPs – and how this impacts their votes – was the key story last week. Parliament is not, therefore, calm."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/26/rishi-sunak-lee-anderson-islamophobia-row-conservatives-tories-keir-starmer-labour-uk-politics-live?topics=PERSON%3AKeir+Starmer",
        "title": "PM says Lee Anderson’s comments ‘not acceptable’ but denies Tory party has Islamophobic tendencies – UK politics live",
        "description": "Rishi Sunak gave interviews to local stations in Yorkshire where he is chairing his cabinet meeting this morning"
    },
    {
        "url": "https://uk.news.yahoo.com/foodbank-parcels-union-flags-keir-154250936.html",
        "title": "&#39;Foodbank parcels in Union flags&#39;: <b>Keir Starmer</b> panned for &#39;patriotic economy&#39; pledge",
        "description": "Those are the words of Jo Stevens, a senior Labour MP serving in <b>Keir Starmer</b>’s shadow Cabinet. Unluckily for Jo, her party leader seems determined to undermine any and every claim that their party is not, in fact, deeply nationalist. Even without all ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit-369323/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Labour leader Sir <b>Keir Starmer</b> will talk up Labour’s housing pledges on a visit to the West Midlands, promising it would deliver a “future built in Britain, by Britain, for Britain” if it wins power. The party leader is expected to say he would run a ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/02/inside-the-labour-lefts-split",
        "title": "The runaway Speaker",
        "description": "It was in December 1982, in the aftermath of the titanic struggle between Tony Benn and Denis Healey for Labour’s deputy leadership, that the party’s left split. Those who had supported Benn formed the “hard left” Socialist Campaign Group, while those who had backed Healey, such as Neil Kinnock, remained in the “soft left” Tribune Group."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/labour-chasing-rural-vote-starmer-051700600.html",
        "title": "Labour are chasing the rural vote, but <b>Starmer</b> is no champion of the shires",
        "description": "The Labour leader will have his work cut out convincing voters in the countryside that he has their interests at heart, says"
    },
    {
        "url": "https://www.ft.com/content/db1999d0-0f77-4a1a-9ba2-60cc038388f1",
        "title": "Labour’s worker rights shake-up leaves UK business on edge",
        "description": "Overhaul planned by main opposition party could backfire and end up harming employees and bosses, say executives"
    },
    {
        "url": "https://www.counterfire.org/article/when-you-cant-defend-your-rotten-politics-blame-the-muslims-weekly-briefing/",
        "title": "When you can’t defend your rotten politics, blame the Muslims – weekly briefing",
        "description": "Lindsey German on crisis, war and racism The failure of most politicians to do anything about the genocide in Gaza was only too obvious during the Westminster fiasco on Wednesday."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/26/snp-calls-on-opposition-parties-to-support-fresh-ceasefire-motion/",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion",
        "description": "SNP Westminster leader Stephen Flynn has called for opposition leaders Sir Keir Starmer and Sir Ed Davey to support a fresh ceasefire motion."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lee-anderson-sadiq-khan-sunak-starmer-islamist-b2502758.html",
        "title": "Rishi Sunak squirms as Lee Anderson doubles down on Islamophobic rant",
        "description": "As the fallout from Mr Anderson’s remarks grew: Sir <b>Keir Starmer</b> accused Rishi Sunak of “lacking the backbone” to call out Lee Anderson’s “Islamophobia” A Tory minister said the whip was removed from Mr Anderson “because anti-Muslim hatred is ..."
    },
    {
        "url": "https://www.thebookseller.com/books/books-in-the-media-tom-baldwins-biography-of-starmer-turns-heads",
        "title": "Books in the Media: Tom Baldwin&#39;s biography of <b>Starmer</b> turns heads",
        "description": "This week Tom Baldwin’s biography of the current Labour Party leader <b>Keir Starmer</b> was widely reviewed across the nationals while Carys Davies’ third novel was picked in the Observer."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/snp-seek-support-labour-lib-28705625",
        "title": "SNP to seek support from Labour and Lib Dems for immediate Gaza ceasefire",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/snp-gaza-speaker-labour-bryant-b2502532.html",
        "title": "SNP demands investigation into Labour ‘dirty tricks’ Gaza vote as senior MP admits delaying debate",
        "description": "The party’s Cabinet Office spokesman Kirsty Blackman said: “These damning revelations show Sir <b>Keir Starmer</b> pulled every dirty trick in the Westminster book to wreck the SNP’s vote on an immediate ceasefire in Gaza and Israel. “After months of ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-parliamentarians-ask-labour-support-32208428",
        "title": "SNP calls on Labour to back plans to ban unpaid trial shifts",
        "description": "An SNP MP and MSP have jointly written to the leadership of the Labour Party asking for support in an attempt to ban unpaid trial shifts. In a letter addressed to UK Labour leader <b>Keir Starmer</b> and Scottish Labour leader Anas Sarwar, Stewart McDonald and Kevin Stewart said they were concerned that Labour was not addressing the practice."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-snp-uk-parliament-gaza-un-security-council-b1141427.html",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion",
        "description": "SNP Westminster leader Stephen Flynn has called for opposition leaders Sir Keir Starmer and Sir Ed Davey to support a fresh ceasefire motion."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-keir-starmer-outlines-desire-153800201.html",
        "title": "Sir <b>Keir Starmer</b> outlines desire for &#39;patriotic economy&#39; through boosting home ownership",
        "description": "Sir <b>Keir Starmer</b> has outlined his desire to run a &quot;patriotic economy&quot; through boosting home ownership and creating the &quot;next generation&quot; of new towns if Labour wins the election. The Labour leader will promise to deliver a &quot;future built in Britain ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/latest-politics-mps-no-confidence-lindsay-hoyle-labour-snp-2919971?ico=most_read_by_subscribers",
        "title": "Latest politics news as Hoyle admits he made ‘wrong decision’ on Gaza vote after PM fails to back Speaker",
        "description": "The numbers are not enough to oust him, but the motion could pick up steam over the coming days. Labour leader Sir <b>Keir Starmer</b> said he “simply urged” Commons Speaker Sir Lindsay Hoyle to have “the broadest possible debate” by putting a number of ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1871024/lee-anderson-twitter-tory-suspension",
        "title": "Lee Anderson posts cheeky 11-word message from the pub teasing &#39;long week ahead&#39;",
        "description": "Opposition MPs, including Sir <b>Keir Starmer</b>, have been unequivocal in condemning his behaviour, with the Labour leader calling Mr Sunak &quot;weak&quot; because he lacked the &quot;backbone&quot; to call out Islamophobic sentiment. Mr Khan defended himself in an article for ..."
    },
    {
        "url": "https://feweek.co.uk/labours-growth-and-skills-levy-wont-devalue-apprenticeships-malhotra-claims/",
        "title": "Labour’s ‘growth and skills levy’ won’t devalue apprenticeships, Malhotra claims",
        "description": "Labour leader Sir <b>Keir Starmer</b> has announced his intention to reform the apprenticeship levy so that it can be spent on other types of training if the party comes into power. The “growth and skills levy” would allow businesses to use 50 per cent of ..."
    },
    {
        "url": "https://www.qmul.ac.uk/media/news/2024/hss/opinion-the-fading-promises-of-cop28.html",
        "title": "OPINION: The fading promises of COP28",
        "description": "but they fear may hit them too hard in the pocket – one reason why <b>Keir Starmer</b>’s opposition Labour Party seems to have joined Rishi Sunak’s Conservative government in scaling back its green commitments. Some of our Queen Mary academics who travelled ..."
    },
    {
        "url": "https://www.opendemocracy.net/en/home-office-islamophobia-antisemitism-suella-braverman-lee-anderson/",
        "title": "Home Office ‘did not discuss’ Islamophobia risk in wake of Hamas attacks",
        "description": "The independent councillor, who quit Labour in October in protest at <b>Keir Starmer</b>’s apparent suggestion that Israel’s attacks on Gaza were justified, also called out Labour’s own record on Islamophobia. She pointed to the fact no one had faced ..."
    },
    {
        "url": "https://www.itv.com/news/central/2024-02-26/families-of-victims-of-triple-killer-valdo-calocane-hit-out-at-police",
        "title": "Families of victims of triple killer condemn Nottinghamshire Police over Valdo Calocane case",
        "description": "&quot;We currently await the response of the Home Secretary and have also written to the leader of the opposition, <b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers. &quot;We understand that this is a lengthy and detailed statement ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/nottingham-attacks-valdo-calocane-victims-32217598",
        "title": "Nottingham attacks: Valdo Calocane victims&#39; families slam cops for &#39;ongoing mismanagement&#39;",
        "description": "We currently await the response of the Home Secretary and have also written to the leader of the opposition, <b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers. &quot;We understand that this is a lengthy and detailed statement ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-26/speaker-blocks-snp-calls-for-a-new-emergency-gaza-debate",
        "title": "Speaker blocks SNP calls for a new emergency Gaza debate",
        "description": "Sir <b>Keir Starmer</b> came under fire last week as he was accused of pressuring the Speaker into accepting a vote on the Labour amendment in order to avoid a revolt in his party. The Labour leader denied he &quot;threatened the Speaker in any way&quot; over the Gaza ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-says-lee-anderson-32217456",
        "title": "Rishi Sunak says Lee Anderson is not a racist as Tories admit he could be let back in party",
        "description": "But when you think you are right you should never apologise because to do so would be a sign of weakness.&quot; <b>Keir Starmer</b> said Mr Sunak was “too weak” to deal with the problems within his party. The Labour leader, who was on a visit to Shrewsbury ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68400775.amp",
        "title": "Lee Anderson refuses to apologise for Islamist claim about Sadiq Khan",
        "description": "Ex-Tory party deputy chair Lee Anderson has said his words were clumsy but has refused to apologise for suggesting Sadiq Khan is controlled by Islamists. Mr Anderson was suspended as a Tory MP following his remarks which he says were borne out of frustration at the London mayor&#39;s record."
    },
    {
        "url": "https://www.scotsman.com/news/politics/speaker-refuses-snp-emerency-debate-in-house-of-commons-on-gaza-4533851",
        "title": "Speaker refuses SNP emerency debate in House of Commons on Gaza",
        "description": "&quot;I urge Rishi Sunak and <b>Keir Starmer</b> to work with us to ensure Parliament can mandate the UK government to pull every lever to help secure an immediate ceasefire, and lasting peace through a two state solution.&quot;Finally, it&#39;s regrettable that this ..."
    },
    {
        "url": "https://bmmagazine.co.uk/columns/what-the-changing-media-landscape-means-for-smes/",
        "title": "What the changing media landscape means for SMEs",
        "description": "The media landscape has undergone enormous and complex change over the last thirty years, with social media platforms rising in prominence often at the expense of more traditional media outlets."
    },
    {
        "url": "https://inews.co.uk/opinion/mps-know-doing-islamophobic-remarks-2926081?ico=related_stories",
        "title": "MPs know exactly what they’re doing when they make Islamophobic remarks",
        "description": "The parties of both Rishi Sunak and <b>Keir Starmer</b> have contributed to the atmosphere of intimidation felt by Muslims (Photos: Andy Buchanan/AFP; Peter Byrne/PA) On 18 February, late on a Sunday evening, a brick was reportedly thrown through the front window ..."
    },
    {
        "url": "https://www.cityam.com/jeremy-hunt-warned-de-arbonisation-efforts-need-greater-urgency/",
        "title": "Jeremy Hunt warned decarbonisation efforts need ‘greater urgency’",
        "description": "But amidst wider concerns about Sir <b>Keir Starmer</b>’s party’s commitment to major energy spending in the wake of walking back his £28bn-a-year green plan, industry bodies including Renewable UK remain loud in their calls for clarity on the delivery roadmap."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/lee-anderson-doubles-down-and-refuses-to-apologise-for-sadiq-khan-remarks-369368/",
        "title": "Lee Anderson doubles down and refuses to apologise for Sadiq Khan remarks",
        "description": "The ex-deputy Tory chair launched a fresh attack on the London Mayor after unleashing an Islamophobia row with earlier comments."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24144822.putin-cohorts-feeling-emboldened-ukraine/",
        "title": "&#39;Putin and his cohorts are feeling emboldened in Ukraine&#39;",
        "description": "Rishi Sunak recently repeated a pledge that the UK would support Ukraine for ‘however long, and whatever, it takes’. Boris Johnson made a similar undertaking - and Sir Keir Starmer has also followed that line."
    },
    {
        "url": "https://menafn.com/1107901532/How-Do-Opposition-Mps-Prepare-For-Government-The-Six-Key-Skills-That-Should-Be-On-Every-Labour-Politicians-Mind",
        "title": "How Do Opposition Mps Prepare For Government? The Six Key Skills That Should Be On Every Labour Politician&#39;s Mind",
        "description": "(MENAFN- The Conversation) <b>Keir Starmer</b>&#39;s shadow cabinet has now started “access talks” with the civil service as they prepare for the possibility of government. Being in government is different from being in opposition and Labour has been in ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/lee-anderson-islamophobia-controversy-explained-141944601.html",
        "title": "The Lee Anderson Islamophobia controversy, explained",
        "description": "Former Tory Party deputy chairman Lee Anderson has refused to apologise for his comments about London mayor Sadiq Khan."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/angela-rayner-says-buying-council-28704629",
        "title": "Angela Rayner says buying her council house was &#39;proud moment&#39; as she hits back at Tories",
        "description": "It comes as Sir Keir Starmer and Ms Rayner visit a housing development in the West Midlands on Monday (February 26). The Labour leader will hit out at the Tories’ record on housing and the decision by Rishi Sunak to scrap national house building targets."
    },
    {
        "url": "https://www.irishnews.com/life/irish-language/dinnseanchas-agus-seanfhocal-fingal-donegal-and-not-sending-a-blacksmith-to-make-shoes-TGBUQGQWC5HGHOBBGJBQTS6W2M/",
        "title": "Dinnseanchas agus seanfhocal: Fingal, Donegal and not sending a blacksmith to make shoes",
        "description": "Fine Gall, the territory or tribe of the Galls or Danes; and the same territory is still well known by the name of Fingal, and the inhabitants are locally called Fingallians. “Donegal is mentioned in several of our Annals,"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26188601/small-boat-crossings-surge-past-2000/",
        "title": "Small boat crossings surge past 2,000 mark this year as Rishi Sunak faces pressure on illegal migration",
        "description": "MORE than 2,000 illegal migrants have arrived on small boats already this year after one of the busiest days so far yesterday. A total 290 people crossed the Channel in five dinghies on Sunday"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870782/Chris-Bryant-Labour-SNP-Hoyle",
        "title": "&#39;Charlatan!&#39; Chris Bryant sparks calls for probe into Labour manipulation of Commons rules",
        "description": "Mr Bryant’s key role came just after PMQs, when he deliberately filibustered an uncontroversial 10 minute rule motion in order to allow Sir <b>Keir Starmer</b> and others more time to lobby Sir Lindsay Hoyle to change the rules and allow a vote on Labour’s ..."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-pm-lacks-backbone-call-152655543.html",
        "title": "<b>Starmer</b>: PM &#39;lacks the backbone&#39; to call out Islamophobia",
        "description": "Sir <b>Keir Starmer</b> said Rishi Sunak &quot;lacks the backbone&quot; to call out &quot;Islamophobia&quot; after Lee Anderson’s attack on Sadiq Khan. Speaking during a visit to Shrewsbury, the Labour leader said: &quot;I think this is straightforward. It’s Islamophobia and the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-lee-anderson-comment-tory-islamophobia-latest-b2502435.html?page=4",
        "title": "UK politics – latest: Sunak ‘lacks the backbone’ to call Lee Anderson’s comments Islamophobic, says <b>Starmer</b>",
        "description": "Rishi Sunak “lacks the backbone” to call out Lee Anderson’s remarks about London mayor Sadiq Khan as Islamophobic, Sir <b>Keir Starmer</b> has said. The prime minister finally condemned Mr Anderson’s claims that “Islamists” have “got control” of ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/rishi-sunak-mark-harper-islamophobia-politics-sadiq-khan/",
        "title": "PM denies Tories have &#39;Islamophobic tendencies&#39; as minister says Lee Anderson&#39;s comments were &#39;profoundly wrong&#39;",
        "description": "Labour leader Sir <b>Keir Starmer</b> said earlier that Rishi Sunak was harbouring &quot;extremists&quot; in his party, adding that it was right that Mr Anderson had been suspended for an &quot;appalling racist and Islamophobic outburst&quot;. Mohammed Amin, a former chairman of the ..."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/26/former-conservative-party-chair-urges-rishi-sunak-to-call-out-islamophobia/",
        "title": "Former Conservative Party chair urges Rishi Sunak to ‘call out’ Islamophobia",
        "description": "A former Conservative cabinet minister has called on the prime minister to speak out against Islamophobia amid a row over Lee Anderson’s comments referencing Islamists and Sadiq Khan.  Lee Anderson, the Ashfield MP who was the Conservative Party deputy chairman until last month,"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit-369323/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Labour leader Sir <b>Keir Starmer</b> will talk up Labour’s housing pledges on a visit to the West Midlands, promising it would deliver a “future built in Britain, by Britain, for Britain” if it wins power. The party leader is expected to say he would run a ..."
    },
    {
        "url": "https://www.politico.eu/article/labour-gets-boozy-with-the-city/",
        "title": "Labour gets boozy with the City",
        "description": "Presented by Nationwide By JAMES FITZGERALD with HANNAH BRENTON and ELEANOR MYERS PRESENTED BY View in your browser or listen to audio SNEAK PEEK — Rachel Reeves schmoozes City bigwigs at"
    },
    {
        "url": "https://news.stv.tv/scotland/yousaf-criticises-labour-ahead-of-pro-eu-campaign-event",
        "title": "Yousaf criticises Labour ahead of pro-EU campaign event",
        "description": "The event comes five years after Labour leader Sir <b>Keir Starmer</b> stated he would push for a second vote on Brexit. SNP leader Humza Yousaf has hit out at Labour ahead of a pro-EU campaign event being held in Glasgow five years after Sir <b>Keir Starmer</b> stated ..."
    },
    {
        "url": "https://news.stv.tv/politics/snp-calls-on-opposition-parties-to-support-fresh-ceasefire-motion-in-house-of-commons",
        "title": "SNP calls on opposition parties to support fresh ceasefire motion",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-to-reach-out-to-other-parties-on-ceasefire-as-mps-reveal-safety-concerns-4532588",
        "title": "SNP to reach out to other parties on ceasefire as MPs reveal safety concerns",
        "description": "SNP Westminster leader Stephen Flynn has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh ceasefire motion. Last week, Commons Speaker Sir Lindsay Hoyle publicly apologised to the SNP ..."
    },
    {
        "url": "https://www.channel4.com/news/lee-anderson-doubles-down-on-criticism-of-sadiq-khan",
        "title": "Lee Anderson doubles down on criticism of Sadiq Khan",
        "description": "His comments were that London, its Mayor and <b>Keir Starmer</b> are all controlled by Islamists. That was wrong, said Rishi Sunak today. But the PM won’t say whether they are racist, Islamophobic or just plain nasty. Another Tory MP Paul Scully got into a row ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26197981/extra-cash-for-mps-security/",
        "title": "Millions will be spent on personal bodyguards for MPs and home security upgrades within days after threats",
        "description": "Meanwhile Labour’s Chris Bryant admitted Labour used “grubby” tactics to buy time for Sir <b>Keir Starmer</b> to convince Hoyle to break Commons convention last week. And he told Channel 4 he was in part “put up” to the ruse - sparking calls for an ..."
    },
    {
        "url": "https://www.snp.org/westminster-is-failing-the-people-of-gaza-by-blocking-a-meaningful-ceasefire-vote/",
        "title": "Westminster is failing the people of Gaza by blocking a meaningful ceasefire vote",
        "description": "<b>Keir Starmer</b> was the only opposition leader who didn’t respond. Nonetheless, the SNP included language from the Labour Party’s amendment to maximise consensus. Yet again, Westminster is failing the people of Gaza by blocking a vote on the urgent action ..."
    },
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/mum-nottingham-attacks-victim-says-9125910",
        "title": "Mum of Nottingham attacks victim says that she has been denied chance to shame police officers in group where &#39;unforgivable&#39; message sent",
        "description": "The families have also written to the leader of the Labour opposition, <b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers. Commenting further on the &quot;ongoing mismanagement&quot; of the situation by Nottinghamshire Police, the statement ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/first-minister-slams-pro-brexit-labour-party",
        "title": "First minister slams ‘pro-Brexit Labour Party’",
        "description": "Ahead of a pro-EU student event in Glasgow’s Kelvingrove Park, Mr Yousaf took a swipe at Sir <b>Keir Starmer</b>’s switch from backing a second EU referendum in 2019 as shadow Brexit secretary to accepting the 2016 ballot result as Labour leader."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rebel-village-manchesters-last-rural-28577503",
        "title": "&#39;Rebel&#39; village is Manchester&#39;s last rural hideaway - with a giant neighbour",
        "description": "But with Sir <b>Keir Starmer</b> vowing that any future Labour government would not revive the cancelled plans, it appears Ringway is safe for now. And although Mr Oddie fears the village will be &#39;subsumed at some stage&#39;, he hopes it stays as it is for a good few ..."
    },
    {
        "url": "https://www.gg2.net/tories-suspend-mp-anderson-over-islamophobic-comments/",
        "title": "Tories suspend MP Anderson over ‘Islamophobic’ comments",
        "description": "Khan and Labour leader <b>Keir Starmer</b>, who both branded Anderson’s outburst “racist” and “Islamophobic”, also directed their criticism at Sunak, who has not commented on the scandal. Khan hit out at the “deafening silence” from the Tory leader ..."
    },
    {
        "url": "https://www.ft.com/content/0d1326b7-8c83-46bc-a9c2-56ce7bb1a109?mc_cid=3ade45c9b3&mc_eid=c7f63f3316",
        "title": "Labour drops plan to backdate UK windfall tax on oil and gas",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Sir <b>Keir Starmer</b>, the Labour leader, has dropped plans to backdate the windfall tax on oil and gas producers to the start of 2022 if the party wins the next general ..."
    },
    {
        "url": "https://news.sky.com/story/are-we-in-for-one-of-the-dirtiest-election-campaigns-ever-13056641",
        "title": "Are we in for one of the &#39;dirtiest&#39; election campaigns ever?",
        "description": "Image: Rishi Sunak responds to Sir <b>Keir Starmer</b> during PMQs Fair&#39;s fair, Sir <b>Keir Starmer</b> started it this time, but Rishi Sunak had a well-stocked pile to fling back. <b>Starmer</b> opened up referring to a couple of brief unofficial clips posted online."
    },
    {
        "url": "https://muslimmirror.com/eng/increasing-islamophobia-in-the-uk/",
        "title": "Increasing Islamophobia in the UK",
        "description": "By Asad Mirza Last week two unrelated incidents once again showed how easy it is, to form a narrative against Islam in the UK. Just 20 years back described as a ‘multicultural and ethnic hotpot’ under the Labour-era."
    },
    {
        "url": "https://au.news.yahoo.com/starmer-says-sunak-lacks-backbone-154153326.html",
        "title": "<b>Starmer</b> says Sunak ‘lacks backbone’ to call out Lee Anderson’s Islamophobia",
        "description": "Rishi Sunak “lacks the backbone” to call out Lee Anderson’s Islamophobic comments, Sir Keir Starmer said on Monday (26 February). The former Tory deputy chairman had the Conservative whip suspended over the weekend after he claimed “Islamists” had “got control” of Sadiq Khan and London."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/speaker-lindsay-hoyle-should-not-32213943",
        "title": "Speaker Lindsay Hoyle should not resign over handling of Gaza ceasefire debate - poll results",
        "description": "Some 67 MPs - more than a tenth of the Commons - have signed a motion expressing no confidence in the Speaker - but most Mirror readers say he should stand his ground"
    },
    {
        "url": "https://www.yahoo.com/news/lord-mandelson-leaves-synagogue-event-120638384.html",
        "title": "Lord Mandelson walks out of synagogue event after Labour anti-Semitism row",
        "description": "Lord Mandelson left a synagogue event early on Sunday night after a row broke out over Labour’s anti-Semitism problem."
    },
    {
        "url": "https://sg.news.yahoo.com/snp-demands-investigation-labour-dirty-115726662.html",
        "title": "SNP demands investigation into Labour ‘dirty tricks’ Gaza vote as senior MP admits delaying debate",
        "description": "Sir Chris Bryant said he was encouraged by Labour figures to delay parliamentary proceedings last Wednesday before vote on the SNP’s motion calling for a ceasefire in Gaza"
    },
    {
        "url": "https://spearswms.com/wealth/wealthy-british-vote-labour-over-conservatives/",
        "title": "HNWs more likely to vote Labour than Conservative, poll finds",
        "description": "Almost 27 per cent of HNWs would vote for Labour, compared to 16 per cent for the Conservatives, according to the poll by Saltus"
    },
    {
        "url": "https://www.politicshome.com/thehouse/article/ambitious-social-housebuilding-programme-achieved-right-policy-leadership",
        "title": "An ambitious social housebuilding programme can be achieved with the right policy leadership",
        "description": "By Keir Starmer’s own words, homelessness is a political choice, and it has almost doubled in the last decade alone."
    },
    {
        "url": "https://ca.news.yahoo.com/baroness-warsi-calls-rishi-sunak-231340001.html",
        "title": "Baroness Warsi calls on Rishi Sunak to break silence on Islamophobia row",
        "description": "Tory peer Baroness Warsi is calling on Rishi Sunak to break his silence over an escalating Islamophobia row and to explicitly condemn anti-Muslim rhetoric within the party."
    },
    {
        "url": "https://news.sky.com/story/keir-starmer-accuses-weak-sunak-of-harbouring-extremists-in-his-party-13080553?dcmp=snt-sf-twitter",
        "title": "<b>Keir Starmer</b> accuses &#39;weak&#39; Rishi Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "Sir <b>Keir Starmer</b> has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for &quot;Islamophobic&quot; comments. The Labour leader said Rishi Sunak&#39;s &quot;weakness&quot; allowed Lee Anderson &quot;to act with impunity&quot; and that he ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26178780/keir-starmer-yielding-mob-rule-bullying-alarming-labour-regime/",
        "title": "<b>Keir Starmer</b>’s yielding to mob rule &amp; bullying of Speaker shows alarming way Labour regime will operate under pressure",
        "description": "THE road to hell, they say, is paved with good intentions. Last week, for perhaps the best possible motives, the Speaker of the House of ­Commons, the Leader of HM Loyal Opposition and the Met"
    },
    {
        "url": "https://www.standard.co.uk/business/money/labour-would-run-patriotic-economy-starmer-to-say-on-west-midlands-visit-b1141414.html",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> to say on West Midlands visit",
        "description": "Sir <b>Keir</b> will be joined by deputy leader Angela Rayner on a trip to a housing development. Sir <b>Keir Starmer</b> will highlight Labour’s housebuilding pledges on a trip to the West Midlands (Jordan Pettitt/PA) Sir <b>Keir Starmer</b> will talk up Labour’s housing ..."
    },
    {
        "url": "https://www.yahoo.com/news/voices-keir-starmer-going-quit-145149805.html",
        "title": "Voices: <b>Keir Starmer</b> was going to quit as a failure three years ago – now he is on course for No 10",
        "description": "But it is one of the episodes in Tom Baldwin’s biography of <b>Keir Starmer</b> that attracted attention. After the Hartlepool by-election in May 2021, when the government gained the seat from the opposition, “<b>Keir</b> kept saying that he felt he would have to go ..."
    }
]