[
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-defends-national-trust-against-tory-claims-of-wokery-67mhwhv3c",
        "title": "<b>Keir Starmer</b> defends National Trust against Tory claims of ‘wokery’",
        "description": "Sir <b>Keir Starmer</b> will say on Monday that Labour is on the side of the National Trust and Royal National Lifeboat Institution as he accuses the Tories of “waging war” on charities and civic society. The Labour leader will use a speech in central London ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/a-big-win-for-starmer-would-kill-off-the-left-nftklk5hw",
        "title": "A big win for <b>Keir Starmer</b> would kill off the Labour left",
        "description": "Does it portend, as every business audience I encounter will ask, a more left-wing Labour government, in which Sir <b>Keir Starmer</b> and Angela Rayner — always identified as the left’s sleeper — use their political freedom to do as they please?"
    },
    {
        "url": "https://uk.news.yahoo.com/snp-challenges-starmer-sever-ties-000100759.html",
        "title": "SNP challenges <b>Starmer</b> to ‘sever all ties’ with Tony Blair Institute",
        "description": "Labour leader Sir <b>Keir Starmer</b> is being challenged to “sever all links” between his party and the think tank set up by Sir Tony Blair. Sir Tony, who was Labour’s longest serving prime minister, spending 10 years in Downing Street, set up the Tony ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12989629/Philip-pullman-dark-materials-author-school-libraries-legal-protection.html",
        "title": "His Dark Materials author Philip Pullman pleads ministers to protect school libraries amid fears of reading crisis among children",
        "description": "He spoke out after War Horse writer Sir Michael Morpurgo wrote to Rishi Sunak and Sir <b>Keir Starmer</b> to demand funding for books. Sir Michael cited a survey that found 42 per cent of children under seven miss out on a bedtime story."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12990213/DAILY-MAIL-COMMENT-call-action-heart-disease-deaths.html",
        "title": "DAILY MAIL COMMENT: A call to action over heart disease deaths",
        "description": "Labour&#39;s Brexit threat Sir <b>Keir Starmer</b> insists a Labour government would not reverse Brexit, but is he trying to gull Leave voters into supporting him? To discover his real convictions, listen to his henchmen. London mayor Sadiq Khan wants us to rejoin ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/labour-faces-calls-sever-links-blair-institute",
        "title": "Labour faces calls sever links with Blair institute",
        "description": "for its links to some of the world’s other human rights abusers in a letter to Sir <b>Keir Starmer</b>. Expressing his “deep concern” over the TBI links and the “unclear nature” of some of its funding sources, Mr Hendry challenged the Labour leader ..."
    },
    {
        "url": "https://www.businessgreen.com/news/4165798/analysis-uk-increase-green-public-investment-gbp26bn-tackle-environmental-threats",
        "title": "Analysis: UK must increase green public investment by £26bn a year to tackle environmental threats",
        "description": "The report came just days after Labour leader <b>Keir Starmer</b> and a number of senior Shadow Ministers defended the £28bn a year goal, while stressing any borrowing would be subject to the Party&#39;s fiscal rules. A Labour spokesperson immediately dismissed the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/21/sir-keir-starmer-national-trust-culture-wars-rnli-queen-pat/",
        "title": "<b>Starmer</b> defends the National Trust’s ‘woke’ agenda",
        "description": "Sir <b>Keir Starmer</b> on Monday defends the National Trust against accusations of “woke” behaviour as he claims the Tories have gone to “war” with the charity. The Labour leader accuses the Government of getting “so tangled up in culture wars of their ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-sir-keir-starmer-ownership-28485925",
        "title": "Sir <b>Keir Starmer</b> makes &#39;cause for concern&#39; admission after Newcastle ownership question",
        "description": "Newcastle United are majority owned by Saudi Arabia&#39;s Public Investment Fund and Labour party leader Sir Keir Starmer has given his thoughts on the structure at the top"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-snp-downing-street-westminster-bahrain-b1133806.html",
        "title": "SNP challenges <b>Starmer</b> to ‘sever all ties’ with Tony Blair Institute",
        "description": "SNP Westminster economy spokesperson Drew Hendry issued the demand in a letter to UK Labour leader Sir Keir Starmer."
    },
    {
        "url": "https://www.thetimes.co.uk/article/snp-mp-urges-keir-starmer-to-cut-ties-with-tony-blair-institute-qds2s6vf8",
        "title": "SNP MP urges <b>Keir Starmer</b> to cut ties with Tony Blair Institute",
        "description": "Drew Hendy said the probable future prime minister should not deal with the think tank due to concerns over funding sources"
    },
    {
        "url": "https://www.thesun.co.uk/news/25440423/keir-starmer-end-tories-woke-war/",
        "title": "<b>Keir Starmer</b> wants to end the Tories’ war on woke – accusing them of picking fights to stay in power",
        "description": "LABOUR leader Sir <b>Keir Starmer</b> wants an end to the Tories’ war on woke, accusing them of picking fights to stay in power. He will use a speech today to accuse the Conservatives of trashing organisations such as the RNLI and the National Trust to sow ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25439979/starmer-humza-yousaf-labour-popularity/",
        "title": "Sir <b>Keir Starmer</b>’s cosy chat with Humza Yousaf proves Labour fear their current popularity is only surface-deep",
        "description": "HE’S miles ahead in the polls and expected by his party faithful to become Prime Minister later this year. So why is Sir <b>Keir Starmer</b> even entertaining the idea of a cosy chat with the SNP leader? Perhaps Labour fears its current popularity is only ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-tories-royal-national-lifeboat-institution-david-cameron-london-b1133784.html",
        "title": "<b>Starmer</b> plans ‘society of service’ and accuses Tories of ‘sabotaging’ charities",
        "description": "The Labour leader will pledge to work hand-in-hand with civil society and faith groups if his party wins the general election."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/21/starmer-defend-rnli-national-trust-desperate-tory-culture-war",
        "title": "<b>Starmer</b> to defend RNLI and National Trust from ‘desperate’ Tory culture war",
        "description": "Labour leader’s speech will be his most outspoken response to ‘woke’ politics criticisms by Conservatives <b>Keir Starmer</b> will defend organisations such as the Royal National Lifeboat Institution and the National Trust on Monday, accusing the ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-accused-sabotaging-good-causes-31931934",
        "title": "Tories accused of sabotaging good causes that could help stop the boats",
        "description": "In a speech to community group leaders, Keir Starmer will accuse Tories of sabotaging good causes like the RNLI and the National Trust in a &#39;desperate&#39; and &#39;divisive&#39; culture war"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/four-labour-defeats-row-reminder-31934750",
        "title": "&#39;Four Labour defeats in a row are a reminder to take absolutely nothing for granted&#39;",
        "description": "The Conservatives have had five since 2016 alone so <b>Keir Starmer</b> would be creating his own bit of history should he, as is widely expected this year, become Labour’s seventh after MacDonald, Attlee, Wilson, Callaghan, Blair and Brown. Though it has ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-splits-khan-brexit-stance-2866137",
        "title": "Fresh Labour splits emerge over Sadiq Khan’s Brexit stance",
        "description": "Labour splits on Brexit have reopened as the party rejected Sadiq Khan’s call to allow young people to travel freely to and from the EU because it would drive up immigration. The London Mayor used a speech at the weekend to call for a youth mobility agreement with the European Union and said the UK should consider rejoining the customs union."
    },
    {
        "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-evening-headlines-magpies-28486108",
        "title": "Newcastle United evening headlines with Magpies stance on Trippier and Wilson",
        "description": "Here are the latest Newcastle United headlines for Sunday, January 21, 2024. Newcastle United have rejected bids for both Kieran Trippier and Callum Wilson - but are braced for further interest on the pair. Bayern Munich made their moved on England full-back Trippier this weekend, with the Magpies rebuffing their bid."
    },
    {
        "url": "https://www.ross-shirejournal.co.uk/news/colin-campbell-has-making-the-best-of-things-gone-out-of-fa-339703/",
        "title": "COLIN CAMPBELL: Making the best of things has gone out of fashion in &#39;broken Britain&#39;",
        "description": "Picture: Callum Mackay. Are today’s politicians really the most untrustworthy ever? It seems highly unlikely that Rishi Sunak or Sir <b>Keir Starmer</b> or any of the other leading players are concealing from the public ill-health and an alcohol problem ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/opinion/24060541.mp-blasts-gambling-industry-grooming-children/",
        "title": "MP blasts gambling industry for &#39;grooming children&#39;",
        "description": "THE All-Party Parliamentary Group (APPG) on Gambling Related Harm met and took evidence from Dr David Zendle who is a behavioural data scientist."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/21/humza-yousaf-invites-sir-keir-starmer-talks/",
        "title": "Humza Yousaf invites Sir <b>Keir Starmer</b> for talks on working together",
        "description": "Mr Yousaf wants to persuade independence supporters they can vote SNP in this year’s general election and still get a Labour government Credit: Andrew Milligan/PA Humza Yousaf has invited Sir <b>Keir Starmer</b> for talks so they can put aside their ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1858234/sadiq-khan-brexit-london-howard-cox",
        "title": "&#39;Keep your grubby paws out!&#39; Sadiq Khan slammed by rival after mayor’s latest Brexit swipe",
        "description": "Howard Cox also suggested Mr Khan&#39;s remarks indicated he was thinking to a time when he was no longer Mayor of London."
    },
    {
        "url": "https://news.sky.com/story/the-week-the-tories-talk-about-tax-cuts-13053514",
        "title": "The Week… The Tories talk about tax cuts",
        "description": "Meanwhile Sir <b>Keir Starmer</b> will be trying to take the headlines with his own agenda with a speech focussing on crime. Rwanda isn&#39;t forgotten, though - Jack and Sam talk about what&#39;s next for the policy that has divided the Conservative Party. Plus ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24064563.young-people-need-develop-skills-values-well-confidence/",
        "title": "Young people need to develop skills and values as well as confidence",
        "description": "KATE Forbes’s article in Saturday’s National hits the nail on the head on the importance of the young and their education (Education should"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/politics-matters-what-sort-of-nation-will-we-become-in-the-339654/",
        "title": "POLITICS MATTERS: What sort of nation will we become in the next decade?",
        "description": "This would give Labour leader Sir <b>Keir Starmer</b> a 120-seat majority. The poll also makes for uncomfortable reading for First Minister Humza Yousaf, predicting that the SNP would lose almost half of its seats to Labour, holding only 25. The First Minister ..."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24064540.storm-isha-scotrail-trains-suspended-tonight-tomorrow/",
        "title": "Storm Isha: ScotRail trains suspended tonight and tomorrow",
        "description": "All trains in Scotland will be suspended from 7pm tonight as storm Isha hits across the country. ScotRail confirmed the move to passengers and said there will also be no trains on Monday morning due to the extreme weather. Due to safety concerns, Network Rail decided to close the railway to passenger services."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/21/uk-needs-ambitious-green-plan-keep-up-allies-labour-frontbencher",
        "title": "UK needs ambitious green plan to keep up with allies, says Labour frontbencher",
        "description": "amid an increasingly bitter row over whether <b>Keir Starmer</b> should stick to his flagship £28bn pledge. Jonathan Reynolds, the shadow business secretary, said the UK should come up with its own version of Joe Biden’s $369bn (£290bn) Inflation Reduction ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1858214/shapps-jenrick-channel-crisis-rwanda-echr",
        "title": "Shapps urges action on Channel crisis, Jenrick questions Rwanda bill and ECHR",
        "description": "Grant Shapps has declared it is &quot;time to stop the boats and send the planes&quot; to Rwanda to end the Channel migrant crisis."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/24061185.andover-remain-tory-despite-landslide-labour-victory/",
        "title": "Andover would remain Tory despite &#39;landslide&#39; Labour victory",
        "description": "Labour is predicted to have a &#39;landslide&#39; victory if an election was held tomorrow but Andover would remain a safe Conservative seat, a new"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/brexit-labour-starmer-khan-single-market-b2482081.html",
        "title": "Brexit: Sadiq Khan attacks Labour’s ‘omerta’ silence over rejoining EU single market",
        "description": "London mayor Sadiq Khan has criticised the “omerta” which has prevented the party from debating whether the UK could re-join the EU single market after Brexit. The senior Labour figure suggested there was a code of silence which stopped Sir Keir Starmer ’s party discussing bolder steps to re-integrate with Brussels."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/murder-investigation-launched-after-body-of-woman-found-near-gibraltar-point-in-skegness/",
        "title": "Murder investigation launched after body of woman found near Gibraltar Point in Skegness",
        "description": "A murder investigation has been launched after a body of a woman was found near a coastal nature reserve. Detectives say the body of the woman, believed to be missing 23-year-old Petra Ross, was found near Gibraltar Point, Skegness, Lincolnshire. Ms Ross was reported missing on Friday 19 January."
    },
    {
        "url": "https://www.cityam.com/jeremy-hunt-promises-tax-cuts-as-he-cites-nigel-lawson/",
        "title": "Jeremy Hunt promises tax cuts as he cites Nigel Lawson",
        "description": "Jeremy Hunt has promised to cut more taxes as he compared his policies to those of Nigel Lawson’s efforts to boost the City of London in the 1980s."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/explosions-at-chemical-storage-facility-in-russia/",
        "title": "Explosions at chemical storage facility in Russia",
        "description": "Humza Yousaf invites Sir <b>Keir Starmer</b> for talks to establish &#39;working relationship&#39; Scotland&#39;s First Minister has invited Sir <b>Keir Starmer</b> to Edinburgh for talks on how their parties could co-operate following a general election. Jeremy Hunt hints at ..."
    },
    {
        "url": "https://news.sky.com/story/humza-yousaf-invites-sir-keir-starmer-for-talks-to-establish-working-relationship-13053160",
        "title": "Humza Yousaf invites Sir <b>Keir Starmer</b> for talks to establish &#39;working relationship&#39;",
        "description": "Scotland&#39;s First Minister has invited Sir Keir Starmer for talks to establish a working relationship following an election, saying the Labour leader will &quot;undoubtedly&quot; be the next PM."
    },
    {
        "url": "https://inews.co.uk/opinion/columnists/what-every-labour-prime-minister-got-wrong-2858803?ito=facebook_share_article-top",
        "title": "What every Labour Prime Minister got wrong",
        "description": "A Starmer government looks set to inherit the worst economic situation of any incoming government – of either party – since Clement Attlee in 1945. It should therefore worry today’s Labour supporters, given the dire economic inheritance, that the current policy offering looks dwarfed by the scale of the task."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68046866",
        "title": "Yousaf offers talks with &#39;next prime minister&#39; <b>Starmer</b>",
        "description": "Scotland&#39;s First Minister Humza Yousaf has said he is &quot;very willing&quot; to work with the next Labour government if Sir Keir Starmer becomes prime minister. The SNP leader said he was &quot;absolutely sure&quot; that his party would win the most seats in Scotland - despite some polls putting them neck and neck with Labour."
    },
    {
        "url": "https://metro.co.uk/2024/01/21/laura-kuenssberg-accused-bias-bbc-interview-politician-20148636/",
        "title": "Laura Kuenssberg faces backlash for ‘unashamed bias’ during BBC interview with politician",
        "description": "Laura Kuenssberg is facing accusations of showing ‘bias’ after viewers watched her conclude an interview with a Labour politician on her BBC programme. On today’s Sunday with Laura Kuenssberg, the presenter welcomed Shadow Home Secretary Yvette Cooper into the studio."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/uk-wedded-to-two-state-solution-after-israeli-pm-expresses-opposition-to-a-palestinian-state-4486804",
        "title": "UK &#39;wedded&#39; to two-state solution after Israeli PM expresses opposition to a Palestinian state",
        "description": "Labour has also rebuked Mr Netanyahu&#39;s position. Shadow home secretary Yvette Cooper on Sunday echoed Labour leader Sir <b>Keir Starmer</b> and shadow foreign secretary David Lammy in saying: &quot;Those words from Netanyahu were completely unacceptable. &quot;Statehood of ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24064279.humza-yousaf-muslims-fear-palestinian-blood-cheap/",
        "title": "Humza Yousaf: Muslims fear &#39;Palestinian blood is very cheap&#39;",
        "description": "Mr Yousaf then took aim at Labour leader Sir <b>Keir Starmer</b> who he said has not shown leadership in demanding a ceasefire. “I think there’s just a lack of leadership and moral courage, if I’m being frank,” Mr Yousaf added. “This is a classic ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/tories-fearful-of-canada-93-style-wipeout-367252/",
        "title": "Tories fearful of Canada ’93-style wipeout",
        "description": "A week of disastrous poll results has got many Tory MPs discussing the prospect of a Canada 1993-style wipeout at the next election, per Bloomberg. Research published on the front page of the Sunday Telegraph last week suggests Rishi Sunak’s party could hold on to as few as 169 seats as Sir Keir Starmer’s Labour enters Downing Street with 385 at the next election."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/scottish-news/24064263.humza-yousaf-invites-keir-starmer-talks-bute-house/",
        "title": "Humza Yousaf invites <b>Keir Starmer</b> to talks at Bute House",
        "description": "Humza Yousaf has invited Keir Starmer to Edinburgh to discuss relations between governments at Holyrood and Westminster."
    },
    {
        "url": "https://news.stv.tv/west-central/yousaf-political-opponents-view-palestinian-and-muslim-lives-as-cheap",
        "title": "Yousaf: Political opponents view Palestinian and Muslim lives as ‘cheap’",
        "description": "Mr Yousaf then took aim at Labour leader Sir <b>Keir Starmer</b> who he said has not shown leadership in demanding a ceasefire. “I think there’s just a lack of leadership and moral courage, if I’m being frank,” Mr Yousaf added. “This is a classic ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68029051?at_ptr_name=facebook_page&at_format=link&at_bbc_team=editorial&at_campaign=Social_Flow&at_campaign_type=owned&at_medium=social&at_link_id=CCD5B1CC-B7C3-11EE-9A25-BD7487A28522&at_link_origin=BBC_Scotland_News&at_link_type=web_link",
        "title": "Can Rishi Sunak halt growing Tory poll panic?",
        "description": "Mr Levido told Conservative MPs that he had a plan to turn things around. That plan is for Rishi Sunak to tell the public that he has a plan - whereas Sir <b>Keir Starmer</b> and Labour would &quot;take the country back to square one&quot;. It was a mantra to which the ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/sunday-crunch/on-the-defense/",
        "title": "On the defense",
        "description": "Crunch, the weekly lunchtime digest of the best stories kicking off the week in British politics, is the Sunday edition of the London Playbook."
    },
    {
        "url": "https://www.heraldscotland.com/news/24064204.yousaf-invites-starmer-respectful-bute-house-independence-talks/",
        "title": "Yousaf invites <b>Starmer</b> for &#39;respectful&#39; Bute House independence talks",
        "description": "Humza Yousaf has invited Sir Keir Starmer to Bute House for crunch talks about independence after assuming the Labour leader will become the"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/pro-palestinian-protesters-interrupt-david-lammys-speech-5-times_uk_65ad0416e4b041f1ce6652c9?d_id=7204174&ncid_tag=fcbklnkukhpmg00000001",
        "title": "David Lammy&#39;s Speech Interrupted 5 Times By Pro-Palestinian Protesters",
        "description": "David Lammy was interrupted by five pro- Palestinian demonstrators while he was trying to give a speech on foreign policy on Saturday. The shadow foreign secretary was around 10 minutes into his address at the Fabian Society conference when the first sign of dissent popped up."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-68046866?at_medium=social&at_campaign=Social_Flow&at_campaign_type=owned&at_link_type=web_link&at_format=link&at_link_id=E15B256A-B849-11EE-83E8-A353D0B4AF07&at_bbc_team=editorial&at_link_origin=BBC_Scotland_News&at_ptr_name=facebook_page",
        "title": "Humza Yousaf &#39;very willing&#39; to work with next Labour government",
        "description": "Scotland&#39;s First Minister Humza Yousaf has said he is &quot;very willing&quot; to work with the next Labour government if Sir <b>Keir Starmer</b> becomes prime minister. The SNP leader said he was &quot;absolutely sure&quot; that his party would win the most seats in Scotland ..."
    },
    {
        "url": "https://uk.news.yahoo.com/private-school-vat-raid-hurt-161559864.html",
        "title": "Private school VAT raid will hurt the less wealthy, parents tell <b>Keir Starmer</b>",
        "description": "Parents who send their children to private schools have told Sir <b>Keir Starmer</b> they are “not wealthy” as they launch a campaign against his VAT raid. Thousands have pledged support for a parent-led campaign against Labour’s plans to add 20 per cent ..."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24064031.shapps-rebukes-netanyahus-disappointing-opposition-palestinian-state/",
        "title": "Shapps rebukes Netanyahu’s ‘disappointing’ opposition to Palestinian state",
        "description": "Labour has also rebuked Mr Netanyahu’s position. Shadow home secretary Yvette Cooper on Sunday echoed Labour leader Sir <b>Keir Starmer</b> and shadow foreign secretary David Lammy in saying: “Those words from Netanyahu were completely unacceptable."
    },
    {
        "url": "https://www.thenational.scot/news/24064013.humza-yousaf-keir-starmer-must-respect-scotland-independence/?s=04",
        "title": "Humza Yousaf: <b>Keir Starmer</b> must &#39;respect&#39; Scotland on independence",
        "description": "FIRST Minister Humza Yousaf has urged <b>Keir Starmer</b> to &quot;respect Scotland&#39;s voice&quot; on independence if he becomes the next UK prime minister. Yousaf invited the UK Labour leader for talks at Bute House and said he would work with <b>Starmer</b> on attempts to tackle ..."
    },
    {
        "url": "https://uk.news.yahoo.com/humza-yousaf-invites-keir-starmer-133749464.html",
        "title": "Humza Yousaf invites <b>Keir Starmer</b> to talks on independence and the economy",
        "description": "Humza Yousaf has invited <b>Keir Starmer</b> to a meeting, in Edinburgh, to discuss relations between governments at Holyrood and Westminster if Labour wins the next General Election. The First Minister said he wanted to address independence, economic and ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/uk-politicians-slam-netanyahu-opposition-144327728.html",
        "title": "UK politicians slam Netanyahu’s opposition to two-state solution",
        "description": "While Labour’s shadow home secretary Yvette Cooper on Sunday echoed Labour leader Sir <b>Keir Starmer</b>, saying: “Those words from Netanyahu were completely unacceptable.” She added: “Statehood of a people is not in the gift of its neighbour ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/palestine-protest-waves-continue-across-britain-gaza-suffering-deepens",
        "title": "Palestine protest waves continue across Britain as Gaza suffering deepens",
        "description": "Today Labour shadow home secretary Yvette Cooper echoed Labour leader Sir <b>Keir Starmer</b> and shadow foreign secretary David Lammy in saying that Mr Netanyahu’s statement was “completely unacceptable.” You can’t buy a revolution, but you can help the ..."
    },
    {
        "url": "https://www.bordertelegraph.com/news/national/24063575.david-lammys-speech-disrupted-pro-palestinian-protesters/",
        "title": "David Lammy’s speech disrupted by pro-Palestinian protesters",
        "description": "The Labour frontbencher was echoing Sir <b>Keir Starmer</b>, who hardened his tone towards the Israeli prime minister by branding his position over a future Palestinian state as “unacceptable”. The Labour leader has faced divisions in his party over the war ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68041203.amp",
        "title": "Laura Kuenssberg: Why is Humza Yousaf predicting &#39;inevitable&#39; <b>Keir Starmer</b> victory?",
        "description": "But there is one prominent politician who claims to know the outcome of the upcoming general election. They say it&#39;s &quot;inevitable&quot; that Sir <b>Keir Starmer</b> will be the next PM - and they&#39;re not even in the Labour Party. You voters are a volatile bunch and ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/palestine-protests-across-britain-20-jan/",
        "title": "Rage and radicalism on Britain’s streets as thousands join actions for Palestine",
        "description": "As they marched, people chanted, “Ceasefire now,” and, “Shame on you Rishi Sunak,” “Shame on you <b>Keir Starmer</b>”. Hamza, a Palestinian, told the rally at the end of the march, “We must never lose hope. Every retweet, every post and protest helps."
    }
]