[
    {
        "url": "https://news.sky.com/story/beth-rigby-there-are-still-battles-the-pm-can-win-but-hes-already-lost-the-war-13049183",
        "title": "Beth Rigby: There are still battles the PM can win - but he&#39;s already lost the war",
        "description": "With voters, he is struggling to build any sort of coalition, still bumping along 18 or so points behind Sir <b>Keir Starmer</b>&#39;s Labour after 15 months in office, while this week he finds himself battling 60 of his own MPs convinced his flagship Rwanda plan won ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/reform-sets-up-tory-party-defections-unit",
        "title": "Reform Sets Up Tory Defections Unit",
        "description": "Right wing party Reform UK has set up a new unit focused on handling potential defections to its ranks as it tries to lure"
    },
    {
        "url": "https://uk.news.yahoo.com/downing-street-election-guru-tells-194933702.html",
        "title": "Downing Street Election Guru Tells Tories To Unite Or Face Defeat",
        "description": "Rishi Sunak’s election guru has warned Tory MPs they need to “get serious” or face being kicked out of government. Isaac Levido warned that voters would punish the warring party after a new poll showed Labour are on course for a landslide victory later this year."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-wont-tax-super-190536595.html",
        "title": "<b>Keir Starmer</b> &#39;won&#39;t tax super rich&#39; more to redistribute to poorest if PM",
        "description": "KEIR Starmer has said that he won’t tax the super rich more in order to redistribute to the poorest if prime minister."
    },
    {
        "url": "https://www.thenational.scot/news/24051567.keir-starmer-wont-tax-super-rich-redistribute-poor-pm/",
        "title": "<b>Keir Starmer</b> &#39;won&#39;t tax super rich&#39; more to redistribute to poor if PM",
        "description": "KEIR Starmer has said that he won’t tax the super rich more in order to redistribute to the poorest if prime minister."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67982650",
        "title": "I am determined to pass Rwanda bill, says Rishi Sunak",
        "description": "Prime Minister Rishi Sunak has said he is &quot;determined&quot; to get his Safety of Rwanda Bill into law, despite criticism from his own backbenchers. More than 50 Conservative MPs have backed amendments they say would toughen up the bill, which returns to the House of Commons on Tuesday."
    },
    {
        "url": "https://www.heraldscotland.com/news/24051505.rishi-sunak-refuses-rule-air-strikes-amid-esclation-fears/",
        "title": "Rishi Sunak refuses to rule out more air strikes amid esclation fears",
        "description": "Rishi Sunak has said joint US-UK air strikes on Houthi targets in Yemen last week were intended as a “limited single action” but refused to"
    },
    {
        "url": "https://inews.co.uk/opinion/tory-political-obliteration-rishi-sunak-2855589?ico=best_of_opinion",
        "title": "The Tories face political obliteration – and could be out of power for years",
        "description": "After 1997, the collective depression of the Conservative Party – which had thought itself fitted for decades in power and which instead suffered a bewildered inability to connect with the electorate’s changing mood – proved a major obstacle to its own ability to fight back."
    },
    {
        "url": "https://www.scotsman.com/news/politics/yemen-bombings-rishi-sunak-defends-uk-strikes-in-red-sea-amid-inflation-fears-as-snp-seek-answers-over-long-term-strategy-4479420",
        "title": "Yemen bombings: Rishi Sunak defends UK strikes in Red Sea amid inflation fears as SNP seek answers over long-term strategy",
        "description": "Rishi Sunak has insisted the UK must be “prepared to back our words with actions”, as a fresh strike against a US-owned ship in the Red Sea fuelled tensions and economists warned the conflict risked fuelling a new spike in inflation."
    },
    {
        "url": "https://www.chronicle.gi/shapps-makes-case-for-increased-western-defence-spending-in-pre-war-era/",
        "title": "Shapps makes case for increased western defence spending in ‘pre-war’ era",
        "description": "By David Hughes, PA Political Editor The UK is facing a “pre-war world” and the “peace dividend” that allowed successive governments to ease spending on defence is over, Grant Shapps has said. Before taking the role,"
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-tories-96-seats-data-2855594",
        "title": "Reform will not cost the Tories 96 seats – here’s what the data really shows",
        "description": "A new poll by the company suggests the Tories could be on course for a 1997-style wipe-out at the next general election, losing droves of seats to Labour"
    },
    {
        "url": "https://www.chronicle.gi/uk-will-back-words-with-actions-in-red-sea-says-sunak-as-attacks-continue/",
        "title": "UK will ‘back words with actions’ in Red Sea, says Sunak as attacks continue",
        "description": "By PA Reporters Rishi Sunak has warned that the UK Government remains “prepared to back our words with actions”, as missile attacks continued in the Red Sea despite last week’s air strikes against Houthi rebels."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tory-mps-mps-rishi-sunak-yougov-prime-b2479070.html",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24051440.conservative-leader-chris-steward-hits-lib-dems/",
        "title": "Conservative leader Chris Steward hits out at Lib Dems",
        "description": "The Conservative group leader on the City of York Council has accused the Liberal Democrats of trying to score “cheap political points”"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67985452?at_campaign_type=owned&at_link_origin=BBCWorld&at_format=link&at_link_id=8BDF40C8-B3C9-11EE-8739-A755D0B4AF07&at_bbc_team=editorial&at_link_type=web_link&at_ptr_name=twitter",
        "title": "Rishi Sunak: Strikes on Houthis intended as &#39;limited, single action&#39;",
        "description": "But the prime minister says the UK &quot;will not hesitate to protect our security&quot; following Houthi attacks on shipping."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-mps-parliament-government-keir-starmer-b1132496.html",
        "title": "Sunak: It was necessary to strike Houthis at speed rather than recall Parliament",
        "description": "Rishi Sunak has defended his decision not to consult Parliament before approving RAF airstrikes against Houthi rebels, amid pleas to avoid escalation across the Middle East. The Prime Minister said sometimes there is a need to act “decisively” and the Government must have the power to act in such emergencies."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/15/rishi-sunak-uk-willing-further-military-action-houthis?ref=mc.news",
        "title": "Rishi Sunak: UK willing to take further military action against Houthis",
        "description": "Prime minister addresses MPs hours after Yemen-based group fires on another container ship in Red Sea"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-rishi-returns-to-the-commons/",
        "title": "London Playbook: Rishi returns to the Commons",
        "description": "Good afternoon. This is Andrew McDonald. Emilio Casalicchio will be back in your inboxes tomorrow afternoon. — Rishi Sunak made the case for Britain’s strikes on the Houthis. — But Keir Starmer had some piercing questions for the PM. — Tory right-wingers are getting ready to confront Isaac Levido at the 1922 committee"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/houthi-strikes-drone-missile-launch-171448997.html",
        "title": "Houthi strikes: Drone and missile launch sites destroyed, Rishi Sunak tells MPs",
        "description": "Drone and ballistic missile launch sites were destroyed in “carefully targeted” strikes by Britain and the US in Yemen last week, Rishi Sunak has told MPs."
    },
    {
        "url": "https://www.thesun.co.uk/news/25360238/sir-keir-starmer-drops-leadership-pledges/",
        "title": "Sir <b>Keir Starmer</b> appears to be dropping two more of his pledges but denies any ‘inconsistency’",
        "description": "SIR Keir Starmer yesterday appeared to drop two more of his leadership pledges but firmly denied any “inconsistency” with his position. Last week, the Labour leader gave his backing to"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/14/keir-starmer-defends-stance-on-military-action-and-saudi-arms",
        "title": "<b>Keir Starmer</b> defends stance on military action and Saudi arms sales",
        "description": "Labour leader denies he has rowed back on pledge to give MPs a say before authorising military intervention"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12964091/Tory-poll-Reform-UK-Farage-Labour-RIshi-Sunak-Keir-Starmer-election.html",
        "title": "Is YOUR MP about to be kicked out? Interactive map based on major new poll shows how <b>Keir Starmer</b> is on track to turn the country red at the election - as Rishi Sunak tries to ...",
        "description": "Rishi Sunak insisted he has a &#39;plan&#39; after a huge survey of 14,000 voters found the Conservatives are on course to lose nearly 200 seats at this year&#39;s general election."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67986801",
        "title": "<b>Starmer</b> condemns Houthi attacks and backs UK strikes",
        "description": "Labour leader Sir Keir Starmer reiterates that his party backs the &quot;targeted&quot; action in the Red Sea. Adding that Houthi attacks are &quot;unacceptable&quot; and &quot;illegal&quot; and adds that if they are left unaddressed, &quot;they could lead to a devastating rise in the cost of food in some of the poorest countries&quot;."
    },
    {
        "url": "https://www.stopwar.org.uk/article/us-and-britain-open-second-front-in-gaza-war/",
        "title": "US and Britain Open Second Front in Gaza War",
        "description": "Gazans have no air force, no navy or army. Israel has some of the most sophisticated weapons in the world which it is using against innocent people. As the South African government’s case against Israel in the International Court of Justice makes clear, these and previous actions indicate ‘genocidal intent’ and must be stopped."
    },
    {
        "url": "https://www.thetimes.co.uk/article/wed-be-sunk-without-us-backing-in-red-sea-brwtbjfsd",
        "title": "We’d be sunk without US backing in Red Sea",
        "description": "Defending the world’s shipping routes relies on American hard power, but Europe will feel the chill if Trump wins again"
    },
    {
        "url": "https://morningstaronline.co.uk/article/establishment-both-tory-and-labour-are-oblivious-anti-war-mood-street",
        "title": "The Establishment underestimates the anti-war mood at its peril",
        "description": "Having endured a decade of bombing by the empire’s proxy power Saudi Arabia — logistics, aircraft, maintenance, training and munitions supplied by Anglo-American big business and the RAF — the Yemenis know something about self-defence."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/red-sea-houthi-keir-starmer-prime-minister-commons-b1132476.html",
        "title": "UK will ‘back words with actions’ in Red Sea, says Sunak as attacks continue",
        "description": "The Prime Minister’s statement in the Commons came shortly after a missile struck a US-owned ship off the coast of Yemen."
    },
    {
        "url": "https://www.politico.eu/article/rishi-sunak-houthi-yemen-attack-self-defense/",
        "title": "Rishi Sunak: Houthi attacks were taken in ‘self defense’",
        "description": "Sunak has been backed in taking action by Keir Starmer, the leader of the opposition, who said the attacks by Houthis were “unacceptable, illegal and if left unaddressed could lead to a devastating rise in the cost of food in some of the poorest countries.”"
    },
    {
        "url": "https://www.thenational.scot/news/24051145.rishi-sunak-faces-commons-grilling-yemen-airstrikes/",
        "title": "Rishi Sunak faces Commons grilling on Yemen airstrikes",
        "description": "RISHI Sunak defended failing to consult the Commons before launching airstrikes on Houthi rebels in Yemen as he faced MPs for the first time"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67986802",
        "title": "PM: This action was taken in self-defence",
        "description": "The PM says a Conservative MP is putting words in his mouth over deaths in the Middle East. The Labour leader says his party&#39;s commitment to Nato is &quot;unshakeable&quot; during a trip to Estonia. The PM says prosecutions of sub-postmasters are under review by the justice secretary."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/live-wales-breaking-news-plus-28445892",
        "title": "Live: Wales breaking news plus weather and traffic updates (Monday, January 15)",
        "description": "Hello, and welcome to Wales Online&#39;s live blog for Monday, January 15. We will be bringing you all of the latest news from across Wales - whether you&#39;re on the move, at home or at work - as well as the latest traffic and travel."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/yemen-houthis-us-ship-uk-sunak-b2479028.html",
        "title": "UK will ‘back words with actions’, says Sunak as Houthis strike US-owned ship off Yemen coast",
        "description": "Rishi Sunak warned that his government remains “prepared to back our words with actions”, as Houthi missile attacks continued against ships in the Red Sea despite last week’s air strikes against the rebels in Yemen."
    }
]