[
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/national/24054581.children-poorer-backgrounds-must-not-deprived-life-rich-reading/",
        "title": "Children from poorer backgrounds ‘must not be deprived of life rich in reading’",
        "description": "War Horse writer Sir Michael Morpurgo has, along with all the children’s laureates of the past 25 years, written to Prime Minister Rishi Sunak and Labour leader Sir <b>Keir Starmer</b> to demand sustained funding towards books and reading for the under-sevens ..."
    },
    {
        "url": "https://www.leighjournal.co.uk/news/24054105.keir-starmer-meets-local-leaders-across-leigh-atherton/",
        "title": "<b>Keir Starmer</b> meets local leaders across Leigh and Atherton",
        "description": "THE Labour candidate for Leigh and Atherton believes that the area is &quot;ready for a Labour government” after party leader Keir Starmer"
    },
    {
        "url": "https://www.ft.com/content/f977f5df-4125-48d5-aa07-cdd21267663d?sharetype=gift",
        "title": "Why <b>Starmer</b> will not tread lightly on voters’ lives",
        "description": "“I also promise this: a politics that treads a little lighter on all of our lives.” So declared <b>Keir Starmer</b> in his first political foray of what we know will be an election year. After the enervating, angry, confrontational politics of recent times ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/children-from-poorer-backgrounds-must-not-be-deprived-of-life-rich-in-reading-23XBV34R6NMPDFULS3REFY7Y4U/",
        "title": "Children from poorer backgrounds ‘must not be deprived of life rich in reading’",
        "description": "An open letter calling for greater investment in early years reading has been signed by all children’s laureates from the past 25 years."
    },
    {
        "url": "https://www.thetimes.co.uk/article/members-club-founded-by-brian-cox-and-peter-capaldi-goes-bust-jv3wsgksr?ilc=timesradio:morefromthetimes",
        "title": "Members club founded by Brian Cox and Peter Capaldi goes bust",
        "description": "Alongside Capaldi and Cocker the actors Brian Cox and Sienna Guillory, musician Andrew Weatherall and broadcaster Miranda Sawyer were all founding members. The club in Soho Square"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/homes-still-being-built-flood-31895680",
        "title": "Homes still being built in flood risk areas despite devastation caused by storms",
        "description": "The Public Accounts Committee accused the government of letting existing flood defences fall into disrepair and turning a blind eye to property development in high risk areas"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12971737/DAILY-MAIL-COMMENT-Rwanda-rebels-PMs-plan.html",
        "title": "DAILY MAIL COMMENT: Rwanda rebels must now back PM&#39;s plan",
        "description": "The Prime Minister suffered a major rebellion on his Rwanda Bill as around 60 Tory backbenchers - including big beasts - defied him by voting to toughen it up."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/fujitsu-boss-apology-must-not-31898384",
        "title": "Fujitsu boss apology must not be the end of the matter - they must now investigate",
        "description": "The company and anybody at the top who failed to report the &#39;bugs and errors&#39; to the Post Office or colluded in covering them up must, if the errors led to prosecutions, face investigation"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-67993903",
        "title": "Alan Bates attacks &#39;madness&#39; of Post Office compensation delays",
        "description": "The former sub-postmaster, Mr Bates, who came to fame when portrayed in an ITV drama with his name in the title has given evidence to the inquiry into the Post Office scandal. Addressing the Business and Trade Committee, Alan Bates said he was “frustrated to put it mildly” over the lack of financial redress."
    },
    {
        "url": "https://www.ibtimes.co.uk/boris-johnson-joins-tory-rebels-demanding-amendments-rwanda-bill-1722765",
        "title": "Boris Johnson Joins Tory Rebels Demanding Amendments To Rwanda Bill",
        "description": "The bill in its current form is due to be debated and voted on in Parliament today, setting Sunak on a collision course with both factions of his party."
    },
    {
        "url": "https://www.ft.com/content/3b2683ed-355d-45fc-a8b1-4d8c36d31f7a",
        "title": "Labour’s Rachel Reeves prepares for pitch to business in Davos",
        "description": "Shadow chancellor to accuse Tories of presiding over ‘14 years of stagnant growth’ as she courts corporate elite"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-ambitions-not-achievable-without-223000409.html",
        "title": "Labour’s ambitions not achievable without business, Reeves to tell Davos summit",
        "description": "With an election later this year, the visit will be seen as a further sign of Labour’s determination to underline its pro-business credentials under Sir <b>Keir Starmer</b>’s leadership. Speaking on a panel organised by the World Economic Forum on modern ..."
    }
]