[
    {
        "url": "https://news.sky.com/story/labour-considering-ban-on-sale-of-energy-drinks-to-under-16s-13067745",
        "title": "Labour considering ban on sale of energy drinks to under-16s",
        "description": "The proposal has been submitted for the party&#39;s election manifesto, amid growing evidence of the health risks to young people, Sky News understands. The government previously announced a ban in 2019 but it was not implemented."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-election-policies-labour-lite-k6003jsph",
        "title": "The Times view on election policies: Labour Lite",
        "description": "I t is highly likely that Sir Keir Starmer will lead a Labour government with a big majority within a few months. Opinion polls yield a consistent message that the party is about"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/09/rishi-sunak-earned-more-than-22m-last-year/",
        "title": "Rishi Sunak earned more than £2.2m last year",
        "description": "Rishi Sunak earned more than £2.2 million last year and paid an effective tax rate of 23 per cent, according to official accounts released on Friday. Downing Street published the Prime Minister’s tax return which showed that in total he paid just over £500,000 in UK taxes in 2022-23."
    },
    {
        "url": "https://www.channel4.com/news/labour-u-turn-scrapping-green-pledge-about-being-straight-with-voters-starmer-says",
        "title": "Labour U-turn: Scrapping green pledge about ‘being straight’ with voters, <b>Starmer</b> says",
        "description": "Sir Keir Starmer insists he scrapped Labour’s £28bn green spending pledge to be straight with voters. With environmental groups, union allies and some of his own MPs expressing disappointment, senior Labour figures have been out presenting a united front as they defend the move."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rift-for-starmer-and-reeves-things-can-only-get-better-together-jvq39ggh2",
        "title": "Rift? For <b>Starmer</b> and Reeves, things can only get better, together",
        "description": "The Labour leader and his shadow chancellor are desperate to dispel rumours of a row in the wake of their £28bn net-zero reversal. How close are they really?"
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/breaking-paddy-mcguinness-backs-mirror-32091831",
        "title": "Paddy McGuinness backs Mirror campaign to save NHS dentistry after his BBC Question Time appearance",
        "description": "Paddy McGuinness has backed the Mirror&#39;s campaign with The BDA to save NHS dentistry following the Top Gear presenter&#39;s well-received appearance on Question Time"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/keir-starmer-victoria-british-vogue-labour-leader/",
        "title": "‘Who does he think he is?’ – <b>Starmer</b> reveals first conversation with wife in Vogue interview",
        "description": "Sir Keir Starmer has revealed his wife ended their first conversation by snapping “who the f--- does he think he is?” In an interview with British Vogue, the Labour leader said he didn’t have the “best of starts” with his future spouse, Victoria, as he managed to annoy her straight away."
    },
    {
        "url": "https://www.thenational.scot/news/24110560.keir-starmers-4-7-billion-pledge-matches-scotland-spends-alone/",
        "title": "<b>Keir Starmer</b>&#39;s £4.7 billion pledge &#39;matches what Scotland spends alone&#39;",
        "description": "KEIR Starmer has been accused of a “total lack of ambition” after he slashed a pledge of £28 billion in green investment each year to"
    },
    {
        "url": "https://www.thenational.scot/news/24110560.keir-starmers-4-7-billion-pledge-exactly-scotland-spends-alone/",
        "title": "<b>Keir Starmer</b>&#39;s £4.7 billion pledge &#39;exactly Scotland spends alone&#39;",
        "description": "<b>KEIR Starmer</b> has been accused of a “total lack of ambition” after he slashed a pledge of £28 billion in green investment each year to £4.7bn – the same amount as the Scottish Government has allocated in its new Budget. Labour finally confirmed that ..."
    },
    {
        "url": "https://news.sky.com/story/keir-starmer-says-he-wont-make-a-promise-i-cant-keep-as-he-defends-labours-16328bn-green-plan-u-turn-13067469",
        "title": "<b>Keir Starmer</b> says he won&#39;t &#39;make a promise I can&#39;t keep&#39; as he defends Labour&#39;s £28bn green plan U-turn",
        "description": "The Labour leader says that just as the public has had to adjust their plans during the cost of living crisis, so has his party."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-wife-who-think-b2493692.html",
        "title": "‘Who the f**k does he think he is?’: <b>Keir Starmer</b>’s wife’s verdict after they first met’",
        "description": "Keir Starmer ’s wife asked “who the f**k does he think he is?” after their first meeting, the Labour leader has revealed. A former solicitor, Vic, as he calls her, did not take lightly to her future husband grilling her on the accuracy of some documents."
    },
    {
        "url": "https://www.standard.co.uk/comment/keir-starmer-labour-28-billion-clean-energy-scrapped-b1138133.html",
        "title": "<b>Keir Starmer</b> chose the lesser of two evils by ditching his £28bn green target",
        "description": "Something Sir <b>Keir Starmer</b> is understandably keen on replicating. To that end, the Labour leader has finally bitten the bullet and ditched his hitherto flagship green investment pledge. Like a desperate striker trying to gain the referee’s attention ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-rod-stewart-says-labour-182100879.html",
        "title": "Sir Rod Stewart says Labour &#39;deserve a crack&#39; at running the country",
        "description": "The rock legend and long-time Tory voter confirmed a change of tune, in which he said Sir <b>Keir Starmer</b> &quot;deserves a crack&quot; at running the country. Politics Live: Sir Rod Stewart says Labour &#39;deserve a crack&#39; at power &quot;<b>Keir Starmer</b> and Labour deserve a crack ..."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1864935/Brian-May-Carol-Vorderman-tories-instagram?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "Brian May backs Carol Vorderman in campaign against the Tories as he issues urgent plea",
        "description": "The votes will most likely be to determine whether Sunak remains PM or whether Labour leader Sir <b>Keir Starmer</b> will take his place. May re-shared a video from Vorderman, where she made several claims about government “scandals” in association with the ..."
    },
    {
        "url": "https://inews.co.uk/news/keir-starmer-labour-u-turn-28bn-green-pledge-2898320?ico=editors_picks",
        "title": "Sir <b>Keir Starmer</b> under fire over Labour’s U-turn on £28bn green pledge",
        "description": "Sir <b>Keir Starmer</b> has defended Labour’s U-turn on its pledge to spend £28bn a year on green projects, saying he had no choice given the “very broken economy”. The Party has faced criticism from environmental groups, unions and energy industry ..."
    },
    {
        "url": "https://www.vogue.co.uk/article/keir-starmer-british-vogue-interview",
        "title": "Keeping Up With <b>Keir</b>: The Labour Party Leader Shares His Vision For Britain – And Lets Vogue In On The Person Behind The Policies",
        "description": "It feels less like friendly advice, more like a high-stakes warning about how best to interview <b>Keir Starmer</b>, Arsenal fanatic, award-winning human rights barrister, and oh yes, possibly – even quite probably? – the next prime minister of the United ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/sir-rod-stewart-slams-boris-32091616",
        "title": "Sir Rod Stewart slams Boris Johnson dubbing him a &#39;lying public schoolboy&#39;",
        "description": "In an interview with the Times, Sir Rod appeared to cement his recent swing in political support by saying Sir <b>Keir Starmer</b> “should be given a shot” at government. He said: “<b>Keir Starmer</b> and Labour deserve a crack at it. If there was anyone else we ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24110568.rishi-sunak-earned-2-2-million-paid-508-000-tax-documents-show/",
        "title": "Rishi Sunak earned £2.2 million and paid £508,000 in tax, documents show",
        "description": "However, for investors with more typical portfolios it will be a bitter blow.” Labour leader Sir <b>Keir Starmer</b> is expected to follow Mr Sunak’s example by publishing his tax return."
    },
    {
        "url": "https://news.sky.com/story/sir-rod-stewart-says-labour-deserve-a-crack-at-running-the-country-13067683",
        "title": "Sir Rod Stewart says Labour &#39;deserve a crack&#39; at running the country",
        "description": "Rock legend and long-time Tory voter Sir Rod Stewart has thrown his weight behind Sir Keir Starmer&#39;s leadership as he attacked Boris Johnson as a &quot;lying schoolboy&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030",
        "title": "‘Shit politics’ – <b>Starmer</b> allies urge him to get party ready for government",
        "description": "Business leaders sympathetic to Labour are pushing for a change to the party’s investment rules which would make it easier to spend money on projects which will boost long-term growth without breaking the Treasury’s fiscal rules."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/24110792.echo-comment-sunak-starmer-biden-trump/",
        "title": "Echo Comment on Sunak and <b>Starmer</b>, Biden and Trump",
        "description": "IT has been a bad week for both of the leaders of our main political parties, with Keir Starmer performing the mother of all U-turns over"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/ed-miliband-borrowed-time-labour-28bn-green-pledge-u-turn/",
        "title": "Ed Miliband ‘on borrowed time’ after Labour’s £28bn green pledge climbdown",
        "description": "Shadow climate secretary angers backbenchers and activists by backing Sir Keir Starmer’s climbdown on flagship policy"
    },
    {
        "url": "https://www.ft.com/content/83b5bced-fa8b-4624-ba4a-82aaee7420dd",
        "title": "The political love-in with business is long overdue",
        "description": "They follow a period when both political parties viewed business with suspicion — at times with outright hostility. Business then was seen as part of the problem, rather than solution, to economic growth. The inconvenient truth is that they are both."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68251300",
        "title": "Ed Miliband: I didn&#39;t think of quitting over Labour&#39;s green U-turn",
        "description": "Ed Miliband has insisted he did not consider quitting over Labour&#39;s decision to junk its pledge to spend £28bn a year on green projects. Labour&#39;s shadow net zero secretary, a key backer of the policy, said the party&#39;s plans still met his criteria of &quot;moving the dial&quot; on climate change."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/09/junior-doctors-in-england-to-strike-again-after-pay-talks-break-down",
        "title": "Junior doctors in England to strike again after pay talks break down",
        "description": "BMA votes for further four days of action after meeting with health secretary, fails to resolve grievances"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-gaza-muslim-labour-benjamin-netanyahu-b1138237.html",
        "title": "Labour has seen ‘loss of trust’ among Muslim voters over Gaza – shadow minister",
        "description": "Shabana Mahmood, one of the most senior Muslim MPs, defended her party’s position. Labour’s shadow justice secretary said there had been a “sense of a loss of trust” in the Muslim community over the party’s stance on the conflict in Gaza."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066809/Ed-Miliband-insists-DIDNT-consider-quitting-Labours-green-U-turn-Keir-Starmer-Rachel-Reeves-junk-28bn-spending-plans-plunge-party-chaos.html",
        "title": "Ed Miliband insists he DIDN&#39;T consider quitting over Labour&#39;s green U-turn after <b>Keir Starmer</b> and Rachel Reeves junk £28bn spending plans to plunge party into chaos",
        "description": "The shadow climate secretary was thought to be on resignation watch as Labour leader Sir <b>Keir Starmer</b> and shadow chancellor Rachel Reeves scrapped the pledge. Mr Miliband, a former Labour leader himself, was said to have argued strongly for sticking with ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/c101qd4952vo",
        "title": "<b>Starmer</b> pledges West Midlands gigafactory",
        "description": "Sir Keir Starmer said Labour would build a gigafactory in the West Midlands, if the party wins the next general election. Speaking on a visit to Coventry a day after insisting he had no choice but to ditch Labour&#39;s £28bn-a-year green investment pledge, he said one of eight new gigafactories in his scaled back proposals would be in the region."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=most_popular",
        "title": "‘S**t politics’: <b>Starmer</b> urged to get his act together after green U-turn",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being straight” after he scaled back a £28bn-a-year green investment pledge to less than £5bn."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-wife-vogue-magazine-photo-shoot-edition-w277xgw3p",
        "title": "<b>Keir Starmer</b> tells Vogue of ‘sassy’ wife’s first impression of him",
        "description": "Sir <b>Keir Starmer</b>’s first conversation with his future wife, Victoria, ended with her telling a colleague: “Who the f*** does he think he is?” The Labour leader explained that the woman he would later marry was working as a solicitor when he picked up ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/pressure-growing-starmer-scrap-two-child-limit",
        "title": "Pressure growing on Sir <b>Keir</b> to scrap two-child limit under Labour government",
        "description": "PRESSURE is growing on Sir Keir Starmer to commit to scrapping the two-child limit under a Labour government amid ongoing criticism of its recent green pledge U-turn."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/coventry-news/keir-starmer-visits-coventry-labour-28605116",
        "title": "<b>Keir Starmer</b> visits Coventry as Labour say they&#39;re &#39;still committed&#39; to funding gigafactory in the West Midlands",
        "description": "The West Midlands &quot;will get a gigafactory&quot; if Labour wins power, the shadow chancellor has claimed. Funding pledged for the scheme by the party last year has not been hit by it ditching a flagship £28bn-a-year investment target for green projects, Rachel Reeves said today (9 February.)"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rachel-reeves-asked-why-anyone-should-believe-the-things-you-say-after-green-u-turn_uk_65c5ef4de4b093b2e78339d2?d_id=7282898&ncid_tag=fcbklnkukhpmg00000008",
        "title": "Rachel Reeves Asked Why &#39;Anyone Should Believe The Things You Say&#39; After Green U-Turn",
        "description": "<b>Keir Starmer</b> and Reeves yesterday confirmed they were ditching Labour’s £28bn a year green investment pledge. Instead the commitments has been slashed to just under £5bn a year during Labour’s first term of government. The Labour leader and shadow ..."
    },
    {
        "url": "https://www.ft.com/content/f156f951-cad6-4b48-ad83-c734140766cd",
        "title": "Transcript: Will Labour’s green U-turn weaken <b>Starmer</b>?",
        "description": "And also, we’re really interested to hear from you why now? You’ve joked about the need to update the list of <b>Keir Starmer</b>’s U-turns as leader of the Labour party. But actually, this is quite serious, isn’t it? Jim Pickard There have been an awful ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/09/labour-u-turn-keir-starmer-rachel-reeves-rishi-sunak-tory-conservatives-latest-politics-news-updates?filterKeyEvents=false&page=with:block-65c6577e8f089ae115b48ef5",
        "title": "Kemi Badenoch says death threats have ‘intensified’ since publication of Nadine Dorries book – as it happened",
        "description": "<b>Keir Starmer</b> said he believes the British public “appreciate” Labour being “straight” about its plans for the economy, after the party announced a major U-turn on its green spending pledge. Rishi Sunak again refused to apologise for his transgender ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-urged-listen-gordon-123641982.html",
        "title": "<b>Keir Starmer</b> urged to &#39;listen to Gordon Brown&#39; and scrap two-child benefit cap",
        "description": "KEIR Starmer is facing renewed pressure to commit to removing the two-child cap on benefits after Gordon Brown suggested it should be reviewed"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68247994.amp",
        "title": "<b>Keir Starmer</b>: The politics of a U-turn",
        "description": "In removing one of its promises, Labour has removed one of its political opponents&#39; targets, writes Political Editor Chris Mason."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13063431/Keir-Starmer-ditches-28bn-green-policy-just-48-hours-insisting-desperately-needed.html",
        "title": "Can you ever believe a word Sir U-turn says? <b>Keir Starmer</b> ditches £28bn-a-year green policy just 48 hours after insisting it was &#39;desperately needed&#39; as Labour MPs warn move ...",
        "description": "The policy flip-flop triggered a backlash, with Labour MPs warning it would leave voters asking &#39;what, if anything, our party stands for&#39;."
    },
    {
        "url": "https://morningstaronline.co.uk/article/steelworkers-welcome-labour-party-promise-to-invest-3bn-in-industy",
        "title": "Steelworkers welcome Labour Party promise to invest £3bn in industy",
        "description": "“Sir <b>Keir Starmer</b> contacted me to assure that it would be delivered within the first parliament of a Labour government.” Earlier in the week, the Welsh Senedd voted unanimously to back the steel industry in South Wales, including the Welsh Conservative"
    },
    {
        "url": "https://www.voice-online.co.uk/news/uk-news/2024/02/09/labours-race-equality-act-unveiled-after-black-campaigners-exclusion-controversy/",
        "title": "Labour’s Race Equality Act unveiled after Black campaigners’ exclusion controversy",
        "description": "Labour’s plans for a new Race Equality Act were launched by party leader Sir <b>Keir Starmer</b> back in 2020. However, the party has faced faces scrutiny over delays in announcing it prompting concerns over <b>Starmer</b>’s and the party’s commitment to tackling ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25819484/sun-says-keir-starmer-eco-u-turn/?mibextid=K35XfP",
        "title": "How can the public trust spineless <b>Keir Starmer</b> after dozens of cynical U-turns?",
        "description": "IN a political career marked by cynical U-turns, this is <b>Keir Starmer</b>’s most ­staggering. His flagship £28billion-a-year eco plan always looked a bloated fantasy even as he talked it up again and again. Labour, as many in the party admit, had no other ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-mp-laura-trott-skewered-32082113.amp",
        "title": "Tory MP Laura Trott skewered over party&#39;s U-turns in excruciating 60-second take down",
        "description": "Chief Secretary to the Treasury Laura Trott went on BBC Radio 4 to gloat about <b>Keir Starmer</b>&#39;s change to his green investment plan, but faced a bruising grilling from Evan Davies Laura Trott has become one of the Government&#39;s most high profile ministers ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-blames-tories-wrecking-32080988?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Keir Starmer</b> blames Tories for wrecking economy as Labour ditches £28billion green pledge",
        "description": "<b>Keir Starmer</b> blamed the Tories for wrecking the economy as he finally ditched his plan to spend £28billion-a-year on green investment. The Labour leader said the promised figure was &quot;stood down&quot; because interest rates have soared after the damage ..."
    }
]