[
    {
        "url": "https://www.itv.com/news/anglia/2023-12-19/why-sunaks-latest-by-election-test-could-be-a-problem-for-labour",
        "title": "Why the by-election for Peter Bone&#39;s Wellingborough seat could actually present a problem for Labour",
        "description": "The Conservatives may have had a bad run in recent by-elections, but David Wood believes Labour will have to fight hard to overturn a chunky majority. | ITV News Anglia"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-baroness-mone-ppe-labour-government-pandemic-transparency-12593360?postid=6947200",
        "title": "Politics latest: Shadow health secretary questioned on NHS on eve of junior doctors&#39; strikes | Sophy Ridge live",
        "description": "They also discuss how Labour leader Sir <b>Keir Starmer</b> has been setting himself up for a general election next year. Also in this series, Niall will look at international affairs, the economy, science and tech, and the Royal Family. Teachers in England have ..."
    },
    {
        "url": "https://uk.news.yahoo.com/former-labour-prime-ministers-join-192553218.html",
        "title": "Former Labour prime ministers join <b>Keir Starmer</b> at Alistair Darling’s funeral",
        "description": "Current Labour leader Sir Keir Starmer and former prime ministers Tony Blair and Gordon Brown attended Alistair Darling&#39;s memorial service in Edinburgh on Tuesday 19 December. Lord Darling died on 30 November at the age of 70 from cancer."
    },
    {
        "url": "https://www.thenational.scot/politics/24001322.michelle-mone-scandal-uncovers-new-depths-tory-duplicity/",
        "title": "Michelle Mone scandal uncovers new depths of Tory duplicity",
        "description": "Far right Canadian academic Jordan Peterson has penned an opinion piece for the Telegraph in which he warns that if <b>Keir Starmer</b> wins the next general election, he will turn Britain into Venezuela. For the likes of Peterson, anyone even marginally to the ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847373/Keir-Starmer-tax-rise-fears",
        "title": "<b>Keir Starmer</b> will hike taxes if he wins power - just look at what&#39;s happened in Wales",
        "description": "Senior minister Laura Trott warns: &quot;Labour in Wales have today done what Labour always do in power - raised taxes.&quot;"
    },
    {
        "url": "https://betting.betfair.com/politics/uk-politics/next-general-election-odds---michelle-mone-killing-tory-chances-191223-171.html",
        "title": "UK Politics: Michelle Mone could hammer the final into the Tory coffin",
        "description": "With the Tories at rock-bottom going into an election year, politics betting expert Paul Krishnamurty says the PPE scandal could deal a mortal blow"
    },
    {
        "url": "https://socialistworker.co.uk/news/us-guts-un-resolution-as-palestinian-death-toll-exceeds-20000/",
        "title": "US guts UN resolution as Palestinian death-toll exceeds 20,000",
        "description": "The Gaza health ministry said on Tuesday that Israeli troops have killed at least 19,453 Palestinians since 7 October and injured at least 52,286 people, Nearly 8,000 people are missing, many of them buried beneath the rubble of their homes, schools and hospitals."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/baroness-michelle-mone-ppe-scandal-b2466673.html",
        "title": "Could Baroness Mone lose her title and be removed from the House of Lords?",
        "description": "Calls have been made to strip Michelle Mone of her peerage after she admitted to lying about a PPE controversy. But how easy is it to remove a peer’s title and expel them from the House of Lords? Sean O’Grady"
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/23996729.letter-im-writing-show-support-proportional-representation/",
        "title": "Letter: &#39;I&#39;m writing to show support for Proportional Representation&#39;",
        "description": "I am writing to express my strong support for Proportional Representation in UK general elections. Our current First Past the Post system results"
    },
    {
        "url": "https://morningstaronline.co.uk/article/lingerie-millionaire-lady-mone-attacks-ministers-over-ppe-deals-keeping-spotlight-on-tory-sleaze",
        "title": "Lingerie millionaire Lady Mone attacks ministers over PPE deals, keeping spotlight on Tory sleaze",
        "description": "LINGERIE millionaire Michelle Mone kept the spotlight on Tory sleaze today as she stepped up her attack on government ministers."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/19/tuesday-evening-news-briefing-no-date-for-stopping-boats/",
        "title": "Tuesday evening news briefing: No &#39;firm date&#39; for stopping the boats, says Sunak",
        "description": "Good evening. Rishi Sunak said there was not a “firm date” for delivering on his pledge to stop small boat Channel crossings when giving evidence to the Liaison Committee this afternoon. Elsewhere, Liz Truss has warned that trans activists will “exploit loopholes” in new guidance for schools."
    },
    {
        "url": "https://www.middleeasteye.net/news/labour-muslim-network-pressures-keir-starmer-cut-ties-israeli-ambassador",
        "title": "UK: Labour Muslim Network pressures <b>Starmer</b> to cut ties with Israeli ambassador",
        "description": "Starmer urged to take &#39;no further engagements&#39; with Tzipi Hotovely, after she said her country would not accept a two-state solution when the war in Gaza ends"
    },
    {
        "url": "https://www.scotsman.com/news/politics/alistair-darling-memorial-tributes-paid-to-chancellor-campaigner-family-man-and-tractor-enthusiast-4451764",
        "title": "Alistair Darling memorial: Tributes paid to chancellor, campaigner, family man and tractor enthusiast",
        "description": "Alistair Darling returned to politics to lead the Better Together campaign in the Scottish independence referendum in 2014"
    },
    {
        "url": "https://www.thenational.scot/news/24000257.labour-grandees-mourn-alistair-darlings-memorial-edinburgh/",
        "title": "Labour grandees mourn at Alistair Darling&#39;s memorial in Edinburgh",
        "description": "POLITICIANS from across the spectrum came together to remember the life of former chancellor Alistair Darling, at a service which contained"
    },
    {
        "url": "https://www.nfuonline.com/updates-and-information/shadow-defra-secretary-on-farm/",
        "title": "Labour sets out vision for farming on visit to NFU President’s farm",
        "description": "Fairness in the supply chain, the Agricultural Transition Plan, right to roam and bovine TB were high on the agenda during Shadow Defra Secretary Steve Reed’s visit to NFU President Minette Batter’s farm."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-muslim-network-call-for-keir-starmer-to-shun-israel-ambassador-tzipi-hotovely",
        "title": "<b>Keir Starmer</b> Urged To Distance Labour From &quot;Islamophobic&quot; Israeli Ambassador",
        "description": "The Labour Muslim Network has written to Labour leader Keir Starmer warning that representatives of the party should not share a platform with"
    },
    {
        "url": "https://www.independent.co.uk/voices/rishi-sunak-tory-election-win-b2466637.html",
        "title": "Rishi Sunak is the one Tory who still thinks he can win",
        "description": "The prime minister was determined to fight for every point when grilled by MPs, writes John Rentoul. And at the No 10 Christmas reception last night there was – perhaps – a slip of when in 2024 the election might"
    },
    {
        "url": "https://news.stv.tv/politics/tributes-paid-in-song-prayer-and-words-to-former-chancellor-alistair-darling-in-edinburgh-following-death",
        "title": "Tributes in prayer and song from across political divide for Darling",
        "description": "Former prime ministers Sir Tony Blair and Gordon Brown were present along with Labour leader Sir <b>Keir Starmer</b> and the First Minister Humza Yousaf. The service was a mix of hymns, readings and eulogies which all came together to evocatively recall the life ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/19/labour-muslims-urge-starmer-to-boycott-extremist-israeli-am/",
        "title": "Labour Muslims urge <b>Starmer</b> to boycott ‘extremist’ Israeli ambassador",
        "description": "The Labour Muslim Network wrote to the party’s leader saying that he and other senior figures must not share a platform with Tzipi Hotovely"
    },
    {
        "url": "https://www.mortgagestrategy.co.uk/news/gove-threatens-to-take-housing-control-out-of-mayor-of-londons-hands/",
        "title": "Gove threatens to take housing control out of Mayor of London’s hands",
        "description": "Housing secretary Michael Gove has written to the Mayor of London Sadiq Khan threatening to take housing policy out of his hands, because “housing delivery in London is far below the levels needed “."
    },
    {
        "url": "https://www.itv.com/news/2023-12-19/how-will-goves-housing-reforms-influence-the-general-election",
        "title": "What are Gove’s planning reforms and how will housing influence the general election?",
        "description": "The Housing Secretary set out reforms that aim to balance between speeding up the planning process and ensuring communities approve of proposed development. | ITV National News"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/alistair-darling-memorial-service-mourners-keir-starmer-rachel-reeves-jk-rowling-tony-blair-b1127986.html",
        "title": "Tony Blair and JK Rowling among mourners at Alistair Darling&#39;s memorial service",
        "description": "Former chancellor hailed as &#39;man of great integrity&#39; as politicians from across the political spectrum gathered to pay their respects"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/19/senior-figures-from-across-uk-politics-gather-to-remember-alistair-darling?ref=biztoc.com",
        "title": "Senior figures from across UK politics gather to remember Alistair Darling",
        "description": "Edinburgh memorial service pays tribute to former chancellor for his ‘decency, honesty and shrewd judgement’"
    },
    {
        "url": "https://news.sky.com/story/alistair-darling-memorial-tony-blair-jk-rowling-and-sir-keir-starmer-among-mourners-at-edinburgh-service-13034049?dcmp=snt-sf-twitter",
        "title": "Alistair Darling memorial: Tony Blair, JK Rowling and Sir <b>Keir Starmer</b> among mourners at Edinburgh service",
        "description": "Former Labour chancellor Alistair Darling has been remembered at a public memorial service in Edinburgh, attended by the likes of Tony Blair, Sir <b>Keir Starmer</b> and author JK Rowling. The Labour leaders past and present were joined by colleagues including Mr ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/23999781.tributes-alistair-darling-memorial-service/?ref=rss",
        "title": "Tributes to Alistair Darling at memorial service",
        "description": "Former prime ministers Tony Blair and Gordon Brown, as well as current Labour leader, Sir <b>Keir Starmer</b> as well as First Minister Humza Yousaf were among those gathered in St Mary&#39;s Episcopal Cathedral. Lord Darling died last month at the age of 70 ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-urged-snub-israeli-083900034.html",
        "title": "<b>Keir Starmer</b> urged to snub Israeli ambassador over &#39;Islamophobic&#39; rejection of two-state solution",
        "description": "Sir Keir Starmer is under pressure to cut ties with Israel&#39;s ambassador to the UK after she said her country would not accept a two-state solution when the war in Gaza ends, Sky News can reveal. The Labour Muslim Network,"
    }
]