[
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/16/keir-starmer-represented-extremist-islamist-group/",
        "title": "<b>Starmer</b> acted for extremist Islamist group in bid to overturn ban",
        "description": "Sir Keir Starmer acted on behalf of an extremist Islamist group seeking to overturn a ban imposed on its activities in Germany, The Sunday Telegraph can disclose. The Labour leader led a team of lawyers claiming that Berlin’s prohibition of Hizb ut-Tahrir breached the group’s rights to freedom of religion and expression."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/scottish-news/11668168/snp-bosses-fear-lose-safest-seat-nightmare-poll/",
        "title": "SNP bosses fear they could lose their safest seat after nightmare poll predicts huge swing to Labour",
        "description": "SNP chiefs fear they could lose the seat where they bagged their biggest majority at the 2019 General Election, it emerged yesterday. The Nats have done polling in constituencies including"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/16/labour-lead-slips-to-13-points-poll-nhs-priority-sunak-rwanda",
        "title": "Labour lead slips to 13 points in poll that shows NHS is voters’ main priority",
        "description": "Sunak’s approval increases slightly after surviving potential rebellion over Rwanda bill"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872193/Sir-tony-blair-david-cameron-speculation-keir-starmer-lord-labour-cabinet.html",
        "title": "Sir Tony Blair says he has no interest in &#39;doing a Cameron&#39; amid speculation <b>Keir Starmer</b> could make him a Lord and bring him back to Labour cabinet",
        "description": "David Cameron made a shock return to politics as the new Foreign Secretary last month, displacing James Cleverly who has since taken over in the Home Office"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/16/minister-warns-rishi-sunak-labour-outflanking-tories/",
        "title": "Minister warns Rishi Sunak that Labour is outflanking Tories on the Right",
        "description": "Private paper co-written by Steve Baker details in stark terms the threat that Conservatives face from Sir Keir Starmer"
    },
    {
        "url": "https://www.theguardian.com/media/2023/dec/16/labour-backs-away-press-reforms-after-prince-harry-phone-hacking-victory?ref=biztoc.com",
        "title": "Labour backs away from press reforms after Prince Harry’s phone-hacking court victory",
        "description": "The party has made it clear that Keir Starmer had no intention of reviving the second stage of the Leveson inquiry"
    },
    {
        "url": "https://www.thesun.co.uk/news/25077801/iain-duncan-smith-there-is-no-love-for-starmer/",
        "title": "There is no love out there for Sir <b>Keir Starmer</b>",
        "description": "CHRISTMAS is fast approaching and Conservative MPs are getting ready to head home to be with their families. Yet in the dark recesses of their minds, they know that the sand in the re-election"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-sussex-67737630",
        "title": "Seventh Hastings councillor quits Labour to join new group",
        "description": "A seventh councillor on Hastings Borough Council has resigned from Labour and joined an independent group. Nigel Sinden said he had followed council leader Paul Barnett and five others so he could &quot;speak up&quot; for the residents of his Silverhill ward."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/23994755.jeremy-corbyn-attends-oxford-pro-palestine-rally-hundreds-gather/",
        "title": "Jeremy Corbyn attends Oxford pro-Palestine rally as hundreds gather",
        "description": "Former Labour leader Jeremy Corbyn addressed a crowd of hundreds which marched through Oxford to call for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/thousands-protest-for-palestine-across-britain/",
        "title": "Thousands protest for Palestine across Britain",
        "description": "Protests for Palestine on Saturday were full of rage over Israeli crimes. But most were the smallest ones since 7 October"
    },
    {
        "url": "https://www.thesun.co.uk/news/25076530/keir-starmer-accused-of-plotting-lib-dem-pact/",
        "title": "<b>Keir Starmer</b> accused of plotting Lib Dem pact as list reveals low priority seats",
        "description": "KEIR Starmer is accused of plotting a pact with the Lib Dems as documents suggest he will leave swathes of the Blue Wall for them to fight. A list of Labour’s low priority election seats has been"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-london-67737070.amp",
        "title": "Enfield: Three sought over Israel-Gaza graffiti on MP&#39;s office",
        "description": "Three men are being sought by police in connection with graffiti about the Israel-Gaza conflict which was sprayed on an MP&#39;s constituency office. Shutters at Enfield North MP Feryal Clark&#39;s office on Hertford Road were defaced at about 23:05 GMT on 21 November, the Met Police said."
    },
    {
        "url": "https://www.independent.co.uk/voices/labour-peter-mandelson-memorial-predictions-starmer-b2465244.html",
        "title": "My crystal ball predicts one piece of bad news for Labour next year",
        "description": "Sir Keir Starmer will almost certainly win next year’s general election but there is still trouble in store for the Labour leader – not least with what to do about Ed Miliband"
    },
    {
        "url": "https://www.bbc.com/news/uk-67736528.amp",
        "title": "Steve Coogan: Prince Harry&#39;s hacking case is &#39;start of something&#39;",
        "description": "A High Court ruling that Prince Harry&#39;s phone had been hacked by Mirror Group Newspapers (MGN) is the &quot;start of something&quot;, actor Steve Coogan said. Coogan said the ruling exposed &quot;widespread contempt&quot; by newspaper editors for the Leveson Inquiry, which looked at the ethics of the press."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67737116?at_campaign=KARANGA&at_medium=RSS",
        "title": "Laura Kuenssberg: Five facts from a political year of gains and losses",
        "description": "In their first TV interview in more than two years, Baroness Mone and her husband Doug Barrowman, will be on the show. They were accused of making millions from PPE during the pandemic and covering it up. They say they want to clear their name, but what do they have to say?"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-tory-campaign-questionnaire-b2464963.html",
        "title": "Rishi Sunak accused of misleading public over Tory campaign questionnaire landing on doorsteps",
        "description": "The leaflets, branded potentially misleading and “routine party propaganda”, ask who voters backed at the last election and who they would prefer as prime minister – Mr Sunak or Sir Keir Starmer. It is delivered alongside a letter headed “Rishi Sunak Prime Minister”, which twice asks: “What are your priorities for Britain? Tell the prime minister”."
    },
    {
        "url": "https://www.cityam.com/labours-28bn-growth-plan-would-see-tax-rises-treasury-minister-argues/",
        "title": "Labour’s £28bn growth plan would see tax rises, Treasury minister argues",
        "description": "Labour’s plans to borrow £28bn to invest in decarbonisation would lead to tax rises, the chief secretary to the Treasury has argued."
    },
    {
        "url": "https://metro.co.uk/2023/12/16/couldnt-wait-first-date-said-packed-a-bag-19797154/?ico=tag-post-strip_item_1_lifestyle",
        "title": "I couldn’t wait for our first date – until he said he’d packed a bag",
        "description": "‘Me?’ I gasped. ‘You’re the one who packed the overnight bag!’ Jeremy frowned. ‘I packed a change of clothes so that I could be fresh to meet you after work.’ I suddenly realised my mistake and started laughing. ‘So you weren’t expecting sex today after all?’"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1846287/Beachcomber-Michael-Gove",
        "title": "Michael Gove finally comes clean over role with secretive Remainer group",
        "description": "While Westminster&#39;s Christmas drinks season may not be providing much gossip, the Government&#39;s recent &#39;take out the trash&#39; day proved a treasure"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1845992/poll-best-tory-prime-minister",
        "title": "POLL: Who is the best Tory Prime Minister? Vote here",
        "description": "Sir Anthony Eden (1955-1957) - Credited as being a great Foreign Secretary and Churchill&#39;s right-hand man, he is best remembered for the Suez crisis which saw Britain&#39;s influence drop in the world and led to him being replaced as Tory leader and PM while away recovering from health issues."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/23993784.mp-judith-cummins-anti-social-fireworks-spiking/",
        "title": "MP Judith Cummins on anti-social fireworks and spiking",
        "description": "In this week&#39;s MP&#39;s column, Bradford South MP Judith Cummins discusses the anti-social use of fireworks and spiking."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/23993434.oxford-pupils-stage-protest-teachers-alleged-cut/",
        "title": "Oxford pupils stage protest over teacher&#39;s alleged cut",
        "description": "Dozens of pupils rallied behind their school gates today in a classroom protest staged against the school’s reported suspension of a"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23993710.policing-cant-done-cheap-get-bobbies-back-beat/",
        "title": "Policing can&#39;t be done on the cheap. Get bobbies back on the beat",
        "description": "I WAS not surprised to learn that Police Scotland proposes to close 29 police stations in an effort to save money. Since Police Scotland"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23992659.independence-devolution---tensions-within-united-kingdom/",
        "title": "Independence, devolution – and the tensions within this United Kingdom",
        "description": "Against that, a political calculation that Sir <b>Keir Starmer</b>’s focus would not be primarily or even substantively upon Scottish matters. That it might, indeed, be in his interests to assuage England rather than Scotland. Truly, uncertain times."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-headache-soon-starmer-nightmare-060000903.html",
        "title": "Rishi’s headache will soon be <b>Starmer</b>’s nightmare",
        "description": "It’s no secret that the Labour Party is revelling in the revival of Tory “psychodrama”. They’ve admitted as much."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/opinion/columnists/voters-care-about-opportunity-not-pathetic-division-politics-and-culture-wars-justine-greening-4445775",
        "title": "Voters care about opportunity, not pathetic division politics and culture wars - Justine Greening",
        "description": "Of course, that is something that the Opposition Labour Party now understands. The more Sir <b>Keir Starmer</b> has talked about ‘breaking down barriers’ to opportunity, the better he has done in the opinion polls. And behind all of this is a reality - the ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/4f776e6c-5cdc-4764-8248-d41928f7c56a?shareToken=5922d5a073e4f59d19019198b2e22280",
        "title": "Rishi Sunak’s general election campaign will be trial for <b>Starmer</b>",
        "description": "With Labour’s lead in the polls refusing to budge, the prime minister has no choice but to take risks in the hope that something sticks"
    },
    {
        "url": "https://morningstaronline.co.uk/article/safe-passage-for-refugees-is-vital",
        "title": "Safe passage for refugees is vital",
        "description": "This week has once again reminded us of the importance of building opposition to the Tories’ racist offensive, writes Stand Up to Racism’s SAMIRA ALI ahead of Monday’s demo"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12870515/DAILY-MAIL-COMMENT-Starmer-lets-slip-true-colours.html",
        "title": "DAILY MAIL COMMENT: Shifty <b>Starmer</b> lets slip his true colours",
        "description": "On the economy, health and much else, there is a gaping void. Yesterday, however, the mask slipped and we got a chilling glimpse of life under a Labour government."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/broken-britain-lost-essential-services-31667904.amp",
        "title": "EXCLUSIVE: &#39;Broken Britain&#39; of lost essential services revealed - how does your area fare?",
        "description": "It reveals the profound gaps where 2019 promises have failed our hardest hit communities. <b>Keir Starmer</b>&#39;s speech [on Monday] makes clear Labour understands the magnitude of the challenge. That will need to be matched by painstaking work needed to develop an ..."
    },
    {
        "url": "https://news.sky.com/story/carbon-offsetting-sounds-attractive-but-its-an-expensive-prospect-13031120",
        "title": "Carbon offsetting sounds attractive - but it&#39;s an expensive prospect",
        "description": "While carbon offsetting can help cut costs, one of the criticisms of the system is it allows companies that pollute to continue belching out greenhouse gases at a cost they can seemingly afford."
    },
    {
        "url": "https://www.aol.com/news/laura-kuenssberg-end-113652040.html",
        "title": "Laura Kuenssberg: end of year",
        "description": "Rishi Sunak&#39;s hoped for turnaround didn&#39;t happen. Despite several restarts, refreshes, reboots, promises of the &#39;real Rishi&#39; coming out, the prime minister has not been able to shake his party out of the doldrums in the polls."
    }
]