[
    {
        "url": "https://www.dailymail.co.uk/debate/article-13129205/ALEX-BRUMMER-builders-young-Britons-housing-ladder.html",
        "title": "ALEX BRUMMER: It is unforgivable if the builders&#39; dark arts have stopped young Britons getting on the housing ladder",
        "description": "At a time when the lack of affordability has pushed up the average age of a first-time buyer from 30 in 2007 to 34, such behaviour must be regarded as unconscionable."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/social-media-platforms-must-pursue-32218484",
        "title": "&#39;Social media platforms must pursue blackmailers who target kids online&#39;",
        "description": "Criminals who sexually blackmail children online should be held accountable and be forced to close down by Facebook, Google, TikTok, WhatsApp, Snapchat and Instagram"
    },
    {
        "url": "https://schoolsweek.co.uk/labours-school-improvement-teams-will-deliver-misogyny-training/",
        "title": "Labour’s school improvement teams will deliver misogyny training",
        "description": "Leader Sir <b>Keir Starmer</b> had already pledged to introduce more digital skills to the curriculum. And there are already elements of digital literacy in the national curriculum for computing. It states that at key stage 1, children should be taught to “use ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26197981/extra-cash-for-mps-security/",
        "title": "Millions will be spent on personal bodyguards for MPs and home security upgrades within days after threats",
        "description": "Meanwhile Labour’s Chris Bryant admitted Labour used “grubby” tactics to buy time for Sir <b>Keir Starmer</b> to convince Hoyle to break Commons convention last week. And he told Channel 4 he was in part “put up” to the ruse - sparking calls for an ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13128259/nottingham-stabbings-valdo-calocane-sentence-review.html",
        "title": "We will not be silenced: Families of Nottingham stab victims slam police handling of the case and &#39;ongoing mismanagement&#39; ahead of triple-killer Valdo Calocane&#39;s sentence review",
        "description": "<b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers.&#39; A special constable who viewed footage from the scene was sacked in December while police constable Matthew Gell was given a final written warning after a misconduct hearing in ..."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7293183",
        "title": "Politics latest: Islamophobia row deepens for Sunak as MP criticised over claims of &#39;Muslim no-go areas&#39;",
        "description": "Steve Rotherham, the mayor for the Liverpool City Region, said he will continue to hold Sir <b>Keir Starmer</b> to account should he become prime minister. Asked if he would be in Sir <b>Keir</b>&#39;s ear over levelling up the north, Mr Rotherham said: &quot;Yes, why wouldn&#39;t ..."
    },
    {
        "url": "https://www.telegraph.co.uk/films/2024/02/26/keir-starmer-hampstead-teacher-bridget-jones-mad-about-boy/",
        "title": "From a Hampstead teacher to... <b>Keir Starmer</b>? Who’s who in the real-life Bridget Jones",
        "description": "Sir <b>Keir Starmer</b> has long been rumoured to be the inspiration for Mark Darcy, played by Colin Firth (right) Credit: Everett Collection / Rex Features In fact (spoiler alert!) Mad About the Boy begins four years after Mark Darcy’s tragic death ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/26/nothing-to-see-here-tories-30p-lee-islamophobia",
        "title": "Nothing to see here, say Tories of their hero, 30p Lee",
        "description": "Even Rish! has tied himself in knots trying to work out what Anderson should apologise for. Because Lee’s not racist or Islamophobic, is he?"
    },
    {
        "url": "https://uk.yahoo.com/news/rishi-sunak-squirms-lee-anderson-181124203.html",
        "title": "Rishi Sunak squirms as Lee Anderson doubles down on Islamophobic rant",
        "description": "Sir Keir Starmer said Mr Sunak is ‘too weak’ to condemn the former Tory deputy chairman’s anti-Muslim rant as racist"
    },
    {
        "url": "https://www.heraldscotland.com/politics/holyrood/24144297.lindsay-hoyle-right-fear---islamists-not-cause/?ref=rss",
        "title": "Lindsay Hoyle is right about fear - but Islamists are not the cause",
        "description": "Mr Sweeney has backed his staff, insisting they were genuinely afraid and the sense of threat was real. Protest is beautiful and the right to it must be sacrosanct but it speaks volumes - not least due to the frenzy created by Lindsay Hoyle&#39;s decision in parliament last week - that political staffers feel such disquiet in their workplace."
    },
    {
        "url": "https://www.itv.com/news/2024-02-26/sunak-facing-calls-to-address-lee-andersons-remarks-amid-islamophobia-row",
        "title": "PM: &#39;I don&#39;t believe Lee is a racist person, but the comments were wrong&#39;",
        "description": "&quot;What this man said was racist, Islamophobic and anti-Muslim&quot;, he said. Labour leader Sir <b>Keir Starmer</b> said: &quot;Islamophobia is something which should be called out by every political leader, and the prime minister isn&#39;t calling it out, because he&#39;s too weak&quot;."
    },
    {
        "url": "https://feweek.co.uk/labours-growth-and-skills-levy-wont-devalue-apprenticeships-malhotra-claims/",
        "title": "Labour’s ‘growth and skills levy’ won’t devalue apprenticeships, Malhotra claims",
        "description": "Labour leader Sir <b>Keir Starmer</b> has announced his intention to reform the apprenticeship levy so that it can be spent on other types of training if the party comes into power. The “growth and skills levy” would allow businesses to use 50 per cent of ..."
    },
    {
        "url": "https://www.thenational.scot/news/24145894.jackie-baillie-attacks-humza-yousaf-labour-traitors-front-page/",
        "title": "Jackie Baillie attacks Humza Yousaf over &#39;Labour Traitors&#39; front page",
        "description": "SCOTTISH Labour have accused Humza Yousaf of “dangerous and inflammatory rhetoric” after he shared a front page from the Press and Journal"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1871024/lee-anderson-twitter-tory-suspension",
        "title": "Lee Anderson posts cheeky 11-word message from the pub teasing &#39;long week ahead&#39;",
        "description": "Lee Anderson has continued to make light of his suspension from the Conservative Party in a new post from the pub as he teased a &quot;long week&quot; ahead. The MP for Ashfield had the Tory whip removed for spouting &quot;anti-Muslim hatred&quot; after he claimed the Mayor of London was controlled by Islamists."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1871008/Lee-Anderson-Conservatives-Sadiq-Khan-Rishi-Sunak",
        "title": "Tories call for Lee Anderson to be given the whip back after race row",
        "description": "“It really is time for those in Westminster to stop the nonsense slurs and experience the real world.” Labour’s Sir <b>Keir Starmer</b> Mr Anderson’s comments were “straightforward” Islamophobia and the Prime Minister “should call it out for what it ..."
    },
    {
        "url": "https://www.qmul.ac.uk/media/news/2024/hss/opinion-the-fading-promises-of-cop28.html",
        "title": "OPINION: The fading promises of COP28",
        "description": "but they fear may hit them too hard in the pocket – one reason why <b>Keir Starmer</b>’s opposition Labour Party seems to have joined Rishi Sunak’s Conservative government in scaling back its green commitments. Some of our Queen Mary academics who travelled ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24145872.young-scots-pay-tuition-fees-didnt/",
        "title": "Why should young Scots pay tuition fees when we didn’t have to?",
        "description": "READ MORE: Humza Yousaf hits out at <b>Keir Starmer</b> ahead of pro-EU campaign day I’m still in touch with some friends from those days – living cheek by jowl in a new city is a bonding experience, after all. Someone from Maclay Halls I bump into from time ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/lee-anderson-facing-end-of-tory-career-over-islamophobia-row-2927662?ico=more_from_this_author",
        "title": "Lee Anderson facing end of Tory career over Islamophobia row",
        "description": "Sir <b>Keir Starmer</b> said the Tory leader “lacks the backbone to call this out for what it is”. And Mr Khan said the Prime Minister’s refusal to call Anderson’s remarks Islamophobic “speaks volumes”. The Labour Mayor wrote in the Evening Standard ..."
    },
    {
        "url": "https://www.opendemocracy.net/en/home-office-islamophobia-antisemitism-suella-braverman-lee-anderson/",
        "title": "Home Office ‘did not discuss’ Islamophobia risk in wake of Hamas attacks",
        "description": "Government spoke about threat of antisemitism but did not consider making equivalent warning about anti-Muslim hate"
    },
    {
        "url": "https://inews.co.uk/opinion/farewell-lee-anderson-never-really-red-wall-spokesman-2927344?ico=in-line_link",
        "title": "Farewell Lee Anderson, you were never really the Red Wall spokesman",
        "description": "It’s risky, but it can be done. Sir <b>Keir Starmer</b> has been deliberately rough with Corbynites, and with antisemites, in his party because he believes it’s deserved but also to signal to voters that he embodies change. At various times in David Cameron ..."
    },
    {
        "url": "https://uk.news.yahoo.com/jackie-baillie-attacks-humza-yousaf-190804899.html",
        "title": "Jackie Baillie attacks Humza Yousaf over newspaper&#39;s &#39;Labour Traitors&#39; front page",
        "description": "The four Labour politicians – leader <b>Keir Starmer</b>, shadow chancellor Rachel Reeves, shadow energy secretary Ed Miliband, and Scottish Labour MSP Anas Sarwar – were the target of an attack from Ryan Crighton, the director of policy at the Aberdeen and ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/speaker-lindsay-hoyle-should-not-32213943.amp",
        "title": "Speaker Lindsay Hoyle should not resign over handling of Gaza ceasefire debate - poll results",
        "description": "(PA) The 66-year-old, who has has been in politics for almost 30 years, came under fire after being accused of helping <b>Keir Starmer</b> dodge a revolt. Mr <b>Starmer</b> had faced the threat of frontbenchers resigning so they could back an SNP-led motion demanding an ..."
    },
    {
        "url": "https://uk.news.yahoo.com/speaker-sir-lindsay-hoyle-retracts-145000941.html",
        "title": "Speaker Sir Lindsay Hoyle retracts offer to SNP for emergency ceasefire debate",
        "description": "Last week, some of the attention fell onto Labour&#39;s Sir <b>Keir Starmer</b> too, with reports claiming he had put pressure on Sir Lindsay - a Labour MP before taking on the Speaker role - to select his party&#39;s amendment in order to stave off a rebellion from his ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/26/lord-mandelson-leaves-synagogue-event-early-labour/?utmsource=email",
        "title": "Mandelson walks out of synagogue event after Labour anti-Semitism row",
        "description": "It came after the record of Sir <b>Keir Starmer</b>, the party leader, was criticised during the event at the Hampstead Synagogue in north-west London. The awkward scenes unfolded at the annual Isaiah Berlin lecture following a speech by Sir Anthony Seldon ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68400775.amp",
        "title": "Lee Anderson refuses to apologise for Islamist claim about Sadiq Khan",
        "description": "Rishi Sunak called the Ashfield MP&#39;s comments wrong but avoided saying if he thought they were Islamophobic. Sir <b>Keir Starmer</b> said the PM lacked the &quot;backbone&quot; to call out Islamophobia. The Labour leader told reporters: &quot;This is really basic. Islamophobia ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-storm-lee-anderson-rant-islamophobia-b1141641.html",
        "title": "Rishi Sunak in growing storm after failing to condemn Lee Anderson rant as Islamophobic",
        "description": "Sir <b>Keir Starmer</b> said the Tory leader “lacks the backbone to call this out for what it is”. Speaking to reporters in Shrewsbury, the Labour leader said: “I think this is straightforward. It’s Islamophobia and the Prime Minister should call it out ..."
    },
    {
        "url": "https://www.channel4.com/news/lee-anderson-doubles-down-on-criticism-of-sadiq-khan",
        "title": "Lee Anderson doubles down on criticism of Sadiq Khan",
        "description": "His comments were that London, its Mayor and <b>Keir Starmer</b> are all controlled by Islamists. That was wrong, said Rishi Sunak today. But the PM won’t say whether they are racist, Islamophobic or just plain nasty. Another Tory MP Paul Scully got into a row ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/families-nottinghamshire-police-nottingham-nottinghamshire-home-secretary-b2502774.html",
        "title": "Families accuse police of ‘ongoing mismanagement’ over Calocane case",
        "description": "<b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers.” A special constable who viewed footage from the scene was sacked in December while police constable Matthew Gell was given a final written warning after a misconduct hearing ..."
    },
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/mum-nottingham-attacks-victim-says-9125910",
        "title": "Mum of Nottingham attacks victim says that she has been denied chance to shame police officers in group where &#39;unforgivable&#39; message sent",
        "description": "The families have also written to the leader of the Labour opposition, <b>Keir Starmer</b>, to ask for a further meeting with him and his shadow ministers. Commenting further on the &quot;ongoing mismanagement&quot; of the situation by Nottinghamshire Police, the statement ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/1b791591-ae03-4fac-9ad6-46c6a83b6ce6?shareToken=d5aec8d35f515585bd1e160ed9a6bcfd",
        "title": "Rochdale by-election ‘will be won on bread and butter, not Gaza’",
        "description": "But as soon as George Galloway, the former Labour MP, revealed he was standing for the Workers Party of Britain in opposition to Sir <b>Keir Starmer</b>’s position on the war in Gaza, it became clear he intended to make the by-election about a single issue."
    },
    {
        "url": "https://www.theguardian.com/politics/ng-interactive/2024/feb/19/uk-general-election-opinion-polls-tracker-latest-labour-tories-starmer-sunak?trk=public_post_comment-text",
        "title": "UK general election opinion polls tracker: Labour leading as election looms",
        "description": "After 13 years of Conservative rule, <b>Keir Starmer</b>’s Labour has been consistently ahead in the polls since the start of 2022. The latest a general election could be called is January 2025. The prime minister, Rishi Sunak, has the power to call a general ..."
    },
    {
        "url": "https://news.sky.com/story/are-we-in-for-one-of-the-dirtiest-election-campaigns-ever-13056641",
        "title": "Are we in for one of the &#39;dirtiest&#39; election campaigns ever?",
        "description": "Image: Rishi Sunak responds to Sir <b>Keir Starmer</b> during PMQs Fair&#39;s fair, Sir <b>Keir Starmer</b> started it this time, but Rishi Sunak had a well-stocked pile to fling back. <b>Starmer</b> opened up referring to a couple of brief unofficial clips posted online."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/nottinghamshire-police-nottingham-keir-starmer-nottinghamshire-home-secretary-b1141622.html",
        "title": "Families accuse police of ‘ongoing mismanagement’ over Calocane case",
        "description": "Nottinghamshire Police have come under fire from the relatives, who accused the force of “ongoing mismanagement” and “gagging” the press in a bid to stop details of failings being made public."
    },
    {
        "url": "https://www.heraldscotland.com/news/24145817.labour-accuse-yousaf-dangerous-rhetoric-traitors-row/?ref=rss",
        "title": "Labour accuse Yousaf of &#39;dangerous rhetoric&#39; in traitors row",
        "description": "Scottish Labour&#39;s deputy leader has criticised the First Minister after he defended sharing the front page of a newspaper describing Sir"
    },
    {
        "url": "https://www.itv.com/news/2024-02-26/speaker-blocks-snp-calls-for-a-new-emergency-gaza-debate",
        "title": "Speaker blocks SNP calls for a new emergency Gaza debate",
        "description": "Sir <b>Keir Starmer</b> came under fire last week as he was accused of pressuring the Speaker into accepting a vote on the Labour amendment in order to avoid a revolt in his party. The Labour leader denied he &quot;threatened the Speaker in any way&quot; over the Gaza ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-says-lee-anderson-32217456",
        "title": "Rishi Sunak says Lee Anderson is not a racist as Tories admit he could be let back in party",
        "description": "But when you think you are right you should never apologise because to do so would be a sign of weakness.&quot; <b>Keir Starmer</b> said Mr Sunak was “too weak” to deal with the problems within his party. The Labour leader, who was on a visit to Shrewsbury ..."
    },
    {
        "url": "https://www.cityam.com/piers-corbyn-is-going-to-run-for-london-mayor-heres-why-that-could-be-a-problem-for-sadiq-khan/",
        "title": "Piers Corbyn is going to run for London mayor: here’s why that could be a problem for Sadiq Khan",
        "description": "The race for the new London mayor hasn&#39;t officially started yet, but there&#39;s a growing field of candidates who&#39;ve indicated they might run"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13127643/Voters-think-Labour-anti-Semitism-problem-wake-Rochdale-election.html",
        "title": "Voters still think Labour has an anti-Semitism problem in the wake of Rochdale election row with four-in-10 saying <b>Keir Starmer</b> has not yet rid the party of taint of Corbyn years",
        "description": "More than four-in-10 (41 per cent of voters) still believe the party has &#39;a problem&#39; with anti-Jewish hate, according to a new poll by Savanta."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7292114",
        "title": "Politics latest: Anderson releases first statement about Islamophobia row since criticism from PM",
        "description": "Sir <b>Keir Starmer</b> was asked a short while ago if he regrets the way the Israel-Hamas war ceasefire vote played out, with chaos in the Commons. Commons Speaker Sir Lindsay Hoyle broke convention last Wednesday to allow Labour to table an amendment to an SNP ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68400775.amp",
        "title": "Lee Anderson refuses to apologise for Islamist claim about Sadiq Khan",
        "description": "Ex-Tory party deputy chair Lee Anderson has said his words were clumsy but has refused to apologise for suggesting Sadiq Khan is controlled by Islamists. Mr Anderson was suspended as a Tory MP following his remarks which he says were borne out of frustration at the London mayor&#39;s record."
    },
    {
        "url": "https://www.scotsman.com/news/politics/speaker-refuses-snp-emerency-debate-in-house-of-commons-on-gaza-4533851",
        "title": "Speaker refuses SNP emerency debate in House of Commons on Gaza",
        "description": "&quot;I urge Rishi Sunak and <b>Keir Starmer</b> to work with us to ensure Parliament can mandate the UK government to pull every lever to help secure an immediate ceasefire, and lasting peace through a two state solution.&quot;Finally, it&#39;s regrettable that this ..."
    },
    {
        "url": "https://www.newburytoday.co.uk/news/former-aide-to-sir-keir-starmer-to-run-for-mp-in-west-berks-9354554/",
        "title": "Labour announces candidate to fight next election in Reading West and Mid Berks",
        "description": "A former aide to Sir <b>Keir Starmer</b>, the Labour leader, is to run for MP in West Berkshire. Labour is the latest party to declare a candidate for the new parliamentary seat of Reading West and Mid Berkshire. Olivia Bailey is to stand for Labour in the next ..."
    },
    {
        "url": "https://www.thenational.scot/news/24145185.labour-leader-keir-starmer-panned-patriotic-economy-pledge/",
        "title": "Labour leader <b>Keir Starmer</b> panned for &#39;patriotic economy&#39; pledge",
        "description": "I AM a Unionist. I don’t like nationalism. I don’t think it’s good … because I think for me nationalism is insular, it’s"
    },
    {
        "url": "https://www.thenational.scot/news/24145157.keir-starmer-wont-say-will-work-snp-gaza-ceasefire-moti/",
        "title": "<b>Keir Starmer</b> won&#39;t say if he will work with SNP on Gaza ceasefire motion",
        "description": "<b>KEIR Starmer</b> has declined to say whether Labour would work with the SNP on a new Gaza ceasefire motion. SNP Westminster leader Stephen Flynn has called for support among opposition parties for a fresh motion. It comes after a previous attempt to debate ..."
    },
    {
        "url": "https://inews.co.uk/opinion/mps-know-doing-islamophobic-remarks-2926081?ico=related_stories",
        "title": "MPs know exactly what they’re doing when they make Islamophobic remarks",
        "description": "The parties of both Rishi Sunak and <b>Keir Starmer</b> have contributed to the atmosphere of intimidation felt by Muslims (Photos: Andy Buchanan/AFP; Peter Byrne/PA) On 18 February, late on a Sunday evening, a brick was reportedly thrown through the front window ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/26/rishi-sunak-latest-news-yorkshire-cabinet-lee-anderson-khan/",
        "title": "Sunak ‘too weak’ to label Lee Anderson remarks Islamophobic, claims <b>Starmer</b> - live updates",
        "description": "Sadiq Khan’s “terrible record” should be the focus of Tory attacks rather than making “wrong” claims about him, Mark Harper said as he responded to the Lee Anderson row. Mr Anderson, the former deputy chairman of the Conservative Party, lost the Tory whip after failing to apologise for claiming “Islamists” had “got control” of the Mayor of London."
    },
    {
        "url": "https://www.shropshirestar.com/news/politics/2024/02/26/labour-would-run-patriotic-economy-starmer-says-on-shropshire-visit/",
        "title": "Labour would run ‘patriotic economy’, <b>Starmer</b> says on Shropshire visit",
        "description": "Sir Keir Starmer talked up Labour&#39;s housing pledges on a visit to Shropshire, promising his party would deliver a &quot;future built in Britain, by Britain, for Britain&quot; if it wins power."
    },
    {
        "url": "https://www.cityam.com/jeremy-hunt-warned-de-arbonisation-efforts-need-greater-urgency/",
        "title": "Jeremy Hunt warned decarbonisation efforts need ‘greater urgency’",
        "description": "But amidst wider concerns about Sir <b>Keir Starmer</b>’s party’s commitment to major energy spending in the wake of walking back his £28bn-a-year green plan, industry bodies including Renewable UK remain loud in their calls for clarity on the delivery roadmap."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/lee-anderson-doubles-down-and-refuses-to-apologise-for-sadiq-khan-remarks-369368/",
        "title": "Lee Anderson doubles down and refuses to apologise for Sadiq Khan remarks",
        "description": "The ex-deputy Tory chair launched a fresh attack on the London Mayor after unleashing an Islamophobia row with earlier comments."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24144822.putin-cohorts-feeling-emboldened-ukraine/",
        "title": "&#39;Putin and his cohorts are feeling emboldened in Ukraine&#39;",
        "description": "Rishi Sunak recently repeated a pledge that the UK would support Ukraine for ‘however long, and whatever, it takes’. Boris Johnson made a similar undertaking - and Sir Keir Starmer has also followed that line."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/lee-anderson-islamophobia-controversy-explained-141944601.html",
        "title": "The Lee Anderson Islamophobia controversy, explained",
        "description": "Former Tory Party deputy chairman Lee Anderson has refused to apologise for his comments about London mayor Sadiq Khan."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-lee-anderson-comment-tory-islamophobia-latest-b2502435.html?page=3",
        "title": "UK politics – latest: Sunak ‘lacks the backbone’ to call Lee Anderson’s comments Islamophobic, says <b>Starmer</b>",
        "description": "“When you think you are right you should never apologise because to do so would be a sign of weakness,” he told GB News on Monday, as Rishi Sunak finally condemned his claims that “Islamists” have “got control” of the London mayor as “wrong”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13125929/Angela-Rayner-breaks-cover-amid-questions-ownership-former-council-house.html",
        "title": "Angela Rayner breaks cover amid questions around her ownership of a former council house ... to go and push Labour&#39;s housing plans as the party braces for Rochdale by-election ...",
        "description": "Labour&#39;s top team will put on a united front in the West Midlands as the Tories demand cops probe whether Ms Rayner broke rules when she owned a house bought using &#39;Right To Buy&#39;."
    },
    {
        "url": "https://bmmagazine.co.uk/news/sir-keir-starmer-advocates-patriotic-economy-with-focus-on-homeownership-boost/",
        "title": "Sir <b>Keir Starmer</b> Advocates ‘Patriotic Economy’ with Focus on Homeownership Boost",
        "description": "Labour leader Sir Keir Starmer has unveiled plans for what he terms a &quot;patriotic economy,&quot; with a primary focus on bolstering home ownership"
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/the-tories-self-destruction-is-a-gift-to-labour",
        "title": "The Tories have become the Conspiracy Party",
        "description": "All of which is occurring while threats against MPs are increasing. The Sunday Times reported that three female MPs now need bodyguard protection. Beneath the parliamentary minutiae, the threats faced by MPs – and how this impacts their votes – was the key story last week. Parliament is not, therefore, calm."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/george-galloway-now-clear-leader-to-take-rochdale-by-election-seat-369366/",
        "title": "George Galloway now clear leader to take Rochdale by-election seat",
        "description": "Bookmakers have recorded a huge swing in favour of George Galloway after Labour withdrew support of its candidate Azhar Ali."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/angela-rayner-says-buying-council-28704629",
        "title": "Angela Rayner says buying her council house was &#39;proud moment&#39; as she hits back at Tories",
        "description": "It comes as Sir Keir Starmer and Ms Rayner visit a housing development in the West Midlands on Monday (February 26). The Labour leader will hit out at the Tories’ record on housing and the decision by Rishi Sunak to scrap national house building targets."
    },
    {
        "url": "https://www.irishnews.com/life/irish-language/dinnseanchas-agus-seanfhocal-fingal-donegal-and-not-sending-a-blacksmith-to-make-shoes-TGBUQGQWC5HGHOBBGJBQTS6W2M/",
        "title": "Dinnseanchas agus seanfhocal: Fingal, Donegal and not sending a blacksmith to make shoes",
        "description": "Fine Gall, the territory or tribe of the Galls or Danes; and the same territory is still well known by the name of Fingal, and the inhabitants are locally called Fingallians. “Donegal is mentioned in several of our Annals,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/sir-lindsay-hoyle-speaker-snp-ceasefire-gaza-motion-dvhwwmplg?ilc=timesradio:morefromthetimes",
        "title": "<b>Starmer</b> could face investigation for swaying Hoyle over Gaza ceasefire vote",
        "description": "Sir <b>Keir Starmer</b> could face an investigation into claims that he broke House of Commons rules by putting the Speaker under pressure before the vote last week on a ceasefire in Gaza. Penny Mordaunt, the leader of the Commons, is understood to believe that ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/lee-anderson-refuses-apologise-islamist-comments/",
        "title": "Lee Anderson refuses to apologise for &#39;Islamist&#39; comments as he doubles down on criticism of Sadiq Khan",
        "description": "Labour leader Sir <b>Keir Starmer</b> said earlier that Rishi Sunak was harbouring &quot;extremists&quot; in his party, adding that it was right that Mr Anderson had been suspended for an &quot;appalling racist and Islamophobic outburst&quot;. Mohammed Amin, a former chairman of the ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/26/rishi-sunak-lee-anderson-islamophobia-row-conservatives-tories-keir-starmer-labour-uk-politics-live?topics=PERSON%3AKeir+Starmer",
        "title": "PM says Lee Anderson’s comments ‘not acceptable’ but denies Tory party has Islamophobic tendencies – UK politics live",
        "description": "Rishi Sunak gave interviews to local stations in Yorkshire where he is chairing his cabinet meeting this morning"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26188601/small-boat-crossings-surge-past-2000/",
        "title": "Small boat crossings surge past 2,000 mark this year as Rishi Sunak faces pressure on illegal migration",
        "description": "MORE than 2,000 illegal migrants have arrived on small boats already this year after one of the busiest days so far yesterday. A total 290 people crossed the Channel in five dinghies on Sunday"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870782/Chris-Bryant-Labour-SNP-Hoyle",
        "title": "&#39;Charlatan!&#39; Chris Bryant sparks calls for probe into Labour manipulation of Commons rules",
        "description": "Mr Bryant’s key role came just after PMQs, when he deliberately filibustered an uncontroversial 10 minute rule motion in order to allow Sir <b>Keir Starmer</b> and others more time to lobby Sir Lindsay Hoyle to change the rules and allow a vote on Labour’s ..."
    },
    {
        "url": "https://uk.news.yahoo.com/foodbank-parcels-union-flags-keir-154250936.html",
        "title": "&#39;Foodbank parcels in Union flags&#39;: <b>Keir Starmer</b> panned for &#39;patriotic economy&#39; pledge",
        "description": "Those are the words of Jo Stevens, a senior Labour MP serving in <b>Keir Starmer</b>’s shadow Cabinet. Unluckily for Jo, her party leader seems determined to undermine any and every claim that their party is not, in fact, deeply nationalist. Even without all ..."
    },
    {
        "url": "https://uk.news.yahoo.com/starmer-pm-lacks-backbone-call-152655543.html",
        "title": "<b>Starmer</b>: PM &#39;lacks the backbone&#39; to call out Islamophobia",
        "description": "Sir <b>Keir Starmer</b> said Rishi Sunak &quot;lacks the backbone&quot; to call out &quot;Islamophobia&quot; after Lee Anderson’s attack on Sadiq Khan. Speaking during a visit to Shrewsbury, the Labour leader said: &quot;I think this is straightforward. It’s Islamophobia and the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lee-anderson-sadiq-khan-sunak-starmer-islamist-b2502758.html",
        "title": "Rishi Sunak squirms as Lee Anderson doubles down on Islamophobic rant",
        "description": "As the fallout from Mr Anderson’s remarks grew: Sir <b>Keir Starmer</b> accused Rishi Sunak of “lacking the backbone” to call out Lee Anderson’s “Islamophobia” A Tory minister said the whip was removed from Mr Anderson “because anti-Muslim hatred is ..."
    },
    {
        "url": "https://www.thebookseller.com/books/books-in-the-media-tom-baldwins-biography-of-starmer-turns-heads",
        "title": "Books in the Media: Tom Baldwin&#39;s biography of <b>Starmer</b> turns heads",
        "description": "This week Tom Baldwin’s biography of the current Labour Party leader <b>Keir Starmer</b> was widely reviewed across the nationals while Carys Davies’ third novel was picked in the Observer."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/snp-seek-support-labour-lib-28705625",
        "title": "SNP to seek support from Labour and Lib Dems for immediate Gaza ceasefire",
        "description": "Stephen Flynn MP has written to Labour leader Sir <b>Keir Starmer</b> and Liberal Democrat leader Sir Ed Davey calling on them to support a fresh motion. The SNP has reached out to both parties to hold talks on the matter, the party said. Last week, Commons ..."
    },
    {
        "url": "https://www.snp.org/westminster-is-failing-the-people-of-gaza-by-blocking-a-meaningful-ceasefire-vote/",
        "title": "Westminster is failing the people of Gaza by blocking a meaningful ceasefire vote",
        "description": "<b>Keir Starmer</b> was the only opposition leader who didn’t respond. Nonetheless, the SNP included language from the Labour Party’s amendment to maximise consensus. Yet again, Westminster is failing the people of Gaza by blocking a vote on the urgent action ..."
    },
    {
        "url": "https://bmmagazine.co.uk/marketing/surge-in-political-ad-spending-on-facebook-and-instagram-signals-intensified-digital-campaigning/",
        "title": "Surge in Political Ad Spending on Facebook and Instagram Signals Intensified Digital Campaigning",
        "description": "Labour leader Sir <b>Keir Starmer</b> has unveiled plans for what he terms a “patriotic economy,” with a primary focus on bolstering home ownership and revitalising communities through the creation of new towns. Leslie Kenny, Founder &amp; CEO of Oxford ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/first-minister-slams-pro-brexit-labour-party",
        "title": "First minister slams ‘pro-Brexit Labour Party’",
        "description": "Ahead of a pro-EU student event in Glasgow’s Kelvingrove Park, Mr Yousaf took a swipe at Sir <b>Keir Starmer</b>’s switch from backing a second EU referendum in 2019 as shadow Brexit secretary to accepting the 2016 ballot result as Labour leader."
    },
    {
        "url": "https://www.holyrood.com/news/view,speaker-rejects-snp-bid-to-bring-forward-debate-on-gaza",
        "title": "Speaker rejects SNP bid to bring forward debate on Gaza",
        "description": "This was perceived as Hoyle showing favouritism to Labour, his former party, as <b>Keir Starmer</b> may have faced rebellion from his MPs who were minded to back the SNP motion. The decision led to chaotic scenes in the Commons and Hoyle ultimately apologised ..."
    },
    {
        "url": "https://www.gg2.net/tories-suspend-mp-anderson-over-islamophobic-comments/",
        "title": "Tories suspend MP Anderson over ‘Islamophobic’ comments",
        "description": "Khan and Labour leader <b>Keir Starmer</b>, who both branded Anderson’s outburst “racist” and “Islamophobic”, also directed their criticism at Sunak, who has not commented on the scandal. Khan hit out at the “deafening silence” from the Tory leader ..."
    },
    {
        "url": "https://www.ft.com/content/0d1326b7-8c83-46bc-a9c2-56ce7bb1a109?mc_cid=3ade45c9b3&mc_eid=c7f63f3316",
        "title": "Labour drops plan to backdate UK windfall tax on oil and gas",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Sir <b>Keir Starmer</b>, the Labour leader, has dropped plans to backdate the windfall tax on oil and gas producers to the start of 2022 if the party wins the next general ..."
    }
]