[
    {
        "url": "https://www.dailymail.co.uk/news/article-12987315/teacher-illness-switzerland-assisted-suicide-lethal-injection.html",
        "title": "Teacher, 47, with no-diagnosed illness told his family he was visiting a friend but secretly went to Switzerland and paid a clinic £10k to help him kill himself by lethal ...",
        "description": "Labour leader Sir <b>Keir Starmer</b> recently called for MPs to be given a vote on the issue, and Prime Minister Rishi Sunak&#39;s official spokesman said it was &#39;an issue of conscience for individual parliamentarians&#39; to decide on. An investigation by this ..."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1858019/HS2-revived-private-finance",
        "title": "Axed HS2 could be brought back to life as secret talks take place",
        "description": "A high-speed network known as Northern Powerhouse Rail is due to reach Stockport, with stops in central Manchester as well as a planned station at the city’s airport. A revived northern leg would be likely to connect these two sections, with track between Stockport and Handsacre."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/20/labour-republicans-democrats-trump-lammy-luntz/",
        "title": "Labour courts leading Republicans in readiness for Trump presidency",
        "description": "Mr Pompeo is widely respected across all parties Credit: JOE SKIPPER/REUTERS Labour’s natural political soulmates are in the Democratic Party, with Sir <b>Keir Starmer</b> frequently seeking inspiration from President Biden’s policy agenda. However ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25432820/rishi-sunak-voters-tax-cuts-starmer/",
        "title": "Rishi Sunak warns voters ‘tax cuts with me or tax rises with <b>Keir Starmer</b>’",
        "description": "RISHI Sunak today warns voters that the next election will be a stark choice: “Tax cuts with me or tax rises with Starmer.” The PM and his Chancellor Jeremy Hunt will this week start drawing up"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/20/sadiq-khan-free-young-people-from-brexit-work-and-travel-ban?ref=biztoc.com",
        "title": "Sadiq Khan: ‘Free young people from Brexit work and travel ban’",
        "description": "Mayor calls for ‘youth mobility agreement’ in one of the most pro-European interventions by a Labour politician since EU exit"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25432466/keir-starmer-hug-a-vicar-religious-charm-offensive/",
        "title": "Sir <b>Keir Starmer</b> launches charm offensive on faith groups ahead of crunch election battle",
        "description": "SIR Keir Starmer has launched a ‘hug a vicar’ charm offensive as he tries to mobilise the religious vote at the next election. The Labour leader has tasked MPs with close ties to different faith"
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-well-stick-to-net-zero-despite-dumping-28bn-green-pledge-bddzb2qjn?ilc=timesradio:morefromthetimes",
        "title": "What’s really going on with <b>Keir Starmer</b>’s £28bn green pledge?",
        "description": "Sir <b>Keir Starmer</b>, the party leader, and Rachel Reeves, the shadow chancellor, say that failure to move towards net zero would mean the country would lose out in the global race for cleaner power. A number of senior party sources have said it is preparing ..."
    },
    {
        "url": "https://www.itv.com/news/2024-01-20/david-lammy-interrupted-by-pro-palestinian-protesters-during-speech",
        "title": "David Lammy interrupted by pro-Palestinian protesters during speech",
        "description": "Protesters mounted the stage while the shadow foreign secretary was delivering his speech,. Credit: PA It comes after Labour leader Sir <b>Keir Starmer</b> faced divisions in his party over the war and was criticised for refusing to back a ceasefire in favour of ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857953/NHS-poll-redfield-and-wilton-strategies",
        "title": "Shock poll reveals that just one in 10 give the NHS a glowing endorsement",
        "description": "The days when Britons considered the NHS the envy of the world are long gone, according to devastating new polling."
    },
    {
        "url": "https://news.sky.com/story/most-recommendations-implemented-from-labour-racism-review-but-author-says-more-could-be-done-13052321",
        "title": "&#39;Most recommendations implemented&#39; from Labour racism review - but author says more could be done",
        "description": "Martin Forde was appointed by Sir Keir Starmer to investigate allegations of racism, sexism and bullying within the Labour Party in the wake of its antisemitism crisis."
    },
    {
        "url": "https://www.thenational.scot/news/24062276.ex-labour-mp-labels-keir-starmer-shameful-gaza-ceasefire-stance/",
        "title": "Ex-Labour MP labels <b>Keir Starmer</b> &#39;shameful&#39; over Gaza ceasefire stance",
        "description": "A FORMER Labour MP has labelled <b>Keir Starmer</b> “shameful” for his stance on a ceasefire in the Middle East. Chris Mullin served as the MP for Sunderland South from 1987 to 2010 and is heading to the Winter Words Festival in Pitlochry to discuss the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-uk-economy-inequality-budget-hunt-b2481960.html",
        "title": "Inequality costing UK economy £34bn a year, says Labour",
        "description": "Inequality in the jobs market is costing the UK economy £34bn a year, according to new analysis by Labour shared with The Independent. Sir Keir Starmer ’s party accused the Conservatives of “dismal failure” in tackling unfairness at work – arguing Britain is “less productive and less equal” after 14 years of Tory rule."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68040611.amp",
        "title": "Pro-Palestinian supporters disrupt speech by David Lammy",
        "description": "The Labour Party will go ahead with its £28bn green investment plan if it wins the next general election, the shadow foreign secretary has insisted. Dismissing suggestions that Labour was trying to row back from the pledge, David Lammy told the BBC the party was &quot;committed to the plan by the second half of the next term&quot;."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-well-stick-to-net-zero-despite-dumping-28bn-green-pledge-bddzb2qjn",
        "title": "Labour: we’ll stick to net zero despite dumping £28bn green pledge",
        "description": "Sir <b>Keir Starmer</b>, the party leader, and Rachel Reeves, the shadow chancellor, say that failure to move towards net zero would mean the country would lose out in the global race for cleaner power. A number of senior party sources have said it is preparing ..."
    },
    {
        "url": "https://www.thenational.scot/news/24063635.posters-target-keir-starmer-ian-murrays-stance-gaza/",
        "title": "Posters target <b>Keir Starmer</b> and Ian Murray&#39;s stance on Gaza",
        "description": "POSTERS criticising the Labour Party’s official stance on the ongoing war in Gaza have appeared in Ian Murray’s constituency in Edinburgh."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/20/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next general election? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12986541/Palestinian-protestors-storm-stage-David-Lammy-Labour-policy-Israel-Gaza.html",
        "title": "Pro-Palestinian protesters yelling &#39;How many more children need to die?&#39; storm stage as David Lammy outlines Labour&#39;s policy on the Middle East",
        "description": "The Labour frontbencher was echoing Sir <b>Keir Starmer</b>, who hardened his tone towards the Israeli prime minister by branding his position over a future Palestinian state as &#39;unacceptable&#39;. Sir <b>Keir</b> told talkSport on Saturday a sustainable ceasefire is needed ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/20/david-lammy-speech-disrupted-pro-palestine-protesters-london",
        "title": "David Lammy speech disrupted by pro-Palestine protesters in London",
        "description": "Lammy decided to address their chants of “ceasefire now” head on as more tried to derail his speech, responding: “Change through power not through protest,” in a similar response to the words <b>Keir Starmer</b> used when he was glitter-bombed at party ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/brexit-labour-starmer-khan-single-market-b2482081.html",
        "title": "Brexit: Sadiq Khan attacks Labour’s ‘omerta’ over re-joining EU single market",
        "description": "London mayor Sadiq Khan has criticised the “omerta” which has prevented the party from debating whether the UK could re-join the EU single market after Brexit. The senior Labour figure suggested there was a code of silence which stopped Sir Keir Starmer ’s party discussing bolder steps to re-integrate with Brussels."
    },
    {
        "url": "https://uk.news.yahoo.com/nigel-farage-could-ambassador-us-113039802.html",
        "title": "Nigel Farage could be ambassador to US if Trump wins, says ex-foreign secretary",
        "description": "And he said he had “reservations” about Labour leader Sir <b>Keir Starmer</b> because “I don’t like his record”. He cited Sir <b>Keir</b>’s decision to work under Jeremy Corbyn, and taking a leading role in “trying to stop the [Brexit] referendum decision ..."
    },
    {
        "url": "https://uk.news.yahoo.com/british-politician-calling-cease-fire-190229858.html",
        "title": "A British politician calling for a cease-fire in Gaza gets heckled by pro-Palestinian protesters",
        "description": "Its leader, <b>Keir Starmer</b>, was criticized for refusing to call for a cease-fire early in the conflict and called for humanitarian pauses instead. He has called for a sustainable cease-fire more recently. The Free Palestine Coalition said its activists had ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-lammy-gaza-israeli-joe-biden-keir-starmer-b1133668.html",
        "title": "David Lammy’s speech disrupted by pro-Palestinian protesters",
        "description": "The Labour frontbencher was echoing Sir <b>Keir Starmer</b>, who hardened his tone towards the Israeli prime minister by branding his position over a future Palestinian state as “unacceptable”. The Labour leader has faced divisions in his party over the war ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jeremy-hunt-nigel-lawson-rishi-sunak-government-labour-b1133696.html",
        "title": "Jeremy Hunt compares himself to Nigel Lawson as he promises more tax cuts",
        "description": "This would bolster Mr Sunak’s attack line on the Labour leader, with which he concluded his article: “The choice is clear — tax cuts with me or tax rises with (Sir <b>Keir) Starmer</b>.” Shadow chief secretary to the Treasury Darren Jones said ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/palestine-protests-across-britain-20-jan/",
        "title": "Rage and radicalism on Britain’s streets as thousands join actions for Palestine",
        "description": "As they marched, people chanted, “Ceasefire now,” and, “Shame on you Rishi Sunak,” “Shame on you <b>Keir Starmer</b>”. Hamza, a Palestinian, told the rally at the end of the march, “We must never lose hope. Every retweet, every post and protest helps."
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-plan-fail-rishi-sunak-poll-2863986?ico=more_from_this_author",
        "title": "Public verdict on Rwanda: PM’s plan won’t work or win votes, poll says",
        "description": "But Sir <b>Keir Starmer</b>’s policy is only seen as a “better” approach by 29 per cent of voters, compared to 26 per cent who think it is worse. Redfield and Wilton research director, Philip van Scheltinga, said: “The Conservatives have created a ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/when-i-stand-up-you-sit-down-commons-speaker-brutally-slaps-down-rishi-sunak_uk_65a7ddfbe4b076abd7a9e0dd?d_id=7196809&ncid_tag=fcbklnkukhpmg00000001",
        "title": "&#39;When I Stand Up, You Sit Down&#39;: Commons Speaker Brutally Slaps Down Rishi Sunak",
        "description": "Rishi Sunak was slapped down by the Commons Speaker on Wednesday after he brandished a “prop” attacking <b>Keir Starmer</b> during PMQs. Lindsay Hoyle told the PM: “When I stand up, please sit down.” The clash came during feisty exchanges between Sunak ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/conservatives-long-spell-wilderness-rishi-sunak-b2482027.html",
        "title": "The Conservatives are heading for a long spell in the wilderness",
        "description": "And the damage will probably last a long time. It has long been obvious that Labour is woefully unprepared for government and that Keir Starmer, if he becomes prime minister, will be in terrible trouble straight away."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/pro-palestinian-protesters-dragged-out-after-david-lammy-speech-interrupted/",
        "title": "Pro-Palestinian protesters dragged out after David Lammy speech interrupted",
        "description": "Mr Lammy replied each time with the phrase: &quot;Change through power not process.&quot; Labour leader Sir <b>Keir Starmer</b> faced criticism at the beginning of the war for saying &quot;Israel has the right to defend itself&quot;, without a similar statement in support of the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-lammy-gaza-keir-starmer-joe-biden-middle-east-b1133668.html",
        "title": "David Lammy’s speech disrupted by pro-Palestinian protesters",
        "description": "David Lammy’s speech calling for a ceasefire in Gaza was disrupted by pro-Palestinian protesters. Labour’s shadow foreign secretary was addressing the Fabian Society conference on Saturday when flag-waving demonstrators mounted the stage shouting: “When will you condemn the genocide? How many more children need to die?”"
    },
    {
        "url": "https://www.devonlive.com/news/celebs-tv/devons-georgia-toff-toffolo-could-9047727",
        "title": "Devon&#39;s Georgia &#39;Toff&#39; Toffolo could turn her back on the Tory party",
        "description": "The next general election could see Georgia &quot;Toff&quot; Toffolo vote for a different party other than the Conservatives"
    }
]