[
    {
        "url": "https://www.thetimes.co.uk/article/can-labours-poll-lead-transfer-to-scottish-success-at-the-ballot-box-jd6g52hr2",
        "title": "Can Labour’s poll lead transfer to Scottish success at the ballot box?",
        "description": "Sir Keir Starmer’s party is riding high as a general election looms, but there are worries about whether his policies are attractive enough to voters north of the border"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/labour-starts-power-handover-talks-with-civil-servants/",
        "title": "Labour starts power handover talks with civil servants",
        "description": "The talks are designed to ensure a smooth transfer of power should Sir <b>Keir Starmer</b> win the next election Credit: Stefan Rousseau/PA Labour has started handover talks with civil servants in preparation for a potential change of government. The party ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.thenational.scot/politics/24094733.labours-quaint-tradition-scrapping-28bn-green-pledge/",
        "title": "Labour&#39;s quaint tradition of scrapping their £28bn green pledge",
        "description": "READ MORE: &#39;What&#39;s the point?&#39;: Former Tony Blair adviser exasperated with <b>Keir Starmer</b> A while later, she decided she didn’t want to be the first green chancellor anymore and would settle for just chancellor. The pledge was revised down from £28bn ..."
    },
    {
        "url": "https://news.sky.com/story/labour-will-look-for-radicalism-through-reform-13062317?dcmp=snt-sf-twitter",
        "title": "Labour will look for &#39;radicalism&#39; through reform rather than risk fiscal slip-up",
        "description": "Radical instincts have been set aside as Sir <b>Keir Starmer</b> and co carry the Ming vase, inscribed with &quot;economic credibility&quot; across the polished floor, terrified of any slip-up. But Ms Rayner, once the left firebrand now tamed by the taste of power ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/labour-is-in-the-worst-of-all-worlds-with-confused-messaging-on-its-28bn-pledge",
        "title": "Labour is in the worst of all worlds with confused messaging on its £28bn pledge",
        "description": "Tories watch on delighted as Starmer continues to talk about the figure while the shadow Treasury team distances itself from it"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-back-to-the-immigration-row/",
        "title": "London Playbook PM: Back to the immigration row",
        "description": "**POLITICO Pro Financial Services UK is launching in February 2024! Providing insightful news on U.K. financial services, for City dwellers and finance up-and-comers alike, our newest policy area will unseal the vault of U.K. finance policy as it enters new territory. Get a four-week free trial here.**"
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155023/everyone-who-is-standing-in-the-rochdale-byelection",
        "title": "Everyone who is standing in the Rochdale by-election",
        "description": "On 29 February, residents of the Rochdale constituency will have their chance to say who they want to represent them"
    },
    {
        "url": "https://inews.co.uk/news/politics/business-fear-tax-rises-labour-2886820",
        "title": "Business bosses fear ‘sting in the tail’ on taxes from Labour, says insider",
        "description": "In front of bosses from companies including Microsoft and Aviva, shadow Chancellor Rachel Reeves pledged that Labour would freeze corporation tax for five years if it wins the next election."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/02/the-guardian-view-on-labours-28bn-green-deal-dont-prove-tories-right-by-ditching-it",
        "title": "The Guardian view on Labour’s £28bn green deal: don’t prove Tories right by ditching it",
        "description": "Editorial: Sir Keir Starmer wants to change his country for the better. That won’t happen if he drops his key industrial strategy for growth"
    },
    {
        "url": "https://morningstaronline.co.uk/article/former-labour-mayor-launches-independent-election-campaign-scathing-attack-party",
        "title": "Former Labour mayor launches independent election campaign with scathing attack on party",
        "description": "AN ELECTED Labour mayor who was barred by the party from standing in May’s mayoral election has launched his election campaign standing as an independent."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24093919.labour-not-committed-arbitrary-numbers-green-investment---rayner/",
        "title": "Labour not committed to ‘arbitrary’ numbers on green investment – Rayner",
        "description": "Labour deputy leader Angela Rayner has said the party is not committed to “arbitrary” numbers on its pledge to ultimately invest £28 billion a year in the green economy. She said the money will depend on sticking to fiscal rules and Labour will “ramp up” to this figure if in government."
    },
    {
        "url": "https://inews.co.uk/opinion/labour-core-supporters-betrayed-haunt-keir-starmer-2886058?ico=most_popular",
        "title": "Labour’s core supporters have been betrayed. And it will haunt <b>Keir Starmer</b>",
        "description": "You can see why Labour has decided to keep things as they are in this regard. The party is desperately keen to be seen as supportive of business and financial services, and they do not want to shake up or alienate those sectors in an election year, at an extremely difficult economic juncture."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "I mean, just look at how <b>Keir Starmer</b>, for the first two years of this parliament was doing incredibly badly in by-elections and local elections, and is now doing stunningly well in by-elections and local elections. Broadly speaking, what is the shift?"
    },
    {
        "url": "https://uk.news.yahoo.com/elton-john-keir-starmer-attend-104222108.html",
        "title": "Elton John and <b>Keir Starmer</b> attend Derek Draper&#39;s funeral",
        "description": "Famous faces including Elton John and Sir Keir Starmer were spotted arriving at the funeral of Kate Garraway&#39;s husband Derek Draper. Derek&#39;s funeral took place in north-west London, four weeks after he died aged 56 following a near four-year Covid battle."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-simon-case-prime-minister-rishi-sunak-tories-b1136696.html",
        "title": "Labour commences access talks with civil service",
        "description": "Labour labour has commenced access talks with the civil service in preparation for government in case Sir <b>Keir Starmer</b>’s party wins the election (Andrew Matthews/PA) The meetings are an opportunity for Labour to discuss its agenda for government and ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/updates-derek-draper-funeral-kate-32027397",
        "title": "Derek Draper funeral: Kate Garraway&#39;s final goodbye as Elton John performs and daughter carries coffin",
        "description": "Kate Garraway&#39;s husband Derek Draper died last month with the Good Morning Britain star announcing the tragic news to fans. Father-of-two Derek endured a gruelling four year battle gruelling health ba"
    },
    {
        "url": "https://www.heraldscotland.com/news/24094366.angela-rayner-casts-doubt-labours-28bn-green-investment-vow/",
        "title": "Angela Rayner casts more doubt on Labour&#39;s £28bn green investment vow",
        "description": "Angela Rayner has cast further doubt on Labour’s plan to invest up to £28billion a year in the green economy if it wins power, calling the"
    },
    {
        "url": "https://www.bbc.co.uk/news/entertainment-arts-68179439",
        "title": "Derek Draper: Elton John and Tony Blair attend funeral service",
        "description": "Sir Elton John and Sir Tony Blair are among the stars and politicians attending the funeral of Derek Draper, the author and former political adviser who died last month. Draper&#39;s wife, TV presenter Kate Garraway, and their children were also in attendance at the private service."
    },
    {
        "url": "https://www.lep.co.uk/news/derek-drapers-funeral-is-attended-by-family-figures-like-sir-tony-blair-sir-elton-john-sir-keir-starmer-4503482",
        "title": "Derek Draper&#39;s funeral is attended by figures like Sir Elton John, Sir <b>Keir Starmer</b> and Sir Tony Blair",
        "description": "Former prime minister Sir Tony Blair, musician Sir Elton John and Labour Leader Sir <b>Keir Starmer</b> were among the high-profile figures attending the funeral of TV presenter Kate Garraway’s Chorley born husband, Derek Draper."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/derek-draper-funeral-kate-garraway-husband-celebrity-mourners-good-morning-britain-b1136572.html",
        "title": "Derek Draper funeral: Kate Garraway and children say final goodbye",
        "description": "Garraway&#39;s Good Morning Britain co-stars Susanna Reid and Ben Shephard were among the first to arrive for the service at St Mary the Virgin church in Primrose Hill, north west London. Sir Elton John, 76, was seen arriving with filmmaker husband David Furnish, 61."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/derek-drapers-funerals-heartbreaking-moments-32032895",
        "title": "Derek Draper&#39;s funeral&#39;s heartbreaking moments – Elton John song to Kate Garraway&#39;s sweet gesture",
        "description": "Sir Elton John, Tony Blair, <b>Keir Starmer</b>, Piers Morgan and Mylene Klass were among the guests in attendance, who all sang Lord of the Dance during the service. Sir Elton, who became a &quot;huge friend&quot; to Kate amid Derek&#39;s health struggle, sang his hit Skyline ..."
    },
    {
        "url": "https://www.chortle.co.uk/review/2024/02/02/54919/jonathan_pie%3A_heroes_and_villains",
        "title": "Jonathan Pie: Heroes And Villains",
        "description": "It’s fair to say he fails. While this stand-up show is officially called Heroes ​and Villains, a more accurate title would be All Tories Are Cunts. It’s a vicious 70-minute invective against the charlatans of the ruling party, as angrily passionate a diatribe as fans of Tom Walker’s permanently furious alter-ego have come to expect."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13038255/derek-draper-funeral-kate-garraway-husband-watch-sir-elton-john-performance-tony-blair.html",
        "title": "Inside Derek Draper&#39;s funeral: Friends reveal Kate Garraway &#39;wore her husband&#39;s watch to keep a little piece of him with her&#39; and Elton John moved congregation to tears with ...",
        "description": "The Good Morning Britain host wore her husband&#39;s watch &#39;so that she could carry a little piece of him on the day&#39; at the Church of St Mary the Virgin in Primrose Hill, where the couple married."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/elton-john-and-tony-blair-among-mourners-at-derek-draper-s-funeral-99176/",
        "title": "Elton John and Tony Blair among mourners at Derek Draper’s funeral",
        "description": "The husband of TV presenter Kate Garraway died on January 3 aged 56 after suffering long-lasting symptoms from coronavirus."
    }
]