[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "But Labour leader Sir <b>Keir Starmer</b> is going out of his way to avoid even the merest whiff of complacency. More to do despite by-election wins, says <b>Starmer</b> Curtice: By-elections leave Tories &#39;with mountain to climb&#39; Could Reform surge sink Tory election hopes?"
    },
    {
        "url": "https://www.theguardian.com/news/2024/feb/17/for-the-record-observer-corrections",
        "title": "For the record",
        "description": "An article said that the Labour Together group “grew out of [<b>Keir] Starmer</b>’s leadership campaign”, which was in 2020; the group was officially launched in 2016 (After the £28 billion U-turn ... what’s left?, 11 February, p33). The documentation ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/labour-ready-for-difficult-decisions-in-new-age-of-insecurity-starmer-says-110761/",
        "title": "Labour ready for difficult decisions in new age of insecurity, <b>Starmer</b> says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/keir-starmer-reportedly-wanted-to-quit-after-2021-byelection-defeat",
        "title": "<b>Keir Starmer</b> reportedly wanted to quit after 2021 byelection defeat",
        "description": "Labour leader thought loss to Tories in Hartlepool meant party going backward, according to new biography"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/sir-keir-starmer-previously-considered-28654438",
        "title": "Sir <b>Keir Starmer</b> previously considered quitting as Labour leader, book claims",
        "description": "A new book on the Labour leader, serialised in The Times, suggests that Sir Kier, the MP for Holborn and St Pancras, told close aides in the immediate wake of the by-election that he was going to quit, before being persuaded to change his mind."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867906/keir-starmer-almost-quit-labour-leader-hartlepool",
        "title": "<b>Keir Starmer</b> almost quit as Labour leader after Hartlepool by-election loss – claim",
        "description": "Sir Keir Starmer allegedly said the result showed the party was going backwards and believed it to to be a personal rejection."
    },
    {
        "url": "https://www.thetimes.co.uk/article/day-keir-starmer-resigned-labour-leader-book-extract-dx9gc3qbb",
        "title": "The day <b>Keir Starmer</b> nearly resigned as Labour leader",
        "description": "Talk of this being his worst week was questionable even before the party’s by-election wins. A new biography reveals how he once came much closer to the edge — and what he really thinks of Jeremy Corb"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-biography-extracts-highlights-b2498023.html",
        "title": "<b>Keir Starmer</b> nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir Starmer and his top team."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-losing-muslim-voters-2905991?ico=related_stories",
        "title": "<b>Keir Starmer</b> is on the brink of losing Muslim voters for good",
        "description": "This month, I’ve found myself wondering if Sir Keir Starmer stares wistfully into his morning brew, questioning whether his path to becoming prime minister is a sure thing. No doubt the recent two thumping by-election wins will help convince him it is."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-father-death-biography-b2497881.html",
        "title": "<b>Keir Starmer</b> talks movingly of his father’s death in new biography",
        "description": "Keir Starmer has spoken movingly of his late father’s death in a new biography of t he would-be prime minister. The Labour leader has previously talked of how his relationship with his toolmaker father, Rodney, was more “distant” as he cared for his mother, Josephine, who suffered with a rare illness."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-scottish-margaret-thatcher-glasgow-snp-b1139835.html",
        "title": "Labour ready for difficult decisions in new age of insecurity, <b>Starmer</b> says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.itv.com/news/2024-02-17/keir-starmer-rebukes-donald-trump-as-he-promises-to-stand-up-for-allies",
        "title": "<b>Keir Starmer</b> rebukes Donald Trump as he promises to &#39;stand up for allies&#39;",
        "description": "The Labour leader, who is preparing for the 2024 general election, warned &#39;bad faith politics&#39; risks global security. | ITV National News"
    },
    {
        "url": "https://www.thesun.co.uk/news/26012238/scottish-labour-vote-gaza-ceasefire-starmer/",
        "title": "Fresh blow for Sir <b>Keir Starmer</b> as Scottish Labour openly defies him to vote for Gaza ceasefire",
        "description": "SIR Keir Starmer’s authority has been plunged into fresh turmoil after Scottish Labour voted to demand an immediate ceasefire in Gaza. In a huge blow to the Labour leader, his party colleagues"
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24126385.labour-will-deal-trump-becomes-president-says-starmer/",
        "title": "Labour will deal with Trump if he becomes president, says <b>Starmer</b>",
        "description": "Sir Keir Starmer said that his party would remain fully committed to Nato if it wins office at the next election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-labour-leader-general-election-biography-v706kqcd2",
        "title": "The private life of <b>Keir Starmer</b> — his wife and family reveal all",
        "description": "Having been granted unprecedented access, Tom Baldwin’s new biography explores what the Labour leader is really like away from the limelight"
    }
]