[
    {
        "url": "https://www.thenational.scot/news/24010972.humza-yousaf-work-labour-gender-reform-election/",
        "title": "Humza Yousaf: We’d work with Labour on gender reform before election",
        "description": "Humza Yousaf said the Scottish Government has been unsuccessful in working with the current Westminster Government, following the Section 35 order of the Scotland Act which prevented the Gender Recognition Reform (Scotland) Bill from gaining royal assent."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24010873.keir-starmer-visit-battleground-seat-high-wycombe-next-year/",
        "title": "<b>Keir Starmer</b> to visit &#39;battleground&#39; seat of High Wycombe next year",
        "description": "Leader of the Labour Party <b>Keir Starmer</b> will visit a Buckinghamshire town next year after it was identified as a &#39;battleground&#39; seat in the upcoming general election. Sir <b>Keir Starmer</b> is set to embark on a tour of key &quot;battleground&quot; Conservative seats ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/403f4038-b2a1-490f-9f8f-cb2c612861b1?shareToken=d8e47bcaadc3bc0c275df95da45e4988",
        "title": "Reform UK to challenge Tories in every seat at general election",
        "description": "“But we are also now turning our guns onto Labour and the weaknesses of <b>Keir Starmer</b>. People will notice a significant stepping up and a shift in the way we attack the main two parties.” Since taking over Reform, Tice has insisted publicly there will ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/yousaf-we-d-work-with-labour-on-gender-bill-before-election-96214/",
        "title": "Yousaf: We’d work with Labour on gender Bill before election",
        "description": "Alba’s MSP Ash Regan – a former SNP minister who quit the government over the legislation – wrote to Sir <b>Keir</b> last week urging him not to unblock the Bill."
    },
    {
        "url": "https://uk.news.yahoo.com/democracy-more-robust-enemies-believe-190000480.html",
        "title": "Democracy is more robust than its enemies believe – and 2024 will prove it",
        "description": "Thankfully in Britain we have been spared military aid becoming a partisan issue: <b>Keir Starmer</b> has pledged to continue supporting Kyiv in the same manner as the Conservatives if he wins the UK general election, likely also taking place next year."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/24/keir-starmer-cannot-bet-on-tory-death-sprial-to-breathe-new-life-into-labour-government",
        "title": "Caution might get <b>Keir Starmer</b> into No 10, but brave ideas will be needed to govern",
        "description": "It’s not enough to say ‘time for a change’ – voters want clear policies on the NHS and welfare reform"
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/24/what-the-uk-wants-for-christmas-is-to-get-brexit-undone",
        "title": "What the UK wants for Christmas is to get Brexit undone",
        "description": "something of which Labour leader <b>Keir Starmer</b>, who frequently rules out rejoining, should take note. The bureaucratic proliferation of customs form filling is driving business people and traders mad. Many are being forced to throw in the towel. And they ..."
    },
    {
        "url": "https://news.sky.com/video/sir-keir-starmer-christmas-message-labour-leader-thanks-nhs-staff-in-this-years-message-13037205",
        "title": "Sir <b>Keir Starmer</b> Christmas message: Labour leader thanks NHS staff in this year&#39;s message",
        "description": "Labour leader Sir Keir Starmer says the story of the nativity &quot;reminds us that in times of darkness and despair, hope, love and peace are always worth advocating for&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-delivers-christmas-message-090658839.html",
        "title": "<b>Keir Starmer</b> delivers Christmas message of ‘peace and love’ from Labour party",
        "description": "Sir Keir Starmer has delivered his annual Christmas message to Labour supporters, and is calling for &#39;love and peace&#39; in line with the messages of the nativity story. He also took the opportunity to thank NHS,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmers-road-trip-tour-towns-and-win-back-motorway-man-d0rld50kt",
        "title": "<b>Keir Starmer</b>’s road trip: tour towns and win back Motorway Man",
        "description": "Sir <b>Keir Starmer</b> will embark on a “towns tour” in the new year as he looks to spend more time on the road selling his party’s plans for power to the electorate. The Labour leader will begin the general election year with a series of “mini-campaigns ..."
    },
    {
        "url": "https://www.therugbypaper.co.uk/latest-news/412711/gorging-on-a-christmas-feast-of-non-stop-rugby-2/",
        "title": "Gorging on a Christmas feast of non-stop rugby",
        "description": "Anoble effort, you will agree: even the most resolute of union diehards might have caved in after three matches in favour of a <b>Keir Starmer</b> turn at the local comedy club. Why put yourself through it, you ask? Firstly and most importantly, to gauge the ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153667/sun-says-keir-starmer-green-pledge/",
        "title": "Sneaky Sir <b>Keir Starmer</b> cannot be allowed to pull the wool over the eyes of voters",
        "description": "Keir must not fool voters on eco plans SLIPPERY Sir Keir Starmer is quietly trying to wriggle out of his reckless £28 billion eco splurge. The Labour leader is now plotting behind the scenes to"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmers-christmas-message-full-31740218",
        "title": "<b>Keir Starmer</b>&#39;s Christmas message in full as he thanks NHS, postal and hospitality workers",
        "description": "During the holidays many of you will be serving your community, and our country…On behalf of the Labour Party, I send my heartfelt thanks and gratitude to all of you for what you do.“"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/humza-yousaf-urges-labour-work-31744711.amp",
        "title": "Humza Yousaf urges Labour to work with them on gender Bill before election",
        "description": "In a statement outlining Scottish ministers would not seek to appeal against a Court of Session decision which ruled the block was lawful, Social Justice Secretary Shirley-Anne Somerville appealed to “future” UK Government’s to revive the laws."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/keir-starmer-jeremy-corbyn-agenda-labour-left/",
        "title": "<b>Starmer</b> never ‘signed up to’ Left-wing Corbyn agenda, says senior ally",
        "description": "Labour’s election campaign coordinator says it is not ‘believable’ to suggest leader had shared predecessor’s views"
    },
    {
        "url": "https://www.itv.com/watch/news/rishi-sunak-on-promise-of-brighter-future-in-christmas-message-before-election-year/g99srkc",
        "title": "Rishi Sunak on &#39;promise of brighter future&#39; in Christmas message before election year",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-hit-fresh-general-31743948",
        "title": "Rishi Sunak hit by fresh general election blow as major change confirmed for next year",
        "description": "The Conservatives will find it harder to cling on to seats at the next election as Nigel Farage&#39;s old party Reform UK vows to stand against its MPs for the first time"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898153/rishi-sunak-christmas-message-no-10-kier-starmer-ed-davey.html",
        "title": "Rishi Sunak urges the nation to focus on &#39;the promise of a brighter future&#39; in Christmas message from No 10 - as Labour leader Kier <b>Starmer</b> and Lib Dem&#39;s Ed Davey also issue ...",
        "description": "The Prime Minister said Christmas was &#39;a time of hope&#39; but it was important to remember &#39;those facing a difficult time&#39;. He also highlighted the &#39;Christian values at the heart of this celebration."
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/24/what-the-uk-wants-for-christmas-is-to-get-brexit-undone?ref=biztoc.com",
        "title": "What the UK wants for Christmas is to get Brexit undone",
        "description": "Importers, exporters, private citizens and the Labour party all urgently need the economy to function better than this"
    },
    {
        "url": "https://www.newarkadvertiser.co.uk/news/fairer-voting-system-needed-9346051/",
        "title": "Reader’s letter: Fairer voting system needed",
        "description": "Both Rishi Sunak and Keir Starmer recognise that politics is failing to deliver, but have yet to propose serious solutions. They should bring us all some new year cheer and commit themselves to a better voting system: proportional representation. — S. DANDO, Maythorne, Southwell."
    },
    {
        "url": "https://www.thenational.scot/news/24010452.humza-yousaf-calls-peace-gaza-first-christmas-message/",
        "title": "Humza Yousaf calls for peace in Gaza during first Christmas message",
        "description": "HUMZA Yousaf has paid tribute to volunteers, frontline workers and called for peace in Gaza during his first Christmas message as"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12897657/DAN-HODGES-Rishi-started-2023-vowing-bring-hope-ends-year-brink-calamitous-defeat.html",
        "title": "DAN HODGES: Rishi started 2023 by vowing to bring us hope. He ends the year on the brink of a calamitous defeat",
        "description": "Unless Sunak understands why the last year has been a struggle, the New Year&#39;s message he delivers in a few days&#39; time could prove to be the last from a Tory Prime Minister for a generation."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nhs-keir-starmer-prime-minister-humza-yousaf-charity-b1128898.html",
        "title": "Christmas offers the ‘promise of a better world’, Sunak says",
        "description": "“For Christians the world over, this is a time to rejoice in the birth of Jesus Christ – God’s son. “The birth of Jesus Christ brings light into our world and reminds us that in times of darkness and despair, hope, love and peace are always worth advocating for."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/sunak-starmer-christian-values-christmas-message/",
        "title": "Rishi Sunak and <b>Keir Starmer</b> preach Christian values in festive messages",
        "description": "The message from the Prime Minister, a Hindu who said his faith guides him in every aspect of his life, will be released on Christmas Eve"
    },
    {
        "url": "https://inews.co.uk/opinion/reforming-house-lords-fools-game-starmer-2822098?ico=related_article_inline",
        "title": "Reforming the House of Lords is a fool’s game – and <b>Starmer</b> knows it",
        "description": "Does Keir Starmer really want to waste his time on reforming the House of Lords? It’s not just pundits – and of course many peers themselves – who are asking this question. It’s also his own Shadow Cabinet and back office team. The Labour leader made the commitment a while ago, but his enthusiasm seemed to wane as other priorities crowded in."
    },
    {
        "url": "https://news.sky.com/story/christmas-offers-promise-of-a-brighter-future-rishi-sunak-says-as-party-leaders-deliver-messages-13036862?dcmp=snt-sf-twitter",
        "title": "Christmas offers &#39;promise of a brighter future&#39;, Rishi Sunak says - as party leaders deliver messages",
        "description": "Labour leader Sir Keir Starmer used his festive message to say the story of Jesus was a reminder that &quot;in times of darkness and despair, hope, love and peace are always worth advocating for&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848768/Tories-must-unite-to-win?ref=todayheadlines.live",
        "title": "Tories must cut taxes and immigration to win next election, poll finds",
        "description": "Rishi Sunak has been told he needs to unite the warring Tories if they want to win the next general election. A new poll has suggested cutting taxes and reducing immigration could be hot topics when voters go to the polling booth next year. It comes just days after the Prime Minister quashed rumours the vote would be held in 2025."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-highlights-promise-better-002045022.html",
        "title": "Rishi Sunak highlights ‘promise of a better future’ in Christmas address after torrid 2023",
        "description": "The prime minister said Christmas is ‘a time of hope’ but that it is important to remember those ‘facing a difficult time’"
    },
    {
        "url": "https://www.shropshirestar.com/news/local-hubs/shrewsbury/2023/12/24/bishop-to-warn-against-moves-to-relax-law-on-assisted-dying/",
        "title": "Bishop to warn against moves to relax law on assisted dying",
        "description": "Cabinet Ministers Michael Gove and Mel Stride have suggested that the law should be revisited by the House of Commons, while Labour leader Sir <b>Keir Starmer</b> indicated that he may permit parliamentary time for a so-called “assisted dying” Bill to be debated."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23998245.scotlands-political-apparatchiks-truly-unbelievable/?ref=rss",
        "title": "Scotland&#39;s political apparatchiks who are truly unbelievable",
        "description": "His seminal policy work Being Meaningful and Meaning it! is said to have inspired Sir <b>Keir Starmer</b>. He is reported to be a close confidante of the UK Labour leader and made the short-list of candidates being considered to act as Godfather to Sir <b>Keir</b>’s ..."
    },
    {
        "url": "https://inews.co.uk/news/michelle-mone-baroness-expelled-house-lords-2814662?ico=in-line_link",
        "title": "Is Michelle Mone still a baroness? If she could be expelled from House of Lords",
        "description": "Now Labour leader Sir <b>Keir Starmer</b> has called on the Government to answer “serious questions” about the situation. He said: “I don’t think she should be in the Lords. I think the Government should be held to account for this.” Asked about the ..."
    }
]