[
    {
        "url": "https://www.dailymail.co.uk/debate/article-12993919/keir-starmer-woke-rnli-national-trust-brendan-o-neill.html",
        "title": "BRENDAN O&#39;NEILL: I fear Sir <b>Keir</b>&#39;s speech is a warning of the rampant wokery and intolerance that will sweep Britain if he gets into No 10",
        "description": "What rhetoric, Sir <b>Keir</b>! Such blather might go down well with the chattering ... all in the name of rewriting our history? In <b>Starmer</b>’s Britain, anyone who objects will be branded a mad, McCarthyite culture warrior. What a topsy-turvy Orwellian world ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/nhs-bill-cut-10bn-crack-down-waste-labour-2867919",
        "title": "NHS could save £10bn by cracking down on waste Labour claim",
        "description": "Billions of pounds of taxpayers’ money is being wasted or poorly spent by the NHS each year on recruitment agencies, management consultants and archaic pagers, Labour has claimed. Shadow Health Secretary Wes Streeting believes the health service is throwing away around £10bn as a result of poor governance under the Conservatives."
    },
    {
        "url": "https://news.sky.com/story/labours-david-lammy-says-he-would-work-with-donald-trump-despite-calling-him-a-neo-nazi-sympathising-sociopath-13054268",
        "title": "Labour&#39;s David Lammy says he would work with Donald Trump - despite calling him a &#39;neo-Nazi-sympathising sociopath&#39;",
        "description": "Mr Lammy, Labour&#39;s shadow foreign secretary, repeatedly criticised Mr Trump during his first presidency but said he would work with him if the pair ended up at either end of the so-called special relationship."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/22/middle-east-crisis-live-updates-news-airstrikes-houthi-missile-yemen-biden-sunak-red-sea?page=with:block-65aef2cf8f0805c892754795",
        "title": "Middle East crisis live: UK says airstrikes are in ‘self-defence’ as Pentagon says bombing targeted Houthi underground missile sites",
        "description": "Pentagon details eight new strikes in joint statement with UK, Australia, Bahrain, Canada and the Netherlands, which supported latest bombing"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/yemen-mps-rishi-sunak-houthi-joe-biden-b1134053.html",
        "title": "US and UK carry out fresh strikes on Houthis",
        "description": "The UK and the US have once again carried out joint airstrikes against Houthi targets in Yemen. Officials say the US and UK took out Houthi missile storage sites and launchers, in the second set of co-ordinated strikes against the Iran-backed militants."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/22/national-trust-adviser-corbyn-labour-manifesto/?n=@",
        "title": "National Trust adviser claims he influenced Corbyn’s Labour manifesto",
        "description": "It comes as Sir Keir Starmer defends charity against accusations of ‘woke’ behaviour, claiming Conservatives have gone to ‘war’ with body"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12993577/EPHRAIM-HARDCASTLE-Boris-Johnson-Rishi-Sunaks-ideal-Washington-ambassador-Donald-Trump-wins-White-House.html",
        "title": "EPHRAIM HARDCASTLE: Would Boris Johnson be Rishi Sunak&#39;s ideal Washington ambassador if Donald Trump wins back the White House?",
        "description": "If Keir Starmer triumphs he might have a harder time placating a resurgent president. Yvette Cooper warned of the &#39;dangers&#39; of Trump &#39;whipping up hatred and prejudice&#39;."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/greater-manchester-councillor-changes-allegiances-28493919",
        "title": "Greater Manchester councillor changes allegiances",
        "description": "An Independent councillor&#39;s decision to change allegiances follows tough challenges to the Oldham budget. An independent Oldham councillor announced a surprise decision to switch parties following discussions about the incoming council budget."
    },
    {
        "url": "https://news.sky.com/video/labour-tories-using-culture-wars-as-a-wedge-13054207",
        "title": "Labour: Tories using culture wars &#39;as a wedge&#39;",
        "description": "It comes after Labour leader Sir Keir Starmer claimed the Tories are &quot;sabotaging&quot; UK charities, adding that the government is &quot;at war with the National Trust&quot;."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/22/keir-starmer-labour-leader-latest-speech-analysis",
        "title": "<b>Keir Starmer</b> keen to show he is not just ducking fights with the Tories",
        "description": "Labour leader’s latest speech is part of a broader strategy to take on the government"
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmers-own-party-biggest-headache-2867780?ico=related_stories",
        "title": "<b>Keir Starmer</b>’s own party could be his biggest headache",
        "description": "First and foremost, Sir Keir Starmer would be riding high on the hog, having turned his party round from the depths of a truly disastrous defeat to a sizeable majority in just under five years."
    },
    {
        "url": "https://www.lbc.co.uk/news/storm-isha-keir-starmer-labour-jocelyn-get-ahead-weather-killed/",
        "title": "Sir <b>Keir Starmer</b> says Labour would ‘get ahead’ of torrential weather - as five killed by Storm Isha",
        "description": "A Labour Government would &quot;get ahead&quot; of torrential storms, Sir Keir Starmer has said, as he accused the Conservatives of implementing a &quot;sticking plaster&quot; approach over Storm Isha."
    },
    {
        "url": "https://www.lbc.co.uk/news/keir-starmer-defends-national-trust-against-government-woke-attacks/",
        "title": "<b>Keir Starmer</b> defends National Trust against government &#39;woke&#39; attacks as he vows to create &#39;society of service&#39;",
        "description": "Sir Keir Starmer accused the government of attacking the &quot;woke&quot; National Trust, as he pledged to build a British &quot;society of service&quot; if elected to Downing Street."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-urged-sever-ties-104620060.html",
        "title": "<b>Keir Starmer</b> urged to sever ties with Tony Blair think tank",
        "description": "LABOUR leader Sir <b>Keir Starmer</b> is being challenged to “sever all links” between his party and the think tank set up by Tony Blair. Blair, who was Labour’s longest-serving prime minister, spending 10 years in Downing Street, set up the Tony Blair ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-defends-national-trust-against-tory-claims-of-wokery-67mhwhv3c?ilc=timesradio:morefromthetimes",
        "title": "<b>Keir Starmer</b> defends National Trust against Tory claims of ‘wokery’",
        "description": "Sir <b>Keir Starmer</b> will say on Monday that Labour is on the side of the National Trust and Royal National Lifeboat Institution as he accuses the Tories of “waging war” on charities and civic society. The Labour leader will use a speech in central London ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/houthi-grant-shapps-yemen-keir-starmer-ministry-of-defence-b1134062.html",
        "title": "Fresh UK and US airstrikes on Houthi targets ‘deal another blow’ to militants",
        "description": "It is understood that in contrast to the strikes on January 11, neither Labour leader Sir <b>Keir Starmer</b> nor Commons Speaker Sir Lindsay Hoyle were briefed about the operation. Mr Sunak, after the first joint mission, gave a statement to MPs at the earliest ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/keir-starmer-attacks-desperate-conservative-31937702",
        "title": "<b>Keir Starmer</b> attacks &#39;desperate&#39; Conservative Government for stoking culture wars",
        "description": "<b>Keir Starmer</b> has accused the Conservative Government of desperation as it tries to cling to power by stoking the culture wars. The UK Labour leader said that the &quot;Tories seem set on sabotaging civil society to save their own skins&quot;. <b>Starmer</b> was speaking at ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/01/why-keir-starmer-wont-bash-woke-charities",
        "title": "Labour and the curse of history",
        "description": "By Freddie Hayward Don’t expect any big Labour policy announcements on the charity sector. <b>Keir Starmer</b>’s speech at the Civil Society Summit this morning tried to reset the tone of the relationship between the government and civil society. Just as the ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24067405.general-election-snp-talking-labours-chances/",
        "title": "General Election: Should SNP be talking up Labour&#39;s chances?",
        "description": "The SNP has decided who will win the next general election and, for once, a political party is not boasting about its own chances."
    },
    {
        "url": "https://www.thenational.scot/news/24067322.labour-campaign-bible-shows-indifference-scottish-voters/",
        "title": "Labour campaign bible shows &#39;indifference to Scottish voters&#39;",
        "description": "it’s clear that Sir <b>Keir Starmer</b> offers Scottish voters nothing,” he said. &quot;It is only by voting SNP at the next General Election can Scots ensure that their priorities are represented in Westminster. the SNP is the only party standing up for Scotland ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68056282",
        "title": "Senedd should not get Welsh police powers: Senior Labour MP",
        "description": "The most senior Welsh Labour MP in Westminster has rejected fresh calls for the Welsh government to be given control of policing and adult criminal justice. Shadow Welsh Secretary Jo Stevens said Labour would be focusing at the next election on &quot;the things that matter&quot;."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-lords-flex-on-rwanda/",
        "title": "London Playbook PM: Lords flex on Rwanda",
        "description": "To be fair: Ofcom reckons more than three quarters of adult Brits use WhatsApp, so it is a good place to attempt to get people to sign up for updates, and the U.K. is the first G7 nation to give it a shot. Playbook PM is told more than 4,000 people have signed up since it was launched this afternoon."
    },
    {
        "url": "https://www.ncl.ac.uk/press/articles/latest/2024/01/conversationkeirstarmerramsaymacdonald/",
        "title": "Conversation <b>Keir Starmer</b> Ramsay MacDonald",
        "description": "Writing for The Conversation, Dr Martin Farr discusses the similarities and differences between the challenges facing Ramsay MacDonald, and Sir Keir Starmer, should he be the next Prime Minister."
    },
    {
        "url": "https://www.thetimes.co.uk/article/britain-cant-build-without-a-trade-revolution-tb7zc8s7w",
        "title": "Britain can’t build without a trade revolution",
        "description": "Target of 300,000 new homes a year remains a myth unless we can plug the serious skills shortfall in UK construction"
    },
    {
        "url": "https://www.itv.com/news/tyne-tees/2024-01-22/ramsay-macdonald-the-first-labour-prime-minister-who-still-divides-opinion",
        "title": "Ramsay MacDonald: The first Labour Prime Minister who still divides opinion 100 years on",
        "description": "Ramsey MacDonald first became Prime Minister 100 years ago today and continues to divide opinion. | ITV News Tyne Tees"
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24065655.starmer-accuses-tories-waging-war-proud-spirit-service-country/",
        "title": "<b>Starmer</b> accuses Tories of ‘waging war on proud spirit of service in country’",
        "description": "The Labour leader said Rishi Sunak’s Conservatives were ‘waging a war on the proud spirit of service in this country’."
    },
    {
        "url": "https://www.thenational.scot/news/24066843.anas-sarwar-challenged-keir-starmers-28-billion-green-pledge/",
        "title": "Anas Sarwar challenged on <b>Keir Starmer</b>&#39;s £28 billion green pledge",
        "description": "It comes amid uncertainty as to whether <b>Keir Starmer</b>’s Labour will keep a pledge of £28bn worth of green investment each year when in government after reports variously suggested it could be set for the chopping block. At first, Labour had said they ..."
    },
    {
        "url": "https://www.chortle.co.uk/news/2024/01/22/54853/matt_forde_returns_to_work",
        "title": "Matt Forde returns to work",
        "description": "He provided the voices of Donald Trump, Boris Johnson and <b>Keir Starmer</b>, among others. And in 2020, he wrote the memoir Politically Homeless. While Forde was getting his treatment, his British Scandal co-host Alice Levine has been presenting the podcast ..."
    }
]