[
    {
        "url": "https://www.dailymail.co.uk/news/article-13071997/Labours-green-plans-40-000-farming-jobs-Wales-England.html",
        "title": "Labour&#39;s controversial green plans could cost 40,000 farming jobs if expanded from Wales to England",
        "description": "Steve Barclay, the Environmental Secretary has labelled Labour&#39;s controversial green plans &#39;ill thought-out&#39; - amid fears the policy could cost 40,000 farming jobs"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/deranged-donald-trump-no-friend-32102101",
        "title": "&#39;Deranged Donald Trump is no friend of Britain - he is a grave security threat&#39;",
        "description": "Boris Johnson rashly endorsed a Trump triumph as “what the world needs” with a caveat about still supporting Ukraine which is why it’s more important that Rishi Sunak and David Cameron break diplomati"
    },
    {
        "url": "https://www.thesun.co.uk/news/25871798/let-extremist-azhar-ali-rochdale-by-election-starmer-bigots/",
        "title": "No strong leader would let extremist Azhar Ali run in Rochdale by-election – <b>Keir Starmer</b> still embraces bigots",
        "description": "Labour liar IT is appalling that the lying extremist Azhar Ali remains a Labour member, let alone its Rochdale by-election candidate. He is precisely the sort of crank conspiracy theorist Keir"
    },
    {
        "url": "https://www.thesun.co.uk/news/25871500/sir-keir-starmer-azhar-ali-israel/",
        "title": "Fury as Sir <b>Keir Starmer</b> stands by candidate who blames Israel for October 7 massacre",
        "description": "SIR Keir Starmer has sparked fury by standing by a candidate who blamed Israel for the October 7 massacre. Labour’s leader was rapped for appeasing anti-Semitism. Sir Keir refused to withdraw"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-keir-starmer-israel-hamas-americans-b1138450.html",
        "title": "Labour by-election candidate apologises for ‘deeply offensive’ Israel claims",
        "description": "Azhar Ali remains Labour’s candidate in the Rochdale by-election, which was triggered by the death of MP Sir Tony Lloyd."
    },
    {
        "url": "https://news.sky.com/story/labour-candidate-wrong-to-say-israel-allowed-7-october-attack-13069105",
        "title": "Labour candidate &#39;wrong&#39; to say Israel allowed 7 October attack",
        "description": "Remarks made by Azhar Ali have been branded &quot;warped&quot; and &quot;disgraceful&quot; by the Jewish community, which fears they could further fuel hostility, but with the deadline for nominations closed it is too late for the party to replace him."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13071179/Will-son-resent-sending-state-school-paying-sisters-posh-prep.html",
        "title": "Will my son resent me for sending him to a state school - and paying for his sister&#39;s posh prep?",
        "description": "Our 13-year-old son goes to a state grammar school while our ten-year-old daughter started at a posh prep last year. Why? We couldn&#39;t afford to send both of them."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/vigil-one-year-murder-brianna-ghey-mum-hold-kids-love/",
        "title": "&#39;Hold your children tight&#39;, Brianna Ghey&#39;s mother tells vigil marking a year since her murder",
        "description": "Brianna Ghey’s mother has told a crowd gathered to mark one year since her daughter’s death to “hold your children tight”. People gathered at Golden Square Shopping Centre in Warrington on Sunday to mark a year since the 16-year-old was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire."
    },
    {
        "url": "https://uk.news.yahoo.com/brianna-ghey-mother-gives-tearful-182623366.html",
        "title": "Brianna Ghey’s mother gives tearful tribute on anniversary of teenager’s brutal murder",
        "description": "Brianna’s mother Esther Ghey wore a pink coat, the teenager’s favourite colour, as she paid tribute to her “amazing, unique and joyful” daughter in a speech in the family’s hometown, with many well-wishers seen wiping away tears."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/national/24112408.sunak-swallow-pride-bring-back-johnson-says-kwarteng/",
        "title": "Sunak should ‘swallow some pride’ and bring back Johnson, says Kwarteng",
        "description": "In response, a No 10 source said: “We want the whole conservative family to come together to beat (Sir <b>Keir) Starmer</b> and Labour at the next election. “Boris and everyone else united in that aim will, of course, be welcome.” Mr Kwarteng, who briefly ..."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24112531.brianna-gheys-mother-tells-vigil-teenager-amazing-unique-joyful/",
        "title": "Brianna Ghey’s mother tells vigil teenager was ‘amazing, unique and joyful’",
        "description": "Mr Sunak had accused Sir <b>Keir Starmer</b> of having difficulty in “defining a woman” during an attack on Labour Party U-turns. Esther Ghey was visiting Parliament when Mr Sunak aimed the jibe at Sir <b>Keir</b>. His comment prompted fierce criticism from across ..."
    },
    {
        "url": "https://news.sky.com/story/amp/rochdale-candidates-israel-comments-arent-about-the-by-election-but-sir-keir-starmers-political-decision-making-13069546",
        "title": "Rochdale candidate&#39;s Israel comments aren&#39;t about the by-election - but Sir <b>Keir Starmer</b>&#39;s political decision-making",
        "description": "While the row over Azhar Ali may be connected to the upcoming Rochdale by-election, it&#39;s really a story about Sir <b>Keir</b> Stamer and his ability to make difficult political decisions. No one is disputing Mr Ali did say that Israel allowed the 7 October ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/11/keir-starmer-labour-party-british-democracy",
        "title": "It’s as if <b>Keir Starmer</b> is seeking out all the positive reasons to vote Labour – and deleting them",
        "description": "I fear that if the party comes to power only to deliver frustration and disillusionment, Labour will take a fatal hit, says Guardian columnist George Monbiot"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/11/labour-green-rowback-honest-politics-or-a-costly-mistake",
        "title": "Labour’s green rowback: honest politics or a costly mistake?",
        "description": "Letters: Keir Starmer and Rachel Reeves cannot promise to spend £28bn they don’t yet have, writes former party leader Neil Kinnock, while others argue that funding a green future is not a matter of am"
    },
    {
        "url": "https://www.irishnews.com/news/uk/brianna-gheys-mother-tells-vigil-teenager-was-amazing-unique-and-joyful-ZVDKTOMXVZLPVCNWW77RSIQS6I/",
        "title": "Brianna Ghey’s mother tells vigil teenager was ‘amazing, unique and joyful’",
        "description": "It marked one year since the 16-year-old was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68267951?at_link_type=web_link&at_ptr_name=twitter&at_bbc_team=editorial&at_link_id=609A5DE2-C8E8-11EE-9310-EB46D0B4AF07&at_link_origin=BBCNews&at_format=link&at_campaign_type=owned",
        "title": "Labour candidate Azhar Ali apologises for Israel comments",
        "description": "Azhar Ali issued an apology after his comments were published. Labour&#39;s candidate in the Rochdale by-election has apologised for remarks he made about Israel in a local party meet"
    }
]