[
    {
        "url": "https://www.dailymail.co.uk/news/article-13022439/Angela-Rayner-Palestinian-protesters-police-Israel-Gaza.html",
        "title": "Angela Rayner resurfaces on GMB following low-key few weeks as she says she &#39;understands&#39; rage of pro-Palestinian protesters after needing police escort from chaotic fundraiser ...",
        "description": "In the weeks after the 7 October attacks, Labour leader Sir <b>Keir Starmer</b> came under intense pressure to back a full and immediate ceasefire. He suffered a huge Labour revolt in the House of Commons in November as 56 of his MPs defied him and backed calls ..."
    },
    {
        "url": "https://news.stv.tv/world/white-house-is-not-looking-for-a-war-with-iran-as-us-soldiers-named",
        "title": "White House is &#39;not looking for a war with Iran&#39; as US soldiers named",
        "description": "The US response to the drone strike in Jordan could be multi-levelled and sustained, US Secretary of State Anthony Blinken said Monday."
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, Labour’s silence over the cost of living crisis is deafening’",
        "description": "It comes following Labour leader, Sir <b>Keir Starmer</b>, confirming his party would not redistribute wealth from the richest to the poorest if they win the next general election, nor properly invest in renewable energy. BASC given permission to bring judicial ..."
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24082724.fighting-talk-reading-tories-labour-leader-visit/",
        "title": "Fighting talk from Reading Tories after Labour leader visit",
        "description": "The local Conservative leader has accused Labour party leader Sir Keir Starmer of painting Reading ‘in the worst possible light’ in a"
    },
    {
        "url": "https://primeresi.com/academy-gardens-penthouse-finds-a-buyer/",
        "title": "Academy Gardens penthouse finds a buyer",
        "description": "An impressive deal has been sealed at one of Kensington&#39;s most prestigious apartment blocks, PrimeResi hears. A penthouse apartment at Academy Gardens has been tucked away by a boutique agency on"
    },
    {
        "url": "https://primeresi.com/the-age-of-opportunity-who-will-win-lose-in-estate-agencys-new-era/",
        "title": "The age of opportunity: Who will win &amp; lose in estate agency&#39;s new era?",
        "description": "I recently went to an excellent property market seminar with leading experts in the industry. They touched on price predictions, the mortgage market, impact of current economic landscape on"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022047/Bristol-stabbing-fall-boy-friends-died-turf-war-rival-gangs.html",
        "title": "Bristol stabbing: Neighbour reveals how she saw boy &#39;fall flat down on his face&#39; and rushed to comfort him - as locals say two friends died &#39;amid turf war between rival gangs ...",
        "description": "Max Dixon, 16, and Mason Rist, 15, (pictured) reportedly died just yards from one of their front doors after they were knifed by an alleged gang in Knowle West on Saturday night."
    },
    {
        "url": "https://www.thelondoneconomic.com/news/environment/labours-28bn-green-pledge-set-to-be-consigned-to-the-dustbin-of-history-367783/",
        "title": "Labour’s £28bn green pledge set to be consigned to the dustbin of history",
        "description": "Labour’s famous or notorious £28bn – its promise to spend £28bn a year on climate-friendly investment – is set to be consigned to the dustbin of history, probably within days. The policies underlying that original £28bn pledge – to convert all power generation in the UK to…"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? <b>Starmer</b> opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24082837.rishi-sunak-much-proud-might-yet-sneak-win/",
        "title": "Rishi Sunak has much to be proud of. He might yet sneak a win",
        "description": "WHEREVER Rishi Sunak looks, the received wisdom is that he, the Conservatives and their General Election campaign are all doomed. But in years"
    },
    {
        "url": "https://www.lbc.co.uk/news/father-of-man-killed-tik-tok-influencer-mother-groomed/",
        "title": "Father of man killed by TikTok influencer and mother says he &#39;was groomed&#39; by the married older woman",
        "description": "She told Mr Hussain: &quot;I am sorry that this year you&#39;ll be gone, Saqib.&quot; Read more: <b>Keir Starmer</b> slams Diane Abbott as he condemns &#39;anti-Semitic&#39; letter amid calls to expel MP from Labour party Mr Thompson told the court that the others &quot;then became ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-wealth-tax-neil-kinnock-2879565?ico=editors_picks",
        "title": "Labour rules out wealth tax despite call by Neil Kinnock",
        "description": "Former Labour Party leader Neil Kinnock told i in an interview last week that Labour could impose a wealth tax to raise funds for public services. He suggested a levy on assets worth more than £10m to claw back money for things like education and healthcare."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860998/labour-rail-strikes-trade-union-barons",
        "title": "Labour to &#39;work hand in glove&#39; with union barons inflicting misery on millions this week",
        "description": "EXCLUSIVE: A new dossier has revealed how the union barons behind this week&#39;s train strike misery will control a Labour Government."
    },
    {
        "url": "https://www.cityam.com/keir-starmer-is-the-right-person-to-rebuild-governments-vital-relationship-with-business/",
        "title": "<b>Keir Starmer</b> is the right person to rebuild government’s vital relationship with business",
        "description": "By focusing on “growth, growth, growth”, Keir Starmer will be able to mobilise the business community behind him to make his goal a reality."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24081217.london-oil-firms-shetland-acquisition-shows-appeal-area/?ref=rss",
        "title": "London oil firm&#39;s Shetland acquisition shows appeal of area",
        "description": "The party’s £28bn green investment plan is coming under increasingly close scrutiny amid concerns about whether it can be squared with Labour leader <b>Keir Starmer</b>’s commitment to show restraint on the borrowing front."
    },
    {
        "url": "https://www.nottinghampost.com/news/valdo-calocane-the-people-nottingham-9065221",
        "title": "Valdo Calocane: &#39;The people of Nottingham have a right to understand what happened&#39;",
        "description": "The solicitor of Nottingham attacks survivor Wayne Birkett says a public inquiry into the events leading up to June 13 last year is &#39;needed&#39;"
    },
    {
        "url": "https://www.politico.eu/article/britains-potty-mouthed-parliament/",
        "title": "‘Shitshow!’ Britain’s potty-mouthed parliament",
        "description": "Britain’s straight-laced opposition leader Keir Starmer — the favorite to become prime minister later this year — added his own expletive to the record last week when he used his appearance at prime minister’s questions to repeat an anonymous briefing to a newspaper which had described the government’s childcare policy as a “shitshow.”"
    },
    {
        "url": "https://www.thenational.scot/news/24083427.good-morning-britain-angela-rayner-panned-response-gaza/",
        "title": "Good Morning Britain: Angela Rayner panned for response to Gaza &#39;genocide&#39; question",
        "description": "Despite Labour MPs being ordered to abstain on the amendment, 56 rebelled against <b>Keir Starmer</b> to vote in favour of the motion. Speaking to Good Morning Britain, Rayner was asked whether she would abstain or vote for a ceasefire if another vote was held today."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/mp-jonathan-gullis-takes-petition-9061435",
        "title": "&#39;Victory for our great city&#39; as clean air zones to be binned",
        "description": "&quot;I respect Councillor (Amjid) Wazir and Councillor Ashworth&#39;s bravery in sending a very clear message to Sir <b>Keir Starmer</b> and Angela Rayner that we in Stoke-on-Trent will not be part of the eco-mob who want to drag us back into the dark ages. Since 2019 I ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/economic-picture-different-to-when-labour-made-28bn-green-pledge-reeves-KWAQ4MCXZVLDVEYFTNN4X7EEWU/",
        "title": "Economic picture ‘different’ to when Labour made £28bn green pledge – Reeves",
        "description": "Shadow chancellor Rachel Reeves said the economic picture is “very different” to when Labour set out its green investment plan as she refused to repeat her party’s £28 billion spending commitment. The senior Labour figure said her party’s so-called green prosperity plan was “so important” but it had to be approached in a “way where the numbers add up”."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497",
        "title": "Labour urges restraint in Middle East following deadly attack on US base",
        "description": "Labour leader Sir <b>Keir Starmer</b> said those responsible for the attack should be “held to account” but expressed fears about the conflict spreading across the region. “I am concerned about the possibility of escalation of an already dangerous situation ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25579806/keir-starmer-biden-trump-work-together/",
        "title": "Sir <b>Keir Starmer</b> reveals he will work with Donald Trump – despite claiming ex-President was unfit to lead",
        "description": "SIR Keir Starmer says he will work with Donald Trump – after once declaring the ex-US leader unfit to lead the world. The Labour leader makes a u-turn saying transatlantic ties are more"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860950/mark-drakeford-eu-single-market-Jeremy-Miles?ruid=6c003d44-692d-4da4-9bd9-3c12f3fba60c",
        "title": "Frontrunner to replace Mark Drakeford sparks fury over EU single market demand",
        "description": "Jeremy Miles, who is the favourite to take over from Mr Drakeford as Wales&#39;s first minister in March, said he would push &quot;strongly&quot; for that position if Sir <b>Keir Starmer</b> wins the next general election. But Welsh Conservatives leader Andrew RT Davies said ..."
    },
    {
        "url": "https://www.itv.com/news/granada/2024-01-29/sir-keir-starmer-promises-to-help-struggling-councils-if-elected",
        "title": "Sir <b>Keir Starmer</b> promises to provide financial support for Warrington Council if elected",
        "description": "Sir <b>Keir Starmer</b> has said he is worried about the finances of local councils, blaming the current Government for &quot;driving them into the ground&quot;. The Labour leader was visiting an Iceland supermarket in Warrington when he addressed a recent report that ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24081885.photos-labour-leader-keir-starmer-visits-golden-square-warrington/",
        "title": "PHOTOS: Labour leader <b>Keir Starmer</b> visits Golden Square in Warrington",
        "description": "WARRINGTON was visited by Labour leader Sir <b>Keir Starmer</b> this morning, Monday. The Leader of the Opposition popped into Iceland in Golden Square Shopping Centre. Here, he met with Richard Walker, executive chairman of the supermarket and a former Tory ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68123734",
        "title": "Nottingham attacks: Victim&#39;s family calls for inquiry into killer&#39;s case",
        "description": "Prime Minister Rishi Sunak refused to commit to ordering an inquiry last week, with calls backed by Labour leader Sir <b>Keir Starmer</b> and one of Calocane&#39;s victims Wayne Birkett, who was hit by a van during the attacks. &quot;If they don&#39;t feel that warrants a ..."
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-visits-iceland-store-173147382.html",
        "title": "<b>Keir Starmer</b> visits Iceland store as chairman Richard Walker backs Labour",
        "description": "Sir <b>Keir Starmer</b> spoke to Iceland staff members at a Warrington store after the supermarket&#39;s executive chairman gave his backing to Labour. Richard Walker, who quit the Conservative party last October in a blow to Rishi Sunak, said Sir <b>Keir</b>&#39;s party was ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/economic-picture-different-to-when-labour-made-28bn-green-pledge-reeves-98768/",
        "title": "Economic picture ‘different’ to when Labour made £28bn green pledge – Reeves",
        "description": "Shadow chancellor Rachel Reeves said the economic picture is “very different” to when Labour set out its green investment plan as she refused to repeat her party’s £28 billion spending commitment."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/rachel-reeves-says-fiscal-picture-very-different-to-when-labour-made-28bn-green-pledge",
        "title": "Rachel Reeves says fiscal picture ‘very different’ to when Labour made £28bn green pledge",
        "description": "Shadow chancellor says flagship green policy had to be approached in a ‘way where the numbers add up’"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13020967/Keir-Starmer-VAT-raid-private-schools-poor-children-grammar-schools.html",
        "title": "<b>Keir Starmer</b>&#39;s VAT raid on private schools could squeeze poor children out of grammars, leading education figures warn",
        "description": "POORER students risk being squeezed out of grammar school places by parents looking to dodge Labour&#39;s proposed VAT raid on private school fees, leading education figures have warned."
    },
    {
        "url": "https://www.itv.com/news/2024-01-29/labours-28bn-green-pledge-to-be-scrapped-amid-exploitation-by-sunak-campaign",
        "title": "Labour’s notorious &#39;£28bn&#39; green pledge to be scrapped after exploitation by Sunak campaign",
        "description": "The policies underlying that original £28 billion pledge - to convert all power generation in the UK to zero emissions by 2030 and so on - will be retained. | ITV National News"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/live-wales-breaking-news-plus-28528421",
        "title": "Live: Wales breaking news plus weather and traffic updates (Monday, January 29)",
        "description": "Hello, and welcome to Wales Online&#39;s live blog for Monday, January 29. We will be bringing you all of the latest news from across Wales - whether you&#39;re on the move, at home or at work - as well as the latest traffic and travel."
    },
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/nottingham-attacks-victims-families-visit-9065652",
        "title": "Nottingham attacks: Victims&#39; families visit Rishi Sunak as Prime Minister does not rule out public inquiry",
        "description": "Valdo Calocane stabbed students Barnaby Webber and Grace O’Malley-Kumar and school caretaker Ian Coates to death."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/two-more-arrests-after-teenagers-28534577",
        "title": "Two more arrests after teenagers stabbed to death in Bristol",
        "description": "Police have arrested two more men after two teenage boys were stabbed to death in Bristol."
    },
    {
        "url": "https://www.thesun.co.uk/news/25587624/railway-bosses-strike-bullies-claiming-bonuses-government-enforce-law/",
        "title": "Pathetic railway bosses give into strike bullies while claiming huge bonuses – why won’t the government enforce the law?",
        "description": "THE defeat of trade union militancy in the 1980s showed Margaret Thatcher at her most resolute. “You can never give in to blackmail. You can never give in to a strike that makes impossible"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68134496?at_medium=RSS&at_campaign=KARANGA%C3%A2%E2%82%AC%C2%A6",
        "title": "Nottingham attacks: Police face probe over killer&#39;s alleged assaults",
        "description": "A police force that was investigating alleged assaults by a triple killer weeks before the Nottingham attacks has referred itself to its watchdog. Barnaby Webber and Grace O&#39;Malley-Kumar, both 19, were fatally stabbed on 13 June along with Ian Coates, 65. Valdo Calocane was given a hospital order for the killings on Thursday."
    },
    {
        "url": "https://www.standard.co.uk/news/health/james-nottingham-prime-minister-keir-starmer-rishi-sunak-b1135622.html",
        "title": "Nottingham victims’ families say Rishi Sunak has not ruled out public inquiry",
        "description": "David Webber said he and his wife were “horrified” there were no plans for an inquiry. The families met Labour leader Sir <b>Keir Starmer</b> at the party’s London headquarters earlier on Monday. Mr Webber’s parents have said they want to speak with ..."
    }
]