[
    {
        "url": "https://www.thenational.scot/politics/24095461.ruth-wishart-covid-inquiry-missing-point---starmers-labour/",
        "title": "Ruth Wishart: Covid Inquiry is missing the point - as is <b>Starmer</b>&#39;s Labour",
        "description": "THINK back, if you can bear it. Think about the earliest days of the Covid crisis and that first lockdown in March 2020. Most of us were"
    },
    {
        "url": "https://www.thesun.co.uk/news/25703590/james-cleverly-people-smugglers-evil-rwanda-plan/",
        "title": "James Cleverly warns bishops trying to stop him tackling people smugglers with his Rwanda plan ‘I’m trying to stop evil’",
        "description": "JAMES Cleverly has told bishops who are trying to stop him tackling people smugglers with his Rwanda plan: “This is evil being done. I’m trying to do something about it.” The Home Secretary is"
    },
    {
        "url": "https://www.bbc.com/news/topics/cdn42nmd5yvt?page=11",
        "title": "Schools concrete crisis",
        "description": "A production is pulled after the venue is found to have concrete at risk of collapse. BBC London sees how a school has handled building closures six months after RAAC was found. Wales&#39; first minister says building material at centre of schools closures can ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "Labour vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041845/jeremy-corbyn-leads-protesters-london-ceasefire-gaza.html",
        "title": "Jeremy Corbyn leads protesters in London calling for a ceasefire in Gaza - with 20,000 joining march, despite organisers claiming &#39;hundreds of thousands&#39; would be demonstrating",
        "description": "Jeremy Corbyn (pictured) was seen at the front of the London protest surrounded by signs calling for peace before he made a speech imploring Rishi Sunak to call for a ceasefire."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "Labour ditches radical reforms as it prepares ‘bombproof’ election manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://cherwell.org/2024/02/03/a-crash-course-in-british-politics-how-elections-work-week-1/",
        "title": "A crash course in British politics: How elections work (Week 1)",
        "description": "This week’s article will explain how British elections work, and hopefully will answer all your related questions."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://www.lbc.co.uk/news/police-raid-clapham-abdul-ezedi-acid/",
        "title": "Moment police raid Clapham chemical attack suspect&#39;s house and find corrosive substance containers",
        "description": "&quot;Our new laws passed in the last two years mean serious criminals and illegal immigrants will not be able to claim asylum and stay in the UK — all of which Labour has tried to block, with Sir <b>Keir Starmer</b> himself campaigning to stop the deportations of ..."
    },
    {
        "url": "https://www.thenational.scot/news/24095368.scottish-labour-mps-will-lack-experience-keir-starmer-cabinet/",
        "title": "Scottish Labour MPs ‘will lack experience’ for <b>Keir Starmer</b> Cabinet",
        "description": "THE voices in <b>Keir Starmer</b>’s Cabinet will “almost all be those of English MPs” if Labour win the keys to Downing Street at the General Election, a top elections expert has said. Richard Rose - a leading psephologist and expert on party ..."
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/stones-scoop-anas-sarwar-shares-his-secret-space-at-holy-340328/",
        "title": "Labour leader Anas Sarwar has a secret space at Holyrood, he tells Jamie Stone",
        "description": "Far north MP Jamie Stone speaks to the Scottish Labour leader Anas Sarwar about Holyrood and Westminster, his inspirations and how he blows off steam"
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1862786/kate-garraway-derek-draper-funeral-video-dancing",
        "title": "Kate Garraway dances with late husband Derek Draper in emotional clip shared after funeral",
        "description": "Sir <b>Keir Starmer</b> and former Labour leader Ed Miliband were also in attendance. Others included Good Morning Britain presenter Susanna Reid and Capital FM host Roman Kemp. Kate was supported by ITV colleagues past and present, including Piers Morgan ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68192206",
        "title": "Laura Kuenssberg: When will politicians make their minds up on key plans?",
        "description": "No wonder voters are unconvinced when politicians may seem unclear on economic plans, writes Laura Kuenssberg."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13041009/DAN-HODGES-Gaza-shadow-George-Galloway-prompt-Rishi-snap-election.html",
        "title": "DAN HODGES: Could Gaza and the shadow of George Galloway prompt Rishi into a snap election?",
        "description": "The Tory MP leapt up and did a jig of joy around the House of Commons Strangers&#39; Bar. &#39;Really? That&#39;s been confirmed?&#39; he asked. &#39;Is George Galloway standing in Rochdale?&#39;"
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/200000-on-palestine-march-in-london-against-israeli-genocide/",
        "title": "200,000 on Palestine march in London against Israeli genocide",
        "description": "The size of the Palestine march in London a sign of the continuing mass anger against Israel’s genocidal assault in Gaza."
    },
    {
        "url": "https://leftfootforward.org/2024/02/how-the-uk-profits-from-war/",
        "title": "How the UK profits from war",
        "description": "As allies look sorrowfully on at our underfunded and shrinking armed forces, Britain’s arms trade is making a killing, with billions of pounds of taxpayers’ money being handed to arms manufacturers that give investors rich returns."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68178879.amp",
        "title": "Nottingham attacks: Stab victim&#39;s parents&#39; frustration at &#39;failings&#39;",
        "description": "The parents of a student who was stabbed to death in Nottingham have expressed their frustration at &quot;failings&quot; in the case. Dr Sanjoy Kumar and Dr Sinead O&#39;Malley&#39;s 19-year-old daughter Grace was killed - along with fellow student Barnaby Webber and 65-year-old school caretaker Ian Coates - in June."
    },
    {
        "url": "https://www.independent.co.uk/voices/angela-rayner-labour-government-keir-starmer-b2489937.html",
        "title": "Angela Rayner will be Labour’s most powerful minister in government – <b>Keir Starmer</b> should watch out",
        "description": "The deputy Labour leader and champion of workers’ rights may be an unexpected titan in office, writes John Rentoul"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/devastating-reason-kate-garraway-wore-32037714",
        "title": "Devastating reason Kate Garraway wore husband Derek Draper&#39;s watch to his funeral",
        "description": "The presenter was with her children Darcey and Bobby as the family said their final goodbye&#39;s to a loving husband and father."
    },
    {
        "url": "https://www.lbc.co.uk/news/clapham-attack-suspect-related-victim/",
        "title": "Clapham chemical attack suspect &#39;was in relationship with victim who suffered life-changing injuries&#39;, relative reveals",
        "description": "The Clapham chemical attack suspect was in a relationship with the victim who has suffered life-changing injuries."
    },
    {
        "url": "https://dailybusinessgroup.co.uk/2024/02/rayner-denies-confusion-over-labours-green-pledge/",
        "title": "Rayner denies confusion over Labour’s green pledge",
        "description": "Angela Rayner, Labour’s deputy leader, raised further questions about her party’s pledge to invest £28 billion in green energy when she said it could not be bound by an “arbitrary number”."
    },
    {
        "url": "https://www.thesun.ie/tv/12125355/kate-garraway-dances-late-derek-draper-funeral-dead/",
        "title": "Kate Garraway dances with late Derek Draper in heartbreaking video shared by her friend after star buries her husband",
        "description": "KATE Garraway beamed with delight as she danced with husband Derek Draper in a touching video re-posted to Instagram on the day of his funeral. The Good Morning Britain anchor, 56, looked"
    },
    {
        "url": "https://www.politicshome.com/news/article/labours-slow-twenty-eight-billion-green-spending-u-turn",
        "title": "Labour Is Making Its &quot;Slowest U-Turn&quot; On £28bn Green Spending",
        "description": "Labour insiders say the party has made a rod for its own back over the £28bn green spending pledge as a long internal debate over whether Keir"
    },
    {
        "url": "https://inews.co.uk/news/politics/ed-miliband-labour-green-growth-2887660?ico=most_popular",
        "title": "‘Miliband still wants the £28bn’: Inside Labour’s green growth plan split",
        "description": "Keir Starmer sought to present the new face of Labour this week, just as divisions came to the fore over what had been his flagship policy"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/dougie-smith-a-mysterious-backroom-tory-fixer-feared-by-mps",
        "title": "Dougie Smith: a mysterious backroom Tory fixer feared by MPs",
        "description": "The man who reportedly once organised sex parties for the wealthy is alleged to be involved in a plot to replace Rishi Sunak"
    },
    {
        "url": "https://www.newstatesman.com/the-weekend-interview/2024/02/iceland-boss-richard-walker-leaving-conservatives",
        "title": "Your entire existence is a fluke",
        "description": "The businessman has turned against Rishi Sunak’s bonfire of a party."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/03/british-rail-looms-over-labour-plan-state-ownership-trains/",
        "title": "National joke British Rail looms over Labour’s attempt to take back control of trains",
        "description": "British Rail finally reached the end of the line in 1994 when John Major kicked off its privatisation. Now, Labour wants to resurrect the state-owned system. Sir Keir Starmer’s party has made a promise to take back control of the railways as one of the party’s flagship policies running into election year."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24087644.chris-green-labour-split-personality-moral-nature/",
        "title": "CHRIS GREEN: &#39;Labour have split personality and moral nature&#39;",
        "description": "Prime Minister’s Questions used to be more interesting and informative but the PM can only work with the quality of questions he"
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/24094221.shipley-mp-philip-davies-political-correctness/",
        "title": "&#39;Politically correct minority holding country to ransom&#39;- MP",
        "description": "This week&#39;s MP column comes from Philip Davies, Conservative MP for Shipley, where he discusses political correctness"
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/rishi-sunak-and-keir-starmer-should-learn-from-brazil-president-lula-da-silvas-barbecue-and-beer-pledge-stewart-mcdonald-4502677",
        "title": "Rishi Sunak and <b>Keir Starmer</b> should learn from Brazil President Lula da Silva&#39;s &#39;barbecue and beer&#39; pledge – Stewart McDonald",
        "description": "It should not have taken the IMF to say this from on high. Where was the Opposition? Where was <b>Keir Starmer</b> on the need for public investment to boost growth and achieve the net-zero targets? He was, of course, diluting down Labour’s once ambitious £28 ..."
    },
    {
        "url": "https://www.ft.com/content/d1ac6961-4a91-4807-9927-90bd27a02433?sharetype=blocked",
        "title": "Labour under pressure to water down proposed tax raid on private equity",
        "description": "Shadow chancellor Rachel Reeves vows to shut loophole but senior party figures fear it could deter UK investment"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-unity-strains-under-starmer-063000636.html",
        "title": "Labour Unity Strains Under <b>Starmer</b>’s Focus on Tax and Business",
        "description": "UK opposition leader Keir Starmer and his shadow chancellor Rachel Reeves breezed through their encounter with executives at the Labour Party’s business conference this week. Their talks with colleagues are rougher,"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68189099?at_campaign=KARANGA&at_medium=RSS",
        "title": "Newspaper headlines: Killers &#39;unmasked&#39; and Clapham suspect asylum &#39;outcry&#39;",
        "description": "The poll also suggests Labour&#39;s lead over the Conservatives has narrowed by two points to 15 per cent since November, but Sir <b>Keir Starmer</b>&#39;s personal ratings increased slightly. The Royal Navy has abandoned major warship patrols around the Falkland Islands ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/rebellion-over-gaza-british-left-strikes-back",
        "title": "Rebellion over Gaza: the British left strikes back",
        "description": "The protest movement that has exploded onto the streets and inside the Labour Party in response to British complicity with Israel’s crimes is not a distraction from class politics — it’s the way forward,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/frances-barber-interviewi-thought-id-be-lounging-on-a-yacht-by-this-age-8tjxx8tzq",
        "title": "Frances Barber: I thought I’d be lounging on a yacht by this age",
        "description": "T he actress Frances Barber is talking to me from her fabulous loft in Clerkenwell, central London. It’s 10.30am. “I’m actually still in bed,” she says with a throaty chuc"
    },
    {
        "url": "https://www.ok.co.uk/celebrity-news/kate-garraways-poignant-tribute-husband-32034703",
        "title": "Kate Garraway&#39;s poignant tribute to husband Derek Draper as he&#39;s laid to rest",
        "description": "Kate Garraway made an incredibly heart-wrenching tribute to her late husband Derek Draper with a special item that she wore with her outfit during his funeral today, 2 February"
    },
    {
        "url": "https://inews.co.uk/opinion/labour-core-supporters-betrayed-haunt-keir-starmer-2886058?ico=in-line_link",
        "title": "Labour’s core supporters have been betrayed. And it will haunt <b>Keir Starmer</b>",
        "description": "Sir <b>Keir Starmer</b> addresses 400 business leaders at the Oval in London during the launch of Labour’s plan for business this week (Photo: Stefan Rousseau/PA If Labour wins the next election, the party will not bring back the cap on bankers’ bonuses."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "I mean, just look at how <b>Keir Starmer</b>, for the first two years of this parliament was doing incredibly badly in by-elections and local elections, and is now doing stunningly well in by-elections and local elections. Broadly speaking, what is the shift?"
    },
    {
        "url": "https://menafn.com/1107805151/UKS-Labour-Party-Seeks-To-Strengthen-Ties-With-British-Indians-Amid-Concerns-Of-Decline-In-Support",
        "title": "UK’S Labour Party Seeks To Strengthen Ties With British Indians Amid Concerns Of Decline In Support",
        "description": "The United Kingdom is bracing for a general election in a few months and political parties have started their campaign to gain voters in the polls. T"
    },
    {
        "url": "https://news.yahoo.com/labour-vetoes-ex-barclays-chief-193000964.html",
        "title": "Labour vetoes ex-Barclays chief for net zero job in diversity row",
        "description": "The intervention raises the prospect of Labour’s ministers in Wales being able to block the appointment indefinitely – meaning that if Sir <b>Keir Starmer</b> wins the election due later this year, Ed Miliband, Ms Coutinho’s opposite number, could re-run ..."
    },
    {
        "url": "https://www.dailypioneer.com/2024/world/labour-party-woos-british-indians-to-counter-pm-sunak.html",
        "title": "Labour party woos British Indians to counter PM Sunak",
        "description": "The UK’s Opposition Labour Party is overhauling its outreach efforts to British Indians, amid concern that the party’s support among the country’s largest ethnic minority has slumped in recent years,"
    },
    {
        "url": "https://news.yahoo.com/rooks-us-presidential-campaign-clues-101000124.html",
        "title": "Rooks: For US presidential campaign clues, look abroad",
        "description": "Those trying to decipher America’s consequential presidential election this year can glean some clues from two of our oldest and strongest allies."
    },
    {
        "url": "https://theweek.com/tech/deepfake-porn-a-rising-tide-of-misogyny",
        "title": "Deepfake porn: a rising tide of misogyny",
        "description": "Until recently, the creation of a convincing &quot;deepfake&quot; – a photo or video of an individual that has been digitally manipulated but looks real – required considerable expertise, hundreds of images and massive computing power, said Arwa Mahdawi in The Guardian ."
    },
    {
        "url": "https://www.spectator.com.au/2024/02/labours-trans-inclusive-conversion-therapy-ban-will-be-a-disaster/",
        "title": "Labour’s ‘trans inclusive’ conversion therapy ban will be a disaster",
        "description": "Keir Starmer has a reputation for changing his mind. But on one issue at least, the Labour leader remains worryingly consistent. Addressing an LGBT+ Labour meeting in Parliament this"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/grammys-2024-most-memorable-iconic-best-performances-ever_uk_65b8f18ee4b01c5c3a381938?d_id=7256879&ncid_tag=fcbklnkukhpmg00000007",
        "title": "Grammys 2024: 34 Most Memorable Performances That Got The Whole World Talking",
        "description": "Every year, the biggest musicians in the world gather under one roof to find out whether they’ve been honoured with the industry’s biggest accolade – a Grammy. For us mere mortals, though, what gets us most excited are the A-list performances, with ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/news/world/time-is-running-out-for-uks-prime-minister-rishi-sunak/news-story/de129cf25071569c1a546ae15ffdae9f",
        "title": "Time is running out for UK’s prime minister Rishi Sunak",
        "description": "If Rishi Sunak’s political dreams were made when he become the United Kingdom’s prime minister, what must he be thinking now?"
    },
    {
        "url": "https://timesofindia.indiatimes.com/nri/other-news/uks-labour-party-trying-to-reconnect-with-british-indians-amid-fears-of-slump-in-support/articleshow/107379099.cms",
        "title": "UK&#39;s Labour Party trying to reconnect with British Indians amid fears of slump in support",
        "description": "The Labour Party led by Keir Starmer has taken a series of measures designed to reconnect with British Indians, including hiring two community outreac"
    },
    {
        "url": "https://finance.yahoo.com/news/national-joke-british-rail-looms-060000259.html",
        "title": "National joke British Rail looms over Labour’s bid to take back control of trains",
        "description": "British Rail finally reached the end of the line in 1994 when John Major kicked off its privatisation. Now, Labour wants to resurrect the state-owned system. Sir Keir Starmer’s party has made a promise to take back control of the railways as one of the party’s flagship policies running into election year."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862293/reform-uk-tories-barnsley-rishi-sunak",
        "title": "&#39;We are talking to MPs&#39;: Dispirited Tories ready to jump ship, says Reform UK recruiter",
        "description": "EXCLUSIVE: David White says he is getting calls from everyone from parish councillors to mayors of district and borough councils."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/netflix-new-films-tv-shows-february-2024-best-streaming_uk_65bd0fdfe4b05c8779f8f711?d_id=7256854&ncid_tag=fcbklnkukhpmg00000001",
        "title": "These Are Our Top Picks Of The New Films And Shows To Watch On Netflix In February 2024",
        "description": "Between the romantic drama One Day, the Oscar-nominated Past Lives and Avatar: The Last Airbender, there&#39;s plenty to keep us entertained."
    },
    {
        "url": "https://www.yahoo.com/news/newspaper-headlines-killers-unmasked-clapham-050540670.html",
        "title": "Newspaper headlines: Killers &#39;unmasked&#39; and Clapham suspect asylum &#39;outcry&#39;",
        "description": "Saturday&#39;s papers feature the faces of Brianna Ghey&#39;s killers, as their identities have been revealed for the first time."
    },
    {
        "url": "https://telanganatoday.com/uks-labour-party-launches-measures-to-reconnect-with-british-indian-voters",
        "title": "UK’s Labour Party launches measures to reconnect with British Indian voters",
        "description": "Nearly two-thirds of British Indians, who form the second-largest immigrant group in the UK, and the largest minority-ethnic group, supported Labour for years."
    },
    {
        "url": "https://www.thehindu.com/news/international/on-course-for-power-uks-opposition-labour-prepares-for-a-quick-change/article67804807.ece",
        "title": "On course for power, U.K.’s Opposition Labour prepares for a quick change",
        "description": "If Labour defeats the governing Conservatives at this year’s nationwide vote, its leader Keir Starmer will replace Rishi Sunak within hours"
    },
    {
        "url": "https://www.politico.eu/article/uk-election-2024-saving-conservatism-center-must-hold/",
        "title": "Saving Conservatism: The center must hold",
        "description": "As the specter of populism now stretches across the West, it’s diminishing our collective ability to check the advance of authoritarianism."
    }
]