[
    {
        "url": "https://www.iwradio.co.uk/news/video/keir-starmer-accuses-weak-sunak-of-harbouring-extremists-in-his-party/",
        "title": "<b>Keir Starmer</b> accuses &#39;weak&#39; Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "Sir <b>Keir Starmer</b> has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for &quot;Islamophobic&quot; comments. The Labour leader said Rishi Sunak&#39;s &quot;weakness&quot; allowed Lee Anderson &quot;to act with impunity&quot; and that he ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/william-wragg-lindsay-hoyle-commons-speaker-must-go-8ll2cgm73",
        "title": "Either the Speaker bowed to the mob or to <b>Keir Starmer</b>. He must go",
        "description": "Sir Lindsay Hoyle had one job: to uphold the independence of the House of Commons. When he didn’t, chaos ensued"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-gaza-government-keir-starmer-commons-b1141347.html",
        "title": "SNP to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "MPs are set to again debate calling for a ceasefire in Gaza after a previous attempt dissolved into angry recriminations and demands for the Commons Speaker to resign. The SNP said it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the last Commons debate on the subject."
    },
    {
        "url": "https://www.thesun.co.uk/news/26163303/sir-keir-starmer-fix-speaker-gaza-votes/",
        "title": "Labour MPs boasted Sir <b>Keir Starmer</b> was ‘going to fix the Speaker’ in crunch meeting over Gaza votes",
        "description": "LABOUR MPs boasted Sir <b>Keir Starmer</b> was “going to fix the Speaker” in a crunch meeting over Gaza votes which sent Parliament into meltdown. The explosive claim piles pressure on Sir <b>Keir</b> to reveal what was said in the showdown with Sir Lindsay Hoyle."
    },
    {
        "url": "https://news.sky.com/story/the-prime-minister-in-waiting-but-who-really-is-keir-starmer-13079122",
        "title": "The Prime Minister In Waiting - but who really is <b>Keir Starmer</b>?",
        "description": "The man himself may insist it isn&#39;t over until the votes are in, but Keir Starmer looks likely to be the next prime minister. Who is he and how did he get here? And why do those close to him feel the public doesn&#39;t see all of what they see?"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/donald-trumps-ally-steve-bannon-32205159",
        "title": "Donald Trump’s ally Steve Bannon predicts &#39;nationalist uprising&#39; in UK to install Nigel Farage as PM",
        "description": "Steve Bannon, who was Trump’s chief strategist in the White House, thinks Keir Starmer&#39;s Labour will crush the Tories - but Nigel Farage&#39;s Reform party will turn into &#39;a populist party, just like MAGA&#39; and take over the Conservative"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68395364",
        "title": "Newspaper headlines: &#39;Bodyguards for MPs&#39; and <b>Starmer</b> turns on Tories",
        "description": "&quot;Boot out this bigot&quot; reads the headline on the front of the Sunday Mirror, next to a picture of Lee Anderson. It reports on the Tory MP being suspended by his party following his comments about Mayor of London Sadiq Khan."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/spider-play-about-drama-school-misconduct-lifts-curtain-on-trauma-behind-the-scenes/",
        "title": "Spider: Play about drama school misconduct lifts curtain on trauma behind the scenes",
        "description": "<b>Keir Starmer</b> accuses &#39;weak&#39; Sunak of harbouring &#39;extremists&#39; in his party Sir <b>Keir Starmer</b> has accused the prime minister of harbouring extremists in his party after a senior Tory MP was suspended for &quot;Islamophobic&quot; comments. Alexei Navalny&#39;s body released ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/our-great-challenge-protect-mps-right-protest-rc2bm6j50",
        "title": "Our great challenge: protect MPs and the right to protest",
        "description": "The Speaker, Sir Lindsay Hoyle, made a mistake in accepting amendments from both Labour and the Tories on an SNP motion calling for a ceasefire in the Gaza conflict. The immediate effect was to relieve pressure on Sir <b>Keir Starmer</b>, whose MPs might"
    },
    {
        "url": "https://uk.news.yahoo.com/mps-vote-fresh-gaza-ceasefire-001302310.html",
        "title": "MPs to vote on fresh Gaza ceasefire motion after Commons chaos",
        "description": "Public and SNP pressure has forced the next prime minister, Sir <b>Keir Starmer</b>, into a U-turn – now we need to work together to force the UK government to change its position, too.” The SNP said it will publish details of its new motion following ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/lee-anderson-comments-shows-nasty-32205122",
        "title": "&#39;Lee Anderson comments shows Nasty Party is back - even many Tories are sickened&#39;",
        "description": "Moderate Tories are fleeing their party in droves, unable to put up with the effluent flowing from the hard right"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13121601/Two-faced-SNP-wont-forgiven-voters-Tories-deliver-Scotland.html",
        "title": "Two-faced SNP won&#39;t be forgiven by voters… but Tories WILL deliver for Scotland",
        "description": "That’s not just the energy sector, which Humza Yousaf, like <b>Keir Starmer</b>’s Labour Party, has betrayed. It’s the whisky industry, battered by the SNP’s minimum pricing, the Greens’ deposit return fiasco, and the threat of advertising bans and ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-24/pms-silence-is-tacit-endorsement-of-vile-remarks-by-anderson-says-mayor",
        "title": "PM’s silence is ‘tacit endorsement of vile remarks’ by Anderson, says mayor",
        "description": "Former deputy party chairman Lee Anderson lost the Tory whip after refusing to apologise for the remarks on ‘Islamists’. | ITV National News"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/lee-anderson-urged-quit-tories-32205625",
        "title": "Lee Anderson urged to quit Tories after dramatic suspension over &#39;dangerous&#39; Sadiq Khan comments",
        "description": "Mr Anderson added that they have “got control of [Labour leader <b>Keir] Starmer</b> as well”. His outburst on Friday night came after pro-Palestinian protests outside Parliament during a vote on whether to call for a ceasefire in Gaza on Wednesday."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870484/humza-yousaf-north-sea-oil-snp-tories-politics",
        "title": "Disaster for Humza Yousaf as brazen hypocrisy over North Sea oil laid bare by Tories",
        "description": "Sir <b>Keir Starmer</b> has said his party will raise the levy to 78 percent and extend it to 2029. Mr Yousaf then claimed that this has caused &quot;extreme anger&quot; in the north east of Scotland. The First Minister favours maintaining the windfall tax at 75 percent ..."
    }
]