[
    {
        "url": "https://www.thelondoneconomic.com/politics/pro-palestinian-protesters-demand-ceasefire-outside-starmers-constituency-office-363455/",
        "title": "Pro-Palestinian protesters demand ceasefire outside <b>Starmer</b>’s constituency office",
        "description": "Hundreds of pro-Palestinian protesters have gathered outside Sir <b>Keir Starmer</b>’s constituency office in north London calling for a ceasefire. Crowds blocked the road in Camden and chanted “<b>Keir Starmer</b>’s a wasteman” and “from the river to the sea ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1836743/left-wing-whitehall-rwanda",
        "title": "Warning left-wing ‘Blob’ will plot to ruin chances of sending migrants to Rwanda",
        "description": "There are fears civil servants could attempt to run down the clock and wreck the plan to send asylum seekers to Rwanda."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2023/11/19/keir-starmer-brunswick-pr-business-meeting-ahead-election/",
        "title": "<b>Starmer</b> turns to City spinner with links to Gordon Brown to broker pre-election FTSE summit",
        "description": "Sir Keir Starmer has enlisted one of the most well connected men in the City of London to broker a meeting of FTSE 100 chief executives ahead of next year’s general election. Sir Keir has “partnered” with Sir Alan Parker, the founder of PR firm Brunswick, to host a summit with company chiefs next month as the Labour leader courts business."
    },
    {
        "url": "https://www.getsurrey.co.uk/news/uk-world-news/anyone-living-near-new-electricity-28132321",
        "title": "Anyone living near a new electricity pylon set to get £10,000 off bills",
        "description": "Chancellor Jeremy Hunt is to announce the change which aims to reduce planning objections to new power projects"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/corbyn-calls-hamas-terrorist-group-and-add-israel-behind-acts-of-terror-too-363445/",
        "title": "Corbyn calls Hamas ‘terrorist group’ and adds Israel behind ‘acts of terror too’",
        "description": "Jeremy Corbyn has described Hamas as a “terrorist group” after avoiding the term on Piers Morgan: Uncensored, as he wrote an article accusing the Israeli army of being guilty of “acts of terror too”."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sarwar-refuses-to-say-if-he-would-have-backed-ceasefire-vote-6qv3jsjqf",
        "title": "Sarwar refuses to say if he would have backed ceasefire vote",
        "description": "Anas Sarwar has repeatedly refused to say if he would have defied his party’s UK leader and supported an amendment at Westminster which called for a ceasefire in Gaza. The Scottish Labour leader, in a bad-tempered interview on BBC Scotland’s The Sunday Show,"
    },
    {
        "url": "https://morningstaronline.co.uk/article/peace-campaigners-across-the-world-demand-a-ceasefire-in-gaza",
        "title": "Peace campaigners across the world demand a ceasefire in Gaza",
        "description": "PEACE campaigners across Britain joined demonstrations across the world to demand a ceasefire in Gaza as the Palestinian Red Crescent Society evacuated 31 premature babies from the “death zone” al-Shifa hospital today."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2023/11/19/stop-genocide-in-gaza-pro-palestinian-demonstrators-rally-across-europe/",
        "title": "‘Stop Genocide in Gaza’: Pro-Palestinian demonstrators rally across Europe",
        "description": "PARIS/LONDON: Thousands of protesters rallied across France and Britain on Saturday calling for a ceasefire in Gaza, while hundreds of others turned out again in cities across Europe.Protests have"
    },
    {
        "url": "https://www.theguardian.com/world/live/2023/nov/19/israel-hamas-war-live-15-dead-in-central-and-southern-gaza-attacks-say-palestinians?page=with:block-6559c4698f08ee81dbe5af88",
        "title": "Israel-Hamas war live: WHO hails al-Shifa hospital healthcare workers as ‘heroic’ amid ‘death zone’",
        "description": "US officials deny hostages-for-ceasefire deal has been reached; WHO says crippled Al-Shifa hospital has become a ‘death zone’"
    },
    {
        "url": "https://www.thenational.scot/news/23933561.gaza-ceasefire-alastair-campbell-targets-greens-list-labour-mps/",
        "title": "Gaza ceasefire: Alastair Campbell targets Greens for list of Labour MPs",
        "description": "“Yes – follow the lines sometimes from the party, but then to see - , thousands of people marching on her offices, <b>Keir Starmer</b>, whether people like him or they don’t like him, is entitled to a private life, he’s entitled to a family life."
    },
    {
        "url": "https://www.thenational.scot/news/23933561.gaza-ceasefire-alastair-campbell-targets-greens-list-labour-mp/",
        "title": "Gaza ceasefire: Alastair Campbell targets Greens for list of Labour MP",
        "description": "FORMER journalist and political strategist Alastair Campbell has accused the Green Party of &quot;nastiness&quot; for publishing a list of MPs"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-hires-city-pr-firm-153055724.html",
        "title": "Labour hires City PR firm Brunswick to build ties with big business",
        "description": "Labour leader Sir Keir Starmer is reportedly set to work with top City PR firm Brunswick to try and build better relationships with FTSE 100 companies."
    },
    {
        "url": "https://www.cityam.com/labour-hires-city-pr-firm-brunswick-to-build-ties-with-big-business/",
        "title": "Labour taps up City PR firm Brunswick to build ties with big business",
        "description": "Keir Starmer is reportedly set to work with top City PR firm Brunswick to try and build better relationships with FTSE 100 companies."
    },
    {
        "url": "https://news.sky.com/story/israel-gaza-latest-hamas-khan-younis-sky-news-live-blog-updates-12978800?postid=6790456",
        "title": "Israel-Hamas latest: &#39;Very minor details&#39; remain on hostages deal, mediator says; &#39;babies evacuated&#39; from al Shifa hospital &#39;death zone&#39;",
        "description": "<b>Keir Starmer</b> arrived at his local synagogue in north London today to meet with the Jewish community. I asked him whether he agreed with that summation. &quot;Very much this year, of course&quot; - he told me. But while he attempts to continue to improve his party&#39;s ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/nov/19/reform-uk-goes-back-to-brexit-as-it-looks-to-seize-on-tory-troubles",
        "title": "Reform UK goes back to Brexit as it looks to seize on Tory troubles",
        "description": "Party has tweaked its name and is preparing to announce hundreds of new parliamentary candidates"
    },
    {
        "url": "https://metro.co.uk/2023/11/15/israel-war-latest-gaza-al-shifa-hospital-hamas-19827296/?ico=trending-module_author_josh-milton_item-2",
        "title": "Israel-Hamas war live: 31 ‘very sick’ babies evacuated from al-Shifa hospital in Gaza",
        "description": "Hundreds of pro-Palestinian protesters also gathered outside <b>Keir Starmer</b>’s constituency office in north London calling for a ceasefire in Gaza yesterday. Crowds blocked the road in Camden and chanted ‘<b>Keir Starmer</b>’s a wasteman’ and ‘from the ..."
    },
    {
        "url": "https://news.sky.com/story/amp/pro-palestinian-protesters-crossed-line-with-demos-at-mps-homes-and-offices-says-rachel-reeves-13011529",
        "title": "Pro-Palestinian protesters &#39;crossed line&#39; with demos at MPs&#39; homes and offices, says Rachel Reeves",
        "description": "But speaking to Sky News on Sunday, Labour leader Sir <b>Keir Starmer</b> said there still remained &quot;great unity&quot; on his benches as every member was doing &quot;everything they can to alleviate the suffering we are seeing&quot;. Since the vote, some Labour MPs have faced ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/humza-yousaf-brother-law-tells-133932993.html",
        "title": "Humza Yousaf: Brother-in-law tells of ‘death and destruction’ in Gaza",
        "description": "Scottish Labour leader Anas Sarwar said he and his party would support a ceasefire when it came to a vote in Holyrood, a position which differs from that of Sir <b>Keir Starmer</b>. He told BBC Scotland’s Sunday Show: “I support a ceasefire. “I support the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-davis-polls-labour-tory-rishi-sunak-small-boats-rwanda-suella-braverman-inflation-b1121308.html",
        "title": "Senior Tory not ruling out party turnaround despite huge Labour lead in the polls",
        "description": "Moving towards the Opposition, Mr Davis claimed the crisis in the Middle East has sparked new political problems which may dent Sir <b>Keir Starmer</b>’s chances in the election. “Who would have said four weeks ago that <b>Starmer</b> will be having trouble with ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/humza-yousaf-says-doctor-brother-28135335",
        "title": "Humza Yousaf says doctor brother-in-law in Gaza is in &#39;a terrible way&#39;",
        "description": "Scottish Labour leader Anas Sarwar said he and his party would support a ceasefire when it came to a vote in Holyrood, a position which differs from that of Sir <b>Keir Starmer</b>. He told BBC Scotland&#39;s Sunday Show: &quot;I support a ceasefire. &quot;I support the end of ..."
    },
    {
        "url": "https://inews.co.uk/news/rachel-reeves-raise-taxes-public-services-voters-2732326?ico=in-line_link",
        "title": "Rachel Reeves may have to put up taxes to fund public services – the question is when she’ll tell the voters",
        "description": "Former business secretary Peter Mandelson, former cabinet secretary Gus O’Donnell, Gordon Brown’s gatekeeper Sue Nye, Tony Blair era aides Deborah Mattinson and Peter Hyman (both now <b>Keir Starmer</b> advisers) were all present. Even Bernard Donoughue ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/humza-yousaf-gaza-israel-gaza-strip-first-minister-b1121309.html",
        "title": "Humza Yousaf: Brother-in-law tells of ‘death and destruction’ in Gaza",
        "description": "Humza Yousaf has described how his brother-in-law, a hospital doctor in the Gaza strip, has witnessed “death and destruction” in the ongoing war. Mr Yousaf said his brother-in-law is in a “terrible way” as he continues to treat patients in the south of Gaza."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/nov/19/the-sight-of-david-cameron-strutting-the-world-stage-is-not-the-vote-winner-rishi-sunak-needs?ref=upstract.com",
        "title": "The sight of Lord Cameron strutting the world stage won’t save Rishi Sunak",
        "description": "The former prime minister’s return to government will be a constant reminder to voters of how long the Tories have been in power"
    },
    {
        "url": "https://www.thejc.com/news/politics/sir-keir-starmer-fears-for-family's-safety-after-labour-mps-targeted-with-abuse-5F4WfT5HAvccw416dS9Iya",
        "title": "Sir <b>Keir Starmer</b> fears for family’s safety after Labour MPs targeted with abuse",
        "description": "MPs who refused to back an SNP amendment to the King&#39;s Speech backing a ceasefire in Gaza have been targeted with abuse"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67466826.amp",
        "title": "Israel-Gaza: Protests against MPs cross a line, says Rachel Reeves",
        "description": "Some of the protests targeting MPs over the Israel-Gaza war are &quot;crossing the line&quot; into intimidation, the shadow chancellor Rachel Reeves has said. She made the comments after a demonstration was held in north London on Saturday close to Labour leader Sir Keir Starmer&#39;s constituency office."
    },
    {
        "url": "https://www.examinerlive.co.uk/news/uk-world-news/homes-certain-uk-areas-1000-28134588",
        "title": "Homes in certain UK areas to get £1,000 off bills a year under new government plans",
        "description": "People who live in certain areas of the UK will be given £1,000 off their bills a year under new government plans. Households that are situated close to new pylons and electricity substations are in line to receive the free handout, which could amount to up to £10,000 over a decade."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-67466972",
        "title": "&#39;I don&#39;t support the intimidation of MPs&#39; - Rachel Reeves on Gaza",
        "description": "Rachel Reeves has told the BBC that she supports the right to protest, but not the intimidation of MPs. Speaking with Laura Kuenssberg, the shadow chancellor was commenting on protests calling for a ceasefire in Gaza which targeted Labour MPs."
    },
    {
        "url": "https://news.sky.com/video/great-unity-in-labour-over-ending-suffering-in-israel-and-gaza-starmer-says-13011567",
        "title": "&#39;Great unity&#39; in Labour over ending suffering in Israel and Gaza, <b>Starmer</b> says",
        "description": "Labour leader Sir Keir Starmer has told Sky News, &quot;I think everybody in the party is concerned to do everything they can to alleviate the suffering we are seeing in Israel and Gaza. In that sense there is great unity&quot;."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/israel-palestine-war-europe-following-us-another-disastrous-war",
        "title": "Israel-Palestine war: Europe is following the US into another disastrous war",
        "description": "UK and EU leaders blindly following US foreign policy on Israel and Gaza obviously learned nothing from the catastrophic western interventions in Iraq and Afghanistan"
    },
    {
        "url": "https://www.heraldscotland.com/news/23933274.sarwar-insists-labour-msps-will-vote-gaza-ceasefire-holyrood/?ref=rss",
        "title": "Sarwar insists Labour MSPs will vote for Gaza ceasefire in Holyrood",
        "description": "Scottish Labour could attempt to soften a Scottish Government motion calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://news.sky.com/video/sir-keir-starmer-says-everyone-in-the-labour-party-wants-to-alleviate-the-suffering-in-israel-and-gaza-13011553",
        "title": "Sir <b>Keir Starmer</b> says &#39;everyone in the Labour party&#39; wants to &#39;alleviate the suffering&#39; in Israel and Gaza",
        "description": "Sir Keir Starmer has claimed that &#39;all is well&#39; in the Labour party amid growing concerns of divisions surrounding the Israel-Gaza ceasefire debate. Sir Keir has said he does not back a ceasefire because it would only &quot;embolden&quot; Hamas."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/reeves-protests-aimed-mps-over-105457463.html",
        "title": "Reeves: Some protests aimed at MPs over Gaza war have ‘crossed the line’",
        "description": "The Labour leadership abstained on a Commons vote on Wednesday to call for a ceasefire in Gaza but Sir <b>Keir Starmer</b> suffered the biggest rebellion of his leadership as 56 of his MPs, including 10 shadow ministers and parliamentary aides, defied the party ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/po-and-freedom-association-memo-keir-starmer",
        "title": "P&amp;O and freedom of association: a memo to <b>Keir Starmer</b>",
        "description": "Although Rishi Sunak is unlikely to pay any attention, the powerful report of the committee will have to be addressed by <b>Keir Starmer</b> if Britain is to rescue its reputation as a country that complies with the law. The committee has made clear that it is ..."
    }
]