[
    {
        "url": "https://www.ibtimes.co.uk/green-party-overtakes-tories-second-most-popular-voters-under-30-1723235",
        "title": "The Green Party Overtakes The Tories As The Second Most Popular For Voters Under 30",
        "description": "A YouGov poll revealed that for voters aged 18 to 24, the Green Party is nine per cent more popular than the Conservative Party and 12 per cent ahead of the Liberal Democrats."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24099521.sunak-wishes-king-speedy-recovery-well-wishes-pour-politicians/",
        "title": "Sunak wishes King ‘speedy recovery’ as well wishes pour in from politicians",
        "description": "Well wishes for the King have poured in from across the political spectrum after Buckingham Palace announced he was diagnosed with a form of cancer. Charles has begun a schedule of regular treatments and has been advised to postpone his public-facing duties. Prime Minister Rishi Sunak said on X: “Wishing His Majesty a full and speedy recovery."
    },
    {
        "url": "https://uk.news.yahoo.com/crises-mount-biden-hopes-rest-194623426.html",
        "title": "As crises mount, Biden’s hopes rest increasingly in his enemies’ hands",
        "description": "Biden’s eleventh-hour shift on immigration policy came in the form of a Senate-authored bill hammered out between GOP hardliner James Lankford, <b>liberal</b> <b>Democrat</b> Chris Murphy, Independent Kyrsten Sinema and White House negotiators. It was born out of ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/gateshead-pride-2024-liberal-democrat-28562767",
        "title": "First openly gay councillor in Gateshead says local Pride 2024 will people know &#39;they are not alone&#39;",
        "description": "As Gateshead gears up for its own Pride events this summer, the local authority’s first openly gay councillor, Jonathan Wallace, reflects on what Pride means to the town and the work left ahead for the LGBTQ+ community. A string of events, organised by ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/messages-support-king-charles-iii-cancer-rishi-sunak-keir-starmer-boris-johnson-b1137259.html",
        "title": "Rishi Sunak wishes King ‘speedy recovery’ as well wishes pour in for King",
        "description": "Well wishes for the King have poured in from across the political spectrum after Buckingham Palace announced he was diagnosed with a form of cancer. Charles has begun a schedule of regular treatments and has been advised to postpone his public-facing duties. Prime Minister Rishi Sunak said on X: “Wishing His Majesty a full and speedy recovery."
    },
    {
        "url": "https://inews.co.uk/news/sewage-spills-south-downs-2890157",
        "title": "Stop flushing toilet to prevent sewage spills, says South Downs Tory MP",
        "description": "A Tory MP told constituents that &#39;population growth&#39; has contributed to capacity issues within their local sewage network"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-immigration-bill-ukraine-gaza-netanyahu-b2490877.html?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "As crises mount, Biden’s hopes rest increasingly in his enemies’ hands",
        "description": "Biden is a man who spent three-plus decades as a Senate dealmaker. He may, therefore, hold out hope that he can make this one work. But given the Republican animus towards the 46th president, it’s unlikely that anyone will lift a finger to do help him — or to cross Trump — in an election year."
    },
    {
        "url": "https://www.politics.co.uk/parliament/rishi-sunaks-bet-on-rwanda-flights-with-piers-morgan-raised-as-potential-standards-issue/",
        "title": "Rishi Sunak’s bet on Rwanda flights with Piers Morgan raised as potential standards issue",
        "description": "Speaking in the House of Commons today on a point of order, Liberal Democrat home affairs spokesperson Alistair Carmichael suggested the prime minister should “declare” his Rwanda flights bet with Piers Morgan."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/lib-dems-fight-latest-cammo-development-plans",
        "title": "Lib Dems fight latest Cammo development plans",
        "description": "The local Lib Dem team have started a petition to gather signatures in objection to the develop proposals to turn over hundreds of acres of greenbelt land to more housing."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/mcarthur-meets-loganair-to-discuss-timetable-changes",
        "title": "McArthur meets Loganair to discuss timetable changes",
        "description": "Orkney’s MSP Liam McArthur has met with Loganair’s senior management to discuss the recent departure of former CEO, Jonathan Hinkles as well as concerns over changes made to Loganair’s timetable on key routes."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/husband-will-attend-post-office-inquiry-says-keegan/",
        "title": "My husband will give evidence at Post Office inquiry, says Gillian Keegan",
        "description": "Gillian Keegan has promised her husband will give evidence to the Post Office Horizon inquiry if asked as she discussed his involvement for the first time. Michael Keegan is a former head of Fujitsu,"
    },
    {
        "url": "https://thestrayferret.co.uk/lib-dems-chose-swinton-park-owner-to-stand-for-north-yorks-mayor/",
        "title": "Lib Dems chose Swinton Park owner to stand for North Yorks mayor",
        "description": "The Liberal Democrats have chosen Swinton Park owner Felicity Cunliffe-Lister as their candidate for the York and North Yorkshire mayoral election on May 2."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/24098308.lib-dems-back-felicity-cunliffe-lister-new-mayor-role/",
        "title": "Lib Dems back Felicity Cunliffe-Lister for new mayor role",
        "description": "The Liberal Democrats have announced a businesswoman and councillor as their candidate for the first mayor of York and North Yorkshire."
    },
    {
        "url": "https://www.devonlive.com/news/news-opinion/game-thrones-power-play-shows-9067057",
        "title": "&#39;Game of Thrones&#39; power play shows politics&#39; dirty side",
        "description": "Cllr Julian Brazil has expressed disappointment after claiming some of his fellow Devon Liberal Democrats collaborated to oust him as leader after just 18 months in the role."
    },
    {
        "url": "https://uk.news.yahoo.com/lib-dems-announce-candidate-york-130000302.html",
        "title": "Lib Dems announce candidate for York &amp; North Yorkshire mayor",
        "description": "The <b>Liberal Democrats</b> have revealed a businesswoman and councillor as their candidate for the first mayor of York and North Yorkshire. North Yorkshire councillor for Masham and Fountains, and owner of Swinton Park, Felicity Cunliffe-Lister has been backed ..."
    },
    {
        "url": "https://uk.news.yahoo.com/east-wiltshire-lib-dems-announce-150600690.html",
        "title": "East Wiltshire Lib Dems announce candidate for next election",
        "description": "The newly-formed <b>Liberal Democrats</b> of the soon-to-be East Wiltshire constituency have announced David Kinnaird as their prospective parliamentary candidate. The majority of East Wiltshire will be formed by the current constituency of Devizes, running down ..."
    }
]