[
    {
        "url": "https://www.kentonline.co.uk/news/national/pm-to-tell-farming-conference-government-is-by-their-side-110881/",
        "title": "PM to tell farming conference Government is ‘by their side’",
        "description": "PM to announce support including to cut ‘red tape’ to make it easier for farmers to create farm shops and other businesses on their land."
    },
    {
        "url": "https://www.newstatesman.com/politics/liberal-democrats/2024/02/inside-liberal-democrats-plan-labour",
        "title": "Labour’s “good jobs” agenda could be transformative",
        "description": "By Freddie Hayward The <b>Liberal Democrats</b> choose their enemies carefully. As John Major’s Conservative government wheezed and staggered towards its resounding defeat at the 1997 general election, the party aligned itself with New Labour and against the ..."
    },
    {
        "url": "https://thestrayferret.co.uk/andrew-jones-mp-says-lib-dems-must-have-known-about-local-leaders-anti-semitic-tweets/",
        "title": "Andrew Jones MP says Lib Dems ‘must have known’ about local leader’s anti-semitic tweets",
        "description": "Andrew Jones MP has questioned why the <b>Liberal Democrats</b> failed to act sooner on anti-semitic posts by the leader of their party in Harrogate and Knaresborough. The Lib Dems today cut ties with Cllr Pat Marsh, who represents Stray, Woodlands and Hookstone ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26045261/milkshakes-tax-fat-lib-dems/",
        "title": "Milkshakes could be hit with 24p-a-litre ‘fat tax’ if Lib Dems gain power, official party docs reveal",
        "description": "A NEW “fat tax” would be slapped on milkshakes under barmy plans from the Lib Dems. Official party policy documents show a previously unnoticed tax trap lined up for their election"
    },
    {
        "url": "https://www.independent.co.uk/climate-change/news/prime-minister-labour-rishi-sunak-steve-reed-government-b2498845.html",
        "title": "PM to tell farming conference Government is ‘by their side’",
        "description": "PM to announce support including to cut ‘red tape’ to make it easier for farmers to create farm shops and other businesses on their land."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/24129925.darlington-council-tax-increase-five-per-cent/",
        "title": "Darlington council tax to increase by five per cent",
        "description": "The rise was approved by a majority of councillors, as the local authority takes urgent measures to stave off a financial crisis. Cutbacks aimed at saving £4m per year and £16m by 2027/28 have also been announced and other savings are expected to be made through increased service charges."
    },
    {
        "url": "https://www.kentonline.co.uk/kent/news/kcc-members-approve-budget-amid-concerns-over-its-financial-302037/",
        "title": "KCC members approve budget for 2024-25",
        "description": "Under-pressure Kent County Council has passed its annual budget amid continued pressure surrounding its long-term financial viability."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-york-north-yorkshire-68342197?at_medium=RSS&at_campaign=KARANGA",
        "title": "North Yorkshire councillor should quit over &#39;antisemitic&#39; tweets",
        "description": "A North Yorkshire councillor has been urged to resign over her &quot;appalling antisemitic views&quot;. Pat Marsh posted a number of tweets on X, formerly Twitter, which prompted her suspension from the Liberal Democrat Party. The comments related to Israel&#39;s offensive against Hamas in Gaza, but Ms Marsh denied she was antisemitic."
    },
    {
        "url": "https://www.harrogate-news.co.uk/2024/02/19/andrew-jones-mp-harrogate-knaresborough-libdems-must-have-known-there-was-antisemitism-going-on/",
        "title": "Andrew Jones MP – Harrogate &amp; Knaresborough Libdems must have known there was antisemitism going on",
        "description": "Councillor Pat Marsh, the most senior Libdem in Harrogate and Knaresborough has been exposed for making antisemitic tweets, over many weeks. She was"
    },
    {
        "url": "https://inews.co.uk/news/politics/triple-lock-pension-labour-manifesto-commitment-2914271?ico=related_article_inline",
        "title": "Triple lock pension set to be Labour manifesto commitment",
        "description": "Labour will commit to the future of the triple lock on the state pension in its general election manifesto, i understands. The party is set to confirm that if it is elected, it will continue to increase the state pension each year by the same level as inflation, average earnings growth or 2.5 per cent – whichever is highest."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/leader-calls-for-antisemitic-comments-councillor-to-consider-future-4524799",
        "title": "Leader calls for ‘antisemitic’ comments councillor to consider future",
        "description": "The leader of North Yorkshire Council has called on a long-serving councillor to consider her position as an elected community representative over ‘antisemitic’ comments she made on social media."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/mcarthur-responds-to-yousaf-speech-to-energy-sector",
        "title": "McArthur responds to Yousaf speech to energy sector",
        "description": "Responding to Humza Yousaf&#39;s energy speech, Scottish Liberal Democrat climate emergency spokesperson Liam McArthur MSP said:"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-criticises-halt-to-nhs-building-projects",
        "title": "Cole-Hamilton criticises halt to NHS building projects",
        "description": "Responding to the news that at least a dozen NHS construction projects across Scotland have been delayed or paused for up to two years as a result of budget pressures, Scottish Liberal Democrat leader"
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/former-harrogate-mayor-and-liberal-democrat-councillor-suspended-over-series-of-antisemitic-comments-4524590",
        "title": "Former Harrogate mayor and <b>Liberal</b> <b>Democrat</b> councillor suspended over series of ‘antisemitic’ comments",
        "description": "A long-serving Liberal Democrat councillor and former Mayor of Harrogate has been suspended by her national party over a series of “antisemitic” comments about the Israeli offensive in Gaza."
    },
    {
        "url": "https://www.huffpost.com/entry/wisconsin-redistricting_n_65d3719ce4b043f1c0ac1013",
        "title": "Wisconsin&#39;s Democratic Gov. Signs His Legislative Maps Into Law, Ending GOP Gerrymander",
        "description": "Tony Evers signed new legislative district maps into law on Monday that he proposed and that the Republicans who control the Legislature passed to avoid having the <b>liberal</b>-controlled state Supreme Court draw the lines. <b>Democrats</b> hailed the signing as a ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/triple-lock-pension-labour-manifesto-commitment-2914271?ico=more_from_this_author",
        "title": "Triple-lock pension set to be Labour manifesto commitment",
        "description": "Keir Starmer is planning to keep the policy if he becomes PM, amid fears over pensioner poverty in housing crisis"
    },
    {
        "url": "https://www.hambletontoday.co.uk/north-yorkshire-councillor-suspended-over-antisemitic-comments/",
        "title": "North Yorkshire councillor suspended over ‘antisemitic’ comments",
        "description": "A long-serving <b>Liberal</b> <b>Democrat</b> councillor and former mayor of Harrogate has been suspended by her national party over a series of “antisemitic” comments about the Israeli offensive in Gaza. Shortly after learning of Councillor Pat Marsh’s comments ..."
    }
]