[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/lib-dems-target-waitrose-women-and-ms-movers/",
        "title": "Lib Dems target ‘Waitrose women’ and ‘M&amp;S movers’",
        "description": "Strategists believe two demographics at opposite ends of the political spectrum are key to winning seats in the Tory Party’s Blue Wall"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24115160.york-library-service-fears-cuts-make-financially-unviable/",
        "title": "York library service fears cuts would make them financially unviable&#39;",
        "description": "As part of the savings, the administration has proposed cutting £300,000 from Explore’s budget in each of the next two years – meaning that after two years, the library’s service’s annual budget would have been slashed from £2.6 million to just £2 million."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/valentines-day-warning-romance-scammers-32109470",
        "title": "Valentine&#39;s Day warning as romance scammers tricked people out of £90million last year",
        "description": "Romance fraud is when people are defrauded into sending money to criminals who have gained their trust and convinced them that they are in a genuine relationship"
    },
    {
        "url": "https://www.chardandilminsternews.co.uk/news/crewkerne_news/24114317.councillor-joins-save-buses-rally-yeovil-prevent-cuts/",
        "title": "Councillor joins Save our Buses rally in Yeovil to prevent cuts",
        "description": "On Saturday, February 10, Adam Dance, Somerset Councillor for South Petherton &amp; Iselmoor, joined Somerset Bus Partnership in Yeovil to campaign to save important bus routes across Somerset . • 25: Taunton-Dulverton, including Cotford St. Luke, Norton Fitzwarren, and Wiveliscombe"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/inverness-south-councillor-colin-aitken-resigns-from-highlan-342022/",
        "title": "Inverness South <b>Liberal</b> <b>Democrat</b> Councillor Colin Aitken resigns from Highland Council",
        "description": "Liberal Democrat Councillor Colin Aitken has resigned from Highland Council having first been elected in 2021. It is understood the move is related to changes of employment and increased responsibility that are not compatible with his role as an elected member.."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/wishart-responds-to-sandness-incident",
        "title": "Wishart responds to Sandness incident",
        "description": "Shetland MSP and Scottish Liberal Democrat Beatrice Wishart MSP has responded to the incident in Sandness, Shetland, where Police Scotland confirmed that around 16:55 on Sunday 11th February officers were called to a report of a disturbance."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24114310.rebecca-pow-mp-reacts-grant-given-ymca-taunton/",
        "title": "Rebecca Pow MP reacts to grant given to YMCA Taunton",
        "description": "Rebecca Pow, MP for Taunton Deane, has said the Conservatives will continue to fund youth services following a grant given to YMCA Taunton."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/conservatives-labour-party-countryside-seats-election/",
        "title": "Tories ‘could lose more than half of England’s 100 most rural seats’",
        "description": "The Conservatives could lose more than half of the 100 most rural seats in England at the election, according to a poll that has dealt another blow to Rishi Sunak. The Survation survey showed that Labour holds a lead in the polls in the seats, which have traditionally formed Conservative heartlands."
    },
    {
        "url": "https://inews.co.uk/news/water-bosses-jail-bonus-ban-2901937?ico=most_popular",
        "title": "Water bosses should face jail time on top of bonus bans, campaigners say",
        "description": "No 10 is accused of &#39;smoke and mirrors&#39; as it announces it will consult on banning bonuses for polluting water firms&#39; bosses"
    },
    {
        "url": "https://www.thecomet.net/news/24114257.lib-dems-select-parliamentary-candidate-north-east-herts/",
        "title": "Lib Dems select parliamentary candidate for North East Herts",
        "description": "The <b>Liberal Democrats</b> have selected their parliamentary candidate for North East Hertfordshire. Ruth Brown, who has lived in Royston for 35 years, is a district and town councillor and has been deputy leader of North Herts Council for two years ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-11/water-firms-face-significant-fines-for-poor-customer-service-under-new-powers",
        "title": "Water company bosses face ban on bonuses over illegal sewage spills",
        "description": "Bosses at water companies have pocketed more than £26 million in bonuses, benefits and incentives over the last four years. | ITV National News"
    },
    {
        "url": "https://uk.news.yahoo.com/rochdale-election-formal-complaint-filed-181600199.html",
        "title": "Rochdale by-election: Formal complaint filed against Labour candidate after &#39;antisemitic&#39; remarks",
        "description": "The Labour Party has received an official complaint about its candidate in the Rochdale by-election following &quot;antisemitic&quot; comments about the 7 October attack on Israel, Sky News has learned. Labour Against Antisemitism (LAAS),"
    },
    {
        "url": "https://southwarknews.co.uk/area/southwark/council-leader-writes-community-bears-brunt-of-tory-cuts/",
        "title": "Council leader writes ‘Community bears brunt of Tory cuts’",
        "description": "This year is my tenth as a councillor. It’s a role I love, because in it I get to work with brilliant people from every part of our community. Over the last decade I’ve seen some amazing things achieved."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/nearly-half-of-sussex-children-have-not-seen-an-nhs-dentist-in-12-months-4514811",
        "title": "Nearly half of Sussex children have not seen an NHS dentist in 12 months",
        "description": "A total of 133,376 children in Sussex – nearly half – have not been seen by an NHS dentist in 12 months. That’s according to research commissioned from the House of Commons Library which estimates the number of children who weren’t seen by an NHS dentist in the year to June 2023, based on the latest data from the health service."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/conservative-vote-collapse-rural-labour-lead-election-b2494601.html",
        "title": "Senior Tories set to lose seats at next election as support in rural strongholds collapses",
        "description": "Support for the Conservatives among England’s rural voters has collapsed since 2019 with many high profile MPs at risk of losing their seats"
    },
    {
        "url": "https://www.itv.com/news/westcountry/2024-02-12/mark-harper-and-jacob-rees-mogg-among-tories-that-face-general-election-ousting",
        "title": "Mark Harper and Jacob Rees-Mogg among West Country Tories that face general election ousting",
        "description": "According to a new poll by the Country Land Business Association, the Conservatives are losing support among rural voters. | ITV News"
    },
    {
        "url": "https://www.thesun.co.uk/money/25879230/shameless-cry-customers-as-last-bank-closes-barclays/",
        "title": "‘It’s shameless’, cry customers as last bank closes in town – with clients facing 50-mile trek to nearest Barclays",
        "description": "CUSTOMERS have hit out after bosses decided to close the last bank in a town leaving locals with a 50-mile trek to their nearest Barclays branch. Locals in Leiston, Suffolk now face a 24 mile trip"
    },
    {
        "url": "https://www.palatinate.org.uk/picking-a-winner-the-conservatives-campaign-for-the-city-of-durham-begins/",
        "title": "Picking a winner? The Conservatives’ campaign for the City of Durham begins",
        "description": "Jussi-Peter Hill explores Councillor Luke Allan Holmes&#39;s selection as the Conservative candidate for the forthcoming general election."
    },
    {
        "url": "https://news.sky.com/story/amp/labour-candidate-fell-for-online-conspiracy-theory-about-hamas-attacks-shadow-minister-says-13069951",
        "title": "Labour candidate &#39;fell for online conspiracy theory&#39; about Hamas attacks, shadow minister says",
        "description": "And it is that message which resonates across Rochdale: young and old, white and black.&quot; The <b>Liberal Democrats</b> have been approached for comment. Mr Ali, a former government adviser who was made an OBE in 2020 for public service, was selected last month to ..."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/lib-dems-announce-worthing-general-election-candidates-4514059",
        "title": "Lib Dems announce Worthing general election candidates",
        "description": "The party has selected Morag Chugg, a youth support worker, to contest Worthing West. David Batchelor, a chartered surveyor from Shoreham, will contest East Worthing &amp; Shoreham. The seats are currently held by Conservatives Sir Peter Bottomley and Tim Loughton respectively."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24112713.labour-takes-lead-tories-among-politically-homeless-rural-voters/",
        "title": "Labour takes lead over Tories among ‘politically homeless’ rural voters",
        "description": "Labour has taken a narrow lead over the Conservatives among England’s rural voters, a poll has found. But while the survey suggests Conservative support has collapsed in the party’s heartlands, the head of a major countryside business association said rural voters were still “politically homeless”."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/revealed-15-million-patients-waited-12-hours-or-more-in-ae-in-past-year",
        "title": "Revealed: 1.5 million patients waited 12 hours or more in A&amp;E in past year",
        "description": "A staggering 1.5 million patients in England waited 12 hours or more after arriving at A&amp;E over the past year, new analysis by the Liberal Democrats has revealed."
    },
    {
        "url": "https://news.sky.com/story/labour-candidate-fell-for-online-conspiracy-theory-about-hamas-attacks-shadow-minister-says-13069951",
        "title": "Labour candidate &#39;fell for online conspiracy theory&#39; about Hamas attacks, shadow minister says",
        "description": "Nick Thomas-Symonds describes Councillor Azhar Ali&#39;s comments as &quot;appalling&quot;, but says he should be given the chance to &quot;rebuild trust&quot; with the Jewish community."
    },
    {
        "url": "https://uk.news.yahoo.com/joe-biden-leans-wing-conspiracy-094610590.html",
        "title": "Joe Biden leans into Dark Brandon right-wing conspiracy theory about Taylor Swift and the Super Bowl",
        "description": "Joe Biden trolled right-wing conspiracy theorists on Sunday night by sharing a meme implying he and Taylor Swift connived to bring about the Kanas City Chiefs’ victory at the 2024 Super Bowl."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tory-mps-central-london-wipeout-election-felicity-buchan-greg-hands-b1138535.html",
        "title": "Minister Greg Hands in fight to win his seat to avoid Tory wipe-out in central London, say political experts",
        "description": "The Conservatives currently hold three seats in central London but Labour is strongly targeting at least two of them"
    },
    {
        "url": "https://www.fwi.co.uk/news/labour-takes-poll-lead-over-tories-in-rural-heartlands",
        "title": "Labour takes poll lead over Tories in rural heartlands",
        "description": "The Conservatives will struggle to keep hold of to their “blue hedge” seats in rural England, if the results of a new poll are replicated in the general"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/know-upcoming-elections-084553685.html",
        "title": "All you need to know about the upcoming by-elections",
        "description": "Three by-elections are taking place this month, in the latest test of the strength of Rishi Sunak’s government."
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-13073325/NHS-crisis-wait-12-hours-treated-year.html",
        "title": "NHS crisis saw more than 1.5million A&amp;E patients have to wait at least 12 hours to be treated last year",
        "description": "More than 1.5million patients waited 12 hours after arriving at A&amp;E last year. At Blackpool Teaching Hospitals, one in four patients faced delays of 12 hours in January - the worst in the country."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/new-water-bill-rules-under-28613908",
        "title": "New water bill rules under fire - but they come into force &#39;from today&#39;",
        "description": "A new scheme to fine water companies for providing poor service to customers has been dismissed as “nothing less than a gimmick”."
    },
    {
        "url": "https://news.sky.com/story/by-election-results-will-provide-important-clues-ahead-of-next-general-election-13067764",
        "title": "By-election results will provide important clues ahead of next general election",
        "description": "Next week voters go to the polls in twin elections at Kingswood and Wellingborough - with the Tories facing a threat not just from Labour, but from Reform UK too. But emerging divisions within Labour could also check its electoral progress."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68170196",
        "title": "Crime to buses: Wellingborough by-election in charts",
        "description": "Voters in Wellingborough will choose a new MP in a by-election on February 15. It is taking place because the former Conservative MP Peter Bone was removed from his role after more than one in 10 registered constituents signed a recall petition."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/labour-takes-lead-over-tories-among-politically-homeless-rural-voters-110317/",
        "title": "Labour takes lead over Tories among ‘politically homeless’ rural voters",
        "description": "Labour has taken a narrow lead over the Conservatives among England’s rural voters, a poll has found. But while the survey suggests Conservative support has collapsed in the party’s heartlands, the head of a major countryside business association said rural voters were still “politically homeless”."
    }
]