[
    {
        "url": "https://www.mirror.co.uk/news/politics/lee-anderson-branded-racist-over-32200429",
        "title": "Lee Anderson branded &#39;racist&#39; over Sadiq Khan slur as PM told to boot him out of the Tories",
        "description": "Ex-Conservative Deputy Chairman Lee Anderson claimed that London&#39;s first Muslim mayor Sadiq Khan is controlled by Islamists as he appeared on GB News where he&#39;s a presenter"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/sadiq-khan-lee-anderson-bg-news-london-islamist-suella-braverman-b1141254.html",
        "title": "Lee Anderson&#39;s &#39;divisive and dangerous&#39; rant against Sadiq Khan condemned by Tory and Labour MPs",
        "description": "Mr Anderson made his rant after Right-wing ex-Home Secretary Suella Braverman, who was sacked by Rishi Sunak, had wrongly claimed that “the Islamists, the extremists and the anti-Semites are in charge now” following the chaos in Parliament over a Gaza ceasefire vote."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24139374.amendment-saved-visit-wiltshire-refused-council/",
        "title": "Amendment that could have saved Visit Wiltshire refused by council",
        "description": "Wiltshire Council has voted against an amendment to its budget that had the potential to save Visit Wiltshire."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lee-anderson-sadiq-khan-racism-rant-b2501640.html",
        "title": "Tory MP Lee Anderson accused of racism and Islamophobia after Sadiq Khan rant on GB News",
        "description": "Rishi Sunak is under pressure to withdraw the whip after the Tory MP claimed ‘Islamists’ had control of the London mayor"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/24140955.results-calne-chilvester-abberds-wiltshire-council-by-election/",
        "title": "Results of Calne Chilvester and Abberd&#39;s Wiltshire Council by-election",
        "description": "Liberal Democrat Councillor Robert MacNaughton received 424 votes, whilst Conservative Taylor Clarke received 283."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-edinburgh-east-fife-68381070?at_medium=social&at_campaign=Social_Flow&at_format=link&at_link_id=236D8B12-D246-11EE-A1F2-C1DE4B3AC5C4&at_bbc_team=editorial&at_link_origin=BBC_Scotland_News&at_campaign_type=owned&at_link_type=web_link&at_ptr_name=facebook_page",
        "title": "Edinburgh councillors vote to freeze council tax",
        "description": "Plans passed by the Labour administration, <b>Liberal Democrats</b> and Conservatives also included a 7% rent rise for council tenants. There will be a 22% hike in city centre parking charges. The motion was agreed with &quot;support from the majority of the chamber&quot;."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24136870.letter-false-understanding-blue-badge-awarded/",
        "title": "Letter: &#39;False understanding of how a Blue Badge is awarded&#39;",
        "description": "In the Journal&#39;s report covering the <b>Liberal Democrat&#39;s</b> attempts to re-introduce free parking for the disabled in Wiltshire Council car parks, two opposing Councillors are quoted as arguing &quot;If you can afford to drive in a fairly nice car, tax and insure ..."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/liberal-democrats-seek-to-strengthen-new-anti-slapps-legislation",
        "title": "<b>Liberal Democrats</b> seek to strengthen new anti-SLAPPs legislation",
        "description": "The Liberal Democrats are proposing to strengthen a government backed Private Members Bill."
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-government-faces-first-council-tax-rebellion",
        "title": "Scottish government faces first council tax rebellion",
        "description": "COUNCILLORS in Argyll and Bute have become the first to defy the SNP-Green Scottish government’s council tax freeze. The rural council, led by a coalition of Liberal Democrat, T"
    },
    {
        "url": "https://www.ft.com/content/de28864d-bb66-4e38-a31b-6744fc9e2dab",
        "title": "Tories ‘going backwards’ on gender equality target for candidates",
        "description": "About 70% of parliamentary candidates selected so far are male with most having a background in local government"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/council/yorks-finance-officer-warned-against-using-one-off-funds-ahead-of-budget-4531380",
        "title": "York&#39;s finance officer warned against using one-off funds ahead of budget",
        "description": "The City of York Council’s chief finance officer wrote to all councillors warning against using one-off reserves to fund public services ahead of the annual budget meeting."
    },
    {
        "url": "https://www.kentonline.co.uk/canterbury/news/bills-to-rise-as-council-passes-budget-of-common-sense-302293/",
        "title": "Canterbury City Council increases council tax bills for 2024/25 as budget agreed",
        "description": "Councillors have passed a “budget of common sense” which includes a raft of controversial new parking charges and £700,000 worth of savings."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24140323.tories-edge-win-hazlemere-by-election-33-votes/",
        "title": "Tories edge win in Hazlemere by-election by 33 votes",
        "description": "The Tories have narrowly won the Hazlemere by-election by just 33 votes as the Lib Dems were accused of lying during the campaign."
    },
    {
        "url": "https://uk.news.yahoo.com/ndp-leader-jagmeet-singh-says-192515882.html",
        "title": "NDP Leader Jagmeet Singh says Liberals and New <b>Democrats</b> have a deal on pharmacare",
        "description": "The federal Liberal government and the NDP have come to an agreement on pharmacare, clearing the way for the two parties to continue operating under the confidence-and-supply agreement that has helped keep the government in power over the past two years."
    },
    {
        "url": "https://www.devonlive.com/news/devon-news/half-devons-children-left-toothless-9103385",
        "title": "Half of Devon’s children left toothless by Tory dental plan say Lib Dems",
        "description": "North Devon&#39;s <b>Liberal Democrats</b> have slammed the Government&#39;s new dental plan as figures show 105,553 children in Devon had not been seen by an NHS dentist in 12 months - the plan was praised by North Devon MP, Selaine Saxby when it was announced earlier ..."
    },
    {
        "url": "https://thestrayferret.co.uk/harrogate-town-council-lib-dems-issue-plea-to-get-on-with-it/",
        "title": "Harrogate Town Council: Lib Dems issue plea to ‘get on with it’",
        "description": "<b>Liberal</b> <b>Democrat</b> councillors in Harrogate have urged North Yorkshire Council to speed up the process of creating a Harrogate Town Council. Harrogate was set to get its own town council in May this year along with Scarborough but it was delayed for a year ..."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/average-tax-bill-gloucester-households-9119837",
        "title": "Average tax bill for Gloucester households to top £2,138 as City Council approves 3% hike",
        "description": "<b>Liberal</b> <b>Democrat</b> group leader Jeremy Hilton (LD, Kingsholm and Wotton) said he was disheartened by the budget. He said after 20 years of Conservative rule there are no improvements to direct services to the public of Gloucester. “Services have been ..."
    },
    {
        "url": "https://inews.co.uk/opinion/mob-politics-is-putting-our-democracy-in-peril-2920946?ico=in-line_link",
        "title": "Mob politics is putting our democracy in peril",
        "description": "Sir Lindsay has spared Sir Keir Starmer’s blushes. But it has exposed something much, much darker (Photo: Jessica Taylor/UK Parliament/Getty) What a mess. The parliamentary shenanigans of Wednesday evening’s Israel-Gaza ceasefire vote may prove to be ..."
    },
    {
        "url": "https://theprint.in/world/trudeau-governments-future-looks-safer-after-ndp-says-deal-struck-on-drug-costs/1977315/",
        "title": "Trudeau government’s future looks safer after NDP says deal struck on drug costs",
        "description": "The chances of Canadian Prime Minister Justin Trudeau staying in office until an election next year appeared more certain on Friday after a political party that is keeping him in"
    },
    {
        "url": "https://www.ctvnews.ca/world/national-rifle-association-and-wayne-lapierre-are-found-liable-in-lawsuit-over-lavish-spending-1.6781414",
        "title": "National Rifle Association and Wayne LaPierre are found liable in lawsuit over lavish spending",
        "description": "The National Rifle Association and its former longtime leader were found liable Friday in a lawsuit centered on the organization&#39;s lavish spending."
    },
    {
        "url": "https://thehill.com/regulation/court-battles/4485867-supreme-court-justices-sotomayor-barrett-encourage-civility/",
        "title": "Sotomayor, Barrett encourage civility in front of nation’s governors",
        "description": "Liberal Justice Sonia Sotomayor and conservative Justice Amy Coney Barrett jointly encouraged the nation’s governors on Friday to emulate the Supreme Court’s collegiality, despite the divisive"
    },
    {
        "url": "https://barrie360.com/ndp-liberals-diabetes-birth-control/",
        "title": "(UPDATED) NDP, Liberals strike deal to cover cost of diabetes medicines, birth control",
        "description": "The federal Liberals and New Democrats have reached a deal that would allow every Canadian with a health card to access free diabetes medication and birth control, the NDP confirmed Friday."
    },
    {
        "url": "https://theprint.in/world/canadas-trudeau-looks-safer-after-junior-partner-says-it-strikes-drug-plan-deal/1977272/",
        "title": "Canada’s Trudeau looks safer after junior partner says it strikes drug plan deal",
        "description": "The chances of Canadian Prime Minister Justin Trudeau staying in office until an election next year appeared more certain on Friday after a political party that is keeping him in"
    },
    {
        "url": "https://www.gbc.gi/news/ggca-members-itld-and-treasury-it-section-begin-industrial-action",
        "title": "GGCA members at IT&amp;LD and Treasury IT Section begin industrial action",
        "description": "GGCA members at the IT and Logistics Department and the Treasury IT Section have started industrial action. They&#39;re currently refusing discretionary overtime, with all maintenance works on Government and e-Government servers being carried out during working hours."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/lee-anderson-accused-of-islamaphobia-over-attack-on-sadiq-khan_uk_65d90070e4b0cc1f2f7bb3a7",
        "title": "Lee Anderson Accused Of &#39;Islamaphobia&#39; Over Attack On Sadiq Khan",
        "description": "Lee Anderson is at the centre of a racism row after he claimed Islamists have “got control of” Sadiq Khan. The former Tory Party chairman provoked a furious backlash by saying the London mayor, who is Muslim, had “given our capital city away to his mates”."
    },
    {
        "url": "https://www.thestar.com/politics/federal/liberals-and-ndp-reach-pharmacare-deal-that-will-cover-birth-control-diabetes-drugs-sources/article_933411ae-d283-11ee-b79c-9f0ec38b9a7f.html",
        "title": "Liberals and NDP reach pharmacare deal that will cover birth control, diabetes drugs: sources",
        "description": "The deal is a critical piece of the supply-and-confidence pact between the two parties and comes ahead of a March 1 deadline to table legislation."
    },
    {
        "url": "https://news.yahoo.com/olympia-city-council-member-announces-191140088.html",
        "title": "Olympia City Council member announces run for Bateman’s House seat",
        "description": "Lisa Parshley, who was first elected to the Olympia City Council in 2017, announced that she’s launching a campaign for State House to represent the 22nd Legislative District."
    },
    {
        "url": "https://www.bignewsnetwork.com/news/274135857/thousands-of-ukrainians-homeless-in-uk-report",
        "title": "Thousands of Ukrainians homeless in UK report",
        "description": "Relationships between the refugees and their British hosts are breaking down a government study has found At least 15000 Ukrainian refug"
    },
    {
        "url": "https://menafn.com/1107891578/Haryana-CM-Presents-Budget-Opposition-Dubs-It-A-Failed-One-Ld",
        "title": "Haryana CM Presents Budget; Opposition Dubs It &#39;A Failed One&#39; (Ld)",
        "description": "In the run-up to Assembly polls, Haryana Chief Minister Manohar Lal Khattar, who also holds the Finance portfolio, on Frida"
    },
    {
        "url": "https://www.wral.com/story/secretive-conservative-groups-spending-big-to-influence-nc-democratic-primaries/21297705/",
        "title": "Secretive conservative groups spending big to influence NC Democratic primaries",
        "description": "A brand new PAC with GOP ties, and a controversial dark money group, are among the biggest players in some of North Carolina&#39;s 2024 Democratic primaries."
    },
    {
        "url": "https://electionlawblog.org/?p=141613",
        "title": "“How <b>Democrats</b> Could Disqualify Trump If the Supreme Court Doesn’t”",
        "description": "Murray and other legal scholars say that, absent clear guidance from the Supreme Court, a Trump win could lead to a constitutional crisis in Congress. Democrats would have to choose between confirming a winner many of them believe"
    },
    {
        "url": "https://www.thetimes.co.uk/article/leaders-love-a-u-turn-but-keirs-citizens-assemblies-backtrack-set-a-new-record-3h56gjbp0",
        "title": "Citizen Keir’s second-hand assembly idea sets a new record for U-turns",
        "description": "It’s not running through a field of wheat (May Jr). It’s not even accidentally becoming a Lib Dem and calling for the abolition of the"
    },
    {
        "url": "https://www.theglobeandmail.com/politics/article-politics-briefing-ndp-liberals-reach-deal-on-pharmacare-funding/",
        "title": "Politics Briefing: NDP, Liberals reach deal on pharmacare funding",
        "description": "The two parties have come to agreement to introduce first piece of a national pharmacare program that includes coverage for birth control and diabetes medication"
    },
    {
        "url": "https://time.com/6727243/u-s-economy-biden-approval-2024/",
        "title": "The Confusion About the U.S. Economy Reveals Everything About Politics Today",
        "description": "Tell me what you think about Joe Biden, and I’ll tell you what you’re going to think of the economy, writes Lee Drutman."
    },
    {
        "url": "https://www.maidenhead-advertiser.co.uk/gallery/maidenhead/194832/councillors-voteagainst-officer-recommendation-and-refuse-two-home-plans-for-castle-hill.html",
        "title": "Councillors vote against officer recommendation and refuse two-home plans for Castle Hill",
        "description": "Councillors have voted against officer recommendations and refused an application which would have seen two new homes built at a site in Castle Hill in Maidenhead."
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/local-news/west-northants-home-see-council-28693080",
        "title": "West Northants home to see council tax rise as budget passes",
        "description": "Sign up to our free email newsletter to receive the latest breaking news and daily roundups"
    },
    {
        "url": "https://www.winnipegfreepress.com/uncategorized/2024/02/23/ford-defends-political-appointments-to-judge-selection-committee",
        "title": "Ford defends political appointments to judge selection committee",
        "description": "Ontario Premier Doug Ford is defending his government’s appointments of two former staffers to a committee that helps select provincial judges, saying he’s not"
    },
    {
        "url": "https://www.theglobeandmail.com/politics/article-broad-strokes-of-deal-on-pharmacare-funding-reached-between-ndp-and/",
        "title": "Liberals and NDP reach agreement on pharmacare funding",
        "description": "Framework of deal would allow legislation to be tabled by March 1 deadline, extending NDP support of Liberal minority government"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/broadwalk-shopping-centre-plan-too-9120602",
        "title": "Broadwalk shopping centre plan &#39;too tall&#39; say Labour candidates despite council approval",
        "description": "While Labour&#39;s city leaders have backed the Redcatch Quarter scheme, its local candidates say they don&#39;t like it"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/jesmond-low-traffic-neighbourhood-axe-28691660",
        "title": "Jesmond Low Traffic Neighbourhood axe &#39;not the end&#39; as council promises new measures to cut traffic",
        "description": "Controversial bollards blocking vehicles from using residential streets as rat runs between Osborne Road and Cradlewell have been removed"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68376802",
        "title": "Conservatives need a bigger bazooka, Truss tells US right-wing event",
        "description": "Conservatives in both the US and UK need a &quot;bigger bazooka&quot; to fight the left, former PM Liz Truss has told an event in Washington DC. &quot;Unless conservatives become more active in speaking out... Western civilisation is doomed,&quot; Ms Truss said. She was speaking at the biggest annual gathering of conservatives in the US."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/council/york-councillors-vote-through-increase-in-council-tax-and-cuts-to-services-4531113",
        "title": "York councillors vote through increase in council tax and cuts to services",
        "description": "Councillors have officially voted through an increase in council tax for residents in York. At the full council budget meeting on Thursday, February 22, a majority of councillors voted to increase the basic rate of council tax by 2.0 per cent and the adult social care precept by 2.99 per cent."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24139987.york-council-finance-boss-debbie-mitchells-budget-warning/",
        "title": "York council finance boss Debbie Mitchell&#39;s budget warning",
        "description": "City of York Council’s chief finance officer Debbie Mitchell wrote to all councillors warning against using one-off reserves to fund"
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24138629.oxford-city-council-sets-budget-coming-year/",
        "title": "Oxford City Council sets its budget for the coming year",
        "description": "Oxford City Council has set its budget for the coming year and it has chosen flowers for Frideswide Square over hardship funding."
    },
    {
        "url": "https://mynewtown.co.uk/viewernews/articleId/20868/Don%27t-blame-the-fire-service-over-Council-Tax-rise%2C-says-councillor",
        "title": "Don&#39;t blame the fire service over Council Tax rise, says councillor",
        "description": "At a council meeting to discuss setting the 2024/2025 budget, Conservative Cllr Gwynfor Thomas who is also chairman of the Mid and West Wales Fire and Rescue Service Authority claimed that the council were “wrongly reporting” the Fire Service levy."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-edinburgh-east-fife-68381070?at_medium=RSS&at_campaign=KARANGA",
        "title": "Edinburgh councillors vote to freeze council tax",
        "description": "Edinburgh councillors have voted to freeze council tax, increase spending on filling potholes and shelve school cuts as they agreed the authority&#39;s £1.3bn budget for the year ahead. Plans passed by the Labour administration, Liberal Democrats and Conservatives also included a 7% rent rise for council tenants."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24139452.city-york-council-sets-budget-including-council-tax-hike/",
        "title": "City of York Council sets budget including council tax hike",
        "description": "The City of York Council’s budget for 2024/25 is approximately £150 million, but it has now saved around £14 million – £4 million of which in adult and children’s social care. Labour has blamed inadequate government funding and the exhaustion of reserves by previous administrations for the cuts."
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/24139501.folly-not-raise-wokingham-council-tax-maximum-amount/",
        "title": "‘Folly’ not to raise Wokingham council tax by maximum amount",
        "description": "Wokingham Borough Council voted to increase council tax by the maximum amount allowed – 4.99 per cent – in a budget that also includes some"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/older-suburban-women-could-hold-key-to-next-election-poll-finds-369254/",
        "title": "Older suburban women could hold key to next election, poll finds",
        "description": "Analysis by More In Common suggested the key cohort could be the key to deciding whether its a hung parliament or a landslide."
    },
    {
        "url": "https://www.fifetoday.co.uk/news/politics/council/fife-budget-5-rent-rise-confirmed-as-labour-proposal-wins-vote-4530409",
        "title": "Fife budget: 5% rent rise confirmed as Labour proposal wins vote",
        "description": "Fife councillors have officially set the new rent rates for 2024-25 with Labour’s proposed 5% rise going ahead. It won out over the SNP’s lesser bid for a 4% hike."
    },
    {
        "url": "https://www.mywelshpool.co.uk/viewernews/articleId/25439/%E2%80%98Stop-blaming-fire-service-for-council-tax-rise%E2%80%99",
        "title": "‘Stop blaming fire service for council tax rise’",
        "description": "Blaming the fire service for putting 1% onto the Council Tax in Powys needs to stop, a senior councillor has said."
    },
    {
        "url": "https://ifamagazine.com/britains-hnwis-would-vote-labour-and-want-the-incoming-government-to-prioritise-growing-the-economy/",
        "title": "Britain’s HNWIs would vote Labour and want the incoming government to prioritise growing the economy",
        "description": "Despite this recent improvement, these respondents–still believe the Labour Party will win at a General Election and the party has the biggest support of this"
    },
    {
        "url": "https://uk.news.yahoo.com/liberals-ndp-still-reasons-together-090000368.html",
        "title": "The Liberals and NDP still have reasons to work together — are they good enough?",
        "description": "If the 44th Parliament can hold it together until April 28, it will become the longest-lasting minority Parliament in modern Canadian history. This Parliament&#39;s longevity is already well above average — 823 days as of Thursday."
    },
    {
        "url": "https://www.bostonglobe.com/2024/02/23/opinion/us-elections-two-party-system/",
        "title": "The two-party doom loop",
        "description": "The US electoral system continues to amplify and reinforce divisions, feeding a tit-for-tat escalation of distrust, bad faith, and demonization."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/2024-general-election-will-decided-28688238",
        "title": "2024 General Election &#39;will be decided by older women in suburbs&#39;",
        "description": "A think tank has said the general election will be decided by a group of older women who live in the suburbs and voted Conservative in 2019"
    },
    {
        "url": "https://www.heraldscotland.com/news/24138830.liz-truss-says-world-needs-republican-white-house/?ref=rss",
        "title": "Liz Truss says world ‘needs Republican in White House’",
        "description": "Liz Truss criticised ‘conservatives in name only’ during a speech to the right-wing Cpac conference near Washington DC"
    },
    {
        "url": "https://www.somersetlive.co.uk/news/local-news/cut-somerset-communities-delighted-new-9118458",
        "title": "Cut-off Somerset communities &#39;delighted&#39; as new bus planned",
        "description": "A new bus that has been “worth fighting for” will restore a vital service to cut off communities in North East Somerset. There was outcry in Paulton after the “lifeline” 82 bus was cut last year, leaving an estate in the village without its beloved bus."
    },
    {
        "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/tax-hike-499-per-cent-9118720",
        "title": "Tax hike of 4.99 per cent approved for Hull as council budget passed",
        "description": "Councillors have approved a hike in council tax of 4.99 per cent for Hull households as part of the budget for the coming financial year."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24135302.somerset-councillors-mixed-feelings-2024-25-budget/",
        "title": "Somerset councillors have mixed feelings over 2024/25 budget",
        "description": "SOMERSET Council&#39;s balanced budget has been met with some backlash from some councillors. At the meeting on Tuesday in Bridgwater there were even protestors outside the venue, and on top of that, the meeting was a fractious affair, with Conservative ..."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24137408.somerset-politicians-react-four-bus-services-saved/",
        "title": "Somerset politicians react as four bus services are saved",
        "description": "FOUR crucial bus services in Somerset have been safeguarded for the next 12 months following a deal at the eleventh hour between the council and"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869868/tory-mps-death-spiral-poll-woe",
        "title": "Tory MPs told &#39;wake up&#39; and end Rishi Sunak&#39;s &#39;death spiral&#39; for party with new poll woe",
        "description": "EXCLUSIVE: After a terrible week for Sir Keir Starmer, Labour still increased its lead in the tracker poll leading to more questions about Rishi Sunak."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13116003/Reform-candidate-Simon-Danczuk-turned-away-Rochdale-election-hustings-George-Galloway-supporters.html",
        "title": "Reform candidate Simon Danczuk is turned away from Rochdale by-election hustings &#39;by George Galloway supporters&#39;",
        "description": "Reform UK&#39;s candidate Simon Danczuk was told by a member of staff that they had space for him to attend the husting but he couldn&#39;t speak"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/24134476.wiltshire-council-leader-called-disgrace-blue-badge-parking-row/",
        "title": "Wiltshire Council leader called &quot;disgrace&quot; in blue badge parking row",
        "description": "The proposal of reinstating free parking for disabled drivers was included in the <b>Liberal Democrats</b>’ budget amendments to the Conservatives&#39; draft council budget. The amendment was refused at the full council meeting on Tuesday, February 20, with 28 ..."
    },
    {
        "url": "https://www.petersfieldpost.co.uk/news/lib-dem-roland-richardson-wins-four-marks-and-medstead-by-election-667331",
        "title": "Lib Dem Roland Richardson wins Four Marks and Medstead by-election",
        "description": "<b>Liberal</b> <b>Democrat</b> Roland Richardson was elected as an East Hampshire district councillor in the Four Marks and Medstead by-election on February 15 with 62.2 per cent of the vote. Cllr Richardson received 1,212 votes, with the only other candidate ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/edinburgh-dog-cat-home-find-28688700",
        "title": "Edinburgh Dog and Cat Home find XL Bully owner at eleventh hour as ban comes into place",
        "description": "We must also, at the same time, ensure that the highest standard of animal welfare are maintained. &quot;Scottish <b>Liberal Democrats</b> are supportive of the measures and safeguards recently announced by the Scottish Government. &quot;However, it’s clear that a more ..."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24133223.reform-uk-candidate-mayor-london-howard-cox/",
        "title": "Who is Reform UK candidate for Mayor of London Howard Cox?",
        "description": "Reform UK London mayoral candidate Howard Cox at the party&#39;s campaign launch in Westminster, central London. FairFuelUK founder Mr Cox is running as the Reform UK candidate in the 2024 mayoral race and insisted he can beat Sadiq Khan. (Image: PA)"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/scotlands-xl-bully-restrictions-come-32189790.amp",
        "title": "Scotland&#39;s XL Bully restrictions come into force as desperate search to rehome dogs ends",
        "description": "It becomes illegal to sell, exchange, gift or abandon the breed in Scotland today, meaning any dogs which did not find homes face being put down or confined to kennels for life."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/somerset-news/government-website-gets-somerset-towns-9120197",
        "title": "Government website gets its Somerset towns mixed up",
        "description": "In a post on X (formerly Twitter), leader of North Somerset Council Mike Bell (Weston-super-Mare Central, <b>Liberal Democrats</b>) pointed out: “The PM is on a UK tour to promote ‘Levelling Up.’ I&#39;m worried he might struggle to find Weston! On the official ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/bristol-parks-could-receive-700k-9120079",
        "title": "Bristol parks could receive £700k boost if Tories secure change to council budget",
        "description": "This capital amendment is an opportunity to reverse this trend and bring back some much-needed investment.” <b>Liberal Democrats</b> supported the amendment, while Labour councillors abstained and Greens voted against it. The Green party failed to suggest any ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-boris-johnson-election-2024-b2500764.html",
        "title": "Older suburban women who voted for Boris Johnson ‘hold key to next election’",
        "description": "<b>Liberal Democrats</b> or Reform UK decide to vote tactically.” The cost of living remains a key concern, listed as the number one issue by every voter group despite the fall in inflation over the past year, while concerns about crime and the NHS were ..."
    },
    {
        "url": "https://inews.co.uk/opinion/infantile-mps-political-games-gaza-burns-2917672?ico=in-line_link",
        "title": "As our infantile MPs play political games, Gaza burns",
        "description": "But it wasn’t to be. Speaker Lindsay Hoyle took the unusual decision to allow both and spare Starmer’s blushes. The <b>Liberal Democrats</b> also felt the need to get involved, putting forward an amendment demanding an “immediate bilateral ceasefire”."
    }
]