[
    {
        "url": "https://www.cornish-times.co.uk/news/edwina-was-a-great-community-champion-in-my-view-with-jim-candy-664874",
        "title": "&quot;Edwina was a great community champion&quot; - In My View with Jim Candy",
        "description": "There is a huge hole in the hearts of many people in SE Cornwall with the passing of Looe West, Cornwall Councillor Edwina Hannaford, but especially amongst those in the local <b>Liberal Democrats</b>. Edwina was passionate about people, always prepared to help ..."
    },
    {
        "url": "https://www.mnrjournal.co.uk/news/bath-mp-demands-burglary-response-guarantee-as-74-of-cases-go-unsolved-in-avon-and-somerset-665095",
        "title": "Bath MP demands &quot;Burglary Response Guarantee&quot; as 74% of cases go unsolved in Avon and Somerset",
        "description": "New analysis from the Liberal Democrats has revealed that a staggering 4,535 burglaries went unsolved across Avon and Somerset in the year ending September 2023."
    },
    {
        "url": "https://redditchstandard.co.uk/news/redditch-news-letters-councillor-defection-tax-rise/",
        "title": "LETTERS - councillor defection, and tax rise controversy",
        "description": "I NOTE a Labour councillor has defected to the inappositely named <b>Liberal Democrats</b>, a party whose past activities appear to hold both concepts in disdain. A view reinforced by Mr Thompson, presumably their local leader, being ‘delighted’ and ..."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24109579.gideon-amos-vows-help-threatened-somerset-bus-routes/",
        "title": "Gideon Amos vows to help threatened Somerset bus routes",
        "description": "GIDEON Amos, the <b>Liberal</b> <b>Democrat</b> parliamentary candidate for Taunton and Wellington, has vowed to help save four threatened bus routes in the county. Buses of Somerset has said that routes 25, 28, 54, and 58 could be withdrawn or reduced without ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "The Telegraph’s poll tracker shows that Labour continues to have a dominating lead over the Tories, who were last ahead in late 2021. On Thursday, the Conservative Party will face by-elections in both Kingswood and Wellingborough, which had both been Tory seats."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067773/Prince-William-hires-ex-government-diplomat.html",
        "title": "Prince William hires ex-government diplomat as private secretary as he returns to royal duties after King Charles&#39; cancer diagnosis",
        "description": "Ian Patrick, who has also worked for former Liberal Democrat leader Lord Ashdown, will take up the role, Kensington Palace said on Friday."
    },
    {
        "url": "https://www.standard.co.uk/news/health/london-hospitals-repair-patient-safety-b1138171.html",
        "title": "£3bn needed to fix London’s crumbling hospitals amid safety warning",
        "description": "More than £3 billion is needed to fix crumbling hospitals in London, the Standard can reveal, with fears that patients could come to harm if urgent repairs to buildings are not completed."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-of-wales-liberal-democrat-charles-government-kensington-palace-b1138320.html",
        "title": "William appoints former government diplomat as private secretary",
        "description": "The Prince of Wales has appointed a former Government diplomat as his private secretary, as he returns to royal duties following his father’s cancer diagnosis. Ian Patrick, who has also worked for former Liberal Democrat leader Lord Ashdown, will take up the role, Kensington Palace said on Friday."
    },
    {
        "url": "https://www.markpack.org.uk/172516/anna-sabine-selected-for-frome-and-east-somerset/",
        "title": "Anna Sabine selected for Frome and East Somerset",
        "description": "Members have selected local businesswoman Anna Sabine as Parliamentary candidate for the new marginal Frome and East Somerset constituency."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-byelection-peter-bone-general-election-labour-tory-b2492855.html",
        "title": "Wellingborough by-election: Will voters punish the Tories for Peter Bone’s sins?",
        "description": "On the walk from Wellingborough station into the town centre, there’s not a single Conservative poster or billboard to be seen"
    },
    {
        "url": "https://www.brixtonbuzz.com/2024/02/dental-plan-too-little-too-late-for-182362-children-not-seen-by-an-nhs-dentist-in-south-east-london/",
        "title": "Dental plan “too little too late” for 182,362 children not seen by an NHS dentist in South East London",
        "description": "Lambeth’s Liberal Democrats have slammed the Government’s new dental plan as figures show 182,362 children in South East London had not been seen by an NHS dentist in 12 months."
    },
    {
        "url": "https://inews.co.uk/news/politics/all-labour-policies-election-manifesto-green-2899366?ico=above_article_ticker",
        "title": "All of Labour’s policies so far, and whether they’ll make it into the manifesto",
        "description": "With an election on the horizon Sir Keir Starmer&#39;s party has already made dozens of pledges. Here is everything you need to know"
    },
    {
        "url": "https://feweek.co.uk/tory-constituencies-hit-hard-by-apprenticeship-levy-introduction/",
        "title": "Tory constituencies hit hard by apprenticeship levy introduction",
        "description": "Headline apprenticeship starts in England took a hit when the government introduced the apprenticeship levy in April 2017. Around 500,000 apprentices enrolled each year between 2014 and 2017, but after the first full year of the levy, that number had reduced to 376,000."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/24109559.fury-politicians-accused-hijacking-major-dorset-housing-campaign/",
        "title": "Fury as politicians accused of hijacking major Dorset housing campaign",
        "description": "ONE man is this picture is not happy to be there - and is accusing the <b>Liberal Democrats</b> of ‘hijack’. Conservative Gerald Duke (back left) says he was ‘shocked and upset’ to find himself featured in the Lib Dem Focus campaign leaflet. He claims ..."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24102004.labour-explains-response-apprenticeship-decline/",
        "title": "Labour explains response to apprenticeship decline",
        "description": "Responding to Labour’s statement in National Apprenticeship Week, Calum Miller, <b>Liberal</b> <b>Democrat</b> parliamentary candidate for Bicester and Woodstock and county councillor for Otmoor, said: “Every person deserves the chance to develop their skills ..."
    },
    {
        "url": "https://news.sky.com/story/prince-of-wales-appoints-ex-diplomat-as-private-secretary-13067934",
        "title": "Prince of Wales appoints ex-diplomat as private secretary",
        "description": "The Prince of Wales has appointed a former government diplomat as his private secretary, as he returns to royal duties following his father&#39;s cancer diagnosis. Ian Patrick, who has also worked for former Liberal Democrat leader Lord Paddy Ashdown, will take up the role, Kensington Palace said on Friday."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/alistair-carmichael-predicts-lib-dems-32088790",
        "title": "Alistair Carmichael predicts Lib Dems could be in Scottish Government by 2026",
        "description": "EXCLUSIVE: The Scottish MP said the Lib Dems &quot;would have an opportunity to have a role in government&quot; if they return more than 15 seats at the next Holyrood election."
    },
    {
        "url": "https://inews.co.uk/news/sunak-promises-tax-cuts-long-term-spring-budget-speculation-2900362?ico=related_article_inline",
        "title": "Sunak promises to deliver tax cuts in ‘long term’ amid Spring Budget speculation",
        "description": "Rishi Sunak has promised to deliver tax cuts in the “long-term” amid growing speculation about next month’s Spring Budget. In an interview with The Times, the Prime Minister said that the “trajectory” of his government was to cut taxes but would not specify how or when."
    },
    {
        "url": "https://uk.news.yahoo.com/fury-politicians-accused-hijacking-major-050000458.html",
        "title": "Fury as politicians accused of hijacking major housing campaign",
        "description": "ONE man is this picture is not happy to be there - and is accusing the <b>Liberal Democrats</b> of ‘hijack’. Conservative Gerald Duke (back left) says he was ‘shocked and upset’ to find himself featured in the Lib Dem Focus campaign leaflet. He claims ..."
    },
    {
        "url": "https://www.telegraph.co.uk/us/politics/2024/02/09/biden-classified-documents-report-takeaways-reactions-live/?utmsource=email",
        "title": "&#39;This is the worst day of Joe Biden&#39;s presidency&#39;, <b>Democrats</b> admit",
        "description": "Ms Haley, who is running a distant second in the Republican presidential primary, added that the <b>Democrats</b> were seemingly poised to drop Mr Biden as their candidate. <b>Liberal</b> media outlets have appeared to downplay concerns about Joe Biden’s memory ..."
    },
    {
        "url": "https://edition.cnn.com/2024/02/09/opinions/border-bill-gop-democrats-immigration-campoamor/index.html",
        "title": "Opinion: Playing ball on border bill comes back to bite <b>Democrats</b>",
        "description": "Read more opinion on CNN. Now, the path to any hope for immigration reform in the near future is all but blocked, and <b>Democrats</b> seem perplexed. More than a few <b>liberal</b> legislators have been scratching their heads at the notion that their political ..."
    },
    {
        "url": "https://inews.co.uk/news/sunak-promises-tax-cuts-long-term-spring-budget-speculation-2900362",
        "title": "Sunak promises to deliver tax cuts in ‘long term’ amid Spring Budget speculation",
        "description": "Rishi Sunak has promised to deliver tax cuts in the “long-term” amid growing speculation about the content of next month’s Spring Budget. In an interview with The Times, the Prime Minister said that the “trajectory” of his government was to cut taxes but would not specify how or when."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-outlines-response-fall-apprenticeships-050000897.html",
        "title": "Labour outlines response to fall in apprenticeships",
        "description": "Cherwell has seen a 15.7 per cent fall in apprenticeships since 2015, according to an analysis by Cherwell Labour."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067701/woking-council-public-toilets-closed-surrey.html",
        "title": "Bankrupt Woking Council will close almost all of its public toilets and get rid of up to 60 staff in attempt to save £8million to help fill budget hole",
        "description": "The <b>Liberal Democrats</b> have run the council since 2022. The Conservatives — who implemented the investment strategy — were in control before. Council leader Ann-Marie Barker said: &#39;I know residents will find any reduction in services difficult. &#39;"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24111032.james-daly-paddy-mcguinness-clash-question-time/",
        "title": "James Daly and Paddy McGuinness clash on Question Time",
        "description": "Bury North MP James Daly and TV star Paddy McGuiness clashed on last night’s Question Time in a debate surrounding NHS funding."
    }
]