[
    {
        "url": "https://www.bbc.co.uk/news/uk-england-york-north-yorkshire-68343542",
        "title": "York libraries: Protesters rally against proposed funding cuts",
        "description": "Protesters gathered outside a city library ahead of a council vote on proposed funding cuts. City of York Council has shared plans for library cuts totalling £600,000 over the next two years. The unitary authority said the move was necessary due to &quot;huge demands&quot; on its budget - but stressed no libraries would close at this stage."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24138694.truss-says-world-needs-republican-white-house-not-mention-trump/",
        "title": "Truss says world ‘needs Republican in White House’ but does not mention Trump",
        "description": "Liz Truss criticised ‘conservatives in name only’ during a speech to the right-wing Cpac conference near Washington DC."
    },
    {
        "url": "https://inews.co.uk/opinion/mob-politics-is-putting-our-democracy-in-peril-2920946?ico=related_article_inline",
        "title": "Mob politics is putting our democracy in peril",
        "description": "The ceasefire debate has lifted the most divisive form of sectarian politics from the gutter of social media right into the House of Commons chamber. On Wednesday, Hoyle allowed the Labour amendment through to protect MPs who would otherwise receive violent threats if they could not somehow back a ceasefire."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869792/reform-uk-conservative-general-election-polling",
        "title": "Reform UK surge in bombshell poll as gap closes with Tories on brink of landslide defeat",
        "description": "Reform UK has narrowed the gap with the Conservatives in a bombshell new poll, that saw the Tories sink to new lows in the latest voting intention poll. The latest YouGov/Times poll shows the Tories on 20 percent, a four percentage point drop from the last poll on February 14-15."
    },
    {
        "url": "https://uk.news.yahoo.com/libraries-much-more-books-rally-174006067.html",
        "title": "&#39;Libraries are so much more than books&#39;: Rally against cuts to Explore budget",
        "description": "A rally has been staged in York city centre against planned cuts to library services. Members of the <b>Liberal Democrats</b> and Green Party staged the event outside York Explore Library at 4.30pm today (February 22), ahead of a crunch City of York Council ..."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/conservative-police-crime-commissioner-chris-9115914",
        "title": "Conservative police and crime commissioner Chris Nelson to stand for re-election",
        "description": "“He has also now shown he is nothing more than a shameless political opportunist, declaring himself as a <b>Liberal</b> <b>Democrat</b> and admitting that it is to simply increase his chances of winning, despite his previous claims to be &#39;keeping politics out of ..."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24137809.yeovil-mp-candidate-defends-absence-somerset-budget/",
        "title": "Yeovil MP candidate defends absence from Somerset budget",
        "description": "A prominent Somerset councillor was not able to attend a crucial budget vote because he was “stuck in traffic” coming back from London"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24138483.york-lib-dems-organise-rally-council-library-cuts/",
        "title": "York Lib Dems organise rally against council library cuts",
        "description": "A rally has been staged in York city centre against planned cuts to library services. Members of the <b>Liberal Democrats</b> and Green Party staged the event outside York Explore Library at 4.30pm today (February 22), ahead of a crunch City of York Council ..."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24138480.york-lib-dems-urge-labour-use-whitehall-1-6m-protect-services/",
        "title": "York Lib Dems urge Labour to use Whitehall £1.6m to &#39;protect services&#39;",
        "description": "The party says the cuts are needed to set a balanced budget - and save the authority from bankruptcy. But the <b>Liberal Democrats</b> say Labour could use an extra £1.6 million of cash just earmarked to the council by Whitehall to protect key services."
    },
    {
        "url": "https://www.disabilitynewsservice.com/disabled-politician-wont-fight-general-election-after-intolerable-hate-crime/",
        "title": "Disabled politician won’t fight general election after ‘intolerable’ hate crime",
        "description": "A disabled politician has announced he will not stand for his party at the next general election because of the rising and “intolerable” levels of hate crime directed towards him as someone with a"
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7269860",
        "title": "Politics latest: Sunak criticises Speaker&#39;s &#39;very concerning&#39; handling of Gaza ceasefire votes",
        "description": "There are now 66 MPs who have signed a motion of no confidence in Speaker Sir Lindsay Hoyle. The <b>Liberal</b> <b>Democrat</b> leader Sir Ed Davey has told Sky News the party does retain confidence in the Speaker (more here). &#39;You&#39;ve got to respect the ref&#39;: Gove backs ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/22/humza-yousaf-freeze-council-tax-pledge-bills-hiked-snp/",
        "title": "Humza Yousaf’s pledge to freeze council tax in tatters after authority hikes bills",
        "description": "Humza Yousaf’s pledge to freeze council tax for all Scots has been broken after a town hall confirmed it would hike bills by 10 per cent. Argyll and Bute council voted on Thursday to defy the Scottish Government and reject the freeze, claiming it was the only way to avoid deep cuts to services and jobs."
    },
    {
        "url": "https://www.leightonbuzzardonline.co.uk/news/politics/council/libdems-propose-amendments-to-get-leighton-buzzard-leisure-centre-back-on-track-ahead-of-central-beds-councils-final-budget-meeting-4529933",
        "title": "LibDems propose amendments to get Leighton Buzzard leisure centre back on track ahead of Central Beds Council&#39;s final budget meeting",
        "description": "Two amendments are being proposed by the <b>Liberal</b> <b>Democrat</b> group on Central Bedfordshire Council at tonight’s (Thursday, February 22) budget full council meeting. The first would put building the new Leighton Buzzard leisure centre back on track ..."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24136160.wiltshire-council-leader-called-disgrace-blue-badge-parking-row/",
        "title": "Wiltshire Council leader called &quot;disgrace&quot; in blue badge parking row",
        "description": "Addressing the chamber before the vote, Councillor Grant called the September 2022 decision to introduce parking charges for blue badge holders"
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/politics/liberal-democrat-general-election-candidate-for-corby-constituency-announced-4529851",
        "title": "<b>Liberal</b> <b>Democrat</b> general election candidate for Corby constituency announced",
        "description": "Chris Lofts has been selected as the candidate who will run against incumbent Conservative Tom Pursglove and Labour candidate Lee Barron.Chris has lived in Northamptonshire since 1996, where he is married with two daughters and two granddaughters."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/council/york-liberal-democrats-say-councils-housing-executive-should-have-resigned-4529824",
        "title": "York <b>Liberal Democrats</b> say council&#39;s housing executive should have resigned",
        "description": "York <b>Liberal Democrat&#39;s</b> Coun Darryl Smalley said: “This bombshell report shows the difference between the previous [<b>Liberal</b> <b>Democrat</b>] administration and the new one. “The previous administration treated the Salvation Army with respect, the new Labour ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/south-gloucestershire-council-tax-payments-9118417",
        "title": "South Gloucestershire council tax payments set to rise for every household from April",
        "description": "Parking charges are now set to be introduced to many South Gloucestershire Council car parks across the district"
    },
    {
        "url": "https://www.huntspost.co.uk/news/24137033.huntingdonshire-garden-waste-collection-charge-decision/",
        "title": "Huntingdonshire garden waste collection charge decision",
        "description": "Councillor Brett Mickelburgh (<b>Liberal</b> <b>Democrat</b>), executive councillor for finance and resources, highlighted that this increase was below inflation. Councillor Jonathan Gray, leader of the Conservative opposition group, called on the joint administration ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24137633.alba-hits-time-wasting-snp-lack-independence-action/?ref=rss",
        "title": "Alba hits out at &#39;time wasting&#39; SNP over lack of independence &#39;action&#39;",
        "description": "He said that the “Building a New Scotland series of prospectus papers… set out the positive case for independence as an alternative to the broken Brexit Britain now in recession, supported by the Tories, Labour and <b>Liberal Democrats</b>.” READ MORE ..."
    },
    {
        "url": "https://uk.news.yahoo.com/councillor-mp-candidate-defends-absence-180000099.html",
        "title": "Councillor and MP candidate defends absence from budget vote due to ‘traffic’",
        "description": "Councillor Adam Dance sits on Somerset Council’s executive, holding the portfolio for public health, equalities and diversity, and is one of two <b>Liberal</b> <b>Democrat</b> councillors for the South Petherton and Islemoor division. Mr Dance was selected in April 20 ..."
    },
    {
        "url": "https://southwarknews.co.uk/area/borough/council-tax-meeting-overshadowed-by-clashes/",
        "title": "Council tax meeting overshadowed by clashes",
        "description": "A Southwark town hall meeting to set the council tax for the coming year was overshadowed by clashes between Labour and <b>Liberal</b> <b>Democrat</b> councillors, with accusations of lies, political point scoring and personal insults levelled. Southwark councillors ..."
    }
]