[
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/176-million-patients-waited-four-28643024",
        "title": "17.6 million patients waited four weeks or longer to see a GP in 2023, NHS data reveals",
        "description": "The number of patients who had to wait four weeks or more for a GP appointment last year rose by 38% compared to 2022 figures"
    },
    {
        "url": "https://www.libdemvoice.org/council-budgets-allow-us-to-put-liberal-values-into-practice-74657.html",
        "title": "Council Budgets allow us to put <b>Liberal</b> Values into practice",
        "description": "Lib Dems are addressing the Cost of Living, providing community level services and decision making and Greener boroughs. Next Wednesday, the Southwark Liberal Democrat group will be presenting our Alternative Budget at full council."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-68309471",
        "title": "New Watford Overground name set to inspire sportswomen",
        "description": "A London Overground line is changing its name in the hope of inspiring more women to take up sport. Transport for London (TFL) announced the stopper service between Euston and Watford will be named the Lioness Line. TFL said name is to honour the England women&#39;s football team&#39;s achievements."
    },
    {
        "url": "https://www.eadt.co.uk/news/24123162.barclays-local-set-open-leiston-replace-branch/",
        "title": "A Barclays Local is set to open in Leiston to replace branch",
        "description": "A prospective parliamentary candidate has accused Barclays of &#39;palming off&#39; customers over plans to open a Barclays Local in Leiston in Suffolk."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24120187.wiltshire-councillors-debate-u-turn-disabled-parking-charges/",
        "title": "Wiltshire councillors debate U-turn on disabled parking charges",
        "description": "Blue-badge holders in Wiltshire could get free parking back after charges were re-introduced less than two years ago, if the Lib Dem’s"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088625/Stop-Boats-stop-Reform-UK-Poll-finds-immigration-priority-insurgent-partys-backers-Rishi-Sunak-faces-fifth-2019-Tory-voters-defecting-Nigel-Farage-outfit.html",
        "title": "&#39;Stop the Boats&#39; to stop Reform UK? Poll finds immigration is top priority for insurgent party&#39;s backers - as Rishi Sunak faces a fifth of 2019 Tory voters defecting to Nigel ...",
        "description": "A YouGov survey of more than 4,000 people revealed 19 per cent of those who previously supported the Tories would switch to the party founded by Nigel Farage."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/health/number-people-waiting-four-weeks-28641654",
        "title": "Number of people waiting four weeks or longer to see GP rises",
        "description": "The number of appointments where people waited four weeks or longer for a GP last year rose by 38% on 2022&#39;s figures to 17.6 million"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-responds-to-fall-in-nursing-applications-for-third-year-in-a-row",
        "title": "Cole-Hamilton responds to fall in nursing applications for third year in a row",
        "description": "Responding to the embargoed data from UCAS which shows that for the third year in a row the number of applicants for nursing courses in Scotland has dropped, down by 8.3% compared to the same point last year,"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/more-than-150000-scots-see-their-work-affected-due-to-spiralling-nhs-waits",
        "title": "More than 150,000 Scots see their work affected due to spiralling NHS waits",
        "description": "Scottish Liberal Democrat leader and health spokesperson Alex Cole-Hamilton MSP has today criticised the SNP government for dealing a “hammer blow” to the economy and thousands of lives as he revealed that more than 150,"
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/council/north-yorkshire-council-urged-to-press-chancellor-to-maintain-taxes-4520450",
        "title": "North Yorkshire Council urged to press Chancellor to maintain taxes",
        "description": "Liberal Democrat councillors are calling for the Conservative-run authority responsible for running services in the Prime Minister’s constituency to write to the Government calling for next month’s Budget to feature significant extra funding for council services."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/national-security-us-politics-congress-live-news-b2496966.html?page=5",
        "title": "House speaker moves to reassure public over ‘serious national security threat’: Live updates",
        "description": "Exact nature of threat not disclosed by congressional leaders to be briefed by White House national security adviser Jake Sullivan"
    },
    {
        "url": "https://www.countytimes.co.uk/news/24120332.claims-powys-schools-facing-welsh-language-crisis/",
        "title": "Claims Powys schools facing &#39;Welsh language crisis&#39;",
        "description": "The Learning and Skills committee believed that the Cabinet need to address the “Welsh language crisis” in Powys schools. This comment has drawn criticism from Cabinet members as they “rejected” the advice. At the meeting Conservative group leader, Cllr Aled Davies said it was “really surprising” that the cabinet had rejected the recommendation."
    },
    {
        "url": "https://www.markpack.org.uk/172544/former-police-commissioner-switches-to-lib-dems-running-again/",
        "title": "Former Police Commissioner switches to Lib Dems, running again",
        "description": "The Liberal Democrats finished second in the 2021 Gloucestershire Police and Crime Commissioner elections, behind the Conservative party, with Mr Surl finishing in third place as an independent. The Labour party finished fourth. You can follow XXX on XXX."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24121938.lib-dems-admit-error-labour-victory-political-literature/",
        "title": "Lib Dems admit error over Labour victory in political literature",
        "description": "In a pamphlet from General Election candidate Danny Chambers, delivered to hundreds of Winchester homes, they claim “Labour has NEVER won here”. In fact George Jeger won for Labour in 1945, holding the seat for four years as part of the post-war Attlee government."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nhs-liberal-democrats-gps-david-lynch-liberal-democrat-b1139399.html",
        "title": "More people waiting longer to see GP – NHS data",
        "description": "It should be a given that people can see their GP when they need to, not a struggle. That is why the <b>Liberal Democrats</b> are calling for a legal right for all patients to see their GP within seven days, and 24 hours if in urgent need <b>Liberal</b> <b>Democrat</b> leader ..."
    },
    {
        "url": "https://www.countypress.co.uk/news/24122288.isle-wight-general-election-candidates-announced-lib-dems/",
        "title": "Isle of Wight general election candidates announced by Lib Dems",
        "description": "Cllr Lilley will do battle for Isle of Wight East, while Cllr Stuart will fight for Isle of Wight West in the next general election. The last Isle of Wight Liberal Democrat MP was Peter Brand, who served between 1997 and 2001 and died last year."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/green-party-announces-ex-police-28638753",
        "title": "Green Party announces ex-police officer and campaigner as candidate for Tees Valley Mayor",
        "description": "Environmental campaigner Sally Bunce has launched her campaign as the Green Party candidate for Tees Valley Mayor."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cek74pe5e52o?at_medium=RSS&at_campaign=KARANGA",
        "title": "Calderdale councillors back Gaza ceasefire motion",
        "description": "A motion calling for an &quot;immediate and permanent&quot; ceasefire in Gaza has been passed by Labour-run Calderdale Council. At a full council meeting on Wednesday, the majority of councillors supported the motion, which also called for the release and return of all hostages."
    }
]