[
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/gateshead-council-chief-executive-may-28540213",
        "title": "Gateshead Council chief executive Sheena Ramsey to step down following elections in May",
        "description": "After more than seven years in the role, Sheena Ramsey says it is the &quot;right time&quot; to go, and the search for her replacement is underway."
    },
    {
        "url": "https://www.investing.com/news/world-news/in-south-carolina-biden-woos-black-voters-in-a-changing-us-south-3287409",
        "title": "In South Carolina, Biden woos Black voters in a changing U.S. South",
        "description": "Democrats hope South Carolina&#39;s new role as host of the party&#39;s first official primary on Feb. 3 will bolster support among Black voters. Top party officials also see it as a springboard to an audacious new strategy: retaking the American South in years to come."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-somerset-68146843?at_medium=RSS&at_campaign=KARANGA",
        "title": "Parliament discuss Somerset Council tax rise proposals",
        "description": "The proposed council tax rise is just one of the motions unveiled by Somerset Council to try and mitigate the budget deficit. However, the local authority needs special permission from the government to do this, as it is twice the maximum rise usually allowed."
    },
    {
        "url": "https://bromsgrovestandard.co.uk/news/lib-dem-councillors-left-frustrated-at-other-parties-lack-of-support-for-canals-motion/",
        "title": "Lib Dem councillors left frustrated at other parties&#39; lack of support for canals motion",
        "description": "THE BROMSGROVE Liberal Democrats say they are flabbergasted their motion on The Canal and River Trust over funding cuts was blocked."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/30/mps-queue-demand-separation-sheikh-state-telegraph-sale/",
        "title": "MPs queue up to demand separation of ‘Sheikh and state’ in Telegraph sale",
        "description": "An urgent question on the sale of The Telegraph had been granted to the Conservative backbencher Alicia Kearns, the chairman of the Foreign Affairs Select Committee and an avowed opponent of RedBird IMI’s plans. She demanded a national security review as “we cannot separate Sheikh and state”."
    },
    {
        "url": "https://worcesterobserver.co.uk/news/worcester-news-worcester-lib-dem-puzzled-over-two-year-roadpath-closure/",
        "title": "Worcester Lib Dem puzzled over two-year roadpath closure",
        "description": "Coun Jagger acknowledged the ongoing efforts of Coun Mel Allcott in seeking a resolution to the closure issue."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-metro-train-fleet-delay-28540355",
        "title": "&#39;A sad day for the North East&#39; – Reaction as new Metro trains hit by &#39;devastating&#39; setback",
        "description": "The first of the 46 new trains were meant to begin entering passenger service in summer 2023, but Nexus bosses now say they are in need of more rigorous testing"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-norfolk-68146199",
        "title": "Norfolk county councillors vote to increase their allowance pay",
        "description": "Councillors&#39; allowances will be increased and backdated, but not everyone at an authority agreed with the decision. At a Norfolk County Council meeting, members voted for a 3.82% (£360.30) rise effective from April 2023. Councillors are entitled to a yearly basic allowance which covered their time at meetings and travel costs."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-grandee-mandelson-warns-labour-171527971.html",
        "title": "Labour grandee Mandelson warns Labour lead is ‘artificial’ and will shrink before election",
        "description": "Peter Mandelson said people ‘are not pricing in sufficiently’ the possibility of Sir Keir failing to win a majority"
    },
    {
        "url": "https://www.kentonline.co.uk/folkestone/news/council-s-100k-restructure-dubbed-more-talking-and-a-lot-l-300978/",
        "title": "Folkestone and Hythe District Council’s £100k restructure dubbed ‘more talking and a lot less work’",
        "description": "Politicians feel “stabbed in the back” after a high-profile restructuring - set to cost taxpayers £100,000 - was delayed."
    },
    {
        "url": "https://thestrayferret.co.uk/andrew-jones-mp-hits-back-after-lib-dem-rival-tom-gordon-attacks-schools-funding/",
        "title": "Andrew Jones MP hits back after Lib Dem rival Tom Gordon attacks schools funding",
        "description": "The Liberal Democrat bidding to be Harrogate and Knaresborough&#39;s next MP has accused the government of failing local children."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/power-lords-rwanda-bill-150521003.html",
        "title": "How much power does the Lords have to stop Rwanda Bill?",
        "description": "He suggested the bill puts the UK at risk of breaching international law, will lead to &quot;substantial costs to the taxpayer&quot;, would fail to provide safe routes for refugees and fails to includes measures to stop criminal people smuggling gangs. However, the Lords voted against the motion by 206 votes to 84, with Labour choosing to abstain."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "Politics latest news: Reform UK backing among 2019 Tory voters reaches record high",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24084085.stanley-civic-halls-shocking-condition-revealed-durham-council/",
        "title": "Stanley Civic Hall&#39;s shocking condition revealed by Durham council",
        "description": "A town council has been branded “inept and incompetent” after an inspection of an arts and culture venue found urgent repairs are required."
    },
    {
        "url": "https://uk.news.yahoo.com/lib-dems-plan-derelict-pub-homeless-shelter-211639997.html",
        "title": "Lib Dems defend blocking plan to turn derelict pub into homeless shelter",
        "description": "A <b>Liberal</b> <b>Democrat</b> has defended his local party&#39;s efforts to prevent a homeless hostel being opened in a residential area, and to instead restore the disused building as a community pub. The Thorney Close Inn closed its doors in 2020 and has been boarded ..."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-snp-making-woeful-progress-on-scotlands-drugs-emergency",
        "title": "Cole-Hamilton: SNP making woeful progress on Scotland’s drugs emergency",
        "description": "Scottish Liberal Democrat leader Alex Cole-Hamilton MSP has today warned that the country’s drugs crisis continues to “end lives and blight communities”, as new statistics revealed that drug-related hospital admissions,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861273/Ed-Davey-poll-lib-dems-post-office",
        "title": "Lib Dems take fresh poll battering as Ed Davey hit by Post Office scandal fallout",
        "description": "Beleaguered party took a huge hit in the latest Westminster opinion poll, weeks after Sir Ed Davey became embroiled in the Horizon scandal."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68126734?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_format=link&at_link_id=5963E78A-BF49-11EE-B097-825A87A28522&at_link_type=web_link&at_link_origin=BBC_Politics&at_medium=social&at_campaign_type=owned",
        "title": "Rwanda Bill criticised by peers at first stage in House of Lords",
        "description": "Peers including the Archbishop of Canterbury attacked the principles of the bill, while the <b>Liberal Democrats</b> tried to kill it entirely. That move failed with the House of Lords voting to allow the bill to move to the next stage by 206 votes to 84."
    },
    {
        "url": "https://accesswdun.com/article/2024/1/1225610",
        "title": "Wisconsin&#39;s Democratic governor vetoes Republican map as another redistricting court fight looms",
        "description": "Wisconsin Democratic Gov. Tony Evers has vetoed a redistricting proposal that the Republican-controlled Legislature passed last week in a last-ditch effort to avert the drawing of legislative boundari"
    },
    {
        "url": "https://www.ocregister.com/2024/01/30/pay-attention-to-who-is-taking-campus-anti-semitism-seriously-and-who-isnt/",
        "title": "Pay attention to who is taking campus anti-Semitism seriously and who isn’t",
        "description": "Jews alike would do well to remember what party treated “calls for the genocide of Jews” as an urgent cause for action and which party dismissed it"
    },
    {
        "url": "https://londonnewsonline.co.uk/news/schools-to-be-hit-with-up-to-10m-cuts-in-spending-power/",
        "title": "Schools to be hit with up to £10m cuts in spending power",
        "description": "Schools across South London are set to be hit by cuts in spending power of more than £10million in some boroughs, according to data from the National Education Union. The Government cuts mean funding per pupil will be reduced by hundreds of pounds compared to the previous financial year."
    },
    {
        "url": "https://www.edp24.co.uk/news/24083700.norfolk-county-councillors-vote-increase-allowances/",
        "title": "Norfolk county councillors vote to increase their allowances",
        "description": "County councillors could be about award themselves more money - at a time when tips may be shut, disabled people made to pay more for their care"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-snps-ministerial-disinterest-is-taking-its-toll-on-ae",
        "title": "Cole-Hamilton: SNP&#39;s ministerial disinterest is taking its toll on A&amp;E",
        "description": "Responding to new figures showing only 62% of people attending A&amp;E were seen within the 4 hour target in the week ending 21st January, while 3,831 people waited over 8 hours, Scottish Liberal Democrat"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24083679.liberal-democrats-reveal-mp-candidate-aylesbury/",
        "title": "<b>Liberal Democrats</b> reveal MP candidate for Aylesbury",
        "description": "The Liberal Democrats have revealed their general election candidate for Aylesbury – the current Mayor of Aylesbury Town, Steve Lambert."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/jeremy-hunt-tax-cuts-budget-rishi-sunak-imf-b2487354.html",
        "title": "IMF warns Jeremy Hunt against further tax cuts in March Budget",
        "description": "The IMF said any tax cuts would be ‘very challenging to achieve’ considering Britain’s ageing population and mounting debt pile"
    },
    {
        "url": "https://www.mirror.co.uk/money/uk-canada-trade-talks-not-31999681",
        "title": "UK-Canada trade talks have not &#39;broken down&#39;, says business secretary Kemi Badenoch",
        "description": "The Business and Trade Secretary said &quot;multiple discussions&quot; are ongoing with Canada, while negotiations on a free trade agreement (FTA) have been &quot;paused&quot;"
    },
    {
        "url": "https://www.markpack.org.uk/172475/redditch-labour-councillor-switches-to-lib-dems/",
        "title": "Redditch Labour councillor switches to Lib Dems",
        "description": "After switching from Labour. Kerrie Miles becomes the first Liberal Democrat councillor on Redditch Council for over a decade."
    },
    {
        "url": "https://www.midweekherald.co.uk/news/24083316.to-help-nhs-must-address-crisis-social-care/",
        "title": "&#39;To help the NHS, we must address the crisis in social care&#39;",
        "description": "For years, Conservative ministers have failed to properly address the social care crisis, and have instead favoured short-term,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/police-shoot-man-crossbow-southwark-london-b2487215.html",
        "title": "Intruder armed with crossbow shot dead by police after breaking into Southwark home - latest updates",
        "description": "A man armed with a crossbow has been shot dead by armed police after trying to force his way into a building in south-east London, police have said. Neighbours heard “bangs and screaming” as police descended on the quiet estate during the early hours of the morning."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/cycle-lane-hell-state-people-28534808",
        "title": "Cycle lane in &#39;hell of a state&#39; as people &#39;laugh&#39; about it",
        "description": "“That is in a hell of a state. It’s full of litter, it’s full of leaves, it’s not maintained even if cyclists wanted to cycle along there. The laugh of the populous is spot the cyclist, nobody uses it. Surely this money from the Liverpool City Region could be better invested to get people more active.”"
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-grandee-ken-clarke-rwanda-bill-black-white-2879467?ico=more_from_this_author",
        "title": "Rwanda bill passes first Lords hurdle despite savaging from Tory Ken Clarke",
        "description": "The Rwanda bill has cleared its first major hurdle in the House of Lords after Tory grandee Ken Clarke ridiculed the law and warned it risks moving the UK towards an “elected dictatorship”. The former chancellor reversed his previous support for legislation related to the controversial deportation deal,"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/councillors-lose-bid-stop-plans-28533644",
        "title": "Councillors lose bid to stop plans for three-weekly bin collections in Cardiff",
        "description": "Councillors&#39; attempts to overturn controversial plans for one black bin bag collection every three weeks failed. Conservative councillors at Cardiff Council, led by Cllr John Lancaster, put forward a motion calling for a re-think on waste collection proposals at a full council meeting on Thursday, January 25."
    },
    {
        "url": "https://www.cornish-times.co.uk/news/climate-goal-is-now-totally-impossible-663064",
        "title": "Climate goal is now “totally impossible”",
        "description": "The leader of the <b>Liberal Democrats</b> group at Cornwall Council has said the local authority’s goal for the Duchy to be carbon neutral by 2030 is “now totally impossible”, writes Lee Trewhela. Cllr Colin Martin accused the council of blocking a debate ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13021253/Archbishop-Canterbury-Justin-Welby-accused-hypocrisy-Lee-Anderson-attacks-governments-Rwanda-scheme-House-Lords.html",
        "title": "Archbishop of Canterbury Justin Welby is accused of &#39;hypocrisy&#39; by Lee Anderson after he attacks the government&#39;s Rwanda scheme in the House of Lords",
        "description": "The Archbishop of Canterbury was blasted by Tory MPs last night after he said the Rwanda scheme was &#39;leading the nation down a damaging path&#39;."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/fears-over-stalled-revamp-gloucesters-9063660",
        "title": "Fears over stalled revamp of Gloucester’s historic Fleece Hotel as £6.3m diverted to The Forum",
        "description": "Initial revamp plans for the 15th-century timber-framed building came to a halt and no detailed designs were forthcoming from the council’s preferred partner for the site Dowdeswell Group"
    },
    {
        "url": "https://thenegotiator.co.uk/70-of-housebuilders-want-labour-to-win-general-election-says-knight-frank",
        "title": "70% of housebuilders want Labour to win General Election, says Knight Frank",
        "description": "The Knight Frank Land Index &amp; Housebuilder Survey of English housebuilders shows 70% favour Labour government plans for reform."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24081506.holocaust-memorial-day-sarah-dyke-signs-book-commitment/",
        "title": "Holocaust Memorial Day: Sarah Dyke signs Book of Commitment",
        "description": "Sarah Dyke signed the Holocaust Educational Trust&#39;s Book of Commitment to mark Holocaust Memorial Day. The Liberal Democrat representative for Somerton and Frome honoured those who were killed, as well as the survivors. Holocaust Memorial Day is observed on January 27th, the date in 1945 when Auschwitz-Birkenau, the Nazi camp, was liberated."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24082252.police-crime-commissioner-candidate-tim-bearder-speaks/",
        "title": "Police and crime commissioner candidate Tim Bearder speaks",
        "description": "<b>Liberal Democrats</b> have put forward Oxfordshire county councillor Tim Bearder in their bid for the Thames Valley police and crime commissioner role. The position is filled by Conservative Matthew Barber and its responsibilities include general oversight of ..."
    }
]