[
    {
        "url": "https://www.express.co.uk/news/uk/1862311/london-superboat-scrapped-eu-waters",
        "title": "Massive £25m superboat to &#39;travel back to EU waters&#39; after being rejected by Londoners",
        "description": "The yacht was to be moored primarily at the Royal Docks in Newham and make stop-offs at six piers across the city in Greenwich, Southwark and Tower Hamlets while undertaking trips. Ms Bentley said the large vessel would have been &quot;completely unsuitable&quot; for the narrow stretches of river in which it planned to operate."
    },
    {
        "url": "https://inews.co.uk/news/politics/simon-danczuk-rochdale-by-election-2884557",
        "title": "Ex-Labour MP who sent explicit texts to teen girl to stand as Reform candidate",
        "description": "Simon Danczuk, who was suspended for “inappropriate” behaviour towards the 17-year-old student, is the “right candidate” to tackle Rochdale’s grooming gangs, according to leader Richard Tice"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/01/horizon-scandal-no-10-angers-alan-bates-offered-fair-deal/",
        "title": "No 10 angers Alan Bates with claim he was offered ‘fair’ Horizon compensation",
        "description": "Former sub-postmaster asks Government to ‘stop arguing with me’ and pay victims of Post Office scandal the money they are owed"
    },
    {
        "url": "https://www.huffpost.com/entry/pro-israel-groups-big-money-candidate-fundraising-takeaways_n_65bb28c7e4b05c8779f7dbfb",
        "title": "Pro-Israel Groups Rake In Big Bucks And 4 Other Takeaways From Candidates’ Final 2023 Fundraising Period",
        "description": "The fundraising picture is rosy for Democrats in Ohio and Montana. But progressive Israel critics face well-financed foes."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/01/rwanda-asylum-bill-lobby-charities-taxpayer-money/",
        "title": "Charities lobbying against Rwanda Bill given £209m in taxpayer money",
        "description": "The Government has given £209 million to charities that have lobbied the House of Lords to vote against the Rwanda Bill and described the policy as “deeply harmful” and setting a “dangerous precedent”."
    },
    {
        "url": "https://www.heraldscotland.com/news/24092043.alex-salmond-labelled-embarrassment-show-turkish-state-tv/",
        "title": "Alex Salmond labelled &#39;embarrassment&#39; over show for Turkish state TV",
        "description": "Alex Salmond has been criticised after getting a television job courtesy of another autocratic regime. The Alba party leader, who in 2017 agreed to make a show for the Kremlin-funded RT channel, will now appear weekly on the network of Turkey’s state broadcaster."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/lib-dem-councillor-promising-100-28553813",
        "title": "Lib Dem councillor promising &#39;100% dedication&#39; as he is picked to contest Redcar in next General Election",
        "description": "A Liberal Democrat councillor is the party’s pick to challenge Redcar MP Jacob Young at the next General Election. Redcar and Cleveland councillor Chris Jones told the Local Democracy Reporting Service he had agreed to stand as a prospective parliamentary candidate and this would be confirmed by the party imminently."
    },
    {
        "url": "https://www.edp24.co.uk/news/24091356.call-new-coastal-minister-help-norfolks-coast/",
        "title": "Call for new coastal minister to help Norfolk&#39;s coast",
        "description": "Calls have been made for a new minister for coastal communities to combat erosion, stop sewage spills and ease the housing crisis at the"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-outlines-key-proposals-ahead-of-party-leader-climate-summit",
        "title": "Cole-Hamilton outlines key proposals ahead of party leader climate summit",
        "description": "Speaking ahead of a summit of Scottish party leaders called to address climate action, Scottish Liberal Democrat leader Alex Cole-Hamilton has outlined a package of immediate measures that his party wants to see implemented to bring down emissions,"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/over-one-million-families-to-face-mortgage-hike-ahead-of-november-general-election",
        "title": "Over one million families to face mortgage hike ahead of November General Election",
        "description": "General Election if it is held in November, research commissioned by the Liberal Democrats has revealed. It comes ahead of the Bank of England’s decision on whether to cut interest rates from 5.25% today."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/politics/radio-debate-sees-wellingborough-by-election-candidates-clash-over-immigration-but-agree-on-policing-4501646",
        "title": "Radio debate sees Wellingborough by-election candidates clash over immigration but agree on policing",
        "description": "The round-table debate saw agreement on the need for more police to deal with crime, the need for investment in the NHS and action on town centres. Conservative candidate Helen Harrison robustly defended her party’s record – the Wellingborough constituency had been represented by Tory Peter Bone for 18 years until he was ousted by voters."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/01/ed-davey-apologises-for-his-role-in-post-office-horizon-scandal",
        "title": "Horizon scandal: Ed Davey sorry he ‘did not see through Post Office lies’",
        "description": "Lib Dem leader, who was business minister from 2010 to 2012, says he is sorry he ‘did not see through Post Office’s lies’"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/swansea-council-debt-borrowing-budget-28547280",
        "title": "Concern raised over Swansea Council&#39;s £693m &#39;extraordinary&#39; debt figure",
        "description": "Swansea Council could borrow up to £50 million in the coming three years - adding to what the opposition leader described as &quot;extraordinary&quot; levels of debt. The council was £693.8 million in debt as of September last year, according to report by the UK Public Accounts Committee."
    },
    {
        "url": "https://www.northamptonchron.co.uk/news/people/save-our-allotments-plot-holders-say-the-fight-continues-as-eight-months-remain-at-brixworth-allotments-4501458",
        "title": "‘Save our allotments’: Plot holders say ‘the fight continues’ as eight months remain at Brixworth Allotments",
        "description": "<b>Liberal</b> <b>Democrat</b> Councillor Jonathan Harris, who has lived in Brixworth for more than two decades, is responsible for setting up the petition in support of retaining the allotments. Talking to the Chronicle &amp; Echo, Ken Nikel – who has been a plot holder ..."
    },
    {
        "url": "https://uk.news.yahoo.com/party-committee-rejects-opposition-call-141726099.html",
        "title": "All-party committee rejects opposition call for N.S. MLAs to have two assistants",
        "description": "Nova Scotia legislature committee meeting to discuss the safety of constituency assistants was both acrimonious and conciliatory. In the end, all three parties represented at the House of Assembly&#39;s management commission agreed to what appeared to be a compromise position — that the legislature look at hiving off security costs from MLA budgets."
    },
    {
        "url": "https://uk.news.yahoo.com/jeffries-vows-expand-child-tax-191137695.html",
        "title": "Jeffries vows to expand child tax credit even further under a Democratic majority",
        "description": "The leader of the House Democrats is vowing a quick expansion of the child tax credit to include more families if the party takes control of the lower chamber following November’s elections. Minority Leader Hakeem Jeffries (D-N."
    },
    {
        "url": "https://www.mortgagesolutions.co.uk/news/2024/02/01/more-than-a-million-families-will-face-a-mortgage-hike-ahead-of-election-lib-dems/",
        "title": "More than a million families will face a mortgage hike ahead of election – Lib Dems",
        "description": "According to research by <b>Liberal Democrats</b>, which used FCA data, showed that 1.1 million fixed rate terms will end between February and October and of these 700,000 fixed rate mortgages will expire between May and October. A typical homeowner will have ..."
    },
    {
        "url": "https://vancouversun.com/opinion/columnists/vaughn-palmer-b-c-ndp-routinely-breaking-access-to-information-law-says-commissioner",
        "title": "Vaughn Palmer: B.C. NDP routinely breaking access to information law, says commissioner",
        "description": "B.C. Information Commissioner Michael McEvoy delivered a withering blast at the New Democrats this week over their flagrant disregard for the Freedom of Information and Protection of Privacy Act. He found that the New Democrats failed to respect the response times written into the law more than 5,"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/keir-starmer-says-government-lost-9071387",
        "title": "Keir Starmer says ‘government has lost control’ on knife crime in visit to Bristol school",
        "description": "Labour leader Keir Starmer has pledged action on knife crime if his party gets into power. He was speaking during a visit to Hanham Woods Academy today (Thursday)"
    },
    {
        "url": "https://www.heraldscotland.com/news/24090033.bid-raise-scotlands-school-start-age-gains-cross-party-support/?ref=rss",
        "title": "Bid to raise Scotland&#39;s school start age gains cross-party support",
        "description": "All but one of Scotland&#39;s main political parties have backed the motion to raise the school starting age and create a national kindergarten system."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/rfk-jr-donald-trump-vp-b2488799.html",
        "title": "RFK Jr reveals why he couldn’t be Trump’s running mate",
        "description": "Independent candidate says he doesn’t think his marriage “would survive” if he joined Republican ticket with former president"
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24090277.bicester-woodstock-seat-green-party-choose-candidate/",
        "title": "Bicester and Woodstock seat: Green Party choose candidate",
        "description": "Ian Middleton is the deputy leader of the Green and Liberal Democrat Alliance on Oxfordshire County Council and sits on Cherwell District Council."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032821/Society-Editors-vows-call-absurd-fake-newspapers.html",
        "title": "Society of Editors vows to name and shame political parties using &#39;absurd&#39; fake local newspapers as campaign material ahead of the general election",
        "description": "The Society of Editors vowed today that it will be monitoring candidates attempting to distribute so-called &#39;fake newspapers&#39; during the upcoming elections."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-ed-davey-says-sorry-120951934.html",
        "title": "Sir Ed Davey says sorry to Horizon victims for &#39;not seeing through Post Office lies&#39;",
        "description": "Liberal Democrat leader Sir Ed Davey has apologised to the victims of the Horizon scandal for &quot;not seeing through the Post Office &#39;s lies&quot; during his time as postal affairs minister between 2010 and 2012."
    },
    {
        "url": "https://www.kentonline.co.uk/kent/news/figures-reveal-soaring-cost-of-providing-free-school-transpo-301089/",
        "title": "Kent County Council home to school transport costs soar",
        "description": "New figures published by Kent County Council have laid bare the rise in cost of providing home to school transport."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155001/rochdale-byelection-green-party-announces-guy-otten-as-its-parliamentary-candidate",
        "title": "Rochdale by-election: Green Party announces Guy Otten as its Parliamentary candidate",
        "description": "Guy Otten has been named as the Green Party’s Parliamentary candidate for Rochdale in the upcoming by-election on"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/fears-cardiff-schools-bracing-more-28546508",
        "title": "Fears Cardiff schools will be bracing for more &#39;funding woes&#39; after call for funding strategy voted down",
        "description": "Councillor Rodney Berman found the decision to vote down his group&#39;s call for a funding strategy &quot;hugely disappointing&quot;"
    },
    {
        "url": "https://www.peterboroughtoday.co.uk/business/sos-ms-politicians-call-on-retailer-to-stay-in-peterborough-as-council-leader-says-talks-are-ongoing-4501076",
        "title": "&#39;SOS M&amp;S&#39;: Politicians call on retailer to stay in Peterborough as council leader says talks are ongoing",
        "description": "Mohammed Farooq, leader of the council, said he expected to be able to make an announcement shortly after holding talks with M&amp;S"
    },
    {
        "url": "https://www.stratford-herald.com/news/protest-launched-to-change-five-months-of-roadworks-on-major-9351060/",
        "title": "Protest launched to change five-months of roadworks on major Stratford route",
        "description": "The county council says closing part of the Warwick Road for five months is the quickest solution, but Lib Dems want the plans revised."
    },
    {
        "url": "https://www.letsrecycle.com/news/south-oxfordshire-tops-2022-23-recycling-table/",
        "title": "South Oxfordshire tops 2022/23 recycling table",
        "description": "South Oxfordshire district council was the best local authority in England at recycling in 2022/23, figures published yesterday (31 January) show."
    },
    {
        "url": "https://www.devonlive.com/news/devon-news/youth-sports-groups-honiton-left-9069161",
        "title": "Youth sports groups in Honiton left behind by poor facilities, says MP",
        "description": "The MP for Tiverton and Honiton, Richard Foord, has spoken out in the House of Commons about the lack of adequate sports facilities for youth groups in Honiton"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/tory-mp-says-by-skin-28549359",
        "title": "Tory MP says &#39;by skin of my teeth I avoided being murdered&#39; as he announces he won&#39;t stand in 2024 General Election",
        "description": "A Government minister has decided to step down at the next general election due to a series of death threats and an arson attack on his office. Conservative justice minister Mike Freer said, &quot;by the skin of my teeth I avoided being murdered&quot; by Ali Harbi Ali, who later killed Southend West MP Sir David Amess."
    },
    {
        "url": "https://techround.co.uk/news/george-osborne-joins-coinbase/",
        "title": "George Osborne Joins Coinbase Board: What Other Politicians Have Shifted To Big Tech?",
        "description": "Coinbase has recently announced that George Osborne, former Chancellor of the Exchequer of the United Kingdom, is joining their Coinbase Global Advisory Council. The Advisory Council was established to advise Coinbase on their global expansion strategy."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032697/Lib-Dem-leader-Ed-Davey-finally-sorry-role-Post-Office-scandal.html",
        "title": "AT LAST! Lib Dem leader Ed Davey finally apologises for his role in the Post Office scandal saying he is sorry he failed to &#39;see through the lies&#39; when he was a coalition ...",
        "description": "The Lib Dem leader said he was sorry for failing to &#39;see through the lies&#39; fed to him by the Post Office when he was a senior business minister in the coalition government more than a decade ago."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/jeremy-hunt-tax-cut-affordability-b2488578.html",
        "title": "Jeremy Hunt’s bleak message: ‘We can’t afford to cut tax after all’",
        "description": "The chancellor confirmed he told cabinet colleagues there will be less scope for tax cuts because of gloomy economic forecasts"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rent-crisis-london-mortgage-repayments-mental-health-ons-ed-davey-b1136285.html",
        "title": "Revealed: Impact of London&#39;s sky-high rent and mortgage repayments on mental health",
        "description": "One in 10 Londoners say their mental health has been negatively affected by the anxiety of keeping up with their rent or mortgage, the highest proportion of any region in Britain, figures show."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/01/political-parties-told-insulting-fake-campaign-newspapers-are-damaging-democracy/",
        "title": "Political parties told ‘insulting’ fake campaign newspapers are ‘damaging democracy’",
        "description": "Meanwhile, a fake title “Wokingham Focus” in Berkshire was distributed by the <b>Liberal Democrats</b> this month, criticising Conservative MP Sir John Redwood over his record on dealing with sewage. Responding to the rise of fake newspapers, Society of ..."
    },
    {
        "url": "https://www.financialreporter.co.uk/11-million-households-face-mortgage-hike-between-now-and-november.html",
        "title": "1.1 million households face mortgage hike between now and November",
        "description": "1.1 million households will face a mortgage hike before the General Election if it is held in November, research by the Liberal Democrats has revealed. It comes ahead of the Bank of England’s decision on whether to cut interest rates from 5.25% today."
    },
    {
        "url": "https://www.radioexe.co.uk/news-and-features/local-news/council-redirects-broadband-cash/",
        "title": "Council redirects broadband cash",
        "description": "The Connecting Devon &amp; Somerset (CDS) initiative was jointly funded by Devon and Somerset councils, as well as central government money and EU funding. Now Devon is receiving a clawback payment from BT."
    },
    {
        "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/candidates-standing-council-election-hulls-9070090",
        "title": "The candidates standing in the council by-election for Hull&#39;s Avenue ward",
        "description": "Avenue ward typically has one of the highest turnouts of any in Hull, with around 37 per cent of electors casting their ballots there in last year&#39;s local elections. Its other two seats are currently held by Labour&#39;s Cllr Abhi Singh and Liberal Democrat Cllr John Robinson."
    }
]