[
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24093752.inverclyde-historical-society-welcome-ex-council-leader/",
        "title": "Inverclyde Historical Society to welcome ex council leader",
        "description": "INVERCLYDE Historical Society is meeting on Thursday at Lyle Gateway. Former councillor Alan Blair, who served as local authority leader with the Liberal Democrats between 2003 and 2007, a will give a talk entitled Thoughts on Politics. This is a change to the published programme."
    },
    {
        "url": "https://www.lep.co.uk/education/concern-about-class-sizes-over-30-in-lancashire-schools-amid-claim-of-ps28m-cut-in-spending-power-4504295",
        "title": "Concern about class sizes over 30 in Lancashire schools amid claim of &#39;£28m cut in spending power&#39;",
        "description": "Lancashire schools with more than 30 pupils in some of their classes will be unable to reduce the headcount to “acceptable” levels because of insufficient funding, a leading teaching union official has warned."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/which-tories-will-lose-seats-mp-next-election-2024-uk-rees-mogg-368098/",
        "title": "Three top Tories set to lose seats as MPs to Labour – including Jacob Rees-Mogg",
        "description": "A number of well-known Tories are being confronted by a stark reality - and the likes of Jacob Rees-Mogg face a daunting prospect."
    },
    {
        "url": "https://www.libdemvoice.org/listen-christine-jardine-on-any-questions-3-74609.html",
        "title": "LISTEN: Christine Jardine on Any Questions",
        "description": "Christine Jardine was on Any Questions last night along with Ann Widdecombe (representing the Reform Party), Thangam Debonnaire and Sir Robert Buckland. She travelled to Bridgwater in Somerset. The first question was on whether we should have closer relations with the EU,"
    },
    {
        "url": "https://worcesterobserver.co.uk/news/worcester-news-deputy-mayor-chosen-to-fight-worcester-seat-by-lib-dems/",
        "title": "Deputy Mayor chosen to fight Worcester seat by Lib Dems",
        "description": "WORCESTER’s deputy Mayor has been revealed as the Liberal Democrats parliamentary candidate for the forthcoming General Election."
    },
    {
        "url": "https://inews.co.uk/news/politics/ed-miliband-labour-green-growth-2887660?ico=editors_picks",
        "title": "‘Miliband still wants the £28bn’: Inside Labour’s green growth plan split",
        "description": "Keir Starmer sought to present the new face of Labour this week, just as divisions came to the fore over what had been his flagship policy"
    },
    {
        "url": "https://uk.news.yahoo.com/budget-cuts-could-see-york-050000436.html",
        "title": "Budget cuts could see some York libraries forced to close - claim Lib Dems",
        "description": "SOME of York’s libraries could be at risk of being forced to close if threatened budget cuts go ahead, opposition councillors in York say. The warning comes as the full extent of the cuts being proposed to the budget for Explore York Libraries and Archives becomes clear."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24088769.lib-dems-concerns-redrow-homes-monks-cross-north-plan/",
        "title": "Lib Dems concerns over Redrow Homes&#39; Monks Cross North plan",
        "description": "Councillors for Huntington and New Earswick said they were concerned that the &#39;detailed plan&#39; for the first phase of the 970-home &#39;Monks"
    },
    {
        "url": "https://www.independent.co.uk/life-style/conservative-right-wing-men-progressive-women-b2488939.html",
        "title": "The ideological divide between men and women is growing. What’s happening?",
        "description": "As new data suggests a widening divergence across the globe when it comes to politics, Tom Ough investigates whether we’re witnessing a renewed battle of the sexes – or whether Gen Z just need to get"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/almost-900-days-since-fair-fares-review-announced",
        "title": "Almost 900 days since Fair Fares Review announced",
        "description": "Scottish <b>Liberal</b> <b>Democrat</b> leader Alex Cole-Hamilton MSP has today criticised the SNP/Green Government for failing to get serious about connectivity and the environment as he revealed that a long-promised review of public transport fares has yet to be ..."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "One of the interesting reasons, I think, why that dog doesn’t seem to have bark as much as we thought is effectively the non-aggression pact between Labour and the <b>Liberal Democrats</b> means although the Lib Dems voted differently to the Labour party on ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/13145612.local-policing-national-force-work-progress/",
        "title": "Local policing of national force a work in progress",
        "description": "Has that been the case so far? That is a moot point. Scottish <b>Liberal</b> <b>Democrat</b> leader Willie Rennie&#39;s comments to the effect that the creation of Police Scotland has resulted in Strathclyde Police effectively &quot;taking over&quot; the whole country is putting it a ..."
    },
    {
        "url": "https://www.salon.com/2024/02/03/remember-the-rules-liberals-only-the-right-gets-to-mock-america/",
        "title": "Remember the rules, liberals: Only the right gets to mock America",
        "description": "“Take a step back, be honest,” Dimon implored Americans without a hint of self-consciousness, during a Jan. 17 interview with CNBC from the World Economic Forum in Davos, Switzerland. “Trump was kind of right about NATO,&quot; he continued, &quot;kind of right about immigration. Tax reform worked.”"
    },
    {
        "url": "https://www.gulftoday.ae/opinion/2024/02/03/house-republicans-target-minnesota-representative-ilhan-omar",
        "title": "House Republicans target Ilhan Omar",
        "description": "Follower of Donald Trump and Republican Representative from Georgia, Marjorie Minnesota, moved a censure resolution against Omar, and the Republican Whip in the House, Tom Emmer, demanded an ethics investigation against Omar."
    },
    {
        "url": "https://thehill.com/opinion/campaign/4445691-democratic-and-republican-elites-fear-rfk-jr-s-growing-path-to-victory/",
        "title": "Democratic and Republican elites fear RFK Jr.’s growing path to victory",
        "description": "In what is shaping up to be a three-person contest between President Joe Biden, former President Donald Trump, and independent candidate Robert F. Kennedy Jr., the question becomes: Which"
    },
    {
        "url": "https://www.washingtonexaminer.com/opinion/2834884/relationships-are-good-marriage-is-better/",
        "title": "Relationships are good. Marriage is better",
        "description": "“While good marriages are good, bad marriages can be very, very bad. That’s not to say all bad marriages are violent — they’re not — but we don’t know the individual stories when we look at sterile statistics about who declines to marry when they have a child together or who gets married and splits up. We don’t see the whys behind these decisions.”"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/local/2024/02/03/florida-young-democrats-form-pac-to-fund-outreach-for-turnout-in-2024/72340006007/",
        "title": "Young <b>Democrats</b> form a PAC to push turnout in 2024, eye Boca Raton Florida House district",
        "description": "Florida young Democrats are pushing to increase turnout in 2024 among a key voting group. They are taking aim at a Boca Raton Florida House seat."
    },
    {
        "url": "https://www.newsday.com/news/region-state/mom-squad-state-legislature-opx8oxb9",
        "title": "&#39;Mom Squad&#39; focuses on mother/child funding, policies in NYS legislature",
        "description": "The group is made up of 10 to 15 mothers with young children who are among what Albany veterans say is the largest contingent of young mothers in the State Legislature ever."
    },
    {
        "url": "https://inews.co.uk/news/world/joe-biden-donald-trump-codependence-2886097?ico=related_article_inline",
        "title": "The curious codependence of Joe Biden and Donald Trump",
        "description": "Joe Biden and Donald Trump have found themselves in a strange symbiotic relationship – each needing the other as they make their pitch to Americans to vote for them. As the nation embarks on the longest general election campaign in history – though Republican Nikki Haley and Democrat Dean Phillips have not given up their efforts to dislodge the two de facto nominees – 77-year-old Trump and 81-year-old Biden are using the other to make their case."
    },
    {
        "url": "https://www.chicagotribune.com/2024/02/02/biden-is-left-with-few-choices-as-immigration-takes-center-stage-in-american-politics/",
        "title": "Biden is left with few choices as immigration takes center stage in American politics",
        "description": "Almost immediately after Joe Biden walked into the Oval Office on his first day as president, he began rolling back his predecessor’s immigration policies, which he’d assailed"
    },
    {
        "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/2835126/ten-house-democrats-urge-biden-reverse-course-lng-pause-party-split-intensifies-energy-issue/",
        "title": "Ten House <b>Democrats</b> urge Biden to reverse course on LNG pause as party split intensifies on energy issue",
        "description": "A group of House Democrats urged President Joe Biden on Friday to “refocus” his policy on U.S. liquefied natural gas exports, deepening a growing party divide that has pitted liberal Democrats against some moderates in the party."
    },
    {
        "url": "https://www.thestockdork.com/senate-border-bill-encounters-surprise-obstacle-in-the-form-of-democratic-opposition/",
        "title": "Senate Border Bill Encounters Surprise Obstacle in the Form of Democratic Opposition",
        "description": "Mixed Reactions to Senate Negotiations While some moderate <b>Democrats</b> acknowledge the need to make concessions in a divided Washington, the <b>liberal</b> faction sees the Senate negotiations as heavily skewed in favor of Republican priorities. The policy ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13209737.lib-dem-battling-alex-salmond-says-send-ex-fm-thank-note-best-recruiting-sergeant/",
        "title": "Lib Dem battling Alex Salmond says she&#39;ll send ex-FM a thank you note for being her &quot;best recruiting sergeant&#39;",
        "description": "THE <b>Liberal</b> <b>Democrat</b> who is challenging Alex Salmond in Aberdeenshire has said she is planning on sending the former First Minister a thank you note after the general election. Christine Jardine, who is battling with Mr Salmond in the Gordon constituency ..."
    }
]