[
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/18/rashida-tlaib-joe-biden-michigan-democratic-primary",
        "title": "Congresswoman Rashida Tlaib tells fellow <b>Democrats</b>: reject Biden in primary",
        "description": "Michigan representative tells state voters to pick ‘uncommitted’ option over White House support for Israel’s strikes on Gaza"
    },
    {
        "url": "https://www.dailymail.co.uk/news/texas/article-13092339/Texas-victims-families-slam-Soros-backed-Austin-DA-Jose-Garza-letting-killers-rapists-walk-free-pro-criminal.html",
        "title": "Texas victims&#39; families slam Soros-backed Austin DA Jose Garza for letting killers and rapists walk free: &#39;How can you be pro-criminal!&#39;",
        "description": "Over 70 survivors of rape and other violent crimes and the families of those killed in the Austin area have formed a group to air their grievances with Travis County District Attorney Jose Garza."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68330465?at_link_type=web_link&at_ptr_name=twitter&at_campaign=Social_Flow&at_link_origin=BBCScotlandNews&at_format=link&at_campaign_type=owned&at_bbc_team=editorial&at_link_id=10AA39DE-CE78-11EE-8EA2-28C8413A1DFE&at_medium=social",
        "title": "Post Office scandal: Kemi Badenoch hits back at Henry Staunton",
        "description": "Business Secretary Kemi Badenoch has hit back at claims made by former Post Office chairman Henry Staunton about the reasons for his departure. Mr Staunton told the Sunday Times that when he was sacked Ms Badenoch had told him: &quot;Someone&#39;s got to take the rap.&quot;"
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/liberal-democrats-set-out-their-council-budget-proposals/",
        "title": "<b>Liberal Democrats</b> set out their council budget proposals",
        "description": "All these measures will improve travel safety. <b>Liberal Democrats</b> also propose a suite of measures to tackle the climate and nature emergencies with an extra £200,000 to fund more staff and resources to deliver clean heat and energy efficiency projects ..."
    },
    {
        "url": "https://uk.news.yahoo.com/where-do-uk-political-parties-stand-gaza-ceasefire-171714480.html",
        "title": "Where do the UK&#39;s political parties stand on a Gaza ceasefire?",
        "description": "With Labour changing its stance and backing an immediate ceasefire, here&#39;s where the main UK parties stand on the Gaza conflict."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/kemi-badenoch-post-office-government-jonathan-reynolds-house-of-commons-b2498204.html",
        "title": "Kemi Badenoch hits out at former Post Office chairman in Horizon row",
        "description": "The Government has denied Henry Staunton’s claim that he was told by a senior civil servant to ‘stall’ spending on compensation to subpostmasters."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/michael-tomlinson-guarantee-flights-rwanda-election-b2498158.html",
        "title": "Minister claims he can guarantee flights to Rwanda before general election",
        "description": "Illegal migration minister Michael Tomlinson has said he can guarantee flights carrying asylum seekers to Rwanda will take off before the next election as he defended the government&#39;s floundering plans to ‘stop the boats ’. Rishi Sunak has repeatedly refused to go that far, saying his aim is to get planes in the air."
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-13096451/Liberal-attitudes-Brits-sleeping-people-fifth-women-two-lovers-year.html",
        "title": "<b>Liberal</b> attitudes could mean Brits are sleeping with more people than ever - as a fifth of women admit they have at least two lovers in a year",
        "description": "It has been claimed that the average Briton has four sexual partners over a lifetime. However, detailed new research suggests that figure may be wildly short of the mark."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24127265.badenoch-hits-former-post-office-chairman-horizon-row/",
        "title": "Badenoch hits out at former Post Office chairman in Horizon row",
        "description": "The Government has denied his claim that told by a senior civil servant to “stall” spending on compensation to subpostmasters ahead of"
    }
]