[
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/04/long-waits-to-see-doctors-creating-mental-health-epidemic-lib-dems-say/",
        "title": "Long waits to see doctors ‘creating mental health epidemic’, Lib Dems say",
        "description": "Long waits for GP and hospital appointments are “creating a mental health epidemic” in the UK, according to the Liberal Democrats. It comes after a survey found the mental health of almost a quarter of adults has been impacted by waiting too long to see a doctor."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862948/tory-members-survey-rishi-sunak-reform",
        "title": "Tory members threaten to vote Reform unless one of these three people replaces Rishi Sunak",
        "description": "EXCLUSIVE: A major survey of registered Conservative members when Rishi Sunak became leader suggests party activists will go on strike at the general election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/04/rishi-sunak-house-of-commons-vote-houthi-airstrikes-yemen/",
        "title": "Rishi Sunak faces fresh calls from MPs for vote on Houthi strikes",
        "description": "Rishi Sunak is facing fresh calls to give MPs a vote on future strikes against the Houthis in Yemen after the UK joined a third wave of bombings over the weekend. The most senior MP in both the Liberal Democrats and the Green Party issued statements on Sunday saying now was the time for the House of Commons to have a vote."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/houthi-red-sea-campaign-is-having-economic-consequences-sunak-says-99272/",
        "title": "Houthi Red Sea campaign is having economic consequences, Sunak says",
        "description": "The <b>Liberal Democrats</b> have urged Mr Sunak to continue to provide Parliament with “an opportunity to have its say” on the strikes through a debate and vote in the House of Commons. Party leader Sir Ed Davey said: “It is becoming increasingly worrying ..."
    }
]