[
    {
        "url": "https://www.thesun.co.uk/money/25558001/lloyds-bank-mobile-vans-cancelled-online-banking/",
        "title": "‘It’s a betrayal,’ say Brits over plans to close vital banking service that will hit thousands",
        "description": "THOUSANDS of customers are set to be hit by a major change and said ‘it’s betrayal’ as Lloyds Bank strips away a crucial service. Loyal members of the banking group were"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "R eform UK is now polling consistently in joint third alongside the Liberal Democrats amid anger at the Conservatives over their handling of illegal migration, The Telegraph’s tracker shows. Richard Tice’s party is holding on to a 10 per cent share of national voting intention, which puts it on an equal footing with the Lib Dems."
    },
    {
        "url": "https://www.theargus.co.uk/news/24077495.sir-vince-cable-visits-mid-sussex-lib-dem-campaign/",
        "title": "Sir Vince Cable visits Mid Sussex for Lib Dem campaign",
        "description": "Sir Vince Cable spoke to <b>Liberal</b> <b>Democrat</b> supporters and members at a launch event for the party’s campaign in Mid Sussex. The <b>Liberal Democrats</b>, who came second in the constituency in 2019, are hoping to defeat the Conservatives in the seat at the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/c1610r7422ro",
        "title": "Council calls for funding to expand city&#39;s Metro",
        "description": "The drive to find funding was raised by <b>Liberal</b> <b>Democrat</b> Councillors, the Local Democracy Reporting Service said. A motion was passed at a full council meeting, when it was agreed that expanding the Metro across Sunderland was “of equal importance to re ..."
    },
    {
        "url": "https://www.theguardian.com/books/2024/jan/28/truce-biden-democrats-election-hunter-walker-luppe-luppen",
        "title": "The Truce review: deep dive on <b>Democrats</b>’ dynamics and divisions",
        "description": "According to one poll, 47% of voters see the <b>Democrats</b> as too <b>liberal</b>, a seven-point swing since 2020. In another survey, only 57% of <b>Democrats</b> and Democratic-leaners expressed satisfaction with Biden as their nominee. More than seven-in-10 Republicans and ..."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/scot-lib-dems-question-why-half-of-carer-support-plans-are-not-completed",
        "title": "Scot Lib Dems question why half of carer support plans are not completed",
        "description": "Scottish <b>Liberal</b> <b>Democrat</b> deputy leader Wendy Chamberlain has today questioned why less than half of carers have a completed support plan and called for a package of measures to support “forgotten” carers. Figures from the Scottish Government’s ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-london-68109486?at_campaign=KARANGA&at_medium=RSS",
        "title": "Off-peak Friday fares trial to start for Tube and trains in London",
        "description": "Off-peak Tube and train fares all day on Fridays will be trialled by Transport for London (TfL) in a bid to boost passenger numbers and support the capital&#39;s economy. Sadiq Khan has asked TfL to launch a three-month trial in March. He said the organisation&#39;s usage data showed Fridays were quieter than any other week day."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-vince-cable-visits-mid-111000908.html",
        "title": "Sir Vince Cable visits Mid Sussex to back Lib Dem election campaign",
        "description": "Sir Vince Cable spoke to Liberal Democrat supporters and members at a launch event for the party’s campaign in Mid Sussex"
    },
    {
        "url": "https://www.countytimes.co.uk/news/24077707.powys-town-councillors-fear-impact-cash-shortfall/",
        "title": "Powys town councillors fear the impact of cash shortfall",
        "description": "A Llanidloes county councillor has warned “rural areas are losing out” after Powys County Council received a lower budget settlement"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24074521.long-mayor-london-serve-know/",
        "title": "How long does the Mayor of London serve? All to know",
        "description": "The Mayor of London is a critical political role currently held by Sadiq Khan, this is everything you need to know about the role."
    },
    {
        "url": "https://news.sky.com/story/adam-boulton-are-we-in-for-one-of-the-dirtiest-election-campaigns-ever-13056641",
        "title": "Adam Boulton: Are we in for one of the &#39;dirtiest&#39; election campaigns ever?",
        "description": "Fiery exchanges between Rishi Sunak and Sir Keir Starmer at Prime Minister&#39;s Questions suggest the Conservatives and Labour are preparing to take the gloves off."
    },
    {
        "url": "https://news.sky.com/story/budget-news-latest-jeremy-hunt-chancellor-live-12593360?postid=5625380.",
        "title": "Politics latest: More names of plotters trying to oust Rishi Sunak expected to be revealed; Reform UK surges in polls",
        "description": "There is no clear alternative to lead the Conservative Party if Rishi Sunak were to be ousted, new polling has suggested. Questions about the prime minister&#39;s future have been raised by the calls for him to go from Sir Simon Clarke, and the defection of ..."
    },
    {
        "url": "https://uk.news.yahoo.com/many-times-mayor-london-elected-050000546.html",
        "title": "How many times can a Mayor of London be re-elected and how long is a term?",
        "description": "The Mayor of London is a critical political role currently held by Sadiq Khan, this is everything you need to know about the role."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12767962.tattoo-faces-pound-15m-bill-stand-fit-21st-century/",
        "title": "Tattoo faces £15m bill for stand fit for 21st century",
        "description": "It is hoped the new stand will be operational for the 2011 Tattoo. Jeremy Purvis, the <b>Liberal Democrats</b>&#39; culture spokesperson, said:&quot;The Tattoo is very much a signature event for Scotland,&quot; he said. &quot;It attracts a huge amount of international interest."
    },
    {
        "url": "https://www.theatlantic.com/ideas/archive/2024/01/clean-energy-san-francisco-environmentalism/677276/",
        "title": "Don’t San Francisco–ize Clean Energy",
        "description": "What happens when environmentalists and sympathetic lawmakers fail to see the downside of too much legal review"
    },
    {
        "url": "https://ca.news.yahoo.com/ex-central-banker-carney-backs-180813983.html",
        "title": "Ex-central banker Carney backs Trudeau to lead Liberals in Canada&#39;s next election",
        "description": "(Reuters) - Former central bank Governor Mark Carney on Sunday said he supported Canadian Prime Minister Justin Trudeau leading the <b>Liberal</b> Party into the next federal election, quashing speculation that Carney would mount his own leadership bid."
    },
    {
        "url": "https://madison.com/opinion/editorial/our-view-iowa-model-for-fair-maps-is-still-the-answer-because-court-ruling-could/article_680892de-bc6c-11ee-931a-5bfeb0e836c8.html",
        "title": "OUR VIEW: Iowa model for fair maps is still the answer because court ruling could quickly revert",
        "description": "The fix must be a neutral and permanent map-making process that both major political parties — and more important, the voting public — can accept."
    },
    {
        "url": "https://www.foxnews.com/politics/george-soros-pours-millions-texas-shifting-power-dems",
        "title": "George Soros pours millions into Texas in hopes of shifting power to Dems",
        "description": "Financier George Soros has recently dropped millions into a handful of left-wing groups in Texas to help Democrats gain ground in the state."
    },
    {
        "url": "https://www.thisisthecoast.co.uk/news/local-news/east-riding-councillor-defects-to-labour/",
        "title": "East Riding Councillor Defects to Labour",
        "description": "The former leader of the East Riding Liberal Democrats has defected to Labour following his suspension earlier this month."
    },
    {
        "url": "https://inews.co.uk/news/media/tv-licence-fee-replace-tax-2874797?ico=related_article_inline",
        "title": "Replace licence fee with ‘TV tax’ whether you watch or not, says TV boss",
        "description": "The licence fee should be replaced with a “TV tax” paid by households regardless of whether they watch television or not, the former ITV chairman has said. Sir Peter Bazalgette, the leading TV executive behind hit shows including Big Brother,"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/28/chancellor-considers-further-national-insurance-cut-to-take-heat-off-rishi-sunak",
        "title": "Chancellor considers further national insurance cut to take heat off Rishi Sunak",
        "description": "Jeremy Hunt targets further reduction in ‘jobs tax’ in March budget"
    },
    {
        "url": "https://www.thesun.co.uk/news/25549233/lords-slammed-over-plan-to-thwart-rwanda-scheme/",
        "title": "Lords slammed over plan to thwart Rwanda scheme",
        "description": "&quot;Their attempts to frustrate the will of the people make clear that the <b>Liberal Democrats</b> are firmly on the side of the criminal gangs, not the British people. The public should know they are not a serious political party.&quot; Marco Longhi, MP for Dudley ..."
    },
    {
        "url": "https://www.ctvnews.ca/mobile/politics/trudeau-and-singh-s-teams-quietly-planning-electoral-reform-legislation-1.6744379?clipId=89578",
        "title": "Trudeau and Singh&#39;s teams quietly planning electoral reform legislation",
        "description": "As progress on some measures in the <b>Liberal</b>-NDP confidence-and-supply agreement continue ... Specifically, the Liberals and New <b>Democrats</b> agreed to explore: Allowing an &quot;expanded&quot; three-day voting period during general elections; Allowing voters to cast ..."
    }
]