[
    {
        "url": "https://www.thetimes.co.uk/article/tories-face-election-wipeout-in-scotland-poll-predicts-st79j6jgm",
        "title": "Tories face election wipeout in Scotland, poll predicts",
        "description": "The Liberal Democrats would secure four seats but the Tories would return no MPs in Scotland for the first time since 1997. The polling of 18,000 people was carried out on behalf"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11983157/scottish-parliament-computers-edit-msps-wikipedia-pages/",
        "title": "Scottish parliament computers used numerous times to edit &amp; improve MSPs’ Wikipedia pages",
        "description": "SCOTTISH Parliament computers have been used numerous times to  edit MSPs’ Wikipedia pages to make them more positive. They include deleting criticism of Scottish Lib Dem leader"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-80-seats-general-election-poll-2906688",
        "title": "Tories face being reduced to 80 seats, poll of 18,000 voters suggests",
        "description": "Cabinet ministers are predicted to lose their seats in total in what would mark the worst Conservative wipeout in history"
    },
    {
        "url": "https://uk.news.yahoo.com/sadiq-khan-consider-installing-vast-211205176.html",
        "title": "Sadiq Khan to &#39;consider&#39; installing vast floor map of London at City Hall",
        "description": "The huge aerial map was a popular feature of the old City Hall, but it was left behind when the Greater London Authority moved to the Royal Docks"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-byelections-peter-bone-results-b2496002.html",
        "title": "By-elections - LIVE: Peter Bone’s girlfriend aims for Wellingborough seat as Kingswood faces axe",
        "description": "Helen Harrison is running for the Conservative Party in Wellingborough, after her disgraced partner Peter Bone lost the seat in a recall petition having been suspended over bullying and sexual misconduct claims he denies."
    },
    {
        "url": "https://thelincolnite.co.uk/2024/02/retired-police-officer-joins-politics-to-stands-for-lincoln-council-leaders-seat/",
        "title": "Retired police officer joins politics to stand in Lincoln council leader’s seat",
        "description": "A retired Lincolnshire Police officer is vying for Ric Metcalfe’s seat on City of Lincoln Council in this year’s local election. In light of Councillor Metcalfe’s retirement, the Labour group has confirmed Duncan Spencer as their candidate for the Glebe ward in this year’s local election."
    },
    {
        "url": "https://www.standard.co.uk/news/london/zoe-garbett-road-user-charging-pay-per-mile-system-ulez-congestion-charge-london-mayoral-election-candidate-b1139209.html",
        "title": "Green London mayoral candidate Zoë Garbett proposes &#39;smarter, fairer road charging system&#39;",
        "description": "The idea bears a close resemblance to the ‘pay-per-mile’ system which Sadiq Khan has promised will not happen for as long as he is mayor"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-general-election-starmer-poll-b2496283.html",
        "title": "Bombshell poll shows Rishi Sunak on course to hold just 80 Tory seats",
        "description": "Rishi Sunak is on course to lose more than three quarters of the Tories’ seats, the survey of 18,000 voters suggests"
    },
    {
        "url": "https://www.worcesternews.co.uk/news/24117267.waverley-street-raw-sewage-problem-caused-wet-wipes/",
        "title": "Waverley Street raw sewage problem caused by &#39;wet wipes&#39;",
        "description": "We reported last week how raw sewage was pouring out of a drain in the middle of Waverley Street in Diglis last Thursday after heavy rain. Now the cause of the blockage has been revealed - wet wipes flushed down city toilets which had to be cleared by Severn Trent Water engineers."
    },
    {
        "url": "https://uk.style.yahoo.com/jon-stewart-draws-liberal-anger-173317173.html",
        "title": "Jon Stewart Draws <b>Liberal</b> Anger for Criticizing Biden: “I’ll Never Forgive You”",
        "description": "With his very first episode back, Jon Stewart has successfully returned The Daily Show to the cultural conversation — by drawing fire from Democrats. Stewart’s return to Daily Show hosting duties Monday night opened with a 20-minute monologue going after Donald Trump and Joe Biden."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24120546.luke-littler-looks-35-says-house-lords-peer/",
        "title": "Luke Littler &#39;looks about 35&#39; says House of Lords Peer",
        "description": "LUKE Littler has been used as an example in the house of lords criticising the Government’s approach to determining if an asylum seeker is a child"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-need-geography-lessons-after-32126088",
        "title": "Tories need &#39;geography lessons&#39; after Network North transport pledge includes funding for South",
        "description": "An official document on the &#39;Network North&#39; scheme outlines plans for rail not only in the North and the Midlands, but also in London and in areas as far south as Devon"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/general-election-2024-poll-tracker-32123308",
        "title": "General election 2024 poll tracker: How do the UK political parties compare",
        "description": "Britain is gearing up for a general election this year after 14 years of Tory rule. Here are the latest polls and odds on Labour, the Conservatives, Reform UK, Lib Dems and more"
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-speed-keir-starmer-transformed-162056538.html",
        "title": "OPINION - The speed with which Keir Starmer has transformed Labour is both his greatest success and clearest weakness",
        "description": "The three original members, Mutya Buena, Keisha Buchanan and Siobhan Donaghy each eventually left the group to be replaced in turn by a new singer, until none of the founder members remained. Much like the theoretical ship debated by ancient philosophers,"
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/harrogate-lib-dems-plea-for-a-return-to-proper-community-policing-in-response-to-burglary-figures-for-north-yorks-4518820",
        "title": "Harrogate Lib Dem&#39;s plea for a return to &#39;proper community policing&#39; in response to burglary figures for North Yorks",
        "description": "Harrogate&#39;s Lib Dem candidate for the General Election has returned to his attacks on &quot;ineffective resourcing&quot; which he says has left police forces in North Yorkshire overstretched and unable to focus on frontline crime like burglaries."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/kingswood-election-2024-live-voters-9099248",
        "title": "Kingswood by-election 2024 LIVE: Voters head to the polls today after MP resigns",
        "description": "The by-election is being held on Thursday, February 15 and the result expected early in the morning of Friday, February 16"
    },
    {
        "url": "https://www.countytimes.co.uk/news/24119990.powys-council-submit-ysgol-bro-hyddgen-bid-amid-cadw-call/",
        "title": "Powys Council to submit Ysgol Bro Hyddgen bid amid Cadw call",
        "description": "Powys County Council says it is to submit an application for its £49m Ysgol Bro Hyddgen plans despite Cadw being asked to list the building."
    },
    {
        "url": "https://www.newstatesman.com/ns-interview/2024/02/hillbilly-energy",
        "title": "Europe’s new age of insecurity",
        "description": "Tipped to be Trump’s running mate, JD Vance is the voice of the new American right."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/14/labour-conservatives-rochdale-kingswood-wellingborough-rishi-sunak-keir-starmer-uk-politics-live?filterKeyEvents=false&page=with:block-65ccde888f084fe73a9945b1",
        "title": "Final day of campaigning in Kingswood and Wellingborough byelections – UK politics live",
        "description": "Labour seeking to take two seats from Tories on Thursday amid fraught week of candidate suspensions"
    },
    {
        "url": "https://www.frometimes.co.uk/2024/02/14/lib-dem-candidate-selected-for-frome/",
        "title": "Lib Dem candidate selected for Frome",
        "description": "THE Liberal Democrats have selected local businesswoman and campaigner, Anna Sabine, as their election candidate for the new Frome and East Somerset constituency."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/14/tory-mp-58th-quit-next-election-conservatives-kieran-mullan/",
        "title": "Tory MP becomes 58th to quit at next election as Conservatives near 1997 record",
        "description": "More Tory MPs are quitting at the next election than at any point since 1997, when 75 stood aside in advance of a contest that saw Labour win a landslide victory under Sir Tony Blair. Rishi Sunak is widely expected to trigger the next national poll in the second half of this year, meaning the threshold could well be reached in the coming months."
    },
    {
        "url": "https://www.hemeltoday.co.uk/news/politics/council/hertfordshire-county-council-sets-whopping-ps11bn-budget-for-2425-after-max-tax-increase-4518247",
        "title": "Hertfordshire County Council sets whopping £1.1bn budget for 24/25 after max tax increase",
        "description": "During the budget debate amendments were proposed by <b>Liberal</b> <b>Democrat</b> and Labour councillors – but none were backed by the council’s Conservative majority. The <b>Liberal Democrats</b> proposed that an extra £1m be invested in the SEND team and the proposed ..."
    },
    {
        "url": "https://www.itv.com/news/anglia/2024-02-14/knife-edge-by-election-gives-sunak-first-electoral-headache-of-2024",
        "title": "Wellingborough by-election: The seat poised to present Sunak with first electoral headache of 2024",
        "description": "The by-election in Wellingborough in Northamptonshire was triggered after the constituency&#39;s previous MP was removed by a recall petition. | ITV News Anglia"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13082595/How-allowed-larger-extensions-rear-loft-home-WITHOUT-planning-permission-Michael-Goves-changes-theres-warnings-pit-neighbour-against-neighbour-civil-war-Britains-streets.html",
        "title": "How you will be allowed larger extensions to the rear, side or loft of your home WITHOUT planning permission under Michael Gove&#39;s changes - but there&#39;s warnings it will pit ...",
        "description": "Michael Gove , the Levelling Up, Housing and Communities Secretary, wants homeowners in England to have greater rights to expand their properties."
    },
    {
        "url": "https://www.buxtonadvertiser.co.uk/news/people/tribute-to-long-serving-new-mills-councillor-following-his-unexpected-death-4518079",
        "title": "Tribute to long serving New Mills councillor following his unexpected death",
        "description": "The family and friends of a long serving New Mills councillor have expressed their shock following his sudden death."
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/news/people/electorate-set-to-vote-in-by-election-for-new-staveley-town-councillor-for-duckmanton-4517981",
        "title": "Electorate set to vote in by-election for new Staveley Town Councillor for Duckmanton",
        "description": "Voters are being given a chance to influence recovering Derbyshire-based Staveley Town Council’s finely-balanced political make-up as it holds a by-election for its vacant Duckmanton Ward seat."
    },
    {
        "url": "https://www.abergavennychronicle.com/news/extra-money-for-powys-schools-as-welsh-government-cash-drops-665944",
        "title": "Extra money for Powys schools as Welsh Government cash drops",
        "description": "AN extra £570,000 is expected to be ploughed into Powys schools as more funding from Welsh Government is set to be given to local authorities."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1866601/diy-dentistry-nhs-crisis",
        "title": "Teeth pulled out with pliers as shortage of dentists leads to desperate action",
        "description": "Millions of people feel they have no choice but to resort to carrying out urgent treatment themselves due to a lack of NHS dentists."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-conservatives-wellingborough-kingswood-government-b1139016.html",
        "title": "Kingswood and Wellingborough by-elections: Key statistics and benchmarks",
        "description": "There are six candidates standing in the by-election: Sam Bromiley (Conservative), Andrew Brown (Liberal Democrat), Damien Egan (Labour), Lorraine Francis (Green), Rupert Lowe (Reform) and Nicholas Wood (Ukip)."
    },
    {
        "url": "https://www.libdemvoice.org/party-awards-get-your-nominations-in-by-27-february-74651.html",
        "title": "Party awards – get your nominations in by 27 February",
        "description": "Every Conference, the Liberal Democrats honour individuals who have served the party well with our party awards. In York, the following awards will be presented: The Leader’s Award Eligibility: Any member of the party."
    },
    {
        "url": "https://inews.co.uk/news/world/liberal-media-trump-ridicule-satire-2904068?ico=in-line_link",
        "title": "Ridiculing Trump doesn’t hurt him – <b>liberal</b> media does not understand that",
        "description": "In a year’s time, Nato could be in tatters and a gung-ho Russian dictator could be considering plans to &#39;de-Nazify’ Baltic nations"
    },
    {
        "url": "https://www.mywelshpool.co.uk/viewerheadline/ArticleId/25402",
        "title": "Extra £570k drops into Powys schools’ coffers",
        "description": "At a meeting of Powys County Council’s <b>Liberal</b> <b>Democrat</b>/Labour Cabinet yesterday (Tuesday), senior councillors took another look at their draft budget for 2024/2025. This included a budget amendment after deciding what to do with the extra money from the ..."
    },
    {
        "url": "https://www.newstatesman.com/world/americas/north-america/us/2024/02/hillbilly-energy",
        "title": "Europe’s Iron Lady: Estonian prime minister Kaja Kallas",
        "description": "Tipped to be Trump’s running mate, JD Vance is the voice of the new American right"
    },
    {
        "url": "https://www.shropshirestar.com/news/education/2024/02/14/extra-570k-for-powys-schools-in-next-years-budget/",
        "title": "Extra £570k for Powys schools in next year&#39;s budget",
        "description": "An extra £570,000 is expected to be ploughed into Powys schools as more funding from Welsh Government is set to be given to local authorities."
    },
    {
        "url": "https://uk.movies.yahoo.com/democrats-win-another-special-election-053600391.html",
        "title": "<b>Democrats</b> win another special election, and 4 more takeaways from New York&#39;s House race",
        "description": "Suozzi came out in strong support of Israel&#39;s response, which has drawn pushback from Biden as &quot;over the top,&quot; saying he didn&#39;t support conditions on aid to Israel, a key demand of many of Biden&#39;s more <b>liberal</b> detractors. <b>Democrats</b> in New York were dogged ..."
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/cambridge-news/maximum-council-tax-increase-people-28629335",
        "title": "Maximum council tax increase for people across Cambridgeshire as promise made to spend more on roads",
        "description": "The leader of the county council, Councillor Lucy Nethsingha (<b>Liberal</b> <b>Democrat</b>), said the investments proposed for the coming year will “make a difference for families in Cambridgeshire ”. At a full council meeting this week (February 13) the authority ..."
    }
]