[
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/neighbours-who-choice-taken-away-28562338",
        "title": "The neighbours who have had their &#39;choice taken away&#39; by Openreach",
        "description": "Southport community group have launched a local petition to stop telegraph poles being erected in the neighbourhood"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-essex-68185071",
        "title": "Essex County Council leader statement due on Simon Harris payments",
        "description": "Simon Harris received the money to run Facebook groups and carry out other work during the Covid pandemic for Essex County Council. He maintained the money covered more than updating social media content. The council said the matter would also be referred to the relevant committee."
    },
    {
        "url": "https://www.standard.co.uk/news/crime/arbuthnot-vince-cable-horizon-margot-james-adam-crozier-b1136702.html",
        "title": "Paula Vennells to give evidence at next stage of Horizon inquiry",
        "description": "Former Post Office boss Paula Vennells will give evidence at the next stage of the inquiry into the Horizon IT scandal. Ms Vennells, who was chief executive officer of Post Office Ltd between 2012 and 2019, has come under fire over why hundreds of subpostmasters were wrongly prosecuted for fraud and false accounting under her watch."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/cramlington-labour-candidate-general-election-28558593",
        "title": "Labour select candidate to fight newly formed Northumberland seat at general election",
        "description": "The Labour Party has unveiled its candidate for the newly formed Cramlington and Killingworth seat at the looming General Election."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155023/everyone-who-is-standing-in-the-rochdale-byelection",
        "title": "Everyone who is standing in the Rochdale by-election",
        "description": "On 29 February, residents of the Rochdale constituency will have their chance to say who they want to represent them"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/02/paula-vennells-post-office-scandal-inquiry-alan-bates/",
        "title": "Paula Vennells to break silence on Post Office scandal when inquiry resumes",
        "description": "Hundreds of sub-postmasters were wrongly prosecuted for fraud and false accounting during her tenure as CEO from 2012 and 2019"
    },
    {
        "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/hull-householders-face-maximum-council-9074990",
        "title": "Hull householders face maximum council tax increase amid &#39;very uncertain&#39; financial outlook",
        "description": "Separately, Humberside Police and Humberside Fire and Rescue have also set out proposals to increase their precepts – the amount levied on top of council tax bills to pay for these services. Humberside Police has proposed a rise of £12.99 a year for Band D homes, while Humberside Fire and Rescue has recommended an increase of £2.84-a-year."
    },
    {
        "url": "https://www.ft.com/content/cbacd28a-4e03-4016-b72d-93df9bbee9ae",
        "title": "Paula Vennells to face grilling at next stage of Post Office inquiry",
        "description": "Former chief executive will be joined by BT chair Adam Crozier at probe into one of UK’s biggest miscarriages of justice"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/scottish-liberal-democrats-respond-to-independence-paper-on-culture",
        "title": "Scottish <b>Liberal Democrats</b> respond to independence paper on culture",
        "description": "Responding to the publication of the Scottish Government’s latest paper on independence, this time on culture, Scottish Liberal Democrat culture spokesperson Neil Alexander said:"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13038179/washington-portland-drugs-emergency-jason-rantz.html",
        "title": "Liberals with the blood of a THREE-WEEK-OLD on their hands: A tiny naked corpse found abandoned in a bush - after his homeless addict dad was allowed to &#39;care&#39; for him. Why ...",
        "description": "RANTZ: The tiny corpse was found naked, dumped in a discarded car seat covered by bushes. The dad denies killing the boy or taking drugs before the baby&#39;s death. Only afterward, did he get high."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-cornwall-68179102",
        "title": "Edwina Hannaford: Tributes paid to long-serving Cornwall councillor",
        "description": "Tributes are being paid to Cornwall councillor Edwina Hannaford who has died following a lengthy illness. Since joining Looe Town Council in 2003, she was mayor before becoming the Liberal Democrat councillor for Looe West, Pelynt, Lansallos &amp; Lanteglos. She had been reportedly suffering from an aggressive form of cancer."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/badenoch-whatsapps-lib-dems-demand-cabinet-office-investigation",
        "title": "Badenoch WhatsApps: Lib Dems demand Cabinet Office investigation",
        "description": "The Liberal Democrats are calling for a Cabinet Office investigation into whether Kemi Badenoch is using taxpayers&#39; money to fund a covert leadership campaign."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "One of the interesting reasons, I think, why that dog doesn’t seem to have bark as much as we thought is effectively the non-aggression pact between Labour and the <b>Liberal Democrats</b> means although the Lib Dems voted differently to the Labour party on ..."
    },
    {
        "url": "https://www.farnhamherald.com/news/politics/opinion-dont-believe-labours-bluster-the-lib-dems-are-best-placed-to-dethrone-the-tories-663748",
        "title": "Opinion: Don&#39;t believe Labour&#39;s bluster – the Lib Dems are best placed to dethrone the Tories...",
        "description": "The Liberal Democrats are the leading challengers to the Conservatives in the new Farnham Bordon constituency, contrary to another misleading claim from the local Labour Party in the Herald last week that they are best placed to beat the Conservatives when a General Election is called."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/13152662.high-price-will-libdems-pay/",
        "title": "How high a price will LibDems pay?",
        "description": "Willie Rennie, the leader of the Scottish <b>Liberal Democrats</b>, makes an admission and a prediction in his interview with The Herald today. The admission is that his party has been badly damaged by its association with the Tories in government; his prediction ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/more-emergency-accommodation-opened-cardiff-28559295",
        "title": "More emergency accommodation opened in Cardiff in addition to criticised Toys R Us site",
        "description": "Cardiff Council has opened another emergency accommodation site in the city more than a month after it was reported that a former Toys R Us site was being used to house homeless people. The council said its homelessness service is continuing to face pressure and it has opened the additional building as a temporary measure to cope with an &quot;upsurge in demand&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/yourmoney/taxes/article-13033955/Child-tax-credits-april-get.html",
        "title": "Child tax credits bill passes key first hurdle - can YOU get extra $200 per kid by April?",
        "description": "Experts are saying it will be worth holding off from filing returns - due by April 15. A new bill promises extra money for parents. It will also help businesses too."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/german-mps-approve-controversial-2024-140720466.html",
        "title": "German MPs approve controversial 2024 budget",
        "description": "Germany&#39;s parliament on Friday approved a revised 2024 budget that will reinstate strict debt limits after a shock legal ruling forced Chancellor Olaf Scholz to redraw his spending plans.The ruling tore a 17-billion-euro hole in the government&#39;s 2024 finance plans."
    },
    {
        "url": "https://www.standard.co.uk/news/london/mayoral-election-serge-crowbolder-lower-rents-digital-democracy-b1136471.html",
        "title": "London mayoral election: Independent candidate pledges lower London rents and digital democracy",
        "description": "Mayoral hopeful Serge Crowbolder has also said wants to commission a study into whether a dam could be built between Kent and Essex"
    },
    {
        "url": "https://www.lincolnshirelive.co.uk/news/local-news/potential-move-date-set-raf-9074399",
        "title": "Potential move-in date set for RAF Scampton asylum seekers",
        "description": "A potential date has been set for the arrival of asylum seekers at the former RAF Scampton base. The first arrivals could be showing up on April 14, according to Home Office documents. Tom Pursglove,"
    },
    {
        "url": "https://www.cornish-times.co.uk/news/tribute-paid-to-former-mayor-of-looe-edwina-hannaford-664033",
        "title": "Tribute paid to former mayor of Looe - Edwina Hannaford",
        "description": "TRIBUTES have been paid to the former mayor of Looe and long serving Cornwall councillor, Edwina Hannaford, following the news of her passing."
    },
    {
        "url": "https://www.newstatesman.com/ideas/2024/02/illiberal-world-us-liberal-order-joe-biden",
        "title": "Elon Musk ruined my sex life",
        "description": "Biden’s Trade Representative repudiated a ruling of the World Trade Organisation on steel and aluminium imports, on “national security” grounds. Biden himself convened global “Democracy” summits, but deference and loyalty rather than government-type determined the invitation list."
    },
    {
        "url": "https://uk.news.yahoo.com/tributes-pour-passing-cornwall-councillor-122500629.html",
        "title": "Tributes pour in after passing of Cornwall councillor Edwina Hannaford",
        "description": "Tributes have been paid to former Cornwall Council cabinet member Edwina Hannaford following her death. The highly respected Liberal Democrats councillor passed away after a battle against an aggressive form of cancer. Councillor Hilary Frank, chair of the Cornwall Liberal Democrats&#39; Council Group, extended a touching tribute to her late colleague."
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/24093247.tributes-death-cornwall-councillor-edwina-hanniford/",
        "title": "Tributes after death of Cornwall councillor Edwina Hanniford",
        "description": "Tributes have been paid to former Cornwall Council cabinet member Edwina Hannaford following her death. The highly respected Liberal Democrats councillor passed away after a battle against an aggressive form of cancer. Councillor Hilary Frank, chair of the Cornwall Liberal Democrats&#39; Council Group, extended a touching tribute to her late colleague."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/councillor-edwina-hannaford-passed-away-9073769",
        "title": "Councillor Edwina Hannaford has passed away and tributes flood in",
        "description": "Tributes have been paid to Cornwall councillor Edwina Hannaford, who throughout her life was a tireless champion for her beloved town of Looe."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/sunak-slammed-as-quarter-of-pharmacy-budgets-cut-since-2015",
        "title": "Sunak slammed as quarter of pharmacy budgets cut since 2015",
        "description": "The Liberal Democrats have slammed the Conservatives for failing pharmacies as reports show hundreds of millions of pounds worth of cuts since 2015."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/over-3-million-peoples-mental-health-impacted-by-rising-mortgages-and-rents",
        "title": "Over 3 million people’s mental health impacted by rising mortgages and rents",
        "description": "The Liberal Democrats have warned that the mortgage crisis is causing a “mental health ticking time bomb,” after figures showed that over three million people’s mental health has been negatively affected by not being able to afford their rent or mortgage."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/02/south-carolina-presidential-primary-what-to-know",
        "title": "South Carolina’s presidential primary: all you need to know",
        "description": "Democrats will award their first delegates in the state that transformed Biden’s fortunes in 2020 while Republican Nikki Haley has an uphill struggle in her home state"
    },
    {
        "url": "https://www.derbytelegraph.co.uk/news/local-news/candidates-two-derbyshire-dales-elections-9073548",
        "title": "Candidates for two Derbyshire Dales by-elections announced",
        "description": "Only two candidates have listed their home address, with four listing “Derbyshire Dales”. May’s elections saw the Conservatives retain the second Bakewell seat (now held by Gareth Gee) by 55 votes over Labour."
    },
    {
        "url": "https://www.funds-europe.com/uks-labour-party-to-copy-french-tibi-fund-if-elected/",
        "title": "UK’s Labour Party to copy French Tibi fund if elected",
        "description": "The UK will launch its own equivalent of France’s ‘Tibi’ investment fund if the Labour Party takes power at the next General Election."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155028/rochdale-byelection-lib-dem-candidate-iain-donaldson-launches-campaign",
        "title": "Rochdale by-election: Lib Dem candidate Iain Donaldson launches campaign",
        "description": "Lib Dem parliamentary candidate Iain Donaldson has launched his campaign in Rochdale, promising to &quot;hold this disastrous Conservative government to account&quot; for their &#39;failings on the NHS&#39;, the cost of living crisis, and water companies polluting the rivers with filthy sewage."
    },
    {
        "url": "https://www.sunderlandecho.com/news/politics/council/sunderland-councillor-condemn-toxicity-and-abuse-of-politicians-which-harms-democracy-4502562",
        "title": "Sunderland councillor condemn &#39;toxicity&#39; and abuse of politicians which &#39;harms democracy&#39;",
        "description": "A motion was raised at the latest full authority meeting of Sunderland City Council by leading Labour politicians, who noted the issue can prevent councillors from representing their community and deter people from standing for election."
    }
]