[
    {
        "url": "https://www.dailymail.co.uk/news/article-13052459/record-breaking-57-voters-Mexico-border-crisis-Democrats-Biden-immigration-surge.html",
        "title": "A record-breaking 57% of voters say the US-Mexico border is in &#39;crisis,&#39; as <b>Democrats</b> turn on Joe Biden for bungling the immigration surge",
        "description": "Especially troubling for Biden is how opinions have shifted fast among his own <b>liberal</b> camp. Only 31 percent of <b>Democrats</b> said the border was in crisis in early 2021 — that&#39;s jumped to 41 percent in this month&#39;s survey. Now, three in 10 <b>Democrats</b> say ..."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-polling-london-mayoral-election-susan-hall-mayor-labour-conservative-polls-b1137514.html",
        "title": "London mayoral election: Sadiq Khan says he does not believe polls giving him 20 point lead over Susan Hall",
        "description": "The mayor pointed to the twin shocks in 2016 of the Brexit campaign and Donald Trump seizing victory as examples of polls misjudging electorates"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68076729?at_medium=RSS&",
        "title": "Wellingborough by-election: Who will make a splash?",
        "description": "Ben Habib (left) and Reform UK&#39;s leader Richard Tice launched their campaign in Wellingborough Wellingborough voted 62.4% in favour of Brexit in the 2016 EU referendum. Ben Habib, Reform UK&#39;s candidate, said this could give the party, which was formerly ..."
    },
    {
        "url": "https://leamingtonobserver.co.uk/news/kenilworth-and-southams-lib-dem-candidate-calls-for-change-48155/",
        "title": "Kenilworth and Southam&#39;s Lib Dem candidate calls for change",
        "description": "Jenny Wilkinson took to the podium in Barford with a rousing speech declaring the Liberal Democrats are ready to change the political landscape."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24101383.barney-norris-named-green-party-candidate-salisbury/",
        "title": "Barney Norris named Green Party candidate for Salisbury",
        "description": "Award-winning writer Barney Norris has been selected as the Green Party’s candidate for Salisbury at the coming General Election."
    },
    {
        "url": "https://www.leightonbuzzardonline.co.uk/news/politics/council/leighton-buzzard-councillors-look-at-flood-management-after-brook-reached-highest-ever-recorded-level-4507883",
        "title": "Leighton Buzzard councillors look at flood management after brook reached &#39;highest ever recorded level&#39;",
        "description": "Residents of Waterdell and Lovent Drive in Leighton Buzzard had garages, outbuildings and gardens flooded when the Clipstone Brook reached its highest ever recorded level, last month. Their concerns about the management of the brook are being taken up by local Liberal Democrat councillors, who hope to arrange a meeting with the Environment Agency."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/liberal-democrats-select-cornish-campaigner-9080437",
        "title": "<b>Liberal Democrats</b> select Cornish campaigner as election candidate",
        "description": "A campaigner and solicitor has been selected by the North Cornwall Liberal Democrats to stand in the upcoming General Election. Cornish-born Ben Maguire will be put forward in the election, to take place at some point later this year."
    },
    {
        "url": "https://londonnewsonline.co.uk/news/lib-dems-announce-candidate-to-fight-lewisham-mayoral-by-elections/",
        "title": "Lib Dems announce candidate to fight Lewisham Mayoral by-elections",
        "description": "Former councillor Chris Maines has been announced as the Liberal Democrat candidate for the forthcoming mayoral by-election following Damien Egan’s resignation earlier this month. Mr Maines – who works for the NHS – is a former Lewisham councillor and has lived in Blackheath for almost 20 years."
    },
    {
        "url": "https://news.sky.com/story/nigel-farage-conservatives-facing-extinction-event-and-hes-aiming-to-replace-them-13065400",
        "title": "Nigel Farage: Conservatives facing &#39;extinction event&#39; and he&#39;s aiming to replace them",
        "description": "The Reform Party politician spoke at the Conservatives&#39; PopCon event about what he thinks will happen after the next election and ruled out joining the Tories. Sir Jacob Rees-Mogg, meanwhile, described his party as the &quot;Duracell bunny of political life&quot;."
    },
    {
        "url": "https://www.heraldscotland.com/news/24101793.hundreds-18s-held-custody-without-conviction/",
        "title": "Hundreds of under 18s held in custody without conviction",
        "description": "SNP ministers have been urged to curb under 18s being held on remand after it was revealed that hundreds of teenagers have been retained in"
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24099945.sunak-admits-not-betting-person-amid-criticism-rwanda-wager/",
        "title": "Sunak admits he is ‘not a betting person’ amid criticism over Rwanda wager",
        "description": "Rishi Sunak shook hands on a £1,000 wager with broadcaster Piers Morgan about flights to Rwanda leaving before the election."
    }
]