[
    {
        "url": "https://www.markpack.org.uk/172558/two-more-conservative-by-election-defeats-what-does-it-all-mean/",
        "title": "Two more Conservative by-election defeats: what does it all mean?",
        "description": "This episode of Never Mind The Bar Charts is another special with the Lib Dem Pod team, discussing what to make of the latest by-elections"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/greenbank-crossroads-to-be-closed-for-resurfacing",
        "title": "Greenbank Crossroads to be closed for resurfacing",
        "description": "&quot;The final carriageway resurfacing at the junction of Greenbank Terrace and Greenbank Crescent will take place over a period of 5 nights from Monday 26th February. The road will be closed to traffic from 7pm each evening through to 6am the following morning."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/17/rishi-sunak-tories-traditional-values-win-election-poll/",
        "title": "Sunak must embrace traditional Conservative values for Tories to win election, poll suggests",
        "description": "Poll likely to fuel concerns over Rishi Sunak’s leadership as Labour leads with 22 percentage points over Conservatives"
    },
    {
        "url": "https://uk.news.yahoo.com/hospital-tooth-extractions-wiltshire-children-170000384.html",
        "title": "Hospital tooth extractions for Wiltshire children way above national average",
        "description": "Data released by the Office for Health Improvement and Disparities has shown that rate of children in Wiltshire attending hospital for tooth extractions is 70% higher than the national average."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/somerset-news/mp-says-speeding-driver-who-9093958",
        "title": "MP says speeding driver who killed two sisters not given tough enough sentence",
        "description": "A reckless driver who killed two young sisters on a Somerset road was jailed for only ten years, sparking outrage from their family and their MP"
    },
    {
        "url": "https://www.politics.co.uk/5-minute-read/2024/02/17/friend-or-foe-the-conservative-party-misjudges-nigel-farage-at-its-peril/",
        "title": "Friend or foe? The Conservative Party misjudges Nigel Farage at its peril",
        "description": "As they are busy engaging with Nigel Farage, are Conservatives misreading the very threat that he poses to their party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-election losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://inews.co.uk/news/world/plan-b-democrats-beat-trump-biden-2910669?ico=most_popular",
        "title": "There’s only one viable Plan B for the <b>Democrats</b> to beat Trump",
        "description": "Still, according to Politico, there might be a path that allows Biden to stand down with dignity and pass on the baton: the Democratic primary campaign is allowed to run its course until 4 June. Biden emerges victorious, with far more than the 1,968 pledged delegate votes needed for the nomination."
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/24126091.cla-poll-finds-labour-takes-lead-among-rural-voters/",
        "title": "CLA poll finds labour takes lead among rural voters",
        "description": "LABOUR has taken a narrow lead over the Conservatives among England’s rural voters, a poll has found. But while the survey suggests Conservative support has collapsed in the party’s heartlands, the head of a major countryside business association said rural voters were still “politically homeless”."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24125889.thames-valley-burglaries-solved-1-4-cases/",
        "title": "Thames Valley burglaries only solved in 1/4 of cases",
        "description": "Only 14 per cent of burglaries in Oxfordshire, Buckinghamshire and Berkshire are solved by Thames Valley Police, according to Home Office figures."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68323136?at_link_origin=BBC_Radio_Northampton&at_link_type=web_link&at_link_id=5D59FE48-CD62-11EE-9AE7-023C8161DE7E&at_bbc_team=editorial&at_format=link&at_campaign=Social_Flow&at_medium=social&at_ptr_name=facebook_page&at_campaign_type=owned",
        "title": "Wellingborough by-election: Five things we learned",
        "description": "The dust has settled, 30,000-odd votes have been counted and Wellingborough has a new MP. The election was called after a recall petition ousted the former member Peter Bone, whose partner was chosen as the Conservative candidate. But what have we learned during the Northamptonshire constituency&#39;s by-election?"
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/green-reflections-on-the-budget-proposals-whats-in-there-for-climate-and-nature/",
        "title": "Green reflections on the budget proposals – what’s in there for climate and nature?",
        "description": "Convener of the Green group of Councillors in City of Edinburgh Council. He is the group spokesperson for Climate and Environment. Given the key role Greens played in last"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/council-urged-ditch-debt-collectors-28626985",
        "title": "Council urged to ditch debt collectors who add &#39;fear and stress&#39; over unpaid bills",
        "description": "Coun Jilly Julian, cabinet member for finance and resources at Stockport council, said: &quot;<b>Liberal Democrats</b> oppose council tax in principle because it is an unfair and regressive taxation model. But, along with business rates, it forms a significant part of ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/cw54wvw7x9yo?at_format=link&at_bbc_team=editorial&at_link_id=98CA78F0-CCF3-11EE-BB70-1B8C4B3AC5C4&at_ptr_name=twitter&at_link_origin=BBCWorld&at_campaign_type=owned&at_link_type=web_link",
        "title": "Lib Dem quits over &#39;offensive&#39; social media posts",
        "description": "Complaints were made after Joyce Onstad reshared a series of posts on X A woman who was expected to become the next <b>Liberal</b> <b>Democrat</b> parliamentary candidate for Southend West in Essex, was suspended from the party and later resigned over what she called ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/misery-sunak-tories-suffer-electoral-defeat-two-safe-seats-20290963/?ico=trending-post-strip_item_4",
        "title": "Here’s what the by-election results mean for the Tory and Labour parties",
        "description": "The <b>Liberal Democrats</b> overturned Dame Cheryl’s 16,223 majority to win the seat on a huge swing of 25.2 percentage points, with party leader Sir Ed Davey celebrating by using a yellow hammer to demolish a “blue wall” of model bricks. 2. North ..."
    },
    {
        "url": "https://uk.news.yahoo.com/map-shows-every-constituency-the-tories-have-lost-since-2019-144124258.html",
        "title": "Map shows every constituency the Tories have lost since 2019",
        "description": "In a by-election prompted by the resignation of Tory MP Owen Paterson after he breached House of Commons rules by engaging in paid lobbying, the <b>Liberal Democrats</b> achieved another stunning result: overturning a majority of 22,949 with an even bigger swing ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/alexei-navalny-death-russia-putin-prison-news-b2497388.html",
        "title": "Alexei Navalny death latest: Russia accused of hiding opposition leader’s body to ‘cover traces of murder’",
        "description": "This is proof of Putin’s brutality,’ says US president, as UK minister says it was murder, after activist dies at age 47 in Arctic prison"
    },
    {
        "url": "https://www.iheartradio.ca/610cktb/news/jagmeet-singh-urging-liberals-to-cover-contraceptives-for-all-canadians-1.21773060",
        "title": "Jagmeet Singh urging Liberals to cover contraceptives for all Canadians",
        "description": "New Democrat Leader Jagmeet Singh has reiterated his promise that the confidence-and-supply agreement with the Liberals could fall apart by March 1st."
    },
    {
        "url": "https://www.foxnews.com/media/bill-maher-cheers-dem-ny-special-election-successfully-flipped-immigration-issue-ran-right",
        "title": "Bill Maher cheers Dem in NY special election: &#39;Successfully flipped immigration issue,&#39; &#39;ran to the right&#39;",
        "description": "HBO host Bill Maher took a victory lap following the New York special election, insisting it&#39;s proof that Democrats have &quot;successfully flipped the immigration issue&quot; on Republicans."
    },
    {
        "url": "https://au.news.yahoo.com/former-german-spy-chief-founds-171220444.html",
        "title": "Former German spy chief founds new right-wing party",
        "description": "A former German spy chief who was sacked after being accused of averting his eyes to the threat posed by the far-right founded a new right-wing party on Saturday, holding an inaugural party congress on a boat near Germany&#39;s old capital Bonn."
    },
    {
        "url": "https://www.politico.com/news/2024/02/17/gas-export-fight-republican-democrat-arguments-00141077",
        "title": "Biden’s gas export pause scrambles the DC energy debate",
        "description": "Democrats praise the president&#39;s freeze on new natural gas exports as a victory for U.S. consumers. Republicans warn it will harm the fight against climate change."
    },
    {
        "url": "https://leaderpost.com/opinion/columnists/murray-mandryk-ottawa-follies-may-provide-the-distraction-moe-needs",
        "title": "Murray Mandryk: Ottawa follies may provide the distraction Moe needs",
        "description": "Well, it seems helpful to Scott Moe and the Sask. Party, who welcome such distractions. Murray Mandryk is the political columnist for the Regina Leader-Post and the Saskatoon StarPhoenix."
    },
    {
        "url": "https://www.thestar.com/opinion/star-columnists/is-it-time-for-the-liberals-and-ndp-to-break-up/article_4b297c5e-cc44-11ee-9209-03fda23172ed.html",
        "title": "Is it time for the Liberals and NDP to break up?",
        "description": "Within a matter of days, that deal will either collapse or carry on — depending on whether the two sides can come to some kind of agreement to bring pharmacare"
    },
    {
        "url": "https://news.err.ee/1609256253/there-are-still-several-turning-points-on-kallas-road-to-brussels",
        "title": "There are still several turning points on Kallas&#39; road to Brussels",
        "description": "Prime Minister Kaja Kallas (Reform) may leave for an EU leadership role, but a few hurdles remain. Most analysts who spoke to ERR said Kallas should run for the European Parliament to boost her ALDE nomination."
    },
    {
        "url": "https://www.castanet.net/edition/news-story-472865-4-.htm",
        "title": "Emergency contraceptives like morning-after pill must be covered by pharmacare: NDP",
        "description": "Every Canadian with a health card should be able to get free birth control and morning-after pills to ensure people have the right to do what they want with their body, federal New Democrat Leader Jagmeet Singh says."
    },
    {
        "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2861428/whites-are-psychopaths-claims-ucsf-dei-scholar/",
        "title": "‘Whites are psychopaths,’ DEI ‘scholar’ claims in lecture at UCSF",
        "description": "A so-called DEI scholar, Dante King, gave a speech at the University of California San Francisco, during which said that &quot;whites are psychopaths.&quot;"
    },
    {
        "url": "https://www.cbs58.com/news/to-sign-or-not-to-sign-evers-yet-to-act-after-republicans-pass-his-legislative-map-proposal",
        "title": "To sign or not to sign: Evers yet to act after Republicans pass his legislative map proposal",
        "description": "Three days after Wisconsin&#39;s Republican-controlled Legislature passed Democratic Gov. Tony Evers&#39; proposed new legislative maps over the objections of Democratic lawmakers, Evers ha"
    },
    {
        "url": "https://www.wsws.org/en/articles/2024/02/17/txql-f17.html",
        "title": "Rail Action Committee appeal to German railway workers: Stop the military transports! No weapons for the war in Ukraine and the genocide in Gaza!",
        "description": "The increase in such transports is the result of the insane pro-war policy of the coalition government of the Social Democrats (SPD), Greens and Liberal Democrats (FDP). We call on all workers to act against the transports."
    },
    {
        "url": "https://jacobin.com/2024/02/democrats-joe-biden-age-trump",
        "title": "<b>Democrats</b> Have Been Panicking Over Biden’s Age for Years",
        "description": "When you have lost Ezra Klein and James Carville, you’ve lost the <b>liberal</b> establishment. As Carville told Ezra Klein, for a column devoted to telling <b>Democrats</b> their urgent task was “convincing Biden that he should not run again,” a presidential ..."
    },
    {
        "url": "https://www.huffpost.com/entry/ezra-klein-joe-biden_n_65cf996be4b043f1c0ab07bc",
        "title": "Prominent NYT Columnist Tells Biden To Step Aside: ‘He Is Not Up For This’",
        "description": "You can listen to the episode and read a full transcript of it here. The possibility Klein lays out is one many loyalist <b>Democrat</b> voters possibly haven’t considered, and his influence shouldn’t be discounted; he has one of the most popular shows on ..."
    }
]