[
    {
        "url": "https://www.warringtonguardian.co.uk/news/24105065.parliamentary-debate-brianna-ghey-legacy-peace-mind-campaign/",
        "title": "Parliamentary debate over Brianna Ghey-legacy Peace in Mind campaign",
        "description": "THE legacy of Brianna Ghey in ensuring children are equipped in mindfulness is essential in an ‘unforgiving world full of trolls, hate"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/area-near-bristol-becoming-worse-9084349",
        "title": "Area near Bristol is &#39;becoming a worse place to live&#39; say residents",
        "description": "The council leader said the grim figures were because the public believe the “world as a whole is going downhill”"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/bus-running-villages-thornbury-school-9084300",
        "title": "Bus running from villages to Thornbury school saved until summer next year",
        "description": "A bus service running from villages north of Bristol to a high school in Thornbury has been saved until summer next year. But its future after then is unclear, leaving parents and pupils anxious about how they will get to school every day."
    },
    {
        "url": "https://www.itv.com/news/meridian/2024-02-07/thames-water-a-disaster-of-a-water-company-say-mps-after-sewage-spill",
        "title": "Thames Water described as a &#39;disaster of a water company&#39; by MPs over sewage spill",
        "description": "Oxford West and Abingdon MP Layla Moran described the company&#39;s &quot;shoddy performance&quot; after it dumped sewage over thousands of hours last year. | ITV News Meridian"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/post-offices",
        "title": "Post Offices",
        "description": "Christine led a debate in the House of Commons following threats to several Post Offices across the constituency."
    },
    {
        "url": "https://www.scotsman.com/education/universities-scotland-scottish-governments-international-education-blueprint-fails-to-address-risks-of-over-exposure-4509205",
        "title": "Universities Scotland: Scottish Government&#39;s international education blueprint fails to address risks of &#39;over exposure&#39;",
        "description": "&quot;This leaves Scottish higher education open to shocks in other parts of the world, whether that be economic, security or otherwise. The Scottish Government’s strategy is not only delayed, but doesn’t sufficiently recognise the risk faced by higher education as a result of over exposure."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/a-bus-to-the-gyle-centre",
        "title": "A Bus to the Gyle Centre",
        "description": "The promised new bus link between Cramond and the Gyle Centre, via Maybury Road, has come one step closer after several operators showed interest in running the service. Local Liberal Democrats have fought for years to get a new bus connection to the Gyle."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/neil-kinnock-labour-poll-lead-general-election-mandelson/",
        "title": "Lord Kinnock warns Starmer: 20-point lead ‘still not conclusive enough’ for election win",
        "description": "Former Labour leader says party is not going to lose national vote but argues ‘that’s not the same thing as winning’ with working majority"
    },
    {
        "url": "https://www.kentonline.co.uk/kent/news/cuts-have-consequences-warning-as-kent-police-asked-to-ma-301437/",
        "title": "Kent Police set to cut staff numbers as it is told to make £35m in savings",
        "description": "The county’s police force has been asked to find £35million worth of savings in the next five years with the prospect of job losses looming."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-tory-mps-stand-down-nickie-aiken-london-b1137675.html",
        "title": "Top Tory Nickie Aiken to quit her London seat at general election as Conservative exodus of MPs grows",
        "description": "Ms Aiken’s decision came as the Tory party is gripped by a battle for its future direction, lagging far behind Labour in the polls"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/07/british-countryside-racist-white-space-charities-claim/",
        "title": "British countryside is a ‘racist and colonial’ white space, wildlife charities claim",
        "description": "People from ethnic minorities face ‘structural, experiential and cultural’ barriers to accessing green spaces, report argues"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68227006",
        "title": "Pembrokeshire faces biggest ever Welsh council tax rise",
        "description": "A local authority has proposed the highest ever percentage rise seen in council tax in Wales. Pembrokeshire, which had historically kept council tax low in the county, has proposed rises between 16% and 21%. The council said it was facing the &quot;most challenging financial situation&quot; since its creation."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/nhs-england-dentists-victoria-atkins-government-people-b2491999.html",
        "title": "Dentists to get cash for new patients and ‘golden hellos’ under service plans",
        "description": "Dentists are to be offered cash to take on new patients and given £20,000 “golden hellos” to work in communities with a lack of NHS dental services under plans to boost dentistry across England. Around a million people who have not seen a dentist for two or more years are expected to benefit as officials offer a “new patient payment” of £15 to £50."
    },
    {
        "url": "https://www.scotsman.com/news/politics/poll-snp-lead-in-scotland-falls-as-labour-narrows-the-gap-4508856",
        "title": "Poll: SNP lead in Scotland falls as Labour narrows the gap",
        "description": "The poll shows the SNP remains the most trusted party across a range of issues. However, Labour has narrowed the gap on all four of the issues surveyed – managing the NHS, growing Scotland’s economy, managing education and schools, and tackling the cost-of-living crisis."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/liberal-democrat-candidate-leicester-seat-9083309",
        "title": "<b>Liberal</b> <b>Democrat</b> candidate for Leicester seat is revealed",
        "description": "An expert in international relations who has worked at both of Leicester’s universities has been unveiled as the Liberal Democrats’ candidate for Leicester South in the upcoming General Election, which is expected later this year."
    },
    {
        "url": "https://news.stv.tv/scotland/ipsos-poll-snp-lead-shrinks-as-labour-narrows-gap",
        "title": "SNP lead shrinks as Labour narrows gap - Ipsos/STV poll",
        "description": "New poll by Ipsos&#39; Scottish Political Monitor - run in partnership with STV News - finds SNP hold a seven point lead over Labour."
    },
    {
        "url": "https://www.brecon-radnor.co.uk/news/planning/planning-improvement-board-to-be-wound-down-later-this-year-664636",
        "title": "Planning Improvement Board to be wound down later this year",
        "description": "The work of an internal council board to improve planning performance in Powys will be wound down later this year, a senior councillor has said."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/cost-of-living/severn-trent-water-price-increase-9080368",
        "title": "Leicestershire’s &#39;disgraceful&#39; Severn Trent Water price increase branded &#39;slap in the face&#39; during cost of living crisis",
        "description": "The average household water and sewerage bill in England and Wales will rise by 6%, or about £27 to £473 a year, from April 1, the industry has confirmed. Water bills in Leicestershire are set to be hiked by over 6.5% by Severn Trent. It means residents in Leicestershire will be paying an extra £27 a year."
    },
    {
        "url": "https://www.lawgazette.co.uk/news/popular-conservatives-rees-mogg-attacks-lady-hale-and-calls-for-neutering-of-supreme-court/5118671.article",
        "title": "Popular Conservatives: Rees-Mogg attacks Lady Hale and calls for neutering of Supreme Court",
        "description": "Rees-Mogg’s comments coincided with the launch of the right-wing splinter group Popular Conservatism, fronted by former Prime Minister Liz Truss. In an article for the website Conservativehome, the MP for North Somerset demanded that the court’s powers be circumscribed so it is no longer the ‘final arbiter of the law’."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13055725/Campaigners-slam-Tory-MPs-ridiculous-advice-Brits-not-flush-loo-baths-use-washing-machines-heavy-rain-order-stop-sewage-spills.html",
        "title": "Campaigners slam Tory MP&#39;s &#39;ridiculous&#39; advice for Brits not to flush the loo, take baths or use washing machines during heavy rain in order to stop sewage spills",
        "description": "Flick Drummond, MP for Meon Valley, sparked the row after issuing guidance on water use in a leaflet to local residents in Hampshire."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68171524?at_medium=RSS&at_campaign=KARANGA",
        "title": "Will voters unhappy with the Conservatives be attracted to Reform?",
        "description": "The party says it targets Labour supporters, but it is the Tories who are most worried about Reform UK&#39;s polling."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/difficult-decisions-nearly-50-job-28582410",
        "title": "&#39;Difficult decisions&#39; as nearly 50 job roles cut by council with plan to save £1.25m",
        "description": "Redcar and Cleveland Council said staffing reviews would see vacancies unfilled, along with some voluntary redundancies and a very small number that were compulsory"
    },
    {
        "url": "https://www.thetimes.co.uk/article/post-office-scandal-alan-bates-ed-davey-rfzgxjgxk?ilc=timesradio:morefromthetimes",
        "title": "Post Office scandal: Ed Davey advised to meet Alan Bates for ‘good publicity’",
        "description": "Sir Ed Davey was advised as postal affairs minister in 2010 to meet Alan Bates for “presentational reasons” to avoid bad publicity. Davey, who is now the Liberal Democrat leader, initially declined to meet Bates after he raised concerns that the Post Office’s Horizon IT system had led to the wrongful conviction of sub-postmasters."
    },
    {
        "url": "https://www.ft.com/content/444e7854-97bd-414d-8a37-a686a585cac3",
        "title": "As Liz Truss pops up, talk turns to the next Tory leader",
        "description": "A successful coup against Rishi Sunak still looks unlikely, but the direction of the party could shift post-election as MPs’ fears change"
    },
    {
        "url": "https://www.libdemvoice.org/ed-davey-talks-to-today-about-the-horizon-scandal-74622.html",
        "title": "Ed Davey talks to Today about the Horizon scandal",
        "description": "Ed Davey was interviewed on the Today programme  this morning about his actions as postal affairs minister during the Horizon scandal. The BBC had obtained a briefing from civil servants to Ed in which he was advised to meet Alan Bates “for presentational reasons” and not to make any commitments to him."
    },
    {
        "url": "https://www.scottishlegal.com/articles/police-officer-numbers-plummet-to-record-low",
        "title": "Police officer numbers plummet to record low",
        "description": "The Scottish Liberal Democrats have urged the Scottish government to &quot;get serious&quot; over the funding challenges facing policing as new figures reveal that police officer numbers are now at their lowest level since the second quarter of 2008."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68222915",
        "title": "Ed Davey was advised to meet Post Office campaigner Alan Bates to avoid bad publicity",
        "description": "Sir Ed Davey was advised as postal minister in 2010 to meet Post Office campaigner Alan Bates to avoid bad publicity over the Horizon scandal, the BBC has discovered. Sir Ed, now Lib Dem leader, has faced questions in recent weeks over why he initially refused to do so."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/07/conservative-mp-warns-party-faces-oblivion-if-it-continues-right-wing-approach/",
        "title": "Conservative MP warns party faces ‘oblivion’ if it continues ‘right wing approach’",
        "description": "A Conservative MP has warned that his party “will move into oblivion” if it continues on a “right wing approach”.  Tobias Ellwood, a former minister and defence select committee chair, has suggested his party will move itself “out of British politics” if it heeds the advice of individuals like former PM Liz Truss,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "The Telegraph&#39;s polling tracker shows Labour holding onto a lead of around 20 points for the fifteenth week. The last time the Tories were ahead of the Opposition was late 2021. Sir John Curtice said that the Conservatives faced a “brutal problem” in the polls in that they had made little progress in months."
    }
]