[
    {
        "url": "https://www.echo-news.co.uk/news/24125987.southend-candidate-resigns-remarks-calls-anti-zionist/",
        "title": "Southend candidate resigns after remarks she calls &quot;anti-Zionist&quot;",
        "description": "THE LIBERAL Democrat’s parliamentary candidate for Southend West has resigned over what she called “anti-Zionist” after a social media"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-election losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24125467.lib-dem-amos-delighted-taunton-town-council-continues-services/",
        "title": "Lib Dem Amos ‘delighted’ as Taunton Town Council continues services",
        "description": "Taunton Deane MP Rebecca Pow, however, said the <b>Liberal Democrats</b> in Taunton “believe they can take the local people in Somerset for fools, and they are continuing to mislead them about who bears responsibility for their financial mess”. Gideon Amos ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cw54wvw7x9yo",
        "title": "Lib Dem quits over &#39;offensive&#39; social media posts",
        "description": "On 14 February she took to X to confirm her resignation from the Liberal Democrat Party. She wrote: “Certain people in the party have taken great offence at the vehemence and ferocity of my stance in the fight to end the genocide in Palestine and have conflated my anti-Zionist position with antisemitism, which is clearly absurd.”"
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/edinburgh-lib-dems-back-125m-28649604",
        "title": "Edinburgh Lib Dems back £12.5m for road repairs ahead of &#39;stressful&#39; budget",
        "description": "An additional £12.5m investment in roads, pavements and footpaths would be met through borrowing and dipping into the council&#39;s reserve funds"
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24125519.oxford-labour-councillors-accuse-lib-dems-total-hypocrisy/",
        "title": "Oxford Labour councillors accuse Lib Dems of total hypocrisy",
        "description": "Oxford Labour councillors have accused the Liberal Democrats of &quot;total hypocrisy&quot; over consultation on traffic measures."
    },
    {
        "url": "https://uk.news.yahoo.com/prominent-nyt-columnist-tells-biden-215430209.html",
        "title": "Prominent NYT Columnist Tells Biden To Step Aside: ‘He Is Not Up For This’",
        "description": "Ezra Klein, a prominent liberal columnist for The New York Times, published an audio essay Friday making his case against President Joe Biden for the Democratic nomination, saying he should withdraw from the race and allow delegates to pick from a slate of candidates with a better shot at defeating Donald Trump in November."
    },
    {
        "url": "https://uk.news.yahoo.com/allegations-total-hypocrisy-over-traffic-173000381.html",
        "title": "Allegations of &#39;total hypocrisy&#39; over traffic measures",
        "description": "<b>Liberal</b> <b>Democrat</b> flyers were circulated in the Headington Ward in Oxford during December last year where residents were asked whether they would be in favour of &quot;tackling cut-throughs if local residents could still drive any direction, but non-residents ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/liberal-democrats-by-elections-lose-deposits-wellingborough/",
        "title": "<b>Liberal Democrats</b> lose their deposits in both by-elections",
        "description": "Party’s share of vote plummets on 2019 election result as it receives less than five per cent of votes cast and forfeits the £500 payment"
    },
    {
        "url": "https://www.markpack.org.uk/172548/lib-dem-gain-from-labour-in-hull-by-election/",
        "title": "Lib Dem gain from Labour in Hull by-election",
        "description": "As well as the two Parliamentary by-elections, we had five principal authority council by-elections too. Four out of five had Lib Dems."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/24118213.lib-dem-candidate-mayor-london-rob-blackie/",
        "title": "Who is Lib Dem candidate for Mayor of London Rob Blackie?",
        "description": "The position is currently held by Labour&#39;s Sadiq Khan, who is hoping to win a historic third term in the role. However, Khan faces competition including the likes of Liberal Democrat candidate Rob Blackie. Rob was announced as the candidate for the Lib Dems back in August 2023, but who is he and what are his policies?"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/mcarthur-backs-primary-school-competition-to-improve-kids-communication-skills",
        "title": "McArthur backs primary school competition to improve kids’ communication skills",
        "description": "Orkney’s MSP Liam McArthur is supporting VoiceBox, a Scotland-wide joke telling competition designed by the Royal College of Speech and Language Therapists to improve communication skills."
    },
    {
        "url": "https://uk.news.yahoo.com/sadiq-khans-rivals-urge-mayor-161211917.html",
        "title": "Sadiq Khan&#39;s rivals urge mayor to do more to promote little-known Tube discount",
        "description": "The young, disabled and armed forces are all entitled to cheaper travel ‘but many of them do not know it’, the mayor has been warned"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/wellingborough-kingswood-byelection-results-reaction-labour-tories-starmer-sunak-b1139519.html",
        "title": "London politics latest LIVE: Rishi Sunak breaks cover as Tories reel from double by-election hammer blow",
        "description": "Rishi Sunak said by-elections had taken place in “particularly challenging circumstances” after Labour claimed double victories over the Tories in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68313421",
        "title": "Wellingborough and Kingswood by-elections: Job not done despite huge wins, says Starmer",
        "description": "The party came third in both by-elections, picking up 13% of the vote in Wellingborough and 10.4% in Kingswood. Labour secured a majority of 2,501 over Tory candidate Sam Bromiley in the South Gloucestershire seat of Kingswood, near Bristol."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/putin-must-be-held-accountable-for-navalny-s-death-uk-foreign-secretary-says-110693/",
        "title": "Putin must be held accountable for Navalny’s death, UK Foreign Secretary says",
        "description": "Russian President Vladimir Putin must be held accountable for the death of jailed opposition leader Alexei Navalny, the UK Foreign Secretary has said. Lord David Cameron said there should be “consequences” for the Moscow leader after the country’s prison agency said the 47-year-old politician and anti-corruption campaigner had died."
    }
]