[
    {
        "url": "https://www.standard.co.uk/news/politics/mike-freer-mps-finchley-conor-burns-golders-green-b1136232.html",
        "title": "Tory minister to step down at election as threats to personal safety ‘too much’",
        "description": "A Government minister has said he will stand down at the next general election after a series of death threats and an arson attack on his constituency office. Conservative justice minister Mike Freer said that “by the skin of my teeth I avoided being murdered” by Ali Harbi Ali, who went on to kill Southend West MP Sir David Amess."
    },
    {
        "url": "https://www.libdemvoice.org/four-ways-you-can-help-liberal-democrat-voice-3-74607.html",
        "title": "Four ways you can help <b>Liberal</b> <b>Democrat</b> Voice",
        "description": "The Voice is only a success because of the interest and support from our readers. For many people just lurking and reading the site is all they want to do - and that&#39;s fine, we&#39;re grateful for people taking the time to read the site."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/5-liverpool-taxi-charge-scrapped-28547798",
        "title": "£5 Liverpool taxi charge scrapped as &#39;hefty&#39; fare rise goes ahead",
        "description": "The current rise was described as something that &quot;works for the public and gives taxi drivers an earning they deserve.&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/councils-face-devastating-service-cuts-32013696",
        "title": "Councils face devastating service cuts as £5.8billion Tory black hole revealed",
        "description": "The <b>Liberal Democrats</b> are calling for Local Authorities to have more powers and funding to deliver for their communities and to reform business rates to boost local economies. Ed Davey, the party’s leader, said: “Youth services are being torn away from ..."
    },
    {
        "url": "https://inews.co.uk/news/world/donald-trump-taylor-swift-holy-war-2882104?ico=related_stories",
        "title": "Donald Trump vs Taylor Swift: Ex-president’s allies plot ‘holy war’ on pop icon",
        "description": "The most unlikely battle of the upcoming US Presidential election, and a potentially pivotal one, is shaping up as Donald Trump locks horns with Taylor Swift, the world’s biggest pop star. Members of Trump’s inner circle have already assigned Swift a prominent position on his list of most significant foes."
    },
    {
        "url": "https://uk.news.yahoo.com/not-let-reading-fc-die-163000791.html",
        "title": "We will not let Reading FC die - push for &#39;unmitigated disaster&#39; owner to sell",
        "description": "The owner of Reading FC has been blasted for presiding over an unmitigated disaster as concern and indignation has been expressed by local leaders."
    }
]