[
    {
        "url": "https://www.libdems.org.uk/press/release/revealed-15-million-patients-waited-12-hours-or-more-in-ae-in-past-year",
        "title": "Revealed: 1.5 million patients waited 12 hours or more in A&amp;E in past year",
        "description": "A staggering 1.5 million patients in England waited 12 hours or more after arriving at A&amp;E over the past year, new analysis by the Liberal Democrats has revealed."
    },
    {
        "url": "https://www.lbc.co.uk/news/water-bosses-bonus-block-sewage-spills/",
        "title": "Water company bosses face bonus ban over illegal sewage spills which taint British beaches and rivers",
        "description": "The new rules will come into affect from April at the start of the new financial year. The policy follows campaigning from Labour and the <b>Liberal Democrats</b> who have been calling for this change for months on end. In the last four years, bosses of water ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nhs-crisis-sees-more-15million-32100160",
        "title": "NHS crisis sees more than 1.5million people wait for 12 hours in A&amp;E in a year",
        "description": "Hospital chiefs warned that ministers urgently need to draw up a plan to fix the over-stretched health service as figures showed that one in 10 patients waited for 12 hours in A&amp;E"
    },
    {
        "url": "https://news.sky.com/story/water-bosses-to-face-ban-on-bonuses-but-move-too-weak-and-feeble-say-liberal-democrats-13069794",
        "title": "Water bosses to face ban on bonuses - but move &#39;too weak and feeble&#39;, say <b>Liberal Democrats</b>",
        "description": "There has been outrage around illegal sewage dumping and calls by Labour and the Liberal Democrats to enforce the policy sooner, as water firms in England plan to hike customers&#39; bills by an extra £156 a year to invest in Britain&#39;s Victorian infrastructure."
    },
    {
        "url": "https://inews.co.uk/news/government-set-to-block-bonuses-for-chiefs-of-water-firms-which-pollute-rivers-2901447?ico=related_article_inline",
        "title": "Government set to block bonuses for chiefs of water firms which pollute rivers",
        "description": "Environment Secretary Steve Barclay is set to block bonuses for bosses of UK water firms which are illegally polluting rivers, lakes and seas. The crackdown will start with bonuses paid out in the 2024-25 financial year from April."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071823/Netherlands-prime-minister-dries-van-agt-wife-death-euthanasia.html",
        "title": "Former Netherlands Prime Minister Dries van Agt and his wife both die &#39;hand in hand&#39; by euthanasia after years of poor health",
        "description": "Euthanasia has been legal in The Netherlands in 2002 for those experiencing &#39;unbearable suffering with no prospect of improvement.&#39;"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68257375",
        "title": "Wellingborough: Calls for action on gangs at by-election debate",
        "description": "Calls for more visible policing and new initiatives to draw young people away from gangs have been heard in a BBC East Wellingborough by-election discussion. The town, facing a by-election on Thursday, is still haunted by the death of teenager Dylan Holliday, who was stabbed 13 times."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071817/Bonus-blockage-water-firm-bosses-companies-illegally-spill-sewage-disgust-26million-rewards-handed-past-four-years.html",
        "title": "Bonus blockage on water firm bosses whose companies illegally spill sewage after disgust over the £26million of rewards handed out over the past four years",
        "description": "The environment secretary, Steve Barclay, is to block payouts to executives of firms that are polluting rivers, lakes and seas, starting with bonuses in the 2024-25 financial year from April."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/bonus-ban-for-water-company-bosses-still-too-weak-and-feeble",
        "title": "Bonus ban for water company bosses still too weak and feeble",
        "description": "The Liberal Democrats have been calling for almost two years for bonuses for water firm bosses to he banned until sewage spills are stopped."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/11/polluting-water-company-chiefs-bonuses-to-be-blocked/",
        "title": "Polluting water company chiefs’ bonuses to be blocked",
        "description": "Environment Secretary Steve Barclay will ban bosses of water firms that commit criminal acts of water pollution from pocketing payouts."
    },
    {
        "url": "https://www.markpack.org.uk/172525/another-88-liberal-democrat-ppcs/",
        "title": "Another 88 <b>Liberal</b> <b>Democrat</b> PPCs",
        "description": "Another big batch of new Liberal Democrat Prospective Parliamentary Candidates to welcome and wish good luck to: 88 this time."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-environment-secretary-ofwat-tim-farron-liberal-democrats-b1138482.html",
        "title": "Polluting water company chiefs’ bonuses to be blocked",
        "description": "Environment Secretary Steve Barclay will ban bosses of water firms that commit criminal acts of water pollution from pocketing payouts."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/11/michael-gove-says-no-fault-evictions-will-be-banned-this-year",
        "title": "Michael Gove says no-fault evictions will be banned this year",
        "description": "UK housing minister promises section 21 evictions in England will have ended by time of general election"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1865575/water-sewage-pollution-scandal-bonus-ban",
        "title": "‘Insulting’ fat cat bonuses at polluting water firms could be banned after sewage scandal",
        "description": "Controversial incentives for bosses of polluting water firms could be blocked, says Environment Secretary Steve Barclay."
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/11/water-bosses-face-bonus-bans-if-their-companies-discharge-sewage-illegally",
        "title": "Water bosses face bonus bans if their companies discharge sewage illegally",
        "description": "Senior executives took £26m in bonuses and other benefits in past four years despite 140,000 sewage overflows a year"
    },
    {
        "url": "https://www.thetimes.co.uk/article/clean-it-up-campaign-one-year-anniversary-935scqps2",
        "title": "Clean It Up campaign one year on: what progress has been made?",
        "description": "As we reach the first anniversary of our fight to tackle water pollution, we review any steps that have been taken to overhaul the damage done to UK waterways"
    },
    {
        "url": "https://www.thetimes.co.uk/article/water-firms-pollution-boss-bonuses-clean-it-up-campaign-3sm8gcf3x",
        "title": "Bosses of polluting water firms face ban on bonuses",
        "description": "The bosses of water firms that commit criminal acts of water pollution will be banned from receiving bonuses as part of efforts to clean up the nation’s waterways. In a victory for the Times Clean It Up campaign,"
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68267712?at_campaign=KARANGA&at_medium=RSS",
        "title": "Ex-minister: I wish I asked more questions about Post Office",
        "description": "Labour&#39;s Pat McFadden has said he wishes he had asked more questions about the Post Office when he was a minister after the IT scandal emerged. Mr McFadden was the minister in charge of postal affairs from 2007 for around three years. The shadow minister recently claimed he could not recall the scandal being raised with him during that time."
    },
    {
        "url": "https://inews.co.uk/news/politics/covid-education-poorest-pupils-axed-jeremy-hunt-2899389?ITO=msn",
        "title": "Covid education catch up for poorest pupils set to be axed by Jeremy Hunt",
        "description": "Sir Kevan Collins was forced to resign from his role as the government’s school catch up tsar after his recommendations for a £15bn fund to help children’s education after the Covid crisis was whittled down to just £1.4bn."
    },
    {
        "url": "https://edition.cnn.com/2024/02/11/politics/new-york-democrats-special-election-3rd-district/index.html",
        "title": "New York <b>Democrats</b> are worried about Tuesday’s special election. They have good reason to be",
        "description": "How bad were the 2022 midterm elections for Democrats in New York? One way to explain it: Republican George Santos’ victory in the state’s 3rd Congressional District might have been the highlight of their year."
    },
    {
        "url": "https://www.huffpost.com/entry/democrats-dreamers-shift-right-immigration_n_65c804bae4b0fb721d6153e6",
        "title": "<b>Democrats</b> Insist They Won’t Forget DREAMers As They Shift Right On Immigration",
        "description": "Senate Democrats insisted that they weren’t leaving Dreamers or other undocumented immigrants behind, and that, if anything, this year’s negotiations would allow them to build on their progress since they can now point to the GOP’s refusal to accept the deal as evidence of their hypocrisy on the issue."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071135/joe-biden-new-york-times-warning.html",
        "title": "The week Biden lost the New York Times: <b>Liberal</b> paper&#39;s Editorial Board unleashes astonishing broadside warning of &#39;a dark moment&#39; as it runs back-to-back opinion pieces ...",
        "description": "Anxieties from the liberal NYT editorial board and opinion writers show how worried they are that ailing Biden may not be able to beat &#39;bad man&#39; Donald Trump this year."
    },
    {
        "url": "https://www.dailypost.co.uk/news/uk-world-news/anglesey-mi6-spy-bag-theories-28608377",
        "title": "Anglesey MI6 &#39;spy in the bag&#39; theories from a Russian mafia hit to his private life",
        "description": "Anglesey-born Williams, who was a child prodigy in mathematics, was employed by GCHQ, the UK&#39;s eavesdropping agency based at Cheltenham where he deciphered messages left on mobile phones and emails, before being seconded to MI6 for three years."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/michael-gove-government-reform-jeremy-hunt-tories-b2494304.html",
        "title": "Michael Gove promises end to no-fault evictions by next general election",
        "description": "There have been continuous delays to the plan to ban section 21 evictions, first promised by the Tories in 2019."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/housing-secretary-no-fault-evictions-general-election-b2494302.html",
        "title": "Michael Gove pledges to end no-fault evictions before general election",
        "description": "The renters reform bill has been delayed multiple times due to opposition in and outside of the Conservative party"
    }
]