[
    {
        "url": "https://uk.movies.yahoo.com/matt-schlapp-boasts-banning-liberal-223028004.html",
        "title": "Matt Schlapp Boasts About Banning <b>Liberal</b> Media From Now-Irrelevant CPAC",
        "description": "Anna Moneymaker/GettyAmerican Conservative Union chairman Matt Schlapp boasted on Wednesday that he has implemented a “new rule” banning liberal media outlets from covering this week’s Conservative Political Action Conference."
    },
    {
        "url": "https://www.libdemvoice.org/ed-on-tonights-drama-in-parliament-we-need-an-urgent-end-to-the-humanitarian-catastrophe-74704.html",
        "title": "Ed on tonight’s drama in Parliament: We need an urgent end to the humanitarian catastrophe",
        "description": "So I managed to sleep thoughout tonight’s drama. Waking up to a phone glowing with WhatsApp messages, I realised there had been a bit of a rammy in the Commons. I checked out the BBC summary and my immediate and instinctive reaction is that the Speaker had been right to allow votes on three"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110955/jeremy-hunt-plans-inheritance-tax-spring-budget-tight-public-finances.html",
        "title": "Jeremy Hunt shelves plans to cut inheritance tax again ahead of his Spring Budget due to tight public finances",
        "description": "In a blow to Tory MPs campaigning on the issue, the Chancellor has concluded tight public finances leave him unable to make meaningful changes to the tax."
    },
    {
        "url": "https://inews.co.uk/opinion/infantile-mps-political-games-gaza-burns-2917672?ico=more_from_this_author",
        "title": "As our infantile MPs play political games, Gaza burns",
        "description": "But it wasn’t to be. Speaker Lindsay Hoyle took the unusual decision to allow both and spare Starmer’s blushes. The <b>Liberal Democrats</b> also felt the need to get involved, putting forward an amendment demanding an “immediate bilateral ceasefire”."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68354552",
        "title": "Kettering Lib Dem candidate steps down over stammer abuse",
        "description": "Mr Nelson was first selected as the Lib Dem candidate for Kettering in 2010. He later ran again in the 2019 election, both times finishing in the top three candidates, reported the Local Democracy Reporting Service. He said the &quot;final straw&quot; had come in August when a politician mocked his stammer in the street."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24134363.government-promises-publish-delayed-reports-border-watchdog-sacked/",
        "title": "Government promises to publish delayed reports after border watchdog sacked",
        "description": "The Government has promised to publish the 15 reports prepared by the sacked borders and immigration watchdog, but did not set a deadline for doing so. David Neal was fired on Tuesday after he “breached” the terms of his appointment and “lost the confidence of the Home Secretary”."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24135620.oxfordshire-county-council-sets-budget-10-hour-debate/",
        "title": "Oxfordshire County Council budget slammed as &#39;nasty mess&#39;",
        "description": "Oxfordshire <b>Liberal</b> <b>Democrat</b> and Green Alliance councillors sided with the Labour party amendment over the Conservative one. Passage of the budget saw a 4.99 per cent council tax rise which is the maximum increase allowed. READ MORE: New homes planned ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24122425.letter---lib-dems-forgotten-labour-win-1945/",
        "title": "Letter - Have the Lib Dems forgotten the Labour win in 1945?",
        "description": "Give them their due, the Lib Dems are very good at delivering newsletters throughout the town. However, there is a fault in the latest letter for"
    },
    {
        "url": "https://www.burnleyexpress.net/news/politics/former-burnley-mp-gordon-birtwistle-to-stand-for-liberal-democrats-again-in-general-election-4527949",
        "title": "Former Burnley MP Gordon Birtwistle to stand for <b>Liberal Democrats</b> again in general election",
        "description": "He has been selected again by the <b>Liberal Democrats</b> to stand in the next general election, believed to be later this year. Did you know with an ad-lite subscription to Burnley Express, you get 70% fewer ads while viewing the news that matters to you."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liberal-democrats-call-extra-1bn-28673617",
        "title": "<b>Liberal Democrats</b> call for extra £1bn for farming budget in bid to win rural votes",
        "description": "An extra £1 billion should be injected into the farming budget, the Liberal Democrats have said as they seek to win over rural voters ahead of this year&#39;s general election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tim-farron-lib-dems-liberal-democrats-government-british-b1140445.html",
        "title": "Lib Dems call for extra £1bn for farming budget in bid to win rural votes",
        "description": "An extra £1 billion should be injected into the farming budget, the <b>Liberal Democrats</b> have said as they seek to win over rural voters ahead of this year’s general election. The party is also calling for “arbitrary” visa salary thresholds to be ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/home-secretary-government-home-office-james-cleverly-alistair-carmichael-b1140604.html",
        "title": "Government promises to publish delayed reports after border watchdog sacked",
        "description": "The Government has promised to publish the 15 reports prepared by the sacked borders and immigration watchdog, but did not set a deadline for doing so. David Neal was fired on Tuesday after he “breached” the terms of his appointment and “lost the confidence of the Home Secretary”."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24132945.durham-council-rules-judicial-review-levelling-fund/",
        "title": "Durham Council rules out judicial review into Levelling Up Fund",
        "description": "Durham County Council has ruled out pursuing a judicial review into the government’s Levelling Up Fund despite losing £1.2m"
    },
    {
        "url": "https://www.cambridgeindependent.co.uk/news/south-cambridgeshire-district-council-plans-to-continue-four-9354001/",
        "title": "South Cambridgeshire District Council plans to continue four-day week trial despite funding threats",
        "description": "South Cambridgeshire District Council is proposing to continue its four-day week trial despite government funding threats. The government has said it is considering using “levers” in its funding settlement for the coming financial year to “disincentive the four-day working week”."
    },
    {
        "url": "https://eveshamobserver.co.uk/news/lib-dem-leaders-hit-out-as-eveshams-development-plan-delayed-further/",
        "title": "Lib Dem leaders hit out as Evesham&#39;s development plan delayed further",
        "description": "Leaders of the Liberal Democrat groups across Worcester, Malvern and Wychavon are calling for answers as the South Worcestershire Development Plan (SWDP) has been postponed again."
    },
    {
        "url": "https://www.leighjournal.co.uk/news/24133746.turkeys-voting-christmas-jibe-help-turn-leigh-tory/",
        "title": "Did the ‘turkeys voting for Christmas’ jibe help turn Leigh tory?",
        "description": "Some say the electorate in the old mining town was goaded into voting Tory by comments from leading politicians who argued that voting for Boris Johnson’s party in a town like Leigh would be ‘like turkeys voting for Christmas’."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13108261/Ex-Post-Office-chair-reveals-bombshell-memo-meet-mandarin-told-delay-compensation-postmasters-Government-hobble-election.html",
        "title": "Ex-Post Office chair reveals bombshell memo of meeting where top mandarin &#39;told him to delay compensation for postmasters so Government could &#39;hobble&#39; into election&#39;",
        "description": "Henry Staunton, who was Post Office chairman between December 2022 and last month, revealed how he was told not to &#39;rip off the band aid&#39; in terms of finances by a top civil servant."
    },
    {
        "url": "https://www.bbc.com/news/articles/cx7ll6xd9q1o",
        "title": "Council rules out levelling up judicial review",
        "description": "A council has ruled out pursuing a judicial review into the government’s Levelling Up Fund after spending £1.2m on failed bids. Durham County Council had previously agreed to consider challenging the funding process, but has since said any legal challenge would be too costly."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/post-office-horizon-kemi-badenoch-staunton-b2499705.html",
        "title": "Ex-Post Office chairman was told not to ‘rip off the band aid’ with compensation payments",
        "description": "Ex-Post Office chairman Henry Staunton unearthed a memo in which he recorded being told to ‘hobble’ into the election and not ‘rip off the bandaid’ with compensation payments"
    },
    {
        "url": "https://www.hambletontoday.co.uk/move-to-limit-council-tax-increase-rejected/",
        "title": "Move to limit council tax increase rejected",
        "description": "Elected community representatives have rejected a move to avert average council tax bills across North Yorkshire rising by more than £100 for the coming year. A majority of North Yorkshire councillors rejected a proposal by"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/household-bills-rise-further-april-9115169",
        "title": "Household bills to rise further from April as Shire Hall approves 5% tax hike",
        "description": "The amount people in band D properties pays for Gloucestershire County Council services will rise by £76.04 to £1,599.82"
    },
    {
        "url": "https://inews.co.uk/opinion/infantile-mps-political-games-gaza-burns-2917672",
        "title": "As our infantile MPs play political games, Gaza burns",
        "description": "Parties are tearing each other apart over ceasefire statements whose distinction not even a theologian could explain"
    },
    {
        "url": "https://southwarknews.co.uk/area/southwark/southwark-liberal-democrats-unveil-budget-claiming-to-reverse-2-million-cuts-to-adult-social-care/",
        "title": "Southwark <b>Liberal Democrats</b> unveil budget claiming to reverse £2 million cuts to adult social care",
        "description": "Southwark Liberal Democrats have unveiled a shadow budget they say avoids £2 million worth of cuts to adult social care proposed by the Labour council.  Councillors will vote on the 2024/2025 budget tonight (February 21) which includes significant savings to adult social care,"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/21/ex-post-office-chair-henry-staunton-told-dont-rip-off-band-aid-election-run-up-memo-shows",
        "title": "Sunak refuses to repeat Badenoch claim that ex-Post Office chair lied",
        "description": "Top civil servant told Henry Staunton there was no appetite to ‘rip off band aid’, according to sacked chairman’s note of conversation"
    },
    {
        "url": "https://inews.co.uk/news/politics/the-gaza-vote-danger-for-keir-starmer-explained-2917739?ITO=msn",
        "title": "How Gaza vote brings danger for Keir Starmer",
        "description": "The SNP motion states the House “calls for an immediate ceasefire in Gaza and Israel”. It goes on to set out concerns about the death toll in the region and “condemns any military assault on what is now the largest refugee camp in the world”."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/row-de-selected-ex-conservative-9113694",
        "title": "Row as de-selected ex-Conservative mayor joins the <b>Liberal Democrats</b>",
        "description": "A row has erupted at Gloucester City Council after a councillor was deselected by the Conservatives and joined the Liberal Democrats. Councillor Collette Finnegan, who represents Abbeydale, claims she resigned after becoming disillusioned with the Tories."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/politics/former-kettering-general-election-hopeful-hits-out-at-intolerable-abuse-about-his-stammer-4527938",
        "title": "Former Kettering general election hopeful hits out at &#39;intolerable&#39; abuse about his stammer",
        "description": "Chris Nelson was the <b>Liberal Democrats</b>’ choice in his home town when the nation went to the polls in 2010 and in 2019, coming third both times. But he will not be on the ballot paper at the next election, widely expected to be later this year ..."
    },
    {
        "url": "https://www.cravenherald.co.uk/news/24134896.move-limit-council-tax-increase-rejected/",
        "title": "Move to limit council tax increase is rejected",
        "description": "A majority of North Yorkshire councillors today (Wednesday) rejected a proposal by the <b>Liberal</b> <b>Democrat</b> group to limit the council tax increase from April to 3.99 per cent after hearing both the Conservative administration and opposition leaders state ..."
    },
    {
        "url": "https://www.gazetteherald.co.uk/news/24134845.north-yorkshire-move-limit-council-tax-increase-rejected/",
        "title": "NORTH YORKSHIRE: Move to limit council tax increase rejected",
        "description": "Elected community representatives have rejected a move to avert average council tax bills across North Yorkshire rising by more than £100 for"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/matt-schlapp-boasts-banning-liberal-223028004.html",
        "title": "Matt Schlapp Boasts About Banning <b>Liberal</b> Media From Now-Irrelevant CPAC",
        "description": "Anna Moneymaker/GettyAmerican Conservative Union chairman Matt Schlapp boasted on Wednesday that he has implemented a “new rule” banning liberal media outlets from covering this week’s Conservative Political Action Conference."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/21/politics-rishi-sunak-keir-starmer-tories-labour",
        "title": "‘Get the Tories out’ will carry the election, but it won’t fix the faultlines of a broken politics",
        "description": "The duopoly at the centre of our electoral system promises stability, yet delivers anything but. Labour must be ready for that, says Guardian columnist Rafael Behr"
    },
    {
        "url": "https://uk.news.yahoo.com/nasty-mess-criticism-county-council-190000532.html",
        "title": "&#39;A nasty mess&#39;: Criticism of county council as budget set",
        "description": "Oxfordshire <b>Liberal</b> <b>Democrat</b> and Green Alliance councillors sided with the Labour party amendment over the Conservative one. Passage of the budget saw a 4.99 per cent council tax rise which is the maximum increase allowed. READ MORE: New homes planned for ..."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/local-news/no-cliff-edge-charities-bath-9114901",
        "title": "‘No cliff edge’ for charities as Bath and North East Somerset Council agrees budget",
        "description": "Local charities will not face a “cliff edge,” councillors on Bath and North East Somerset Council have insisted as they passed a budget that spread proposed cuts to charities over two years."
    },
    {
        "url": "https://www.brixtonbuzz.com/2024/02/lambeth-council-are-attacking-key-workers-with-parking-permit-price-rises-say-the-lib-dems/",
        "title": "Lambeth Council are ‘attacking key workers with parking permit price rises,’ say the Lib Dems",
        "description": "Cllr Donna Harris, Leader of Lambeth Liberal Democrats, is claiming that teachers, doctors, and small businesses are being threatened with astronomical permit  price hikes to allow them to park at"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/local-news/call-more-flood-prevention-bus-9115090",
        "title": "Call for more flood prevention and bus cash in Leicestershire budget voted down",
        "description": "The <b>Liberal</b> <b>Democrat</b> opposition on the Conservative-run council put forward the suggested changes at today’s budget meeting. The Lib Dems said their proposals were “fully costed”. The group’s amendment asked the council to scrap its magazine called ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/suspended-lib-dem-denies-claims-28668642",
        "title": "Suspended Lib Dem denies claims he was campaigning for George Galloway in Rochdale",
        "description": "A <b>Liberal</b> <b>Democrat</b> spokesperson said: &quot;He has been suspended from the party and was never an approved council candidate.&quot; The Rochdale by-election was triggered by the death of Sir Tony Lloyd last month. Last week, Labour withdrew support for its candidate ..."
    },
    {
        "url": "https://southwarknews.co.uk/area/southwark/at-a-time-of-budget-cuts-and-struggling-services-labour-decide-southwark-needs-a-150k-spin-doctor-say-lib-dem-opposition/",
        "title": "Column: ‘At a time of budget cuts and struggling services, Labour decide Southwark needs a £150k Spin-doctor’ – says Lib Dem opposition leader",
        "description": "The Southwark <b>Liberal Democrats</b> will be proposing an alternative budget that puts people first. A budget that protects the services that people rely on by slashing needless political spending and implementing ambitious income generating policies."
    }
]