[
    {
        "url": "https://www.ctvnews.ca/mobile/politics/trudeau-and-singh-s-teams-quietly-planning-electoral-reform-legislation-1.6744379?clipId=104056",
        "title": "Trudeau and Singh&#39;s teams quietly planning electoral reform legislation",
        "description": "As progress on some measures in the <b>Liberal</b>-NDP confidence-and-supply agreement continue ... Specifically, the Liberals and New <b>Democrats</b> agreed to explore: Allowing an &quot;expanded&quot; three-day voting period during general elections; Allowing voters to cast ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-defence-secretary-to-face-questions-as-uk-sends-military-assets-to-the-middle-east-12593360?postid=6589138.",
        "title": "Politics latest: More names of plotters trying to oust Rishi Sunak expected to be revealed; Reform UK surges in polls",
        "description": "There is no clear alternative to lead the Conservative Party if Rishi Sunak were to be ousted, new polling has suggested. Questions about the prime minister&#39;s future have been raised by the calls for him to go from Sir Simon Clarke, and the defection of ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-inquiry-money-sunak-coup-2876275",
        "title": "Tory HQ probe into money behind Sunak coup amid Reform donor concerns",
        "description": "Conservatives will strip the whip from those working with mysterious group - including Lord Frost - if they have accepted funds from Reform donors"
    },
    {
        "url": "https://news.stv.tv/scotland/storm-clean-up-emergency-funding-leaves-councils-in-the-cold-say-scottish-liberal-democrats",
        "title": "Storm clean-up emergency funding leaves councils ‘in the cold’",
        "description": "Funding scheme to help councils deal with the aftermath of storms and flooding has paid out less than £10m in last 14 years."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24070115.mp-column-rwanda-bill-designed-act-deterrent/",
        "title": "MP COLUMN: Rwanda Bill designed to act as a deterrent",
        "description": "The UK-Rwanda Partnership was first signed back in April 2022 and has since faced opposition at every hurdle from Labour, the <b>Liberal Democrats</b>, the SNP, and other parties all intent on thwarting any of our proposals to stop illegal migration. People ..."
    },
    {
        "url": "https://www.watfordobserver.co.uk/news/24078767.hertsmere-council-tax-refund-scheme-branded-con/",
        "title": "Hertsmere: Council tax refund scheme branded ‘con’",
        "description": "After just 4.1 per cent of taxpayers applied for a Hertsmere rates refund, almost a quarter of a million pounds will go to charity."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-essex-68092898?at_bbc_team=editorial&at_link_type=web_link&at_link_origin=BBCEssex&at_medium=social&at_ptr_name=twitter&at_campaign_type=owned&at_format=link&at_link_id=5A6D4BDA-BCDD-11EE-8452-9B59D0B4AF07&at_campaign=Social_Flow",
        "title": "Essex online prankster Simon Harris kept £367k from council contracts",
        "description": "An internet prankster kept about £367,000 in public funds paid to him to run Facebook groups and carry out other work during the Covid-19 pandemic, it has emerged. Essex County Council said the money was given to Simon Harris for &quot;expediency&quot; as it sought to reach out to residents."
    },
    {
        "url": "https://thestrayferret.co.uk/editors-pick-of-the-week-keane-duncans-campervan-caper-and-football-mayhem-in-starbeck/",
        "title": "Editor’s Pick of the Week: Keane Duncan’s campervan caper and football mayhem in Starbeck",
        "description": "Mr Duncan’s bid took a slightly farcical turn this week when he announced he would spend the final 100 days of the campaign trail living in a campervan “surviving on army-style ration packs and sleeping in the wilderness”. Keith Tordoff, an independent candidate from Pateley Bridge, delivered a withering response."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-inquiry-money-sunak-coup-2876275?ITO=msn",
        "title": "Tory inquiry into money behind Sunak coup bid amid Reform donor concerns",
        "description": "Conservatives will strip the whip from those working with mysterious group - including Lord Frost - if they have accepted funds from Reform donors"
    },
    {
        "url": "https://www.countytimes.co.uk/news/24071904.liberal-democrats-reveal-montgomeryshire-candidate/",
        "title": "<b>Liberal Democrats</b> reveal Montgomeryshire candidate",
        "description": "The <b>Liberal Democrats</b> have revealed their candidate for Montgomeryshire in the upcoming general election. Councillor Glyn Preston has represented Llanidloes ward on Powys County Council alongside veteran Councillor Gareth Morgan since 2022 will be the ..."
    },
    {
        "url": "https://www.hexham-courant.co.uk/news/24076554.sexual-domestic-violence-data-northumbria-police-officers/",
        "title": "Sexual and domestic violence data on Northumbria Police officers",
        "description": "Northumbria Police has responded to criticisms over how it handled and released sexual and domestic violence data concerning its own officers."
    },
    {
        "url": "https://www.ft.com/content/d1c0bf52-c8ed-4673-9aa3-3df6c771e7a7",
        "title": "Michael Gove’s plan for thousands of Cambridge homes at risk from lack of water",
        "description": "Michael Gove’s plans to dramatically expand Cambridge by 2040 with 150,000 new homes are “nonsensical” because of the city’s lack of water infrastructure, the leaders of three Cambridgeshire councils have warned."
    },
    {
        "url": "https://www.readingchronicle.co.uk/news/24078672.everyone-knows-tories-failed-says-opposition-leader/",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "&quot;Everybody knows that the Tories have failed. We&#39;ve changed the Labour Party. And now what I want is to say we can now change the country for the better. &quot;So this is the year where hope and change can come together and that we can pull together as a nation and move forward instead of being constantly stuck in this decline.&quot;"
    },
    {
        "url": "https://www.oldham-chronicle.co.uk/news-features/139/main-news/154843/sykes-welcomes-trial-of-cycles-on-trams",
        "title": "Sykes welcomes trial of cycles on trams",
        "description": "Leader of Oldham Council’s Opposition and Greater Manchester <b>Liberal</b> <b>Democrat</b> spokesperson for Transport councillor Howard Sykes MBE has welcomed news that Transport for Greater Manchester (TfGM) will trial a scheme for push bikes to be allowed onto trams."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/scottish-government-has-activated-disaster-scheme-17-times-but-only-paid-out-cash-twice",
        "title": "Scottish Government has activated disaster scheme 17 times but only paid out cash twice",
        "description": "Freedom of information requests submitted by Scottish <b>Liberal Democrats</b> reveal: Just £9,252,288 has been paid out to councils under the Bellwin Scheme since 2007-08. Between March 2020 and December 2023, the Scottish Government activated the Bellwin ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/greater-manchester-councillor-reveals-finally-28523400",
        "title": "Greater Manchester councillor reveals when he will finally resign his seat after moving to village 160 miles away",
        "description": "However, he won the traditionally Conservative seat in March 2023, by 267 votes to 207 for the <b>Liberal Democrats</b>. Despite his claim that he was merely a stand-in candidate, Coun Twells moved out of his Ordsall seat in Salford and moved to sit as an ..."
    },
    {
        "url": "https://www.ft.com/content/157a9298-2a0f-4c20-9b50-6eabb2f1596c",
        "title": "Could there be a <b>liberal</b> demagogue?",
        "description": "Can there be such a thing as a centrist demagogue? That is, a politician who is confrontational and even reckless in manner, but orthodox in content? Is it possible to use the methods of Trump in order to defeat his ends?"
    },
    {
        "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/suspended-former-east-riding-liberal-9060927",
        "title": "Suspended former East Riding <b>Liberal</b> <b>Democrat</b> leader&#39;s defection to Labour sparks &#39;bullying&#39; and &#39;behaviour&#39; row",
        "description": "The former leader of the East Riding <b>Liberal Democrats</b> has defected to Labour following his suspension earlier this month. But a Hull and East Riding <b>Liberal Democrats</b> spokesperson claimed Cllr Nolan&#39;s poor behaviour and failure to work with colleagues had ..."
    },
    {
        "url": "https://www.washingtonexaminer.com/news/2821742/biden-lng-export-project-pause-winners-and-losers/",
        "title": "Biden’s LNG export project pause: Winners and losers",
        "description": "President Joe Biden paused approvals on LNG export projects to address the climate crisis. Learn who won and lost with this decision."
    },
    {
        "url": "https://www.ctvnews.ca/politics/trudeau-and-singh-s-teams-quietly-planning-electoral-reform-legislation-1.6744379",
        "title": "Trudeau and Singh&#39;s teams quietly planning electoral reform legislation",
        "description": "As progress on some measures in the Liberal-NDP confidence-and-supply agreement continue to play out publicly, the two parties have quietly been in talks to table electoral reform legislation before the next federal vote."
    },
    {
        "url": "https://www.iol.co.za/capetimes/opinion/das-desperate-attempt-to-divide-sa-wont-succeed-c712d1ab-d1c4-44a2-bf60-a3b162f4e162",
        "title": "DA’s desperate attempt to divide SA won’t succeed",
        "description": "It is here, in the Centre, where previous conversations about historical race disadvantages and economic redress could reluctantly be discussed and more black voters could be accommodated."
    },
    {
        "url": "https://ca.news.yahoo.com/taunton-town-council-vote-council-102922480.html",
        "title": "Taunton Town Council to vote on council tax hike",
        "description": "The Full Council will decide on Tuesday whether to raise the precept from £107 to £299 for a band D home. The council&#39;s <b>Liberal</b> <b>Democrat</b> leader Tom Deakin said he was asking people to pay &quot;a little bit more&quot; to save services like CCTV, public toilets and ..."
    },
    {
        "url": "https://www.nysun.com/article/partisan-blinders-undermine-the-mission-of-the-liberal-presss-misinformation-reporters",
        "title": "Partisan Blinders Undermine the Mission of the <b>Liberal</b> Press’s ‘Misinformation’ Reporters",
        "description": "When <b>Democrats</b> are losing, they warn that democracy is dying and ... s laptop one of Steve Bannon’s “three biggest disinfo campaigns of 2020.” After the <b>liberal</b> papers acknowledged the laptop was real, Ms. Donovan still tweeted the laptop was ..."
    },
    {
        "url": "https://www.jpost.com/american-politics/article-783763",
        "title": "&#39;The Tyranny of the Minority&#39;: How US democracy is under threat - review",
        "description": "Pro-democracy forces prevailed in the United States in 2020 and 2022, the authors acknowledge. But just barely."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/26/gillian-keegan-husband-quits-cabinet-office-role-fujitsu/",
        "title": "Gillian Keegan’s husband quits Cabinet Office role amid criticism of his former employer Fujitsu",
        "description": "Spouse of Education Secretary stands down after Opposition puts him in the firing line over Post Office scandal"
    },
    {
        "url": "https://www.huffpost.com/entry/montana-senate-tim-sheehy-matt-rosendale_n_65b3ca79e4b014b873b0f261",
        "title": "The Shadowy Group Targeting A Montana Republican Is Actually A Major Democratic Super PAC",
        "description": "Senate Majority PAC, a group closely aligned with Senate Majority Leader Chuck Schumer (D-N.Y.), confirmed to HuffPost it’s the mysterious political entity behind the group funding a multi-million dollar TV ad blitz against Tim Sheehy, a wealthy businessman seeking the GOP nomination to face endangered Senate Democrat Jon Tester in Montana."
    },
    {
        "url": "https://news.sky.com/story/who-is-the-reform-party-where-did-they-come-from-and-what-are-their-policies-13056985",
        "title": "Who is the Reform Party, where did they come from and what are their policies?",
        "description": "The Reform Party is level with the Liberal Democrats according to Sky&#39;s polling - so here Sky News walks you through its key figures, its history, and what its policies are."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/26/rural-dentists-budget-boost-improve-tory-election-prospects/",
        "title": "Rural dentists set for Budget boost to improve Tory poll prospects",
        "description": "A major funding increase for rural dental practices is expected to be unveiled in the Spring Budget after Tory MPs pressed the Government for more investment."
    },
    {
        "url": "https://uk.style.yahoo.com/power-review-yance-ford-smart-183854805.html",
        "title": "‘Power’ Review: Yance Ford’s Smart and Searing Documentary on Policing in America",
        "description": "The essay-like Netflix film from the &#39;Strong Island&#39; director delves into the origins and implications of modern police violence in the United States."
    },
    {
        "url": "https://www.libdemvoice.org/aldc-byelection-report-25th-january-74589.html",
        "title": "ALDC by-election report, 25th January",
        "description": "Thank you to Lib Dem candidate Dick Moerman for standing for <b>Liberal Democrats</b> in Dunblane and Bridge of Allan ward and getting nearly 300 first preference votes. The ward was held by the Conservatives. A full summary of all results for this week and ..."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/crumbling-buildings-cause-5000-incidents-impacting-patient-care-in-areas-promised-40-new-hospitals",
        "title": "Crumbling buildings cause 5,000 incidents impacting patient care in areas promised 40 new hospitals",
        "description": "New analysis from the Liberal Democrats has revealed the devastating impact on patients of the Conservative government’s broken pledge to build 40 new hospitals."
    },
    {
        "url": "https://uk.news.yahoo.com/lib-dems-amend-sadiq-khans-195610973.html",
        "title": "Lib Dems amend Sadiq Khan&#39;s budget to include £700,000 for &#39;green doctors&#39;",
        "description": "The <b>Liberal Democrats</b> and Greens at City Hall united on Thursday to add the proposal to the Labour mayor’s draft budget. The London Assembly’s Lib Dem group, who put the amendment forward, point out that 37 per cent of London’s greenhouse gas ..."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/contributors/2024/01/24/blackburn-immigration-policy-republicans-proposing-bills-secure-border/72325395007/",
        "title": "Marsha Blackburn: Why Republicans unlike <b>Democrats</b> stand for the rule of law at the border",
        "description": "<b>Democrats</b> refuse to consider policies Republicans propose ... health care to undocumented immigrants — and the Protect Medicaid Act, which would prevent <b>liberal</b> states like California from using federal funds to subsidize health benefits for undocumented ..."
    }
]