[
    {
        "url": "https://www.burnham-on-sea.com/news/risk-to-financial-future-of-somerset-council-remains-despite-budget-agreement/",
        "title": "Risk to financial future of Somerset Council remains despite budget agreement",
        "description": "Somerset Council could still declare bankruptcy within the next 12 months despite managing to pass a balanced budget last week, it has been warned."
    },
    {
        "url": "https://www.heraldscotland.com/news/12014780.saddam-is-back-in-his-cage-says-blair-desert-fox-lifts-clinton-in-poll/",
        "title": "Saddam is back in his cage, says Blair. Desert Fox lifts Clinton in poll",
        "description": "A NEW British-American strategy to keep Saddam Hussein &#39;&#39;caged&#39;&#39; after the bruising bombardment of Operation Desert Fox was revealed yesterday"
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/local-news/fountains-switched-cambridgeshire-city-passes-28699236",
        "title": "Fountains to be switched off as Cambridgeshire city passes budget",
        "description": "Peterborough City Council has approved plans to turn off the Cathedral Square fountains, review school crossing patrols and increase council tax. The decision was made at a meeting on Wednesday, February 21, where councillors unanimously voted in favour of the budget proposals for the upcoming financial year."
    },
    {
        "url": "https://uk.style.yahoo.com/energy-companies-rake-eye-watering-193610990.html",
        "title": "Energy companies rake in ‘eye-watering’ £1bn a week as British families struggle in cost of living crisis",
        "description": "Families have struggled to bear the rising costs, with an estimated 13 per cent of households in England in fuel poverty last year"
    },
    {
        "url": "https://www.lep.co.uk/news/politics/lancashire-county-council-budget-2024-five-percent-council-tax-hike-and-how-the-authority-plans-to-spend-its-cash-4532026",
        "title": "Lancashire County Council budget 2024: five percent council tax hike - and how the authority plans to spend its cash",
        "description": "The county council is amongst the estimated 95 percent of local authorities hiking bills by as much as the government will allow without a local referendum. Two percent of the increase will be ringfenced to help cover the ever-spiralling cost of social care services for adults and children."
    },
    {
        "url": "https://www.maldonandburnhamstandard.co.uk/news/national/24142244.reform-leader-tice-uk-everest-base-camp-sectarian-politics/",
        "title": "Reform leader Tice: UK is at the ‘Everest base camp of sectarian politics’",
        "description": "Reform UK leader Richard Tice said the country is at the “Everest base camp of sectarian politics” as he said political leaders, the establishment and the police were all in fear of extremists."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/commons-simon-danczuk-everest-doncaster-south-yorkshire-b1141319.html",
        "title": "Reform leader Tice: UK is at the ‘Everest base camp of sectarian politics’",
        "description": "Reform UK leader Richard Tice said the country is at the “ Everest base camp of sectarian politics” as he said political leaders, the establishment and the police were all in fear of extremists."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/energy-companies-profits-cost-of-living-crisis-fuel-b2496666.html",
        "title": "Energy companies rake in ‘eye-watering’ £1bn a week as British families struggle in cost of living crisis",
        "description": "Families have struggled to bear the rising costs, with an estimated 13 per cent of households in England in fuel poverty last year"
    },
    {
        "url": "https://thestrayferret.co.uk/harrogate-and-ripon-councillors-clash-over-council-tax/",
        "title": "Harrogate and Ripon councillors clash over council tax",
        "description": "North Yorkshire Council agreed proposals to increase council tax charge by 4.99%. The increase will see £90 added to the average Band D bill."
    },
    {
        "url": "https://www.brecon-radnor.co.uk/news/blaming-fire-service-for-adding-to-council-tax-needs-to-stop-says-councillor-667676",
        "title": "Blaming fire service for adding to council tax needs to stop, says councillor",
        "description": "Blaming the fire service for putting one per cent onto the council tax in Powys needs to stop, a senior councillor has said."
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/local-news/final-nail-coffin-peterborough-pool-28698510",
        "title": "&#39;Final nail in the coffin&#39; for Peterborough pool as former council leader says it&#39;s &#39;not worth fixing&#39;",
        "description": "Cllr Christian Hogg ( <b>Liberal Democrats</b>, Fletton and Stanground) pointed out that various &quot;mismanaged items&quot; in the council in recent years mean the council is hamstrung when it wants to offer new services. &quot;Since I&#39;ve been a councillor, we&#39;ve had several ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/cpac-trump-2024-conference-live-speakers-b2501975.html?page=7",
        "title": "CPAC 2024 live: Trump set to speak on final day as South Carolina primary votes roll in",
        "description": "Right-wing event underway, with speeches from Donald Trump and Argentina’s president Javier Milei coming on Saturday after potential 2024 running mates make their pitches"
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/24137765.wiltshire-worst-county-tourism-council-axes-parternship/",
        "title": "Wiltshire &#39;worst county for tourism&#39; as council axes parternship",
        "description": "The leader of Wiltshire Council said the figures showed that the county was performing worse than any other county in the south west for tourism."
    }
]