[
    {
        "url": "https://www.midweekherald.co.uk/news/24083316.to-help-nhs-must-address-crisis-social-care/",
        "title": "&#39;To help the NHS, we must address the crisis in social care&#39;",
        "description": "Just recently, research by the <b>Liberal Democrats</b> found that the number of people on NHS waiting lists here in Devon reached record highs in 2023. In spite of the brilliant work of people who work in the health service, 158,000 patients were left in limbo ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/cycle-lane-hell-state-people-28534808",
        "title": "Cycle lane in &#39;hell of a state&#39; as people &#39;laugh&#39; about it",
        "description": "“That is in a hell of a state. It’s full of litter, it’s full of leaves, it’s not maintained even if cyclists wanted to cycle along there. The laugh of the populous is spot the cyclist, nobody uses it. Surely this money from the Liverpool City Region could be better invested to get people more active.”"
    },
    {
        "url": "https://www.northumberlandgazette.co.uk/news/politics/council/council-tax-in-northumberland-expected-to-rise-by-maximum-level-allowed-4497593",
        "title": "Council tax in Northumberland expected to rise by maximum level allowed",
        "description": "Under Government rules, councils are allowed to level a maximum council tax rise of 2.99% and a 2% increase in the adult social care precept without having to put the increase to residents in a referendum. The final version of the budget will be voted on by full council in February."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/councillors-lose-bid-stop-plans-28533644",
        "title": "Councillors lose bid to stop plans for three-weekly bin collections in Cardiff",
        "description": "Councillors&#39; attempts to overturn controversial plans for one black bin bag collection every three weeks failed. Conservative councillors at Cardiff Council, led by Cllr John Lancaster, put forward a motion calling for a re-think on waste collection proposals at a full council meeting on Thursday, January 25."
    },
    {
        "url": "https://www.cornish-times.co.uk/news/climate-goal-is-now-totally-impossible-663064",
        "title": "Climate goal is now “totally impossible”",
        "description": "The leader of the <b>Liberal Democrats</b> group at Cornwall Council has said the local authority’s goal for the Duchy to be carbon neutral by 2030 is “now totally impossible”, writes Lee Trewhela. Cllr Colin Martin accused the council of blocking a debate ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? Starmer opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/fears-over-stalled-revamp-gloucesters-9063660",
        "title": "Fears over stalled revamp of Gloucester’s historic Fleece Hotel as £6.3m diverted to The Forum",
        "description": "Initial revamp plans for the 15th-century timber-framed building came to a halt and no detailed designs were forthcoming from the council’s preferred partner for the site Dowdeswell Group"
    },
    {
        "url": "https://thenegotiator.co.uk/70-of-housebuilders-want-labour-to-win-general-election-says-knight-frank",
        "title": "70% of housebuilders want Labour to win General Election, says Knight Frank",
        "description": "The Knight Frank Land Index &amp; Housebuilder Survey of English housebuilders shows 70% favour Labour government plans for reform."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24082621.burnley-council-confirms-3-per-cent-rise-council-services/",
        "title": "Burnley Council confirms 3 per cent rise in council services",
        "description": "Burnley Council has confirmed a general three per cent rise in the fees for the services it provides to residents in 2024/25."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24081506.holocaust-memorial-day-sarah-dyke-signs-book-commitment/",
        "title": "Holocaust Memorial Day: Sarah Dyke signs Book of Commitment",
        "description": "Sarah Dyke signed the Holocaust Educational Trust&#39;s Book of Commitment to mark Holocaust Memorial Day. The Liberal Democrat representative for Somerton and Frome honoured those who were killed, as well as the survivors. Holocaust Memorial Day is observed on January 27th, the date in 1945 when Auschwitz-Birkenau, the Nazi camp, was liberated."
    },
    {
        "url": "https://uk.news.yahoo.com/editorial-bad-faith-negotiations-no-090000982.html",
        "title": "Editorial: Bad faith negotiations: No immigration restriction is enough for Trump &amp; GOP",
        "description": "In actuality, Republicans have held Ukraine aid hostage and demanded that the <b>Democrats</b> acquiesce to increasingly unhinged restrictions, rejecting offers that they themselves would have pushed just a few years ago. There are no <b>liberal</b> or pro-immigrant ..."
    },
    {
        "url": "https://www.edie.net/new-report-debunks-renewable-energy-scepticism/",
        "title": "Why the benefits of trebling renewables by 2030 outweigh potential negatives",
        "description": "The &#39;Renewable Energy and Sustainability Report&#39; explores renewable energy&#39;s merits and challenges, confirming its minimal environmental impacts and significant role in battling climate change."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13019717/Archbishop-Canterbury-Rwanda-Britain-Rishi-Sunak-Channel-migrants.html",
        "title": "Archbishop of Canterbury wades into Rwanda row saying Britain must &#39;do better&#39; than Rishi Sunak&#39;s new Bill as peers bid to KILL the plan",
        "description": "Justin Welby insisted Britain must &#39;do better&#39; than the government&#39;s crucial legislation as it was debated in the House of Lords for the first time."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13021253/Archbishop-Canterbury-Justin-Welby-accused-hypocrisy-Lee-Anderson-attacks-governments-Rwanda-scheme-House-Lords.html",
        "title": "Archbishop of Canterbury Justin Welby is accused of &#39;hypocrisy&#39; by Lee Anderson after he attacks the government&#39;s Rwanda scheme in the House of Lords",
        "description": "The Archbishop of Canterbury was blasted by Tory MPs last night after he said the Rwanda scheme was &#39;leading the nation down a damaging path&#39;."
    },
    {
        "url": "https://news.sky.com/story/rwanda-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-as-bill-passes-latest-lords-hurdle-13059470",
        "title": "Rwanda: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury as bill passes latest Lords hurdle",
        "description": "Justin Welby says plans to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;. But peers nod the scheme through - for now."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-grandee-ken-clarke-rwanda-bill-black-white-2879467?ico=in-line_link",
        "title": "Rwanda Bill passes first Lords hurdle despite savaging from Tory Ken Clarke",
        "description": "The Rwanda Bill has cleared its first major hurdle in the House of Lords after Tory grandee Ken Clarke ridiculed the law and warned it risks moving the UK towards an “elected dictatorship”. The former chancellor reversed his previous support for legislation related to the controversial deportation deal,"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68126734?at_medium=RSS&at_campaign=KARANGA",
        "title": "Rwanda Bill criticised by peers at first stage in House of Lords",
        "description": "Rishi Sunak&#39;s flagship Rwanda bill has faced strong criticism during its first debate in the House of Lords. Peers including the Archbishop of Canterbury attacked the principles of the bill, while the Liberal Democrats tried to kill it entirely."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/justin-welby-rwanda-government-channel-archbishop-of-canterbury-b1135631.html",
        "title": "Rwanda Bill clears first Lords hurdle as Archbishop Of Canterbury issues warning",
        "description": "The Most Rev Justin Welby accused the Government of outsourcing the country’s ‘legal and moral responsibilities’."
    },
    {
        "url": "https://uk.news.yahoo.com/rwanda-asylum-plan-leading-nation-170935804.html",
        "title": "Rwanda asylum plan ‘leading nation down a damaging path’, warns Archbishop",
        "description": "Story continues Given the Lords was a revising chamber, Mr Welby said “sadly” he would not back a <b>Liberal</b> <b>Democrat</b>-led move to block the Bill at second reading, although he found the argument made for it “convincing and powerful”. He pointedly ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/justin-welby-government-archbishop-of-canterbury-archbishop-prime-minister-b2486955.html",
        "title": "Rwanda Bill clears first Lords hurdle as Archbishop Of Canterbury issues warning",
        "description": "The Most Rev Justin Welby accused the Government of outsourcing the country’s ‘legal and moral responsibilities’."
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/jamie-stone-says-constituency-is-going-to-grow-massively-a-340581/",
        "title": "Jamie Stone says constituency &#39;is going to grow massively&#39; as he opens Wick office",
        "description": "The imminent expansion of the Caithness, Sutherland and Easter Ross seat at Westminster has prompted Jamie Stone to open a new constituency office."
    },
    {
        "url": "https://redditchstandard.co.uk/news/redditch-labour-councillor-defects-to-lib-dems-ahead-of-may-election/",
        "title": "Redditch Labour councillor defects to Lib Dems ahead of May election",
        "description": "A REDDITCH councillor has announced her defection from the Labour Party to the <b>Liberal Democrats</b> ahead of May election. Councillor Kerrie Miles of Batchley and Brockhill has said the Lib Dems are the only party that offer ‘real solutions’. “Now more ..."
    },
    {
        "url": "https://news.sky.com/story/rwanda-bill-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-13059470",
        "title": "Rwanda: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury as bill passes latest Lords hurdle",
        "description": "As the House of Lords debates the government&#39;s small boats legislation, Justin Welby says its plan to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24082252.police-crime-commissioner-candidate-tim-bearder-speaks/",
        "title": "Police and crime commissioner candidate Tim Bearder speaks",
        "description": "<b>Liberal Democrats</b> have put forward Oxfordshire county councillor Tim Bearder in their bid for the Thames Valley police and crime commissioner role. The position is filled by Conservative Matthew Barber and its responsibilities include general oversight of ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-grandee-ken-clarke-rwanda-bill-black-white-2879467?ico=most_popular",
        "title": "Tory grandee Ken Clarke savages Rwanda Bill: ‘It’s like saying black is white’",
        "description": "Tory grandee Ken Clarke has savaged Rishi Sunak’s Rwanda laws with a warning that they risk moving the UK towards an “elected dictatorship”. The former chancellor reversed his previous support for legislation related to the controversial deportation deal, warning that the Prime Minister’s latest move was a “a step too far”."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145835.milband-tories-warning-following-by-election/",
        "title": "Milband in Tories warning following by-election",
        "description": "The <b>Liberal Democrats</b> were dealt a humiliating blow when they polled just 1176 votes - not enough to hold their deposit. Mr Cameron denied the result represented a breakthrough for the Opposition and said the Tories were never expecting to do well in a ..."
    }
]