[
    {
        "url": "https://www.standard.co.uk/news/london/moped-gangs-london-cyclists-bicycles-theft-crime-regent-s-park-b1140442.html",
        "title": "Moped gangs targeting London cyclists with high-end bicycles",
        "description": "Hackney was named the worst borough for bike theft, after a total of 896 bikes were reported stolen in the east London borough between January and July in 2023. The Clean Cities Campaign, which carried out the research that was published last November, said more than 50 bikes a day were reported stolen across the capital."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tim-farron-lib-dems-nfu-liberal-democrats-government-b2499545.html",
        "title": "Lib Dems call for extra £1bn for farming budget in bid to win rural votes",
        "description": "The party is also calling for ‘arbitrary’ visa salary thresholds to be abandoned in order to help plug workforce gaps in the food sector."
    },
    {
        "url": "https://redditchstandard.co.uk/news/redditch-news-lib-dems-select-their-redditch-prospective-parliamentary-candidate/",
        "title": "Lib Dems select their Redditch prospective parliamentary candidate",
        "description": "THE <b>LIBERAL Democrats</b> have selected their Redditch Prospective Parliamentary Candidate for the upcoming general election. Andrew Fieldsend-Roxborough lives in the town with his wife and works as an engineer for the National Grid. He said it was an ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106329/voters-tough-immigration-political-parties-preserve-right.html",
        "title": "Voters are tougher on immigration than all of the main political parties and back policies often seen as the preserve of the Right, poll finds",
        "description": "A survey of more than 13,000 adults found that almost two-thirds want more restrictions on immigration, including slim majorities of Labour and Liberal Democrat voters."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/20/i-have-your-back-rishi-sunak-tells-farmers-at-nfu-conference",
        "title": "I have your back, Rishi Sunak tells farmers at NFU conference",
        "description": "Sunak becomes first PM to address conference since Gordon Brown in 2008, as part of courting of farming sector"
    },
    {
        "url": "https://www.theguardian.com/tv-and-radio/2024/feb/20/late-night-hosts-biden-age-stewart-colbert?ref=upstract.com",
        "title": "How are late-night hosts handling Biden’s age?",
        "description": "With the US election looming, comedians are grappling with how much to reference Joe Biden’s age without wider pushback"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13104493/Scholars-Trump-worst-president-liberal-bias-poll-Democratic.html",
        "title": "Scholars who ranked Trump &#39;worst ever president&#39; SLAMMED for &#39;<b>liberal</b> bias&#39; by polling academic group that&#39;s &#39;barely distinguishable from the Democratic Party and its far-left ...",
        "description": "Social media users pounced on the results, accusing the academics of polling only a small group of experts with a shared outlook that&#39;s increasingly at odds with regular Americans."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/lib-dems-fight-to-save-telford-roseburn-path",
        "title": "Lib Dems fight to save Telford/Roseburn Path",
        "description": "Following a recent Transport and Environment Committee meeting, the next phase of the tram project was agreed upon. A concerning point about this is that one of the suggested routes in the Roseburn-Telford path."
    },
    {
        "url": "https://www.politicshome.com/thehouse/article/offshore-petroleum-licensing-bill-answer-britains-problems",
        "title": "New oil and gas licences signal Britain is not serious about tackling climate change",
        "description": "We’re not even two months into the year and multiple storms have already caused not just property damage and business disruption across the"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/council/york-lib-dem-leader-calls-north-yorkshire-councillors-anti-semitic-comments-appalling-4526701",
        "title": "York Lib Dem leader calls North Yorkshire councillor&#39;s anti-Semitic comments &quot;appalling&quot;",
        "description": "The leader of York Liberal Democrats has labelled anit-Semitic comments a North Yorkshire councillor in the same party made as “appalling.” Coun Pat Marsh, who chairs the Harrogate and Knaresborough area constituency committee, was suspended from the Liberal Democrats after she tweeted various anti-Semitic comments."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/some-people-said-like-turkeys-28666196",
        "title": "&#39;Some people said it was like turkeys voting for Christmas... they were right&#39;",
        "description": "Hannah, 34, said: “Some people said it was like turkeys voting for Christmas, and they were right. Me? I didn’t vote Conservative and I never will. Why people thought the Conservatives would do anything for Leigh is beyond me.”"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-minister-maria-caulfield-gives-32172000",
        "title": "Tory minister Maria Caulfield gives bizarre excuse for not handing back £8,000 pay-off",
        "description": "Tory Health Minister Maria Caulfield pocketed thousands of pounds in severance pay despite returning to the same job just seven weeks later - and she has refused to give it back"
    },
    {
        "url": "https://www.burnleyexpress.net/news/politics/former-burnley-mp-and-current-liberal-democrat-candidate-gordon-birtwistle-believes-he-can-win-at-next-general-election-4526499",
        "title": "Former Burnley MP and current <b>Liberal</b> <b>Democrat</b> candidate Gordon Birtwistle believes he can win at next general election",
        "description": "Mr Birtwistle, the oldest new MP when he was elected by the people of Burnley to Parliament in 2010, believes there is every chance he will hold that mantle again should his fellow residents elect him a second time at this year’s general election, now at ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24132234.inspections-water-companies-quadruple-to-end-routine-lawbreaking/",
        "title": "Inspections on water companies to quadruple ‘to end routine lawbreaking’",
        "description": "Inspections on water companies will quadruple over the next year in a bid to crack down on pollution by firms, the Government has announced. The measures to increase checks include up to 500 additional Environment Agency staff for inspections,"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/farmers-junction-update-feb24",
        "title": "Farmer&#39;s Junction Update - Feb24",
        "description": "For many years there have been concerns about the safety of what is known as Farmer’s Junction, at the top of Strachan Road, as presently it is very difficult to access this junction safely as a pedestrian. This is especially true for those with a sight ..."
    }
]