[
    {
        "url": "https://www.telegraph.co.uk/politics/2023/11/15/rishi-sunak-jeremy-cut-inheritance-tax-autumn-statement/",
        "title": "Sunak and Hunt plan to cut inheritance tax at Autumn Statement",
        "description": "The pair have discussed lowering the rate from 40pc, a move that Treasury officials have deemed would not be inflationary"
    },
    {
        "url": "https://www.thenational.scot/news/23932142.bradford-labour-mp-faces-islamophobic-abuse-gaza-ceasefire-vote/",
        "title": "Bradford Labour MP faces Islamophobic abuse after Gaza ceasefire vote",
        "description": "A LABOUR MP who resigned in order to support the SNP&#39;s Gaza ceasefire motion says she has reported Islamophobic hatred to the police in the wake"
    },
    {
        "url": "https://www.edp24.co.uk/news/national/23931051.starmer-suggests-gaza-position-readying-labour-government/",
        "title": "<b>Starmer</b> suggests Gaza position is about readying Labour for government",
        "description": "He said Labour’s work with allies on the Israel-Hamas war was ‘what you would expect from someone who wants to’ be prime minister."
    },
    {
        "url": "https://www.thenational.scot/news/23929601.keir-starmers-whisky-gaffe-could-cost-election-scotland/",
        "title": "<b>Keir Starmer</b>&#39;s whisky gaffe &#39;could cost him election in Scotland&#39;",
        "description": "KEIR Starmer has thrown the next election – at least in Scotland – with an absolute howler of a tweet about our national drink."
    },
    {
        "url": "https://www.heraldscotland.com/news/23929542.great-british-energy-keir-starmer-aberdeen/?ref=rss",
        "title": "Great British Energy: <b>Keir Starmer</b> in Aberdeen",
        "description": "Sir Keir Starmer has given the biggest hint yet that the party will base their publicly owned energy company in Aberdeen if they win the"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-jeremy-corbyn-hamas-gaza-israel-whip-b1121177.html",
        "title": "<b>Starmer</b>: Corbyn’s days as Labour MP over after refusal to call Hamas terrorists",
        "description": "Sir <b>Keir Starmer</b> said Jeremy Corbyn’s “days as a Labour MP are over” as he spoke of his shock that the former party leader repeatedly refused to call Hamas a terrorist organisation. The Opposition leader said his predecessor, who was stripped of the ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/keir-starmer-promises-to-make-britain-a-clean-energy-superpower-on-visit-to-aberdeen-4413250",
        "title": "<b>Keir Starmer</b> promises to make Britain a ‘clean energy superpower’ on visit to Aberdeen",
        "description": "Labour leader Sir Keir Starmer will travel to Aberdeen where he will pledge to make Britain a “clean energy superpower”."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/23931051.starmer-suggests-gaza-position-readying-labour-government/",
        "title": "<b>Starmer</b> suggests Gaza position is about readying Labour for government",
        "description": "He said Labour’s work with allies on the Israel-Hamas war was ‘what you would expect from someone who wants to’ be prime minister."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/activists-protest-warwick-leamington-mps-175418381.html",
        "title": "Activists protest Warwick and Leamington MP&#39;s abstention in Gaza ceasefire vote",
        "description": "Matt Western has said he is in support of an urgent cessation of hostilities in the Israel-Gaza conflict but chose not to vote for or against the SNP’s amendment to the King’s Speech calling for a ceasefire because “it was a simple political ploy designed to divide” the House of Commons."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/iceland-grindavik-powerless-against-immense-forces-of-nature-as-volcano-threatens-to-erupt/",
        "title": "Iceland: Grindavik powerless against immense forces of nature as volcano threatens to erupt",
        "description": "Labour MP Jo Stevens &#39;frightened&#39; after graffiti sprayed on office following Gaza ceasefire vote A Labour MP and member of Sir <b>Keir Starmer</b>&#39;s shadow cabinet says she has been left &quot;shocked&quot;, &quot;angry&quot; and &quot;frightened&quot; after her constituency office was ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tony-blair-keir-starmer-middle-east-2761900?ico=related_article_inline",
        "title": "Tony Blair is acting as <b>Keir Starmer</b>’s Middle East broker",
        "description": "The former Prime Minister is using his extensive contacts to help the Labour leader make diplomatic inroads in the region."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/11/17/labour-mp-jo-stevens-office-vandalised-abstained-gaza-vote/",
        "title": "Labour MP Jo Stevens’s office vandalised after she abstained from Gaza vote",
        "description": "Outside of building in Cardiff sprayed with red paint and posters put up accusing the parliamentarian of having ‘blood on her hands’"
    },
    {
        "url": "https://uk.style.yahoo.com/labour-mp-jo-stevens-frightened-145500455.html",
        "title": "Labour MP Jo Stevens &#39;frightened&#39; after graffiti sprayed on office following Gaza ceasefire vote",
        "description": "A Labour MP and member of Sir <b>Keir Starmer</b>&#39;s shadow cabinet says she has been left &quot;shocked&quot;, &quot;angry&quot; and &quot;frightened&quot; after her constituency office was vandalised. Shadow Welsh secretary and Cardiff Central MP Jo Stevens&#39; office was sprayed with the word ..."
    },
    {
        "url": "https://www.pressandjournal.co.uk/fp/politics/6261349/keir-starmer-aberdeen-jobs-opinion/",
        "title": "<b>Keir Starmer</b>: ‘I will unleash a generation of secure jobs for Aberdeen’",
        "description": "An icon of a desk calendar. An icon of a circle with a diagonal line across. An icon of a block arrow pointing to the right. An icon of a paper envelope. An icon of the Facebook &quot;f&quot; mark. An icon of the Google &quot;G&quot; mark. An icon of the Linked In &quot;in&quot; mark ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/jo-stevens-gaza-south-wales-police-cardiff-naz-shah-b2449188.html",
        "title": "Shadow Welsh secretary’s office daubed with red paint after Gaza vote",
        "description": "The shadow Welsh secretary supported a three-line whip by Labour to abstain on an SNP amendment to the King’s Speech calling for a ceasefire and instead back party leader Sir <b>Keir Starmer</b>’s position of longer “humanitarian pauses”. Sir <b>Keir</b> faced a ..."
    },
    {
        "url": "https://www.independent.co.uk/business/starmer-promises-to-make-britain-a-clean-energy-superpower-b2448864.html",
        "title": "<b>Starmer</b> promises to make Britain a ‘clean energy superpower’",
        "description": "Sir Keir Starmer will be joined in Scotland by Scottish Labour leader Anas Sarwar and shadow energy secretary Ed Miliband."
    },
    {
        "url": "https://www.thesun.co.uk/news/24765081/sir-keir-starmer-labour-frontbenchers-gaza-ceasefire/",
        "title": "Sir <b>Keir Starmer</b> begs Labour to be ‘as united as we can’ after eight frontbenchers quit over Gaza ceasefire vote",
        "description": "SIR Keir Starmer wants Labour to be “as united as we can” after eight frontbenchers quit over the Gaza ceasefire vote. And it emerged axed rebels including Jess Phillips could still get a top job"
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-the-labour-leaders-stance-braving-the-storm-j5j5l2pfc",
        "title": "The Times view on the Labour leader’s stance: Braving the Storm",
        "description": "Sir Keir Starmer has been severely tested by a mass revolt of Labour MPs calling for a ceasefire in Gaza. But he must stand his ground and assert his authority as leader"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/nov/16/keir-starmer-fight-labour-gaza-palestinian-party-rebels-snp",
        "title": "<b>Keir Starmer</b> bruised in fight with Labour party he did not want",
        "description": "Critics say Labour leader missed chance to sound more sympathetic to Palestinian suffering and accept that a Gaza ceasefire call was implied"
    },
    {
        "url": "https://inews.co.uk/news/politics/nurses-keir-starmer-strikes-continue-labour-pay-demands-2759168?ico=more_from_this_author",
        "title": "Nurses warn <b>Starmer</b> strikes will continue under a Labour government if pay demands aren’t met",
        "description": "The Government offered a 5 per cent increase in pay and a cash lump sum for NHS workers, which was accepted by the NHS Staff Council but rejected by the RCN, however, the union failed to secure enough votes to continue industrial action. But Ms Marquis warned “members will decide as a collective, the times at which we take action”."
    }
]