[
    {
        "url": "https://www.dailymail.co.uk/news/article-12895249/Meghan-Markle-Prince-Harry-say-rosy-critics-beg-differ.html",
        "title": "Four years after Megxit, the Sussexes say everything is rosy across the pond - but as figures show their Archewell Foundation is low on donations, critics beg to differ",
        "description": "Judging by the slick, minute-long video released this month by the Duke and Duchess of Sussex &#39;s Archewell Foundation, the past year has been nothing short of a triumph."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848515/meghan-markle-sign-never-been-happier",
        "title": "The key stand out sign <b>Meghan Markle</b>&#39;s royal days are firmly behind her",
        "description": "<b>Meghan Markle</b> has kept a fairly low profile since stepping down as a senior royal at the start of 2020, but according to one subtle sign, the former actress appears to have &quot;never been happier&quot;. The one clue to how <b>Meghan</b> - who was recently met with a dig ..."
    },
    {
        "url": "https://uk.style.yahoo.com/best-everlane-end-of-year-sale-210039398.html",
        "title": "Selena Gomez&#39;s &#39;super cozy&#39; Everlane sweater is 30% off for Boxing Day",
        "description": "In late 2022, Gomez posted an Instagram Story wearing the half-zip sweater in a (since-discontinued) shade of blue. In the post, the &quot;Only Murders in the Building&quot; actress looked as cozy as can be in the merino knit, which she styled with a pair of Jenny Bird earrings and an &quot;I Voted&quot; sticker."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-jet-173917109.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Jet to Tropical Holiday Vacation with Prince Archie and Princess Lilibet",
        "description": "Meghan, 42, and Harry, 39, have squeezed in a few private vacations this year. In September, the couple reportedly stopped in Portugal (where Harry’s cousin Princess Eugenie and her family live part-time) after the 2023 Invictus Games in Germany and quietly visited the Caribbean in October after marking World Mental Health Day in New York City."
    },
    {
        "url": "https://www.thesun.ie/royals/11896416/princess-diana-left-out-family-christmas-present-tradition/",
        "title": "Diana ‘left out in the cold’ after buying expensive Xmas gifts for Royals when Charles didn’t tell her about tradition",
        "description": "PRINCESS Diana was “left out in the cold” when Charles didn’t tell her about one major Christmas royal present tradition.  Typically, the royals exchange “gag gifts” on Christmas Eve –"
    },
    {
        "url": "https://www.dailyrecord.co.uk/newsletter/newsletter-entertainment/meghan-markle-deliberately-distancing-prince-31736440",
        "title": "<b>Meghan Markle</b> &#39;deliberately distancing&#39; from Prince Harry may bring &#39;big change&#39;",
        "description": "A royal expert has weighed in on the Duchess of Sussex supposed strategy for her &#39;own brand&#39;. An expert has weighed in on Meghan Markle&#39;s apparent ploy to distance herself from husband Harry - and it may be about to pay off."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-had-202715593.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Had a Very Tropical Holiday",
        "description": "They were spotted with Lili and Archie in Zapotal, Nandayure, and Guanacaste."
    },
    {
        "url": "https://goss.ie/la-showbiz/prince-harry-and-meghan-markle-set-for-a-year-of-redemption-as-they-consider-relocating-363422",
        "title": "Prince Harry and <b>Meghan Markle</b> set for a ‘year of redemption’ as they consider relocating",
        "description": "Prince Harry and Meghan Markle are reportedly hoping 2024 will be their “year of redemption”, as they’re considering a big move to Los Angeles."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-harrys-new-strategy-blown-31734822",
        "title": "<b>Meghan</b> and Harry&#39;s new strategy &#39;blown out of water&#39; by explosive Endgame aftermath",
        "description": "The Duke and Duchess of Sussex had been trying to keep their heads down and focus on rebranding their image when Omid Scobie released Endgame and opened a fresh new royal feud."
    },
    {
        "url": "https://www.hellomagazine.com/cuisine/509987/creamy-cocktail-meghan-markle-go-to-festive-drink/",
        "title": "<b>Meghan Markle</b>&#39;s creamy Christmas cocktail might be the healthiest royal tipple yet",
        "description": "There are benefits in the recipe&#39;s supporting ingredients. Cinnamon has antioxidant and anti-viral properties, can reduce inflammation, helps decrease blood pressure, and promotes healthy blood sugar levels. Meanwhile, cardamom aids digestion and acts as a stimulant to improve circulation, and ginger and dates are famous for aiding gut health."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848325/meghan-markle-prince-harry-victims-redemption",
        "title": "<b>Meghan Markle</b> and Prince Harry &#39;know they&#39;ve overdone victim card&#39; in bid for redemption",
        "description": "Meghan, the Duchess of Sussex and Prince Harry have embarked on a road to redemption and rehabilitation, an expert has said, after realising they have &quot;overdone&quot; their &quot;victim card&quot;. The Duchess, 42,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/inside-meghan-markle-prince-harrys-31733543",
        "title": "Inside <b>Meghan Markle</b> and Prince Harry&#39;s idyllic family holiday before Christmas",
        "description": "Prince Harry and Meghan Markle made a secret dash to A-List celebrity destination, Costa Rica, to soak up the sun in an idyllic family holiday, according to local reports"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-has-failed-making-31732708",
        "title": "<b>Meghan Markle</b> &#39;has failed at making money and finding role despite Prince Harry finding his&#39;",
        "description": "The past 12 months have been filled with many ups and downs for Prince Harry and Meghan Markle, and one royal expert believes one half of the par has fared better than the other"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25139120/prince-harry-and-meghan-hoping-year-of-redemption/",
        "title": "<b>Meghan Markle</b> and Harry plotting ‘year of redemption’ after tough 2023 – and may even move as duchess eyes ‘big deal’",
        "description": "PRINCE Harry and <b>Meghan Markle</b> are hoping for a “year of redemption” after a tough 2023, sources have claimed. The Duke and Duchess of Sussex were crowned the “biggest losers” of Hollywood earlier this month - but are looking to turn it all around ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12893433/Meghan-markle-father-day-call-sister-uvalde-shooting-victim-irma-garcia.html",
        "title": "Moment <b>Meghan Markle</b> makes touching call to check in on sister of Uvalde shooting victim Irma Garcia whose husband died of a heart attack two days after massacre",
        "description": "This is the touching moment when Meghan Markle called to check-in on one of the families most affected by the tragedy that occurred in Uvalde, Texas, in May 2022."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-meghan-markles-new-31732478",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s new strategy &#39;blown out of water&#39; by explosive book, expert claims",
        "description": "Prince Harry and Meghan Markle&#39;s attempts to reshape the narrative around them had been working but were derailed by the publication of bombshell book, Endgame, according to a royal expert"
    },
    {
        "url": "https://uk.movies.yahoo.com/best-memes-moments-2023-104531400.html",
        "title": "The Best Memes And Moments Of 2023",
        "description": "From Rihanna’s Super Bowl performance to girl dinner and girl math, the year brought us dozens of hilarious, fun and relatable things to obsess over on the internet."
    },
    {
        "url": "https://www.heart.co.uk/news/royals/king-charles-gives-bizarre-christmas-gift-to-staff/",
        "title": "King Charles gives &#39;bizarre&#39; Christmas gift to staff which he slips into their lockers",
        "description": "According to one of King Charles III&#39;s former employees, the monarch likes to give his staff quirky presents during the festive season. Grant Harrold, who worked as a butler at Highgrove for seven years, told The Mirror about the interesting gifts he had received from the King."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509903/king-charles-thoughts-not-spending-christmas-grandchildren-prince-archie-princess-lilibet/",
        "title": "King Charles&#39; thoughts on not spending &#39;hectic&#39; Christmas with grandchildren Prince Archie and Princess Lilibet",
        "description": "During a chat with HELLO!, Ingrid Seward, royal author and editor-in-chief of Majesty Magazine, confessed that the King may be &quot;relieved&quot; not to spend Christmas with Prince Harry and his family as the day tends to be pretty &quot;hectic&quot; and he won&#39;t be able to give his full attention to them."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/logan-paul-responds-south-park-utterly-savage-prime-spoof-20013817/?ico=mosaic_tag",
        "title": "Logan Paul has very extra response to South Park’s savage Prime spoof",
        "description": "Logan Paul has tried to get his own back on South Park after the show utterly destroyed him with their Prime energy drink spoof. In the latest episode of the long running show, the controversial YouTuber and current WWE United States Champion became their latest target in an absolutely savage parody."
    },
    {
        "url": "https://www.djournal.com/news/national/meghan-markles-talent-agency-struggling-to-win-duchess-brand-deals---head-scratching/video_2f6327e6-feba-5b70-b91d-50aa16bd3aee.html",
        "title": "<b>Meghan Markle</b>&#39;s talent agency STRUGGLING to win Duchess brand deals - &#39;head scratching!&#39;",
        "description": "Royal and Showbiz Reporter Kinsey Schofield has revealed that Meghan Markle&#39;s talent agency, WME, are &quot;struggling&quot; to secure deals for the royals, due to the &quot;animosity&quot; surrounding them and their"
    },
    {
        "url": "https://people.com/meghan-markle-prince-harry-vacation-costa-rica-prince-archie-princess-lilibet-8419696",
        "title": "<b>Meghan Markle</b> and Prince Harry Jet to Tropical Holiday Vacation with Prince Archie and Princess Lilibet",
        "description": "Meghan Markle and Prince Harry, the Duke and Duchess of Sussex, traveled to Costa Rica with their children Prince Archie and Princess Lilibet. All about the getaway and the family&#39;s Christmas festivities."
    },
    {
        "url": "https://www.wsoctv.com/news/trending/meghan-markle-appears-coffee-ad-extra/CWVD2NRMQVBNDPQIX2KCU6N5YQ/",
        "title": "<b>Meghan Markle</b> appears in coffee ad as extra",
        "description": "Meghan Markle has been an investor and advisor for the company for about three years and was in a Clevr Instagram reel in February."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-2023-fashion-photos-1854960",
        "title": "<b>Meghan Markle</b>&#39;s Fashion Year in Photos",
        "description": "Meghan was a recipient at the Women of Vision awards in New York City on May 16, where she walked the red carpet with Prince Harry wearing a glittering gold evening dress with a sweetheart neckline and keyhole cut-out designed by Johanna Ortiz."
    },
    {
        "url": "https://www.vanityfair.com/news/rudy-giuliani-bankruptcy-148-million-defamation",
        "title": "Rudy Giuliani Files for Bankruptcy Following $148 Million Defamation Judgment",
        "description": "A federal judge ordered the former NYC mayor to start paying the debt immediately out of concern he would “conceal his assets.”"
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-defended-uvlade-victim-father-1855040",
        "title": "<b>Meghan Markle</b> Defended by Uvalde Victim&#39;s Father",
        "description": "Claims Meghan brought media to Uvalde after a school shooting are &quot;far from the truth,&quot; according to the father of one victim."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/who-will-attend-royal-christmas-day-church-service-sandringham-b1048823.html",
        "title": "Who will attend the royal Christmas Day church service at Sandringham this year?",
        "description": "The King and Queen will attend the Christmas Day morning service at Sandringham Church, Buckingham Palace said this week. The pair will on Monday (December 25) march together with other royal family members."
    },
    {
        "url": "https://dailycoffeenews.com/2023/12/22/weekly-coffee-news-market-trends-report-ally-coo-departing/",
        "title": "Weekly Coffee News: Market Trends Report + Ally COO Departing",
        "description": "Welcome to DCN’s Weekly Coffee News. Keep up with all the latest coffee industry stories and career opportunities by subscribing to DCN’s newsletter. Tell our editors about"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1140722-prince-harry-meghan-markle-hatch-new-plan-to-shut-down-haters",
        "title": "Prince Harry, <b>Meghan Markle</b> hatch new plan to shut down haters",
        "description": "Prince Harry and Meghan Markle will not be let down by a series of attacks hurled at them across the year. According to reports, the Duke and Duchess of Sussex intend to hit back after being dubbed one of the ‘biggest Hollywood losers’ of 2023 in an analysis published by The Hollywood Reporter."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2922541/prince-harry-meghan-markle-private-costa-rican-vacation/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> Find Another Drama-Free Way To Enjoy Their Privacy",
        "description": "Harry and Meghan were able to enjoy their drama-free holiday with Prince Archie, 4, and Princess Lilibet, 2, as any average family. The local press was very aware of the royal family ‘s presence, and they did snap photos (see the photos HERE ),"
    },
    {
        "url": "https://pagesix.com/2023/12/22/royal-family/how-popular-meghan-markle-and-prince-harry-are-hoping-2024-will-be-the-year-of-redemption/",
        "title": "‘Popular’ <b>Meghan Markle</b> and Prince Harry are hoping 2024 will be ‘the year of redemption’",
        "description": "An insider claimed that the Sussexes are planning to move from Montecito, Calif., to Los Angeles to be closer to the Hollywood industry."
    },
    {
        "url": "https://www.btimesonline.com/articles/162819/20231222/prince-harry-and-meghan-markle-face-charity-financial-struggles-and-royal-title-threats-amid-royal-rifts.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Face Charity Financial Struggles and Royal Title Threats Amid Royal Rifts",
        "description": "Prince Harry and Duchess Meghan&#39;s Archewell Foundation has faced a significant decline in donations, with a sharp drop from nearly $13 million in 2021 to just over $2 million in 2022. This decline in financial support comes amid growing concerns about the couple&#39;s public image and their future in the philanthropic and entertainment sectors."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-anticipate-151536170.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> Anticipate A ‘Year Of Redepmtion’ After Setbacks In 2023",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, are reportedly hopeful for redemption in the new year, aiming to overcome setbacks and media criticism faced in 2023. Recent claims also suggest Meghan may return as a producer after engaging with entertainment executives at an event."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1140788-meghan-markle-to-sit-for-a-tell-all-interview-like-princess-diana",
        "title": "<b>Meghan Markle</b> to sit for a tell-all interview like Princess Diana?",
        "description": "Markle Markle is expected to reveal bombshell revelations about her life in a tell-all interview like her late mother-in-law Princess Diana. In conversation with The Mirror, PR expert Matt Yanofsky claimed, &quot;Meghan, of course, thinks she&#39;s a fancy celebrity, not the glorified reality star that she is.&quot;"
    },
    {
        "url": "https://www.thedailybeast.com/whos-in-whos-out-at-king-charles-royal-family-christmas",
        "title": "Who’s In, Who’s Out, at King Charles’ Royal Family Christmas",
        "description": "After another turbulent royal year, Charles is preparing to host family members at Sandringham—with Harry and Meghan absent from festivities."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-seen-161800909.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Seen on Vacation With Kids in Costa Rica",
        "description": "Prince Harry and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet, visiting Zapotal, Nandayure and Guanacaste."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markle-makes-acting-cameo-coffee-commercial-1722338",
        "title": "<b>Meghan Markle</b> Makes Acting Cameo In Coffee Commercial",
        "description": "Meghan Markle has been a supporter of Clevr Blends since 2017 but was only announced as its investor in 2020. Shortly after, Kim Kardashian and Oprah Winfrey co-signed with the brand, which sells nutrition-rich lattes &quot;filled with magical plants to manage stress.&quot;"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-christmas-card-2023-b2468302.html",
        "title": "The best and worst royal Christmas cards over the years",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://www.couriermail.com.au/entertainment/celebrity-life/royals/year-of-redemption-meghan-markle-and-prince-harrys-2024-resolution/news-story/42f8fe27dc41b5852fd37cbf5bd0ad9e",
        "title": "‘Year of redemption’: <b>Meghan Markle</b> and Prince Harry’s 2024 resolution",
        "description": "<b>Meghan Markle</b> and Prince Harry see a “Year of Redemption” ahead in 2024. Picture: Supplied It would be a remarkable turnaround after a 2023 that royal observers hold in esteem just shy of 1992, when the Queen famously lamented a year where three of her ..."
    },
    {
        "url": "https://uproxx.com/tv/new-suits-show-info-details-trailer/",
        "title": "The New ‘Suits’ Series: Everything We Know So Far Including The Release Date, Trailer &amp; More",
        "description": "Even <b>Meghan Markle</b>, who might have been the initial reason for resurrected interest on Netflix, expressed surprise. The rest of the cast felt similarly, even “gobsmacked,” to see the first eight seasons of the legal drama trend week after week until ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/21/south-park-eviscerates-logan-paul-prime-energy-drinks-20010249/?ico=trending-module_author_sabrina-barr_item-5",
        "title": "South Park eviscerates Logan Paul and his Prime energy drinks in savage takedown",
        "description": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video South Park has never been a show to shy away from ..."
    },
    {
        "url": "https://uk.style.yahoo.com/2024-reportedly-looks-promising-prince-182323466.html",
        "title": "2024 Reportedly Looks Promising for Prince Harry and <b>Meghan Markle</b> As “Lucrative Offers Have Been Flooding In”",
        "description": "The year 2023 was nothing if not tumultuous for Prince Harry and <b>Meghan Markle</b>. Just 10 days into the new year, Harry’s bombshell memoir, Spare, was released, and the fallout was felt in many different forms and fashions. (That said, it also broke sales ..."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/meghan-markle-reveals-one-gift-200900523.html",
        "title": "<b>Meghan Markle</b> Reveals the One Gift Archie Wants—But Isn’t Getting—for Christmas",
        "description": "This year, there’s one item on <b>Meghan Markle</b> and Prince Harry’s son Archie’s wish list that he won’t be getting this Christmas—and understandably so: a Leica camera, which is handcrafted and costs thousands of dollars. <b>Meghan</b> spoke with director ..."
    }
]