[
    {
        "url": "https://nypost.com/2024/02/11/entertainment/king-charles-thanks-public-for-support-makes-first-appearance-since-cancer-diagnosis/",
        "title": "King Charles thanks public for support, makes first appearance since cancer diagnosis",
        "description": "I would like to express my most heartfelt thanks for the many messages of support and good wishes I have received in recent days,” Charles said in a statement."
    },
    {
        "url": "https://uk.style.yahoo.com/why-prince-harry-meghan-markle-222000139.html",
        "title": "Why Prince Harry and <b>Meghan Markle</b> Will Not Attend the Super Bowl",
        "description": "Prince Harry attended the NFL Honors in Las Vegas, but that doesn&#39;t mean he will be at the Super Bowl on Sunday."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1865587/Prince-Harry-Meghan-Markle-ditch-Super-Bowl",
        "title": "Prince Harry and <b>Meghan Markle</b> ditch Super Bowl and NFL pal chats to Taylor Swift instead",
        "description": "Prince Harry made a surprise appearance at NFL Honors in Vegas, but he didn&#39;t stay long and Meghan Markle did not arrive."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-makes-glamorous-appearance-32101314.amp",
        "title": "<b>Meghan Markle</b> makes glamorous appearance in new advert for her favourite designer shoes",
        "description": "The Duchess of Sussex Meghan Markle has previously worn footwear designs from Italian label Aquazzura and now she appears in the designer&#39;s latest adverts"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-incredibly-envious-kate-32100782.amp",
        "title": "<b>Meghan Markle</b> &#39;incredibly envious&#39; of Kate Middleton over sisterly bond with Prince Harry",
        "description": "The Duchess of Sussex and her sister-in-law the Princess of Kate are thought to have a strained relationship, with one royal expert pointing out that the issue could lie in Kate and Prince Harry&#39;s clo"
    },
    {
        "url": "https://www.hellomagazine.com/homes/513226/charles-spencer-wife-karen-shares-rare-glimpse-princess-diana-resting-place-tranquil/",
        "title": "Charles Spencer&#39;s wife Karen shares rare glimpse of Princess Diana&#39;s resting place – and it&#39;s so tranquil",
        "description": "Charles Spencer&#39;s wife Karen regularly posts stunning glimpses of the family home where she lives with her husband and their daughter, Charlotte Diana . The spacious estate, Althorp House, which has been in the Spencer family for more than 500 years, is also where Charles&#39; sister Princess Diana was laid to rest."
    },
    {
        "url": "https://www.oxfordstudent.com/2024/02/11/the-secret-to-suits-success/",
        "title": "The secret to Suits’ success? It gives us the nothing we so desperately crave",
        "description": "Liz Lane explores the reasons for the popularity of Suits, which was announced as the most-streamed show of 2023."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25854743/meghan-jealous-harrys-brotherly-love-kate/",
        "title": "<b>Meghan</b> is jealous of Harry’s brotherly ‘love’ for Kate – after the prince always longed for a sister, says royal expert",
        "description": "MEGHAN Markle is “jealous” of Prince Harry’s brotherly “love” for Kate, a royal expert has claimed.  Ingrid Seward believes that the Duchess of Sussex is “incredibly envious” of the"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13070841/Meghan-Markle-incredibly-envious-Kate-Middleton-Duchess-thought-going-princess-live-Windsor-Castle-says-royal-expert.html",
        "title": "<b>Meghan Markle</b> &#39;must have been incredibly envious&#39; of Kate Middleton because of Princess&#39; sisterly relationship with Prince Harry, says royal expert",
        "description": "Editor of Majesty magazine Ingrid Stewart told The Telegraph how the Duchess of Sussex , 42, &#39;thought she was going to be a princess and live in Windsor Castle&#39;."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/10/",
        "title": "Prince Harry updates — Duke and <b>Meghan</b> ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE Harry and Meghan Markle will attend this weekend’s Super Bowl just days after the Duke’s whirlwind visit to the UK, sources say. Harry met with King Charles in a short 30-minute"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25865614/real-reason-meghan-markle-missing-vogue/",
        "title": "The real reason why <b>Meghan Markle</b> didn’t appear on iconic Vogue legends cover revealed",
        "description": "WHEN Edward Enninful debuted his final cover, royal fans were surprised to see that the Duchess of Sussex hadn’t made the cut. Meghan Markle, 42, was noticeably absent from the impressive shoot,"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/world-news/super-bowl-2024-prince-harry-28611618",
        "title": "Super Bowl 2024 - Prince Harry and <b>Meghan Markle</b> &#39;set to miss the big game&#39; despite invite",
        "description": "The Duke and Duchess of Sussex were asked to attend tonight&#39;s big game that will see the San Francisco 49ers take on the Kansas City Chiefs."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/prince-harrys-hand-gesture-shows-32099340.amp",
        "title": "Prince Harry&#39;s hand gesture shows &#39;true feelings&#39; after King Charles visit, expert says",
        "description": "A body language expert has broken down Prince Harry&#39;s mannerisms after he returned from his trip to the UK to see his father, who has been diagnosed with cancer."
    },
    {
        "url": "https://www.theguardian.com/media/2024/feb/11/jon-stewart-daily-show-return",
        "title": "Return of the zing: Jon Stewart is back at The Daily Show, amid a changed world",
        "description": "Will Stewart’s satire still cut through in a post-pandemic world of disinformation, polarisation and fragmented media?"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13070901/Meghan-Markles-footwear-brand-Aquazzura-feature-snaps-Duchess-wearing-heels-engagement-photoshoot-wedding-reception-new-advert.html",
        "title": "<b>Meghan Markle</b>&#39;s go-to footwear brand Aquazzura feature snaps of the Duchess wearing its heels for her engagement photoshoot and wedding reception in new advert",
        "description": "Italian brand Aquazzura included photos from the Duke and Duchess of Sussex&#39;s engagement photoshoot and later their wedding reception, with Meghan donning the firm&#39;s designs in each, in its ad."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-king-charles-reunion-32098376",
        "title": "&#39;Prince Harry was happy with his visit to King Charles - there was no anxiety&#39;",
        "description": "A body language expert has shed light on Prince Harry&#39;s relationship with King Charles, after he flew to the UK to visit his dad, following a shocking cancer diagnosis"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/king-charles-speaks-first-time-112507736.html",
        "title": "King Charles Speaks For First Time Since Cancer Diagnosis",
        "description": "King Charles has spoken publicly for the first time since his cancer diagnosis was revealed. The British monarch released a statement Saturday to share his “heartfelt thanks” for all the messages of support he has received in the past week,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-mysteriously-wears-different-32079662.amp",
        "title": "<b>Meghan Markle</b> mysteriously wears &#39;different&#39; ring to one Prince Harry proposed with",
        "description": "Prince Harry and the Duchess of Sussex got engaged in 2017 in Kensington Palace&#39;s north garden before stepping down as senior royals in 2020."
    },
    {
        "url": "https://www.ok.co.uk/royal/duchess-sophie-issued-savage-eight-32098456",
        "title": "Duchess Sophie &#39;issued savage eight-word reply&#39; when asked to step in for <b>Meghan Markle</b>",
        "description": "Sophie, Duchess of Edinburgh, is reported to have issued a savage response when asked if she and Prince Edward would step up in the wake of other royals abandoning their duties"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-line-of-succession-charles-william-b2494295.html",
        "title": "British line of succession: Who is next heir to the throne as Charles diagnosed with cancer",
        "description": "As the second child of King Charles III and the late Princess Diana, Prince Harry is fifth in line for the throne after his brother, nephews and niece. His wife, Meghan Markle, is not in line for the throne - much like the Duchess of Cambridge - but their two children are."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/prince-harry-has-jolly-good-time-roasting-american-football-at-nfl-honors_uk_65c88427e4b093b2e783f03c?d_id=7290193&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Prince Harry Has Jolly Good Time Roasting American Football At NFL Honors",
        "description": "This man Walter Payton.&quot; Harry made the trip to London without his wife <b>Meghan Markle</b>, who remained in California with their two children. The couple moved there after they stepped away from royal duties in 2020."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863225/duchess-sophie-meghan-markle-savage-response",
        "title": "Duchess Sophie&#39;s savage response when asked if she&#39;d step in for <b>Meghan Markle</b>",
        "description": "Dubbed the royals&#39; &#39;secret weapon&#39;, Sophie, Duchess of Edinburgh, is said to have acted as peacemaker between the Windsors, Prince Harry and Meghan Markle."
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/tv-host-called-vile-over-claim-prince-harry-drama-contributed-to-king-charles-cancer/",
        "title": "TV Host Called &#39;Vile&#39; Over Claim Prince Harry Drama &#39;Contributed&#39; to King Charles&#39; Cancer",
        "description": "A guest on the U.K.&#39;s right-wing news network GB News created controversy recently by floating the idea that the ongoing drama with Prince Harry and Meghan Markle &quot;contributed&quot; to King Charles III&#39;s cancer diagnosis."
    },
    {
        "url": "https://www.cleveland.com/browns/2024/02/travis-kelce-on-how-cleveland-shaped-him-how-much-he-has-left-in-tank-and-if-hell-bring-taylor-swifts-eras-tour-to-his-hometown.html",
        "title": "Travis Kelce on how Cleveland shaped him, how much he has left in the tank, and if he’ll bring Taylor Swift’s Eras Tour to his hometown",
        "description": "LAS VEGAS — No matter how big Travis Kelce gets — and he and his new love Taylor Swift are approaching Prince Harry and Meghan Markle status — he’ll always be a kid from Cleveland Heights who appreciates his roots."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/real-reason-meghan-markle-didnt-appear-on-iconic-vogue-legends-cover-revealed/news-story/3a7c30f9e0dd1ee96288026926de67cc",
        "title": "Real reason <b>Meghan Markle</b> didn’t appear on iconic Vogue legends cover revealed",
        "description": "When Edward Enninful debuted his final cover, royal fans were surprised to see that the Duchess of Sussex hadn’t made the cut."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156695-meghan-markle-prince-harry-skipping-super-bowl-because-of-taylor-swift",
        "title": "<b>Meghan Markle</b>, Prince Harry skipping Super Bowl because of Taylor Swift?",
        "description": "Meghan Markle and Prince Harry decided to skip the much-awaited 2024 Super Bowl Championship because of Taylor Swift&#39;s expected appearance in the big game, claim fans.Several fans believe that"
    },
    {
        "url": "https://www.news.com.au/sport/nfl/super-bowl-2024-all-the-latest-news-and-highlights-from-las-vegas/news-story/a58f5d6a8e3131ba9625dc0ae5db3d5d",
        "title": "Super Bowl 2024: All the latest news and highlights from Las Vegas",
        "description": "Taylor Swift will be there, Prince Harry won’t, the San Francisco 49ers are complaining of a hijacked preparation, while the Kansas City Chiefs are ruing a major injury blow in a dramatic build-up to Super Bowl LVIII."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156690-meghan-markle-accused-of-using-prince-harry-for-personal-gains",
        "title": "<b>Meghan Markle</b> accused of &#39;using&#39; Prince Harry for &#39;personal gains&#39;",
        "description": "Meghan Markle has been accused of using Prince Harry for her personal gains by a royal expert. In conversation with GB News, royal commentator Candace Owens claimed that the former Suits"
    },
    {
        "url": "https://www.digitaltrends.com/movies/best-tv-shows-to-stream-instead-of-watching-2024-super-bowl/",
        "title": "10 great TV shows to stream instead of watching the 2024 Super Bowl",
        "description": "Don&#39;t want to watch the 2024 Super Bowl? Digital Trends has compiled a list of the best TV shows to stream on Netflix, Hulu, Amazon Prime Video, Max, and more."
    },
    {
        "url": "https://uk.news.yahoo.com/why-prince-harry-meghan-markle-222000139.html",
        "title": "Why Prince Harry and <b>Meghan Markle</b> Will Not Attend the Super Bowl",
        "description": "Prince Harry attended the NFL Honors in Las Vegas, but that doesn&#39;t mean he will be at the Super Bowl on Sunday."
    },
    {
        "url": "https://www.rsvplive.ie/news/celebs/reason-meghan-markle-didnt-travel-32099519",
        "title": "The reason <b>Meghan Markle</b> didn&#39;t travel to the UK with Prince Harry as he met with King Charles after cancer diagnosis",
        "description": "Prince Harry was reunited with his father King Charles after the royal flew back to England after news that the monarch had been diagnosed with cancer was made public"
    },
    {
        "url": "https://ca.finance.yahoo.com/news/most-memorable-royal-photos-2024-130000348.html",
        "title": "The Most Memorable Royal Photos of 2024 (So Far)",
        "description": "This year got off to an unexpected start with the British royal family, with both Kate Middleton and King Charles hospitalized for medical conditions, and then the news of Charles&#39;s cancer diagnosis."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/why-nicole-kidman-absent-era-122309457.html",
        "title": "Why Nicole Kidman Was Absent From Era-Defining Vogue Cover",
        "description": "It was an era-defining moment when departing Vogue UK editor Edward Enninful gathered together 40 of the most famous faces to have graced the cover of his magazine for a farewell group shot. Famous faces on the March 2024 issue include veterans Oprah Winfrey and Jane Fonda,"
    },
    {
        "url": "https://www.marca.com/en/nfl/super-bowl/2024/02/11/65c8b78b46163f3aaa8b456d.html",
        "title": "Prince Harry won&#39;t attend Super Bowl as he prepares for Canada trip instead",
        "description": "Prince Harry surprised attendees at Thursday&#39;s NFL Honors in Las Vegas by presenting the Walter Payton NFL Man of the Year Award to Cameron Heyward. NFL Commissioner Roger Goodell"
    },
    {
        "url": "https://dailyhive.com/vancouver/harry-meghan-vancouver-where-to-visit",
        "title": "From one Brit to another, here&#39;s what I think Harry and <b>Meghan</b> should do in Vancouver",
        "description": "Prince Harry and Meghan Markle are set to visit Vancouver, and as a fellow Brit, I felt I should give some recommendations to the pair."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/11/meghan-jealous-envious-kate-ingrid-steward-royal/",
        "title": "Ingrid Seward: ‘I think <b>Meghan</b> must have been incredibly envious and then jealous of Kate’",
        "description": "The 76-year-old editor of Majesty magazine is a seasoned royal commentator – but Buckingham Palace never ceases to surprise her"
    },
    {
        "url": "https://www.hindustantimes.com/entertainment/taylor-swift-en-route-to-the-super-bowl-confirms-chiefs-owners-daughter-she-is-coming-101707634067312.html",
        "title": "Taylor Swift en route to the Super Bowl, confirms Chiefs owner&#39;s daughter: &#39;She is coming&#39;",
        "description": "Taylor Swift is confirmed to attend the Super Bowl, according to Gracie Hunt, daughter of the Kansas City Chiefs&#39; owner."
    },
    {
        "url": "https://www.thedailybeast.com/obsessed/the-rookie-is-now-one-of-the-most-watched-series-in-the-world",
        "title": "‘The Rookie’ Is Apparently One of the Most Watched Series in the World",
        "description": "As the Nathan Fillion-starring cop series enters its sixth season, new statistics about its popularity on streaming services hint that the series has way more fans than we thought."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863824/prince-harry-meghan-markle-move-back-uk",
        "title": "Prince Harry and <b>Meghan Markle</b> could &#39;fix image&#39; by returning to the UK for royal duties",
        "description": "EXCLUSIVE: Prince Harry and Meghan Markle could help turn around their image by returning to the Duke&#39;s home country and taking up their royal duties again, an expert has claimed."
    }
]