[
    {
        "url": "https://www.express.co.uk/news/royal/1851281/meghan-markle-memoir-demands-royal-book",
        "title": "<b>Meghan Markle</b> &#39;humiliated&#39; as publishers demand she submits memoir draft before payment",
        "description": "The Duchess of Sussex has been left red-faced as she faces a dilemma between keeping publishers happy and remaining private, it has been claimed."
    },
    {
        "url": "https://www.hellomagazine.com/tags/meghan-markle/132/",
        "title": "<b>Meghan Markle</b>, the Duchess of Sussex, News - Page 133",
        "description": "Discover all of the latest news and updates, including exclusive interviews from the UK, US and rest of the world - HELLO!"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/kate-middleton-bangs-hairstylist-tiktok-b2472345.html",
        "title": "Hairstylist reveals how Princess of Wales’ bangs never move",
        "description": "To further prove her point, the hairstylist posted a second video of her own curtain bangs as she put a blow dryer directly on her bangs both without and then with hairspray. Without hairspray they were blowing all over the place while hairspray largely prevented them from budging."
    },
    {
        "url": "https://uk.style.yahoo.com/crown-luther-ford-shares-text-204512266.html",
        "title": "“The Crown”&#39;s Luther Ford Shares Text Conversation That Inspired Him to Audition for Prince Harry Role",
        "description": "Luther Ford is looking back on a memorable 2023. In an Instagram post on New Year&#39;s Eve, the actor shared a carousel of images from throughout the year, including a screenshot of a text conversation that seems to have been the inspiration behind his audition to play teenage Prince Harry on The Crown."
    },
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-2023-wrap-up-royal-kids-8421434",
        "title": "Kate Middleton and Prince William&#39;s 2023 Wrap-Up Included Never-Before-Seen Clips of the Royal Kids",
        "description": "With 2023 in the rear-view mirror, Kate Middleton and her husband, Prince William, gave royal fans a quick recap of the year with a year-end roundup. And while even the most devoted royal followers will recognize many of the big moments from 2023,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-no-31792398.amp",
        "title": "<b>Meghan Markle</b> and Prince Harry have &#39;no chance of reconciling with the Royal Family&#39;",
        "description": "Prince Harry and Meghan Markle will not be able to mend their relationship with the Royal Family as an expert says 2024 will see &quot;the continuation of the huge void between them.&quot;"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/fashion-news/new-looks-lightweight-17-padded-28378303",
        "title": "New Look&#39;s &#39;lightweight&#39; £17 padded coat &#39;perfect&#39; for layering over jumpers and cardigans for transitioning from winter to spring months",
        "description": "&quot;A fab coat, so cosy and lightweight, love the fact the sleeves are quite long and come past my wrist, Really roomy, will easily get a thick jumper underneath. Lovely colour too, perfect for casual days out."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851226/meghan-markle-social-media-influencer-royal-family",
        "title": "<b>Meghan Markle</b> &#39;destined to be an &#39;influencer&#39; claims royal expert as 2024 plans shot down",
        "description": "It&#39;s rumoured that Meghan Markle is looking to work in several fields whether that be politics, acting or even lifestyle guru - but one royal expert is not so convinced."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-facing-31790880",
        "title": "<b>Meghan Markle</b> and Prince Harry are facing a &#39;make or break&#39; year as they look to &#39;step up&#39;",
        "description": "Prince Harry and Meghan Markle are reportedly planning to buckle down on their brand for the next twelve months, with the couple planning to &#39;get their game face on&#39; in 2024"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25224408/meghan-markle-couldnt-land-big-fish-career-makeover-kate/",
        "title": "<b>Meghan Markle</b> ‘couldn’t land the big fish’, author claims she’s failed at a career makeover as Kate’s popularity soars",
        "description": "MEGHAN Markle’s attempt at a career makeover failed in 2023, according to a royal author, and she “couldn’t land the big fish.” The Duchess of Sussex, 42, is said to have been"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25223592/meghan-harry-wont-get-redemption-kate-william-christmas/",
        "title": "<b>Meghan</b> &amp; Harry ‘WON’T get redemption in 2024’ after Kate &amp; Wills’ Christmas power move, claims royal author",
        "description": "MEGHAN Markle and Prince Harry won’t get the “year of redemption” they are hoping for in 2024, according to a royal author. The Duke and Duchess of Sussex are said to be planning to have a fresh"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/fashion-news/marks-spencers-slimming-29-dress-28376406",
        "title": "Marks and Spencer&#39;s &#39;slimming&#39; £29 dress looks like £400 version from designer brand loved by <b>Meghan Markle</b> and Kate Middleton",
        "description": "Marks and Spencer&#39;s Finery London Collared Button Detail Waisted Dress normally costs £59. However, the dress, which is an online exclusive and can&#39;t be found in stores, has been slashed to a far more budget-friendly price of £29 in the M&amp;S winter sale - a saving of £30."
    },
    {
        "url": "https://www.irishmirror.ie/news/world-news/meghan-markles-bridesmaid-dress-tailor-31785299",
        "title": "<b>Meghan Markle</b>&#39;s bridesmaid dress tailor lifts lid on row that made Charlotte cry",
        "description": "Meghan Markle, who married Prince Harry in May 2018, a ceremony for which bridesmaid dresses were tailored by Ajay Mirpuri, who has spoken out about Meghan&#39;s row with Kate Middleton at the time"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-harry-behind-wanted-31788268",
        "title": "<b>Meghan Markle</b> and Harry are &#39;behind where they wanted to be&#39; and hope for a &#39;much better&#39; 2024",
        "description": "Sources say Meghan Markle is &#39;frustrated at the lack of progress&#39; she&#39;s made in her career alongside her husband Prince Harry and fears &#39;disaster&#39; in the year ahead"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-prince-william-left-31787928.amp",
        "title": "King Charles and Prince William left &#39;hurt&#39; over <b>Meghan</b> and Harry&#39;s silence after Endgame attacks",
        "description": "The Sussexes have remained noticeably quiet after Omid Scobie released his bombshell Endgame biography in November which featured a number of shocking allegations against the senior members of the Royal Family."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-leave-montecito-will-do-what-royals-least-expect-2024-says-astrologer-1722489",
        "title": "Prince Harry To Leave Montecito, Will Do What Royals &#39;Least Expect&#39; in 2024, Says Astrologer",
        "description": "Frank, a former confidante and close friend of Princess Diana, said the 39-year-old &quot;feels restless and longing for a fresh start&quot;. This could mean &quot;upping sticks again with his family and doing what the royal family least expects&quot;."
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2926705/prince-louis-wardrobe-privilege/",
        "title": "Prince Louis Was Reportedly Given a Special Tradition-Breaking Wardrobe ‘Privilege’ &amp; We’re Reassessing Our Closet",
        "description": "At the time of the interview, Louis’ older brother Prince George, 10 was rocking shorts. And they are far from the first royals to do so. As with nearly everything related to the royal family, it’s a longstanding tradition. Prince William and Prince Harry were showing their kneecaps growing up too."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/02/65947a5d22601d56348b4586.html",
        "title": "&#39;<b>Meghan Markle</b> wants to be Queen&#39;",
        "description": "Meghan Markle&#39;s aspirations for a royal role reminiscent of a queen may not align with reality, according to insights from royal author Tom Bower. The 42-year-old former &quot;Suits&quot; ac"
    },
    {
        "url": "https://www.samaa.tv/208737261-meghan-markle-s-struggle-for-lucrative-deals-continues-amidst-royal-fallout",
        "title": "<b>Meghan Markle</b>&#39;s struggle for lucrative deals continues amidst royal fallout",
        "description": "Borkowski suggested that such public appearances indicate a strategic move to put herself on display for potential casting opportunities and bookings. &quot;That’s what Meghan’s been about,&quot; he remarked."
    },
    {
        "url": "https://www.yahoo.com/entertainment/kate-middletons-strategic-wardrobe-reportedly-181909171.html",
        "title": "Kate Middleton&#39;s Strategic Wardrobe Reportedly Avoids &#39;Hidden Agendas&#39; With This Royal Hot Topic",
        "description": "Kate Middleton’s wardrobe is always a hot topic of conversation, not only for the fashionable aspect of the equation, but also for the symbolic messages she sends through what she wears. A great example of this is the Wales family is often seen at major events in coordinating shades of blue,"
    },
    {
        "url": "https://people.com/prince-abdul-mateen-brunei-fiancee-engagement-photo-8421325",
        "title": "Prince Abdul Mateen of Brunei Shares First Photo of New Fiancée and Her Huge Engagement Ring!",
        "description": "Prince Abdul Mateen of Brunei and his fiancée Anisha Isa Kalebic are preparing to tie the knot in a lavish royal wedding next week."
    },
    {
        "url": "https://www.pinkvilla.com/trending/world/is-meghan-markle-planning-to-meet-with-king-charles-heres-what-we-know-1268980",
        "title": "Is <b>Meghan Markle</b> planning to meet with King Charles? Here&#39;s what we know",
        "description": "Meghan Markle seeks a meeting with King Charles to discuss unequal treatment in the Royal Family, citing concerns over differing rules."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144125-prince-harry-meghan-markle-blasted-for-pulling-pin-on-fun-grenade",
        "title": "Prince Harry, <b>Meghan Markle</b> blasted for pulling &#39;pin on fun grenade&#39;",
        "description": "UK comedian Simon Brodkin, who used to perform as Lee Nelson, has ridiculed Prince Harry and Meghan Markle during a live stand-up show.The Duke of Sussex was brutally mocked by the stand-up"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/news/priyanka-chopra-and-nick-jonas-get-cuddly-hug-each-other-on-cabo-vacay-couples-pool-pics-go-viral-1268974",
        "title": "Priyanka Chopra and Nick Jonas get cuddly, hug each other on Cabo vacay, couple’s pool PICS go viral",
        "description": "Priyanka Chopra and Nick Jonas jetted off to Cabo, Mexico with Madhu Chopra to bring in the New Year. After having a blast on NYE, the celebrity couple spent the entire day by the pool."
    },
    {
        "url": "https://nypost.com/2024/01/02/entertainment/meghan-markle-wants-to-be-queen-kate-middleton-has-everything-she-wants/",
        "title": "<b>Meghan Markle</b> wants to be queen: Kate Middleton ‘has everything she wants’",
        "description": "Royal author Tom Bower gave his take on the Duchess of Sussex’s longing to be back within the Firm — years after she left with husband Prince Harry."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-upcoming-career-plans-153239580.html",
        "title": "<b>Meghan Markle</b>&#39;s Upcoming Career Plans Reportedly Avoid &#39;Anything Royal&#39; After Tough 2023",
        "description": "Meghan Markle finally has 2023 behind after a year of challenges with the royal fallout from Prince Harry’s memoir, Spare, and the cancellation of the couple’s Spotify deal. In the year ahead, the Duchess of Sussex is looking to make her mark on Hollywood in a new way,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-rocky-relationship-netflix-2024-begins.html/",
        "title": "Prince Harry and <b>Meghan Markle</b> Have a ‘Rocky’ Relationship With Netflix as 2024 Begins",
        "description": "Is Prince Harry and Meghan Markle&#39;s relationship with Netflix rocky? A royal commentator weighs in on the their professional goals for 2024."
    },
    {
        "url": "https://omaha.com/news/collection_e91c05c4-98d8-5a1d-97c6-f2a7a1dd0525.html",
        "title": "10 reality shows that were hits in other countries before the US",
        "description": "OLBG found 10 reality shows that were hits in other countries before they became household names in the United States."
    },
    {
        "url": "https://www.btimesonline.com/articles/162994/20240102/prince-harrys-2024-astrological-forecast-points-to-major-life-changes.htm",
        "title": "Prince Harry&#39;s 2024 Astrological Forecast Points to Major Life Changes",
        "description": "As 2024 dawns, it&#39;s not just the stars that are aligning in an intriguing pattern for Prince Harry - it&#39;s his entire life. Astrologer Debbie Frank, once a confidante of Princess Diana, foresees a year of profound reflection and potential upheaval for the Duke of Sussex."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144091-meghan-markle-puts-herself-on-display-to-grab-lucrative-deals",
        "title": "<b>Meghan Markle</b> puts herself on ‘display’ to grab lucrative deals",
        "description": "Meghan Markle seemingly putting herself on display as several high-end brands turning their backs on the former Suits actress and her husband Prince Harry. In conversation with"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-always-broke-new-years-resolution-after-couple-drinks.html/",
        "title": "<b>Meghan Markle</b> Always Broke Her New Year’s Resolution After a ‘Couple of Drinks’",
        "description": "Meghan Markle always broke her New Year&#39;s resolution after a &#39;couple of drinks.&#39; She revealed her secrets in her lifestyle blog &#39;The Tig.&#39;"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/did-king-charles-meet-prince-harry-meghans-children-archie-and-lilibet-101704194690443.html",
        "title": "Did King Charles meet Prince Harry-<b>Meghan</b>&#39;s children Archie and Lilibet?",
        "description": "Prince Harry and Meghan Markle were evicted them from Frogmore Cottage last year as they were asked to vacate the property by King Charles."
    },
    {
        "url": "https://www.hindustantimes.com/author/ismat-tahseen-101704092907621",
        "title": "Ismat Tahseen",
        "description": "Read the latest articles by Ismat Tahseen on the trending topics, breaking news and top headlines at Hindustan Times."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-prince-william-left-31787928",
        "title": "King Charles and Prince William left &#39;hurt&#39; over <b>Meghan</b> and Harry&#39;s silence after Endgame attacks",
        "description": "The Sussexes have remained noticeably quiet after Omid Scobie released his bombshell Endgame biography in November which featured a number of shocking allegations against the senior members of the Royal Family."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/breaking-meghan-markle-unladylike-habits-fails-after-few-drinks-prince-harry-new-year-2-january-2024/",
        "title": "<b>Meghan Markle</b> pledged to give up ‘unladylike’ habits, but failed after ‘few drinks’",
        "description": "Meghan Markle previously revealed which &#39;unladylike&#39; habits she wanted to stop but failed after a &#39;few drinks&#39;."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/prince-harry-meghan-markle-wont-get-redemption-in-2024/news-story/cf3079029d1568787297b55f41b564c8",
        "title": "Prince Harry, <b>Meghan Markle</b> ‘won’t get redemption’ in 2024",
        "description": "Meghan Markle and Prince Harry won’t get the “year of redemption” they are hoping for in 2024, according to a royal author."
    },
    {
        "url": "https://www.btimesonline.com/articles/162988/20240102/prince-william-and-king-charles-grapple-with-fallout-from-endgame-allegations.htm",
        "title": "Prince William and King Charles Grapple with Fallout from &#39;Endgame&#39; Allegations",
        "description": "In the wake of the release of Omid Scobie&#39;s &quot;Endgame,&quot; the Royal Family, particularly Prince William and King Charles, have been subject to what has been termed &quot;poisonous attacks.&quot;"
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/royal-photographer-arthur-edwards-prince-harry-met-meghan-and-did-a-180-turnaround/K4JGDRT6UJEOXMNHNHZWWVEXYA/",
        "title": "Royal photographer Arthur Edwards: Prince Harry ‘met <b>Meghan</b> and did a 180 turnaround’",
        "description": "Harry’s bombshell memoir, Spare, hit shelves in January this year and featured huge criticisms of both the royal family and the British press. Edwards, who toured with the royal family for over 40 years - has spoken out about his negative experiences with the Duke and Duchess of Sussex before."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/oh-do-f-off-prince-harry-and-meghan-markle-mocked-by-comedian/video/650d57acc18cfb50cd23f3e3b5f37acf",
        "title": "‘Oh do f*** off’: Prince Harry and <b>Meghan Markle</b> mocked by comedian",
        "description": "Prince Harry and Meghan Markle have been mocked by English comedian Simon Brodkin. “I started off, I wanted to like them. They were making interesting points about racism and misogyny, but then they start calling each other H and M and I just thought, ‘Oh do f*** off’,” Mr Brodkin said."
    }
]