[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-harry-unlikely-rekindle-beckhams-31828407",
        "title": "<b>Meghan</b> and Harry &#39;unlikely&#39; to rekindle with the Beckhams after &#39;b****y furious&#39; call",
        "description": "Prince Harry and <b>Meghan Markle</b> are reportedly &quot;unlikely&quot; to reconcile their friendship with Victoria and David Beckham after an &quot;absolutely b****y furious&quot; phone call. Despite the pair sharing a strong friendship with the Beckhams in the past, it seems ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-four-31828044",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s &#39;four options&#39; for new home after neighbours &#39;sick of them&#39;",
        "description": "Meghan Markle and Prince Harry are reportedly planning to sell their sprawling family home in Montecito, California, and have a few options for where they could move next"
    },
    {
        "url": "https://uk.news.yahoo.com/gina-torres-says-suits-cast-230850053.html",
        "title": "Gina Torres says Suits cast do not have <b>Meghan Markle</b>’s number at Golden Globes 2024",
        "description": "Gina Torres says Suits cast do not have Meghan Markle’s number at Golden Globes 2024Variety Graham Norton has shared that disgraced Hollywood producer Harvey Weinstein was the worst guest he had on his BBC show. All I can think about is how shocked I would be witnessing this scene in real life."
    },
    {
        "url": "https://www.scmp.com/magazines/style/entertainment/article/3247411/inside-prince-mateens-upcoming-10-day-wedding-extravaganza-sultan-bruneis-hot-son-will-tie-knot",
        "title": "Prince Mateen of Brunei’s upcoming 10-day wedding extravaganza",
        "description": "The first royal wedding of the year is set to commence this Sunday, and it’s taking place in Brunei this time round – here’s what we know about Prince Abdul Mateen’s lavish bash"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/are-prince-harry-and-meghan-markle-expecting-their-third-child-exploring-the-truth-behind-latest-rumor-1269976",
        "title": "Are Prince Harry and <b>Meghan Markle</b> expecting their &#39;Third Child&#39;? Exploring the truth behind latest rumor",
        "description": "Harry and Meghan, the Duke and Duchess of Sussex, embrace parenthood with Archie and Lili, navigating privacy, philanthropy, and sparking speculation about a potential third child."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-snapped-hanging-out-31804642",
        "title": "Prince Harry snapped hanging out with new Hollywood pals without <b>Meghan Markle</b>",
        "description": "The Duke of Sussex was snapped alongside It&#39;s Always Sunny in Philadelphia stars Rob McElhenney and Glenn Howerton at a football match between Inter Miami CF and Los Angeles."
    },
    {
        "url": "https://www.btimesonline.com/articles/163109/20240107/prince-andrew-secludes-himself-following-epstein-documents-release.htm",
        "title": "Prince Andrew Secludes Himself Following Epstein Documents Release",
        "description": "Prince Andrew, Duke of York, has reportedly secluded himself following the release of court documents that have reignited the Jeffrey Epstein scandal."
    },
    {
        "url": "https://dailytimes.com.pk/1158713/prince-harry-says-he-and-meghan-markle-cant-keep-their-kids-safe-in-the-uk/",
        "title": "Prince Harry says he and <b>Meghan Markle</b> can’t keep their kids safe in the UK",
        "description": "Prince Harry’s top priority is his kids’ safety. That’s why the Duke of Sussex is pushing back against the Executive Committee for the Protection of Royalty and Public Figures’ (RAVEC) decision to revoke his automatic right to police protection when he and Meghan Markle visit the United Kingdom."
    },
    {
        "url": "https://www.btimesonline.com/articles/163105/20240107/prince-harry-meghan-markle-out-in-the-cold-sussexes-excluded-royal-reunions.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Out in the Cold as the Sussexes Excluded from Royal Reunions",
        "description": "Despite King Charles III&#39;s Christmas broadcast emphasizing tolerance and unity, the Sussexes found themselves conspicuously absent from the celebrations, reinforcing their estrangement."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852944/meghan-markle-new-book-warning",
        "title": "<b>Meghan Markle</b> sent dire warning over &#39;opening old wounds&#39; with new book",
        "description": "Meghan Markle has been dogged by speculation of an upcoming autobiography for months but she&#39;s been warned she will need to &#39;carefully&#39; consider her tone."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-may-revisit-suits-2024-just-not-way-might-think.html/",
        "title": "<b>Meghan Markle</b> May Revisit ‘Suits’ in 2024, Just Not in the Way Some Might Think",
        "description": "Rachel Zane, is that you? According to a report, Meghan Markle has already had &#39;discussions&#39; about a potential &#39;Suits&#39; reunion."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-markle-allegedly-looking-to-sell-their-11-million-california-home_art20673.html",
        "title": "Prince Harry and <b>Meghan Markle</b> allegedly looking to sell their £11 million California home",
        "description": "Prince Harry and Meghan Markel are allegedly planning to move their base again as they close to selling their £11 million California"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852916/prince-harry-meghan-markle-third-child-claims",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;third child&#39; claims in doubt after Duke&#39;s fears exposed",
        "description": "Despite being proud parents to two little ones, fans have often wondered whether Prince Harry and Meghan Markle will ever add another child to their family."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12935443/Disaster-strikes-Prince-Harrys-right-hand-man-Nacho-Figueras-slips-horse-polo-game-wife-Delfina-Blaquier-Magic-Millions.html",
        "title": "Disaster strikes Prince Harry&#39;s right hand man as Nacho Figueras slips from his horse during polo game with wife Delfina Blaquier at Magic Millions",
        "description": "They have played polo alongside one another in various matches over the years, and Nacho has become one of Harry and <b>Meghan Markle</b>&#39;s most vocal supporters, praising them in interviews. The father-of-four - dubbed the &#39;David Beckham of Polo&#39; - was also ..."
    },
    {
        "url": "https://uk.news.yahoo.com/why-prince-harrys-decision-over-103308360.html",
        "title": "Why Prince Harry&#39;s decision over Prince Archie and Princess Lilibet could upset King Charles",
        "description": "A royal commentator has claimed that Prince Harry’s children Prince Archie and Princess Lilibet won’t be returning to the UK for a long time."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/queens-out-character-comment-meghan-31825095",
        "title": "Queen&#39;s &#39;out of character&#39; comment on <b>Meghan Markle</b> just weeks before her death",
        "description": "It has been claimed that &quot;everybody&#39;s eyebrows hit the ceiling&quot; after the late Queen Elizabeth II made the &#39;out of character&#39; remark."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12918227/Princess-doppelganger-Angelina-Jolie.html",
        "title": "Inspired by red carpet royalty? How &#39;Style Sister&#39; Kate has turned into a doppelganger of... Angelina Jolie!",
        "description": "Her outfits vanish from the high street the moment she appears. But some are starting to asking if the Princess of Wales has a secret inspiration of her own - in the shape of Hollywood royalty."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/meghan-harrys-neighbours-sick-them-28404803",
        "title": "<b>Meghan</b> and Harry&#39;s neighbours &#39;sick of them&#39; as couple &#39;close to selling £11million home&#39;",
        "description": "<b>Meghan Markle</b> and Prince Harry are &#39;never seen&#39; by neighbours at their £11million US mansion, with some locals said to be &#39;sick of hearing about them&#39;. The couple are rumoured to be close to selling their Montecito pad in favour of a cheaper home in Malibu."
    },
    {
        "url": "https://www.yahoo.com/entertainment/duchess-sussex-meghan-markle-called-130012172.html",
        "title": "Duchess of Sussex <b>Meghan Markle</b> Called The ‘Most Difficult Woman To Satisfy’ By Royal Expert",
        "description": "A royal expert has called out the Duchess of Sussex, Meghan Markle, tagging her as the “most difficult woman to satisfy.” It comes in the wake of claims that Meghan was demanding answers from King Charles III about why she is treated differently from other royals."
    },
    {
        "url": "https://www.newsweek.com/king-charles-popularity-worst-polling-prince-harry-meghan-markle-1857394",
        "title": "King Charles&#39; Popularity Crisis Is Monarchy&#39;s Worst in Decades",
        "description": "Main image, King Charles III is seen in Dubai on November 30, 2023. Inset, Prince Harry and <b>Meghan Markle</b> are pictured at the Invictus Games in Düsseldorf, Germany, in September 2023. Harry and <b>Meghan</b>&#39;s bombshell allegations against the royals in 2021 ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/meghan-markles-mother-steps-in-to-support-her-and-prince-harry-during-tough-times/articleshow/106613932.cms",
        "title": "<b>Meghan Markle</b>&#39;s mother steps in to support her and Prince Harry during &#39;tough times&#39;",
        "description": "Meghan Markle&#39;s mother, Doria Ragland, has moved into the guesthouse on the grounds of Prince Harry and Meghan&#39;s Montecito mansion. The 67-year-old yo"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145563-meghan-markle-seeks-negative-publicity-for-popularity-says-expert",
        "title": "<b>Meghan Markle</b> seeks negative publicity for popularity: says expert",
        "description": "Meghan Markle and Prince Harry should make fun of themselves to improve their public image this year suggested by PR expert Ryan McCormick.The couple&#39;s strained relationship with the Royal"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/will-prince-harry-and-meghan-bring-archie-and-lilibet-to-the-uk-in-2024-expert-shares-thoughts_art20670.html",
        "title": "Will Prince Harry and <b>Meghan</b> bring Archie and Lilibet to the UK in 2024? Expert shares thoughts",
        "description": "Prince Harry and Meghan Markle rarely visit the UK anymore, even less so with their children, Archie and Lilibet. Will we be seeing the Sussex family in the UK in"
    },
    {
        "url": "https://www.timesnownews.com/world/your-son-king-charles-nervously-responds-to-plea-to-bring-back-prince-harry-to-uk-article-106611970",
        "title": "&#39;Your Son!&#39;: King Charles Nervously Responds to Plea to Bring Back Prince Harry To UK",
        "description": "Despite the strained relationship, Prince Harry attended the coronation of his father, King Charles, at Westminster Abbey in June, joining other family members., World News, Times Now"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145585-meghan-markle-prince-harry-warned-of-severe-outcomes-if-royal-rift-grows",
        "title": "<b>Meghan Markle</b>, Prince Harry warned of severe outcomes if royal rift grows",
        "description": "Meghan Markle and Prince Harry have been warned of severe outcomes if their rift with the senior members of the royal family grows in 2024.As per The Express, PR expert Mark Borkowski said that"
    },
    {
        "url": "https://www.ndtv.com/world-news/king-charles-heartbreaking-reply-when-asked-about-prince-harrys-return-to-england-4816469",
        "title": "King Charles&#39; Heartbreaking Reply When Asked About Prince Harry&#39;s Return To England",
        "description": "King Charles gave an unexpected reply to a man when he was asked about bringing back Prince Harry to the United Kingdom."
    },
    {
        "url": "https://www.ok.co.uk/royal/royals-welcoming-sarah-ferguson-suggests-31806339",
        "title": "Royals welcoming Sarah Ferguson suggests &#39;all is not lost with Harry and <b>Meghan</b>&#39;",
        "description": "EXCLUSIVE: Sarah Ferguson was welcomed back to Sandringham with the Royal Family, 32 years later - a royal expert said this gesture shows hope of &quot;reconciliation&quot; for Prince Harry"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-and-harrys-big-move-as-third-child-is/news-story/53e081c509e147b5998bef1ba2a4f7d1",
        "title": "<b>Meghan</b> and Harry’s big move amid talk of a ‘third child’",
        "description": "Meghan Markle and Prince Harry are making secret moves as their family looks set to change in 2024."
    },
    {
        "url": "https://www.watoday.com.au/lifestyle/life-and-relationships/is-a-person-speaking-their-truth-different-from-the-truth-it-s-complicated-20240104-p5ev73.html",
        "title": "Is a person speaking ‘their truth’ different from the truth? It’s complicated",
        "description": "The latest therapy-speak term to be endorsed by celebrities, speaking “your truth” may be true for you, but chances are it’s not for other people."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markles-mom-moves-in-with-her-and-prince-harry-amid-tough-times-101704554743982.html",
        "title": "<b>Meghan Markle</b>&#39;s mom moves in with her and Prince Harry: &#39;Amid tough times…&#39;",
        "description": "Meghan Markle&#39;s mother Doria Ragland has reportedly moved in with her daughter and son-in-law Prince Harry in Montecito, United States, it was reported. The Duchess of Sussex&#39; mother has shifted to the couple&#39;s California home to help them through “tough times”."
    },
    {
        "url": "https://popculture.com/celebrity/news/meghan-markle-reportedly-wants-answers-over-king-charles-rule-changes-toward-prince-harry/",
        "title": "<b>Meghan Markle</b> Reportedly &#39;Wants Answers&#39; Over King Charles&#39; Rule Changes Toward Her and Prince Harry",
        "description": "<b>Meghan Markle</b> is once again at the center of rumors surrounding her relationship with The Royal Family. The former Suits star is reportedly not happy with the different &quot;rules&quot; that have been placed on her and husband Prince Harry. According to the New ..."
    }
]