[
    {
        "url": "https://www.newstalkzb.co.nz/news/entertainment/source-reveals-if-kate-and-meghan-will-ever-reconcile/",
        "title": "Princess Kate and <b>Meghan Markle</b> are unlikely to reconcile according to inside source",
        "description": "Four years after Prince Harry and Meghan Markle resigned from all royal duties, a friend of Princess Kate has revealed whether there is any chance of recon"
    },
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-moving-on-8420117",
        "title": "Kate Middleton and Prince William Have Reportedly“Moved on” From Rift With Prince Harry and <b>Meghan Markle</b>",
        "description": "After years of royal family drama, sources say Kate Middleton and Prince William, the Prince and Princess of Wales, are moving on. Get the details here."
    },
    {
        "url": "https://www.lbc.co.uk/news/explained/biggest-royal-family-stories-2023/",
        "title": "From Spare to King Charles&#39; Coronation: Here are the biggest royal stories of 2023",
        "description": "It has been a tumultuous year for the royal family, the first the Firm has had to endure without Queen Elizabeth II at the helm."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849591/princess-kate-moved-on-meghan-markle-drama",
        "title": "Princess Kate &#39;has moved on&#39; from <b>Meghan Markle</b> drama, friend reveals",
        "description": "The Princess of Wales has her eyes on the future as she leaves Meghan and Prince Harry in the rear-view, a friend has said."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/adorable-friendship-formed-between-prince-31757740",
        "title": "Adorable friendship formed between Prince William and Zara Tindall&#39;s kids",
        "description": "The Prince and Princess of Wales&#39; children have developed a loving friendship with Zara and Mike Tindall&#39;s kids."
    },
    {
        "url": "https://uk.movies.yahoo.com/kate-middleton-meghan-markle-embraced-171036348.html",
        "title": "How Kate Middleton and <b>Meghan Markle</b> Embraced 2023’s Style Trends: From Silent Luxury to Statement Shoulders",
        "description": "Both women were seen wearing monochrome outfits, quiet luxury-inspired pieces and trending knitwear while attending events, appearing at speaking engagements and walking the red carpet. However, while the sisters-in-law were both praised for their respective style choices, each approached their looks with vastly different lenses."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/what-awaits-the-royal-family-in-2024-a-psychic-answers_art20578.html",
        "title": "What awaits the Royal Family in 2024? A psychic answers",
        "description": "As 2023 comes to a close, many choose to look back but it is also the chance to look forward. This is what this psychic has done for the Royal Family. Let’s see what they have to"
    },
    {
        "url": "https://www.dailymail.co.uk/sport/football/article-12903843/Paddy-McGuinness-Jaeger-Prince-Harry-date-spot-Fernandos-Soccer-Aid-bash-TV-star-Stick-Football-Brazilian-legends-Greggs.html",
        "title": "Paddy McGuinness recalls how Jager-drinking Prince Harry asked to go to Take Me Out date spot Fernando&#39;s during swanky Soccer Aid bash... as TV star tells Stick to Football how ...",
        "description": "The television host and comedian appeared on the Stick to Football Show alongside Gary Neville, Jamie Carragher, Roy Keane and Ian Wright."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849340/royal-family-live-prince-harry-meghan-markle-christmas",
        "title": "Royal Family LIVE: Prince Harry and <b>Meghan Markle</b> dealt blow as royals in &#39;united front&#39;",
        "description": "Prince Harry and Meghan Markle have been shown in exact opposition to the Royal Family in the UK as they struggle to claw back."
    },
    {
        "url": "https://uk.movies.yahoo.com/kate-middleton-moved-drama-prince-140000656.html",
        "title": "Kate Middleton Has &#39;Moved on&#39; from Drama with Prince Harry and <b>Meghan Markle</b>, Says Friend (Exclusive)",
        "description": "As future queen, royal author Valentine Low tells PEOPLE that Kate &quot;has the longterm interests of the monarchy and royal family at heart&quot;"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harrys-relationship-120500916.html",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s Relationship Timeline",
        "description": "Prince Harry and Meghan Markle &#39;s love story is the stuff of real-life fairytales. Girl meets prince — prince falls in love with girl; girl becomes princess. However, Meghan and Harry&#39;s happily-ever-after didn&#39;t exactly end as one might expect."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-looks-completely-different-31754651",
        "title": "<b>Meghan Markle</b> looks completely different wearing racy Santa outfit in throwback picture",
        "description": "The Duchess Of Sussex looked completely different to how fans are used to seeing her as she was seen laughing and smiling in a Santa fancy dress outfit in a throwback picture"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12903229/Inside-Prince-Williams-bromance-Mike-Tindall-Future-King-live-vicariously-fun-loving-ex-rugby-star-royal-expert-claims.html",
        "title": "Inside Prince William&#39;s &#39;bromance&#39; with Mike Tindall: Future King can &#39;live vicariously&#39; through fun-loving ex-rugby star, royal expert claims",
        "description": "Speaking to The Telegraph , Royal biographer Ingrid Seward, editor in chief of Majesty magazine, said that MIke&#39;s &#39;sportsman camaraderie&#39; appeals to William who was &#39;once a wild boy&#39;."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/inside-harry-meghans-christmas-california-31753660",
        "title": "Inside Harry and <b>Meghan</b>&#39;s Christmas in California from &#39;magnificent&#39; tree to new rituals",
        "description": "The Duke and Duchess of Sussex last spent the festive period with the Royal Family on the Sandringham Estate in 2018 and are now spending the festive period in California"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/psychic-who-predicted-covid-expects-31754085",
        "title": "Psychic who &#39;predicted Covid&#39; expects &#39;heartache&#39; for <b>Meghan</b> and royal scandal in 2024",
        "description": "Nicolas Aujula expects another stressful year for the Firm and a huge milestone for Donald Trump, while he believes &#39;extreme, far-right politics will make a dark comeback&#39; in 2024."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25141424/royal-family-predictions-2024-psychic/",
        "title": "Astrologer tells what’s in store for the royals in 2024 &amp; claims what will happen between ‘rifting’ Kate &amp; <b>Meghan</b>",
        "description": "FROM rows and interviews, to a seemingly never-ending stream of events, 2023 has been full of surprises for the royals. But as we’re leaving the year behind and heading into 2024, a psychic"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/the-best-memes-and-moments-of-2023_uk_65856e79e4b03e698a12de53",
        "title": "The Best Memes And Moments Of 2023",
        "description": "From Rihanna’s Super Bowl performance to girl dinner and girl math, the year brought us dozens of hilarious, fun and relatable things to obsess over on the internet."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-huge-31752313",
        "title": "<b>Meghan Markle</b> and Prince Harry’s huge but minimalist Christmas tree at Montecito mansion",
        "description": "Prince Harry and Meghan Markle spent Christmas at their £11million nine-bedroom home in Montecito, California this year"
    },
    {
        "url": "https://www.btimesonline.com/articles/162910/20231228/prince-harrys-stand-for-security-in-the-uk-sparks-royal-controversy.htm",
        "title": "Prince Harry&#39;s Stand for Security in the UK Sparks Royal Controversy",
        "description": "As the legal tangle over Prince Harry&#39;s right to police protection in the UK continues, the Duke of Sussex has reportedly taken a firm stance, asserting that he won&#39;t return without the security arrangements he believes he&#39;s entitled to."
    },
    {
        "url": "https://pagesix.com/2023/12/27/royal-family/kate-middleton-prince-william-have-moved-on-from-prince-harry-meghan-markle-drama/",
        "title": "Kate Middleton, Prince William have ‘moved on’ from Prince Harry, <b>Meghan Markle</b> drama: ‘They aren’t looking back’",
        "description": "The Prince and Princess of Wales’ strained relationship with Meghan and Harry began in 2020 when the latter famously resigned from their royal duties."
    },
    {
        "url": "https://www.btimesonline.com/articles/162908/20231228/kate-middletons-tactful-silence-amid-meghan-markle-and-prince-harrys-critiques.htm",
        "title": "Kate Middleton&#39;s Tactful Silence Amid <b>Meghan Markle</b> and Prince Harry&#39;s Critiques",
        "description": "Von Walderdorff posited that, from her perspective, there is no direct attack from Kate toward Meghan and Harry, but rather a consistent adherence to the rules and expectations of her royal position."
    },
    {
        "url": "https://nypost.com/2023/12/27/entertainment/mike-tindall-has-filled-the-void-prince-william-lost-in-harrys-absence/",
        "title": "Mike Tindall has ‘filled the void’ Prince William lost in Harry’s absence",
        "description": "Silverman wrote for the Telegraph how Tindall has “filled the void” of Harry’s absence, becoming someone that William can “confide” in. Additionally, the sportsman is seen as an uncle-type figure to the Prince of Wales’ kids, Prince George, 10, Prince Louis, 5, and Princess Charlotte, 8."
    },
    {
        "url": "https://people.com/kate-middleton-surprises-other-parents-mom-move-exclusive-8419405",
        "title": "Kate Middleton Surprises Other Parents with This Relatable Mom Move at Birthday Parties (Exclusive)",
        "description": "Kate Middleton, the Princess of Wales, is raising the next generation of royals as mom to Prince George, Princess Charlotte and Prince Louis — and knows just how to welcome their friends"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2923867/prince-william-mike-tindall-brother-relationship/",
        "title": "Prince William May Have Found a ‘Brotherly Relationship’ in This Royal Family Member",
        "description": "Prince William doesn’t seem to be giving much thought to his feud with Prince Harry, because he and Kate Middleton are focused on their royal path. But that doesn’t mean that the Prince of Wales hasn’t formed a new,"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/who-is-prince-harry-and-meghan-markles-son-archie-does-he-have-a-title-details-101703691526513.html",
        "title": "Who is Prince Harry and <b>Meghan Markle</b>&#39;s son Archie? Does he have a title? Details",
        "description": "Archie is entitled to the &quot;courtesy title&quot; of Earl of Dumbarton but Prince Harry and Meghan Markle chose not to give him a courtesy title at that time."
    },
    {
        "url": "https://www.yahoo.com/entertainment/kate-middleton-prince-william-reportedly-151804844.html",
        "title": "Kate Middleton &amp; Prince William Reportedly ‘Aren’t Looking Back’ After All the Royal Drama",
        "description": "As 2023 comes to a close, Prince William and Kate Middleton are ready to put the past behind them and move into the new year with their eyes on the future of the British royal family. The Prince and Princess of Wales took on new responsibilities,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-gave-prince-archie-one-special-christmas-gift-he-uses-every-day.html/",
        "title": "Queen Elizabeth Gave Prince Archie This 1 Special Christmas Gift He Asks For Every Day",
        "description": "Queen Elizabeth once gave her great-grandson Prince Archie a special Christmas gift. According to Prince Harry, he asks for it every day."
    },
    {
        "url": "https://www.zoomtventertainment.com/celebrity/taylor-swift-reportedly-refused-to-perform-at-king-charles-coronation-gave-a-pass-to-meghan-markles-podcast-know-why-entertainment-news-celebrity-news-article-106326983",
        "title": "Taylor Swift Reportedly Refused To Perform At King Charles&#39; Coronation, Gave A Pass To <b>Meghan Markle</b>&#39;s Podcast. Know Why",
        "description": "Renowned singer Taylor Swift has reportedly refused to perform at King Charles Coronation and also gave a pass to Meghan Markle&#39;s podcast. Is there a tension fuming between Taylor Swift and the Royals? Scroll down to read the details."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-swipe-brits-royal-christmas-prince-george-1855735",
        "title": "<b>Meghan Markle</b>&#39;s Swipe at Brits Undermined by Royal Christmas",
        "description": "Meghan Markle&#39;s account of hugs being &quot;really jarring for a lot of Brits&quot; has been challenged after pictures of Prince George being embraced by an in-law at Christmas emerged."
    },
    {
        "url": "https://people.com/kate-middleton-moved-on-drama-prince-harry-meghan-markle-says-friend-exclusive-8419365",
        "title": "Kate Middleton Has &#39;Moved on&#39; from Drama with Prince Harry and <b>Meghan Markle</b>, Says Friend (Exclusive)",
        "description": "Kate Middleton, the Princess of Wales, is focused on the future with Prince William and not looking back on drama with Prince Harry and Meghan Markle, a friend of Kate&#39;s tells PEOPLE in this week&#39;s exclusive cover story."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142243-meghan-markle-to-choose-acting-over-prince-harry",
        "title": "<b>Meghan Markle</b> to choose acting over Prince Harry?",
        "description": "Meghan Markle and Prince Harry have been told to brace themselves for the challenges awaiting them in 2024. The current year has proved to be a rollercoaster for the Duke and Duchess of Sussex."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/why-did-taylor-swift-allegedly-refuse-to-perform-at-king-charles-coronation-and-appear-on-meghan-markles-podcast-1267847",
        "title": "Why did Taylor Swift allegedly refuse to perform at King Charles’ coronation and appear on <b>Meghan Markle</b>’s podcast?",
        "description": "If there is tension fuming between Taylor Swift and the Royals, the world seems clueless about it. Read on to know more as we divulge into details of the singer&#39;s actions."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/uk/sorry-harry-wrong-number-did-uk-pm-rishi-sunak-playfully-tease-prince-harry-in-his-christmas-video/articleshow/106325965.cms",
        "title": "Sorry Harry, wrong number: Did UK PM Rishi Sunak playfully tease Prince Harry in his Christmas video?",
        "description": "British PM Rishi Sunak&#39;s Christmas video raised eyebrows as he humorously depicted a solo holiday at 10 Downing Street. His quip on the phone, &quot;Harry, youve got the wrong number,&quot; sparked speculation among viewers,"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/major-suits-spinoff-revealed-seems-130000956.html",
        "title": "Major ‘Suits’ Spinoff Update Revealed—and It Seems We’re Headed to L.A.",
        "description": "Now that we know a Suits spinoff is officially in the works, we can’t help but wonder what the new series (which takes place in the same universe) will look like. So are we headed back to the Big Apple?"
    },
    {
        "url": "https://globalnews.ca/news/10172119/bc-international-headlines-2023/",
        "title": "10 British Columbia stories that made international headlines in 2023",
        "description": "Prince Harry and <b>Meghan Markle</b> watched the Vancouver Canucks take on the San Jose Sharks. The pair attended the match ahead of the Invictus Games, an international multi-sport event for wounded, injured and sick armed forces personnel, which the duke ..."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/uk/king-charles-and-kate-middleton-forge-unique-bond-surpassing-ties-with-prince-william-suggests-new-report/articleshow/106325647.cms",
        "title": "King Charles and Kate Middleton forge unique bond, surpassing ties with Prince William, suggests new report",
        "description": "A report unveils intriguing dynamics within the royal family, spotlighting King Charles&#39;s notably closer relationship with Kate Middleton compared to his son, Prince William. This revelation emerges amid growing observations of Kate&#39;s pivotal role in fostering ties and mediating between the royals."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/south/best-south-indian-film-of-2023-results-lokesh-kanagaraj-thalapathy-vijays-action-thriller-leo-bags-the-title-1267848",
        "title": "Best South Indian Film of 2023 Results: Lokesh Kanagaraj, Thalapathy Vijay&#39;s action thriller Leo bags the title",
        "description": "Pinkvilla had asked fans to vote for their favorite film of 2023, from a list of 13 nominees from the four industries. Fans picked Lokesh Kanagaraj and Thalapathy Vijay’s film Leo as their favorite."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142223-meghan-markle-issued-warning-over-heartache-and-decline-in-2024",
        "title": "<b>Meghan Markle</b> issued warning over ‘heartache’ and ‘decline’ in 2024",
        "description": "After a tumultuous year that Prince Harry and Meghan Markle had between their personal and business life, the coming year also appears a little glum. Nicolas Aujula, the 37-year-old therapist and astrologer who reportedly foretold Covid outbreak, the Black Lives Matter movement and the Sussexes’ Oprah interview, made some predictions for 2024."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/celebrities/2023/12/27/658bfdb8268e3e9f708b4573.html",
        "title": "Famous astrologer predicts issues in Prince Harry and <b>Meghan Markle</b>&#39;s relationship due to acting return",
        "description": "Astrologer Susan Miller predicts challenges for the business partnership between Prince Harry and Meghan Markle in 2024, attributing it to Markle&#39;s desire to return to Hollywood. M"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/one-word-confirms-meghan-and-harry-nightmare/news-story/aba530ddc37349eb004df66ce3f1f0fb",
        "title": "One word confirms <b>Meghan</b> and Harry nightmare",
        "description": "With that one word it confirmed one fact: This has been Meghan Markle and Prince Harry’s very own annus horribilis. The best thing we can say, as 2023 limps to a close, is, at least nothing caught on fire."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/king-charles-subtly-shuts-down-one-of-prince-harrys-biggest-accusations-against-him/",
        "title": "King Charles subtly shuts down one of Prince Harry’s biggest accusations against him",
        "description": "On Boxing Day, royal fans were treated to a special documentary following King Charles during the first year of his reign – giving people unprecedented access behind-the-scenes as the royals prepared for a historic Coronation."
    },
    {
        "url": "https://nypost.com/2023/12/27/entertainment/meghan-markles-desire-to-go-back-to-acting-will-test-business-relationship-with-prince-harry-top-astrologer-predicts/",
        "title": "<b>Meghan Markle</b>’s desire ‘to go back to acting’ will test business relationship with Prince Harry, top astrologer predicts",
        "description": "The Duke and Duchess of Sussex’s relationship could experience some hardships in the coming year as Markle sets her sights on an acting comeback."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/what-prince-harrys-wife-meghan-markle-has-said-about-christmas-with-royals-101703609182975.html",
        "title": "What Prince Harry&#39;s wife <b>Meghan Markle</b> has said about Christmas with royals",
        "description": "Meghan Markle has rarely spoken about her royal Christmas experiences even though she has attended the Sandringham events twice in 2017 and 2018. She opened about spending Christmas with the royal family in the third episode of her Harry &amp; Meghan Netflix docuseries which was released in December 2022."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/celebrities/2023/12/27/658bbfe7268e3e703e8b4583.html",
        "title": "Why Taylor Swift turn down offers from King Charles III and <b>Meghan Markle</b>?",
        "description": "Taylor Swift&#39;s recent decisions to decline offers to perform at King Charles III&#39;s coronation and appear on Meghan Markle&#39;s podcast have sparked controversy and speculation. Despit"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-unusual-appearance-endgame-book-launch-analyzed-body-language-expert-deliberately-low-key.html/",
        "title": "<b>Meghan Markle</b>’s ‘Unusual’ Appearance Before ‘Endgame’ Book Launch, Analyzed by a Body Language Expert: ‘Deliberately Low-Key’",
        "description": "Meghan Markle moderated a discussion about &#39;The After&#39; just weeks before &#39;Endgame.&#39; Here&#39;s a body lanaguage expert&#39;s analysis."
    }
]