[
    {
        "url": "https://www.outlookindia.com/international/us/british-royal-christmas-2023-unwrapping-traditions-and-turmoil-news-338317",
        "title": "British Royal Christmas 2023: Unwrapping Traditions and Turmoil",
        "description": "This Christmas emerges as a chapter of transformation in the British Royal family. Amidst tensions and transitions, the Windsors prepare to navigate the festive season, crafting a narrative that intertwines the old and the new."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-and-kate-middleton-feud-deepens-over-christmas-day/news-story/2ae06465cbd871b041c4387c62834189",
        "title": "<b>Meghan Markle</b> and Kate Middleton feud deepens over Christmas Day",
        "description": "Strangely it’s proving hard for William and Kate to miraculously forget having been repeatedly thrown under the (double decker) bus by the Sussexes and over the course of years and all done across multiple forms of media including streaming, broadcast TV and print – and all in front of a global audience."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/seven-signs-prince-harry-meghan-31741800.amp",
        "title": "Seven signs Prince Harry and <b>Meghan Markle</b>&#39;s new life in America is in trouble",
        "description": "In the case of Prince Harry, 39, and <b>Meghan Markle</b>, 42, it&#39;s safe to say that 2023 hasn&#39;t been the easiest of years. As they continue to try and put down roots in the US and establish themselves as money-making entities outside of the British establishment ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/signs-prince-harry-meghan-markles-31742086",
        "title": "Signs Prince Harry and <b>Meghan Markle</b>&#39;s new life in America is in trouble after difficult year",
        "description": "The Duke and Duchess of Sussex&#39;s 2023 has been plagued with drama, accusations and public mockery - but these seven incidents have been the most memorable low points for the former working Royals"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25152079/royal-racism-row-meghan-quizz-oath-archie/",
        "title": "Twist in ‘royal racism’ row as <b>Meghan Markle</b> could be quizzed under oath about ‘Archie’s skin colour’ claim",
        "description": "THE Duchess of Sussex could be questioned under oath about the identity of the so-called “royal racists”. Lawyers want to quiz Meghan over “family matters” as part of sister Samantha Markle’s"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markles-christmas-present-made-31740735",
        "title": "<b>Meghan Markle</b>&#39;s Christmas present made the Queen &#39;burst out laughing&#39;",
        "description": "The late Queen Elizabeth II would head the huge gatherings at the Royal Family’s lavish estate in Sandringham over Christmas, and in 2017, Prince Harry broke royal protocol by inviting his then-fiance"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848714/prince-harry-meghan-markle-royal-family-christmas",
        "title": "Prince Harry and <b>Meghan Markle</b> warned &#39;it&#39;s huge&#39; if they dodge Sandringham Christmas",
        "description": "It&#39;s not known if King Charles extended an invite to the pair - but their response will be very important, an insider has said."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510021/meghan-markle-generous-gift-dusseldorf-following-christmas-holiday/",
        "title": "<b>Meghan Markle</b>&#39;s generous pre-Christmas gift revealed following secret holiday",
        "description": "Meghan Markle has honoured a pledge she made during the Invitus Games as the Duchess of Sussex made a generous donation of €4,600 to the TrebeCafé, also known as the Diakonie Düsseldorf, alongside a donation of severla boxes of cosmetic products."
    },
    {
        "url": "https://www.hellomagazine.com/homes/510014/princess-beatrice-edoardo-mapelli-mozzi-ethereal-christmas-tree/",
        "title": "Princess Beatrice&#39;s husband Edoardo Mapelli Mozzi shows off ethereal Christmas tree",
        "description": "It is no surprise that the royals opt for stylish meets traditional when it comes to Christmas decor. After all, you can&#39;t go small when decorating a palace. Princess Beatrice&#39;s husband interior designer and property developer Edoardo Mapelli Mozzi owns Banda Property and has taken to his business&#39; Instagram to show off his latest masterpiece – a stunning Christmas tree."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1843409/meghan-markle-christmas-cocktail-healthy",
        "title": "How to make <b>Meghan Markle</b>&#39;s favourite Christmas cocktail that&#39;s surprisingly &#39;healthy&#39;",
        "description": "This delicious cocktail recipe is good enough for royalty and perfect for to make for family and friends over the Christmas period."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-could-land-leading-31739483.amp",
        "title": "<b>Meghan Markle</b> could land leading role in hit movie that has link to Princess Diana",
        "description": "Meghan Markle was an actress before becoming a Duchess, and now it seems that the mother-of-two could eventually ease herself back into her old career, if reports are true"
    },
    {
        "url": "https://uk.news.yahoo.com/harry-meghan-spend-christmas-102253743.html",
        "title": "How Harry and <b>Meghan</b> will spend Christmas this year",
        "description": "It is unlikely the Sussexes will fly back to the UK to spend Christmas at Sandringham this year, delaying any chance of a royal reconciliation"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12895249/Meghan-Markle-Prince-Harry-say-rosy-critics-beg-differ.html",
        "title": "Four years after Megxit, the Sussexes say everything is rosy across the pond - but as figures show their Archewell Foundation is low on donations, critics beg to differ",
        "description": "Judging by the slick, minute-long video released this month by the Duke and Duchess of Sussex &#39;s Archewell Foundation, the past year has been nothing short of a triumph."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/prince-harry-meghan-markle-face-31739274.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> face lonely Christmas with &#39;plans to win Charles over&#39;",
        "description": "As the rest of the Royal Family begin to get together for their Christmas celebrations, two people will be noticeably absent from the festivities."
    },
    {
        "url": "https://www.thesun.co.uk/tvandshowbiz/25137164/jodie-marsh-neighbours-farm-boyfriend-animals/",
        "title": "ASBO neighbours scream ‘sl*g’ over the fence and won’t stop trolling me – they hate my new career, says Jodie Marsh",
        "description": "She recently slammed former &#39;party pal&#39; Omid Scobie - who has made headlines with his book about Prince Harry and <b>Meghan Markle</b>, Endgame - and recalls many other run-ins with huge Hollywood A-listers during her heyday. She says: “I&#39;ve met Beyonce ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-seen-130000705.html",
        "title": "Prince Harry And <b>Meghan Markle</b> Seen On A Pre-Christmas Vacation With Their Kids",
        "description": "Prince Harry and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet, visiting Zapotal, Nandayure and Guanacaste."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-christmas-card-best-worst-b2468727.html",
        "title": "The best and worst royal Christmas cards over the years",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-reveals-one-christmas-31718791",
        "title": "<b>Meghan Markle</b> reveals one Christmas present Archie wants that she refuses to buy",
        "description": "The Duchess of Sussex recently revealed that her four-year-old son has taken an interest in a new hobby and has asked for some very expensive equipment to pursue it."
    },
    {
        "url": "https://www.instyle.com/meghan-markle-turtleneck-top-get-the-look-amazon-8419262",
        "title": "<b>Meghan Markle</b> Just Wore Kate Middleton’s Go-to Winter Basic",
        "description": "Meghan Markle wore a brown fitted turtleneck top, a classic winter style Kate Middleton often wears. We found eight similar styles you can shop at Amazon, starting at $15."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markle-missed-31742164",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;missed off&#39; King Charles&#39; Christmas tradition",
        "description": "Prince Harry and <b>Meghan Markle</b> &quot;might not be included&quot; in King Charles III&#39;s Christmas tradition, according to reports. The Duke and Duchess of Sussex, who stepped down as senior royals in 2020 and moved to the States, have rarely returned to the UK since ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/harry-meghan-biographer-omid-scobie-31741639",
        "title": "Harry and <b>Meghan</b> biographer Omid Scobie branded &#39;toxic&#39; by reality star",
        "description": "Omid, who originally began his career on Heat magazine reportedly used to operate in the same circles as Jodie prior to becoming a huge fan and “cheerleader” of <b>Meghan Markle</b> following her rise to royal fame. However, in a scathing rant, Jodie has hit ..."
    },
    {
        "url": "https://www.usmagazine.com/shop-with-us/news/ill-be-shining-all-2024-in-these-bestselling-huggie-earrings/",
        "title": "I’ll Be Shining All 2024 in These Bestselling Huggie Earrings",
        "description": "Accessories are fashion staples. I&#39;ll be shining all 2024 in these Pavoi huggie hoop earrings available on Amazon."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/who-is-the-swedish-royal-family-exploring-their-lineage-amid-recent-royal-christmas-event-1267196",
        "title": "Who is the Swedish royal family? Exploring their lineage amid recent royal Christmas event",
        "description": "Will 2024 be <b>Meghan Markle</b> and Prince Harry&#39;s year? An insider reveals why new year &#39;will be the year of redemption&#39; for royal couple Tejasswi Prakash buys expensive gift for herself; Karan Kundrra says, ‘Itne mein Range Rover aa jati’ Mouni Roy’s ..."
    },
    {
        "url": "https://www.livemint.com/news/world/brand-deals-dry-up-for-meghan-markle-prince-harry-s-wife-blames-royal-family-s-vendetta-reports-11703317045650.html",
        "title": "Brand deals dry up for <b>Meghan Markle</b>; Prince Harry’s wife blames Royal Family’s ‘vendetta’: Reports",
        "description": "Meghan Markle faces career hurdles as major brands express reluctance to associate with her and Prince Harry due to potential risk to their ties with the Royal Family."
    },
    {
        "url": "https://torontosun.com/news/world/sussex-to-be-them-was-2023-worst-year-yet-for-harry-meghan",
        "title": "SUSSEX TO BE THEM: Was 2023 worst year yet for Harry, <b>Meghan</b>?",
        "description": "From poorly received projects and axed entertainment deals to an eviction and a high-profile court case against a British tabloid, 2023 has not been kind to Prince Harry and Meghan Markle. It wasn’t all bad, but if 2020 was a roller-coaster ride for the couple, 2023 saw the royals fall pretty far."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2923272/prince-harry-meghan-markles-family-traditions-christmas/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>’s Low-Key Christmas Shows How Important Their Family Traditions Are",
        "description": "Prince Harry and <b>Meghan Markle</b> are setting new Christmas traditions for the family now that they are firmly embedded in their Montecito, California community. While there was some unconfirmed chatter about a possible Sandringham invitation from King ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/prince-harry-feels-lonely-after-relocating-to-us-claims-royal-expert/articleshow/106239119.cms",
        "title": "Prince Harry feels &#39;lonely&#39; after relocating to US, claims royal expert",
        "description": "Prince Harry is missing the royal family after moving to Montecito, California in 2020 but his wife Meghan Markle is unwilling to make amen."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-death-stare-forgot-camera-event-mother-prince-harry-goes-viral.html/",
        "title": "<b>Meghan Markle</b>’s Death Stare When She Forgot She Was on Camera at an Event With Her Mother and Prince Harry Goes Viral",
        "description": "That video of the &quot;death stare&quot; Meghan Markle gave her mother is going viral again, and some can&#39;t stop talking about the resurfaced clip."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-royal-family-news-prince-harry-news-101703341326982.html",
        "title": "‘Found herself in a complicated situation when…’: Royal expert on <b>Meghan Markle</b>",
        "description": "Meghan Markle and Prince Harry stepped back from their royal roles in 2020, choosing to live a more private life in the United States. A royal expert said that Meghan Markle&#39;s departure from the royal family proved to be a “loss” for the monarchy."
    },
    {
        "url": "https://www.btimesonline.com/articles/162832/20231223/royal-concerns-rise-over-prince-williams-alleged-battle-with-the-bottle.htm",
        "title": "Royal Concerns Rise Over Prince William&#39;s Alleged Battle with the Bottle",
        "description": "In the grand corridors of Buckingham Palace, a troubling narrative is emerging about Prince William&#39;s alleged battle with alcohol, which insiders claim is being fueled by his ongoing feud with Prince Harry and Meghan Markle."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141143-meghan-markle-receives-support-from-uvalde-victims-father-after-pr-stunt-backlash",
        "title": "<b>Meghan Markle</b> receives support from Uvalde victim&#39;s father after &#39;PR stunt&#39; backlash",
        "description": "Meghan Markle, who was accused of using 2022 Uvalde School tragedy as a PR stunt by commentators and her half-brother Thomas Markle Jr, has been defended by a victim&#39;s father."
    },
    {
        "url": "https://www.btimesonline.com/articles/162829/20231223/king-charles-stands-firm-against-prince-harrys-holiday-plea-amid-ongoing-royal-rift.htm",
        "title": "King Charles Stands Firm Against Prince Harry&#39;s Holiday Plea Amid Ongoing Royal Rift",
        "description": "King Charles has reportedly rebuffed an attempt by Prince Harry to secure a holiday invite to Sandringham Castle, amidst escalating tensions and accusations."
    },
    {
        "url": "https://nypost.com/2023/12/23/entertainment/prince-harry-is-very-lonely-living-in-california-with-meghan-markle-truly-misses-his-family-expert/",
        "title": "Prince Harry is ‘very lonely’ living in California with <b>Meghan Markle</b>, ‘truly misses his family’: expert",
        "description": "Prince Harry is reportedly missing his family since making the move to Montecito, Calif. in 2020 — but wife Meghan Markle doesn’t want to make amends with the Royals. Royal expert Kinsey Schofield made the claim in an interview with GB News, saying she believes The Duke of Sussex, 39, is “lonely” living so far from home."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141135-meghan-markle-laughs-at-lonely-harry-when-duke-cries-missing-his-family",
        "title": "<b>Meghan Markle</b> laughs at &#39;lonely&#39; Harry when Duke cries missing his family?",
        "description": "Prince Harry and Meghan Markle, who stepped down as senior working royals in 2020 and relocated to the US, are reportedly at loggerheads after being snubbed by King Charles. The Duke and Duchess of Sussex, who had a plan to spend Christmas at Sandringham with the royal family, have reportedly not been invited by the monarch."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/queen-elizabeth-really-thought-kate-130000547.html",
        "title": "What Queen Elizabeth Really Thought of Kate Middleton’s Hair",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.thestar.com/entertainment/carley-fortune-had-a-surreal-year-the-toronto-authors-meet-me-at-the-lake-sold/article_64d51aca-9920-11ee-b4d4-57ec47951de9.html",
        "title": "Carley Fortune had a surreal year. The Toronto author&#39;s &#39;Meet Me at the Lake&#39; sold millions. Then Prince Harry and <b>Meghan</b> came calling",
        "description": "The Toronto author&#39;s second novel was optioned by Prince Harry and Meghan Markle, but Fortune is taking her newfound fame in stride."
    },
    {
        "url": "https://news.yahoo.com/harry-meghan-spend-christmas-102253743.html",
        "title": "How Harry and <b>Meghan</b> will spend Christmas this year",
        "description": "It is unlikely the Sussexes will fly back to the UK to spend Christmas at Sandringham this year, delaying any chance of a royal reconciliation"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/2023-setbacks-for-meghan-and-harry-will-2024-be-their-year-of-redemption-101703329137503.html",
        "title": "2023 setbacks for <b>Meghan</b> and Harry: Will 2024 be their &#39;year of redemption&#39;?",
        "description": "Harry and Meghan believe 2024 will be a &#39;year of redemption,&#39; with Meghan reportedly turning down multiple work offers and Harry being in &#39;extremely high demand.&#39; US Weekly suggests that the Duke and Duchess are contemplating a move to Los Angeles with their children,"
    },
    {
        "url": "https://www.newsweek.com/everything-meghan-markle-said-christmas-royals-sandringham-1852006",
        "title": "Everything <b>Meghan Markle</b> Said About Christmas With the Royals",
        "description": "&quot;I remember so vividly the first Christmas at Sandringham,&quot; Meghan told viewers of her Netflix docuseries in 2022."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/meghan-markle-unique-last-minute-gift-reccomendations-for-christmas/",
        "title": "<b>Meghan Markle</b> has some unique last minute gift recommendations for Christmas",
        "description": "In a resurfaced post from her now defunct blog The Tig, Meghan Markle shared her unique last minute gift recommendations for Christmas and they could come in handy as we panic buy the last of our gifts before the big day."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/breaking-the-regal-runway-the-best-royal-fashion-moments-of-2023-23-december-2023/",
        "title": "The regal runway: The best royal fashion moments of 2023",
        "description": "From the glamorous suits of Kate Middleton to the trend-setting choices of Meghan Markle, these are the best royal fashion moments."
    },
    {
        "url": "https://www.foxnews.com/entertainment/british-royals-exchange-slightly-rude-christmas-gifts-whoopie-cushions",
        "title": "British royals exchange ‘slightly rude’ Christmas gifts, including whoopee cushions and toilet seats",
        "description": "Several royal experts told Fox News Digital that the royal family likes to exchange silly gifts on Christmas Eve. Queen Elizabeth II was &quot;tickled pink&quot; by the tradition."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/meghan-markle-reveals-celebrating-christmas-with-royals-gave-her-one-thing-she-always-wanted/",
        "title": "<b>Meghan Markle</b> reveals how celebrating Christmas with the Royal Family gave her the one thing she’d ‘always wanted’",
        "description": "Prince Harry and Meghan Markle may be gearing up for a quiet Christmas alone this year, but Meghan has previously gushed over her first Christmas celebration spent with the Royal Family and revealed how it gave her the one thing she’d ‘always wanted’ growing up."
    },
    {
        "url": "https://tryhardguides.com/archie-to-meghan-markle-crossword-clue/",
        "title": "Archie, to <b>Meghan Markle</b> Crossword Clue",
        "description": "We have the answer for Archie, to Meghan Markle crossword clue that will help you solve the crossword puzzle you&#39;re working on!"
    },
    {
        "url": "https://uk.news.yahoo.com/reason-archie-lilibet-wont-opening-095140060.html",
        "title": "The reason Archie and Lilibet won&#39;t be opening their presents on Christmas Day",
        "description": "But before they could even think about presents this year, Prince Harry and <b>Meghan Markle</b> took Archie and Lilibet on a secret pre-Christmas getaway with ‘immaculate sand’ and almost went unnoticed – the perfect break for some winter sun!"
    },
    {
        "url": "https://www.pinkvilla.com/tv/news/engagement-to-mehendi-decoding-shrenu-parikhs-outfits-that-she-wore-for-her-big-day-with-akshay-mhatre-1267136",
        "title": "Engagement to Mehendi, decoding Shrenu Parikh’s outfits that she wore for her big day with Akshay Mhatre",
        "description": "Shrenu Parikh and Akshay Mhatre tied the knot on December 21st. Let&#39;s decode the actress&#39;s outfits for her nuptials with Akshay Mhatre."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-harry-faces-brutal-snub-as-hes-iced-out-of-royal-documentary/news-story/37ff0a8bb1d2b6c9cc81b6b44db7ba13",
        "title": "Prince Harry faces brutal snub as he’s iced out of royal documentary",
        "description": "Prince Harry has faced yet another brutal snub — being cut out of a new royal documentary for the BBC. The documentary, set to air over Christmas, will feature some key members of the royal family reflecting over the Queen’s death, as well as sharing their thoughts on King Charles’ first year on the throne."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-have-had-the-worst-year-of-their-lives.html/",
        "title": "<b>Meghan Markle</b> and Prince Harry Have ‘Stamp of Losers on Their Forehead’ After ‘Worst Year’ Says Royal Commentator: ‘They Failed Hard’",
        "description": "Throughout 2023, Prince Harry and <b>Meghan Markle</b> have tried to pick up the pieces of their shattered reputation. As the months passed, they fell over and over with one professional misstep after another. This led a royal commentator to claim this was the ..."
    },
    {
        "url": "https://www.seacoastecho.com/news/national/meghan-markles-talent-agency-struggling-to-win-duchess-brand-deals---head-scratching/video_2a86fae2-10c8-5647-8a24-bfca1026e9bb.html",
        "title": "<b>Meghan Markle</b>&#39;s talent agency STRUGGLING to win Duchess brand deals - &#39;head scratching!&#39;",
        "description": "Royal and Showbiz Reporter Kinsey Schofield has revealed that <b>Meghan Markle</b>&#39;s talent agency, WME, are &quot;struggling&quot; to secure deals for the royals, due to the &quot;animosity&quot; surrounding them and their rift with the monarchy.Schofield told host Patrick Christys ..."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/crown-princess-victoria-sweden-shared-160300275.html",
        "title": "Crown Princess Victoria of Sweden Shared A Dreamy 2023 Holiday Card",
        "description": "The royal holiday greetings just keep coming! In the last few weeks, King Charles and Camilla, Prince William, Kate Middleton, and their kids, <b>Meghan Markle</b> and Prince Harry, Monaco&#39;s Prince Albert and Princess Charlene, and the Spanish royal family have ..."
    }
]