[
    {
        "url": "https://www.thesun.co.uk/video/uncategorized/25949664/prince-harry-meghan-markle-try-winter-sports-on-special-canada-invictus-trip-in-first-appearance-since-rebrand/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> try winter sports on ‘special’ Canada Invictus trip in first appearance since rebrand",
        "description": "Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on WhatsApp (Opens in new window) Prince Harry &amp; <b>Meghan Markle</b> try winter sports on ‘special’ Canada Invictus trip in first appearance since ..."
    },
    {
        "url": "https://people.com/meghan-markle-sleeveless-turtleneck-8581969",
        "title": "<b>Meghan Markle</b>&#39;s Sleeveless Turtleneck Is the Between-Season Staple You May Not Own Yet — Get One from $13",
        "description": "Meghan Markle released a new portrait announcing of her new podcast deal with Lemonada Media, and she wore a sleeveless turtleneck. Jennifer Aniston is also a fan of this between-season closet staple,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-says-critics-should-32128962",
        "title": "Prince Harry says &#39;critics should focus on King&#39;s health&#39; amid latest royal titles dispute",
        "description": "Prince Harry thinks people should be more concerned with King Charles III&#39;s health following his cancer diagnosis as opposed to what he and Meghan Markle included on their new website"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1866880/meghan-markle-prince-harry-skiing-canada",
        "title": "<b>Meghan Markle</b> and Prince Harry hit the slopes on Valentine&#39;s Day after landing in Canada",
        "description": "Prince Harry and Meghan Markle have been pictured on the slopes in Canada as they prepare to launch the first edition of a winter Invictus Games. The Sussexes are seen holding hands and smiling in the picturesque setting of Whistler, British Columbia at an Invictus event called &#39;One Year to Go&#39;."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/breaking-meghan-harrys-children-new-32128561",
        "title": "<b>Meghan</b> and Harry&#39;s children get new surname as couple abandon 64-year royal tradition",
        "description": "Prince Harry and Meghan Markle have not only given their new site a rebrand - but their children&#39;s names have had a glossy make-over too. The duo have made waves with their big launch of their site."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513454/prince-harry-meghan-markle-canada-invictus-games-day-one/",
        "title": "Watch Prince Harry hit the slopes as <b>Meghan Markle</b> cheers on during day one of Canada trip – live updates",
        "description": "Harry was pictured in a thick black jacket with a pair of dark jeans and brown winter snow shoes, topped off with a beanie that covered his ginger hair. Meghan, meanwhile, wore a stylish white full ski suit with a large tan puffer overcoat and high-top ski boots, pairing it with a black beanie as well."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1866874/meghan-markle-prince-harry-escape-vancouver-cancada",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s escape to Canada is what they’ve been ‘needing’",
        "description": "Harry and Meghan updated their website, changed the name to  everyone got mad at them and they got on a plane and hightailed it to Canada."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25945354/prince-harry-meghan-markle-special-canada-trip/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> beam as they kick off ‘special’ Canada trip in first appearance since rebrand",
        "description": "PRINCE Harry and Meghan Markle have kicked off their Canada trip with a glitzy photo call in the first appearance since their rebrand. The Duke and Duchess of Sussex jetted off to Vancouver to"
    },
    {
        "url": "https://www.nme.com/news/music/reprezent-radio-sends-out-funding-plea-to-keep-broadcasting-3587488",
        "title": "Reprezent Radio sends out funding plea to keep broadcasting",
        "description": "Reprezent Radio has sent out a funding plea to continue operating, citing government funding cuts. Find out how you can donate here."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/513482/meghan-markle-valentines-day-outfit-canada/",
        "title": "<b>Meghan Markle</b> dons cozy snow day outfit for Valentine&#39;s Day outing with Prince Harry",
        "description": "Looking sublime in a winter fit by her husband&#39;s side, Meghan&#39;s unmistakable elegance was clear as she paired a white wool CO sweater with matching Sorel jeans and an off-white puffer coat, topped off with brown fur-lined ski boots from Sorel and a black Burberry beanie."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/16/",
        "title": "Prince Harry updates — <b>Meghan Markle</b> to launch new podcast in major online rebrand as Sussexes branded ‘hypocritical’",
        "description": "PRINCE Harry and Meghan Markle have been branded “hypocritical” after launching a new website which prominently features their royal titles. Harry and Meghan this week launched"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/meghan-markle-prince-harry-royal-website-b2496382.html",
        "title": "<b>Meghan</b> defends new Sussex.com website as critics claim she and Harry ‘cashing in’ on royal links",
        "description": "The Duchess of Sussex has defended the rebranding of her and Prince Harry ’s website as Sussex.com after critics claimed the couple were cashing in on their royal links despite having quit as working royals."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-and-meghan-surname-32127238.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;change children&#39;s surnames&#39; in surprise &#39;rebrand&#39; move",
        "description": "Prince Harry and Meghan Markle have reportedly changed their children&#39;s surnames in surprise &#39;rebrand&#39; move, where Prince Archie and Princess Lilibet will now be known differently"
    },
    {
        "url": "https://www.standard.co.uk/news/world/meghan-markle-prince-harry-new-website-designers-sussex-royal-b1139215.html",
        "title": "<b>Meghan Markle</b> praises &#39;talented&#39; designers who launched new website after criticism",
        "description": "Meghan Markle has defended the “talented team” behind her new website following a spate of criticism. The Duchess of Sussex and her husband, Prince Harry, launched their new website earlier this week. Their previous Archewell site now automatically redirects to “Sussex.com”, which consistently refers to the couple by their official royal titles."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-heres-why-the-duchess-wears-three-wedding-rings_art21140.html",
        "title": "<b>Meghan Markle</b>: Here’s why the Duchess wears three wedding rings",
        "description": "Have you ever spotted the Duchess of Sussex wearing three wedding bands? There&#39;s a reason behind and all three rings have a meaning. Here’s why she does"
    },
    {
        "url": "https://graziadaily.co.uk/celebrity/news/meghan-harry-sussex-website/",
        "title": "<b>Meghan</b> And Harry Come Out ‘All Guns Blazing’ Amidst Royal Crisis",
        "description": "Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, stepped out in Canada at an event for Harry’s Invictus Games ‘One Year to Go’ celebrations, amidst fresh Royal rifts."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-harry-statement-website-32124657",
        "title": "<b>Meghan Markle</b> issues statement as she and Prince Harry face backlash over latest move",
        "description": "After Meghan Markle and Prince Harry launched their new website, Sussex.com, Meghan has shared a statement via Canadian digital agency Article, who she has worked with many times"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-meghan-markle-harry-cancer-diagnosis-b2496271.html",
        "title": "<b>Meghan Markle</b> responds to website backlash as King Charles continues cancer treatment - updates",
        "description": "King Charles returned from the capital to Sandringham after having his latest bout of cancer treatment and was pictured smiling with the Queen as he arrived at Clarence House. The Duke and Duchess flew into Vancouver from Santa Barbara after a shock relaunch of their website from Archewell to Sussex.com, honouring their royal roots."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meet-daniel-julez-j-smith-203246810.html",
        "title": "Meet Daniel Julez J. Smith Jr., Beyoncé’s Nephew and Runway Model",
        "description": "Smith Jr., son of Solange Knowles, debuted as a model at the Luar fall 2024 show during New York Fashion Week."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harrys-website-151154509.html",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s New Website Has a Tie to Her Former Lifestyle Blog, The Tig",
        "description": "Before meeting Prince Harry, Meghan created her lifestyle blog The Tig in 2014 as a place to share various aspects of her life and the things that inspire her — in particular, food and travel. The name is inspired by Tignanello wine, which she told Tory Daily is synonymous with “getting it.”"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-cozy-230317415.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Cozy Up in Canada on Valentine&#39;s Day for Invictus Games Countdown",
        "description": "The Duke and Duchess of Sussex have arrived at the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations"
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/princess-kate-open-to-reconciling-with-harry-not-meghan",
        "title": "Princess Kate is reportedly &#39;open to reconciling&#39; with Harry, but not so much with <b>Meghan</b>",
        "description": "Though somewhat estranged from the rest of the royals since his and Meghan Markle &#39;s departure to the U.S. in 2020, Prince Harry has succeeded in paving the way towards reconciliation with his father King Charles — particularly given that the King is currently undergoing treatment for a recent cancer diagnosis."
    },
    {
        "url": "https://www.lbc.co.uk/news/meghan-markle-issues-statement-responds-to-criticism-new-sussex-website/",
        "title": "<b>Meghan</b> breaks silence following criticism over new Sussex website in rare statement",
        "description": "But again, like her husband, there is no mention of her time as a working royal. Prince Harry, <b>Meghan Markle</b> on stage for Global Citizen Concert 2021, Central Park, New York, NY September 25, 2021. Picture: Alamy Harry and <b>Meghan</b>&#39;s previous website ..."
    },
    {
        "url": "https://www.ladbible.com/meghan-markle/pages/0",
        "title": "<b>Meghan Markle</b>",
        "description": "The latest <b>Meghan Markle</b> news and breaking stories from LADbible. Exclusive and up to date coverage giving you the news you want. From cold cases and documentaries to current events, we have all the latest true crime news and stories."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13083011/Duchess-Sussex-breaks-silence-defend-new-Sussex-com-site-rebrand-criticism.html",
        "title": "<b>Meghan</b> breaks her silence to defend &#39;talented team&#39; behind couple&#39;s new Sussex.com site who also built her defunct lifestyle blog The Tig and Archewell after facing rebrand ...",
        "description": "<b>Meghan Markle</b> and Prince Harry&#39;s &#39;provocative&#39; decision to relaunch their Archewell website, the umbrella name for all their philanthropic and business endeavours, with Sussex.com had sparked accusations that they were trying to be &#39;more Royal&#39;."
    },
    {
        "url": "https://metro.co.uk/2024/02/14/meghan-markle-breaks-silence-controversial-sussex-com-rebrand-20280069/?ico=trending-module_author_gergana-krasteva_item-0",
        "title": "<b>Meghan</b> issues rare statement over controversial Sussex.com rebrand",
        "description": "Meghan Markle has broken her silence after reclaiming her Royal title on the new Sussex.com site. Prince Harry and his wife launched the new website that uses their official Sussex title in what was seen as a strategic move to reconnect with their audience."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markles-exploitative-32121751.amp",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;exploitative&#39; new website sparks fury after royals not consulted",
        "description": "Prince Harry and <b>Meghan Markle</b> have launched a new website boasting their links to the Royal family - four years after quitting their roles to seek &#39;financial freedom&#39;. Prince Harry and <b>Meghan Markle</b> have been in the spotlight for kick-starting a new ..."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-announces-major-podcast-151600332.html",
        "title": "<b>Meghan Markle</b> announces major new podcast deal",
        "description": "The Duchess of Sussex has announced a new podcast deal that will see her host a future series. In a news post and accompanying portrait shared to <b>Meghan</b> and Prince Harry’s recently revamped Sussex.com website, the duchess is seen smiling brightly and ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/14/meghan-harrys-first-post-sussex-com-20277199/?ico=trending-module_author_sarah-hooper_item-2",
        "title": "<b>Meghan</b> and Harry’s first post on new Sussex website",
        "description": "<b>Meghan Markle</b> and Prince Harry have made their first post on their new rebranded website. In what is seen as a strategic move to reconnect with their audience, the Duke and Duchess of Sussex launched a new website earlier this week, using their official ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-raises-eyebrows-unusual-32120401.amp",
        "title": "<b>Meghan Markle</b> raises eyebrows with unusual name change on website in massive nod to royals",
        "description": "The Duke and Duchess of Sussex launched their new website this week and have sparked fury over the prominent use of their royal titles but that&#39;s not the only questionable detail on the page."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-signed-podcast-deal-110221771.html",
        "title": "<b>Meghan Markle</b> Has Signed a New Podcast Deal 8 Months After Spotify Canceled Their Partnership",
        "description": "<b>Meghan Markle</b> is back, baby! After laying low for several months, the Duchess of Sussex has finally announced her next career move, and she&#39;s diving back into the world of podcasting. Eight months after her deal with Spotify fell through, <b>Meghan</b> has signed ..."
    },
    {
        "url": "https://www.glamourmagazine.co.uk/article/meghan-markle-podcast-lemonada-media",
        "title": "<b>Meghan Markle</b> is back in the podcast game, baby",
        "description": "Less than a year after breaking up up with Spotify, <b>Meghan Markle</b> has a new podcast bestie: Lemonada Media. The Duchess of Sussex, whose popular but short-lived Archetypes podcast lived for a one-and-done season on Spotify exclusively, has signed a new ..."
    },
    {
        "url": "https://goss.ie/featured/meghan-markle-breaks-her-silence-on-her-and-prince-harrys-rebrand-370416",
        "title": "<b>Meghan Markle</b> breaks her silence on her and Prince Harry’s ‘rebrand’",
        "description": "<b>Meghan Markle</b> has broken her silence on her and Prince Harry’s new rebrand. The Duke and Duchess of Sussex launched a new version of their website this week, Sussex.com. Their previous website, Archewell, now automatically redirects to the Sussex.com ..."
    },
    {
        "url": "https://www.tatler.com/article/meghan-markles-majestic-podcast-comeback-exclusive-with-lemonada-media",
        "title": "<b>Meghan Markle</b>’s majestic podcast comeback? Exclusive insights into her dynamic series with Lemonada Media",
        "description": "<b>Meghan Markle</b> has revealed her return to the podcasting world with a new series under the wings of Lemonada Media, a prominent American audio company. <b>Meghan</b> expressed her pride in collaborating with Lemonada, a female-founded company renowned for its ..."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/shes-not-a-feminist-shes-a-meghanist-megyn-kelly-unleashes-on-prince-harry-and-meghan-markles-new-website/news-story/45d91e1d54368dd08393127aaefca212",
        "title": "&#39;She’s not a feminist, she&#39;s a Meghanist&#39;: Megyn Kelly unleashes on Prince Harry and <b>Meghan Markle</b>&#39;s new website",
        "description": "American media personality Megyn Kelly has chastised Prince Harry and Meghan Markle for using their royal name as part of their rebranded website launch."
    },
    {
        "url": "https://www.usmagazine.com/celebrity-news/news/prince-harry-and-meghan-markle-celebrate-valentines-day-in-canada/",
        "title": "Prince Harry and <b>Meghan Markle</b> Hold Hands During Valentine’s Day Outing in Canada",
        "description": "Prince Harry and Meghan Markle opted for a casual but cozy Valentine’s Day as they wandered Canada hand in hand. The couple were photographed holding hands on Wednesday, February 14, while out and about in Whistler, Canada."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/gb-news-patrick-christys-shares-bombshell-claim-harry-and-meghans-commercialising-of-the-royal-brand-might-be-illegal/news-story/bd7b88d845d547ce3243cadb56dc525e",
        "title": "GB News&#39; Patrick Christys shares bombshell claim Harry and <b>Meghan</b>&#39;s commercialising of the royal brand might be illegal",
        "description": "GB New presenter Patrick Christys has suggested the use of royal branding for Prince Harry and Meghan Markle&#39;s new website Sussex.com could be illegal."
    },
    {
        "url": "https://www.winnipegfreepress.com/arts-and-life/life/2024/02/14/prince-harry-and-meghan-markle-in-whistler-b-c-for-invictus-games-training-camp",
        "title": "Prince Harry and <b>Meghan</b> in Whistler, B.C., for Invictus Games training camp",
        "description": "It was a love-in in Whistler, B.C., as Prince Harry and his wife Meghan, the Duchess of Sussex, attended Invictus Games training sessions a year before Canada is set to host"
    },
    {
        "url": "https://theprovince.com/news/local-news/photos-prince-harry-and-meghan-markle-spend-valentines-day-in-whistler",
        "title": "Photos: Prince Harry and <b>Meghan Markle</b> spend Valentine&#39;s Day in Whistler",
        "description": "Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, chat with participants in the Invictus Games One Year to go Winter Training Camp in Whistler on Feb. 14, 2024. Phot"
    },
    {
        "url": "https://nypost.com/2024/02/14/entertainment/prince-harry-and-meghan-markle-spend-valentines-day-kicking-off-invictus-games-2025/",
        "title": "Prince Harry and <b>Meghan Markle</b> spend Valentine’s Day kicking off Invictus Games 2025",
        "description": "Prince Harry and Meghan Markle spent Valentine’s Day together at the Invictus Games 2025’s Winter Training Camp in Canada. The estranged royals, who recently unveiled their new “self-serving” Sussex.com website, bundled up for the visit Wednesday to brave the frigid temperatures of Whistler, British Columbia."
    },
    {
        "url": "https://ca.news.yahoo.com/meghan-markle-prince-harry-cozy-230317415.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Cozy Up in Canada on Valentine&#39;s Day for Invictus Games Countdown",
        "description": "The Duke and Duchess of Sussex have arrived at the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations"
    },
    {
        "url": "https://sg.style.yahoo.com/meghan-markle-kicks-off-three-224700823.html",
        "title": "<b>Meghan Markle</b> Kicks Off Three-Day Canada Trip in a Cozy Cream Outfit",
        "description": "The Duke and Duchess of Sussex are in British Columbia to celebrate one year until the Invictus Games Vancouver Whistler 2025."
    },
    {
        "url": "https://www.spokesman.com/stories/2024/feb/14/meghan-markle-to-host-new-podcast-for-lemonada/",
        "title": "<b>Meghan Markle</b> to host new podcast for Lemonada",
        "description": "Meghan Markle, the Duchess of Sussex, will host a new podcast for the network. In addition, Lemonada will pick up Markle’s “Archetypes,” in which she chats with high-profile women about shattering stereotypes. The program was Spotify’s most popular show when it debuted in August 2022. Markle and her husband, Prince Harry, left Spotify last year."
    },
    {
        "url": "https://www.foxnews.com/entertainment/meghan-markle-defends-website-designers-taking-heat-using-royal-titles",
        "title": "<b>Meghan Markle</b> defends website designers after taking heat for using royal titles",
        "description": "Meghan Markle is sharing more on her storied relationship with Article, the digital agency handling her Sussex website, amid backlash from the public."
    },
    {
        "url": "https://dailyhive.com/vancouver/harry-meghan-vancouver-feels",
        "title": "&quot;Couldn&#39;t care less&quot;: How Vancouver feels about Harry and <b>Meghan</b> visit",
        "description": "The Duke and Duchess Prince Harry and Meghan will be visiting Vancouver for the Invictus Games, but how do residents feel about it?"
    },
    {
        "url": "https://news.yahoo.com/lionel-richie-diana-ross-headline-205440891.html",
        "title": "Lionel Richie and Diana Ross headline Fool in Love festival in Inglewood",
        "description": "Headliners include Lionel Richie and Diana Ross. <b>Meghan Markle</b>, Duchess of Sussex, to launch new podcast Other big names set to hit the stage are Chaka Khan, Smokey Robinson, Gladys Knight, The Isley Brothers, Al Green, Santana, Charlie Wilson, Kool and ..."
    },
    {
        "url": "https://uk.news.yahoo.com/admitted-sucker-valentines-day-meghan-160012633.html",
        "title": "How Admitted &#39;Sucker for Valentine&#39;s Day&#39; <b>Meghan Markle</b> Is Spending the Holiday with Prince Harry",
        "description": "The Duchess of Sussex previously said her perfect Valentine&#39;s Day would be spent &quot;in Paris&quot; — but she&#39;s somewhere else this year!"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-says-im-fan-28631893",
        "title": "<b>Meghan Markle</b> says &#39;I&#39;m a fan&#39; amid new website rebrand criticism",
        "description": "The Duke and Duchess of Sussex have rebranded their website - and it seems Meghan Markle knew who should design it."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-issues-statement-new-32123584.amp",
        "title": "<b>Meghan Markle</b> issues statement on new website amid rebrand criticism",
        "description": "Meghan Markle has quietly issued a new statement after the Duchess and Prince Harry relaunched their website with a new URL, &lt;a target=&quot;_blank&quot; rel=&quot;noopener&quot; href=&quot; amid criticism it trades off their"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/meghan-markle-issues-statement-web-32124122",
        "title": "<b>Meghan Markle</b> issues statement on website after rebrand criticism",
        "description": "The Duke and Duchess of Sussex have rebranded their website - and it seems Meghan Markle knew who should design it."
    },
    {
        "url": "https://www.cowichanvalleycitizen.com/trending-now/royal-couple-in-whistler-for-invictus-games-valentine-day-7318049",
        "title": "Royal couple in Whistler for Invictus Games Valentine Day",
        "description": "Prince Harry and <b>Meghan Markle</b> leave St Paul’s Cathedral in London, Friday, June 3, 2022. The Duke and Duchess of Sussex are scheduled to spend Valentine’s Day in Whistler, B.C., this year, attending a training camp one year ahead of the 2025 Invictus ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-snubs-close-pal-32121694",
        "title": "<b>Meghan Markle</b> snubs close pal Serena Williams in new Lemonada podcast announcement",
        "description": "Meghan Markle has announced her unexpected return to the podcasting world in a partnership with Lemonada, after she and Prince Harry were axed from Spotify last year"
    },
    {
        "url": "https://metro.co.uk/2024/02/14/harry-meghan-courting-trouble-launching-new-sussex-website-20278513/?ico=metro-posts_article_whats-trending-now",
        "title": "Harry and <b>Meghan</b> ‘courting trouble with the Palace’ after launching Sussex website",
        "description": "The Duke and Duchess of Sussex have been accused of &#39;trying have it both ways&#39; by promoting their royal titles."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/meghan-markle-nod-diana-new-podcast-announcement",
        "title": "<b>Meghan</b>&#39;s subtle nod to Diana in her new podcast announcement",
        "description": "However, the Duchess of Sussex has now announced that she will return to podcast hosting duties in a new format. Meghan shared that she has signed a new deal with Lemonada Media - a female-founded podcast network - whereby she will be creating a completely new podcast, as well as distributing episodes of Archetypes to reach a wider audience."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-announces-podcast-no-not-102225010.html",
        "title": "<b>Meghan Markle</b> Announces New Podcast With ‘Brilliant’ Lemonada Team",
        "description": "Robin L Marshall/FilmMagicMany celebrities might prefer to draw a discreet veil over a much-mocked podcast that saw them derided as “grifters,” even if it did make them a load of cash.Meghan Markle, however,"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-meghan-markle-flop-32120426",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s latest move is a &#39;Royal flop&#39; as they cling to titles",
        "description": "Meghan Markle and Prince Harry have launched a brand new website but decided to keep their royal titles, which is believed to have &#39;gone down terribly&#39; at Buckingham Palace"
    },
    {
        "url": "https://www.telegraph.co.uk/travel/destinations/caribbean/jamaica/articles/jamaica-expert-travel-guide/",
        "title": "Your guide to the ultimate weekend in Jamaica",
        "description": "An insider guide to 48 hours in the home of reggae and rum, from world-famous beaches to the best Jamaican fare and secluded corners"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-raises-eyebrows-unusual-32120401",
        "title": "<b>Meghan Markle</b> raises eyebrows with unusual name change on website in massive nod to royals",
        "description": "The Duke and Duchess of Sussex launched their new website this week and have sparked fury over the prominent use of their royal titles but that&#39;s not the only questionable detail on the page."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-prince-harry-land-28628831",
        "title": "<b>Meghan Markle</b> and Prince Harry land in Canada for Invictus Games event",
        "description": "Meghan Markle and Prince Harry have landed in Canada for an Invictus Games event. The couple flew in from Santa Barbara, California, where they currently reside"
    },
    {
        "url": "https://www.ibtimes.co.uk/suits-costars-confirm-meghan-markle-has-cut-them-off-her-life-1723419",
        "title": "&#39;Suits&#39; Costars Confirm <b>Meghan Markle</b> Has Cut Them Off From Her Life",
        "description": "Meghan Markle appeared on the legal series for seven seasons and filmed 100 episodes. She has since quit acting after she married Prince Harry in May 2018 and now runs their non-profit organisation Archewell Foundation and its subcompanies Archewell Audio and Archewell Productions."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13081267/Megyn-Kelly-slams-Meghan-Markle-claim-feminist-new-Sussex-website.html",
        "title": "Megyn Kelly slams <b>Meghan Markle</b>&#39;s claim she is a &#39;feminist&#39; on new Sussex.com website and says her behavior toward Kate Middleton and The Queen proves she is not",
        "description": "Kelly, who was joined on the show by DailyMail.com columnist Maureen Callahan, hit back at the Duchess of Sussex over the remarks on the couples new website."
    },
    {
        "url": "https://sg.style.yahoo.com/meghan-markle-signed-podcast-deal-110221771.html",
        "title": "<b>Meghan Markle</b> Has Signed a New Podcast Deal 8 Months After Spotify Canceled Their Partnership",
        "description": "<b>Meghan Markle</b> is back, baby! After laying low for several months, the Duchess of Sussex has finally announced her next career move, and she&#39;s diving back into the world of podcasting. Eight months after her deal with Spotify fell through, <b>Meghan</b> has signed ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-land-32119916",
        "title": "<b>Meghan Markle</b> and Prince Harry land in Canada for Invictus Games event after 2-hour flight",
        "description": "Meghan Markle and Prince Harry have landed in Vancouver, Canada, for an Invictus Games event. The couple are visiting the country for a three-day event to talk about next year&#39;s games"
    }
]