[
    {
        "url": "https://www.allvipp.com/royals/whoa!-harry-and-meghan-s-production-manager-jumps-ship",
        "title": "WHOA! Harry and <b>Meghan</b>&#39;s Production Manager Jumps Ship",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s Archewell Productions hit with a surprise as manager Bennett Levine departs for Cinetic Media amid Netflix and Spotify deal developments. Shocking shake-up at Sussex HQ Harry and <b>Meghan</b>&#39;s TV boss quits Archewell Productions ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861445/Meghan-Markle-Prince-Harry-netflix-deal-deadline",
        "title": "Prince Harry and <b>Meghan Markle</b> have &#39;one year left&#39; to get cash as their expenses spiral",
        "description": "Meghan Markle and Prince Harry have just one year left to make their Netflix deal work or go bust, amid their growing &quot;money worries&quot;."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-would-gain-short-32004950",
        "title": "<b>Meghan Markle</b> would gain &#39;short-term success&#39; and &#39;strain&#39; royal relationship with memoir",
        "description": "Speculation has been growing about whether Meghan Markle is working on a tell-all memoir about her experiences with the Royal Family, but one expert has warned against it"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markles-earring-designers-got-191638447.html",
        "title": "<b>Meghan Markle</b>&#39;s Earring Designers Got Her Attention with This Old-School Approach When She Was a Working Royal",
        "description": "“We launched without any investment, and then two months after our investment, we got Meghan Markle to wear our pieces, which enabled us to grow the revenue significantly, and from there, we raised $1.2 million,” Warch explained of the brand’s history on the Shark Tank-style business pitch show."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-may-be-in-a-bigger-career-crisis-than-we-think-heres-whats-happening_art20963.html",
        "title": "Prince Harry and <b>Meghan</b> may be in a bigger career crisis than we think, here’s what’s happening",
        "description": "Discover our latest podcast Prince Harry and <b>Meghan Markle</b> are also dealing with the same issues as they try to rebuild their brand together away from the British Royal Family. But this is made of many ups and down... Already in 2023, the couple’s $ ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-told-back-off-32005623",
        "title": "<b>Meghan Markle</b> told to &#39;back off&#39; from &#39;toxic&#39; friendship with Ellen DeGeneres",
        "description": "Meghan Markle and Prince Harry have developed a close bond with TV star Ellen DeGeneres and her wife Portia De Rossi - however, they&#39;ve been cautioned to steer clear of the &#39;toxic&#39; talk show host"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13023835/Suits-cast-reunites-commercial-Meghan-Markle-reboot.html",
        "title": "<b>Meghan Markle</b>&#39;s Suits co-stars reignite REBOOT rumors as they reunite to star in Super Bowl commercial for E.l.f. Cosmetics that sees them spoofing the legal drama - but the ...",
        "description": "Gina Torres, Rick Hoffman, and Sarah Rafferty will star in a new ad for E.l.f. Cosmetics that will air on CBS during the Super Bowl on February 11, and the makeup company shared a sneak peak."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/512372/meet-prince-harry-and-meghan-markles-children-prince-archie-and-princess-lilibet/",
        "title": "Meet Prince Harry and <b>Meghan Markle</b>&#39;s children Prince Archie and Princess Lilibet",
        "description": "The Duke and Duchess of Sussex looked over the moon and totally in love with their new son as they greeted photographers at Windsor Castle. Just a few days later, the royal couple introduced their newborn to Their Late Majesties, Queen Elizabeth II and Prince Philip."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861079/royal-family-live-harry-meghan-losing-support",
        "title": "Royal Family LIVE: Prince Harry and <b>Meghan Markle</b> are &#39;losing support&#39; in fresh blow",
        "description": "The Sussexes&#39;s surprise appearance in Jamaica could be part of an effort to bolster their flagging Hollywood careers as support collapses."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/512339/meghan-markle-french-manicure-royal-rules/",
        "title": "<b>Meghan Markle</b>&#39;s rule-breaking nails mark a huge shift for her",
        "description": "Princess Kate has been known to break from royal tradition when it comes to her nails. At the traditional Easter Sunday Mattins Service at St George&#39;s Chapel at Windsor Castle last year, the Princess rocked a ruby red manicure that was a stunning contrast against her cobalt blue dress and her iconic blue sapphire engagement ring."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/home-brands-david-beckham-tommy-193004353.html",
        "title": "Home Brands, David Beckham, Tommy Hilfiger Help Safilo but 2023 Sales Drop 4.9%",
        "description": "The Italian eyewear company cited headwinds from the continuing weakness of the North American market, and a more than 60 percent drop in revenues recorded in the former GrandVision chains."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13022739/meghan-markle-freebies-diamond-earrings-dragons-den.html",
        "title": "<b>Meghan Markle</b> accepted pair of £1990 diamond earrings from Dragons&#39; Den hopefuls - after Prince Harry revealed she &#39;kept gifts but shared them out&#39; in Kensington Palace",
        "description": "The Duchess of Sussex, 42, was sent the jewellery by artificial diamond brand Kimai when she was still a working member of the Royal Family in 2019 and wore them during an engagement in London."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-accepted-1990-diamond-32002356",
        "title": "Jewellery company reject claims <b>Meghan Markle</b> was gifted £2k earrings amid criticism",
        "description": "Prince Harry once revealed wife Meghan Markle would accept the free gifts sent to her at Kensington Palace and distributed them among the staff, despite other royals sending gifts back"
    },
    {
        "url": "https://uk.movies.yahoo.com/execs-reportedly-prepared-pay-takes-135625242.html",
        "title": "Execs Are Reportedly “Prepared to Pay What It Takes” to Get <b>Meghan Markle</b> to Star in (and Direct!) Forthcoming ‘Suits’ Spinoff",
        "description": "The Pride and Prejudice actor revealed he once accidentally received a pay cheque meant for the Marvel star, but he&#39;s far from the only Tom Holland in the industry. Vicky McClure says Jed Mercurio&#39;s ITV drama prompted a flurry of interest in the real job of Explosives Officer."
    },
    {
        "url": "https://www.bbc.com/news/entertainment-arts-68138795",
        "title": "Record-breaking Suits and Bluey named most-streamed shows of 2023 in US",
        "description": "Suits, the hit legal drama starring the future Duchess of Sussex, set a new US streaming record after enjoying a resurgence in popularity in 2023. According to media analysts Nielsen, the show, which first ran from 2011 to 2019, was watched for a total of 57.7 billion minutes on Netflix last year."
    },
    {
        "url": "https://www.independent.co.uk/news/world/prince-harry-africa-charity-allegations-b2486504.html",
        "title": "Prince Harry urged to quit charity that is facing rape, abuse and torture accusations",
        "description": "Prince Harry has been urged to quit a charity that is facing allegations of rape and torture by its employees of local people in the Republic of the Congo. Guards managed and paid by Africa Parks have been accused of human rights abuse which includes the beating, rape and torture of indigenous Baka people in the rainforests."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-she-may-no-longer-be-a-working-royal-but-she-remains-a-princess-heres-why_art20949.html",
        "title": "<b>Meghan Markle</b>: She may no longer be a working royal but she remains a Princess, here’s why",
        "description": "<b>Meghan Markle</b> and Prince Harry are press favourites. They are so loved by the press that it led them to move to North America at the end of 2019 in an attempt to escape it. A few months later that move was followed by the announcement that they would step ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-hyper-concerned-money-31999585",
        "title": "<b>Meghan Markle</b> &#39;hyper-concerned&#39; about money amid fresh blow to couple&#39;s production company",
        "description": "The Duchess of Sussex is said to be concerned that she and Prince Harry could &quot;lose everything&quot; as they have &quot;blown through so much money&quot; and are not making much progress in their career."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25591827/meghan-markle-prince-harry-archewell-productions-manager-quits/",
        "title": "Blow to <b>Meghan Markle</b> and Prince Harry as key member of Archewell staff quits after string of employees leave",
        "description": "HARRY and Meghan have been hit with a fresh blow after their Archewell Productions manager walked out. The company, which boasts a collaboration with Netflix, was launched in 2020 by the Sussexes"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-allegedly-put-end-130703380.html",
        "title": "Prince Harry Allegedly &quot;Put an End&quot; to <b>Meghan Markle</b>&#39;s Memoir Plans",
        "description": "Rumors that <b>Meghan Markle</b> wished to write a memoir of her own have been swirling around for months, culminating recently in incendiary royal expert Tom Bower claiming that such a &quot;tell-all&quot; book would be imminent. It was reported that <b>Meghan</b> wanted to &quot;set ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-harry-spending-desperate-32001285",
        "title": "<b>Meghan Markle</b> facing &#39;desperate times&#39; with Prince Harry as they&#39;re &#39;forced to cut spending that&#39;s out of control&#39;",
        "description": "Prince Harry and <b>Meghan Markle</b> are said to be facing &quot;desperate times&quot; as their &quot;spending is out of control&quot; following their numerous and expensive legal battles. Speaking to Closer Magazine, an insider revealed: &quot;Whether Harry was right or wrong ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-dealt-32000716",
        "title": "<b>Meghan Markle</b> and Prince Harry dealt huge blow as manager of Archewell Productions quits",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s Archewell Productions has suffered a setback as their TV boss, Bennett Levine, has decided to leave. The couple established Archewell Productions in 2020, the same year they stepped down as senior royals and relocated to ..."
    },
    {
        "url": "https://uk.yahoo.com/news/meghan-markle-set-swap-school-121914262.html",
        "title": "<b>Meghan Markle</b> set to swap the school run for learning scripts as she’s offered ‘dream role’ in new Suits spin-off show",
        "description": "<b>Meghan Markle</b> is reportedly considering making a huge change to family life as it&#39;s claimed she&#39;s been offered her &#39;dream role&#39; in a Suits spin-off show. The Duchess of Sussex is expected to make a return to acting this year, swapping the school run for ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/better-call-saul-star-bob-odenkirk-related-king-charles-iii.html/",
        "title": "‘Better Call Saul’ Star Bob Odenkirk Stunned to Learn He’s Related to King Charles III",
        "description": "During an appearance on &#39;Finding Your Roots,&#39; actor Bob Odenkirk learned he and King Charles are distant cousins."
    },
    {
        "url": "https://www.gamesradar.com/suits-rick-hoffman-interview-spin-off/",
        "title": "Suits star Rick Hoffman says he would do a spin-off &quot;in a heartbeat&quot;",
        "description": "Suits star Rick Hoffman says he&#39;d &quot;absolutely&quot; be down to do a spin-off of the hit series."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/prince-harry-and-meghans-archewell-production-company-suffers-new-blow-as-tv-boss-quits/P7APWBPOQJDMLEW7M3QRBPWFKA/",
        "title": "Prince Harry and <b>Meghan</b>’s Archewell production company suffers new blow as TV boss quits",
        "description": "It&#39;s a blow to the company. There&#39;s no doubt about that.&#39; Photo /  When Meghan Markle was interviewed on the red carpet at a Los Angeles event last year, she revealed that she and Prince Harry had “so many exciting things on the slate” to announce."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-former-suits-costar-194228484.html",
        "title": "<b>Meghan Markle</b>&#39;s Former &#39;Suits&#39; Costar Believes Her Royal Influence Is Behind the Show&#39;s Popularity",
        "description": "Remember that “Markle Sparkle” everyone talked about when Meghan Markle joined the royal family? Well, it still exists in this world, just not at the palace. The Duchess of Sussex’s former Suits costar,"
    },
    {
        "url": "https://www.forbes.com/sites/zacharyfolk/2024/01/30/more-executives-leave-harry-and-meghans-production-company-what-we-know/",
        "title": "More Executives Leave Harry And <b>Meghan</b>’s Production Company: What We Know",
        "description": "Prince Harry and Meghan Markle’s production company Archewell lost three more executives over the weekend—the latest in a series of high-profile departures for the ex-royals’ brand. Ben Browning, an Oscar-nominated producer who was tapped to lead content at Archewell, will leave later this year after his contract expires, Variety reported Saturday."
    },
    {
        "url": "https://bulawayo24.com/index-id-news-sc-national-byo-239707.html",
        "title": "Zimbabwean nanny was surprised by the way Harry and <b>Meghan</b> first greeted her",
        "description": "Prince Harry and Meghan Markle surprised Prince Archie&#39;s former nanny Lorren Khumalo, from Zimbabwe, when she was first introduced to the couple.Lorren, a"
    },
    {
        "url": "https://people.com/meghan-markle-earrning-designers-caught-attention-royal-life-8553125",
        "title": "<b>Meghan Markle</b>&#39;s Earring Designers Got Her Attention with This Old-School Approach When She Was a Working Royal",
        "description": "Female-founded jewelry brand Kimai reveals how they got the attention of Meghan Markle&#39;s office when the Duchess of Sussex was a working royal"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-suffer-173116791.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> Suffer a Business Setback Just as They Were Getting Back on Track",
        "description": "Prince Harry and Meghan Markle have been looking forward to 2024 as a restart to their work in Hollywood, but they reportedly have hit a setback at Archewell Productions. Bennett Levine, who spent almost three years working with the royal couple,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152958-meghan-markle-receives-stern-warning-amid-hollywood-comeback",
        "title": "<b>Meghan Markle</b> receives stern warning amid Hollywood comeback",
        "description": "Meghan Markle has been warned to maintain distance from the renowned television host Ellen DeGeneres amid the Duchess of Sussex&#39;s comeback rumours in Hollywood.A few years ago, the TV"
    },
    {
        "url": "https://pagesix.com/2024/01/30/style/how-meghan-markle-helped-a-small-jewelry-brand-raise-more-than-1m-and-make-history/",
        "title": "How <b>Meghan Markle</b> helped a small jewelry brand raise more than $1M — and make history",
        "description": "The <b>Meghan</b> Effect strikes again. Whenever <b>Meghan Markle</b> wears something, it’s sure to be a swift sellout — and the founders of London-based fine jewelry brand Kimai recently shared that they raised $1.2 million in investments after the Duchess of ..."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-comments-prince-archie-princess-lilibet-hollywood-futures-1865258",
        "title": "Everything <b>Meghan Markle</b> Said About Archie and Lilibet&#39;s Hollywood Futures",
        "description": "&quot;There are so many people that will talk about what opened the door for my children,&quot; the Duchess of Sussex has said."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152932-meghan-markle-prince-harry-brace-for-major-blow-as-new-crisis-looms",
        "title": "<b>Meghan Markle</b>, Prince Harry brace for major blow as new crisis looms",
        "description": "Meghan Markle and Prince Harry, who signed a lucrative deal with Netflix after stepping down as working royals in 2020, have been issued new warning as contract with Netflix expires next"
    },
    {
        "url": "https://www.btimesonline.com/articles/163639/20240130/prince-harry-and-meghan-markle-spark-speculation-with-paramount-pictures-executive-meeting.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Spark Speculation with Paramount Pictures Executive Meeting",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s recent appearance at the &quot;Bob Marley: One Love&quot; film premiere in Jamaica has ignited a flurry of speculation about a potential new collaboration with Paramount Pictures. The Duke and Duchess of Sussex, who have previously ..."
    },
    {
        "url": "https://nypost.com/2024/01/30/entertainment/prince-harry-meghan-markle-dealt-blow-as-top-tv-boss-quits-archewell-production-company/",
        "title": "Prince Harry and <b>Meghan Markle</b> dealt fresh blow as top TV boss quits their Archewell production company",
        "description": "The Duke and Duchess of Sussex founded Archewell Productions in 2020 — just months after they quit royal life and hightailed it across the pond."
    },
    {
        "url": "https://theblast.com/574722/meghan-markle-offered-dream-role-suits-spinoff-hollywood-comeback/",
        "title": "<b>Meghan Markle</b> Offered ‘Dream’ Role In ‘Suits’ Spinoff Amid Hollywood Comeback",
        "description": "Senior network execs of a proposed “Suits” spinoff series have repotedly held talks with Meghan Markle on board for a &quot;dream&quot; role."
    },
    {
        "url": "https://ca.news.yahoo.com/prince-harry-allegedly-put-end-130703380.html",
        "title": "Prince Harry Allegedly &quot;Put an End&quot; to <b>Meghan Markle</b>&#39;s Memoir Plans",
        "description": "Rumors that <b>Meghan Markle</b> wished to write a memoir of her own have been swirling around for months, culminating recently in incendiary royal expert Tom Bower claiming that such a &quot;tell-all&quot; book would be imminent. It was reported that <b>Meghan</b> wanted to &quot;set ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/andrew-holness-marlene-malahoo-forte-o-1723081",
        "title": "Prince Harry, <b>Meghan Markle</b>&#39;s Jamaica Visit Sparks Claims Of &#39;Harry &amp; <b>Meghan</b>&#39; Sequel",
        "description": "The Sussexes shared a glimpse at their former royal life and their love story in the &quot;Harry &amp; Meghan&quot; Netflix docuseries."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-wants-second-trial-mirror-phone-hacking/",
        "title": "Harry wants second trial with Mirror publisher over phone-hacking claims despite winning £140k in December",
        "description": "Prince Harry wants a second phone-hacking trial against the Mirror, despite the newspaper group seeking to recoup £350,000 in legal costs from other complainants in his case."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dragons-den-episode-ear-seeds-controversy-b2487154.html",
        "title": "BBC reinstates Dragons’ Den episode with disclaimer after ear seeds complaints",
        "description": "The BBC has been forced to edit an episode of Dragon’s Den following concerns over “unfounded claims” regarding a product that historically received offers from all six Dragons."
    },
    {
        "url": "https://www.couriermail.com.au/entertainment/celebrity-life/royals/major-blow-to-meghan-markle-and-prince-harrys-hollywood-dream/news-story/b8c1a3b3f59429a85009f73cec28388f",
        "title": "Major blow to <b>Meghan Markle</b> and Prince Harry’s Hollywood dream",
        "description": "<b>Meghan Markle</b> and Prince Harry suffered a new setback after a high-profile defection at their production company amid a push to sign lucrative content deals. Archewell Productions executive Bennett Levine became the latest in a string of senior staff ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163656/20240131/meghan-markles-star-power-fuels-suits-resurgence-on-netflix.htm",
        "title": "<b>Meghan Markle</b>&#39;s Star Power Fuels &#39;Suits&#39; Resurgence on Netflix",
        "description": "The resurgence of &quot;Suits&quot; on Netflix has captivated audiences anew, largely attributed to the enduring charm of <b>Meghan Markle</b>, according to her co-star Abigail Spencer. Despite the series concluding its television run four years ago, its addition to ..."
    },
    {
        "url": "https://mpasho.co.ke/entertainment/2024-01-30-meghan-markles-suits-most-streamed-2023-show/",
        "title": "<b>Meghan Markle</b>&#39;s &#39;Suits&#39; most-streamed 2023 show",
        "description": "Suits, the hit legal drama starring the future Duchess of Sussex, set a new US streaming record after enjoying a resurgence in popularity in 2023. According to media analysts Nielsen, the show, which first ran from 2011 to 2019, was watched for a total of ..."
    },
    {
        "url": "https://medicalxpress.com/news/2024-01-yoga-tiktok-storm.html",
        "title": "Face yoga is taking TikTok by storm—but does it work?",
        "description": "Actor Gwyneth Paltrow&#39;s website Goop has promoted the benefits of face yoga, and <b>Meghan Markle</b>, the Duchess of Sussex, told an interviewer in 2014 she used face yoga to sculpt her cheeks and jawline, according to an article in Business Insider. So far ..."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/30/65b8fcd122601dae668b4595.html",
        "title": "This is Adelaide Cottage, the luxurious mansion in Windsor where Kate Middleton will recuperate after her serious operation",
        "description": "Abigail Spencer makes feelings clear on Suits co-star <b>Meghan Markle</b>: Everyone is aware of her Kate Middleton recently underwent a very serious operation, which means she needs to take things incredibly easy for the foreseeable future. Middleton underwent ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markles-loveliness-inspired-suits-resurgence-says-co-star-1723051",
        "title": "<b>Meghan Markle</b>&#39;s &#39;Loveliness&#39; Inspired &#39;Suits&#39; Resurgence, Says Co-Star",
        "description": "The &quot;Suits&quot; cast (L-R front) Gina Torres, Patrick J. Adams, Gabriel Macht, IL-R back) <b>Meghan Markle</b>, Sarah Rafferty, and Rick Hoffman. Photo: Suits Peacock/Instagram Suits Peacock/Instagram Abigail Spencer credits <b>Meghan Markle</b>&#39;s charm as one of the ..."
    }
]