[
    {
        "url": "https://www.yahoo.com/lifestyle/sussexes-beckhams-unlikely-reconcile-tense-170000844.html",
        "title": "The Sussexes and Beckhams &quot;Unlikely&quot; to Reconcile After Tense Convo That Left David &quot;Bloody Furious&quot;",
        "description": "The Sussexes and the Beckhams are apparently unlikely to reconcile after a super tense convo that left David Beckham &quot;bloody furious.&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-tired-31809938",
        "title": "<b>Meghan Markle</b> and Prince Harry &#39;tired of getting the cold shoulder&#39; from Royal Family",
        "description": "<b>Meghan Markle</b> and Prince Harry are &quot;likely tired of getting the cold shoulder&quot; from the Royal Family amid reports they&#39;re distancing themselves from The Firm, according to an expert. wThe Duke and Duchess of Sussex are said to have declined an invitation ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-mom-doria-basically-lives-sussex-montecito-home-report-claims-heres-what-happens-when-prince-harry-needs-space.html/",
        "title": "<b>Meghan Markle</b>’s Mom, Doria, Basically Lives at the Sussex Montecito Home, Report Claims: Here’s What Happens When Prince Harry ‘Needs Space’",
        "description": "Meghan Markle&#39;s mom, Doria Ragland, reportedly &#39;spends more time&#39; at her and Prince Harry&#39;s Montecito, California, home than her own."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/king-charles-news-prince-harry-news-king-charles-asked-to-bring-back-prince-harry-his-heartbreaking-4-word-reply-101704552848431.html",
        "title": "King Charles asked to bring back Prince Harry. His heartbreaking 4-word reply",
        "description": "Prince Harry and his wife <b>Meghan Markle</b> stepped down from their royal roles in 2020 after which their relationship with the royal family deteriorated. The father-son have not talked to each other since, it was reported as Prince Harry levelled charges ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/meghan-markle-wants-answers-from-king-charles-royal-expert/articleshow/106600588.cms",
        "title": "<b>Meghan Markle</b> &#39;wants answers from King Charles&#39;: Royal expert",
        "description": "Meghan Markle demands answers from King Charles regarding the different treatment she and Prince Harry are receiving compared to other members of the"
    },
    {
        "url": "https://www.btimesonline.com/articles/163090/20240106/meghan-markles-image-overhaul-faces-royal-critique-and-public-skepticism.htm",
        "title": "<b>Meghan Markle</b>&#39;s Image Overhaul Faces Royal Critique and Public Skepticism",
        "description": "As <b>Meghan Markle</b>, the Duchess of Sussex, endeavors to reshape her public image post her contentious departure from the British royal family, palace insiders and brand experts express varied opinions on her recent commercial appearance. Amidst a backdrop of ..."
    },
    {
        "url": "https://www.instyle.com/nordstrom-half-yearly-sale-2024-last-minute-deals-8423049",
        "title": "Hurry! Nordstrom’s Half-Yearly Sale Is Almost Over",
        "description": "The 28 best last-minute deals from Nordstrom’s Half-Yearly Sale, including up to 70 percent off winter fashion, trending shoes, luxury bags, and designer goods, with prices starting at $34."
    },
    {
        "url": "https://www.ghanaweb.com/GhanaHomePage/africa/Meghan-Markle-reportedly-tried-to-arrange-a-meeting-with-King-Charles-Wants-some-answers-1908344",
        "title": "<b>Meghan Markle</b> reportedly tried to arrange a meeting with King Charles: ‘Wants some answers’",
        "description": "Meghan Markle is said to be seeking explanations from King Charles regarding the perceived disparate treatment she and Prince Harry have faced compared to other royal family members."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145325-king-charles-emotional-reply-to-question-about-harrys-possible-return",
        "title": "King Charles emotional reply to question about Harry&#39;s possible return",
        "description": "King Charles expressed a wish concerning his estranged son, Prince Harry. His comment came as a rare public moment. King Charles tried to ‘control’ Prince Harry, Meghan Markle"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/podcasters-jailed-for-threats-to-prince-harry-kill-him-for-marrying-meghan-101704537151400.html",
        "title": "Podcasters jailed for threats to Prince Harry: ‘Kill him for marrying <b>Meghan</b>&#39;",
        "description": "Christopher Gibbons said Prince Harry should be “prosecuted and judicially killed for treason” as he called Archie a “creature” that “should be put down.” The 40-year-old was sentenced to eight years in prison while Patten-Walsh, 34, was given a 7-year term."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145308-taylor-swift-aims-to-take-considerable-risk-in-2024-at-careers-peak",
        "title": "Taylor Swift aims to take &#39;considerable risk&#39; in 2024 at career&#39;s peak",
        "description": "Taylor Swift is expected to influence her fans to vote for Joe Biden in the much-anticipated US presidential elections, which will take place in November 2024.During an exclusive conversation"
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-william-harry-unwelcome-royals-31811743",
        "title": "Kate Middleton and Prince William&#39;s &#39;clever move that shows Harry isn&#39;t welcome&#39; in Royal Family",
        "description": "Kate Middleton and Prince William have made it &#39;clear&#39; that Prince Harry and Meghan Markle are not &#39;welcome&#39; in the Royal Family with a clever move, a royal author claims"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852656/prince-harry-meghan-markle-royal-family",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;pivotal&#39; plan for 2024 as couple look to &#39;recover&#39; image",
        "description": "The Duke and Duchess of Sussex had a rocky 2023, with failed business ventures and a deepening rift with the Royal Family."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-feels-stressed-amid-31819701?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> feels &#39;stressed&#39; amid deals &#39;falling apart&#39; as she &#39;takes step back&#39;",
        "description": "Meghan Markle is supposedly &#39;stressed&#39; as her and Prince Harry&#39;s deals &#39;fall apart&#39; with the Duchess said to be keen for her husband to &#39;get his game face on&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852206/royal-family-live-prince-harry-Meghan-Markle-trust",
        "title": "Prince Harry and <b>Meghan Markle</b> told how to rebuild trust in seven words",
        "description": "Prince Harry and Meghan Markle have been given a simple seven-word piece of advice as the pair hope to rebuild public trust in 2024."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-coffee-brand-target-31819991",
        "title": "<b>Meghan Markle</b> enjoys huge career win as her business lands major deal",
        "description": "We&#39;re just days into 2024, but <b>Meghan Markle</b> has already achieved a big career win, with the coffee brand she invested in having signed a deal with retailer Target. <b>Meghan</b>, 42, invested an undisclosed amount of money in Clevr Blends over three years ago ..."
    },
    {
        "url": "https://www.instyle.com/best-weekend-sales-01-05-2024-8422856",
        "title": "The Only 4 Sales Worth Shopping This Weekend, With Up to 78% Off a <b>Meghan Markle</b>-Worn Brand",
        "description": "The four best sales happening this weekend are at J.Crew, Reformation, Space NK, and M.Gemi. Shop luxury skincare and haircare for half-off, Meghan Markle’s J.Crew sweater, and more while they’re on sale for up to 78 percent off."
    },
    {
        "url": "https://www.harpersbazaar.com/fashion/trends/g46202046/best-camel-coat-for-women/",
        "title": "The 20 Best Camel Coats for Women Are Forever Classics",
        "description": "No matter the exact shape or texture, the best camel coats will last from season to season. Find our favorites for every winter ahead, including classic designer coats, camel puffers, and oversize leather jackets. Each coat was chosen based on expert recommendations, shopper reviews, and my own extensive testing."
    },
    {
        "url": "https://www.hellomagazine.com/shopping/510649/sweater-vests-for-women/",
        "title": "7 reasons to wear a knitted sweater vest this season",
        "description": "Just weeks earlier, <b>Meghan Markle</b> wore a chic all-black outfit to cheer on veteran athletes at the Invictus Games in Germany. Her sweater vest was a cashmere piece from J.Crew and her skinny jeans were the Le Color pair by Frame. Kendall Jenner loves her ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/harry-and-meghan-what-next-for-hollywood-s-biggest-losers-b2473838.html",
        "title": "Harry and <b>Meghan</b>: A year of redemption for ‘Hollywood’s biggest losers’",
        "description": "It is four years since the drama of Megxit, but after ceaseless family turmoil and career false starts, the time has come to admit what they got wrong and rebuild bridges, say those closest to the couple."
    },
    {
        "url": "https://www.livemint.com/news/world/bystander-asks-king-charles-to-bring-prince-harry-back-check-the-monarch-s-emotional-reply-11704531808614.html",
        "title": "Bystander asks King Charles to bring Prince Harry back; check the monarch’s emotional reply",
        "description": "Prince Harry and Meghan Markle&#39;s departure from the Royal Family in 2020 caused controversy, with Harry accusing his father of lying and prioritising his own interests."
    },
    {
        "url": "https://www.ndtv.com/world-news/meghan-markle-has-been-trying-to-meet-king-charles-claims-royal-author-4810563",
        "title": "<b>Meghan Markle</b> Has Been Trying To Meet King Charles, Claims Royal Author",
        "description": "Prince Harry and Meghan Markle are being subjected to a &quot;different&quot; set of rules compared with the other members of the British royal family, forcing the Duchess of Sussex to demand certain &quot;answers&quot; from King Charles,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145277-prince-harry-meghan-markle-in-hot-water-after-oversharing-royal-secrets",
        "title": "Prince Harry, <b>Meghan Markle</b> in hot water after &#39;oversharing&#39; royal secrets",
        "description": "According to an analyst, Meghan Markle and Prince Harry will find it difficult to regain the public&#39;s trust after oversharing details about the Royal Family.A public relations specialist"
    },
    {
        "url": "https://www.ndtv.com/world-news/meghan-markle-wants-to-be-queen-claims-royal-author-tom-bower-4810362",
        "title": "<b>Meghan Markle</b> &quot;Wants To Be Queen&quot;, Claims Royal Author",
        "description": "Royal author Tom Bower has claimed that Meghan Markle “wants to be Queen”. The &#39;Rebel Prince&#39; writer shared his insights on the former &#39;Suits&#39; actress&#39; alleged aspirations, indicating that she longs to rejoin the royal fold despite her and Prince Harry&#39;s move to California years ago."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royal-author-says-meghan-markle-jealous-kate-middleton-duchess-still-wants-to-be-queen.html/",
        "title": "Royal Author Says <b>Meghan Markle</b> Is so ‘Jealous’ of Kate Middleton Because the Duchess Still ‘Wants to Be Queen’",
        "description": "A royal author is explaining why he believes Meghan Markle is still &quot;jealous&quot; of Kate Middleton and it all has to do with wanting to be queen."
    },
    {
        "url": "https://pagesix.com/2024/01/05/royal-family/meghan-markle-prince-harry-were-alienated-at-last-gathering-with-king-charles/",
        "title": "<b>Meghan Markle</b>, Prince Harry were ‘alienated’ at last gathering with ‘hard-hearted’ King Charles: expert",
        "description": "Body language expert Judi James claimed that the “sense of alienation” between Prince Harry and King Charles was “obvious.”"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145069-meghan-markle-rushed-to-hospital-after-medical-emergency",
        "title": "<b>Meghan Markle</b> rushed to hospital after medical emergency",
        "description": "Meghan Markle has shared shocking details about her debilitating health issue that took the Duchess to hospital.The Duchess of Sussex, in an interview with The Chalkboard, revealed that she"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/05/65986fcfca47419b5a8b456d.html",
        "title": "Prince Harry and <b>Meghan Markle</b> &quot;alienated&quot; by King Charles, body language expert reveals",
        "description": "UK News. Prince Andrew named in accusation of &#39;underage orgy&#39; on Epstein Island UK News. &quot;<b>Meghan Markle</b> wants to be Queen&quot; She described the interaction between the Duke and Duchess of Sussex and Charles at Buckingham Palace before the Queen&#39;s funeral as ..."
    }
]