[
    {
        "url": "https://www.express.co.uk/news/royal/1855449/prince-harry-meghan-Ellen-DeGeneres",
        "title": "Prince Harry and <b>Meghan Markle</b> welcome new family member after rescuing them from bullies",
        "description": "The new addition will live on the grounds of the pair&#39;s Montecito mansion after being saved from celeb pal Ellen DeGeneres."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-adopt-31875982",
        "title": "Prince Harry and <b>Meghan Markle</b> adopt Ellen DeGeneres&#39; ‘bullied’ rescue chicken",
        "description": "Prince Harry and <b>Meghan Markle</b> have adopted one of Ellen DeGeneres’ rescue chickens after it was reportedly being bullied at the talk show host&#39;s estate. The Duke and Duchess of Sussex’s $14.5 million (£11.3 million) mansion in Montecito, California ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1855439/prince-harry-meghan-markle-archewell-business-plan-finances-spotify",
        "title": "Prince Harry and <b>Meghan Markle</b> savaged by top Hollywood boss: &#39;No original content&#39;",
        "description": "EXCLUSIVE: A senior studio executive told Daily Express US an &quot;alarming lack of original content&quot; is cause for concern."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511190/prince-harry-meghan-markle-adopt-pet-chicken-ellen-degeneres-reveals/",
        "title": "Prince Harry and <b>Meghan Markle</b> welcome new family member at Montecito home",
        "description": "Prince Harry and Meghan Markle have welcomed a new family member! Adding to the flock at their Montecito home, the royal couple has adopted Sinkie – an ailing chicken previously owned by their good friend and neighbor, Ellen DeGeneres ."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12959691/prince-harry-meghan-markle-adopt-ellen-degeneres-chicken-montecito.html",
        "title": "Prince Harry and <b>Meghan Markle</b> adopt Ellen DeGeneres&#39; chicken named &#39;Sinkie&#39; after being bullied by her flock - and will now live out her days at the couple&#39;s $14.5million ...",
        "description": "Prince Harry and <b>Meghan Markle</b> have adopted one of Ellen DeGeneres&#39; ailing chickens which was being bullied. The former talk show host, whose sprawling $25 million Montecito compound is just a five minute drive from the Duke and Duchess of Sussex&#39;s $14.5 ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-harrys-dreams-falling-apart-31874929?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan</b> and Harry&#39;s &#39;dreams are falling apart&#39; with huge Netflix deal to end in months",
        "description": "Meghan Markle and Prince Harry&#39;s &#39;dreams are falling apart&#39; as time on their Netflix deal runs out and the couple become the laughing stock of Hollywood, says royal expert"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25336768/meghan-markle-prince-harry-ticking-timebomb-netflix/",
        "title": "<b>Meghan Markle</b> and Harry ‘face ticking timebomb’ after cutting royal purse strings as £78m Netflix deal to end in months",
        "description": "MEGHAN Markle and Prince Harry face a “ticking timebomb” as their “Hollywood dreams are falling apart”, a royal expert has claimed. The Duke and Duchess of Sussex have just a year left"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25347499/princess-kate-didnt-go-to-balmoral-queen-died/",
        "title": "Why Princess Kate didn’t go to Balmoral with Prince William to see Queen before she died",
        "description": "THE real reason Princess Kate didn’t go to Balmoral to see the Queen before she died has been revealed in a new bombshell book. Neither the Princess of Wales nor Meghan Markle had travelled"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-meghan-firmly-denied-request-31873283.amp",
        "title": "Harry and <b>Meghan</b> &#39;firmly denied&#39; request for &#39;inappropriate&#39; home by Queen Elizabeth",
        "description": "Prince Harry and Meghan Markle were reportedly interested in another home on the Windsor estate. Before Harry and Meghan found their £11million California dream home, the couple lived as newlyweds in Frogmore Cottage."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-warned-not-greedy-31873021",
        "title": "<b>Meghan Markle</b> warned &#39;not to get greedy&#39; with Suits salary amid Rachel Zane return rumours",
        "description": "Meghan Markle has been warned against demanding a big salary if she returns to Suits as Rachel Zane as it&#39;s estimated she could negotiate a fee of £235,000-£314,000 per episode"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/meghan-markles-wedding-tailor-reveals-31872936",
        "title": "<b>Meghan Markle</b>&#39;s wedding tailor reveals what happened to make Charlotte cry",
        "description": "Harry delved into the details in Spare, sharing that the disagreement began when Kate texted Meghan that her daughter, Princess Charlotte, was crying because her dress was &quot;too big, too long, too baggy&quot;."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/511165/emily-blunt-sensational-ultimate-white-power-suit-meghan-markle/",
        "title": "Emily Blunt is sensational in ultimate white power suit moment that <b>Meghan Markle</b> would adore",
        "description": "Emily Blunt has rocked a second sensational power suit in 24 hours and we think we may love this one even more than the last. The Oppenheimer actress, 40, arrived at the AFI Awards Luncheon at the Four Seasons Hotel in Beverly Hills on Friday night in an ice queen goes-to-work moment that we just couldn&#39;t get enough of,"
    },
    {
        "url": "https://www.lbc.co.uk/news/real-reason-kate-middleton-not-travel-balmoral-day-queen-died/",
        "title": "The real reason Kate Middleton did not travel to Balmoral on day Queen Elizabeth died",
        "description": "The real reason Kate Middleton did not travel with Prince William on the day Queen Elizabeth died has been revealed."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/i-tried-meghan-markles-wellness-31866712",
        "title": "&#39;I tried <b>Meghan Markle</b>&#39;s wellness patches and they brought some calm to my chaotic mind&#39;",
        "description": "In a bid to bring some calmness to my everyday life, I tried a version of Meghan Markle&#39;s wellness patches which are aimed to help sleep, aches, pains and reduce stress"
    },
    {
        "url": "https://www.instyle.com/best-weekend-sales-01-12-2024-8425237",
        "title": "The Only 4 Sales Worth Shopping This Weekend: 75% Off Kate Spade, Half-Off Coach Bags, and More",
        "description": "The only four sales worth shopping this weekend are up to 75 percent off. Take advantage of beauty and fashion deals from Coach, Fleur &amp; Bee, Birdies, and Kate Spade Outlet."
    },
    {
        "url": "https://uk.news.yahoo.com/why-kate-middleton-didn-t-013305521.html",
        "title": "Why Kate Middleton Didn’t Go to Balmoral with Prince William as Queen Elizabeth Lay Dying",
        "description": "As William, 41, and other members of the royal family rushed to be by the Queen&#39;s side in Balmoral after doctors announced they were &quot;concerned&quot; for her health, the soon-to-be Princess of Wales, 42, chose to stay home in Windsor with the couple’s children, Prince George , Princess Charlotte, and Prince Louis."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/inside-george-clooneys-friendship-prince-28441745",
        "title": "Inside George Clooney&#39;s friendship with Prince Harry and <b>Meghan</b> before &#39;ditching&#39;",
        "description": "They were just two of a string of celebrities invited to celebrate Prince Harry and <b>Meghan Markle</b>&#39;s wedding in 2018. But just a few years later, the 62-year-old&#39;s blossoming friendship with the pair seemed to have fizzled out. The Ocean’s Eleven star ..."
    },
    {
        "url": "https://www.thedailybeast.com/ellen-degeneres-bullied-chicken-gets-royal-treatment-at-meghan-and-harrys-coop",
        "title": "Ellen Degeneres’ Bullied Chicken Gets Royal Treatment From Harry and <b>Meghan</b>",
        "description": "Instead of walking on eggshells around her poultry pals, the bullied bird will now get the royal treatment after Harry and Meghan, who live just five minutes away from DeGeneres and de Rossi, agreed to take the bird in."
    },
    {
        "url": "https://theshillongtimes.com/2024/01/14/margot-robbie-taylor-swift-dominated-beauty-trends-in-2023/",
        "title": "Margot Robbie, Taylor Swift dominated beauty trends in 2023",
        "description": "New research reveals the celebrities with the most talked about beauty routines. The research, conducted by beauty and wellness marketplace Fresha, analysed the number of online articles mentioning the beauty routines of over 100 of the most influential celebrities of 2023,"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/13/65a2f8ac268e3ef45e8b45c0.html",
        "title": "Britain&#39;s richest woman, Denise Coates, raises her salary to $280 million a year",
        "description": "They say that talking about money in certain environments is not very polite, but there comes a point at which talking about money in terms of billions of dollars becomes ridiculou"
    },
    {
        "url": "https://nypost.com/2024/01/13/entertainment/revealed-why-kate-middleton-wasnt-at-balmoral-when-queen-elizabeth-died/",
        "title": "Revealed: Why Kate Middleton wasn’t at Balmoral when Queen Elizabeth died",
        "description": "As Queen Elizabeth lay dying in September 2022, royals raced to be by her side at Balmoral Castle. Prince William quickly jetted from England to the Scottish estate, alongside Prince Andrew and Prince Edward. However, Princess Kate did not join them, sparking speculation that she was not extended an invitation by the family."
    },
    {
        "url": "https://www.samaa.tv/208737993-prince-harry-and-meghan-markle-struggle-to-maintain-influence-in-us",
        "title": "Prince Harry and <b>Meghan Markle</b> struggle to maintain influence in US",
        "description": "Schofield revealed to The Express that the couple&#39;s influence has become &quot;fragile,&quot; with the duo striving to be recognized as authoritative figures in their new home. Notably, American publications have reportedly started referring to them by their names rather than their royal titles,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1147598-meghan-markle-prince-harrys-tactic-of-being-silent-damaged-their-image",
        "title": "<b>Meghan Markle</b>, Prince Harry&#39;s tactic of being &#39;silent&#39; damaged their image",
        "description": "Meghan Markle and Prince Harry have been accused of being &#39;guilty&#39; due to their deafening silence over the royal race row.In conversation with Express.co.uk, PR strategist Laura Perkes claimed"
    },
    {
        "url": "https://www.samaa.tv/208737992-how-duchess-kate-emerges-victorious-amid-royal-controversy",
        "title": "How Duchess Kate emerges victorious amid royal controversy",
        "description": "Former adviser on Great Britain to the US House of Representatives, Lee Cohen, spoke exclusively to GB News, praising Duchess Kate for her unwavering composure in the face of what he termed as &quot;appalling conduct&quot; from across the pond."
    },
    {
        "url": "https://nypost.com/2024/01/13/entertainment/meghan-markle-smart-to-join-suits-reboot-but-shouldnt-be-greedy-with-salary-pr-guru/",
        "title": "<b>Meghan Markle</b> ‘smart’ to join ‘Suits’ reboot — but shouldn’t be ‘greedy’ with salary: PR guru",
        "description": "PR guru Ryan McCormick says it would be a “smart career move” for the Duchess of Sussex, 42, to return to the screen four years after fleeing the British royal family."
    },
    {
        "url": "https://www.foxnews.com/entertainment/jelly-roll-anti-fentanyl-legislation-meghan-markle-suits-reunion",
        "title": "Jelly Roll urges lawmakers for stronger anti-fentanyl legislation; <b>Meghan Markle</b> skips ‘Suits’ reunion",
        "description": "The Fox News Entertainment newsletter brings you the latest Hollywood headlines, celebrity interviews and stories from Los Angeles and beyond."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/prince-harry-meghan-markle-reportedly-170000350.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> Are Reportedly Close Pals With an A-Lister Who Knew Princess Diana",
        "description": "No matter what different outlets report, it’s pretty clear that Prince Harry and Meghan Markle do have quite a few A-list buddies. Not only are they best buddies with power couple Katy Perry and Orlando Bloom,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163259/20240114/kate-middleton-focuses-on-future-shrugs-off-prince-harry-and-meghan-drama.htm",
        "title": "Kate Middleton Focuses on Future, Shrugs Off Prince Harry and <b>Meghan</b> Drama",
        "description": "Kate Middleton, the Princess of Wales, is charting a course toward a future unburdened by the past feuds that have embroiled the Royal Family. As she celebrated her 42nd birthday on January 9, sources close to the princess indicate a determined effort to leave behind the drama stirred by Prince Harry and Meghan Markle&#39;s public disclosures."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1147568-meghan-markle-conveys-powerful-message-to-princess-kate-amid-rift",
        "title": "<b>Meghan Markle</b> conveys powerful message to Princess Kate amid rift",
        "description": "Meghan Markle is reportedly sending a powerful message to Kate Middleton with her fashion choices amid the ongoing royal rift.In conversation with GB News, celebrity stylist Marian Kwei claimed"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meghan-markle-isn-t-suits-140000575.html",
        "title": "<b>Meghan Markle</b> Isn’t on the ‘Suits’ Cast Text Chain—But There’s a Good Reason Why",
        "description": "At the 81st annual Golden Globe Awards, Suits cast members Gabriel Macht, Patrick J. Adams, Sarah Rafferty and Gina Torres reunited onstage to present the award for Best Drama TV Series. While this was a delight to see,"
    },
    {
        "url": "https://www.livemint.com/news/world/prince-harry-reveals-secret-code-with-prince-william-in-tell-all-memoir-spare-report-11705110037494.html",
        "title": "Prince Harry reveals secret code with Prince William in tell-all memoir Spare: Report",
        "description": "Prince Harry reveals secret code with brother Prince William in memoir &#39;Spare&#39; connected to late mother Princess Diana."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-5-glamorous-red-carpet-moments-fashion-1859066",
        "title": "<b>Meghan Markle</b>&#39;s 5 Most Glamorous Red Carpet Moments",
        "description": "Since marrying Prince Harry in 2018, Meghan has walked the red carpet at a number of high profile public events."
    },
    {
        "url": "https://www.sapeople.com/celeb-news/prince-harry-to-be-named-living-legend-of-aviation/",
        "title": "Prince Harry to be named ‘Living Legend of Aviation’",
        "description": "Prince Harry is to set be inducted into the Living Legends of Aviation Hall of Fame in the USA, later this month."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-plan-enroll-son-archie-kindergarten-class-filled-celebrity-kids-author.html/",
        "title": "Prince Harry and <b>Meghan Markle</b>’s Kindergarten Plans for Archie Will Likely Be Star-Studded, Author Says",
        "description": "According to a royal author, Prince Archie, the 4-year-old son of Prince Harry and Meghan Markle will be at an &#39;exclusive&#39; kindergarten."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/jacinda-ardern-wedding-first-official-photo-of-former-pm-wearing-juliette-hogan-as-she-marries-clarke-gayford/ZKAHBBLPRNGO5CKB7FCXN6TITE/",
        "title": "Jacinda Ardern wedding: First official photo of former PM wearing Juliette Hogan as she marries Clarke Gayford",
        "description": "Dame Jacinda Ardern wore a custom Juliette Hogan gown to her wedding to long-term partner Clarke Gayford. Official images released by the couple this afternoon show a smiling Ardern in the ivory sleeveless, cowlneck halter gown featuring a striking high neckline, cinched waist and low back."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-warned-careful-next-move-kate-middleton-will-fight-fire-with-fire.html/",
        "title": "<b>Meghan Markle</b> Warned to Be Careful of Her Next Move Because Kate Middleton Will ‘Fight Fire With Fire’",
        "description": "A warning is being sent out to Meghan Markle that if she brings up Kate Middleton&#39;s name again the princess will &quot;fight fire with fire.&quot;"
    },
    {
        "url": "https://people.com/why-kate-middleton-did-not-travel-balmoral-prince-william-queen-elizabeth-lay-dying-8426068",
        "title": "Why Kate Middleton Didn’t Go to Balmoral with Prince William as Queen Elizabeth Lay Dying",
        "description": "Kate Middleton&#39;s decision not to travel with Prince William to Scotland on the die Queen Elizabeth died is explored in a new book, &quot;The Making of a King&quot;"
    },
    {
        "url": "http://tsss.ca/uncategorized/queen-charles-iii-grandchildren-reach-westminster",
        "title": "Queen Charles III, Grandchildren Reach Westminster Hall",
        "description": "<b>Meghan Markle</b> finds Westminster Abbey on the State Funeral off King E II toward . Brand new Duchess off Sussex arrived in a motor vehicle with Prince Harry, which upcoming entered a parade at the rear of brand new coffin. Christopher Furlong/Getty Pictures ..."
    }
]