[
    {
        "url": "https://nypost.com/2024/02/01/entertainment/new-suits-pilot-suits-la-in-the-works-at-nbc/",
        "title": "New ‘Suits’ pilot, ‘Suits: LA,’ in the works at NBC",
        "description": "The pilot revolves around “Ted Black, a former federal prosecutor from New York” who “has reinvented himself representing the most powerful clients in Los Angeles.”"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13035663/Suits-creators-new-LA-based-legal-drama-lands-pilot-order-NBC.html",
        "title": "Suits creator&#39;s new LA-based legal drama lands pilot order at NBC - but will <b>Meghan Markle</b> return for shock spin-off?",
        "description": "The new drama from Suits creator Aaron Korsh tells the tale of the life and loves of toilers in a Hollywood law firm - after the huge renewed success of the original series which starred <b>Meghan Markle</b> and ran from 2011-2019. Suits: LA will follow Ted ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/royal-family-shuts-door-prince-32026750",
        "title": "Royal Family &#39;shuts the door&#39; on Prince Harry and <b>Meghan Markle</b> with tight-lipped tactic",
        "description": "The Royal Family have &#39;no space&#39; for Prince Harry and Meghan Markle anymore, according to Princess Diana&#39;s former butler, who claims the Firm now have a new tactic to deal with them"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-heading-201710043.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Are Heading to Canada This Month for a Special Celebration",
        "description": "Meghan Markle and Prince Harry are heading to Canada for an exciting countdown."
    },
    {
        "url": "https://www.instyle.com/meghan-markle-prince-harry-netflix-movies-series-8557600",
        "title": "<b>Meghan Markle</b> and Prince Harry Have So Many New Projects at Netflix",
        "description": "Netflix&#39;s content chief Bela Bajaria shared details about Meghan Markle and Prince Harry&#39;s upcoming projects with the streamer."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862275/Prince-Harry-Meghan-Markle-canada-invictus-games",
        "title": "Prince Harry and <b>Meghan Markle</b> to return to Canada in just a few weeks time",
        "description": "Prince Harry and Meghan Markle first spent some month living in Canada when they quit the Royal Family in 2020."
    },
    {
        "url": "https://uk.movies.yahoo.com/netflix-chief-teases-meghan-markle-190919166.html",
        "title": "Netflix Chief Teases <b>Meghan Markle</b> and Prince Harry&#39;s Upcoming Projects, from Movie to Unscripted Shows",
        "description": "Chief Content Officer Bela Bajaria shared what the Duke and Duchess of Sussex are working on at the Next on Netflix event"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25661652/inside-harry-meghans-bid-rescue-netflix-deal/",
        "title": "Inside Harry &amp; <b>Meghan</b>’s last ditch bid to rescue ‘ticking time bomb’ £80m Netflix deal with ‘unscripted’ shows &amp; film",
        "description": "PRINCE Harry and Meghan Markle are said to be making a last-ditch bid to rescue their £80million Netflix deal. The Duke and Duchess of Sussex are planning “unscripted” shows and a film"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-lay-off-kate-middleton-meghan-markle-career-move/",
        "title": "Harry warned to ‘lay off’ Kate as <b>Meghan</b> mulls ‘explosive’ career move",
        "description": "Paul Burrell worked for Princess Diana for more than a decade until her sudden death in 1997, and claimed Harry &#39;has a nerve&#39; to upset his sister-in-law. “I understand why they are upset, because Kate went to great lengths to find out if a royal life was for her and it caused her issues,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512574/prince-harry-meghan-markle-reveal-their-2024-valentine-day-plans-all-the-details/",
        "title": "Prince Harry and <b>Meghan Markle</b> reveal they will spend Valentine&#39;s Day in Canada",
        "description": "The Duke and Duchess of Sussex will be spending Valentine&#39;s Day 2024 celebrating a cause close to their hearts, as they will attend the Invictus Games&#39; One Year to Go event later this month in Canada."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-future-32022959",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s future at Netflix revealed before contract expires",
        "description": "Meghan Markle and Prince Harry are facing the end of their Netflix deal, but it seems all is not lost as the streaming service&#39;s chief content officer has made a big announcement"
    },
    {
        "url": "https://www.standard.co.uk/showbiz/duke-duchess-sussex-netflix-film-documentary-prince-harry-meghan-markle-b1136425.html",
        "title": "Duke and Duchess of Sussex working on a &#39;bunch&#39; of Netflix projects",
        "description": "The Duke and Duchess of Sussex are developing “a bunch” of projects with Netflix including documentaries and a film, according to a senior executive at the streaming giant. The firm’s chief content officer Bela Bajaria told a Hollywood event the couple’s projects include “a couple of unscripted things” and a series."
    },
    {
        "url": "https://uk.news.yahoo.com/harry-meghan-no-parent-keep-154606030.html",
        "title": "Harry and <b>Meghan</b> Say No Parent Can Keep Their Child Safe From Social Media",
        "description": "Andrew Milligan/Pool/ReutersPrince Harry and Meghan Markle have issued an emotional statement saying that parents are powerless to keep children “safe” from social media platforms.The statement on their Archewell website comes after Mark Zuckerberg and other social media CEOs appeared Wednesday before the U."
    },
    {
        "url": "https://uk.news.yahoo.com/suits-spin-off-gets-huge-232700839.html",
        "title": "Suits spin-off gets huge update",
        "description": "The Suits spin-off show is officially moving forward with a pilot order at NBC. According to TVLine, Suits: L.A. will introduce a brand new character, Ted Black, as a former federal prosecutor who moves his high-powered practice from New York to Los Angeles."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-ghost-memoir-causing-32022393",
        "title": "<b>Meghan Markle</b>&#39;s ghost memoir causing problems already as she&#39;s issued major warning",
        "description": "After quitting the royal family in 2020, Harry and Meghan signed a lucrative book deal with Penguin Random House."
    },
    {
        "url": "https://uk.style.yahoo.com/vince-mcmahon-gone-more-takeaways-140000815.html",
        "title": "Vince McMahon Is “Gone” and More Takeaways From Netflix’s Press Day",
        "description": "Ahead of next week’s semi-annual Television Critics Association press tour, Netflix staged its own press event Wednesday — dubbed Next on Netflix — at its Tudum Theater in Hollywood. Content chief Bela Bajaria and her top lieutenants,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862108/King-Charles-Meghan-Markle-nickname-Katie-Nicholl",
        "title": "King Charles gave <b>Meghan Markle</b> a meaningful nickname despite royal drama",
        "description": "King Charles had a no-nonsense nickname for Meghan Markle despite the drama unfolding within the Royal Family."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-meghan-rare-message-child-safety-online/",
        "title": "Harry and <b>Meghan</b> share rare and emotional message as they call for urgent change to child safety online",
        "description": "Prince Harry and Meghan Markle have issued a rare and emotional message on child safety on social media. Harry and Meghan spoke out after chief executives of Meta, TikTok, X and other social media giants gave evidence before the US Senate Judiciary Committee on Wednesday."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512545/prince-harry-meghan-markle-film-project-revealed-by-netflix-chief-content-officer/",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s latest film project revealed - report",
        "description": "Prince Harry and Meghan Markle have a busy year ahead. The couple – who signed with Netflix in 2020 – have several projects in the works, including an upcoming movie. Asked about the royal duo&#39;s slate, Netflix&#39;s Chief Content Officer Bela Bajaria confirmed: &quot;They have a couple of unscripted things they&#39;re working on with Brandon [Reigg]."
    },
    {
        "url": "https://metro.co.uk/2024/02/01/alison-hammonds-clarksons-farm-visit-descends-chaos-20207973/?ico=trending-module_author_meghna-amin_item-1",
        "title": "Alison Hammond screams, falls and runs away from cows as This Morning descends into chaos",
        "description": "The This Morning presenter, 48, ran screaming from cows, took a little tumble, and even downed a shot of whisky at the former Top Gear presenter’s Oxfordshire farm. Clarkson, 63, his partner Lisa Hogan, and the star of the show Kaleb Cooper are returning for a third instalment of the Amazon Prime series, which first aired in 2021."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-harry-meghan-markle-break-32020550",
        "title": "Prince Harry and <b>Meghan Markle</b> break silence with emotional and rare message about children&#39;s safety",
        "description": "Fans praised the Duke and Duchess of Sussex as they spoke out about the ongoing issue of online safety for children."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032173/Prince-Harry-Meghan-Markle-new-video-child-online-safety.html",
        "title": "Harry and <b>Meghan</b> release video of Duchess telling families of children who have been victims of cyber bullying that &#39;we all just want to feel safe&#39; as couple front campaign ...",
        "description": "The Duke and Duchess of Sussex released the clip last night which was filmed during their appearance at a World Mental Health Day event in New York on October 10 last year."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25647972/prince-harry-meghan-markle-parenting-children/",
        "title": "Prince Harry and <b>Meghan Markle</b> open up on parenting ‘heartache’ &amp; demand change to ‘keep our children safe’",
        "description": "PRINCE Harry and Meghan Markle have called for an urgent change to “keep our children safe” on social media. The Duke and Duchess of Sussex said they had heard the"
    },
    {
        "url": "https://nypost.com/2024/02/01/entertainment/netflix-teases-great-meghan-markle-prince-harry-upcoming-projects-as-part-of-100m-deal/",
        "title": "Netflix teases ‘great’ <b>Meghan Markle</b>, Prince Harry upcoming projects as part of $100M deal",
        "description": "Bela Bajaria, Netflix’s Chief Content Officer, revealed what types of projects Prince Harry and Meghan Markle are working on for the streamer under their estimated $100 million deal with the platform. “They have a couple of unscripted things they’re working on with Brandon [Reigg],” Bajaria said, according to People."
    },
    {
        "url": "https://www.tvfanatic.com/2024/02/emily-in-paris-harry-and-meghan-michael-shannon-as-a-us-presiden/",
        "title": "Emily In Paris, Harry and <b>Meghan</b>, Michael Shannon as a US President: Netflix Is All Over the Map With Their 2024 Content Strategy",
        "description": "Netflix announced its slate of new TV series this week. And to say that we&#39;ve got a mixed bag of content ahead would be putting it very, very mildly."
    },
    {
        "url": "https://www.skynews.com.au/world-news/united-states/netflix-says-sussexes-have-a-bunch-of-projects-in-development/video/f149b4419076a0d6a03339a1b4a5e067",
        "title": "Netflix says Sussexes have ‘a bunch’ of projects in development",
        "description": "Prince Harry and Meghan Markle have &quot;a bunch&quot; of projects in development, according to Netflix. Chief Content Officer Bela Bajaria told Hollywood insiders the couple has multiple projects – including unscripted – in the early works. One film project is thought to be an adaption of the novel, &#39;Meet Me at the Lake&#39;."
    },
    {
        "url": "https://popculture.com/tv-shows/news/meghan-markle-wont-star-in-suits-spinoff-heres-why/",
        "title": "<b>Meghan Markle</b> Won&#39;t Star in &#39;Suits&#39; Spinoff — Here&#39;s Why",
        "description": "Not much else is known about the new series, and while it is disappointing that fans won&#39;t be able to look forward to seeing their favorites return as series regulars, there is always the potential that they could swing by Los Angeles for a visit."
    },
    {
        "url": "https://www.simplemost.com/harry-and-meghan-are-working-on-a-bunch-of-new-projects-with-netflix/",
        "title": "Netflix says Prince Harry and <b>Meghan Markle</b> have several projects in the works",
        "description": "The Duke and Duchess of Sussex inked a five-year deal with Netflix in 2020, creating their own production company Archewell Productions under Netflix’s umbrella. According to Netflix’s chief content officer Bela Bajaria, a documentary, a film and a series are all currently in production."
    },
    {
        "url": "https://www.allvipp.com/royals/harry-and-meghan-share-heartfelt-pledge-for-child-safety-online",
        "title": "Harry And <b>Meghan</b> Share Heartfelt Pledge For Child Safety Online",
        "description": "Harry and Meghan join the fight for child safety online, supporting parents at a Senate hearing to push for vital reforms in the digital world."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-and-harry-speak-out-for-online-safety-after-a-senate-hearing",
        "title": "<b>Meghan</b> and Harry Speak Out for Online Safety After a Senate Hearing",
        "description": "In a statement, the Duke and Duchess said they “applaud the bravery and determination” of parents who are organizing to improve social media for youth across America."
    },
    {
        "url": "https://news.yahoo.com/meghan-markle-prince-harry-applaud-192241385.html",
        "title": "<b>Meghan Markle</b> and Prince Harry ‘applaud’ families for speaking up during Senate hearing on online bullying",
        "description": "Meghan Markle and Prince Harry attend the “Big Tech and the Online Child Sexual Exploitation Crisis” hearing. Meghan Markle and […] The post Meghan Markle and Prince Harry ‘applaud’ families for speaking up during Senate hearing on online bullying appeared first on TheGrio."
    },
    {
        "url": "https://www.barrons.com/articles/its-one-of-americas-most-expensive-cities-and-home-buyers-cant-get-enough-3d6b8056",
        "title": "It’s One of America’s Most Expensive Cities, and Home Buyers Can’t Get Enough",
        "description": "A metro area on California’s central coast ranked No. 1 in the latest WSJ/Realtor.com Emerging Housing Markets Index"
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/prince-harry-and-meghan-markle-issue-warning-for-childrens-safety/",
        "title": "Prince Harry and <b>Meghan Markle</b> issue warning for children’s safety",
        "description": "Prince Harry and his wife Meghan Markle are issuing a new warning for children&#39;s safety on their foundation&#39;s website."
    },
    {
        "url": "https://people.com/meghan-markle-prince-harry-upcoming-netflix-projects-2024-8557562",
        "title": "Netflix Chief Teases <b>Meghan Markle</b> and Prince Harry&#39;s Upcoming Projects, from Movie to Unscripted Shows",
        "description": "Netflix&#39;s Chief Content Officer Bela Bajaria revealed that Meghan Markle and Prince Harry have a movie, TV show and unscripted shows in the works for the streamer."
    },
    {
        "url": "https://www.thedailybeast.com/prince-harry-and-meghan-markle-say-no-parent-can-keep-their-child-safe-from-social-media",
        "title": "Harry and <b>Meghan</b> Say No Parent Can Keep Their Child Safe From Social Media",
        "description": "The best parenting in the world cannot keep children safe from these platforms,” the couple said the day after Mark Zuckerberg and other tech CEOs appeared at a Senate hearing."
    },
    {
        "url": "https://www.fox5ny.com/news/older-tv-shows-dominate-streaming-trends-suits",
        "title": "&#39;Suits&#39; and the return of older TV shows dominate streaming trends",
        "description": "SUITS -- Season 1 -- Pictured: (l-r) Gina Torres as Jessica Pearson, Rick Hoffmann as Louis Litt, <b>Meghan Markle</b> as Rachel Zane, Gabriel Macht as Harvey Specter, Patrick Adams as Mike Ross -- (Photo by: Frank Ockenfels/USA/NBCU Photo Bank/NBCUniversal The ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-and-king-charles-health-crisis-could-end-feud-with-prince-harry.html/",
        "title": "Kate Middleton and King Charles Health Crisis Could End Feud With Prince Harry",
        "description": "Kate Middleton and King Charles&#39; recent health struggles could be the bridge that reconciles their feud with Prince Harry."
    },
    {
        "url": "https://www.aol.com/lifestyle/meghan-markle-worn-brand-just-153000171.html",
        "title": "This <b>Meghan Markle</b>-Worn Brand Just Launched a Stylish Handbag Collection",
        "description": "Since its inception in 2010, Veronica Beard has earned a name for itself for its stylish dickey jackets and cool wardrobe staples. It has also become the go-to brand for the stars, most notably Meghan Markle, who has stepped out in its pieces various times over the years."
    },
    {
        "url": "https://www.aol.com/lifestyle/prince-harry-meghan-markle-applaud-151200174.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Applaud the Senate&#39;s Online Child Safety Hearing",
        "description": "Yesterday, the the Senate Judiciary Committee hosted a hearing on online child safety, with five chief executives (from Meta, TikTok, Discord, Snap, and X) testifying in front of senators."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/01/prince-harry-meghan-publicity-jamaica-anti-monarchy-pm/",
        "title": "Harry and <b>Meghan</b> gave Jamaica ‘more publicity’, says anti-monarchy PM",
        "description": "Andrew Holness ‘shrugs off’ controversy over red carpet photo with the Sussexes and says he was ‘very happy’ to see them"
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/meghan-markle-scores-her-first-165234917.html",
        "title": "<b>Meghan Markle</b> Scores Her First Big Win in 2024 With a Major Business Deal",
        "description": "Meghan Markle invested in a small business that had some royal watchers scratching their heads. Why would the Duchess of Sussex be interested in a brand that makes instant-drink mixes for plant-based lattes?"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-trainor-admits-shes-worst-163603528.html",
        "title": "<b>Meghan</b> Trainor Admits She&#39;s the &#39;Worst&#39; at Sleep Training Son Barry: He&#39;s a &#39;Fun Challenge&#39; (Exclusive)",
        "description": "While chatting with PEOPLE about her recent collaboration with Nanit, a smart baby monitor and app, the musician and boy mom, 30, got candid about the beginnings of sleep training her 6-month-old son Barry. Trainor shares her two sons — Barry and Riley, who turns 3 next month — with husband Daryl Sabara, 31."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-glamorous-evening-gowns-fashion-1865990",
        "title": "<b>Meghan Markle</b>&#39;s 5 Most Glamorous Evening Gowns",
        "description": "Since marrying Prince Harry, Meghan has worn a spectacular array of regal evening gowns for high-profile events."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153618-meghan-markle-prince-harry-actively-engage-in-multiple-new-netflix-projects",
        "title": "<b>Meghan Markle</b>, Prince Harry actively engage in &#39;multiple new Netflix projects&#39;",
        "description": "Prince Harry and Meghan Markle are actively involved in multiple new Netflix projects, including a film and two other &#39;unscripted&#39; projects, as disclosed by a company executive. In 2020, the"
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/meghan-markle-prince-harry-just-161910300.html",
        "title": "<b>Meghan Markle</b> &amp; Prince Harry Just Issued a Very Rare Statement and It All Has to Do with Their Kids",
        "description": "Prince Harry and Meghan Markle just released a rare statement in honor of their two children, Archie, 4, and Lilibet, 2. Today, the Duke, 39, and Duchess of Sussex, 42, broke their silence following the U."
    },
    {
        "url": "https://www.itv.com/news/2024-02-01/harry-and-meghan-call-for-urgent-change-to-protect-children-on-social-media",
        "title": "Harry and <b>Meghan</b> call for urgent change to protect children on social media",
        "description": "It comes after a US Congressional hearing on the issue where Meta CEO Mark Zuckerberg apologised to parents of children who killed themselves over online abuse. | ITV National News"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/celebrities/piers-morgan-calls-for-the-presenter-to-be-re-investigated-grow-and-he-has-prince-harry-to-blame_art20988.html",
        "title": "Piers Morgan: Calls for the presenter to be re-investigated grow and he has Prince Harry to blame",
        "description": "TV presenter and journalist Piers Morgan is once again in the spotlight because of his potential involvement in phone hacking. And this time, Prince Harry might be at the"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-hug-32018421",
        "title": "<b>Meghan Markle</b> and Prince Harry hug parents as they speak out over tragic children&#39;s deaths",
        "description": "The Duke and Duchess of Sussex have been seen hugging parents over the loss of children at a mental wellness summit as they called for urgent change to child safety on social media"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-warned-stay-32017693",
        "title": "Prince Harry and <b>Meghan</b> warned to stay away from Kate as they plot new bombshell memoir",
        "description": "Meghan Markle has reportedly been working on telling her own version of events in a new book of her own behind the scenes which could divulge details on her frosty relationship with Kate Middleton."
    },
    {
        "url": "https://uk.news.yahoo.com/vince-mcmahon-gone-more-takeaways-140000815.html",
        "title": "Vince McMahon Is “Gone” and More Takeaways From Netflix’s Press Day",
        "description": "Ahead of next week’s semi-annual Television Critics Association press tour, Netflix staged its own press event Wednesday — dubbed Next on Netflix — at its Tudum Theater in Hollywood. Content chief Bela Bajaria and her top lieutenants,"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/meghan-markle-prince-harry-share-032457586.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Share Emotional Message After Senate Child Safety Hearing",
        "description": "Meghan Markle and Prince Harry are expressing their support following the U.S. Senate Judiciary Committee&#39;s hearing on online safety for children on Wednesday."
    }
]