[
    {
        "url": "https://www.independent.co.uk/arts-entertainment/music/news/kelly-osbourne-nepo-baby-ozzy-sharon-b2481186.html",
        "title": "Kelly Osbourne says she’s ‘proud to be a nepo baby’",
        "description": "Kelly Osbourne has hit back at critics who have called her a “nepo baby” by saying she’s “proud” of that status. Osbourne, 39, is the daughter of Black Sabbath frontman Ozzy Osbourne and his manager Sharon Osbourne. She first shot to fame in 2002 when the family appeared together on the groundbreaking MTV reality show The Osbournes."
    },
    {
        "url": "https://metro.co.uk/2024/01/18/piers-morgan-still-talking-meghan-markle-2024-20138782/?ico=just-in_home_just-in",
        "title": "It’s 2024 and Piers Morgan is still talking about <b>Meghan Markle</b>",
        "description": "A leopard never changes its spots and that’s certainly true of Piers Morgan, who can’t seem to let go of his obsession with Meghan Markle. It is now 2024 yet the TalkTV host, 58, apparently had nothing better to discuss than a two-year-old feud with the Duchess of Sussex, 42, and her husband Prince Harry, 39."
    },
    {
        "url": "https://www.hellomagazine.com/film/511621/meghan-markle-set-for-return-to-acting-in-suits-creators-new-spin-off/",
        "title": "<b>Meghan Markle</b> ‘set for return’ to acting in Suits creator&#39;s new spin-off",
        "description": "The recent reunion of the Suits cast at the Golden Globes has sparked renewed interest in the hit series, especially in light of rumors about a new LA-based spin-off show that intriguingly includes a character seemingly crafted for Meghan Markle ."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-william-visited-kate-middleton-173451359.html",
        "title": "Prince William Visited Kate Middleton in the Hospital After Her Surprise Surgery",
        "description": "Prince William is stepping up to the plate as a supportive husband after it was announced that Kate Middleton was hospitalized following an abdominal surgery. The royal was spotted leaving the private hospital on Thursday — in an Audi e-Tron GT Carbon Vorsprung, to be exact — after a &quot;low-key visit,&quot; according to The Independent."
    },
    {
        "url": "https://www.thetimes.co.uk/article/suits-spin-off-to-star-character-inspired-by-meghan-markle-m7pp9dxdv",
        "title": "<b>Meghan Markle</b> II? Suits spin-off character has a familiar feel",
        "description": "A reboot of the series that shot the Duchess of Sussex to fame features Erica — and has got the entertainment industry talking about a possible return"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857262/prince-harry-meghan-markle-fans-disgusting-comments",
        "title": "Prince Harry and <b>Meghan Markle</b> fans spark outrage over &#39;disgusting&#39; Princess Kate comments",
        "description": "Fans of the Sussexes appeared to take aim at the Princess of Wales and a royal commentator has hit out at them branding their comments &quot;disgusting&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12977963/zara-mike-tindall-royal-family-monarchy-princess-anne.html",
        "title": "Is it time for Mike and Zara Tindall to replace Prince Harry and <b>Meghan Markle</b>? Popular couple are already comfortable in the limelight - and swapping their money-making deals ...",
        "description": "The couple, who live together on Princess Anne &#39;s Gatecombe Estate in Gloucestershire, already have a closeness with the Wales family, are very popular with the public."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857227/mehan-markle-prince-harry-overshadowed-zara-mike-tindall",
        "title": "<b>Meghan Markle</b> and Prince Harry &#39;risk being overshadowed&#39; by Zara and Mike Tindall",
        "description": "Meghan Markle and Prince Harry have experienced considerable ups and downs with their popularity since they stepped back from their institutional roles."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-copyrighted-lilibets-name-31900517",
        "title": "<b>Meghan Markle</b> &#39;copyrighted&#39; Lilibet&#39;s name &#39;before giving birth&#39;, claims expert",
        "description": "The Sussexes&#39; named their daughter Lilibet after the Queen&#39;s childhood nickname which is said to have left the late monarch &#39;furious&#39; as they didn&#39;t ask for her permission, according to claims made in a new royal book."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/things-meghan-harry-been-snubbed-31910516",
        "title": "All the things <b>Meghan</b> and Harry have been snubbed from as they face make or break year",
        "description": "Prince Harry and Meghan Markle have faced a fair few snubs from their family, friends and neighbours and have missed out on invites despite facing their &#39;make or break&#39; this year"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-copyright-lilbet-name-31909336",
        "title": "<b>Meghan Markle</b> &#39;copyrighted the name of daughter Lilibet before birth&#39; says royal expert",
        "description": "Meghan Markle allegedly copyrighted the name Lilibet before she and Prince Harry welcomed their daughter in 2021, claims royal expert Angela Levin, who branded it &#39;disrespectful&#39;"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25403943/princess-lilibet-inherit-gift-meghan-markle-princess-diana/",
        "title": "Princess Lilibet, two, set to inherit £980,000 gift from <b>Meghan Markle</b> &amp; there’s a nod to Princess Diana",
        "description": "SHE’S only two, but Princess Lilibet is set to receive a staggering £980,000 worth of jewellery from mum <b>Meghan Markle</b> in years to come. The Duchess of Sussex, 42, has an impressive collection of jewellery and designer watches that she is expected to ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/seven-harry-meghan-bombshells-new-31908763.amp",
        "title": "Seven Harry and <b>Meghan</b> bombshells from new tell-all book from name row to secret meetings",
        "description": "As an explosive new royal tell-all makes its way to shop shelves, we break down the seven shocking bombshells revealed about Prince Harry and Meghan Markle in the book"
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to Prince Andrew",
        "description": "Despite suggestions from the King for him to shift into Prince Harry and <b>Meghan Markle</b> &#39;s more modest four-bedroom Frogmore Cottage on the Windsor estate, Andrew&#39;s friends affirm that the Royal is not intending to consider alternate accommodation options."
    },
    {
        "url": "https://theblast.com/572026/prince-harry-living-legend-of-aviation-award-influenced-john-travolta/",
        "title": "Prince Harry’s ‘Living Legend’ Award Was Allegedly Influenced By A Hollywood Star",
        "description": "He has dedicated his life to advancing causes that he is passionate about and that bring about permanent change for people and places.” However, it remains unclear if Harry or his wife, the Duchess of Susses <b>Meghan Markle</b>, will attend the ceremony."
    },
    {
        "url": "http://tsss.ca/uncategorized/king-charles-iii-grandkids-arrived-at-westminster",
        "title": "King Charles III, Grandkids Arrived at Westminster Hall",
        "description": "King Charles III, Grandkids Arrived at Westminster Hall Meghan Markle gets to Westminster Abbey toward Condition Funeral service of Queen Age II toward . The latest Duchess off Sussex found its way to an auto having Prince Harry,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harrys-blatant-attack-kate-middleton-lowest-of-the-low-prince-william-biography.html/",
        "title": "Prince Harry’s ‘Blatant Attack’ on Kate Middleton Was the ‘Lowest of the Low’ for Prince William — Biography",
        "description": "A new biography claims Prince William took a comment Prince Harry made in &#39;Harry &amp; Meghan&#39; as a &#39;blatant attack&#39; on his wife, Kate Middleton."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/prince-harrys-coded-message-on-williams-choice-of-wife-wounded-the-prince-of-wales-royal-author/news-story/34ddd11ac23300867b1b86e11ab16b6c",
        "title": "Prince Harry&#39;s coded message on William&#39;s choice of wife &#39;wounded&#39; the Prince of Wales: royal author",
        "description": "The pair had been arguing over Harry’s wife, <b>Meghan Markle</b>, 42. “It all happened so fast. So very fast. He grabbed me by the collar, ripping my necklace, and he knocked me to the floor,” Harry writes of William. “I landed on the dog’s bowl ..."
    },
    {
        "url": "https://www.sheknows.com/living/articles/2938924/jcrew-winter-weekend-sale/",
        "title": "7 Things Under $70 From J.Crew’s Sale Section Worth Shopping This Weekend — Including *the* <b>Meghan Markle</b> Cardigan",
        "description": "J.Crew is back with another sale this weekend. Take an extra 50% to 60% off on the brands most classic styles, including the Meghan Markle sweater."
    },
    {
        "url": "https://www.sbs.com.au/news/tag/person/meghan-markle-royalty",
        "title": "<b>Meghan Markle</b>/royalty",
        "description": "Meghan Markle/royalty"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/18/65a99072ca4741bf778b45ac.html",
        "title": "What was Prince Harry&#39;s comment that deeply hurt his relationship with his brother William?",
        "description": "Prince Harry&#39;s strained relationship with Prince William has been further strained by the Netflix miniseries &quot;Harry &amp; Meghan,&quot; according to royal author Robert Hardman. In an inter"
    },
    {
        "url": "https://www.aol.com/entertainment/boris-johnson-didn-t-tell-174804485.html",
        "title": "Boris Johnson Didn’t Tell Queen Elizabeth II That His Dog Killed Her Swan",
        "description": "Boris Johnson learned the hard way that Queen Elizabeth II would notice if one of her beloved swans went missing. Amid the COVID-19 pandemic, Elizabeth was “characteristically thoughtful” when she let the former Prime Minister,"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/royal-author-reveals-coded-message-from-prince-harry-that-wounded-prince-william/news-story/9d07cb763033b961feab5fb023261488",
        "title": "Royal author reveals coded message from Prince Harry that ‘wounded’ Prince William",
        "description": "Prince Harry’s estranged relationship with Prince William was dealt a punishing blow in the Netflix miniseries “Harry &amp; Meghan.”"
    },
    {
        "url": "https://nypost.com/2024/01/18/business/spotify-has-600m-users-but-struggles-to-turn-a-profit/",
        "title": "Spotify has 600 million users, but struggles to consistently turn a profit",
        "description": "Though Spotify has a footprint more than twice that of its next-largest competitor, Apple Music, the leading audio-streaming company reported a net loss in 2022."
    },
    {
        "url": "https://www.psychologytoday.com/za/blog/the-psychology-of-relationships/202401/the-power-couple-paradox",
        "title": "The Power Couple Paradox",
        "description": "Power couples are partnerships between highly successful, respected, or influential individuals. Power couple traits often overlap with narcissistic traits, leading to potentially toxic relationships. Competitiveness within power couples can create conflict over attention, leading to animosity."
    },
    {
        "url": "https://pagesix.com/2024/01/18/royal-family/royal-expert-explains-controversy-of-princess-lilibets-name/",
        "title": "Royal expert reveals the real controversy over Prince Harry, <b>Meghan Markle</b> naming daughter Lilibet",
        "description": "Her ringing endorsement was not sought, not given, and you don’t put words in the queen’s mouth,” author Robert Handman told The Post."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1149062-prince-harry-barred-contact-from-palace-amid-ailing-kate-middleton-king-charles",
        "title": "Prince Harry barred contact from Palace amid ailing Kate Middleton, King Charles",
        "description": "Prince Harry is reportedly eager to visit the royal family after the Palace laid bare current health conditions of King Charles and Kate Middleton.An official statement from Kensington"
    },
    {
        "url": "https://www.yahoo.com/entertainment/suits-spin-off-lead-character-162520800.html",
        "title": "Suits Spin-off Lead Character Description Unveiled",
        "description": "The first character and plot details for NBCUniversal’s upcoming Suits spin-off have finally been revealed after over three months since the project was announced. According to Puck’s Matthew Belloni,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163363/20240118/prince-harry-comments-on-royal-marriages-stir-controversy-prince-william-wounded-by-brothers-disclosure.htm",
        "title": "Prince Harry&#39;s Comments on Royal Marriages Stir Controversy, Prince William &#39;Wounded&#39; by Brother&#39;s Disclosure",
        "description": "Prince Harry in the Netflix miniseries &quot;Harry &amp; Meghan&quot; have added fuel to the fire of his strained relationship with his brother, Prince William. Royal author Robert Hardman, in his new book &quot;The Making of a King: King Charles III and the Modern Monarchy,"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-could-inherit-980000-worth-of-jewellery-from-meghan-and-princess-diana_art20822.html",
        "title": "Princess Lilibet could inherit £980,000 worth of jewellery from <b>Meghan</b> and Princess Diana",
        "description": "Princess Lilibet is expected to be the owner of some of history’s most impressive jewellery pieces. From Meghan Markle’s collection to Princess Diana’s, here’s what she could"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/seven-harry-meghan-bombshells-new-31908763",
        "title": "Seven Harry and <b>Meghan</b> bombshells from new tell-all book from name row to secret meetings",
        "description": "As an explosive new royal tell-all makes its way to shop shelves, we break down the seven shocking bombshells revealed about Prince Harry and Meghan Markle in the book"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511491/prince-william-and-kates-unknown-kind-gesture-to-prince-harry-and-meghan-markle-after-queens-death-revealed/",
        "title": "Prince William and Kate&#39;s unknown kind gesture to Prince Harry and <b>Meghan</b> after Queen&#39;s death revealed",
        "description": "Over the past couple of years, there has been much attention on Prince William and Prince Harry &#39;s strained relationship. The fractured ties were closely monitored during the period of mourning after Queen Elizabeth&#39;s death in September 2022 when the Waleses and Sussexes came together."
    },
    {
        "url": "https://metro.co.uk/2024/01/17/south-park-episodes-banned-offensive-20132239/?ico=trending-module_tag_us-tv-news_item-2",
        "title": "All the South Park episodes banned for being too ‘offensive’",
        "description": "South Park is no stranger to controvery and lampooning the rich and famous, having ‘ruined’ Ed Sheeran’s life and ‘annoyed and overwhelmed’ <b>Meghan Markle</b>. The cartoon’s 299th episode, named Band in China, featured storylines so critical of ..."
    },
    {
        "url": "https://www.yahoo.com/entertainment/harry-meghan-did-permission-queen-211731386.html",
        "title": "Harry &amp; <b>Meghan</b> DID Get Permission To Use Queen Elizabeth II Name For Daughter",
        "description": "Duke and Duchess of Sussex, Prince Harry and <b>Meghan Markle</b>, DID get permission from the late Queen Elizabeth II to name their daughter her childhood nickname &quot;Lilibet.&quot; As we reported, it was earlier claimed that the couple lied when they revealed that the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-one-word-reply-31893225?int_source=nba",
        "title": "<b>Meghan Markle</b>&#39;s one-word reply after Prince William&#39;s reaction to Oprah Winfrey chat",
        "description": "<b>Meghan Markle</b> had a one word response for Prince William&#39;s reaction to her and Prince Harry&#39;s bombshell interview with Oprah Winfrey. The Duchess of Sussex simply replied &#39;wow&#39; after her husband showed her a text message from his elder brother in the wake of their controversial tell-all interview with the iconic US chat show host in 2021."
    }
]