[
    {
        "url": "https://uk.style.yahoo.com/king-charles-returns-london-ahead-181039804.html",
        "title": "King Charles Returns to London Ahead of Surgery for Enlarged Prostate",
        "description": "King Charles is back in London. The monarch, 75, traveled over 100 miles from the royal residence at Sandringham back to London on Thursday ahead of his surgery for an enlarged prostate scheduled for this week. Photos published by The Sun showed that King Charles arrived by helicopter before being driven to Buckingham Palace."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1859879/prince-harry-meghan-markle-shame",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s shame laid bare in key detail on website",
        "description": "Prince Harry and Meghan signed a Spotify deal which came to an abrupt end, saying the decision was &quot;mutual&quot; and they were &quot;proud&quot; of what they achieved."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1859862/meghan-markle-prince-harry-jamaica",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s move &#39;stinks to high heaven&#39; after glitzy event",
        "description": "The Duke and Duchess have been accused of &quot;exploiting&quot; events as they dodge publicly mentioning their relatives&#39; health."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25489540/meghan-markle-prince-harrys-biggest-gaffes-revealed/",
        "title": "<b>Meghan Markle</b> and Prince Harry’s biggest gaffes revealed – from Jamaica visit to Lilibet name",
        "description": "MEGHAN Markle and Prince Harry’s biggest gaffes have been revealed – from their Jamaica visit to naming their youngest Lilibet. The Duke and Duchess of Sussex have shown their"
    },
    {
        "url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/womens-accessories/kimai-lab-grown-diamonds-gold-engagement-b2483198.html",
        "title": "Kimaï’s lab-grown diamonds are a girl’s new best friend – and come <b>Meghan Markle</b>-approved",
        "description": "Founded in 2018, Kimaï has already acquired a loyal following, including the likes of Meghan Markle and Emma Watson – and it’s set for further fame with an appearance on this week’s episode of Dragons’ Den, which will air on BBC One on 25 January. To mark the occasion, we’ve rounded up the crown jewels of Kimaï’s lab-grown diamond collection."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markles-impressive-job-title-24045614.amp",
        "title": "<b>Meghan Markle</b>&#39;s impressive job title on Archie&#39;s birth certificate - and baffling change",
        "description": "Meghan Markle and Prince Harry caused confusion when they changed Prince Archie&#39;s birth certificate when he was a few months old - but they quickly rubbished reports of a &#39;snub&#39;"
    },
    {
        "url": "https://uk.movies.yahoo.com/body-language-expert-says-meghan-152900930.html",
        "title": "A Body Language Expert Says <b>Meghan Markle</b> And Prince Harry Showed &#39;Unity&#39; At Film Premiere",
        "description": "A body language expert weighed in on Meghan Markle and Prince Harry&#39;s body language during the premiere of &#39;Bob Marley: One Love&#39; in Kingston, Jamaica."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25498530/who-jessica-ware-sidney-neuhaus-kimai/",
        "title": "Who is Jessica Warch and Sidney Neuhaus and when did they launch their jewellery brand Kimai?",
        "description": "This came after <b>Meghan Markle</b> wore their £495 Felicity earrings to London charity Smart Works. Speaking about the moment they found out the Duchess of Sussex loved their diamonds, Jessica told the Mail: ‘It was insane. Our sales went crazy."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-telling-gesture-exposes-31964448",
        "title": "<b>Meghan Markle</b> in &#39;telling gesture&#39; that exposes state of marriage to Prince Harry",
        "description": "While attending the premiere of a new movie about Bob Marley, Prince Harry and Meghan Markle wanted to look like an &#39;ongoing power couple&#39;, body language expert Judi James said"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-chemistry-182818660.html",
        "title": "Prince Harry and <b>Meghan Markle</b>’s ‘chemistry’ caught on camera in Jamaica",
        "description": "The Duke and Duchess of Sussex recently attended a screening of the forthcoming Bob Marley biopic, which stars Kingsley Ben-Adir as the Jamaican singer-songwriter, at the Carib Theatre in Kingston on 23 January. In a video posted to TikTok, one fan captured the touching moment Meghan, 42, reached for Harry, 39, during the event."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-slammed-31965201",
        "title": "Prince Harry and <b>Meghan Markle</b> slammed for publicly ignoring Kate and Charles&#39; health issues",
        "description": "The Sussexes have chosen to remain silent while the Princess of Wales is recovering in hospital from abdominal surgery and the King is preparing for a corrective procedure on an enlarged prostate."
    },
    {
        "url": "https://thetab.com/uk/2024/01/25/sushi-park-los-angeles-dua-lipa-kendall-jenner-348360",
        "title": "Inside Sushi Park: The inconspicuous LA restaurant where celebs are snogging in secret",
        "description": "Plenty of catch-ups, kissing and re-kindling goes on at Sushi Park. It’s essentially the Infernos of WeHo, for people who can afford to blow half a month’s rent on some saké, tuna sashimi and a damn good time."
    },
    {
        "url": "https://metro.co.uk/2024/01/25/paul-burrell-really-believes-princess-dianas-ghost-haunting-20171529/?ico=read_full_story_videotrendingbar",
        "title": "The moment Paul Burrell believes Princess Diana’s ghost sends apology from beyond the grave",
        "description": "Paul Burrell is convinced that he is being haunted by the ghost of Princess Diana and the moment he allegedly makes contact with her has been captured."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13005449/harry-meghan-paramount-jamaica-streaming-deal.html",
        "title": "Eyeing up a new streaming deal? As Harry and <b>Meghan</b> are pictured with Paramount TV boss in Jamaica, PR experts say couple will be trying to land their &#39;next ratings winner ...",
        "description": "The Duke and Duchess of Sussex were invited to Jamaica for a Bob Marley film premiere by the family of Paramount Pictures chief executive Brian Robbins - with whom they are &#39;personal friends&#39;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-seems-solve-mystery-31964239",
        "title": "<b>Meghan Markle</b> seems to solve mystery of missing engagement ring during red carpet event",
        "description": "The Duchess of Sussex seemed to be wearing her diamond ring again this week while she attended the film premiere of Bob Marley: One Love in Jamaica with Prince Harry."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13004597/Harry-Meghan-invited-Bob-Marley-premiere-Jamaica-Paramount-boss-Brian-Robbins.html",
        "title": "Harry and <b>Meghan</b> were invited to Bob Marley premiere in Jamaica by Paramount boss - after &#39;insensitive&#39; Duke and Duchess were slammed for posing with anti-royal Prime Minister ...",
        "description": "The Duke and Duchess of Sussex are friends with the family of Brian Robbins, a source told MailOnline. The father-of-three is the chief executive of both Paramount Pictures and Nickelodeon."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512026/meghan-markles-face-transformation-missed/",
        "title": "<b>Meghan Markle</b>&#39;s subtle transformation that you might have missed",
        "description": "Meghan Markle is always preened to perfection whenever she steps out into the limelight, and this week was no different. The former Suits star, who has travelled to Jamaica with Prince Harry, wowed on the red carpet when she attended the Bob Marley: One Love premiere in Kingston."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/wish-list/512009/best-chic-affordable-bridesmaid-dresses/",
        "title": "Affordable Bridesmaid Dresses: The chicest dresses under £150",
        "description": "Though they’ve all got differing colour schemes, wedding destinations and numbers of bridesmaids, the common issue between all three brides is affordability when it comes to chic bridesmaid dresses."
    },
    {
        "url": "https://uk.yahoo.com/news/prince-harry-gap-yah-necklace-055000350.html",
        "title": "Prince Harry’s &#39;gap yah&#39; necklace is a sex-charged catwalk hit",
        "description": "Prince Harry&#39;s signature rope pendant necklace sees him join legions of fashion boys subverting the &#39;gap yah&#39; staple this season, says"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markles-royal-exit-source-regret-monarchy-says-author-1722985",
        "title": "Prince Harry, <b>Meghan Markle</b>&#39;s Royal Exit A &#39;Source Of Regret&#39; For Monarchy, Says Author",
        "description": "The Duke and Duchess of Sussex stepped back from their royal duties in 2020 and now run their own non-profit organisation in California."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-health-very-worrying-28513512",
        "title": "Kate Middleton health &#39;very worrying&#39; and she&#39;ll be laid up &#39;longer than we think&#39;",
        "description": "And you know, one in eight men get this prostate problem.&quot; Nana said she is &quot;not surprised&quot; Prince Harry and <b>Meghan Markle</b> have stayed silent. Nana told GB News: &quot;<b>Meghan</b> has not yet gone to visit her father as far as we know, who is very ill and may well ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-surgery-serious-in-28508095",
        "title": "Kate Middleton surgery &#39;serious&#39; but she is &#39;in great hands&#39;",
        "description": "Royal commentator Phil Dampier believes Prince Harry and <b>Meghan Markle</b>&#39;s reputation is being worsened the longer they continue not to release a statement on Kate. “If they had made a public declaration, there would be a certain sympathy for them”, he said."
    },
    {
        "url": "https://uk.yahoo.com/style/meghan-markle-wore-thing-carolina-153536463.html",
        "title": "<b>Meghan Markle</b> Wore a Thing: Carolina Herrera in Jamaica for &#39;Bob Marley&#39; Premiere Edition",
        "description": "<b>Meghan Markle</b> stepped out for an evening at the movies this week. On Tuesday night in Kingston, Jamaica, she attended the premiere of &quot;Bob Marley: One Love&quot; with Prince Harry. For the occasion, she wore an all-black look, layering a floor-length ..."
    },
    {
        "url": "https://madamenoire.com/1359646/meghan-markle-prince-harry-one-live-movie-premiere-jamaica/",
        "title": "<b>Meghan Markle</b> And Prince Harry Spend Date Night At ‘Bob Marley: One Love’ Movie Premiere",
        "description": "Meghan Markel and Prince Harry’s latest date night was at the Bob Marley: One Love movie premiere in Jamaica."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/25/65b2c0e1e2704eedba8b459c.html",
        "title": "Why did the Royal Family differ in response to King Charles and Kate Middleton&#39;s surgeries?",
        "description": "King Charles and Kate Middleton recently disclosed their respective medical procedures, with the former opting for transparency and the latter choosing to keep the details of her s"
    },
    {
        "url": "https://pagesix.com/2024/01/25/royal-family/why-king-charles-revealed-his-surgery-while-kate-middleton-hid-hers/",
        "title": "Why King Charles revealed his surgery while Kate Middleton hid hers",
        "description": "The Princess of Wales, 42, and the head of the British monarchy, 75, announced their respective surgeries on the same day."
    },
    {
        "url": "https://nypost.com/2024/01/25/lifestyle/meet-the-nepo-pets-who-reached-celeb-status-thanks-to-their-famous-owners/",
        "title": "Meet the ‘nepo pets’ who reached celeb status thanks to their famous owners",
        "description": "Nepo pets are the fur babies that ride the cat-tails of their celebrity owners’ success and reach celebrity status of their own — as the celeb’s partner-in-crime or even sometimes becoming more popular than their owners. Meet the nepo pets that have the pup-arazzi all over them:"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meghan-markles-pregnancy-photographer-just-172357765.html",
        "title": "<b>Meghan Markle</b>&#39;s Pregnancy Photographer Was Just Nominated for an Oscar",
        "description": "We imagine that <b>Meghan Markle</b> is thrilled to celebrate her pal and photographer, Misan Harriman, after his major accomplishment this week. In case you missed it, Harriman, who famously spearheaded the duchess&#39;s maternity shoot during her second pregnancy ..."
    },
    {
        "url": "https://ca.finance.yahoo.com/news/kate-middleton-parents-reassuring-presence-171839158.html",
        "title": "Kate Middleton’s Parents ‘Will Be a Reassuring Presence’ When She Goes Home to Recover, Says Insider",
        "description": "Kate&#39;s] parents are an enduring factor in the upbringing of their grandchildren,” a palace insider tells PEOPLE"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/meghan-markle-and-prince-harry-make-surprise-entry-at-bob-marley-movie-premiere-deets-inside-1273993",
        "title": "<b>Meghan Markle</b> And Prince Harry Make Surprise Entry At Bob Marley Movie Premiere; DEETS Inside",
        "description": "Prince Harry and Meghan Markle made a surprise appearance at the premiere of Bob Marley: One Love in Jamaica, walking the red carpet hand-in-hand."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-fans-speculate-if-shes-had-work-done-on-her-face/",
        "title": "<b>Meghan Markle</b> fans speculate if she’s had work done on her face",
        "description": "Fans of the Duchess of Sussex, Meghan Markle, are questioning if she has had any work done on her face recently."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markles-photo-163352186.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>&#39;s Photo With Jamaican Prime Minister Might Not Please King Charles",
        "description": "Prince Harry and Meghan Markle’s appearance at the red-carpet premiere of Bob Marley: One Love on Tuesday night was a delightful surprise. With their low-key approach to media these days, the photos show the Montecito couple living their best lives."
    },
    {
        "url": "https://www.pinkvilla.com/sports/wwe-royal-rumble-2024-full-match-card-preview-predictions-and-possible-fight-order-1274040",
        "title": "WWE Royal Rumble 2024: Full Match Card, Preview, Predictions and Possible Fight Order",
        "description": "All you need to know about WWE Royal Rumble 2024 from Full Match Card, Preview, Predictions and match order, and"
    },
    {
        "url": "https://www.etonline.com/jason-kelces-wife-kylie-reveals-her-hilarious-payback-after-his-shirtless-game-day-celebration",
        "title": "Jason Kelce&#39;s Wife Kylie Reveals Her Hilarious Payback After His Shirtless Game Day Celebration",
        "description": "It sounds like the Kelce family may be adding another member! Kylie Kelce is ready to dole out her payback after husband Jason Kelce &#39;s scene-stealing antics at Sunday&#39;s Chiefs vs. Bills game, joking that she won&#39;t be &quot;asking his permission&quot; to bring home a new fur baby."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-hospital-visit-queen-camilla-king-charles-b2484472.html?page=3",
        "title": "Royal news – live: Kate’s surgery ‘surprised’ family friends as Sarah Ferguson gives health update",
        "description": "Prince Harry has proven once again he’s <b>Meghan Markle</b>’s biggest fan. Among those in attendance included director Matthew Cole Weiss, who had previously directed the 2006 TV movie Deceit, in which <b>Meghan</b> appears in one scene. Taking to social media ..."
    },
    {
        "url": "https://her.ie/celeb/harry-meghan-markle-go-into-hiding-598749",
        "title": "‘Do people expect Harry and <b>Meghan</b> to go into hiding?’",
        "description": "Meghan Markle and Prince Harry&#39;s every move is scrutinised by the public. They&#39;re called out for being private, they&#39;re slated for going out."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151260-meghan-markle-prince-harrys-relationship-takes-new-turn",
        "title": "<b>Meghan Markle</b>, Prince Harry&#39;s relationship takes new turn",
        "description": "Prince Harry and Meghan Markle have seemingly displayed their strong bond in Jamaica, showing that they are really made for each other.The Duke and Duchess of Sussex&#39;s united front at music"
    },
    {
        "url": "https://thehill.com/opinion/national-security/4426960-harry-and-meghan-knives-out-in-jamaica/",
        "title": "Harry and <b>Meghan</b>: Knives out in Jamaica",
        "description": "This would all be amusing, were it not for the serious damage Harry and Meghan continue to inflict upon the national security of the United Kingdom and its Commonwealth partners."
    },
    {
        "url": "https://www.foxnews.com/opinion/dont-expect-prince-harry-be-there-familys-current-hour-need",
        "title": "Don&#39;t expect Prince Harry to be there in his family’s current hour of need",
        "description": "Prince Harry and Meghan Markle could have made a significant contribution during the illnesses of King Charles and Princess Kate. Instead, they&#39;ve let down Harry&#39;s family and a nation."
    },
    {
        "url": "https://www.newsweek.com/prince-archie-cute-big-brother-princess-lilibet-moment-viral-video-tiktok-1863812",
        "title": "Prince Archie&#39;s &#39;Cute&#39; Big Brother Moment Goes Viral",
        "description": "Prince Archie&#39;s sweet birthday wishes for his younger sister, Princess Lilibet, have become the subject of a new viral video, after home-movie footage released by Prince Harry and <b>Meghan Markle</b> as part of their Netflix docuseries has resurfaced on social ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151239-meghan-markle-disappointed-after-identifying-who-she-is",
        "title": "<b>Meghan Markle</b> &#39;disappointed&#39; after &#39;identifying&#39; who she is",
        "description": "Meghan Markle, according to a celebrity astrologer, may find it difficult to identify who she is after a disappointing transaction this month.Inbaal Honigman thinks the Duchess of Sussex, who"
    },
    {
        "url": "https://www.thesun.ie/royals/12058949/prince-harry-guilt-kate-charles-health-news/",
        "title": "Prince Harry ‘feels a huge amount of guilt’ as Kate &amp; Charles health news ‘shakes some sense’ into him, expert claims",
        "description": "It has been reported that Harry, 39, and his wife <b>Meghan</b>, 42, sent get well messages to the King and Kate following news of their double health scare. A source told the Mirror: “The King and the Princess of Wales have received support from Prince Harry ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/sarah-ferguson-gives-quick-encouraging-215603840.html",
        "title": "Sarah Ferguson Gives Quick but Encouraging Health Update amid Skin Cancer Diagnosis While Leaving Hospital",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! &quot;He&#39;s fine, thank you very much. Looking forward to getting back to work,&quot; Queen Camilla said during a ..."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-answered-burning-ve-172503976.html",
        "title": "<b>Meghan Markle</b> Answered a Burning Question We’ve Had for Months When She Attended the ‘Bob Marley: One Love’ Premiere in Jamaica",
        "description": "Prince Harry and <b>Meghan Markle</b> are a bit like Where in the World is Carmen Sandiego (remember that show?)—you never really know where around the globe they’re going to pop up next. Last night it was in Jamaica, where they unexpectedly hit the red ..."
    },
    {
        "url": "https://uk.yahoo.com/style/body-language-expert-says-meghan-143400881.html",
        "title": "A Body Language Expert Says <b>Meghan Markle</b> and Prince Harry Were All About &quot;Careful&quot; Unity Last Night",
        "description": "<b>Meghan Markle</b> and Prince Harry made a rare appearance at the premiere of Bob Marley: One Love in Kingston, Jamaica, and naturally body language experts are out here doing their thing. And turns out the Sussexes&#39; vibes were all about &quot;unity,&quot; which ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12999799/Prince-Harry-Meghan-Markle-Bob-Marley-One-Love-movie-premiere-Jamaica.html",
        "title": "<b>Meghan</b> and Harry pose next to anti-royal Jamaican prime minister who wants to ditch the monarchy and warned Wills and Kate they&#39;ll never be king and queen of his nation - as ...",
        "description": "Prince Harry and <b>Meghan Markle</b> were branded &#39;insensitive&#39; today after posing with Jamaica&#39;s prime minister who wants to ditch the monarchy - just as King Charles III prepares for prostate treatment and Kate recovers in hospital from abdominal surgery."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-meghan-markle-just-122045148.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Just Showed Up to the &#39;Bob Marley: One Love&#39; Premiere in Jamaica",
        "description": "Prince Harry and <b>Meghan Markle</b> just made a surprise red-carpet appearance, and they didn&#39;t content themselves with commuting to nearby Los Angeles for it. The Duke and Duchess of Sussex showed up to the premiere of musical biopic Bob Marley: One Love in ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511704/meghan-markle-forced-to-miss-prince-harry-award/",
        "title": "<b>Meghan Markle</b> forced to miss Prince Harry&#39;s award ceremony as one of their children &#39;became unwell&#39;",
        "description": "<b>Meghan Markle</b> was forced to miss her husband, Prince Harry&#39;s Living Legends of Aviation award ceremony after one of their children became unwell. The news was confirmed by PA, who revealed: &quot;The Duchess of Sussex, who had been expected to attend the event ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middletons-fingers-went-white-31859294?int_source=nba",
        "title": "Kate Middleton&#39;s fingers &#39;went white as she gripped chair in tense <b>Meghan</b> and Harry meeting&#39;",
        "description": "Kate Middleton&#39;s fingers reportedly &quot;turned white&quot; during a tense chat with <b>Meghan Markle</b>. Kate wanted her to apologise for making a comment about Kate&#39;s hormones and having &quot;baby brain&quot; while she was pregnant. It is well known that <b>Meghan</b> didn&#39;t quite gel with the Princess of Wales after marrying into the Royal Family, but the extent of their strained relationship was only revealed when ..."
    }
]