[
    {
        "url": "https://www.timesnownews.com/world/prince-harry-and-meghan-markle-reach-out-to-king-charles-and-kate-middleton-after-health-scares-report-claims-article-107019005",
        "title": "Prince Harry and <b>Meghan</b> Reach Out To King Charles and Kate After Health Scares, Report Claims",
        "description": "Prince Harry and <b>Meghan Markle</b> have offered their support to King Charles and Princess Kate as they navigate respective health challenges, in a move interpreted as a potential olive branch amidst ongoing tensions within the Royal Family. This gesture comes ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-meghan-support-message-31930105",
        "title": "Prince Harry and <b>Meghan Markle</b> send message of support to Kate Middleton and King Charles amid health battles",
        "description": "Three days on since the Palace announced that King Charles and Kate Middleton would both experiencing health woes, Prince Harry and his wife Meghan have sent them a message of support"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-no-intention-pulling-31929681",
        "title": "<b>Meghan Markle</b> &#39;no intention of pulling her weight&#39; as Royal Family suffers health crisis",
        "description": "Royal historian and author Hugo Vickers criticised Meghan Markle claiming she &#39;had a little plan from the start&#39; and did not want to be a &#39;hard-working&#39; senior royal"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-no-intention-pulling-31930226",
        "title": "<b>Meghan Markle</b> had &#39;no intention of pulling her weight&#39; in Royal Family",
        "description": "Meghan Markle &quot;had no intention of pulling her weight&quot; as a working royal before she and Prince Harry quit their duties and relocated to the US, one royal historian has claimed. The Duchess of Sussex &quot;had a little plan from the start&quot; meaning she did not want to contribute to the Royal Family as a &quot;hard-working&quot; member,"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-misses-prince-harrys-214636859.html",
        "title": "<b>Meghan Markle</b> Misses Prince Harry&#39;s Awards Ceremony After One of Their Kids Became Ill",
        "description": "The Duke of Sussex was seen solo at the Living Legends of Aviation Awards on Friday night Getty Prince Harry and <b>Meghan Markle</b> <b>Meghan Markle</b> did not attend Prince Harry&#39;s induction into the Living Legends of Aviation on Friday after one of their kids ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-jokingly-calls-john-162820819.html",
        "title": "Prince Harry Jokingly Calls Out John Travolta for ‘Dining Out’ on 1985 Dance with Princess Diana",
        "description": "According to Hello! Magazine, the Saturday Night Fever actor, 69, who hosted the event as the &quot;Official Ambassador of Aviation,&quot; referenced the famous moment when he danced with Prince Harry’s mother, Princess Diana, at the White House in 1985 during his speech."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/alison-hammond-breaks-silence-dermot-28483957",
        "title": "Alison Hammond breaks silence on Dermot O&#39;Leary rift and says &#39;it&#39;s weird&#39;",
        "description": "During Friday&#39;s instalment of This Morning, the pair discussed recent tabloid reports centred around Kate Middleton being compared with <b>Meghan Markle</b>. 48-year-old mum-of-one Alison addressed the time when she was accused of &quot;not getting on&quot; with her co ..."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/prince-harry-makes-first-appearance-145600732.html",
        "title": "Prince Harry Makes His First Appearance of 2024 at Awards Ceremony in Beverly Hills",
        "description": "Prince Harry arrived solo, sans <b>Meghan Markle</b>, wearing a stylish black tux. Per the awards, &quot;The &#39;Living Legends of Aviation&#39; are remarkable people of extraordinary accomplishment in aviation including: entrepreneurs, innovators, industry leaders ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857938/prince-harry-meghan-markle-lilibet-row",
        "title": "Prince Harry and <b>Meghan Markle</b> blasted over Lilibet row despite &#39;good intentions&#39;",
        "description": "A PR expert criticised how Prince Harry and Meghan Markle handled naming their daughter Lilibet after the late Queen Elizabeth."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-unlikely-return-acting-31927291?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> &#39;unlikely&#39; to return to acting this year as she focuses on tell-all memoir",
        "description": "A PR guru has said that it is &#39;unlikely&#39; that the Duchess of Sussex, Meghan Markle will return to acting this year, with her instead speculating that she is focusing on a memoir"
    },
    {
        "url": "https://www.lbc.co.uk/news/meghan-markle-harry-living-legends-of-aviation-award-children-unwell/",
        "title": "<b>Meghan</b> forced to miss Harry receiving Living Legends of Aviation award after one of their children &#39;became unwell&#39;",
        "description": "<b>Meghan Markle</b> is said to have missed Priince receiving his Living Legends of Aviation awards due to one of their children becoming ill. Harry was honoured for his work as a British Army veteran and pilot at the Beverly Hills ceremony on Friday. But he was ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12986107/Meghan-Markle-forced-miss-glitzy-Beverley-Hills-ceremony-Prince-Harry-received-Living-Legend-award-one-children-unwell.html",
        "title": "<b>Meghan Markle</b> forced to miss glitzy Beverly Hills ceremony where Prince Harry received a &#39;Living Legend&#39; award because &#39;one of their children became unwell&#39;",
        "description": "The Duke of Sussex, 39, took to the stage at the Beverly Hills Hilton to receive his award from actor John Travolta - but he was not accompanied by his wife, the Duchess of Sussex."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857896/reason-meghan-markle-missed-prince-harry-aviation-award-ceremony",
        "title": "The reason why <b>Meghan Markle</b> was forced to miss Prince Harry’s award ceremony",
        "description": "Meghan Markle missed her husband&#39;s induction at the glitzy Legends of Aviation Awards ceremony as Prince Harry attended the event alone."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25428944/prince-harry-more-relaxed-confident-without-meghan-body-language/",
        "title": "Prince Harry is ‘more relaxed &amp; confident WITHOUT <b>Meghan</b>’ as duke beams at aviation awards, body language expert claims",
        "description": "PRINCE Harry looked more ‘relaxed and confident than he tends to be with Meghan’, during his recent Aviation Awards appearance, according to a body language expert. The Prince made no reference to"
    },
    {
        "url": "https://inews.co.uk/news/harry-tribute-diana-aviation-award-2865132?ico=above_article_ticker",
        "title": "Harry pays tribute to his mother Diana as he receives aviation award at ceremony",
        "description": "The Duke of Sussex received his &#39;legends of aviation&#39; award from John Travolta in LA hours after dropping a libel claim over a Mail On Sunday article"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12930189/stanley-cup-accessory-gen-z-sell-uk.html",
        "title": "I&#39;m a dentist and this is why you should never let your toddler drink out of your trendy Stanley cup",
        "description": "The Stanley cup, an all-steel vacuum flask which keeps beverages hot, cold or iced for hours, has become a viral hit with thousands of young people desperate to get their hands on one."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wedding-bridesmaid-row-31882197",
        "title": "<b>Meghan Markle</b>&#39;s tailor details real reason for tears in bridesmaid row",
        "description": "Tailor Ajay Mirpuri gave his side of the dramatic argument that allegedly took place between the Princess of Wales and Meghan Markle after staying silent for years"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511590/why-a-reconciliation-between-king-charles-and-prince-harry-is-set-to-happen/?n=%40",
        "title": "Why a reconciliation between King Charles and Prince Harry is set to happen",
        "description": "Surprisingly, however, it seems that despite Harry revealing many private family secrets and even labelling his father King Charles as unaffectionate and unable to communicate with him during his childhood years – the monarch would be open to a reconciliation with his youngest son."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68035336.amp",
        "title": "Watchdog sends official warning to youth charity One Young World",
        "description": "A youth organisation which holds high-profile events with famous guests has been sent an official warning by the charity watchdog. The Charity Commission criticised One Young World for &quot;unauthorised payments&quot; to a staff member and a lack of accurate records."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511704/meghan-markle-forced-to-miss-prince-harry-award/",
        "title": "<b>Meghan Markle</b> forced to miss Prince Harry&#39;s award ceremony as one of their children &#39;became unwell&#39;",
        "description": "<b>Meghan Markle</b> was forced to miss her husband, Prince Harry&#39;s Living Legends of Aviation award ceremony after one of their children became unwell. The news was confirmed by PA, who revealed: &quot;The Duchess of Sussex, who had been expected to attend the event ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163424/20240121/critics-question-meghan-markles-commitment-during-royal-health-crisis.htm",
        "title": "Critics Question <b>Meghan Markle</b>&#39;s Commitment During Royal Health Crisis",
        "description": "Amid the turbulence of health concerns plaguing the British royal family, attention has turned to <b>Meghan Markle</b>&#39;s absence from royal duties. The Duchess of Sussex, along with her husband Prince Harry, relocated to the US, stepping back from their roles as ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-worried-king-charles-31930026",
        "title": "Prince Harry was &#39;worried about King Charles&#39; health&#39; at Aviation Awards",
        "description": "One body language expert has commented on the Duke&#39;s &quot;anxiousness&quot; which came shortly before it was revealed that his wife <b>Meghan Markle</b> was unable to attend the ceremony with him due to one of their children being &quot;unwell&quot;. On Friday evening, the Duke of ..."
    },
    {
        "url": "https://pagesix.com/2024/01/20/celebrity-news/jeff-bezos-fiancee-lauren-sanchez-gushes-over-aviation-legends-prince-harry-and-john-travolta/",
        "title": "Jeff Bezos’ fiancée Lauren Sánchez gushes over ‘aviation legends’ Prince Harry and John Travolta",
        "description": "When he graced the stage, sans wife <b>Meghan Markle</b>, the “Spare” author recalled a touching moment the “Saturday Night Fever” star shared with his late mother, Princess Diana. Harry reminisced over a time when Travolta danced with Diana at the White ..."
    },
    {
        "url": "https://www.livemint.com/news/trends/prince-harry-wasn-t-informed-about-king-charles-prostate-issue-he-came-to-know-about-it-from-news-11705737384694.html",
        "title": "Prince Harry wasn’t informed about King Charles&#39; prostate issue; he came to know about it from news",
        "description": "Prince Harry may not have been informed about King Charles&#39; prostate diagnosis until it was publicly announced."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/prince-harry-forced-to-accept-aviation-award-without-meghan-markle/",
        "title": "Prince Harry forced to accept Aviation award without <b>Meghan Markle</b>",
        "description": "In disappointing news, Prince Harry had to accept his Legends of Aviation award without his wife, Meghan Markle."
    },
    {
        "url": "https://www.vanityfair.com/style/prince-harry-living-legend-of-aviation-award",
        "title": "<b>Meghan Markle</b> Skips Prince Harry&#39;s “Living Legend” Event",
        "description": "“Thank you, Captain John,” Harry said to Travolta. “I was one year old when you danced with my mum.” The crack was a follow-up to Travolta&#39;s opening remarks at the ceremony, in which, per Hello, the actor brought up his iconic 1985 White House dance with Princess Diana."
    },
    {
        "url": "https://people.com/prince-harry-jokes-john-travolta-is-dining-out-on-princess-diana-dance-8546796",
        "title": "Prince Harry Jokingly Calls Out John Travolta for ‘Dining Out’ on 1985 Dance with Princess Diana",
        "description": "Prince Harry playfully teased John Travolta during his speech as he was inducted into the Living Legends of Aviation in Beverly Hills on Friday. The Duke of Sussex joked that the actor is &#39;dining out&#39; on his famous 1985 dance at the White House with his mother,"
    },
    {
        "url": "https://www.prestigeonline.com/th/style/fashion/most-expensive-celebrity-wedding-dresses-priyanka-chopra-kim-kardashian-kate-meghan/",
        "title": "Most Expensive Bridal Gowns in the Celebrity Sphere",
        "description": "Ranging from hundreds of thousands to millions, here are the most expensive wedding dresses celebrities wore to walk down the aisle."
    },
    {
        "url": "https://www.btimesonline.com/articles/163415/20240120/meghan-markle-seeks-sarah-fergusons-support-for-royal-reconciliation.htm",
        "title": "<b>Meghan Markle</b> Seeks Sarah Ferguson&#39;s Support for Royal Reconciliation",
        "description": "Amid ongoing royal family tensions, Meghan Markle, the Duchess of Sussex, is reportedly seeking the support of Sarah Ferguson, the Duchess of York, in her efforts to mend relationships with the British Royal Family."
    },
    {
        "url": "https://pagesix.com/2024/01/20/royal-family/amid-royal-health-crises-meghan-and-harrys-absence-is-glaring/",
        "title": "As royal family suffers health crises, <b>Meghan Markle</b> ‘had no intention of pulling her weight’",
        "description": "Meghan Markle’s plans “did not include being a hard working supportive member of the royal family,” a royal historian opined as the family is in health crises."
    },
    {
        "url": "https://www.foxnews.com/entertainment/prince-harry-calls-john-travolta-dining-dance-floor-mother-princess-diana",
        "title": "Prince Harry calls out John Travolta for ‘dining out’ on dance floor with mother Princess Diana",
        "description": "The Duke of Sussex was inducted at the 21st Annual Living Legends of Aviation Awards in Beverly Hills. He was not accompanied by his wife <b>Meghan Markle</b>. &quot;I was one year old when you danced with my mum. As you’ve told everybody here and continue to dine ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1149766-meghan-markle-wouldve-changed-lilibets-name-over-request-from-one-royal",
        "title": "<b>Meghan Markle</b> ‘would&#39;ve changed Lilibet&#39;s name’ over request from one royal",
        "description": "Prince Harry could’ve convinced Meghan Markle to change their daughter Lilibet’s name, royal expert believes. Speaking to the Mirror, Lynn Carratt from Press Box PR shared her"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/20/monarchy-royal-family-king-charles-kate-middleton-hospital/",
        "title": "How the Sussexes’ vanishing act exposed the weakness of the slimmed-down monarchy",
        "description": "With Kate and the King in hospital the Royal family could do with a helping hand and some stardust — but it won&#39;t be coming from California The fragile Firm: With no Prince Harry or <b>Meghan</b> to step in, the Royal family looks thinner than ever On Friday ..."
    },
    {
        "url": "https://www.newsweek.com/queen-elizabeth-paid-police-prince-andrew-house-1861933",
        "title": "Queen Elizabeth Paid for Police at Prince Andrew&#39;s House",
        "description": "King Charles wants Prince Andrew to move to Prince Harry and Meghan Markle&#39;s old home to cut costs, his biographer told Newsweek."
    },
    {
        "url": "https://theblast.com/572419/why-meghan-markle-missed-prince-harrys-living-legend-of-aviation-award-ceremony/",
        "title": "Why <b>Meghan Markle</b> Missed Prince Harry’s ‘Living Legend of Aviation’ Award Ceremony",
        "description": "Meghan Markle was notably absent from her husband, Prince Harry&#39;s &quot;Living Legend of Aviation&quot; award ceremony in Los Angeles."
    },
    {
        "url": "https://www.heraldsun.com.au/entertainment/celebrity-life/royals/prince-harry-accuses-john-travolta-of-dining-out-on-1985-white-house-dance-with-princess-diana/news-story/953c6740377dcd87aa09285a32fea90e",
        "title": "Prince Harry accuses John Travolta of ‘dining out’ on 1985 White House dance with Princess Diana",
        "description": "Prince Harry jokingly accused John Travolta of “dining out” on his famous White House dance with Princess Diana as the royal was controversially honoured as a “living legend of aviation” for his time in the British Army."
    },
    {
        "url": "https://nypost.com/2024/01/20/entertainment/prince-harry-pays-tribute-to-late-mother-princess-diana-as-he-attends-living-legend-awards-solo/",
        "title": "Prince Harry pays tribute to late mother Princess Diana as he attends ‘living legend’ awards solo",
        "description": "The Duke of Sussex was named a “living legend” at the star-studded ceremony, where he paid touching tribute to his late mother Princess Diana."
    },
    {
        "url": "https://www.purewow.com/news/prince-harry-meghan-markle-chicken-coop",
        "title": "Ellen DeGeneres Shares Rare Glimpse of Prince Harry &amp; <b>Meghan Markle</b>’s Chicken Coop",
        "description": "Prince Harry and <b>Meghan Markle</b> are now the proud owners of another chicken, thanks to Ellen DeGeneres. This week, DeGeneres, 65, posted a photo on Instagram and explained that her chicken, Sinkie, has been rehomed after suffering a broken fibula bone."
    },
    {
        "url": "https://people.com/prince-harry-attends-living-legends-aviation-awards-beverly-hills-8462554",
        "title": "Prince Harry Steps Out Solo to Accept Aviation Award in Beverly Hills",
        "description": "Prince Harry, the Duke of Sussex, stepped out to attend the Living Legends of Aviation Awards in Beverly Hills. All about the induction and his experience in the British Army."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25426315/halfwit-prince-harry-meghan-markle-colin-robertson/",
        "title": "Halfwit Harry &amp; rictus-grinning wife <b>Meghan</b> are endlessly fascinating – like pets who get trapped in the tumble dryer",
        "description": "GOOD old Harry and Meghan, continuing to deliver the goods as another batch of “their truth” turns out to be complete b*****ks. Mugging off the Queen by pretending she’d given the royal thumbs-up"
    },
    {
        "url": "https://www.bbc.com/news/uk-68035336",
        "title": "Watchdog warns charity where <b>Meghan</b> was among star guests",
        "description": "In September 2022, Meghan spoke at the charity&#39;s summit in Manchester, in her first speech in the UK since stepping down as a &quot;working royal&quot;. At the event, where fees for young delegates cost up to £3,000, Meghan encouraged young people by talking about her own sense of self-doubt."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1149797-meghan-markle-shifts-focus-from-acting-as-she-prepares-to-write-memoir",
        "title": "<b>Meghan Markle</b> shifts focus from acting as she prepares to write memoir",
        "description": "<b>Meghan Markle</b> has reportedly shifted her focus from acting as she is all set to write an explosive tell-all memoir about her life. In conversation with The Mirror, PR expert Lynn Carratt claimed that the Duchess of Sussex is not planning to make her ..."
    },
    {
        "url": "https://www.prestigeonline.com/hk/style/fashion/most-expensive-celebrity-wedding-dresses-priyanka-chopra-kim-kardashian-kate-meghan/",
        "title": "Most Expensive Celebrity Wedding Dresses That Have Graced The Aisle",
        "description": "The royal wedding of the Duke and Duchess of Sussex broke traditions and created a new tone, as symbolised by <b>Meghan Markle</b>‘s bridal gown. <b>Meghan</b>’s Givenchy gown, designed by famous British designer Clare Waight Keller, dominated the ceremony and had a ..."
    },
    {
        "url": "https://www.arabtimesonline.com/news/sky-high-solo-prince-harry-receives-aviation-award-in-beverly-hills/",
        "title": "Sky-high solo: Prince Harry receives Aviation Award in Beverly Hills",
        "description": "Despite his presence, <b>Meghan Markle</b> did not accompany him to the event. The Kiddie Hawk Air Academy, a nonprofit organization dedicated to cultivating children’s interest in aviation through education, revealed last week that Prince Harry was among the ..."
    },
    {
        "url": "https://nypost.com/2024/01/19/entertainment/piers-morgan-blasts-prince-harry-markle-in-royal-naming-scandal/",
        "title": "Piers Morgan says <b>Meghan</b> and Harry ‘deliberately spun’ ‘ludicrous’ racism claims against Kate, Charles",
        "description": "Piers Morgan believes he’s helped extinguish the flames of controversy that nearly engulfed the royal family after revealing that King Charles III and Catherine, Princess of Wales, née Kate Middleton, allegedly made racist remarks in regards to Prince Archie’s skin color."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-drops-libel-suit-230000074.html",
        "title": "Prince Harry Drops His Libel Suit Against a British Newspaper",
        "description": "More from Robb Report Prince Harry Says He&#39;s Worried for the Safety of <b>Meghan Markle</b> and Their Kids in the U.K. Prince Harry and <b>Meghan Markle</b> Aren&#39;t Being Invited to a Royal Wedding to Avoid Family Drama From Prince Harry to Elon Musk, Celebrities Show ..."
    }
]