[
    {
        "url": "https://www.express.co.uk/news/royal/1868076/prince-harry-meghan-markle-working-to-unify-ventures",
        "title": "Prince Harry and <b>Meghan Markle</b> revealed intentions with &#39;rebranded&#39; site using titles",
        "description": "Prince Harry and <b>Meghan Markle</b> have been quite busy — launching a new website, announcing a new podcast, and a three-day work trip to Canada — and it’s all with one goal in mind, says a royal expert. Daily Express spoke to Pauline Maclaran ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26023221/meghan-suits-co-stars-relationships/",
        "title": "<b>Meghan</b>’s ‘intimidated’ Suits co-stars reveal they have ‘zero communication’ with her – so what happened to TV pals?",
        "description": "IT was the hit legal drama that made Meghan Markle a star – and where the cast claimed to feel more lijoke close family than friends. Now, as a spin-off of Suits is set to start filming next"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-desperate-taylor-swifts-32155330",
        "title": "<b>Meghan Markle</b> &#39;desperate&#39; to be Taylor Swift&#39;s friend in a bid to overhaul her image",
        "description": "Meghan Markle is &#39;desperate&#39; to be Taylor Swift&#39;s friend as the Duchess of Sussex bids for a marketing boost and a revamp of her image, according to one royal expert"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markles-rule-28657501",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s rule for never attending BAFTAs as they snub event again",
        "description": "Prince of Wales took his seat in the front row of the Bafta film awards ceremony in his first high-profile royal engagement since his wife&#39;s operation."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868058/meghan-markle-taylor-swift-wants-to-be-friends",
        "title": "<b>Meghan Markle</b> &#39;desperate&#39; to be Taylor Swift&#39;s friend - she &#39;wants to be like her&#39;",
        "description": "Meghan Markle is &quot;desperate&quot; to be friends with megastar Taylor Swift, whose personal marketing she admires, according to a royal commenter."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097197/prince-harry-meghan-markle-sussex-website-domain-businessman.html",
        "title": "Revealed: Harry and <b>Meghan</b> bought their Sussex.com website domain name from British-born tech businessman (and he was VERY happy with the price)",
        "description": "The Duke and Duchess of Sussex launched their controversial website as part of a royal rebrand on Monday after purchasing the domain name for an undisclosed fee from tech entrepreneur Neil Agate."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-forced-break-touching-32153295",
        "title": "<b>Meghan Markle</b> forced to break &#39;touching promise&#39; to late Queen",
        "description": "Meghan Markle and the Queen appeared to get on well during their first meeting, with the monarch giving the then-actress her blessing to continue her career in the US"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097255/Pictured-Drugs-kingpin-Indian-Dave-Sharma-Zac-Brettler-death.html",
        "title": "Pictured: Drugs kingpin nicknamed &#39;Indian Dave&#39; who was last to see oligarch-obsessed teen before he plunged to his death from Thames luxury tower block - and who died a year ...",
        "description": "Zac Brettler plunged to his death in November 2019 after jumping from a 5th floor apartment owned by Verinder Sharma (pictured), known in the criminal underworld as &#39;Indian Dave&#39;."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-copy-32153021.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> copy William and Kate&#39;s date night spot on Canada trip",
        "description": "Prince Harry and Meghan Markle seemingly copied Prince William and Kate Middleton&#39;s date night spot this week while on their fun-filled Canada trip to promote the Invictus Games"
    },
    {
        "url": "https://inews.co.uk/opinion/meghan-markle-yoko-ono-2909827",
        "title": "<b>Meghan Markle</b> will become our generation’s Yoko Ono",
        "description": "Perhaps no surprise, then, that when the rift opened between Prince Harry and the rest of the Royal Family, Meghan Markle was dubbed “the next Yoko Ono”. An easy, lazy, sexist way to blame a woman for decisions made by a man, about his own future."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26017708/prince-harry-meghan-markle-hijack-sussex-name/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> ‘hijacked’ Sussex name for their own good – we deplore them, blasts Lady Colin Campbell",
        "description": "LADY Colin Campbell has blasted Prince Harry and Meghan Markle for “hijacking” the Sussex name for their own good. The former I’m a Celebrity contestant has set herself on a collision"
    },
    {
        "url": "https://metro.co.uk/2024/02/18/much-prince-harry-meghan-paid-new-sussex-website-revealed-20301186/?ico=metro-posts_home_whats-trending-now",
        "title": "This is who <b>Meghan</b> and Harry bought new website from and how much they paid",
        "description": "The domain name was initially bought in 1995 by US-based Neil Agate, who recently sold it to the couple for an &#39;undisclosed amount&#39;."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-archie-and-princess-lilibet-why-has-their-surname-changed-to-sussex_art21185.html",
        "title": "Prince Archie and Princess Lilibet: Why has their surname changed to Sussex?",
        "description": "Prince Harry and Meghan Markle have recently decided to change their children’s names. The change has caused some backlash, but there may be a reason behind the"
    },
    {
        "url": "https://uk.style.yahoo.com/32-most-romantic-royal-moments-103911822.html",
        "title": "32 of the most romantic royal moments - from sweet displays of affection to abdicating for love",
        "description": "Royal protocol traditionally meant that fathers should not be in the room during the birth of their children, but Philip broke this protocol for the birth of his fourth child, Prince Edward. Philip reportedly held Elizabeth’s hand as she delivered her youngest in 1964, becoming the first royal father in modern history to witness his child’s birth."
    },
    {
        "url": "https://uk.style.yahoo.com/zero-chance-prince-william-let-145406911.html",
        "title": "‘Zero Chance’ Prince William Would Let Prince Harry Return to Royal Duties",
        "description": "The Mirror reports that sources close to William say he would step up to the plate if needed in the wake of King Charles’ cancer diagnosis, as he believes Harry and <b>Meghan Markle</b> “cannot be trusted.” A source close to William told the Mirror there wa ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-king-charles-sandringham-visit-cancer-b1139856.html",
        "title": "Palace aides &#39;blocked Harry from joining King Charles in Sandringham&#39; during his UK trip",
        "description": "Prince Harry was forced to stay in a hotel as aides reportedly worried they would “never get rid of him” if he lodged at Sandringham while visiting the King. The Duke of Sussex is said to be open to taking a temporary role back in the fold to help his father while Charles III undergoes treatment for cancer."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-william-said-meghan-markle-32153564",
        "title": "Prince William &#39;said <b>Meghan Markle</b> and Prince Harry cannot be trusted&#39;",
        "description": "The Prince of Wales believes his brother Prince Harry and sister-in-law <b>Meghan Markle</b> &quot;cannot be trusted&quot;, it has been claimed by a source close to Prince William. The source has said in the wake of King Charles&#39; cancer ­diagnosis, he would be the one to ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/17/prince-harrys-rumoured-royal-return-swiftly-ruled-out-palace-20299681/?ico=mosaic_news",
        "title": "‘No way back’ for Harry as rumoured royal return swiftly ‘ruled out’",
        "description": "Prince Harry, Duke of Sussex and <b>Meghan Markle</b> attending the final day of the One Year to Go Event before the Invictus Games Vancouver Whistler 2025 (Picture: Shutterstock) Gesturing towards Invictus competitors, Harry added: ‘Throughout all these ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-and-meghan-surname-32127238?int_source=nba",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;change children&#39;s surnames&#39; in surprise &#39;rebrand&#39; move",
        "description": "Prince Harry and <b>Meghan Markle</b> have reportedly changed their children&#39;s surnames in surprise &#39;rebrand&#39; move, where Prince Archie and Princess Lilibet will now be known differently"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2960041/tom-brady-reaction-gisele-bundchen-new-romance/",
        "title": "Tom Brady’s Latest Outing May Indicate How He’s Feeling About Ex-Wife Gisele Bundchen’s New Romance",
        "description": "In photos obtained by Page Six, we can see that Brady is enjoying a boys trip to the Bahamas. He posted photos of himself playing golf with the boys (including his eldest son) on his Instagram story, with one of the photos having the caption reading, “Always on the grind!! Coming for you @ophipps7.”"
    },
    {
        "url": "https://www.wionews.com/entertainment/lifestyle/news-prince-harry-to-visit-uk-with-lilibet-and-archie-amid-king-charles-cancer-diagnosis-report-691414",
        "title": "Prince Harry to visit UK with Lilibet and Archie amid King Charles’ cancer diagnosis: Report",
        "description": "Harry landed in London on Feb 6 to visit his estranged father King Charles III after the monarch&#39;s cancer diagnosis. <b>Meghan Markle</b> and their children, Prince Archie and Princess Lilibet, did not accompany him. A few days after Prince Harry talked about ..."
    },
    {
        "url": "https://popculture.com/celebrity/news/why-kate-middleton-is-hesitant-to-reconcile-with-meghan-markle/",
        "title": "Why Kate Middleton Is Hesitant to Reconcile With <b>Meghan Markle</b>",
        "description": "Regardless, this week&#39;s report said that Markle is being proactive about making up with the royal family. They said: &quot;Meghan has contacted Kate and Charles. So moves are being made to reconcile. Meghan is supportive of Harry in all of this, and she wishes the royals – Kate included – the very best.&quot;"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/18/65d2736a22601dfe1f8b45b4.html",
        "title": "Prince Harry has no chance of regaining his Royal privileges, despite a reconciliation with King Charles",
        "description": "The British Royal Family remains firm in their stance regarding Prince Harry&#39;s departure from royal duties following his controversial marriage to Meghan Markle. The Daily Mail re"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2960024/meghan-markle-taylor-swift-bond-alleged/",
        "title": "<b>Meghan Markle</b> Is Allegedly ‘Desperate’ to Do This With Taylor Swift Amid Comeback",
        "description": "During an interview with GB News, royal commentator and expert Kinsey Schofield claimed that she believes Meghan “is desperate to be Taylor’s friend.”"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/prince-harry-and-meghan-wrap-up-2025-invictus-games-countdown/",
        "title": "Prince Harry and <b>Meghan</b> wrap up 2025 Invictus Games countdown",
        "description": "Prince Harry and Meghan Markle close off the 2025 Invictus Games countdown with a dinner banquet on Friday, 16 February."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meghan-markle-trying-reconcile-princess-190500675.html",
        "title": "<b>Meghan Markle</b> Is Trying to ‘Reconcile’ With Princess Kate After Her Surgery",
        "description": "As her husband Prince Harry continues to make efforts to reconnect with his father following his cancer diagnosis, it seems there may be a separate possibility for Meghan Markle and Kate Middleton’s feud to come to an end—but it all comes down to the Princess of Wales."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1158974-meghan-markle-prince-harry-mislead-fans-with-website-rebrand",
        "title": "<b>Meghan Markle</b>, Prince Harry &#39;mislead&#39; fans with website rebrand",
        "description": "Meghan Markle and Prince Harry received severe backlash amid their website rebrand.For the unversed, the Duke and Duchess of Sussex recently named their new platform Sussex.com in a nod to"
    },
    {
        "url": "https://pagesix.com/2024/02/18/royal-family/prince-harry-has-no-way-back-into-royal-fold-amid-king-charles-cancer-diagnosis-report/",
        "title": "Prince Harry has ‘zero’ chance of returning for royal duties despite King Charles’ cancer diagnosis: report",
        "description": "Royal sources claim the renegade royal has “zero percent chance” of helping his family amid King Charles III’s recent cancer diagnosis and Kate Middleton’s health issues."
    },
    {
        "url": "https://people.com/prince-william-arrives-2024-baftas-photos-8584194",
        "title": "Prince William Arrives at 2024 BAFTAs as Kate Middleton Continues Recovery from Abdominal Surgery",
        "description": "Prince William attended Sunday&#39;s 2024 BAFTAs in London solo as his wife Kate Middleton continues her recovery from last month&#39;s abdominal surgery."
    },
    {
        "url": "https://www.mercurynews.com/2024/02/18/prince-william-will-block-harrys-royal-return-he-and-meghan-cannot-be-trusted-report/",
        "title": "World News",
        "description": "Whatever Harry has discussed with King Charles about a reconciliation and resumption of royal duties, it is ‘absolutely and categorically clear’ that William would not allow his"
    },
    {
        "url": "https://www.eastbaytimes.com/2024/02/18/prince-william-will-block-harrys-royal-return-he-and-meghan-cannot-be-trusted-report/",
        "title": "Prince William will block Harry’s royal return; he and <b>Meghan</b> ‘cannot be trusted’: report",
        "description": "Whatever Harry has discussed with King Charles about a reconciliation and resumption of royal duties, it is ‘absolutely and categorically clear’ that William would not allow his"
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/prince-harry-meghan-markle-make-important-change-to-kids-names/",
        "title": "Prince Harry and <b>Meghan Markle</b> Make Important Change to Their Kids&#39; Names",
        "description": "The Duke and Duchess of Sussex have begun using the style &quot;prince&quot; and &quot;princess&quot; for their children, and the surname &quot;Sussex&quot; in accordance with royal naming conventions."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1158956-meghan-markle-extending-hand-of-friendship-to-taylor-swift",
        "title": "<b>Meghan Markle</b> extending hand of friendship to Taylor Swift?",
        "description": "Meghan Markle wants to be Taylor Swift&#39;s friend in order to achieve her personal gains, claims a royal expert.In conversation with GB News, royal commentator Kinsey Schofield said that the"
    },
    {
        "url": "https://nypost.com/2024/02/18/entertainment/prince-harry-meghan-markle-bought-sussex-com-after-30-years-with-previous-owner/",
        "title": "Prince Harry and <b>Meghan Markle</b> bought coveted Sussex.com after 30 years with previous URL owner",
        "description": "Businessman Neil Agate said the former royals did little to negotiate the price of the URL, and is reportedly “pleased” with the amount for which the site was sold."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097501/prince-harry-meghan-markle-sussex-website-hijacked-lady-colin-campbell.html",
        "title": "Harry and <b>Meghan</b> are accused of &#39;hijacking the name Sussex for their website&#39; - as Lady Colin Campbell reveals she&#39;s bought domain names for other Sussex-related sites",
        "description": "Lady Campbell has revealed that she has bought the domain names for other Sussex-related sites as she blasted the couple for launching a new website which &#39;has nothing to do with the county&#39;."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/prince-william-would-not-allow-harry-to-return-sources-claim-101708262422962.html",
        "title": "Prince William ‘would not allow Harry to return’, sources claim",
        "description": "When it comes to his brother, there&#39;s “no chance” William would let him back in. Even though the talks between the heir and the King have been behind closed doors, Prince William is dead set on his plans related to his brother."
    },
    {
        "url": "https://theblast.com/579347/prince-harry-has-zero-chance-returning-for-royal-duties-king-charles-cancer/",
        "title": "Prince Harry Has ‘Zero’ Chance Of Returning For Royal Duties Despite King Charles’ Cancer",
        "description": "The possibility of Prince Harry returning to royal duties while his father, King Charles III, is being treated for cancer is minimal."
    },
    {
        "url": "https://www.btimesonline.com/articles/164090/20240218/meghan-markle-reportedly-initiates-peace-talks-with-kate-middleton.htm",
        "title": "<b>Meghan Markle</b> Reportedly Initiates Peace Talks with Kate Middleton, But Public Betrayal May Be &#39;Never&#39; Forgiven",
        "description": "Meghan Markle has extended an olive branch to Kate Middleton amidst the health concerns of King Charles, sparking speculation about a potential reconciliation within the British Royal Family. According to sources,"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-king-charles-sandringham-visit-cancer-b1139856.html?ref=todayheadlines.live",
        "title": "Palace aides &#39;blocked Harry from joining King Charles in Sandringham&#39; during his UK trip",
        "description": "Prince Harry was forced to stay in a hotel as aides reportedly worried they would “never get rid of him” if he lodged at Sandringham while visiting the King. The Duke of Sussex is said to be open to taking a temporary role back in the fold to help his father while Charles III undergoes treatment for cancer."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-william-furious-harry-zero-32152475",
        "title": "Prince William furious at Harry as there is &#39;zero chance&#39; he will return to royal duties",
        "description": "Prince William has told friends there is zero chance brother Prince Harry will be allowed back into the royal fold. The Prince of Wales is so angered by his brother’s continued attack on the monarchy he will block any of his bids to return to The Firm, writes The Mirror."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markles-friend-reveals-disgusting-28648851",
        "title": "<b>Meghan Markle</b>&#39;s friend reveals disgusting detail about Royal wedding",
        "description": "Meghan Markle&#39;s former Suits co-star Rick Hoffman has opened up about his viral expression at the Royal wedding in 2018 as he revealed he could smell a &#39;foul&#39; odour"
    },
    {
        "url": "https://www.instyle.com/meghan-markle-frame-denim-presidents-day-sale-8583040",
        "title": "<b>Meghan Markle</b> Just Re-Wore This Chic Denim Brand That’s on Double-Discount Sale",
        "description": "Meghan Markle wore the Frame Le High Skinny jeans in Canada with Prince Harry for the Invictus Games One Year to Go training event. Shop the jeans for up to 65 percent off during Frame’s Presidents Day sale."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/",
        "title": "Prince Harry updates — ‘Uncomfortable’ Duke breaks silence on King’s cancer battle in Good Morning America interview",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-clashing-viewpoints-next-royal-family-rift-report.html/",
        "title": "Prince Harry and <b>Meghan Markle</b> Have Clashing Viewpoints on What to Do Next About the Royal Family Rift — Report",
        "description": "(It’s also the same one in which <b>Meghan</b> famously remarked she wasn’t OK.) Since then, bombshell interviews and a headline-making memoir have ensued, showing just how far apart Harry and his brother, as well as his father, have become. According to a ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-inspired-princess-beatrice-quietly-break-long-standing-royal-family-tradition.html/",
        "title": "How <b>Meghan Markle</b> ‘Inspired’ Princess Beatrice to Quietly Break a Long-Standing Royal Family Tradition",
        "description": "<b>Meghan Markle</b> helped pave the way for Princess Beatrice to break royal tradition. How? By celebrating Christmas with the royal family before marrying Prince Harry. Ahead, how the Duchess of Sussex’s 2017 royal family Christmas appearance later ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-drinks-cocktails-shares-32150850",
        "title": "<b>Meghan Markle</b> drinks cocktails and shares favourite food on &#39;spicy&#39; date with Harry and Michael Bublé",
        "description": "Prince Harry and Meghan Markle joined Michael Bublé and his wife Luisana Lopilato for dinner at a Vancouver hotspot, where they enjoyed various dishes alongside gin and tonics and cocktails"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-wore-thing-sentaler-220650676.html",
        "title": "<b>Meghan Markle</b> Wore a Thing: Sentaler Cape Coat Edition",
        "description": "Meghan Markle is continuing her week of chic Canada-ready coats while she&#39;s in town for the Invictus Games One Year To Go Winter Training Camp in Vancouver with her husband, Prince Harry."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-reportedly-talks-resume-154608306.html",
        "title": "Prince Harry Is Reportedly In Talks to Resume a Temporary Working Royal Role as King Charles Battles Cancer",
        "description": "Story continues Harry and <b>Meghan Markle</b> stepped back from being working members of the royal family four years ago, in January 2020; they’ve since forged a path for themselves in the U.S., where <b>Meghan</b> is originally from. It is unclear on <b>Meghan</b>’s ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513687/prince-harry-not-returning-royal-role-new-interview/",
        "title": "Prince Harry is not returning to royal role – what Duke of Sussex has said in new interview",
        "description": "Despite the reports, it&#39;s unlikely that Harry would return to the royal fold. The Duke of Sussex stepped back from being a working royal in 2020 when he and wife <b>Meghan Markle</b> left in what was dubbed &#39;Megxit&#39; at the time. When the pair stopped being ..."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/prince-harry-celebrates-one-until-212600891.html",
        "title": "Prince Harry Celebrates One Year to Go Until the 2025 Invictus Games in Vancouver",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s three-day trip to British Columbia wrapped up today with a curling event at Hillcrest Community Centre in Vancouver. Near the end of the event, the Duke of Sussex spoke to the gathered participants, Invictus Games alumni ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-makes-one-major-32152538",
        "title": "<b>Meghan Markle</b> makes one major change to her face amid her glam Californian makeover",
        "description": "Meghan Markle has made one major change to her face amid her very glam Californian makeover, which comes after the Duchess was in Canada with her husband for a trip"
    }
]