[
    {
        "url": "https://edition.cnn.com/2024/02/06/opinions/king-charles-cancer-diagnosis-royal-family-filipovic/index.html",
        "title": "Opinion: Could King Charles’ cancer diagnosis mend the fissures in the royal family?",
        "description": "The news of of King Charles’ cancer diagnosis should merit all of our sympathy. It could also be a prime moment for the British monarch to reconcile with Prince Harry and his family, writes journalist Jill Filipovic."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-arrives-london-see-190200633.html",
        "title": "Prince Harry Arrives in London to See King Charles",
        "description": "Prince Harry is back in the United Kingdom to see his father, King Charles, following the British monarch&#39;s cancer diagnosis."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13052059/king-charles-leaves-clarence-house-queen-camilla-return-sandringham.html",
        "title": "Charles arrives at Sandringham after meeting Harry for less than an hour: Smiling King and Camilla leave London for Norfolk by helicopter after monarch spoke to son for 45 ...",
        "description": "Charles and Queen Camilla were seen waving to crowds as they left the royal residence in London in the back of an official car."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-hidden-message-last-32062705",
        "title": "King Charles&#39; &#39;hidden message&#39; in last photos before cancer diagnosis was announced",
        "description": "King Charles has been diagnosed with cancer, with the news being announced on Monday evening alongside a new photo of the monarch - and there was a reason behind the choice of image"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863832/meghan-markle-prince-harry-king-charles-latest",
        "title": "Expert claims Prince Harry and King Charles&#39;s relationship &#39;depends on <b>Meghan Markle</b>&#39;",
        "description": "Angela Levin warned that it could be Meghan Markle that has an impact on whether Prince Harry makes an effort to re-enter the royal fold in the future."
    },
    {
        "url": "https://inews.co.uk/news/royal-family-tree-king-charles-2893211?ITO=msn",
        "title": "Royal family tree: King Charles’s children, siblings and grandchildren explained",
        "description": "The King has two children, both by his first wife, Lady Diana Spencer. He married Diana in St Paul’s Cathedral in 1981, and the pair divorced in 1996. She died in a car crash in Paris a year later."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/king-charles-health-updates-cancer-news/",
        "title": "Prince Harry updates — Duke meets King Charles without <b>Meghan</b> as Buckingham Palace announces monarch’s cancer diagnosis",
        "description": "KING Charles has been diagnosed with cancer, Buckingham Palace announced in a statement. The King, 75, has started treatment and was advised by doctors to cancel front line duties. In its"
    },
    {
        "url": "https://www.theargus.co.uk/news/24101697.prince-harry-visits-king-charles-iii-cancer-diagnosis/",
        "title": "Prince Harry visits King Charles III after cancer diagnosis",
        "description": "The Duke of Sussex has rushed back to the UK after King Charles III&#39;s cancer diagnosis. Prince Harry landed in the UK alone on Tuesday afternoon and was seen turning up at Clarence House. According to Sky News, The Duchess of Sussex, Meghan Markle, and their children are still in California."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-prince-harry-sandringham-camilla-b2491509.html",
        "title": "King ‘on good form’ after cancer treatment as he heads home after seeing Harry",
        "description": "The king appeared in good spirits as he smiled and waved to the gathered crowds as he left Clarence House, in central London, flanked by the Queen. He is understood to have boarded a helicopter with Camilla from Buckingham Palace shortly after."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-no-plans-reunite-162141093.html",
        "title": "Prince Harry Has &#39;No Plans&#39; to Reunite with Brother Prince William During U.K. Visit, Says Source",
        "description": "The Duke of Sussex met with King Charles amid his cancer news, and the Prince of Wales has been helping Princess Kate recover from recent surgery"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13051949/King-Charles-Kate-monarchy-health-royals.html",
        "title": "Is it time for Beatrice and Eugenie to up their game? Calls for fringe royals to rally around King and &#39;do a bit more&#39; after Charles and Kate&#39;s health battles put them out of ...",
        "description": "The departure of Prince Harry and <b>Meghan Markle</b> and the disgrace of Prince Andrew means there are not enough young royals to take on public duties and relieve the pressure on senior members of the family such as the Queen and Prince William, experts claim."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/sky-news-viewers-shocked-after-28581176",
        "title": "Sky News viewers shocked after presenter makes blunder over King Charles cancer news",
        "description": "Sky News viewers were left shocked when its correspondent seemed to make a string of on-air blunders while talking about King Charles&#39; cancer news. Buckingham Palace announced on Monday (February 5) evening that the King would be undergoing immediate treatment for cancer."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-prince-harry-visit-charles-32061087",
        "title": "Downcast Prince Harry pictured for first time as he dashes to King Charles&#39; side",
        "description": "Prince Harry has been pictured in the UK after flying back to visit his father, King Charles, following his shock cancer diagnosis, whilst it&#39;s believed that Meghan Markle has remained in the US"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/health-and-fitness/512860/prince-william-fitness-routine/",
        "title": "Prince William&#39;s military-style fitness routine has nothing on wife Princess Kate&#39;s",
        "description": "The Prince of Wales is a keen aquaphile, having learned how to swim in Buckingham Palace&#39;s secret swimming pool from a young age. As a teenager, the Prince was a dedicated water poloist, even playing the sport competitively when he reached his twenties."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512810/prince-harry-arriving-london-pictured-lax-king-charles-cancer/",
        "title": "King Charles cancer latest: Monarch and Queen Camilla leave London after reunion with Prince Harry",
        "description": "Prince Harry will arrive in London today after he raced to LAX airport following King Charles&#39; cancer diagnosis . Harry was pictured arriving at the airport&#39;s exclusive private suites on Monday evening after Charles reportedly told his son he had a type of cancer."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-sombre-arrives-clarence-house-father-king-charles-cancer/",
        "title": "Harry appears sombre as he arrives at Clarence House to be at father King Charles&#39; side amid shock cancer diagnosis",
        "description": "A sombre-looking Prince Harry has arrived at Clarence House this afternoon as he rushes to be at his father King Charles&#39; side after the monarch personally informed his son of his cancer diagnosis."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charless-cancer-diagnosis-draws-152346367.html",
        "title": "King Charles&#39;s cancer battle draws hopes of reconciliation with Harry",
        "description": "Rapprochement&#39; - Harry and his American wife <b>Meghan Markle</b> criticised his family in a string of high-profile outpourings including a Netflix series and Harry&#39;s blockbuster autobiography &quot;Spare&quot;. Claims by <b>Markle</b>, who is mixed race, in an interview with ..."
    },
    {
        "url": "https://www.heart.co.uk/news/why-meghan-markle-isnt-travelling-back-uk-prince-harry/",
        "title": "Why <b>Meghan Markle</b> isn&#39;t travelling back to the UK with Prince Harry",
        "description": "Why is Meghan Markle staying in California? How does she feel about King Charles&#39;s cancer diagnosis? Here&#39;s the latest."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-wont-received-well-32056193?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> &#39;won&#39;t be received well&#39; if she turns her back on &#39;genuine family crisis&#39;",
        "description": "Speaking exclusively to The Mirror, Ryan said: &quot;As of Monday, various news outlets reported that <b>Meghan Markle</b> was staying in LA while Harry rushed to Prince Charles&#39; side in wake of his cancer diagnosis. On Twitter both #<b>MeghanMarkle</b> and #<b>Markle</b> hashtags are not trending favourably."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/real-reason-meghan-markle-isnt-32057762.amp",
        "title": "The real reason <b>Meghan Markle</b> isn&#39;t coming back to the UK with Prince Harry to visit King",
        "description": "Meghan Markle has decided not to fly back to England with her husband Prince Harry after Buckingham Palace announced King Charles has been diagnosed with cancer"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markles-dad-risks-further-28577720",
        "title": "<b>Meghan Markle</b>&#39;s dad risks further angering her with message to King Charles",
        "description": "Meghan Markle&#39;s father Thomas Markle has extended his well wishes to King Charles after it was revealed he has cancer, but the gesture may not go down well with his daughter"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-arrives-u-k-152005013.html",
        "title": "Prince Harry Arrives in U.K. amid King Charles&#39; Cancer Diagnosis While <b>Meghan Markle</b> Stays Home with Kids",
        "description": "Prince Harry traveled to his home country alone, leaving his wife <b>Meghan Markle</b>, 42, and their two children, 4-year-old son Prince Archie and 2-year-old daughter Princess Lilibet, at their home in Montecito, California. The Duke and Duchess of Sussex ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/king-charles-blunder-shocks-sky-news-viewers-cancer-diagnosis-20231056/?ico=trending-post-strip_item_2",
        "title": "Sky News viewers shocked at King Charles blunder after cancer diagnosis",
        "description": "Sky News viewers were stunned at what they heard about King Charles’ children (Picture: CHRIS JACKSON/POOL/AFP via Getty Images) Sky News viewers were left stunned at a reporter’s blunder over King Charles, following the news of his cancer diagnosis."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-wont-received-well-32057063",
        "title": "<b>Meghan Markle</b> &#39;won&#39;t be received well&#39; after turning back on &#39;genuine family crisis&#39;",
        "description": "Speaking exclusively to The Mirror, Ryan said: &quot;As of Monday, various news outlets reported that Meghan Markle was staying in LA while Harry rushed to Prince Charles&#39; side in wake of his cancer diagnosis. On Twitter both #MeghanMarkle and #Markle hashtags are not trending favourably."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863050/prince-harry-meghan-markle-poll?ruid=218955f3-1f63-4494-b8cc-6736ae65518d",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s popularity plunges in brutal new poll",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s popularity since they left the Royal Family has continued its downward spiral, new polling results show. In a new study carried out by Ipsos, just as King Charles and Princess Kate recover from time in hospital for various ..."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/meghan-markle-stays-away-prince-28576402",
        "title": "<b>Meghan Markle</b> stays away as Prince Harry flies to see King Charles on his own following cancer diagnosis",
        "description": "Meghan Markle will not be returning to the UK to see King Charles, as her husband Prince Harry flies to London alone following his dad the King&#39;s cancer blow. Harry, The Duke of Sussex is flying back to the UK &#39;in the coming days&#39; to be with his dad, according to PA."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harrys-fresh-32012452?int_source=nba",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s fresh &#39;slap in the face&#39; for royals as comeback fails",
        "description": "<b>Meghan Markle</b> and Prince Harry&#39;s comeback plan has backfired after their recent controversial public outings have come at a hard time for the Royal Family, according to an insider. The Duke of Sussex attended Hollywood&#39;s Living Legends of Aviation Awards earlier this month where his &quot;weird&quot; behaviour at the event left his team &quot;holding heads in hands.&quot;"
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/will-prince-harry-reunite-with-prince-william-during-uk-visit-amid-king-charles-cancer-diagnosis/LLC26OXI75DEHHVQVYXJCV57JU/",
        "title": "Will Prince Harry reunite with Prince William during UK visit amid King Charles’ cancer diagnosis?",
        "description": "It’s reportedly the first time father and son have been together since the King’s coronation last year, which Harry abruptly left as soon as the ceremony ended. Now Harry has travelled alone from California,"
    },
    {
        "url": "https://www.skynews.com.au/world-news/prince-harry-arrives-in-london-solo-as-king-charles-snapped-for-first-time-after-cancer-diagnosis/news-story/f722db90c7314e982e841d1336c0a518",
        "title": "Prince Harry arrives in London solo as King Charles snapped for first time after cancer diagnosis",
        "description": "Prince Harry has arrived in London to be by King Charles’ side within 24 hours of Buckingham Palace announcing his father had been diagnosed with cancer."
    },
    {
        "url": "https://nymag.com/intelligencer/article/king-charles-cancer-news.html",
        "title": "What We Know About King Charles III’s Cancer Diagnosis",
        "description": "Here’s the latest news on King Charles’s health, Prince Harry’s visit to the U.K., and how the other royals may fulfill his duties during treatment."
    },
    {
        "url": "https://www.mercurynews.com/2024/02/06/king-charles-all-smiles-after-brief-reunion-with-prodigal-prince-harry/",
        "title": "World News",
        "description": "Harry flew overnight from California, immediately after learning that his father had been diagnosed with an unspecified form of cancer."
    },
    {
        "url": "https://www.eastbaytimes.com/2024/02/06/king-charles-all-smiles-after-brief-reunion-with-prodigal-prince-harry/",
        "title": "King Charles all smiles after brief reunion with prodigal Prince Harry",
        "description": "Harry flew overnight from California, immediately after learning that his father had been diagnosed with an unspecified form of cancer."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/harry-arrives-uk-see-king-28579868",
        "title": "Harry arrives in UK to see King following cancer diagnosis",
        "description": "Prince Harry has reportedly arrived in the UK following news of his father&#39;s cancer diagnosis. It was announced on Monday evening that King Charles had been informed he had cancer, which was picked up during a procedure to treat an enlarged prostate."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/prince-harry-return-to-england-prince-charles-cancer-diagnosis-royal-future-b1137428.html",
        "title": "Return of the prodigal son: can Prince Harry&#39;s homecoming change everything after King Charles&#39; diagnosis?",
        "description": "With accusations, recriminations and no doubt regrets on both sides, Prince Harry’s relationship with his family is at a nadir — but the King’s illness could signal a new era, says Melanie McDonagh"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-takes-shelter-flood-32058566?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> takes shelter in flood-hit Montecito as Harry jets to visit King Charles",
        "description": "Meghan Markle and Prince Harry’s home in Montecito is among many celebrity mansions under siege from the extreme weather in California, with power cuts and severe flooding hitting the state over the n"
    },
    {
        "url": "https://www.thesun.ie/royals/12143910/prince-harry-uk-today-airport-king-charles-cancer/",
        "title": "Prince Harry to arrive in UK TODAY after rushing to LA airport as he puts King Charles rift aside over cancer diagnosis",
        "description": "PRINCE Harry has arrived at the airport ahead of his urgent flight to the UK today to be with the King after he was diagnosed with cancer. The Duke of Sussex, who was informed of his"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/06/spotify-swings-75m-loss-battle-keep-down-costs/",
        "title": "Spotify swings back to €75m loss amid battle to keep costs down",
        "description": "Spotify swung back to a loss at the end of last year as the music streaming giant battles to keep a lid on costs. The Swedish company posted an operating loss of €75m in the fourth quarter after enjoying a rare profit in the previous three months."
    },
    {
        "url": "https://uk.style.yahoo.com/safer-internet-day-children-parents-apple-114913521.html",
        "title": "Only a third of parents put safeguards on their children&#39;s device",
        "description": "As parents try to navigate the ever-shifting online world and balance it with their children’s needs and wants, online safety tools have become essential to help protect young people. But new research from Apple to mark Safer Internet Day revealed that only three in 10 parents have actually implemented safeguards on their child’s device."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863635/thomas-markle-jr-advice-meghan-markle-return-uk-king-cancer",
        "title": "Thomas Marke Jr tells sister <b>Meghan Markle</b> &#39;not the right time&#39; to return to UK",
        "description": "Meghan Markle has not been back in the UK since she attended the funeral of Queen Elizabeth II in September 2022."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/prince-harry-prince-william-feud-32056701",
        "title": "King Charles&#39; cancer diagnosis &#39;could finally end Prince Harry and William feud&#39;",
        "description": "Prince Harry&#39;s decision to rush back to London to be by his father King Charles&#39; side after his cancer diagnosis could pave the way for him and Prince William to put their differences aside"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/king-charles-has-cancer-duke-of-sussex-prince-harry-returning-to-uk-in-the-coming-days-4506640",
        "title": "King Charles has cancer: Duke of Sussex, Prince Harry returning to UK &#39;in the coming days&#39;",
        "description": "Prince Harry, the Duke of Sussex, is returning to the UK to visit his father, King Charles, after his cancer diagnosis was revealed."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/itv-morning-stars-brutal-dig-32057503",
        "title": "ITV This Morning star&#39;s brutal dig at Prince Harry and <b>Meghan Markle</b> over King Charles visit",
        "description": "Journalist Camilla Tominey took aim at Prince Harry and Meghan Markle on This Morning on Monday. It came on the back of King Charles reportedly approving plans to allow luxury campers on the grounds of his private estate at Sandringham. A total of 28 all-weather glamping facilities will be installed on the site, as well as 12 new pitches for tents."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13048685/Prince-Harry-Meghan-Markle-King-Charles-rift.html",
        "title": "Prince Harry is &#39;wise&#39; to travel back to London without <b>Meghan Markle</b> to see King Charles after &#39;serious rift&#39; - but a &#39;positive future&#39; could be on the cards, royal expert claims",
        "description": "Prince Harry, 39, will be flying from California to London to reunite with his father following the news - but his wife and their two children will not be joining him, a source revealed."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/celebs-tv/kings-cancer-caught-early-prime-28577131",
        "title": "King’s cancer ‘caught early’ as Prime Minister vows country will &#39;crack on&#39;",
        "description": "King Charles has been diagnosed with cancer, Buckingham Palace confirmed yesterday. The cancer was detected when the King, aged 75, was undergoing treatment for benign prostate enlargement and he has now started a course of treatment. He has been advised to postpone his public-facing duties."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/king-charles-blunder-shocks-sky-news-viewers-cancer-diagnosis-20231056/?ico=trending-module_tag_prince-charles_item-2",
        "title": "Sky News viewers shocked at King Charles blunder after cancer diagnosis",
        "description": "Sky News viewers were left stunned at a reporter’s blunder over King Charles, following the news of his cancer diagnosis. As the nation and world reacted to the shock announcement, broadcasters delivered breaking news and expert commentary."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-statement-king-charles-cancer-b2491163.html",
        "title": "Prince Harry will rush home to the UK after Charles’ cancer diagnosis",
        "description": "The Duke of Sussex has spoken with King Charles III about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Prince Harry has said. Buckingham Palace revealed in a statement on Monday that the monarch had been diagnosed with cancer. They declined to disclose the type of cancer."
    },
    {
        "url": "https://www.ok.co.uk/royal/thomas-markle-king-charles-cancer-32056013",
        "title": "<b>Meghan Markle</b>&#39;s dad sends message to King Charles following cancer diagnosis",
        "description": "The Duchess of Sussex, Meghan Markle&#39;s father, Thomas Markle, has sent his &#39;best wishes&#39; to King Charles III, following the news that the monarch has been diagnosed with cancer"
    },
    {
        "url": "https://www.thesun.ie/royals/12144399/prince-harry-uk-frogmore-meghan/",
        "title": "Questions swirl over where Prince Harry will stay in UK visit after handing over Frogmore keys – as <b>Meghan</b> stays home",
        "description": "QUESTIONS are swirling over where Prince Harry will stay on his UK visit after handing over his Frogmore keys – as Meghan stays at home. Harry is today flying to Britain to be with King"
    },
    {
        "url": "https://www.ibtimes.co.uk/how-prince-harry-reacted-after-king-charles-iii-told-him-cancer-diagnosis-1723249",
        "title": "How Prince Harry Reacted After King Charles III Told Him Of Cancer Diagnosis",
        "description": "Prince Harry is travelling solo as <b>Meghan Markle</b> and their children, Prince Archie and Princess Lilibet, will remain in their Montecito mansion in Santa Barbara, California. Their office confirmed: &quot;The duke did speak with his father about his diagnosis."
    },
    {
        "url": "https://www.lbc.co.uk/news/king-charles-cancer-harry-meghan-california-flooding-uk-return/",
        "title": "Prince Harry to return to UK alone, as <b>Meghan</b> remains in California home with children despite &#39;life-threatening&#39; floods",
        "description": "Prince Harry will travel to the UK alone after King Charles&#39; cancer diagnosis, it is understood, as his wife, Meghan Markle, remains at the family&#39;s California home despite the ongoing threat of &#39;life-threatening&#39; flooding."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-iii-cancer-diagnosis-093142056.html",
        "title": "King Charles III Cancer Diagnosis Dominates UK Headlines Amid Speculation Of Prince Harry Rapprochement",
        "description": "Buckingham Palace’s announcement on Monday evening UK time that King Charles III had been diagnosed with cancer sent newsrooms scrambling. The shock diagnosis comes just 17 months after the 75-year-old King took to the throne following the death of his mother Queen Elizabeth II in September 2022 after a 70-year reign."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25741424/meghan-markle-prince-harry-uk-king-charles-cancer/",
        "title": "<b>Meghan Markle</b> WON’T join Prince Harry when he jets to UK to see King Charles after cancer diagnosis",
        "description": "MEGHAN will not join Prince Harry in flying to the UK to visit King Charles following his cancer diagnosis. The Duchess of Sussex, 42, will remain at their Montecito mansion with children Archie,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512839/prince-harry-real-thoughts-on-dad-king-charles/",
        "title": "Prince Harry&#39;s real thoughts on dad King Charles and why a reconciliation is possible",
        "description": "The Duke and his father have had an arguably turbulent relationship over the past few years following Prince Harry and his wife, <b>Meghan Markle</b>&#39;s exit from the UK in 2020, and most recently following Harry&#39;s bombshell memoir, Spare which was published in ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-king-charles-cancer-32056031",
        "title": "Prince Harry rushes to airport for flight to be with King Charles after cancer diagnosis",
        "description": "Harry is due to land in the UK around midday today to be with his father as soon as possible. He will not be accompanied by his wife <b>Meghan Markle</b>, or their two children - Prince Archie and Princess Lilibet. READ MORE - President Higgins sends good wishes ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/king-charles-public-duty-pressure-231801477.html",
        "title": "With King Charles out of public duty, the pressure for royals to step up mounts",
        "description": "Buckingham Palace announced on Monday that King Charles has cancer. He will not be participating in &quot;public-facing duties&quot; during treatment."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-travel-uk-alone-king-charles-cancer-diagnosis/",
        "title": "Prince Harry will travel to UK alone after King Charles&#39; cancer diagnosis, with <b>Meghan</b> to stay at home with children",
        "description": "Prince Harry will travel to the UK alone after King Charles&#39; cancer diagnosis, it is understood. His wife, Meghan Markle, will stay in the United States with their children, Archie and Lilibet, as the Duke of Sussex visits his father."
    },
    {
        "url": "https://www.instyle.com/prince-harry-visit-king-charles-cancer-diagnosis-8559139",
        "title": "Prince Harry Will Head to the U.K. to Visit King Charles After His Cancer Diagnosis",
        "description": "Sources close to the royal family shared that Prince Harry will make time to go to the United Kingdom to visit his father after Buckingham Palace shared that King Charles has cancer."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/king-charles-diagnosed-form-cancer-20229277/?ico=trending-module_category_news_item-6",
        "title": "King Charles spends night at home after cancer diagnosis as Harry arrives at LA airport",
        "description": "He will fly from California to London while the Duchess of Sussex <b>Meghan Markle</b> will stay at home with their two children, Prince Archie, four, and Princess Lilibet, two. Prince William is set to take up more public duties as both his father and wife ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512791/king-charles-postpones-public-duties-cancer-treatment-live-updates/",
        "title": "King Charles diagnosed with cancer: Queen Camilla to &#39;support&#39; monarch through diagnosis",
        "description": "All we know following the King&#39;s cancer diagnosis: While it was known that Harry would come to the UK to visit his father, it was unclear as to whether he&#39;d be joined by <b>Meghan Markle</b> and the pair&#39;s two children, Prince Archie and Princess Lilibet."
    }
]