[
    {
        "url": "https://www.dailymail.co.uk/news/article-12966161/MAUREEN-CALLAHAN-Harry-Meghan-Queen-nickname-Lilibet.html",
        "title": "MAUREEN CALLAHAN: We all have one insufferable family member. The royals have Harry AND <b>Meghan</b> - and when the gruesome twosome enraged the Queen by co-opting and adopting her ...",
        "description": "We now know the rage the late Queen Elizabeth felt when the Sussexes, counter to their narrative, named their daughter Lilibet - the Queen&#39;s nickname, used only by the very few closest to her."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-welcomes-ellen-degeneres-172020285.html",
        "title": "<b>Meghan Markle</b> Welcomes Ellen DeGeneres&#39; Chicken to &#39;New Home&#39; in Rare Instagram Video from California Home",
        "description": "The Duchess of Sussex can be heard in a new video update on the host&#39;s chicken Sinkie, who now lives with Harry and Meghan"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856401/meghan-markle-lilibet-name-row",
        "title": "<b>Meghan Markle</b> &#39;copyrighted&#39; Lilibet&#39;s name &#39;before she even gave birth&#39;, expert claims",
        "description": "A royal expert alleged that Meghan Markle had copyrighted Lilibet before her daughter was even born which added to the late Queen&#39;s fury."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markles-mouthpiece-omid-scobie-31895522.amp",
        "title": "<b>Meghan Markle</b>&#39;s &#39;mouthpiece&#39; Omid Scobie says Lilibet name row is &#39;not doing Queen any favours&#39;",
        "description": "Royal author Omid Scobie, who wrote a glowing biography of Prince Harry and Meghan Markle, has hit out at new claims surrounding the naming of their daughter Lilibet, after the late Queen"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12968971/Princess-Anne-raised-concerns-decent-sized-hat-blocked-Prince-Harrys-view-Kings-Coronation-told-wear-organisers-new-book-reveals.html",
        "title": "Princess Anne raised concerns over &#39;decent-sized hat&#39; that blocked Prince Harry&#39;s view at King&#39;s Coronation but was told to wear it by organisers, new book reveals",
        "description": "In Robert Hardman&#39;s new book, Princess Anne defends herself, explaining she had changed seats at the last minute in the hopes of a &#39;speedy exit&#39;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-one-word-reply-31893225",
        "title": "<b>Meghan Markle</b>&#39;s one-word reply after Prince William&#39;s reaction to Oprah Winfrey chat",
        "description": "The Duke and Duchess of Sussex received a text message from Prince William while they were filming their Netflix docuseries with Meghan&#39;s blunt reaction being caught on camera."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/meghan-markle-not-earnt-right-9038266",
        "title": "<b>Meghan Markle</b> had not &#39;earnt the right&#39; to name daughter Lilibet claims expert",
        "description": "Meghan Markle and Prince Harry reportedly left the Queen &#39;furious&#39; when they named their daughter Lilibet, with one expert saying the Duchess &#39;stamped&#39; her personality on the moniker"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856091/royal-family-live-meghan-markle-prince-harry-lilibet-name",
        "title": "Royal Family LIVE: <b>Meghan Markle</b> and Prince Harry ‘rebuffed’ by palace after bombshell",
        "description": "One royal historian claimed the late Queen Elizabeth II was incredibly angry about how Harry and Meghan had handled the situation around their daughter&#39;s name."
    },
    {
        "url": "https://www.ok.co.uk/royal/queen-lilbert-name-harry-meghan-31892980",
        "title": "Queen&#39;s furious exact words over naming of Lilibet by Prince Harry and <b>Meghan Markle</b>",
        "description": "The Queen was allegedly unhappy over Prince Harry and Meghan Markle using her nickname, Lilibet, as their daughter&#39;s name – despite the pair claiming to have asked for permission"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-spare-sequel/",
        "title": "Buckingham Palace fears Prince Harry will release sequel to bombshell memoir Spare after he &#39;leaves out key events&#39;",
        "description": "Buckingham Palace fears Harry could release a sequel to Spare because &quot;large chunks&quot; from recent events were left out."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511346/meghan-markle-new-video-montecito-home-chicken-coop/",
        "title": "<b>Meghan Markle</b> shares new video from inside her Montecito home - and it&#39;s adorable",
        "description": "Meghan Markle has shared a rare home video with TV host and neighbour Ellen DeGeneres after the Duchess adopted Ellen&#39;s pet chicken, Sinkie."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25310704/best-nose-in-the-world-golden-ratio/",
        "title": "From Michelle Keegan to Kate Middleton, who has the ‘best nose’ in the world? According to the golden ratio…",
        "description": "ARIANA Grande has the most perfect nose according to the golden ratio.  This theory has been used to decide who the most attractive people are, but what is the golden ratio? Ariana Grande"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-archie-lilibet-expected-excellent-103903745.html",
        "title": "Prince Archie and Lilibet expected to take “excellent care” of the ‘beautiful’ new addition to their family (royal title TBC)",
        "description": "Prince Archie has welcomed a new addition to the family as celebrity neighbour Ellen DeGeneres gives up one of her beloved chickens, revealing it has joined the Sussexes&#39; flock."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markle-took-31891318",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;took only thing Queen owned&#39; by naming daughter Lilibet",
        "description": "According to royal insiders, the late Queen was &#39;so upset&#39; by Prince Harry and Meghan Markle&#39;s decision to call their youngest child Lilibet - the former monarch&#39;s old nickname"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markle-welcome-new-member-family-1722760",
        "title": "Prince Harry, <b>Meghan Markle</b> Welcome New Member To Family",
        "description": "Prince Harry and Meghan Markle have welcomed a new member to their family of chickens at their mansion in Montecito, Santa Barbara, California."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25367673/meghan-markle-career-comeback-kate-middleton-hollywood/",
        "title": "Real reason <b>Meghan</b> ‘deliberately’ shunned Hollywood event amid career comeback – as Kate’s popularity in US rises",
        "description": "SHE was absent from the Golden Globes and is unlikely to attend the Oscars, but Meghan Markle’s decision not to walk the red carpet could have been “a deliberate and strategic one”. According to"
    },
    {
        "url": "https://www.thesun.ie/royals/12008152/palace-fears-prince-harry-spare-sequel/",
        "title": "Palace ‘fears Harry will write damaging sequel to Spare’ after after spotting 3 major questions he hasn’t answered",
        "description": "PRINCE Harry may release a sequel to Spare after leaving out “large chucks” of three key events, Buckingham Palace fears. The bombshell memoir hit shelves just over a year ago, and"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/harry-meghan-lilibet-robert-hardman-king-biography-b2478702.html",
        "title": "Late Queen ‘infuriated’ by Harry and <b>Meghan</b>’s claim over naming of daughter Lilibet",
        "description": "A new autobiography has claimed the late Queen was ‘as angry as I’d ever seen her’ following the couple’s claim"
    },
    {
        "url": "https://www.ibtimes.co.uk/suits-co-star-says-hate-against-meghan-markle-means-nothing-1722757",
        "title": "&#39;Suits&#39; Co-star Says Hate Against <b>Meghan Markle</b> &#39;Means Nothing&#39;",
        "description": "Pierce echoed the same reminders he gave Meghan Markle during her last day on the set of &quot;Suits&quot; in 2017. He revealed during an interview on Harry Connick Jr&#39;s chat show in 2018 that it was just him and her in the room and he was compelled to share some parting words."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middleton-meghan-markle-royal-31883593",
        "title": "<b>Meghan</b> fallout saw Kate look overseas to ease ‘lonely’ royal life",
        "description": "EXCLUSIVE: Experts explain how the Princess of Wales is missing out on one crucial relationship in the &quot;lonely&quot; Royal Family and how she has found this crucial bond overseas"
    },
    {
        "url": "https://www.instyle.com/jennifer-aniston-sleeveless-turtleneck-8425420",
        "title": "Jennifer Aniston Wore the Genius, All-Season Staple Your Closet Is Probably Missing",
        "description": "Jennifer Aniston wore a turtleneck tank top to a recent Los Angeles event, proving it’s the most versatile closet basic ever. Shop the best turtleneck tank tops from Reformation, Ag, and Skims."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-suffer-31892890",
        "title": "<b>Meghan Markle</b> and Prince Harry suffer &#39;devastating&#39; snub at Emmy Awards",
        "description": "Prince Harry and <b>Meghan Markle</b> are moving onto bigger and better things after their brutal Emmy Award snub. The Duke and Duchess of Sussex made a comeback to Hollywood in 2022 with their bombshell Netflix documentary series, Harry &amp; <b>Meghan</b>. The shocking ..."
    },
    {
        "url": "https://www.samaa.tv/208738158-meghan-markle-makes-power-move-skips-globes",
        "title": "<b>Meghan Markle</b> makes power move, skips globes",
        "description": "In a move perceived as calculated and strategic, <b>Meghan Markle</b>, the Duchess of Sussex, deliberately chose to bypass the glittering 2024 Golden Globe Awards and other high-profile Hollywood events, according to insights from PR expert Ed Hopkins. In an ..."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/meghan-and-harry-reportedly-wounded-by-awards-show-snub-235939654.html",
        "title": "<b>Meghan</b> and Harry reportedly &#39;wounded&#39; by awards show snub",
        "description": "Prince Harry and Meghan Markle reportedly feel &#39;wounded&#39; after being snubbed for an award at the Emmys this year. Read more."
    },
    {
        "url": "https://www.lifeandstylemag.com/posts/is-meghan-markle-using-ozempic-amid-her-weight-loss/",
        "title": "Is <b>Meghan Markle</b> on Ozempic? Fans Question Duchess of Sussex’s Noticeable Weight Loss",
        "description": "Meghan Markle was spotted looking noticeably thinner throughout 2023, leading many fans to speculate if the former senior royal is using the drug Ozempic."
    },
    {
        "url": "https://www.bandt.com.au/most-work-shes-done-all-year-meghan-markles-cameo-in-coffee-ad-cops-a-roasting/",
        "title": "“Most Work She’s Done All Year!” <b>Meghan Markle</b>’s Cameo In Coffee Ad Cops A Roasting",
        "description": "Seemingly tired of pissing off her in-laws back in the UK, Meghan Markle (AKA the Duchess of Sussex) has returned to her acting roots in a social media ad for American coffee brand Clevr. The 42-year-old royal is a part-owner in the brand that markets itself as “super-powered lattes for energy,"
    },
    {
        "url": "https://radaronline.com/p/harry-meghan-need-original-ideas-make-break-year-hollywood-executive/",
        "title": "Prince Harry, <b>Meghan Markle</b> in Dire Need of &#39;Original Ideas&#39; for &#39;Make or Break&#39; Year, Hollywood Exec Says",
        "description": "Prince Harry and Meghan Markle need to find their niche and come up with &quot;original ideas,&quot; said a Hollywood exec."
    },
    {
        "url": "https://www.aol.com/harry-meghan-insist-queen-signed-202840279.html",
        "title": "Harry and <b>Meghan</b> Insist Queen Signed Off on Lilibet&#39;s Name: Source",
        "description": "Despite recent claims to the contrary, the late Queen Elizabeth II did approve of Prince Harry and Meghan Markle naming their daughter Lilibet. “Meghan and Harry 100 percent got permission from the queen to use the name Lilibet,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163320/20240117/emmy-awards-overlook-prince-harry-and-meghan-s-netflix-documentary-in-shocking-snub.htm",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Emmy Hopes Dashed in &#39;Devastated&#39; Snub, Here&#39;s Why",
        "description": "Despite high viewership and significant public interest, Prince Harry and Meghan Markle&#39;s Netflix docuseries, &quot;Harry &amp; Meghan,&quot; failed to receive a nomination at the 2024 Emmy Awards."
    },
    {
        "url": "https://www.pennlive.com/nation-world/2024/01/before-her-death-this-grandchilds-name-ticked-off-queen-elizabeth.html",
        "title": "Before her death, this grandchild’s name ticked off Queen Elizabeth",
        "description": "A new autobiography said the late monarch was “as angry as I’d ever seen her” after the couple stated she had been “supportive” of the chosen name."
    },
    {
        "url": "https://nypost.com/2024/01/16/entertainment/harry-and-meghan-100-percent-had-queen-elizabeth-iis-blessing-on-lilibets-name/",
        "title": "Prince Harry and <b>Meghan Markle</b> ‘100 percent’ had Queen Elizabeth’s blessing on Lilibet’s name",
        "description": "Days after author and royal expert Robert Hardman claimed in his new biography, “ Charles III: New King. New Court. The Inside Story ” that the late Queen Elizabeth was furious over Prince Harry and Meghan Markle naming their daughter Lilibet, a new source claims the Sussexes had the monarch’s support with the moniker."
    },
    {
        "url": "https://www.usmagazine.com/celebrity-news/news/harry-and-meghan-insist-queen-signed-off-on-lilibets-name-source/",
        "title": "Prince Harry and <b>Meghan Markle</b> ‘100 Percent’ Had Queen Elizabeth II’s Blessing for Lilibet’s Name (Exclusive)",
        "description": "Prince Harry and Meghan Markle ‘100 percent got permission’ from the late Queen Elizabeth II to name their daughter Liilibet, a source tells Us"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/16/harry-meghan-lilibet-row-queen-elizabeth-nickname/",
        "title": "How using ‘Lilibet’ became Harry and <b>Meghan</b>’s final insult to Queen Elizabeth",
        "description": "In recycling the affectionate moniker, the Duke and Duchess of Sussex may have broken royal protocol and widened a family rift"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1148460-meghan-markle-prince-harrys-netflix-deal-may-not-be-renewed",
        "title": "<b>Meghan Markle</b>, Prince Harry&#39;s Netflix deal may not be &#39;renewed&#39;",
        "description": "Meghan Markle and Prince Harry&#39;s lucrative Netflix partnership may not be &#39;renewed&#39; as the couple seemingly left with no creative projects to produce.The Duke and Duchess of Sussex signed"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-the-new-claims-saying-harry-and-meghan-didnt-have-the-queen-authorisation-dont-add-up_art20792.html",
        "title": "Princess Lilibet: The new claims saying Harry and <b>Meghan</b> didn’t have the Queen authorisation don’t add up",
        "description": "Royal author Robert Hardman is coming out with a new unauthorised biography called Charles III: New King. New Court. The Inside Story. Before the official release, Daily Mail is"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-royal-family-could-face-another-blow-from-him-royal-expert-claims_art20791.html",
        "title": "Prince Harry: Royal Family could face another blow from him, royal expert claims",
        "description": "Amidst this, a royal expert has claimed that the book has backfired. This comes as Prince Harry’s reputation lies in tatters and his relationship with his family is left irreparable, claims The Sun. Royal expert Jennie Bond shared:"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/jung-hae-in-sends-coffee-truck-for-kim-soo-hyun-on-latters-upcoming-rom-com-queen-of-tears-set-1271934",
        "title": "Jung Hae In sends coffee truck for Kim Soo Hyun on latter’s upcoming rom-com Queen of Tears’ set",
        "description": "Korean celebs Jung Hae In and Kim Soo Hyun are serving major friendship goals as the former sent a coffee truck to the set of the latter&#39;s new drama Queen of Tears. Read on to know how fans reacted!"
    },
    {
        "url": "https://ca.sports.yahoo.com/news/drumstick-comedian-eric-andr-want-161036249.html",
        "title": "Drumstick And Comedian Eric André Want To Give You The Day Off To Eat Ice Cream - Exclusive Interview",
        "description": "Drumstick, Eric André, and almost 20 million others know that the day after the Super Bowl should be a holiday. They told Mashed how they can make it happen."
    },
    {
        "url": "https://pagesix.com/2024/01/16/royal-family/royal-biographer-slams-claim-queen-didnt-approve-lilibets-name/",
        "title": "Royal biographer Omid Scobie slams claim Queen Elizabeth II didn’t approve Princess Lilibet’s name",
        "description": "A royal aide claimed in a forthcoming book that the late monarch was “angry” when the couple publicly said she had approved the use of her childhood nickname."
    },
    {
        "url": "https://www.btimesonline.com/articles/163308/20240116/prince-harry-and-meghan-markle-expand-their-animal-family-with-new-chicken-sinkie.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Expand Their Animal Family with New Chicken, Sinkie",
        "description": "Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, have recently expanded their beloved animal family by welcoming a new chicken, Sinkie, into their Montecito home. The addition comes as a kind gesture from their neighbor,"
    },
    {
        "url": "https://www.newsweek.com/princess-lilibet-name-scandal-queen-legacy-1861022",
        "title": "Princess Lilibet Scandal Tarnishing Queen&#39;s Legacy",
        "description": "Accounts of Queen Elizabeth&#39;s fury at Prince Harry and Meghan Markle&#39;s baby name are not doing her &quot;any favors,&quot; Omid Scobie says."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-infuriated-prince-harry-meghan-markle-claim-asked-permission-name-daughter-lilibet.html/",
        "title": "Queen Elizabeth Infuriated Over Prince Harry and <b>Meghan Markle</b>’s Claim They Asked Permission to Name Their Daughter Lilibet",
        "description": "Queen Elizabeth was quite unhappy Prince Harry and Meghan Markle didn&#39;t ask before naming their daughter Lilibet a new book claims."
    },
    {
        "url": "https://www.cosmopolitan.com/entertainment/celebs/a46407501/palace-worried-prince-harry-spare-sequel/",
        "title": "The Palace Is Worried Prince Harry Left Out &quot;Large Chunks&quot; in &#39;Spare&#39; and Could Write a Sequel",
        "description": "Nevertheless, according to royal biographer Robert Hardman&#39;s new book, Buckingham Palace is concerned that Harry left out &quot;large chunks&quot; of events that happened following his 2018 royal wedding to Meghan Markle."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-meghans-biographer-breaks-silence-lilibet-name-row-with-queen-swipe/",
        "title": "Harry and <b>Meghan</b>&#39;s biographer breaks silence over Lilibet name row with swipe at late Queen",
        "description": "Harry and Meghan&#39;s biographer Omid Scobie has stepped into the Lilibet name row with a swipe at the late Queen Elizabeth."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-comments-princess-lilibet-name-1860997",
        "title": "What Harry and <b>Meghan</b> Said About Naming Princess Lilibet",
        "description": "&quot;Lili is named after her great-grandmother, Her Majesty The Queen, whose family nickname is Lilibet,&quot; the couple said in 2021."
    },
    {
        "url": "https://www.couriermail.com.au/entertainment/celebrity-life/royals/nine-biggest-bombshells-from-robert-hardmans-new-book-on-the-royals/news-story/cf4f83bd78cd0fe8603be7354b195c04",
        "title": "Nine biggest bombshells from Robert Hardman’s new book on the royals",
        "description": "It’s the new royal book that’s set to be explosive for the British monarchy — and serve as another humiliating blow for Meghan and Harry when it’s released this week."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1148416-meghan-markle-harry-tried-to-smuggle-in-netflix-crew-during-windsor-walkabout",
        "title": "<b>Meghan Markle</b>, Harry &#39;tried to smuggle in&#39; Netflix crew during Windsor walkabout",
        "description": "Prince Harry and Meghan Markle allegedly tried to bring in a Netflix crew in Windsor during their walkabout with Prince William and Princess Kate following the death of Queen Elizabeth"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/prince-harry-news-meghan-markle-news-royal-family-news-queen-elizabeth-news-new-royal-book-101705402341309.html",
        "title": "Queen Elizabeth was ‘furious’ when Harry-<b>Meghan</b> lied publicly about this",
        "description": "Prince Harry and Meghan Markle said at the time that they would have not used the name without Queen Elizabeth&#39;s blessing."
    },
    {
        "url": "https://ca.yahoo.com/news/queen-infuriated-harry-meghan-claim-104006053.html",
        "title": "Late Queen ‘infuriated’ by Harry and <b>Meghan</b>’s claim over naming of daughter Lilibet",
        "description": "A new autobiography has claimed the late Queen was ‘as angry as I’d ever seen her’ following the couple’s claim"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/reignited-princess-lilibet-name-drama-hurts-late-queen-elizabeth-not-prince-harry-meghan-markle-author-says.html/",
        "title": "Reignited Princess Lilibet Name Drama Only Hurts the Late Queen Elizabeth, Not Prince Harry and <b>Meghan Markle</b>, Author Says",
        "description": "According to an author, the latest claim from a royal biography about Princess Lilibet being named after Queen Elizabeth damages the late monarch."
    },
    {
        "url": "https://www.bollywoodshaadis.com/articles/why-was-late-queen-elizabeth-ii-angry-when-prince-harry-meghan-markle-named-their-daughter-lilibet-48351",
        "title": "Why Was Late Queen Elizabeth II Angry When Prince Harry-<b>Meghan Markle</b> Named Their Daughter Lilibet?",
        "description": "Recent reports claim that the late Queen Elizabeth II was furious when the Duke and Duchess of Sussex, Harry and Meghan Markle, named their daughter Lilibet to honour the queen."
    },
    {
        "url": "https://nypost.com/2024/01/16/entertainment/prince-harry-meghan-markle-have-no-original-ideas-ahead-of-make-or-break-year-hollywood-exec-claims/",
        "title": "Prince Harry, <b>Meghan Markle</b> have ‘no original ideas’ ahead of ‘make or break year,’ Hollywood exec claims",
        "description": "The Duke and Duchess of Sussex have been warned of a “make or break year” after having signed a handful of lucrative deals in 2023 that have seemingly caused the ongoing royal rift to"
    },
    {
        "url": "https://news24online.com/world/royal-controversy-unveiled-queen-elizabeths-fury-over-harry-meghans-choice-of-babys-name/212099/",
        "title": "Queen Elizabeth Cried When <b>Meghan</b>, Harry Named Their Daughter Lilibet",
        "description": "Hardman&#39;s biography not only delves into the Lilibet controversy but also unveils Prince William&#39;s alleged rage over Harry."
    },
    {
        "url": "https://www.butlereagle.com/20240116/harry-and-meghan-infuriated-queen-with-claims-about-naming-their-daughter-lilibet-new-book-says/",
        "title": "Harry and <b>Meghan</b> infuriated queen with claims about naming their daughter Lilibet, new book says",
        "description": "A new royal biography asserts that Queen Elizabeth II was infuriated when Prince Harry and Meghan Markle claimed that she had given them her “blessing” to name their daughter Lilibet, her private"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/king-charles-lied-to-prince-harry-about-queen-elizabeths-funeral-to-avoid-101705338749120.html",
        "title": "King Charles lied to Prince Harry about Queen Elizabeth&#39;s funeral? ‘To avoid…’",
        "description": "Royal biographer Robert Hardman claimed in his new book that King Charles had not asked Kate Middleton to stay away. This is something Prince Harry did not know as Kate Middleton chose to be in Windsor with her three children, Prince George, 10, Princess Charlotte, eight, and Prince Louis, five."
    }
]