[
    {
        "url": "https://www.express.co.uk/news/royal/1863050/prince-harry-meghan-markle-poll",
        "title": "Royal Family LIVE: Prince Harry and <b>Meghan Markle</b>&#39;s popularity plunges in brutal new poll",
        "description": "Prince Harry and Meghan Markle&#39;s popularity since they left the Royal Family has continued its downward spiral, new polling results show."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-rushing-back-uk-32055183",
        "title": "Prince Harry &#39;rushing back to UK tonight&#39; as <b>Meghan</b> stays at home after Charles&#39; diagnosis",
        "description": "Prince Harry is believed to be flying back to the UK from California to be by his father King Charles III&#39;s side, after the news was confirmed that the Monarch has been diagnosed with cancer"
    },
    {
        "url": "https://www.leeds-live.co.uk/news/meghan-markle-stays-away-prince-28576402",
        "title": "<b>Meghan Markle</b> stays away as Prince Harry flies to see King Charles on his own following cancer diagnosis",
        "description": "Meghan Markle will not be returning to the UK to see King Charles, as her husband Prince Harry flies to London alone following his dad the King&#39;s cancer blow. Harry, The Duke of Sussex is flying back to the UK &#39;in the coming days&#39; to be with his dad, according to PA."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/celebs-tv/king-charles-final-years-plea-28576376",
        "title": "King Charles&#39; &#39;final years&#39; plea and the bitter feud as Prince Harry flies to UK after cancer diagnosis",
        "description": "Prince Harry is flying back to the UK urgently to see his father King Charles after it was made public that the monarch has been diagnosed with cancer. The Duke of Sussex, who lives in the States with wife Meghan Markle, has been locked in a feud with the Royal Family but is &#39;clearing his diary&#39; to fly back from his California home to see his dad."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/king-charles-diagnosed-form-cancer-20229277/?ico=trending-post-strip_item_2",
        "title": "King Charles diagnosed with cancer, Buckingham Palace announces",
        "description": "RAF Typhoon fighter jets scrambled to escort plane landing at Manchester Airport Captain Tom&#39;s daughter reduced to using her local lido as pool is removed from spa He will fly from California to London tonight, while the Duchess of Sussex <b>Meghan Markle</b> ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-travel-uk-alone-king-charles-cancer-diagnosis/",
        "title": "Prince Harry will travel to UK alone after King Charles&#39; cancer diagnosis, with <b>Meghan</b> to stay at home with children",
        "description": "Prince Harry will travel to the UK alone after King Charles&#39; cancer diagnosis, it is understood. His wife, Meghan Markle, will stay in the United States with their children, Archie and Lilibet, as the Duke of Sussex visits his father."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048479/Prince-Harry-London-King-Charles-Meghan-children-set-stay-LA-following-monarchs-cancer-diagnosis.html",
        "title": "Prince Harry will fly back to London to be by King Charles&#39; side TODAY but &#39;<b>Meghan</b> and children will stay in LA&#39; following monarch&#39;s cancer diagnosis",
        "description": "But Harry&#39;s wife <b>Meghan Markle</b> and their children Archie, four, and Lilibet, two, will stay in LA, a source close to the duke has revealed. The King A source close to Harry said that he had immediately decided to come to the UK as soon as possible to be ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-head-u-k-202117633.html",
        "title": "Prince Harry Will Head to the U.K. to Visit King Charles After His Cancer Diagnosis",
        "description": "Sources say Charles called his sons to tell them the news."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-personally-told-family-32054853",
        "title": "King Charles personally told family about cancer diagnosis with William in &#39;regular contact&#39;",
        "description": "King Charles has been diagnosed with cancer and will undergo immediate treatment. He personally told his children, Prince William and Prince Harry, and the rest of the Royal Family, about the diagnosi"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25741424/meghan-markle-prince-harry-uk-king-charles-cancer/",
        "title": "<b>Meghan Markle</b> WON’T join Prince Harry when he jets to UK to see King Charles after cancer diagnosis",
        "description": "MEGHAN will not join Prince Harry in flying to the UK to visit King Charles following his cancer diagnosis. The Duchess of Sussex, 42, will remain at their Montecito mansion with children Archie,"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-stay-prince-harry-32054716",
        "title": "<b>Meghan Markle</b> to stay in US as Prince Harry flies to be by King&#39;s side amid cancer news",
        "description": "Prince Harry is believed to already be travelling from Montecito, California, to be close to his father King Charles III&#39;s side after the news was confirmed that the Monarch has been diagnosed with ca"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-outright-refused-one-32049404?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> has outright refused to do one particular showbiz job in post-royal life",
        "description": "Prince Harry and Meghan&#39;s five-year deal with Netflix is set to come to an end in 2025 - but not before the couple release some new projects with the streaming giant"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048435/thomas-markle-king-charles-cancer-diagnosis.html",
        "title": "Thomas <b>Markle</b> sends King Charles &#39;all the good wishes in the world&#39; following cancer diagnosis",
        "description": "Meghan Markle &#39;s estranged father Thomas wished King Charles &#39;all the good wishes in the world&#39; for a speedy recovery from cancer on Monday night."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-travel-u-k-185805350.html",
        "title": "Prince Harry Will Travel to the U.K. Soon to See King Charles amid His Father&#39;s Cancer Diagnosis",
        "description": "Prince Harry is heading to the U.K. shortly after his father King Charles reveals his cancer diagnosis. The Duke of Sussex, 39, will travel to London in the coming days to visit his father, PEOPLE understands. The palace revealed on Monday that the King, 75, is being treated for cancer."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739492/prince-harry-is-flying-to-uk-to-support-king-charles-after-dads-cancer-diagnosis/?ref=upstract.com",
        "title": "Prince Harry flying to UK to support King Charles in days after speaking to him about cancer diagnosis",
        "description": "PRINCE Harry will fly to the UK to be with the King after he was diagnosed with cancer. The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him"
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-uk-king-cancer-diagnosis-2891386?ico=most_popular",
        "title": "Prince Harry will return to UK in coming days after King’s cancer diagnosis",
        "description": "Prince Harry will return to the UK in the coming days to see King Charles following his cancer diagnosis, it has been reported. The Duke of Sussex has spoken with the King about his diagnosis, a source close to the duke told the PA news agency."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-fly-back-uk-28575819",
        "title": "Prince Harry to fly back to UK after King Charles called personally to share cancer diagnosis",
        "description": "The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Harry said."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/prince-harry-dash-back-uk-32054205",
        "title": "Prince Harry to dash back to UK after father King Charles&#39; cancer diagnosis",
        "description": "READ MORE - King Charles diagnosed with cancer and begins treatment immediately - cancelling all duties According to the Telegraph, Harry is likely to fly to the UK tonight, arriving tomorrow but <b>Meghan Markle</b> and their children Prince Archie and Princess ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512796/will-meghan-markle-join-prince-harry-visit-king-charles-uk/",
        "title": "Will <b>Meghan Markle</b> and the kids join Prince Harry on his imminent trip to the UK?",
        "description": "Harry moved to California in 2020, after living in Canada for a few weeks. He and wife Meghan welcomed their second child, daughter Lilibet, in Los Angeles in June 2021. The family live in an £11million mansion in the exclusive Californian town of Montecito."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/king-charles-abdicates-line-of-succession-b2491011.html",
        "title": "British line of succession: Who is next heir to the throne as Charles diagnosed with cancer",
        "description": "As the second child of King Charles III and the late Princess Diana, Prince Harry is fifth in line for the throne after his brother, nephews and niece. His wife, Meghan Markle, is not in line for the throne - much like the Duchess of Cambridge - but their two children are."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-diagnosis-cancer-health-b2490960.html",
        "title": "King Charles has cancer and is stepping back from public duties",
        "description": "King Charles has been diagnosed with an unnamed form of cancer and is stepping back from royal duties, Buckingham Palace has said. The announcement comes after the monarch underwent surgery for an enlarged prostate which saw him spend three nights in hospital at the end of last month."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512790/prince-william-regular-contact-king-charles-cancer-diagnosis/",
        "title": "Prince William in regular contact with King Charles following cancer diagnosis",
        "description": "The Prince of Wales was personally told by his father King Charles about his recent cancer diagnosis. HELLO! understands that Prince William is in regular contact with his father following the news."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/meghan-markles-eyebrow-change-hint-9079230",
        "title": "<b>Meghan Markle</b>&#39;s eyebrow change may hint at Suits comeback",
        "description": "Meghan Markle, the Duchess of Sussex, has seemingly made a very subtle change to her appearance amid claims that she might be making a return to her acting career"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863276/meghan-markle-suits-acting-return-hollywood",
        "title": "<b>Meghan Markle</b>&#39;s &#39;guaranteed win&#39; to propel her to &#39;Hollywood&#39;s A-list&#39; in blockbuster move",
        "description": "EXCLUSIVE: Meghan Markle has been tipped to make a stunning career move that could see her Hollywood popularity skyrocket."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghan-hit-stinging-new-32049557?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "Harry and <b>Meghan</b> hit with stinging new claims about Queen Elizabeth&#39;s opinion of them",
        "description": "Prince Harry and <b>Meghan Markle</b> have come under fire in a brand new book, which suggests Queen Elizabeth II wasn&#39;t a fan of their romance or lavish wedding. The Duke and Duchess of Sussex started dating in 2016 before tying the knot in a fairy-tale wedding ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/wants-a-millionaire-players-shocks-celeb-phone-a-friend-20225668/?ico=metro-posts_home_whats-trending-now",
        "title": "Who Wants To Be A Millionaire? player floors everyone with celebrity phone-a-friend",
        "description": "The classic ITV gameshow returned last month for the first time since Clarkson’s <b>Meghan Markle</b> article landed him in hot water and one player has already brought two iconic gameshows together for the crossover no one expected. Adrian managed to get all ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/king-charles-75-announces-cancer-180333985.html",
        "title": "King Charles, 75, Announces Cancer Diagnosis, Postpones All Future Engagements for Now",
        "description": "A source says William, 41, is in regular contact with his father while Harry, 39, who relocated to California with his wife, <b>Meghan Markle</b>, in 2020, is expected to travel to the U.K. in the coming days The King also personally informed his siblings ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163783/20240206/meghan-markles-potential-uk-visit-reportedly-hanging-in-the-balance-as-prince-harry-prepares-upcoming-trip.htm",
        "title": "<b>Meghan Markle</b>&#39;s Potential UK Visit Reportedly &#39;Hanging in the Balance&#39; as Prince Harry Prepares Upcoming Trip",
        "description": "As Prince Harry prepares to return to the United Kingdom in the wake of King Charles III&#39;s recent cancer diagnosis, the question of whether Meghan Markle will accompany her husband remains uncertain."
    },
    {
        "url": "https://kmph.com/news/instagram/king-charles-iii-diagnosed-with-cancer-reports-say-illness-prostate-royal-family-health-queen-elizabeth-buckingham-palace-prince-william-prince-henry-kate-middleton-meghan-markle-princess-diana-queen-camilla",
        "title": "King Charles III diagnosed with cancer, Buckingham Palace says",
        "description": "&quot;Harry’s wife, <b>Meghan Markle</b>, and their two children, Prince Archie and Princess Lilibet, will not be heading across the pond with him,&quot; Page Six reported."
    },
    {
        "url": "https://www.today.com/popculture/royals/prince-harry-king-charles-relationship-rcna137330",
        "title": "What Prince Harry has shared about his relationship with King Charles",
        "description": "The Duke of Sussex and his wife, Meghan, Duchess of Sussex, have been largely estranged from the royal family in recent years."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/best-foundations-dry-skin-blake-215800912.html",
        "title": "The Best Foundations for Dry Skin That Blake Lively, Jessica Chastain, and <b>Meghan Markle</b> Swear by",
        "description": "The best foundations for dry skin in 2024 come in full coverage and lighter coverage options that add moisture to the skin. These are beauty editor-approved."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863445/meghan-markle-la-prince-harry-king-charles",
        "title": "<b>Meghan Markle</b> &#39;staying in LA with kids&#39; as Prince Harry races to be with King Charles",
        "description": "A source has revealed that the Duke of Sussex has dropped everything to support his dad - but Meghan won&#39;t be joining him."
    },
    {
        "url": "https://www.romper.com/entertainment/prince-harry-travel-uk-king-charles-cancer-diagnosis",
        "title": "Prince Harry Is Heading To The UK After Dad King Charles&#39; Cancer Diagnosis",
        "description": "King Charles has been diagnosed with cancer, Buckingham Palace confirmed in an official statement on Monday. The British monarch was recently released from the hospital after a prostate procedure, and cancer was identified in follow-up tests."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-popularity-improved-despite-allegations-racism.html/",
        "title": "Kate Middleton’s Popularity Has Improved In the Past Year Despite Allegations of Racism, New Poll Finds",
        "description": "Kate Middleton&#39;s reputation faced a blow when a royal author accused her of racism -- but somehow, her popularity has improved."
    },
    {
        "url": "https://ottawacitizen.com/news/harry-duke-of-sussex-to-visit-britain-on-news-of-king-charless-cancer-diagnosis",
        "title": "Harry, Duke of Sussex, to visit Britain on news of King Charles&#39;s cancer diagnosis",
        "description": "Prince Harry, the Duke of Sussex, will be travelling to Britain soon to visit his father, King Charles III, after the monarch was diagnosed with an undisclosed form of cancer."
    },
    {
        "url": "https://www.timesnownews.com/world/king-charles-cancer-diagnosis-will-meghan-markle-travel-to-uk-with-harry-article-107438290",
        "title": "King Charles Cancer Diagnosis: Will <b>Meghan Markle</b> Travel To UK With Harry?",
        "description": "Following the news broke out of the sovereign suffering from Cancer, all eyes are now on the daughter-in-law, <b>Meghan Markle</b> as she has not broken her silence on the matter. A Telegraph source familiar to the Royals has confirmed that <b>Meghan</b> is not going to ..."
    },
    {
        "url": "https://www.newstalkzb.co.nz/news/world/indicates-the-seriousness-harry-rushes-to-uk-amid-charles-cancer-diagnosis/",
        "title": "King Charles’ cancer diagnosis: Prince Harry flying to UK to support father",
        "description": "Prince Harry is rushing to be by his father’s side amid news of King Charles’ cancer diagnosis.  The Daily Telegraph has reported the Duke of Sussex - who"
    },
    {
        "url": "https://www.today.com/parents/family/prince-harry-meghan-markle-kids-rcna137326",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s kids: Everything to know",
        "description": "Prince Harry and <b>Meghan Markle</b>’s children Archie, 4, and Lilibet, 2, won&#39;t be inheriting their dad’s British accent. The couple, who stepped down as members of the royal family in 2021, are raising their two kids in Montecito, California. <b>Markle</b> ..."
    },
    {
        "url": "https://hollywoodlife.com/2024/02/05/prince-harry-flying-england-king-charles-cancer-diagnosis/",
        "title": "Prince Harry Reportedly Flying to England to be With Dad King Charles After Cancer Diagnosis",
        "description": "The Duke of Sussex will reportedly head to Windsor Castle in the next few days to be with the head royal."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/king-charles-diagnosed-form-cancer-20229277/?ico=related-posts",
        "title": "King Charles diagnosed with cancer, Buckingham Palace announces",
        "description": "The King will begin a schedule of treatments soon for his condition and step back from public duties for a period."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/meghan-markle-might-not-happy-215518363.html",
        "title": "<b>Meghan Markle</b> Might Not Be Happy With Her Father’s Latest Attempt To Weigh in on the Royal Family",
        "description": "As the nation grapples with this unsettling news, another familiar voice has emerged from across the Atlantic —Thomas <b>Markle</b>, father of <b>Meghan</b>, Duchess of Sussex. <b>Markle</b> senior’s relationship with his daughter has been fraught with tension and public ..."
    },
    {
        "url": "https://www.hellomagazine.com/brides/512774/meghan-markle-wedding-dress-all-the-details/",
        "title": "<b>Meghan Markle</b>&#39;s £100k wedding dress: Hidden details, rare photos and fascinating story behind it",
        "description": "Designed by Givenchy&#39;s Clare Waight Keller, the former Suits actress&#39; gown featured a bateau neckline, a fitted bodice that highlighted her slender waist and three-quarter sleeves. It perfectly embodied her &quot;effortless American style,&quot; said the designer, who described the finished dress as: &quot;Not overly feminine, but not really minimal either.&quot;"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-travel-uk-see-182800001.html",
        "title": "Prince Harry to travel to UK to see King &#39;in coming days&#39; after cancer diagnosis",
        "description": "The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Harry said. The King has started treatment today, a Buckingham Palace statement says."
    },
    {
        "url": "https://www.ok.co.uk/tv/harry-meghan-this-morning-royal-32050213",
        "title": "ITV This Morning star takes cheeky swipe at Harry and <b>Meghan</b> over Charles visit",
        "description": "This Morning&#39;s Camilla Tominey made a comment about Prince Harry and Meghan Markle after news about King Charles&#39; exciting plans for the Sandringham Estate emerged"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/meghan-markles-blunt-response-questioned-32050128",
        "title": "<b>Meghan Markle</b>&#39;s blunt response when questioned about return to acting",
        "description": "Speculation has been rife that Meghan Markle plans to return to her previous career but she was once asked outright and she had a very blunt reply."
    },
    {
        "url": "https://www.irishmirror.ie/tv/itv-morning-star-takes-swipe-32049555",
        "title": "ITV This Morning star takes swipe at Prince Harry and <b>Meghan Markle</b> over King Charles visit",
        "description": "This Morning regular Camilla Tominey took a subtle swipe at Prince Harry and Meghan Markle and joked they could stay in a tent should they choose to visit King Charles at Sandringham"
    },
    {
        "url": "https://metro.co.uk/2024/02/05/wants-a-millionaire-players-shocks-celeb-phone-a-friend-20225668/",
        "title": "Who Wants To Be A Millionaire? player floors everyone with celebrity phone-a-friend",
        "description": "A contestant on Who Wants To Be A Millionaire? floored Jeremy Clarkson when he turned out to have the most useful celebrity phone a friend."
    },
    {
        "url": "https://uk.style.yahoo.com/dua-lipa-co-signs-square-010612378.html",
        "title": "Dua Lipa Co-Signs the Square Nail Trend With a Milky Jelly Manicure at the 2024 Grammys",
        "description": "Taylor Swift caught a little backlash after her Album of the Year win at the Grammy Awards. The “Anti-Hero” singer made history by taking the accolade, which was presented by Celine Dion, who made a rare appearance amid her battle with Stiff Person Syndrome (SPS). Overwhelmed with excitement, Swift took the stage at Crypto.com Arena …"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-firmly-told-family-32047385",
        "title": "Prince Harry firmly told family friend he &#39;didn&#39;t want Archie to follow in Queen&#39;s footsteps&#39;",
        "description": "Prince Harry confessed to a family friend that he didn&#39;t want Prince Archie to follow in the footsteps of the late Queen, just months before he and <b>Meghan Markle</b> made their sensational exit from the Royal Family. The Duke and Duchess of Sussex announced ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/details-prince-harrys-last-minute-28576542",
        "title": "Details of Prince Harry&#39;s last minute flight home after King Charles&#39; cancer diagnosis revealed by source",
        "description": "Don’t make my final years a misery.” Harry and <b>Meghan</b> wanted a half in-half out approach to royal life, but in the end quit as senior working royals amid the Megxit crisis in 2020. In their primetime Oprah interview in 2021, they went on to accuse an ..."
    }
]