[
    {
        "url": "https://www.thesun.co.uk/royals/25440537/harry-meghan-contact-king-kate-best-wishes/",
        "title": "Harry and <b>Meghan</b> ‘have tried to contact the King and Kate to pass on their best wishes’",
        "description": "PRINCE Harry and <b>Meghan Markle</b> have tried to contact the King and Kate as they undergo hospital procedures, it has been reported. The Duke and Duchess of Sussex are said to have reached out to “both parties in different pays to pass on their concern and ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-makes-joke-king-31933838",
        "title": "Prince Harry makes joke about King Charles at awards ceremony amid health woes",
        "description": "Prince Harry cracked a joke about his father King Charles III at the Living Legends of Aviation awards, ahead of his prostate operation, which he will undergo in the upcoming days"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/queen-changed-prince-louis-official-31934752",
        "title": "The Queen changed Prince Louis&#39; official name after overturning historic rule",
        "description": "The Queen changed the name of William and Kate&#39;s third child Prince Louis after overturning a historic rule made by King George V. The Prince and Princess of Wales&#39; youngest son was born on April 23, 2018, and the proud new parents named him Louis Arthur Charles."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markles-influence-prince-harrys-31933319",
        "title": "<b>Meghan Markle</b>&#39;s influence on Prince Harry&#39;s workout routine is clear to see, says expert",
        "description": "Prince Harry&#39;s legs look more toned than they used to when he played rugby and polo - and this could mean he is practicing sports such as yoga and pilates, a personal trainer said"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-why-returning-to-acting-would-be-a-step-backwards-for-her-according-to-an-expert_art20853.html",
        "title": "<b>Meghan Markle</b>: Why returning to acting would be a &#39;step backwards&#39; for her, according to an expert",
        "description": "It’s no secret that the Duchess of Sussex is trying to ‘rebuild’ herself in the US and her plans may not include returning to the acting world. Here’s"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858217/Meghan-Markle-acting-suits-hollywood-friends",
        "title": "<b>Meghan Markle</b> cuts off former Hollywood friends to &#39;relaunch&#39; herself in new role",
        "description": "<b>Meghan Markle</b> is not expected to return to acting this year as she&#39;s busy writing her memoir, set to be released in 2025, according to an expert. The Duchess of Sussex, 42, is rumoured to be working on a tell-all book, following the release of Prince Harry ..."
    },
    {
        "url": "https://www.instyle.com/prince-harry-called-out-john-travolta-1985-dance-princess-diana-8546895",
        "title": "Prince Harry Called Out John Travolta for &quot;Dining Out&quot; on His 1985 Dance With Princess Diana",
        "description": "&quot;Thank you, that’s it, we’re done,&quot; he said while holding up his hand. Sources Close to <b>Meghan Markle</b> and Prince Harry Say They&#39;re &quot;Embarking on a Total System Reboot&quot; The Living Legends of Aviation Awards are organized by the Kiddie Hawk Air Academy ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858023/royal-family-live-meghan-markle-prince-harry-montecito-empire",
        "title": "Royal Family LIVE: <b>Meghan Markle</b> and Prince Harry&#39;s Montecito empire receives another blow",
        "description": "Prince Harry and Meghan Markle were blasted by a TV host who said their &#39;crumbling Montecito empire&#39; has taken a huge hit after the Duke dropped his libel case earlier this week."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markle-admit-28486398",
        "title": "Prince Harry and <b>Meghan Markle</b> admit &#39;concern&#39; for Kate Middleton after surgery",
        "description": "Prince Harry and Meghan Markle have reportedly sent a message of support to Prince William amid King Charles and Kate Middleton&#39;s health battles. The Sussexes are reported to be &quot;concerned&quot; about Kate&#39;s health after news of her abdominal surgery emerged."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/sarah-ferguson-reveals-skin-cancer-181208465.html",
        "title": "Sarah Ferguson Reveals Skin Cancer Diagnosis Weeks After Announcing That She &#39;Beat&#39; Breast Cancer",
        "description": "She is undergoing further investigations to ensure that this has been caught in the early stages,” a rep for the Duchess of York said"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-face-31931416.amp",
        "title": "<b>Meghan Markle</b> and Prince Harry face &#39;crumbling Montecito empire&#39; despite &#39;wise decision&#39;",
        "description": "Meghan Markle and Prince Harry are said to be facing a &#39;crumbling Montecito empire&#39; despite the Duke of Sussex&#39;s recent &#39;wise decision&#39;, it has been claimed by a broadcaster"
    },
    {
        "url": "https://metro.co.uk/2024/01/21/kate-middleton-king-charles-sent-get-well-messages-harry-meghan-20147944/",
        "title": "Harry and <b>Meghan</b> ‘send get well messages’ to Kate and Charles",
        "description": "Prince Harry and Meghan Markle have sent ‘get well’ messages to Kate Middleton and King Charles after both were hit with health concerns. Catherine, Princess of Wales, is recovering in hospital following abdominal surgery in London last week."
    },
    {
        "url": "https://metro.co.uk/2024/01/21/kate-middleton-king-charles-sent-get-well-messages-harry-meghan-20147944/?ico=trending-module_tag_prince-charles_item-0",
        "title": "Harry finally wishes his dad well after snubbing him in glitzy Hollywood bash speech",
        "description": "Prince Harry and Meghan Markle have sent ‘get well’ messages to Kate Middleton and King Charles after both were hit with health concerns. Catherine, Princess of Wales, is recovering in hospital following abdominal surgery in London last week."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12988613/Harry-Meghan-send-messages-Kate-Middleton-King-Sussexes-pass-concerns-best-wishes-princess-recovers-abdominal-surgery-Charles-prepares-enlarged-prostate-procedure.html",
        "title": "Harry and <b>Meghan</b> &#39;send get well messages&#39; to Kate Middleton and the King: Sussexes &#39;pass on their concerns and best wishes&#39; as princess recovers from abdominal surgery and ...",
        "description": "The Princess of Wales, 42, is currently recovering after going under the knife for her abdominal operation at London Clinic near Regent&#39;s Park."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12988515/prince-harry-living-legend-aviation-joke-flight-king-charles.html",
        "title": "Prince Harry makes joke about King Charles at aviation awards bash in LA telling audience his was &#39;terrified&#39; when his father jumped behind the controls of a helicopter when ...",
        "description": "The Duke of Sussex was inducted into the &#39;Living Legends of Aviation&#39; during a glitzy ceremony in Los Angeles where he was asked by host John Travolta about his first flight experience."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-reportedly-090125810.html",
        "title": "Prince Harry and <b>Meghan Markle</b> are reportedly ‘shocked’ about the controversial reaction to their baby name",
        "description": "Following reports that Queen Elizabeth II was left &#39;furious&#39; over Prince Harry and Meghan Markle&#39;s decision to name their daughter after her childhood nickname, the couple are reportedly ‘shocked’ over the public&#39;s outraged reaction but not, sadly, surprised as the &#39;smear campaign&#39; continues."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25421000/meghan-markle-royal-marriage/",
        "title": "5 times <b>Meghan Markle</b> broke royal protocol – from inappropriate fashion choices to her weekend wedding day",
        "description": "MEGHAN Markle took on the role of a lifetime when she married Prince Harry and joined the Royal Family.  In May 2018, the former Suits actress tied the knot in front of 29.19 million viewers"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/princess-wales-news-latest-kate-150200414.html",
        "title": "Royal news - live: Prince Harry and <b>Meghan</b> ‘send get well message’ to King Charles and Kate",
        "description": "Prince Harry and <b>Meghan Markle</b> moved to California in the summer of 2020 after they stepped back from royal duties. Prince Harry may not have been informed about King Charle’s enlarged prostate before the news was announced to the public, say the Telegraph."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-meghan-markle-get-well-message-king-charles-kate/",
        "title": "Prince Harry and <b>Meghan</b> &#39;send get well messages&#39; to King Charles and Kate amid double health scare",
        "description": "Prince Harry and Meghan Markle are said to have sent get well messages to King Charles and Kate amid their double health scare."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markle-reach-28485279",
        "title": "Prince Harry and <b>Meghan Markle</b> reach out to Royal Family over Kate Middleton&#39;s health",
        "description": "Kate underwent abdominal surgery earlier this week and is now back at home, resting, and has cleared her diary until the spring."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-face-31934556",
        "title": "Prince Harry and <b>Meghan Markle</b> face &#39;crumbling Montecito empire&#39;",
        "description": "Harry and <b>Meghan</b>&#39;s &quot;crumbling Montecito empire&quot; has received another blow despite the Duke of Sussex making a &quot;wise decision&quot; recently. Prince Harry made the decision to withdraw his libel case against the Mail on Sunday newspaper earlier this week."
    },
    {
        "url": "https://goss.ie/uk-showbiz/prince-harry-and-meghan-reach-out-to-king-charles-and-kate-middleton-amid-their-respective-health-scares-366247",
        "title": "Prince Harry and <b>Meghan</b> ‘reach out to King Charles and Kate Middleton’ amid their respective health scares",
        "description": "Prince Harry and <b>Meghan Markle</b> have reportedly reached out to King Charles and Kate Middleton amid their respective health scares. According to The Mirror, the couple have sent messages of support to the Princess of Wales, who is recovering from abdominal ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-meghan-markle-reach-221517994.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Reach Out to King Charles and Princess Kate In an “Olive Branch” Gesture After Recent Health Scares",
        "description": "Well, how’s this for good news on a Saturday? The Mirror reports that, following news of health scares for both King Charles and the Princess of Wales, Prince Harry and <b>Meghan Markle</b> have reached out to send well-wishes. Charles will be hospitalized for ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/did-travis-kelce-give-a-heart-hands-celebration-to-taylor-swift-after-td-005620416.html",
        "title": "Did Travis Kelce give a heart hands celebration to Taylor Swift after TD?",
        "description": "Kansas City Chiefs tight end Travis Kelce scored a touchdown, which was news in itself. He hadn&#39;t scored since Nov. 20. Then he made the internet go crazy. After scoring, Kelce seemed to blow a kiss to the suite level of the Buffalo Bills&#39; stadium, then ..."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/concern-and-best-wishes-meghan-markle-and-prince-harry-finally-reach-out-after-king-charles-and-princess-kates-health-scares/news-story/c494b61e5834ad02e56d15e47839eb16",
        "title": "<b>Meghan</b> and Harry finally reach out after Charles and Kate’s health scares",
        "description": "A British newspaper has confirmed Prince Harry and Meghan Markle have reached out to King Charles and Princess Catherine as both royals battle health conditions."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/prince-harry-and-meghan-send-well-wishes-to-king-charles-princess-kate/",
        "title": "Prince Harry and <b>Meghan</b> send ‘well wishes’ to King Charles",
        "description": "Prince Harry and his wife <b>Meghan Markle</b> have reportedly sent “get well messages” to both Princess Kate and King Charles amid their respective health concerns. According to The Mirror, an insider close Prince Harry and <b>Meghan Markle</b> notes that ..."
    },
    {
        "url": "https://www.prestigeonline.com/id/style/fashion/most-expensive-celebrity-wedding-dresses-priyanka-chopra-kim-kardashian-kate-meghan/",
        "title": "Most Expensive Celebrity Wedding Dresses That Have Graced The Aisle",
        "description": "The royal wedding of the Duke and Duchess of Sussex broke traditions and created a new tone, as symbolised by <b>Meghan Markle</b>‘s bridal gown. <b>Meghan</b>’s Givenchy gown, designed by famous British designer Clare Waight Keller, dominated the ceremony and had a ..."
    },
    {
        "url": "https://people.com/sarah-ferguson-diagnosed-with-skin-cancer-8546883",
        "title": "Sarah Ferguson Reveals Skin Cancer Diagnosis Weeks After Announcing That She &#39;Beat&#39; Breast Cancer",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! Fergie’s eldest daughter, Princess Beatrice, has a connection to her mom&#39;s latest cancer diagnosis ..."
    },
    {
        "url": "https://www.ilmessaggero.it/en/harry_and_meghan_markle_send_get_well_message_to_kate_middleton_and_king_charles-7885853.html",
        "title": "Harry and <b>Meghan Markle</b> send get well message to Kate Middleton and King Charles",
        "description": "Signs of thaw in the royal house? Harry and <b>Meghan Markle</b> have decided to send a get well soon message to Kate Middleton and King Charles. This move comes following news about the health conditions of the sovereign and William&#39;s wife, which have raised ..."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/21/65ad4319ca4741f3088b45bd.html",
        "title": "Prince Harry and <b>Meghan</b> have the best response to King Charles and Kate Middleton&#39;s health problems",
        "description": "Prince Harry and Meghan Markle have reportedly extended their best wishes to King Charles and Kate Middleton as both recover from health issues. Buckingham Palace had previously"
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2940179/meghan-markle-absence-prince-harry-ceremony-kids/",
        "title": "<b>Meghan Markle</b> Reportedly Didn’t Go to Prince Harry’s Awards Ceremony for One Parenting Reason",
        "description": "Insiders told People that the reason Meghan didn’t go to the event was to take care of her and Harry’s kids, specifically to take care of one of them who is ill right now. It’s unclear which one of their kids is the one sick right now,"
    },
    {
        "url": "https://www.yahoo.com/entertainment/harry-meghan-sent-best-wishes-160015740.html",
        "title": "Harry &amp; <b>Meghan</b> Sent Their ‘Best Wishes’ To King Charles And Kate Middleton Amid Health Scare",
        "description": "Despite the ongoing Royal feud, Prince Harry and Meghan Markle have reportedly sent their get-well wishes to King Charles III and Kate Middleton amid their health issues. It comes after multiple shocking revelations from two high-profile memoir books,"
    },
    {
        "url": "https://theindependent.sg/prince-harry-and-meghan-markle-adopts-ellen-degeneres-chicken/",
        "title": "Prince Harry and <b>Meghan Markle</b> adopts Ellen DeGeneres’ chicken",
        "description": "The post Prince Harry and Meghan Markle adopts Ellen DeGeneres’ chicken appeared first on The Independent News."
    },
    {
        "url": "https://pagesix.com/2024/01/21/royal-family/prince-harry-meghan-markle-send-get-well-messages-to-kate-middleton-king-charles-amid-health-issues/",
        "title": "Prince Harry, <b>Meghan Markle</b> send ‘get well messages’ to Kate Middleton and King Charles amid health issues: report",
        "description": "A source close to the Duke and Duchess of Sussex told The Mirror that “the King and the Princess of Wales have received support from Prince Harry and Meghan regarding their health.”"
    },
    {
        "url": "https://www.thedailybeast.com/prince-harry-and-meghan-markle-give-support-to-kate-middleton-and-king-charles",
        "title": "Prince Harry and <b>Meghan Markle</b> Give ‘Support’ to Kate Middleton and King Charles",
        "description": "Harry and Meghan reportedly “contacted both parties in different ways to pass on their concern and best wishes.” Plus, Kate and William are now “100 percent family first.”"
    },
    {
        "url": "https://nypost.com/2024/01/21/entertainment/prince-harry-and-meghan-send-well-wishes-to-king-and-kate-middleton-amid-health-scares/",
        "title": "Prince Harry and <b>Meghan</b> send well wishes to King and Kate Middleton amid health scares",
        "description": "Harry and Meghan’s alleged olive branch comes months after Charles and Middleton were alleged to be the “racist royals” who expressed concern over Prince Archie’s skin"
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/royals-best-off-duty-looks-from-princess-dianas-athleisure-to-kate-middletons-comfy-casuals/",
        "title": "32 of the Royals&#39; best off-duty looks, from Princess Diana&#39;s athleisure to Kate Middleton&#39;s comfy casuals",
        "description": "The now Princess of Wales is a huge fan of powerful dressing, sporting a series of tailored pantsuits in a rainbow of colours. But back when she was just Kate from Berkshire, she&#39;d offer up a look very on-trend with her contemporaries, while watching Prince Harry and Prince William play in a charity polo match at the Beaufort Polo Club."
    },
    {
        "url": "https://www.newsweek.com/king-charles-love-prince-harry-book-1862066",
        "title": "King Charles Would &#39;Love to Have Harry Back&#39;",
        "description": "King Charles&#39; biographer says the monarch will mend his broken ties with Prince Harry—despite public broadsides."
    },
    {
        "url": "https://www.allvipp.com/royals/report-prince-harry-wouldn-t-have-married-meghan-if-princess-diana-were-alive-today",
        "title": "Report: Prince Harry Wouldn&#39;t Have Married <b>Meghan</b> &quot;If Princess Diana Were Alive Today&quot;",
        "description": "Since their wedding in 2018, <b>Meghan</b> and Harry have been an integral part of public talk. The couple have since quit their jobs as senior royals, relocated to the United States and have been releasing investigative interviews and even a biography on a ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/21/cellist-prince-harry-meghan-wedding-no-rule-britannia-proms/?utmsource=email",
        "title": "Don’t play Rule, Britannia at Proms, says Prince Harry and <b>Meghan</b> cellist",
        "description": "The cellist won the BBC Young Musician award in 2016 The cellist who performed at the wedding of the Duke and Duchess of Sussex has said Rule, Britannia! should be axed from the Last Night of the Proms. Sheku Kanneh-Mason, who became a household name at ..."
    },
    {
        "url": "https://www.skynews.com.au/opinion/meghan-markle-not-well-prepared-for-role-as-a-working-royal/video/68902935af2741fcee33135f57c53e5d",
        "title": "<b>Meghan Markle</b> not ‘well prepared’ for role as a working royal",
        "description": "Writer and broadcaster Esther Krakue says Prince Harry effectively “shoehorned” <b>Meghan Markle</b> into the institution of the Royal Family. Royal historian Hugo Vickers has claimed <b>Meghan Markle</b> had “no intention of pulling her weight” as a working royal."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1150042-meghan-markle-prince-harry-risk-walking-on-poisonous-path",
        "title": "<b>Meghan Markle</b>, Prince Harry risk walking on &#39;poisonous path&#39;",
        "description": "<b>Meghan Markle</b> and Prince Harry, who are reportedly planning to release a new tell-all memoir, have been urged to avoid a &#39;poisonous path&#39; amid their deepening rift with the royal family. As per MailOnline, Robert Hardman claimed in his new book that the ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163435/20240122/prince-harry-and-meghan-markle-extend-support-to-ailing-kate-middleton-and-king-charles-amid-health-concerns.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Extend Support to Ailing Kate Middleton and King Charles Amid Health Concerns",
        "description": "In a significant gesture that may hint at a thawing of tensions within the British Royal Family, Prince Harry and his wife <b>Meghan Markle</b> have reportedly reached out to express their concern for the health of Kate Middleton, the Princess of Wales ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1150023-prince-harry-meghan-markle-forced-to-stay-silent-over-lilibet-name-drama",
        "title": "Prince Harry, <b>Meghan Markle</b> forced to ‘stay silent’ over Lilibet name drama",
        "description": "Prince Harry and <b>Meghan Markle</b> found themselves in the middle of another drama after, this time relating to their second child, Princess Lilibet. Royal author Robert Hardman revealed in his new book that the Duke and Duchess of Sussex infuriated the late ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/times-the-royals-broke-protocol/",
        "title": "32 times the royals broke protocol, from Diana&#39;s &#39;revenge dress&#39; to touching gestures of compassion",
        "description": "<b>Meghan Markle</b> opened up about why her father-in-law, Charles, walked her down the aisle during her 2018 wedding to Prince Harry in the Netflix docuseries Harry &amp; <b>Meghan</b>. &quot;Harry&#39;s dad is very charming and I said to him, &quot;&#39;I&#39;ve lost my dad in this.&#39;"
    },
    {
        "url": "https://www.heraldsun.com.au/entertainment/celebrity-life/royals/princess-catherine-has-unwavering-commitment-to-return-to-royal-duties/news-story/89c10adb7e4e9f0ec702a27b330226d3",
        "title": "Princess Catherine has ‘unwavering commitment’ to return to royal duties",
        "description": "“The Duke and Duchess contacted both parties in different ways to pass on their concern and best wishes.” <b>Meghan Markle</b> and Prince Harry are believed to have offered their support to Princess Catherine and King Charles. Picture: Getty Images Princess ..."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-harry-heard-about-king-charles-health-battle-from-news-alert/news-story/8f2d3abe7d60f6993f826ea82b6a1fa9",
        "title": "Prince Harry heard about King Charles’ health battle from news alert",
        "description": "Buckingham Palace announced Charles’ diagnosis at 3:25pm. UK time on Wednesday, which was 7:25am in California, where the Duke resides with his wife <b>Meghan Markle</b>, and their two children. The Post has reached out to Harry’s reps and Buckingham Palace ..."
    },
    {
        "url": "https://7news.com.au/entertainment/royal-family/harry-and-meghan-respond-to-king-charles-and-catherine-princess-of-wales-hospitalisations--c-13309391",
        "title": "Harry and <b>Meghan</b> respond to King Charles and Catherine, Princess of Wales hospitalisations",
        "description": "Prince Harry and his wife <b>Meghan</b>, Duchess of Sussex have responded to the two health scares announced within the British royal family. Last week it was revealed Catherine, Princess of Wales underwent abdominal surgery while King Charles was set to have an ..."
    },
    {
        "url": "https://pagesix.com/2024/01/20/celebrity-news/jeff-bezos-fiancee-lauren-sanchez-gushes-over-aviation-legends-prince-harry-and-john-travolta/",
        "title": "Jeff Bezos’ fiancée Lauren Sánchez gushes over ‘aviation legends’ Prince Harry and John Travolta",
        "description": "When he graced the stage, sans wife <b>Meghan Markle</b>, the “Spare” author recalled a touching moment the “Saturday Night Fever” star shared with his late mother, Princess Diana. Harry reminisced over a time when Travolta danced with Diana at the White ..."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/prince-harry-reportedly-removed-vital-181121654.html",
        "title": "Prince Harry Was Reportedly Removed From This Vital Group of Royal Family Members",
        "description": "The Duke of Sussex, who’s been living in California for nearly four years with wife <b>Meghan Markle</b> and their two children — Prince Archie, 4, and Princess Lilibet, 2 — was recently removed from a vital group of royal family members. While he isn’t ..."
    },
    {
        "url": "https://sg.finance.yahoo.com/news/prince-harry-meghan-markle-reach-221517994.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Reach Out to King Charles and Princess Kate In an “Olive Branch” Gesture After Recent Health Scares",
        "description": "Well, how’s this for good news on a Saturday? The Mirror reports that, following news of health scares for both King Charles and the Princess of Wales, Prince Harry and <b>Meghan Markle</b> have reached out to send well-wishes. Charles will be hospitalized for ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-jokingly-references-iconic-174927189.html",
        "title": "Prince Harry Jokingly References an Iconic Moment Between Princess Diana and an A-List Actor as He Receives Award in Beverly Hills",
        "description": "It triggered a vast array of feelings.” For the event, Harry wore a classic black tux. He attended the event solo, as <b>Meghan Markle</b> stayed behind at home in Montecito after one of their kids unexpectedly “became unwell,” The Mirror reports."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/20/monarchy-royal-family-king-charles-kate-middleton-hospital/",
        "title": "How the Sussexes’ vanishing act exposed the weakness of the slimmed-down monarchy",
        "description": "With Kate and the King in hospital the Royal family could do with a helping hand and some stardust — but it won&#39;t be coming from California The fragile Firm: With no Prince Harry or <b>Meghan</b> to step in, the Royal family looks thinner than ever On Friday ..."
    },
    {
        "url": "https://au.yahoo.com/lifestyle/prince-harry-likely-found-father-162923783.html",
        "title": "Prince Harry Likely Found Out About His Father King Charles’ Health Scare the Same Way the Rest of Us Did",
        "description": "Harry and wife <b>Meghan Markle</b> have so far remained silent over the news regarding his father’s health scare and the health scare of his sister-in-law, the Princess of Wales, who underwent a planned abdominal surgery on January 16 and will remain in ..."
    }
]