[
    {
        "url": "https://uk.news.yahoo.com/better-call-saul-bob-odenkirk-221436229.html",
        "title": "“Better Call Saul”&#39;s Bob Odenkirk Learns He&#39;s Related to King Charles: &#39;That Is Crazy&#39;",
        "description": "The Better Call Saul star, 61, was shocked when he learned he&#39;s related to King Charles during an appearance on the hit PBS show Finding Your Roots, in which host Henry Louis Gates Jr. helps celebrities learn about their family history."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-urged-step-down-172940807.html",
        "title": "Prince Harry Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "African Parks issued a statement saying that an &quot;active, ongoing investigation&quot; into the claims was its &quot;highest priority&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860984/meghan-markle-windsor-suite-princess-kate",
        "title": "<b>Meghan Markle</b>&#39;s &#39;Windsor suite demand&#39; in bid to compete with Princess Kate",
        "description": "<b>Meghan Markle</b> has been accused of making &quot;demands&quot; to get better accommodation when living in the UK with Prince Harry. The Duchess of Sussex moved to the UK in November, 2017 after the Duke of Sussex proposed at their first home Nottingham Cottage."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-losing-31994145",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;losing support&#39; and desperate for deal amid latest row",
        "description": "Prince Harry and Meghan Markle stepped down as senior working royals in 2020 and relocated to the US for a new life and a glittering Hollywood career, but their plans have since seemingly crumbled"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25581881/meghan-markle-new-role-suits-spin-off/",
        "title": "<b>Meghan Markle</b> ‘offered role in Suits spinoff in biggest TV deal of the year’ – as co-star calls for her to join cast",
        "description": "A “DREAM role” in a Suits spinoff series has been offered to Meghan Markle, according to senior network execs. The Duchess, 42, could even see herself in the director’s seat on"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-made-dramatic-change-31993671.amp",
        "title": "<b>Meghan Markle</b> made a dramatic change to her face amid rumours of her Hollywood return",
        "description": "Meghan Markle seems to have embraced a new beauty regime and she looked incredible as she showed off her new look at the Bob Marley: One Love film premiere in Jamaica"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-warned-31992931",
        "title": "<b>Meghan Markle</b> and Prince Harry warned by police as £11.8 million mansion is targeted by thieves",
        "description": "Meghan Markle and Prince Harry have received a warning from local police after a home nearby was broken into, with a string of similar incidents in the area"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-stomach-surgery-king-charles-latest-b2486430.html",
        "title": "Royal news – live: King leaves hospital hours after Kate returns home from surgery",
        "description": "Kate, the Princess of Wales, has returned home from hospital after receiving abdominal surgery, Kensington Palace has said. Prince Harry and Meghan Markle shared a sweet moment during their surprise visit to Jamaica for the premiere of Bob Marley: One Love."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860890/meghan-markle-acting-roles-hollywood-suits-spin-off",
        "title": "<b>Meghan Markle</b> tipped to land &#39;blockbuster Hollywood roles&#39; if she makes this huge move",
        "description": "Meghan Markle could receive offers for several lucrative acting roles if she makes a major public appearance at a glittering awards ceremony, an expert claimed."
    },
    {
        "url": "https://www.hellomagazine.com/celebrities/512160/oprah-winfrey-at-70-look-back-personal-life-career-weight-loss/",
        "title": "Oprah at 70: her multi-billion-dollar empire, controversial weight loss, sex trafficking claims, and her &#39;spiritual partnership&#39;",
        "description": "Oprah doesn&#39;t keep her billions to herself. Over the years she has donated an estimated $400 million through her charities, the Oprah Winfrey Foundation, and the Oprah Winfrey Charitable Foundation, to organizations that &quot;serve children, families, and communities, with a specific focus on youth education&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middleton-grateful-well-wishes-140645732.html",
        "title": "Kate Middleton &#39;Grateful for Well Wishes&#39; as She Continues Recovery at Home Following Surgery",
        "description": "We can all learn from that.&quot; Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! Prince William is expected to postpone some engagements to be by his wife ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/journalist-claims-king-charles-iiis-health-issue-scares-prince-harry-1723055",
        "title": "Journalist Claims King Charles III&#39;s Health Issue &#39;Scares&#39; Prince Harry",
        "description": "It is understood that Prince Harry and Meghan Markle have already sent their respective well-wishes to both King Charles III and the Princess of Wales, privately. But as two of the working royals recover from their surgeries, the public waits to see if the Sussexes will return to the U.K. to personally pay them a visit."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25567296/subtle-change-meghan-markle-face/",
        "title": "Subtle change <b>Meghan Markle</b> has made to her face as she ‘plots career comeback’",
        "description": "NO matter where she goes or what she does, all eyes are always on Meghan Markle – and last week’s glitzy appearance at the premiere of Bob Marley film One Love was no exception. Prince"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13018011/Brittany-Mahomes-reveals-TV-legal-drama-Suits-starring-Meghan-Markle-inspired-completely-change-wardrobe-talk-visit.html",
        "title": "Brittany Mahomes reveals TV legal drama Suits starring <b>Meghan Markle</b> inspired her to &#39;completely change my wardrobe&#39; during talk show visit",
        "description": "And it has inspired me to completely change my wardrobe,&#39; the blonde beauty added. The TV legal drama Suits featured <b>Meghan Markle</b>, 42, as Rachel Zane for seven seasons from 2011 to 2018. Los Angeles native <b>Meghan</b> retired from acting upon marrying Prince ..."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-reportedly-landed-her-103300529.html",
        "title": "<b>Meghan Markle</b> Has Reportedly Landed Her &#39;Dream Role&#39; In A Spin-Off Series Of Suits",
        "description": "<b>Meghan Markle</b> has reportedly landed her &#39;dream&#39; TV role after being offered a place in a Suits spin-off series. It comes as NBCUniversal has apparently been given the go-ahead to start work on Suits: Los Angeles, and that episodes have already been written ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/kate-middleton-leaves-hospital-following-121042610.html",
        "title": "Kate Middleton Leaves Hospital Following Abdominal Surgery: &#39;She Is Making Good Progress&#39;",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! Just hours after Kensington Palace revealed the news about Princess Kate&#39;s surgery, Buckingham Palace ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-blocks-meghan-markles-31993669",
        "title": "Prince Harry &#39;blocks&#39; <b>Meghan Markle</b>&#39;s memoir as it would &#39;cause more angst with family&#39;",
        "description": "Prince Harry has seemingly warned his wife, <b>Meghan Markle</b>, against writing a tell-all memoir, according to sources. The Duchess of Sussex was ready to &#39;set the record straight&#39; about her time as part of the Firm, but Harry has &#39;put an end to her plans&#39; as he was worried about the repercussions, reports the Mirror."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-fears-over-meghans-31968913",
        "title": "Prince Harry&#39;s fears over <b>Meghan</b>&#39;s tell-all threat as she wants to &#39;set the record straight&#39;",
        "description": "<b>Meghan</b>, 42, was reportedly keen to “set the record straight” about the trials and tribulations of recent years, but our source claims that Harry, 39, has “put an end” to her plans, fearing they could damage his chances of a reconciliation with his ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-phone-hacking-mirror-group-b2486499.html",
        "title": "Prince Harry pursues 115 further phone hacking claims after Mirror victory",
        "description": "Harry and his wife <b>Meghan Markle</b> have since left the royal family and moved to California (Getty Images) The unlawful activity was concealed from parliament, shareholders and the public, as well as the board overseeing MGN. In a hearing on Monday ..."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/511964/alex-jones-cotton-traders-winter-fashion-edit/",
        "title": "Exclusive: Alex Jones shares her favourite fashion tips – and reveals the £36 knit she loves",
        "description": "The Welsh presenter has been at the helm of some major TV moments, including the wedding of Prince Harry and <b>Meghan Markle</b>, Eurovision, and Comic Relief. A semi-finalist on Strictly Come Dancing in 2011 and a busy mum-of-three, Alex has unveiled her latest ..."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fashion/jewellery-valentines-day-gifts-missoma-astrid-and-miyu-b1124905.html",
        "title": "12 of the best jewellery brands to gift this Valentine&#39;s Day",
        "description": "It would probably be quicker to say what celebrities haven’t worn Mejuri. Mejuri is regularly seen on Margot Robbie, Selena Gomez, <b>Meghan Markle</b>, Taylor Swift and many other ultra A listers, and before you ask - no, it’s not even expensive either ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-forced-31855517?int_source=nba",
        "title": "<b>Meghan Markle</b> and Prince Harry forced to send back £7m worth of gifts from fans",
        "description": "<b>Meghan Markle</b> and Prince Harry were forced to send back over £7m worth of gifts from fans after their luxurious wedding. The Sussexes tied the knot in May 2018 in a fairytale ceremony at St George’s Chapel at Windsor Castle which was attended by many A-list celebrities including Oprah Winfrey and David Beckham."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13020531/smartless-podcast-jason-bateman-arnett-sean-hayes-siriusxm-exclusive-rights.html",
        "title": "Will Arnett, Jason Bateman and Sean Hayes ink three-year $100 MILLION deal with Sirius XM for exclusive rights to ads on SmartLess podcast",
        "description": "But Spotify&#39;s multi-million-dollar deals with the likes of Harry and <b>Meghan</b>, Kim Kardashian and the Obamas have coincided with a huge net loss for the subscription streaming service. By far the biggest podcast deal Spotify has is with Joe Rogan ..."
    },
    {
        "url": "https://www.theroot.com/if-you-loved-meghan-markle-in-suits-here-are-more-tv-1851205968",
        "title": "If You Loved <b>Meghan Markle</b> in ‘Suits,’ Here Are More TV Favorites to Revisit With Strong Black Characters",
        "description": "As the excitement around the legal drama co-starring Markle builds, here are our suggestion for good TV with great Black characters."
    },
    {
        "url": "https://people.com/prince-harry-urged-step-down-african-parks-board-reports-abuse-rangers-8551205",
        "title": "Prince Harry Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "Prince Harry is being called to step down from the Board of Directors at African Parks Network amid claims that the organization&#39;s rangers raped, beat and tortured indigenous people in the Republic of the Congo."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-charity-promotion-rape-african-parks-1864758",
        "title": "Prince Harry&#39;s Charity Promotion Is Hugely Problematic",
        "description": "Inset top left: Eyaya Nivrel records a message about the abuse of the Baka tribespeople. This was sent to Harry and his wife, <b>Meghan Markle</b>, by Survival International. More Pool/Samir Hussein/WireImage However, by October, around four months later ..."
    },
    {
        "url": "https://her.ie/celeb/oprah-winfrey-70th-birthday-598913",
        "title": "Oprah’s life through the years as she turns 70",
        "description": "Broadcaster, Oprah Winfrey is marking quite the milestone as her 70th birthday lands today. The presenter has become a household name but we’ve taken a walk down memory lane to look at where it all began, how she became a world-famous presenter, and the personal successes she’s celebrated throughout her life."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markles-trip-155126050.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>&#39;s Trip to Jamaica Might Signal a New Hollywood Deal on the Horizon",
        "description": "Prince Harry and Meghan Markle’s surprise trip to Jamaica last week in support of the film, Bob Marley: One Love, has a lot of people talking. While the British tabloids are busy trying to turn it into a scandal like they always do,"
    },
    {
        "url": "https://www.rte.ie/lifestyle/fashion/2024/0129/1429237-meghan-markle-stuns-in-carolina-herrera-while-visiting-jamaica/",
        "title": "<b>Meghan Markle</b> stuns in Carolina Herrera while visiting Jamaica",
        "description": "<b>Meghan Markle</b> and Prince Harry were spotted at the premiere of Bob Marley: One Love at the Carib 5 Theatre in Jamaica. The Duke and Duchess of Sussex were pictured attending the event with CEO of Paramount Pictures and Nickelodeon Brian Robbins and fashion ..."
    },
    {
        "url": "https://www.firstpost.com/entertainment/harry-meghan-update-amid-king-chaarles-illness-duchess-of-sussex-returning-to-suits-13663512.html",
        "title": "Harry, <b>Meghan</b> Update: Amid King Charles&#39; illness is Duchess of Sussex returning to ‘Suits’?",
        "description": "<b>Meghan Markle</b> has been offered her “dream role” in television and she will be returning to legal drama Suits for a spin-off series. Not just acting, she will be directing too. <b>Meghan</b> has reportedly been offered to make her comeback by directing “at ..."
    },
    {
        "url": "https://people.com/meghan-markle-maxi-skirt-amazon-8550050",
        "title": "<b>Meghan Markle</b>’s Designer Skirt Looks Like This $36 Amazon One Shoppers Say Is ‘Very Flattering’",
        "description": "Meghan Markle wore a Carolina Herrera skirt while attending a premiere with Prince Harry, and this $36 option from Amazon is similar. It comes in 24 colors and sizes XS to 5X, and shoppers said it’s “very flattering” and “elegant."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-full-titles-princess-duchess-1864780",
        "title": "<b>Meghan Markle</b>&#39;s Full Titles: Is She A Princess?",
        "description": "By tradition, the couple&#39;s eldest son, Prince Archie, could have used his father&#39;s secondary title as his own. However, this was not followed and, at the time of his birth, Archie was known simply as &quot;Master Archie Harrison Mountbatten-Windsor.&quot;"
    },
    {
        "url": "https://www.goodto.com/entertainment/royal-news/meghan-markle-set-to-swap-the-school-run-for-learning-scripts-as-she-s-offered-dream-role-in-new-suits-spin-off-show",
        "title": "<b>Meghan Markle</b> set to swap the school run for learning scripts as she’s offered ‘dream role’ in new Suits spin-off show",
        "description": "Meghan Markle is reportedly considering making a huge change to family life as it&#39;s claimed she&#39;s been offered her &#39;dream role&#39; in a Suits spin-off show."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/taylor-swift-celebrated-travis-kelces-171815354.html",
        "title": "Taylor Swift Celebrated Travis Kelce&#39;s Championship Win With a Very &#39;00s Nail Trend",
        "description": "Now we&#39;re kind of wondering…are square nails officially back? It certainly seems so. <b>Meghan Markle</b>, the other people&#39;s princess, wore a square-shaped mani on her most recent public outing with Prince Harry. So now that actual royalty and pop royalty have ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/meghan-markle-offered-dream-role-in-suits-spinoff/news-story/425503ca22508b54c22146ff57dd1638",
        "title": "<b>Meghan Markle</b> ‘offered ‘dream role’ in Suits spin-off",
        "description": "Meghan Markle has been offered a “dream role” in a spin-off series of Suits, the show that sparked her rise to fame as a young actress before she married into royalty, it has been claimed."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152478-prince-harry-meghan-markle-jamaica-invite-was-kept-hidden",
        "title": "Prince Harry, <b>Meghan Markle</b> Jamaica ‘invite’ was kept ‘hidden’",
        "description": "Prince Harry and Meghan Markle shocked everyone when they appeared at the Bob Marley biopic premiere in Kingston, Jamaica last week.There were a lot of buzz surrounding their visit, with"
    },
    {
        "url": "https://www.2oceansvibe.com/2024/01/29/meghan-markle-reportedly-lands-dream-role-in-suits-spin-off-series/",
        "title": "<b>Meghan Markle</b> Reportedly Lands Dream Role In ‘Suits’ Spin-Off Series",
        "description": "The new show will &quot;feature a female lead who bears an uncanny resemblance to Meghan&#39;s previous character Rachel.&quot; So Rachel 2.0."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/29/65b7cade22601da80d8b4580.html",
        "title": "Kate Middleton out of hospital after two weeks, Kensington Palace gives details on her condition",
        "description": "UK News. Abigail Spencer makes feelings clear on Suits co-star <b>Meghan Markle</b>: Everyone is aware of her Royal Family. Why did the Royal Family differ in response to King Charles and Kate Middleton&#39;s surgeries? As revealed by Kensington Palace, the future ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152486-meghan-markle-prince-harry-issued-warning-for-hollywood-survival",
        "title": "<b>Meghan Markle</b>, Prince Harry issued warning for Hollywood survival",
        "description": "Prince Harry and <b>Meghan Markle</b>, whose Hollywood ambitions are clear, have been given a crucial advice ahead of the 96th Academy Awards ceremony in Hollywood this year. The Duke and Duchess of Sussex, who are said to be struggling to win the Hollywood after ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163620/20240130/prince-harry-and-meghan-markles-hollywood-hustle-hits-hurdles-as-the-sussexes-losing-public-support.htm",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Hollywood Hustle Hits Hurdles as the Sussexes &#39;Losing Public Support&#39;",
        "description": "Prince Harry and <b>Meghan Markle</b>, the Duke and Duchess of Sussex, are reportedly in a scramble to secure new business ventures as their public support wanes amid ongoing royal controversies. Since their high-profile departure from senior royal duties in ..."
    },
    {
        "url": "https://www.arabtimesonline.com/news/markle-and-harry-get-advice-on-hollywood-make-or-break/",
        "title": "<b>Markle</b> and Harry get advice on Hollywood … ‘make or break’",
        "description": "LOS ANGELES, Jan 29: The Duke of Sussex, Prince Harry, and his wife <b>Meghan Markle</b> have recently been offered advice on their Hollywood career by entertainment expert Mark Boardman. Based in California, the royal couple has been urged to seize a high-stakes ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harrys-decision-archie-lilibet-continues-hurt-king-charles.html/",
        "title": "Prince Harry’s Decision About Archie and Lilibet That Continues to ‘Hurt’ King Charles",
        "description": "Not being able to see Prince Archie and Princess Lilibet, Prince Harry and <b>Meghan Markle</b>’s children, is a source of “hurt” for King Charles III. A royal commentator says the king’s “very keen” to see his 4-year-old and 2-year-old grandchildren ..."
    },
    {
        "url": "https://www.arabtimesonline.com/news/prince-william-concerned-about-kate-middletons-health-after-her-surgery/",
        "title": "Prince William concerned about Kate Middleton’s health after her surgery",
        "description": "The insider queried about Prince William’s response to <b>Meghan Markle</b> and Prince Harry’s unexpected trip to Jamaica, conveyed that the Prince of Wales is preoccupied with matters close to home, particularly Kate’s recuperation post-surgery."
    },
    {
        "url": "https://www.instyle.com/rothys-mary-jane-flats-review-8549881",
        "title": "I Walked 3+ Miles in These Cloud-Like Mary Janes From a <b>Meghan Markle</b>-Worn Brand",
        "description": "I’ll be the first to admit that I’m sometimes too quick to judge. I dismissed Hailey Bieber’s Rhode skincare because it just felt like another celebrity beauty line… only to learn my skin loves it. I adamantly opposed low-rise jeans until I found a ..."
    },
    {
        "url": "https://uk.style.yahoo.com/viral-tiktok-video-captures-prince-195006441.html",
        "title": "Viral TikTok Video Captures Prince Harry and <b>Meghan Markle</b>’s Off the Charts Chemistry While in Jamaica for the ‘Bob Marley: One Love’ Premiere",
        "description": "We’ve always known Prince Harry and <b>Meghan Markle</b>’s chemistry is off the charts—and the shine hasn’t dulled even the least bit after nearly six years of marriage. While on a surprise visit to Kingston, Jamaica to attend the premiere of the biopic ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wedding-bridesmaid-row-31882197?int_source=nba",
        "title": "<b>Meghan Markle</b>&#39;s tailor details real reason for tears in bridesmaid row",
        "description": "Many stories have surfaced about events which allegedly took place in the run-up to Prince Harry and <b>Meghan Markle</b>&#39;s wedding in 2018. Whether it is claims of blazing family rows, reports that the late Queen summoned Prince Harry for a dressing down, the many difficulties with <b>Meghan</b>&#39;s family or the future Duchess&#39; alleged dissatisfaction at many of the proposed plans, it was certainly a ..."
    }
]