[
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/harry-kingcharles-cancer-diagnosis-visit-b2492460.html",
        "title": "Inside Prince Harry’s 26-hour flying visit to see Charles that lasted less than an hour",
        "description": "The Duke of Sussex flew 11 hours from LA to see his father after his diagnosis for cancer - but the reunion was brief"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/07/prince-harry-king-mark-dyer-prince-william-royal-family/",
        "title": "How Harry’s ‘second dad’ could glue the Royal family back together",
        "description": "As Prince Harry flies home after visiting his sick father, observers believe only one man could help fix the feud that has ruptured the Firm"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/reason-royal-family-rift-could-32072008.amp",
        "title": "Reason Royal family rift could be healed - and it&#39;s because of <b>Meghan Markle</b>",
        "description": "Prince Harry travelled to the UK to see his father King Charles after he was diagnosed with cancer - and taking the trip alone might have saved his relationship with Charles"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-left-london-24-182100636.html",
        "title": "Prince Harry Left London 24 Hours After Arriving To See King Charles",
        "description": "Prince Harry has left London, just 24 hours after arriving yesterday to see his father, King Charles. The Duke of Sussex was pictured at Heathrow Airport this morning, arriving in the private Windsor Suite."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13056725/judge-judy-court-case-cast-suits-super-bowl-beauty-campaign.html",
        "title": "Judge Judy, 81, showcases her withering wit as she stars in hilarious new Super Bowl commercial for E.l.f. Cosmetics alongside <b>Meghan Markle</b>&#39;s former Suits co-stars",
        "description": "On February 11, e.l.f. Cosmetics will be heading to the courtroom during the game&#39;s famously fabulous commercials to promote its cult favorite product Halo Glow Liquid Filter."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13057693/ROBERT-JOBSON-meaning-gesture-Im-told-Harry-took-fly-Charles-left-kicking-heels-arrived.html",
        "title": "ROBERT JOBSON: It was a well meaning gesture. But I&#39;m told Harry &#39;took it upon himself&#39; to fly over... and Charles was left kicking his heels until he arrived",
        "description": "The reality is both more complex and more troubling - that Harry caused some disquiet by &#39;taking it upon himself&#39; to fly over unbidden."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1864299/meghan-markle-king-charles-wedding-day",
        "title": "<b>Meghan Markle</b>&#39;s unexpected four-word reply to King Charles&#39;s kind wedding day gesture",
        "description": "When Meghan Markle&#39;s dad Thomas announced he would not be attending her wedding to Prince Harry, the bride was left with nobody to walk her down the aisle - but her response to King Charles&#39;s offer was &quot;unexpected&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1864289/meghan-markle-prince-harry-engagement",
        "title": "<b>Meghan Markle</b> &#39;changed&#39; after Prince Harry engagement, expert says",
        "description": "A body language expert has claimed that Meghan Markle &quot;changed&quot; after getting engaged to Prince Harry and that there was &quot;one moment&quot; in the couple&#39;s Netflix documentary where he was &quot;embarrassed&quot; by her."
    },
    {
        "url": "https://uk.style.yahoo.com/kingsley-ben-adir-met-lovely-170000504.html",
        "title": "Kingsley Ben-Adir Met &#39;Lovely&#39; <b>Meghan Markle</b> and &#39;Funny&#39; Prince Harry at “Bob Marley: One Love” Premiere (Exclusive)",
        "description": "The Duke and Duchess of Sussex made a surprise appearance at the film&#39;s Jamaica premiere last month and had a drink with the star afterward"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harrys-sad-45-minute-9084682",
        "title": "Prince Harry on his way home to US after brief chat with King Charles",
        "description": "Prince Harry flew back to the US on Wednesday after a brief visit to the UK to see his father King Charles, who was diagnosed with cancer on Monday"
    },
    {
        "url": "https://www.thesun.ie/royals/12156598/william-harry-feud-sign-of-reconciliation-charles/",
        "title": "William’s snub shows Prince Harry feud is deep rooted – but there’s a ‘sign of future reconciliation’ with Charles",
        "description": "It must have been quite tense. Charles has been deeply hurt.&quot; Mrs Levin also branded <b>Meghan Markle</b> the &quot;controller&quot; of Harry&#39;s visits. &quot;Harry may come over quite a lot, don&#39;t forget <b>Meghan</b> is the controller of this, in her mind it might boost their ..."
    },
    {
        "url": "https://inews.co.uk/opinion/meghan-markle-made-right-call-charles-2894167",
        "title": "For once, <b>Meghan Markle</b> has made the right call",
        "description": "The King has certainly made mistakes, but he never seemed anything other than a loving father. He weathered public humiliation, the likes of which most of us are lucky enough to never experience, yet he performed his duty and succeeded in doing good and useful work that actually helped people."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-prince-harry-returns-la-32069350",
        "title": "Prince Harry flying home after just 25 hours in UK following 30 minute reunion with King",
        "description": "Prince Harry is flying back to wife Meghan Markle and their children in the US after meeting his father, King Charles, for less than an hour following the King&#39;s cancer diagnosis"
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/prince-harry-has-left-london-king-charles-cancer",
        "title": "Prince Harry has already left London after visiting King Charles",
        "description": "Prince Harry has already left London after arriving in the UK from California on Tuesday. The Duke of Sussex paid a true flying visit to his home country after learning that his father King Charles had been diagnosed with cancer."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/gb-news-slammed-after-journalist-32070007",
        "title": "GB News slammed after journalist claims Prince Harry contributed to King Charles&#39; cancer",
        "description": "GB News viewers were left outraged by one journalist’s suggestion that Prince Harry contributed to King Charles ’ cancer diagnosis. On Monday, Buckingham Palace released a statement announced that the King had been diagnosis with cancer and will undergo immediate treatment."
    },
    {
        "url": "https://www.hellomagazine.com/brides/512961/princess-anne-meghan-markle-more-divorcee-brides-wore-white-second-wedding-dresses/",
        "title": "Princess Anne, <b>Meghan Markle</b> and more divorcée brides&#39; decision to wear white second wedding dresses",
        "description": "The Princess Royal remarried ten years before the Church of England allowed it in 2002. After the late Queen Elizabeth II&#39;s daughter divorced her first husband Mark Phillips – with whom she shares children Peter and Zara – Anne wed Timothy Laurence at Crathie Kirk in Scotland."
    },
    {
        "url": "https://www.leicestermercury.co.uk/meghans-favourite-pasta-dish-made-9082932",
        "title": "<b>Meghan</b>&#39;s favourite pasta dish made with just three ingredients",
        "description": "Meghan Markle has said that one of her favourite recipes is so easy she could &#39;make it with her eyes closed&#39; and the three-ingredient pasta is something everyone can try at home. Before becoming a royal,"
    },
    {
        "url": "https://metro.co.uk/2024/02/07/prince-harrys-surrogate-father-help-mend-prince-william-rift-20238212/?ico=trending-post-strip_item_4",
        "title": "How Prince Harry’s ‘second dad’ could heal rift with Prince William",
        "description": "Could a well-loved confidante, close with both William and Harry, step in and help to resolve the brotherly dispute?"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/meghan-markle-encouraged-prince-harry-9084015",
        "title": "<b>Meghan Markle</b> &#39;encouraged Prince Harry to leave her and kids behind and return to UK&#39;",
        "description": "Prince Harry rushed back to the UK to be by his father King Charles&#39; side after he was diagnosed with cancer, but Meghan Markle stayed back in California with their two children"
    },
    {
        "url": "https://metro.co.uk/2024/02/07/prince-harry-flying-back-la-just-24-hours-king-charles-visit-20240015/?ico=trending-module_category_uk_item-5",
        "title": "Harry’s back at Heathrow 24 hours after landing to see dad",
        "description": "Prince Harry has been spotted at Heathrow airport 24 hours after landing yesterday. The Duke of Sussex landed around 1pm yesterday after flying 5,000 miles from Los Angeles to be by his father King Charles ’s side following his cancer diagnosis."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512949/why-meghan-markle-didnt-travel-to-uk/",
        "title": "Why <b>Meghan Markle</b> didn&#39;t travel to the UK with husband Prince Harry",
        "description": "Meghan Markle didn&#39;t travel with her husband Prince Harry to visit her father-in-law King Charles on Tuesday following his shock cancer diagnosis on Monday evening. Whilst some royal watchers may wonder why the Duchess chose to stay at home in Montecito, there are several reasons why Meghan chose to remain in the US following the family news."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/real-reason-meghan-markle-encouraged-32066828",
        "title": "Real reason <b>Meghan Markle</b> &#39;encouraged&#39; Prince Harry to travel alone to UK to see King Charles",
        "description": "Meghan Markle stayed in LA as her husband Prince Harry travelled back to the United Kingdom to visit his father King Charles, after it was announced that he had been diagnosed cancer. The former Suits actress remained at home in California with the couple&#39;s two children, Archie and Lilibet."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/king-charles-magic-moment-meghan-32066110.amp",
        "title": "King Charles&#39; magic moment with <b>Meghan Markle</b> goes viral after cancer diagnosis",
        "description": "The moment King Charles walked daughter-in-law <b>Meghan Markle</b> down the aisle at her wedding to Prince Harry has gone viral following the monarch&#39;s shocking diagnosis with cancer King Charles walking <b>Meghan Markle</b> down the aisle has gone viral The Duchess Of ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-stays-night-london-123612358.html",
        "title": "Prince Harry Stays the Night in London Hotel, Prince William Still Doesn&#39;t &quot;Trust&quot; Him",
        "description": "According to various reports, the Duke of Sussex spent Tuesday night in a London hotel, since he and <b>Meghan Markle</b> now need a &quot;formal invitation&quot; to stay in royal residences, according to the The Independent. Harry was granted a 45-minute meeting with the ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-charles-reunion-exclusive-32072331",
        "title": "Prince Harry warned ‘there’s no magic wand to sweep away pain’ as he takes ‘step towards reconciliation’ with Charles",
        "description": "While Harry reportedly jumped on a plane from the US, where he lives with wife <b>Meghan Markle</b>, just hours after receiving the news, former BBC Royal Correspondent Jennie Bond believes this speaks volumes when it comes to his current relationship with the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/prince-harry-flies-back-after-28587355",
        "title": "Prince Harry flies back to US after brief reunion with King Charles following cancer diagnosis",
        "description": "The Duke of Sussex flew solo for the trip, leaving his wife <b>Meghan Markle</b> and their two children at home in California. Harry spent around 30 minutes with his father on Tuesday, shortly after Buckingham Palace announced the King&#39;s unexpected health news."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/inside-king-charles-and-prince-harrys-30-minute-reunion-not-a-successful-visit-211539067.html",
        "title": "Inside King Charles and Prince Harry&#39;s 30-minute reunion: &#39;Not a successful visit&#39;",
        "description": "Charles and Harry only met up for 30 minutes despite flying almost 11 hours to see his father after his cancer diagnosis. Read more."
    },
    {
        "url": "https://www.ctvnews.ca/world/prince-william-thanks-public-for-messages-to-king-charles-and-kate-says-they-mean-a-great-deal-1.6760165",
        "title": "Prince William thanks public for messages to King Charles and Kate, says they mean &#39;a great deal&#39;",
        "description": "Prince William returned to royal duties Wednesday for the first time since his father, King Charles III, announced his cancer diagnosis and his wife, Kate, was hospitalized for abdominal surgery."
    },
    {
        "url": "https://people.com/prince-william-addresses-king-charles-cancer-kate-middleton-surgery-gala-speech-8563887",
        "title": "Prince William Admits Past Weeks Have Had &#39;Medical Focus,&#39; Thanks Fans (and Tom Cruise!) in Heartfelt Speech",
        "description": "Prince William expressed thanks to well-wishes amid King Charles&#39; cancer diagnosis and Kate Middleton&#39;s abdominal surgery during a speech at the London Air Ambulance gala."
    },
    {
        "url": "https://www.newstalkzb.co.nz/lifestyle/king-charles-cancer-prince-harry-returns-to-us-after-fleeting-uk-visit/",
        "title": "Prince Harry leaves UK after fleeting 24-hour trip",
        "description": "The Daily Telegraph has reported that the Duke of Sussex arrived back at Heathrow airport just 24 hours after arriving in the UK to return to California to be with his wife, <b>Meghan Markle</b>, and their two children, Prince Archie, 4 and Princess Lilibet ..."
    },
    {
        "url": "https://dailyhive.com/vancouver/prince-harry-meghan-markle-vancouver-visit-spots",
        "title": "Prince Harry and <b>Meghan Markle</b> are coming to Vancouver: Here&#39;s where they should go",
        "description": "Prince Harry and <b>Meghan Markle</b> will be back in beautiful BC soon, and while they’re here on business, we have some ideas for what attractions they should carve out some time for. According to People Magazine, the Duke and Duchess of Sussex will be ..."
    },
    {
        "url": "https://www.etonline.com/these-meghan-markles-le-specs-sunglasses-are-perfect-for-spring-break-shop-the-affordable-style",
        "title": "These <b>Meghan Markle</b>&#39;s Le Specs Sunglasses Are Perfect for Spring Break — Shop The Affordable Style",
        "description": "The affordable shades worn by the Duchess of Sussex sold out instantly, but they are available on Amazon for spring break"
    },
    {
        "url": "https://graziadaily.co.uk/celebrity/news/prince-harry-visits-charles-cancer/",
        "title": "Prince Harry Has Reunited With King Charles; What Next For Their ‘Very Broken’ Relationship?",
        "description": "After Prince Harry&#39;s reunion with King Charles, could this be the start of a family reconciliation? Read more on Grazia."
    },
    {
        "url": "https://www.independent.co.uk/news/prince-william-ap-charles-iii-kate-middleton-london-b2492146.html",
        "title": "Prince William returns to public duties at a time when the UK monarchy needs him more than ever",
        "description": "Prince William is returning to royal duties for the first time since his father King Charles III announced his cancer diagnosis and his wife Kate was hospitalized for abdominal surgery"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-william-returns-work/",
        "title": "William returns to royal work as Charles and Kate rest - but Prince of Wales won&#39;t meet Harry",
        "description": "Prince William has resumed royal duties as Princess Kate recovers from surgery and King Charles starts cancer treatment."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25773734/sky-news-viewers-cringe-blunder-king-charles-cancer-report/",
        "title": "Sky News viewers cringe as reporter makes string of ‘laughable’ royal blunders in live King Charles cancer report",
        "description": "SKY News viewers have been left cringing after a reporter made a string of ‘laughable’ blunders about King Charles. Buckingham Palace announced on Monday that doctors had discovered"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-leaves-u-k-151431231.html",
        "title": "Prince Harry Leaves U.K. 24 Hours After Seeing Dad King Charles But Not Prince William",
        "description": "A royal source said there were &quot;no plans&quot; for Prince Harry and Prince William to get together during the brief trip"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-leaves-u-k-175714017.html",
        "title": "Prince Harry Leaves U.K. After 24-Hour Return to Support King Charles",
        "description": "Prince Harry is already heading home to California after a whirlwind 24-hour return to the U.K. that came after this week’s shocking revelation of King Charles III’s cancer diagnosis. The royal was spotted returning to Heathrow Airport on Wednesday afternoon,"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-hasnt-visited-king-32064916",
        "title": "&#39;<b>Meghan Markle</b> hasn&#39;t visited King with Prince Harry for one reason&#39; says former royal butler",
        "description": "Meghan Markle stayed in the US with the couple&#39;s two children, Archie and Lilibet, while Prince Harry traveled to the UK to be with his father, King Charles, after cancer diagnosis"
    },
    {
        "url": "https://uk.news.yahoo.com/legal-worlds-collide-suits-cast-130000334.html",
        "title": "Legal Worlds Collide When the “Suits” Cast Meets Judge Judy in e.l.f. Cosmetics&#39; Super Bowl Spot (Exclusive)",
        "description": "Gina Torres, Rick Hoffman and Sarah Rafferty talk to PEOPLE about working with the legal icon, their group texts and where their characters are now"
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/3/",
        "title": "Prince Harry updates — Duke visits King Charles without <b>Meghan</b> after cancer diagnosis but William has ‘no plans’ to meet",
        "description": "KING Charles has been diagnosed with cancer, Buckingham Palace announced in a statement on Monday. The King, 75, has started treatment and was advised by doctors to cancel front line duties. It"
    },
    {
        "url": "https://metro.co.uk/2024/02/07/gb-news-star-blasted-suggesting-harry-contributed-kings-cancer-20236592/?ico=trending-module_tag_instagram-stories_item-3",
        "title": "GB News guest blasted for suggesting Harry and <b>Meghan</b> ‘contributed to King’s cancer’",
        "description": "Buckingham Palace announced on Monday that the monarch, 75, had been diagnosed with cancer during his recent surgery for benign prostate enlargement, but confirmed it was not prostate cancer. In the hours that have followed,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-didnt-visit-king-32064522.amp",
        "title": "<b>Meghan Markle</b> didn&#39;t visit King Charles as it&#39;s &#39;something Harry must do alone&#39;",
        "description": "King Charles&#39; former butler speaks out on why he thinks that Prince Harry traveled to the UK without Meghan Markle after his father&#39;s cancer diagnosis was made public"
    },
    {
        "url": "https://www.politico.eu/article/king-charles-iii-caner-how-to-drop-a-royal-bombshell/",
        "title": "How to drop a royal bombshell",
        "description": "While there is a decades-long tradition of U.S. presidents publicly disclosing the state of their health to the nation, with the White House routinely publishing a very detailed summary of regular physical examinations, Britain’s (unelected) head of state has traditionally been more circumspect."
    },
    {
        "url": "https://www.lbc.co.uk/news/king-charles-delayed-helicopter-catchup-prince-harry/",
        "title": "King Charles delayed helicopter to Sandringham for ‘warm’ 45-minute catch-up with Harry after cancer diagnosis",
        "description": "King Charles delayed his helicopter which was headed for Sandringham in order to catch up with his son, Prince Harry."
    },
    {
        "url": "https://inews.co.uk/news/royal-family-tree-king-charles-2893211?ico=more_from_this_author",
        "title": "Royal family tree: King Charles’s children, siblings and grandchildren explained",
        "description": "Their eldest son is William, Prince of Wales, 41, who is married to Kate Middleton. The youngest is Harry, Duke of Sussex, 39, who is married to <b>Meghan Markle</b>. Harry’s decision to step down as a senior royal in 2020 marked the beginning of a major rift ..."
    }
]