[
    {
        "url": "https://www.express.co.uk/news/royal/1857308/meghan-markle-suits-acting-role-prince-harry",
        "title": "<b>Meghan Markle</b> poised for major return to acting as Suit&#39;s creator announces spin-off show",
        "description": "<b>Meghan Markle</b> could soon grace the TV screen once again as she is tipped to take on a new role in a spin-off of the legal drama Suits. The cast of the defunct USA Network show sparked speculation about an impending return after they unexpectedly reunited ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12979805/meghan-markle-return-acting-suits-spin-off.html",
        "title": "Is <b>Meghan Markle</b> set for a RETURN to acting? Suits creator&#39;s new LA-based legal drama features character who appears to be tailor-made for Duchess of Sussex - sparking ...",
        "description": "Suits creator Aaron Korsh has scripted a new show about a Hollywood law firm and created a character, Erica, who appears tailor-made to be played by Meghan. She was Rachel Zane in the original show."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-william-visited-kate-middleton-173451359.html",
        "title": "Prince William Visited Kate Middleton in the Hospital After Her Surprise Surgery",
        "description": "Prince William is stepping up to the plate as a supportive husband after it was announced that Kate Middleton was hospitalized following an abdominal surgery. The royal was spotted leaving the private hospital on Thursday — in an Audi e-Tron GT Carbon Vorsprung,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857227/mehan-markle-prince-harry-overshadowed-zara-mike-tindall",
        "title": "<b>Meghan Markle</b> and Prince Harry &#39;risk being overshadowed&#39; by Zara and Mike Tindall",
        "description": "Meghan Markle and Prince Harry have experienced considerable ups and downs with their popularity since they stepped back from their institutional roles."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-copyrighted-lilibets-name-31900517",
        "title": "<b>Meghan Markle</b> &#39;copyrighted&#39; Lilibet&#39;s name &#39;before giving birth&#39;, claims expert",
        "description": "The Sussexes&#39; named their daughter Lilibet after the Queen&#39;s childhood nickname which is said to have left the late monarch &#39;furious&#39; as they didn&#39;t ask for her permission, according to claims made in a new royal book."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/things-meghan-harry-been-snubbed-31910516",
        "title": "All the things <b>Meghan</b> and Harry have been snubbed from as they face make or break year",
        "description": "Prince Harry and <b>Meghan Markle</b> have been snubbed a few times since leaving the Royal Family. Despite being uninvited and snubbed from events and by their friends, the couple are said to be facing their &quot;make or break&quot; year this year. They&#39;re reportedly ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12977671/slimmed-monarchy-princess-anne-warning-proved-right.html",
        "title": "Can a slimmed down monarchy cope now THREE working royals are out of action? Princess Anne&#39;s warning has been &#39;proved right&#39;, royal experts say - and it shows how much Harry&#39;s ...",
        "description": "The Princess of Wales is in hospital after an abdominal operation, Prince William has taken time off to care for his family and King Charles has revealed he needs a procedure on his enlarged prostate."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-copyright-lilbet-name-31909336",
        "title": "<b>Meghan Markle</b> &#39;copyrighted the name of daughter Lilibet before birth&#39; says royal expert",
        "description": "Meghan Markle allegedly copyrighted the name Lilibet before she and Prince Harry welcomed their daughter in 2021, claims royal expert Angela Levin, who branded it &#39;disrespectful&#39;"
    },
    {
        "url": "https://www.thesun.ie/royals/12020158/princess-lilibet-inherit-gift-meghan-markle-princess-diana/",
        "title": "Princess Lilibet, two, set to inherit £980,000 gift from <b>Meghan Markle</b> &amp; there’s a nod to Princess Diana",
        "description": "SHE’S only two, but Princess Lilibet is set to receive a staggering £980,000 worth of jewellery from mum Meghan Markle in years to come. The Duchess of Sussex, 42, has an impressive collection of"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/seven-harry-meghan-bombshells-new-31908763",
        "title": "Seven Harry and <b>Meghan</b> bombshells from new tell-all book from name row to secret meetings",
        "description": "As an explosive new royal tell-all makes its way to shop shelves, we break down the seven shocking bombshells revealed about Prince Harry and Meghan Markle in the book"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511491/prince-william-and-kates-unknown-kind-gesture-to-prince-harry-and-meghan-markle-after-queens-death-revealed/",
        "title": "Prince William and Kate&#39;s unknown kind gesture to Prince Harry and <b>Meghan</b> after Queen&#39;s death revealed",
        "description": "Over the past couple of years, there has been much attention on Prince William and Prince Harry &#39;s strained relationship. The fractured ties were closely monitored during the period of mourning after Queen Elizabeth&#39;s death in September 2022 when the Waleses and Sussexes came together."
    },
    {
        "url": "https://metro.co.uk/2024/01/17/south-park-episodes-banned-offensive-20132239/?ico=trending-module_tag_us-tv-news_item-2",
        "title": "All the South Park episodes banned for being too ‘offensive’",
        "description": "South Park is no stranger to controvery and lampooning the rich and famous, having ‘ruined’ Ed Sheeran’s life and ‘annoyed and overwhelmed’ <b>Meghan Markle</b>. The cartoon’s 299th episode, named Band in China, featured storylines so critical of ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/17/south-park-episodes-banned-offensive-20132239/?ico=trending-module_category_tv_item-4",
        "title": "The South Park episode banned for being too dangerous for kids",
        "description": "South Park is no stranger to controvery and lampooning the rich and famous, having ‘ruined’ Ed Sheeran’s life and ‘annoyed and overwhelmed’ <b>Meghan Markle</b>. The cartoon’s 299th episode, named Band in China, featured storylines so critical of ..."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/stoke-trent-link-famous-princess-9041662",
        "title": "The Stoke-on-Trent link to famous Princess Diana scenes in Netflix&#39;s The Crown",
        "description": "In another scene, she is seen in a pink costume gazing out to sea. Seventy-one-year-old John, whose main home is a mansion near Eccleshall where <b>Meghan Markle</b> previously stayed the night, told Forbes: “I&#39;ve watched every bit of it [The Crown]."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-one-word-reply-31893225?int_source=nba",
        "title": "<b>Meghan Markle</b>&#39;s one-word reply after Prince William&#39;s reaction to Oprah Winfrey chat",
        "description": "<b>Meghan Markle</b> had a one word response for Prince William&#39;s reaction to her and Prince Harry&#39;s bombshell interview with Oprah Winfrey. The Duchess of Sussex simply replied &#39;wow&#39; after her husband showed her a text message from his elder brother in the wake of their controversial tell-all interview with the iconic US chat show host in 2021."
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to Prince Andrew",
        "description": "Despite suggestions from the King for him to shift into Prince Harry and <b>Meghan Markle</b> &#39;s more modest four-bedroom Frogmore Cottage on the Windsor estate, Andrew&#39;s friends affirm that the Royal is not intending to consider alternate accommodation options."
    },
    {
        "url": "https://www.aol.com/entertainment/boris-johnson-didn-t-tell-174804485.html",
        "title": "Boris Johnson Didn’t Tell Queen Elizabeth II That His Dog Killed Her Swan",
        "description": "Boris Johnson learned the hard way that Queen Elizabeth II would notice if one of her beloved swans went missing. Amid the COVID-19 pandemic, Elizabeth was “characteristically thoughtful” when she let the former Prime Minister,"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/royal-author-reveals-coded-message-from-prince-harry-that-wounded-prince-william/news-story/9d07cb763033b961feab5fb023261488",
        "title": "Royal author reveals coded message from Prince Harry that ‘wounded’ Prince William",
        "description": "Prince Harry’s estranged relationship with Prince William was dealt a punishing blow in the Netflix miniseries “Harry &amp; Meghan.”"
    },
    {
        "url": "https://nypost.com/2024/01/18/business/spotify-has-600m-users-but-struggles-to-turn-a-profit/",
        "title": "Spotify has 600 million users, but struggles to consistently turn a profit",
        "description": "Though Spotify has a footprint more than twice that of its next-largest competitor, Apple Music, the leading audio-streaming company reported a net loss in 2022."
    },
    {
        "url": "https://www.psychologytoday.com/za/blog/the-psychology-of-relationships/202401/the-power-couple-paradox",
        "title": "The Power Couple Paradox",
        "description": "Power couples are partnerships between highly successful, respected, or influential individuals. Power couple traits often overlap with narcissistic traits, leading to potentially toxic relationships. Competitiveness within power couples can create conflict over attention, leading to animosity."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1149062-prince-harry-barred-contact-from-palace-amid-ailing-kate-middleton-king-charles",
        "title": "Prince Harry barred contact from Palace amid ailing Kate Middleton, King Charles",
        "description": "Prince Harry is reportedly eager to visit the royal family after the Palace laid bare current health conditions of King Charles and Kate Middleton.An official statement from Kensington"
    },
    {
        "url": "https://www.yahoo.com/entertainment/suits-spin-off-lead-character-162520800.html",
        "title": "Suits Spin-off Lead Character Description Unveiled",
        "description": "The first character and plot details for NBCUniversal’s upcoming Suits spin-off have finally been revealed after over three months since the project was announced. According to Puck’s Matthew Belloni,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163363/20240118/prince-harry-comments-on-royal-marriages-stir-controversy-prince-william-wounded-by-brothers-disclosure.htm",
        "title": "Prince Harry&#39;s Comments on Royal Marriages Stir Controversy, Prince William &#39;Wounded&#39; by Brother&#39;s Disclosure",
        "description": "Prince Harry in the Netflix miniseries &quot;Harry &amp; Meghan&quot; have added fuel to the fire of his strained relationship with his brother, Prince William. Royal author Robert Hardman, in his new book &quot;The Making of a King: King Charles III and the Modern Monarchy,"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-could-inherit-980000-worth-of-jewellery-from-meghan-and-princess-diana_art20822.html",
        "title": "Princess Lilibet could inherit £980,000 worth of jewellery from <b>Meghan</b> and Princess Diana",
        "description": "Princess Lilibet is expected to be the owner of some of history’s most impressive jewellery pieces. From Meghan Markle’s collection to Princess Diana’s, here’s what she could"
    },
    {
        "url": "https://www.aol.com/entertainment/prince-william-thought-harrys-blatant-160244421.html",
        "title": "Prince William Thought Harry&#39;s &#39;Blatant Attack&#39; on Kate Was New Low: Book",
        "description": "Prince William and brother Prince Harry’s estranged relationship may have reached a point of no return after one specific line in Netflix’s Harry &amp; Meghan was taken to be about William’s wife, Princess Kate Middleton."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/top-10-netflix-crime-documentaries-to-add-to-your-watchlist-amid-release-of-american-nightmare-1272238",
        "title": "Top 10 Netflix Crime Documentaries To Add To Your Watchlist Amid Release Of American Nightmare",
        "description": "Netflix consistently delivers exceptional crime documentaries, ensuring viewers stay on the straight and narrow. Here are the top 10 Netflix Crime Documentaries to add to your watchlist."
    },
    {
        "url": "https://www.allvipp.com/royals/yikes!-these-celebrities-have-slammed-harry-and-meghan",
        "title": "Yikes! These Celebrities Have Slammed Harry And <b>Meghan</b>",
        "description": "Prince Harry and Meghan Markle have been without a doubt one of the most controversial couples in recent years. Find out which stars have publicly slammed the couple."
    },
    {
        "url": "https://pagesix.com/2024/01/18/royal-family/royal-expert-explains-controversy-of-princess-lilibets-name/",
        "title": "Royal expert explains real controversy over Harry and <b>Meghan</b> naming daughter Lilibet",
        "description": "Her ringing endorsement was not sought, not given, and you don’t put words in the queen’s mouth,” author Robert Handman told The Post."
    },
    {
        "url": "https://www.skynews.com.au/opinion/sharri-markson/prince-harry-and-meghan-cause-a-stir-in-naming-daughter-lilibet/video/6450da0bda961b9ed2aee3b888fa72b3",
        "title": "Prince Harry and <b>Meghan</b> cause a stir in naming daughter Lilibet",
        "description": "Daily Mirror Royal Editor Russel Myers says Prince Harry and Meghan Markle have caused a stir again by naming their daughter Lilibet. Ms Levin&#39;s comments come as a new book called Charles III: New King, New Court, The Inside Story, written by Robert Hardman, alleges that the Queen was &quot;furious&quot; after Meghan and Harry used her private nickname."
    },
    {
        "url": "https://www.startribune.com/kstp-tv-joe-schmit-transforms-joe-mauer-into-children-book-hero/600336573/",
        "title": "KSTP-TV&#39;s Joe Schmit transforms Joe Mauer into children&#39;s book hero",
        "description": "Wise Ink Media, which is based in Minneapolis, convinced him that it was fertile ground for a children&#39;s book, making Schmit the latest celebrity to contribute to the red-hot genre. He joins the likes of Kevin Hart, Dolly Parton, Jimmy Fallon, Cynthia Erivo and Meghan Markle."
    },
    {
        "url": "https://www.skynews.com.au/opinion/sharri-markson/prince-harry-and-meghan-markle-cant-do-anything-right/video/1c1fdc2e30a0dc7c40b7d53a6d812f07",
        "title": "Prince Harry and <b>Meghan Markle</b> can’t do ‘anything right’",
        "description": "Daily Mirror Royal Editor Russel Myers says Prince Harry and Meghan Markle can&#39;t really do anything right by the royal family. Mr Myers&#39;s remarks come after it was revealed in the Daily Mail about a new royal biography, the late Queen told aides Prince Harry and Meghan Markle had “taken” the only thing she owned, the name Lilibet."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-award-palace-aides-laugh-cry-book-1861778",
        "title": "Why Harry and <b>Meghan</b> Award Made Palace Aides Laugh, Cry",
        "description": "The Duke and Duchess of Sussex were named as recipients of a &quot;Ripple of Hope Award&quot; from the Robert F. Kennedy Human Rights Foundation in December 2022, accepting the honor &quot;in recognition of their work on racial justice, mental health, and other social impact initiatives.&quot;"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/king-charles-didnt-invite-prince-harry-dinner-prince-william-day-queen-elizabeth-died-for-1-reason-according-biography.html/",
        "title": "King Charles Didn’t Invite Prince Harry to Dinner With Him and Prince William the Day Queen Elizabeth Died for 1 Reason, According to Biography",
        "description": "King Charles and Prince William had dinner together on the Balmoral estate the day Queen Elizabeth died while Prince Harry dined elsewhere."
    },
    {
        "url": "https://www.iol.co.za/sunday-tribune/lifestyle/these-were-the-most-googled-celebrity-weddings-in-2023-fd150ab1-1756-4474-a357-11619fb624cc",
        "title": "These were the most googled celebrity weddings in 2023",
        "description": "In order to conduct the research, experts at Chapel of the Flowers analysed a list of more than 100 of the most influential married stars from 1923 to 2023."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1149033-princess-lilibets-life-forever-marred-by-shadow-of-doubt-over-late-queens-fury",
        "title": "Princess Lilibet’s life forever marred by ‘shadow of doubt’ over late Queen’s fury",
        "description": "Prince Harry and Meghan Markle’s daughter Princess Lilibet is caught in the ugly rift between the couple and the royal family. In the latest episode of Royal Report podcast,"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/why-did-albanias-crown-prince-leka-ii-announce-divorce-from-crown-princess-elia-after-7-years-of-marriage-1272258",
        "title": "Why Did Albania&#39;s Crown Prince Leka II Announce Divorce From Crown Princess Elia After 7 Years Of Marriage?",
        "description": "Albania&#39;s Crown Prince Leka II and Crown Princess Elia announced their decision to divorce after 7 years of marriage. The couple emphasized commitment to ensuring a happy life for their daughter"
    },
    {
        "url": "https://www.sapeople.com/celeb-news/princess-kate-has-been-hospitalised-heres-what-we-know/",
        "title": "Princess Kate has been hospitalised – here’s what we know",
        "description": "Princess Kate has been hospitalised following a planned abdominal surgery and will only continue public duties after Easter."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25400041/princess-kate-health-operation-rest-william/",
        "title": "Royals rocked by Princess Kate health shock as she faces 3 months rest &amp; William cuts back duties to care for children",
        "description": "CARING Prince William was at the Princess of Wales’s bedside before and after yesterday’s surgery on her abdomen. Kate, 42, will now remain at the London Clinic for up to two weeks and is unlikely"
    },
    {
        "url": "https://www.firstpost.com/entertainment/king-charles-iii-will-have-a-prostate-operation-next-week-while-kate-middleton-recovers-from-abdominal-surgery-13626922.html",
        "title": "King Charles III will have a prostate operation next week while Kate Middleton recovers from abdominal surgery",
        "description": "After Prince Harry and Meghan’s stormy departure to California in 2020, the Prince and Princess of Wales have solidified their position as being among the most popular members of the royal family."
    },
    {
        "url": "https://people.com/prince-harry-hits-gym-day-before-kate-middleton-king-charles-announcements-8431027",
        "title": "Prince Harry Hits the Gym in Santa Barbara the Day Before Kate Middleton and King Charles&#39; Surgery News",
        "description": "Prince Harry, the Duke of Sussex, was seen leaving a gym in Santa Barbara, California, the day before the palace issued statements about Kate Middleton&#39;s successful abdominal surgery and King Charles&#39; upcoming procedure for an enlarged prostate."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/king-charles-urged-respond-more-vigorously-adopt-aggressive-tactic-silence-prince-harry-meghan.html/",
        "title": "King Charles Urged to Respond More ‘Vigorously’ and Adopt an ‘Aggressive’ Tactic to ‘Silence Prince Harry and <b>Meghan</b>’",
        "description": "Here&#39;s why King Charles is being urged to get more &quot;aggressive&quot; with how the family responds to what Meghan and Harry say about them."
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2938211/meghan-harry-royal-baby-name-controversy/",
        "title": "<b>Meghan Markle</b> &amp; Prince Harry Are Reportedly ‘Shocked’ Over the Controversy Surrounding Daughter Lilibet’s Name",
        "description": "Despite people thinking everything was fine when Meghan Markle and Prince Harry named their daughter Lilibet Diana, one author claims Queen Elizabeth II was furious over the name. In Robert Hardman’s book The Making of a King: King Charles III and the Modern Monarchy,"
    },
    {
        "url": "https://nypost.com/2024/01/17/opinion/ailing-charles-and-kates-first-thought-was-for-others-wailing-meghan-and-harrys-only-thought-is-for-themselves/",
        "title": "Ailing Charles and Kate’s first thought was for others — wailing <b>Meghan</b> and Harry’s only thought is for themselves",
        "description": "If ever there was a day to reflect on the stark difference between the Royal Family in Britain, and the renegade Sussexes in California, this was it."
    },
    {
        "url": "https://www.yahoo.com/entertainment/harry-meghan-did-permission-queen-211731386.html",
        "title": "Harry &amp; <b>Meghan</b> DID Get Permission To Use Queen Elizabeth II Name For Daughter",
        "description": "Duke and Duchess of Sussex, Prince Harry and <b>Meghan Markle</b>, DID get permission from the late Queen Elizabeth II to name their daughter her childhood nickname &quot;Lilibet.&quot; As we reported, it was earlier claimed that the couple lied when they revealed that the ..."
    }
]