[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-plays-up-nfl-32110759",
        "title": "Prince Harry plays up NFL connection in his and <b>Meghan Markle</b>&#39;s new Sussex.com site",
        "description": "Harry and Meghan&#39;s new website has quite a number of changes. For instance, the site used to be titled SussexRoyal.com. The Duke and Duchess of Sussex likely dropped &quot;royal&quot; from their URL after agreeing to no longer use the word. The agreement came after they resigned from their position in the Royal Family in 2020."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markles-romantic-valentines-day-28620049",
        "title": "<b>Meghan Markle</b>&#39;s romantic Valentine&#39;s Day plans with Prince Harry in Canada",
        "description": "Meghan Markle once revealed her dream Valentine&#39;s Day would be spent in Paris, but this year she will be celebrating the romantic day in Canada with Prince Harry"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-quietly-202224051.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Quietly Launch New Sussex.com Website",
        "description": "Meghan Markle and Prince Harry just got an online makeover. The Duke and Duchess of Sussex quietly launched a new website, Sussex.com, on Monday. The web address encompasses the latest news about the couple, bios for Prince Harry, 39, and Meghan, 42, as well as links to their Archewell Foundation organization and Archewell Productions hub."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865961/prince-harry-meghan-markle-new-website-latest",
        "title": "Prince Harry and <b>Meghan Markle</b> rebuilding Sussex brand as they launch new website",
        "description": "Prince Harry and Meghan Markle have launched a new website ahead of their trip to Canada this week. Sussex.com went &#39;live&#39; on Monday and is operated by the Office of the Duke and Duchess of Sussex, as a &quot;one-stop shop&quot; for all of their activities."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25666646/prince-harry-meghan-markle-new-website/",
        "title": "Prince Harry and <b>Meghan Markle</b> ditch Archewell &amp; launch slick NEW website to share ‘personal updates’ with the world",
        "description": "PRINCE Harry and Meghan Markle have launched a new website amid a major rebrand after rumours swirled they were chasing a new deal. The couple have dubbed the site Sussex.com as a “one-stop"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/hits-misses-2024-super-bowl-192900174.html",
        "title": "Hits and misses from the 2024 Super Bowl commercials",
        "description": "Sunday night, the Kansas City Chiefs delivered another Super Bowl championship. Ding dong! DoorDash here. Trophy’s on the porch. Don’t forget to tip your quarterback. Like Popeye’s wings, BetMGM’s Tom Brady/Vince Vaughn act and the dear old Budweiser Clydesdales,"
    },
    {
        "url": "https://www.ladbible.com/entertainment/tv/suits-reboot-patrick-j-adams-gabriel-macht-meghan-markle-719007-20240212",
        "title": "Patrick J. Adams and Gabriel Macht respond to <b>Meghan Markle</b> question following show&#39;s potential return",
        "description": "Suits stars Patrick J. Adams and Gabriel Macht have responded to a question about Meghan Markle following the news of a reboot. Although the original series by Aaron Korsh ended in 2019, the show was the most-streamed series of last year, racking up more than three billion views over seven consecutive weeks."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513324/meghan-markle-storytelling-new-outing-close-to-heart/",
        "title": "<b>Meghan Markle</b> is all smiles as she showcases her storytelling skills during special outing",
        "description": "The Duchess of Sussex enjoyed a special evening out with some people very close to her heart over the weekend. On Saturday, Meghan Markle joined the Southern California Welcome Project for an evening of storytelling and cooking."
    },
    {
        "url": "https://uk.movies.yahoo.com/carolina-herrera-wes-gordon-shows-181152183.html",
        "title": "At Carolina Herrera, Wes Gordon Shows the Power of Restraint for Fall 2024",
        "description": "Wes Gordon staged a Fall 2024 runway show for Carolina Herrera that showed a surprising degree of restraint — surprising because Gordon has been a true showman since joining the house in 2018, turning out gown after vibrant gown for ladies who lunch,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865914/prince-harry-meghan-markle-king-chales-forgiveness",
        "title": "Prince Harry asked for King Charles&#39;s forgiveness&#39; at event with <b>Meghan Markle</b>",
        "description": "Prince Harry asked King Charles for forgiveness during an event he attended with Meghan Markle - long before he was engulfed in the ever so &#39;deepening&#39; rift with the Firm."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513316/prince-harry-and-meghan-markle-launch-new-sussex-website/",
        "title": "Prince Harry and <b>Meghan Markle</b> launch Sussex.com website in major rebrand - Exclusive",
        "description": "The Duke and Duchess of Sussex have launched a new website, Sussex.com on the eve of their trip to Canada. Prince Harry and Meghan unveiled the new site, which is operated by the Office of the Duke and Duchess of Sussex, as a &quot;one-stop shop&quot; for all their activities."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/world-news/prince-harrys-sweet-tribute-meghan-28618186",
        "title": "Prince Harry&#39;s sweet tribute to <b>Meghan Markle</b> and kids spotted in resurfaced video",
        "description": "Prince Harry has a sweet tribute to his wife Meghan Markle and their two children in his home office, and the artwork was actually created by an independent artist"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-jealous-kate-because-32108422",
        "title": "<b>Meghan Markle</b> was &#39;jealous&#39; of Kate because Harry was &#39;in love&#39; with her, royal author claims",
        "description": "Prince Harry cared deeply for the Princess of Wales but Meghan Markle was very &quot;envious&quot; of his feelings towards her according to bombshell new claims by a royal author."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-cant-rely-family-9094116",
        "title": "Prince Harry &#39;can&#39;t rely on family anymore&#39; after developing strained relationship",
        "description": "The Sussex&#39;s explosive interviews with the press have taken its toll on the Harry&#39;s relationship with his relatives"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13074335/charles-spencer-wife-rare-glimpse-princess-diana-final-resting.html",
        "title": "Earl Spencer&#39;s wife Karen shares rare glimpse of Princess Diana&#39;s final resting place on the Althorp Estate",
        "description": "The late Princess of Wales &#39; grave is situated on a private island in the middle of the Oval Lake on the Northampton estate where she grew up."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25884704/hint-meghan-markle-new-suits-spinoff/",
        "title": "Huge hint that <b>Meghan Markle</b> WON’T be in new Suits spinoff – despite being ‘offered dream role in series’",
        "description": "SUITS stars have dropped a huge hint that <b>Meghan Markle</b> won’t be in the new spinoff of the hugely popular TV show. The Duchess, 42, was last year offered a “dream role” on Suits: Los Angeles in “one of the biggest TV deals of the year”."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-major-185400701.html",
        "title": "<b>Meghan Markle</b> and Prince Harry will make a major joint Valentine’s Day appearance",
        "description": "Meghan Markle and Prince Harry are set to make a joint Valentine’s Day appearance. The couple will attend a launch event for the 2025 Invictus Games."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/12/",
        "title": "Prince Harry updates — Duke and <b>Meghan</b> ‘skip’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE Harry and Meghan Markle did not attend the Super Bowl just days after the Duke’s whirlwind visit to the UK, PageSix reported. Harry met with King Charles in a short 30-minute meeting"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-jealous-harry-being-32106389.amp",
        "title": "<b>Meghan Markle</b> &#39;jealous&#39; of Harry being &#39;in love&#39; with Kate Middleton, royal author claims",
        "description": "A royal author has claimed Prince Harry&#39;s relationship with Princess Kate led to Meghan Markle feeling &#39;envious&#39; and &#39;jealous&#39; before the family&#39;s bitter feud began"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/meghan-markle-suits-royal-family-32105273.amp",
        "title": "<b>Meghan Markle</b>&#39;s had &#39;zero communication&#39; with Suits co-stars after cutting them out",
        "description": "The Duchess of Sussex&#39;s former Suits co-stars have been quizzed about Meghan and when they last spoke to her - and whether a return to the silver screen is on the cards"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13073401/prince-harry-meghan-markle-super-bowl-no-show.html",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Super Bowl no-show: Couple skip star-studded game despite Duke&#39;s recent Las Vegas appearance - as they prepare for trip to Canada ahead of ...",
        "description": "The couple were rumoured to join the many A-list celebrities - including Taylor Swift , Beyonce, and Sir Paul McCartney - at the biggest American Football game of the year"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/exclusive-daniel-fletcher-named-royal-193411274.html",
        "title": "EXCLUSIVE: Daniel Fletcher Named Royal Ascot’s Creative Director for 2024 Season",
        "description": "The late monarch Queen Elizabeth II was an avid hippophile, while her daughters-in-law, the late Princess Diana and Sarah Ferguson; and Catherine Middleton and <b>Meghan Markle</b>, the wives of Prince William and Prince Harry, have always captured the attention ..."
    },
    {
        "url": "https://www.itv.com/news/central/2024-02-12/walsall-baker-creates-taylor-swift-super-bowl-cake-out-of-130kg-of-ingredients",
        "title": "Baker creates Taylor Swift Super Bowl cake out of 130kg of ingredients",
        "description": "Lara Mason spent 38 hours in her workshop creating the seven foot high replica of the singer. | ITV News Central"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-diagnosis-harry-william-kate-b2494556.html",
        "title": "King Charles cancer – latest: Monarch seen in first public appearance as Harry set to return to UK in weeks",
        "description": "After receiving his first cancer treatment, King Charles III has taken up residence at Sandringham House, which is located along the North Sea coast of eastern England. He stepped out on the grounds on Sunday as he attended church on his first public outing since his cancer diagnosis was revealed."
    },
    {
        "url": "https://www.thesun.ie/royals/12188824/prince-harry-sent-clear-message-royal-expert/",
        "title": "Prince Harry has been sent a clear message…he’s not forgiven &amp; he’s done a lot of damage, says royal expert",
        "description": "KING CHARLES and Prince William have sent Prince Harry a clear message that he’s not forgiven, a royal expert has claimed. Writer and broadcaster Robert Jobson exclusively told The Sun’s"
    },
    {
        "url": "https://fashionunited.uk/news/business/south-africa-s-tshepo-jeans-from-township-to-stars-closets/2024021274063",
        "title": "South Africa&#39;s Tshepo Jeans: from township to stars&#39; closets",
        "description": "Growing up in a rough township outside Johannesburg, Tshepo Mohlala was mocked for wearing skinny jeans before they were popular."
    },
    {
        "url": "https://hollywoodlife.com/2024/02/12/patrick-j-adams-and-gabriel-macht-havent-talked-to-meghan-markle/",
        "title": "‘Suits’ Stars Patrick J. Adams &amp; Gabriel Macht Admit They’ve Had ‘No Communication’ With <b>Meghan Markle</b> Recently",
        "description": "The Duchess of Sussex’s former co-stars were asked if they had spoken to her since ‘Suits’ had a recent resurgence in popularity while on set for their Super Bowl LVIII"
    },
    {
        "url": "https://www.romper.com/entertainment/archie-lilibet-drawing-prince-harry-home-office",
        "title": "Prince Harry Has A Sweet Drawing Of Archie &amp; Lilibet Displayed In His Home Office",
        "description": "Prince Harry has a sweet drawing of his children with Meghan Markle, Archie and Lilibet, hung in his home office."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1157016-meghan-markles-heartwarming-gesture-to-adoring-fans-goes-viral",
        "title": "<b>Meghan Markle</b>&#39;s heartwarming gesture to adoring fans goes viral",
        "description": "Meghan Markle is currently estranged from the Royal Family following a contentious fallout, but their relationship wasn&#39;t always strained. The Duchess of Sussex became a part of The Firm when"
    },
    {
        "url": "https://ca.finance.yahoo.com/news/meghan-markle-prince-harry-relaunch-193800739.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Relaunch Their Website",
        "description": "When Prince Harry and Meghan Markle got married, they split their household from Prince William and Kate Middleton, and began operating under the &quot;Sussex Royal&quot; brand. They began sharing updates with the world using the handle &quot;SussexRoyal&quot; on Instagram— Meghan,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-reassures-meghan-markle-hand-holding-body-language-expert-says.html/",
        "title": "Prince Harry Reassures <b>Meghan Markle</b> With Hand-Holding, Body Language Expert Says",
        "description": "Prince Harry and Meghan Markle are known to hold hands during public appearances, but there could be more to it, per an expert."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/suits-patrick-j-adams-gabriel-191952546.html",
        "title": "When &#39;Suits&#39; Patrick J. Adams and Gabriel Macht Last Spoke to <b>Meghan Markle</b>",
        "description": "Aside from not taking part in the commercial, Markle, 42, was also noticeably absent from the Suits mini-cast reunion at this year&#39;s Golden Globes. Joining Adams and Macht were two more co-stars, Sarah Rafferty (Donna Paulsen) and Gina Torres (Jessica Pearson)."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2955574/meghan-markle-no-communication-suits-costars/",
        "title": "<b>Meghan Markle</b>’s Suits Costars Admit They Haven’t Heard From Her in a While",
        "description": "Well, everyone that is except for <b>Meghan Markle</b>. The royal family member has long since quit the acting business and it sounds like she and the cast have drifted apart — and they miss her. Patrick J. Adams and Gabriel Macht spoke to The Hollywood ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12189262/prince-william-never-see-harry-royal-expert/",
        "title": "Prince William was never going to see Harry – not after everything he’s done, royal expert says",
        "description": "PRINCE William was never going to see Prince Harry after years of attacks by the duke, a royal expert has claimed. Writer and broadcaster Robert Jobson exclusively told The Sun’s Royal"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13073411/patrick-adams-gabriel-macht-zero-communication-meghan-markle.html",
        "title": "Patrick J. Adams and Gabriel Macht say they&#39;ve had &#39;zero communication&#39; with former co-star <b>Meghan Markle</b> following the renewed success of Suits",
        "description": "Mobile&#39;s Super Bowl commercial, the Canadian and American actors were asked: &#39;Have you spoken to Meghan Markle recently?&#39;"
    },
    {
        "url": "https://www.bbc.co.uk/news/topics/c87v6qqwm5vt?page=6",
        "title": "Animal rescue groups",
        "description": "All the latest content about Animal rescue groups from the BBC."
    },
    {
        "url": "https://www.ibtimes.co.uk/piers-morgan-reacts-prince-harrys-mgn-win-stern-warning-1723377",
        "title": "Piers Morgan Reacts To Prince Harry&#39;s MGN Win With Stern Warning",
        "description": "The TV host tells the Duke of Sussex to stop invading the privacy of the Royal Family in response to the royal&#39;s victory over his hacking case against MGN."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middleton-meghan-markle-harry-32103476",
        "title": "<b>Meghan Markle</b> &#39;envious&#39; of Prince Harry&#39;s bond with sister-in-law Kate Middleton",
        "description": "A royal expert claims the Duchess of Sussex is &#39;envious&#39; of her sister-in-law, the Princess of Wales&#39;, close bond with Prince Harry as he &#39;always longed for a sister&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865643/meghan-markle-princess-kate-envy",
        "title": "<b>Meghan Markle</b> &#39;incredibly envious of Kate Middleton&#39; and &#39;thought she would be a princess&#39;",
        "description": "Meghan Markle &#39;must have been incredibly envious&#39; of Prince Harry&#39;s adoration for Princess Kate, royal author Ingrid Seward says."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-had-no-plans-011221379.html",
        "title": "Prince Harry Had No Plans to Attend Super Bowl Despite NFL Honors Appearance",
        "description": "Prince Harry and Meghan Markle had no intention of attending the Super Bowl on Sunday, despite the Duke of Sussex&#39;s appearance at the NFL Honors a few days earlier, PEOPLE understands."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/10/",
        "title": "Prince Harry updates — Duke and <b>Meghan</b> ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE Harry and Meghan Markle will attend this weekend’s Super Bowl just days after the Duke’s whirlwind visit to the UK, sources say. Harry met with King Charles in a short 30-minute"
    },
    {
        "url": "https://uk.style.yahoo.com/why-prince-harry-meghan-markle-222000139.html",
        "title": "Why Prince Harry and <b>Meghan Markle</b> Will Not Attend the Super Bowl",
        "description": "Prince Harry attended the NFL Honors in Las Vegas, but that doesn&#39;t mean he will be at the Super Bowl on Sunday."
    }
]