[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-harry-say-theyre-counting-32172475",
        "title": "<b>Meghan</b> and Harry say they&#39;re &#39;counting down the days&#39; until they can return to Canada",
        "description": "Meghan Markle and Prince Harry have said that they are &#39;counting down the days&#39; until they can return to Canada, following a fun-filled trip to Vancouver"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-just-subtly-changed-204527756.html",
        "title": "<b>Meghan Markle</b> Just Subtly Changed Her Hair Color",
        "description": "Markle&#39;s hair colorist, Kadi Lee of Highbrow Hippie Salon, confirmed that the royal&#39;s hair is now a deeper shade of &quot;chocolate chestnut brunette&quot; with red and gold undertones a slight switch-up from her usual hue."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26072432/meghan-markles-cousin-reveals-her-privileged-childhood-with-hawaii-disney-trips-despite-her-saying-they-struggled/",
        "title": "<b>Meghan Markle</b>’s cousin reveals her privileged childhood, with Hawaii &amp; Disney trips, despite her saying they struggled",
        "description": "MEGHAN Markle’s cousin has opened up about his childhood with the now-Duchess of Sussex – including detailing some of the swanky holidays she went on. This follows Meghan claiming her family"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-face-32173374",
        "title": "<b>Meghan Markle</b> and Prince Harry face &#39;internal conflict&#39; after controversial rebrand",
        "description": "Prince Harry and Meghan Markle relaunched their website using their official coat of arms, which many believe could be a telltale sign of an &#39;internal conflict&#39;, according to one royal expert. The pair raised eyebrows last week when they replaced their Archewell website with Sussex."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-william-barbie-baftas_n_65d4aa46e4b0b65d69209130",
        "title": "Prince William Stuns Fans By Admitting He Hasn&#39;t Seen This 1 Movie",
        "description": "The Prince of Wales, who is the president of the British Academy of Film and Television Arts, left fans gobsmacked by this admission."
    },
    {
        "url": "https://www.telegraph.co.uk/music/concerts/sir-karl-jenkins-on-being-mistaken-for-meghan-markle/",
        "title": "Sir Karl Jenkins on being mistaken for <b>Meghan</b>: ‘People were buying me drinks in the pub’",
        "description": "And when I meet him in London the week before his 80th birthday, he tells me he definitely sees the funny side of what he calls his “Meghan moment”. “People were stopping me in the street, asking for photos, buying me drinks in the pub,” he shakes his head with a dry chuckle."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/prince-philip-would-sad-see-32172512",
        "title": "Prince Philip &#39;would be sad&#39; to see Prince Harry abandon 64-year-old royal tradition",
        "description": "Prince Harry and Meghan Markle shocked Royal fans last week when they moved on from a 64 year old Royal tradition and gave their children, Archie and Lilibet, a brand new surname"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/how-meghan-markle-really-lost-32170989?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "How <b>Meghan Markle</b> really lost her biggest role as Suits spinoff creator&#39;s pal explains",
        "description": "Meghan Markle has not been asked back for the upcoming Suits revival, it has been confirmed, with the reason behind now unveiled by a close pal of the showrunner"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868863/meghan-markle-mature-cousin-reveals",
        "title": "<b>Meghan Markle</b> &#39;was always very mature for her age&#39; and &#39;always looking after family&#39;",
        "description": "Meghan Markle&#39;s cousin has fondly remembered how caring she was in her childhood and how &quot;really mature&quot; she used to be."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-share-154804459.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Share Unseen Photo from Canada Visit: &#39;It Filled Our Hearts&#39; (Exclusive)",
        "description": "The Duke and Duchess of Sussex exclusively tell PEOPLE they &quot;loved being back in Canada&quot; for the countdown to next year&#39;s Invictus Games"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868794/meghan-markle-canada-trip-wardrobe-cost",
        "title": "<b>Meghan Markle</b> sparks royal fan frenzy over £44k &#39;rich mum energy&#39; wardrobe",
        "description": "Since her days as a cast member in the TV show Suits, <b>Meghan Markle</b> has been hailed as a fashion icon by many commentators and fans. Her recent trip to Canada alongside Prince Harry to celebrate the upcoming Invictus Games to take place in the nation in ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13104495/Lottery-winner-jackpot-boyfriend-ticket-win-rubbish.html",
        "title": "Lottery winner accused of trousering £1million jackpot after splitting with her boyfriend says he never paid for the ticket and his claim to the huge win is &#39;all rubbish&#39;",
        "description": "It nearly broke me but thankfully, I&#39;m now stronger.&#39; Thomas <b>Markle</b> won $750,000 on the California state lottery in 1990 when <b>Meghan Markle</b> was just nine. The father of the now Duchess of Sussex used her birth date for one of the numbers in the ..."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markles-winter-hair-transformation-202355554.html",
        "title": "<b>Meghan Markle</b>&#39;s Winter Hair Transformation: The Secret Behind Her &#39;Chocolate Chestnut Glow&#39;",
        "description": "The Duchess of Sussex styled her tresses in several ways during her visit to Canada with Prince Harry Andrew Chin/Getty <b>Meghan Markle</b> attends the Invictus Games Winter Training Camp in Canada on February 15, 2024 Did <b>Meghan Markle</b> refresh her tresses ahead ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/gallery/inside-prince-harrys-special-passion-32133108",
        "title": "Inside Prince Harry&#39;s special passion that he shares with wife <b>Meghan Markle</b>",
        "description": "Prince Harry captured his love of Africa on camera back in 2014, during a tour in support of his charity, Sentebale, which supports the wellbeing of people affected by HIV"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/royal-news/prince-harry-finally-realises-no-9111675",
        "title": "Prince Harry &#39;finally realises he has no choice&#39; with Royal Family",
        "description": "Prince Harry is said to have had a &#39;realisation&#39; about his relationship with the Royal family following his visit to the UK, but insiders say there is &#39;no chance&#39; he will be allowed to return to a Royal role."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13103307/meghan-markle-prince-harry-friendship-michael-buble-jessica-mulroney.html",
        "title": "How <b>Meghan Markle</b> and Prince Harry owe their friendship with Michael Buble to Duchess&#39; former BFF Jessica Mulroney - as couple enjoy intimate performance from singer in Canada",
        "description": "Meghan and Michael met over dinner hosted by the stylist and her husband Ben in 2015. The pair were reunited last week at a lavish gala in Vancouver to celebrate the 2025 Winter Invictus Games."
    },
    {
        "url": "https://uk.movies.yahoo.com/sarah-ferguson-says-she-feeling-151735158.html",
        "title": "Sarah Ferguson Says She’s ‘Feeling Positive&#39; from &#39;Support of My Family’ amid Skin Cancer Diagnosis",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! According to the spokesperson, the Duchess had a number of moles removed and analyzed by a ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-really-mature-child-28667093",
        "title": "<b>Meghan Markle</b> was &#39;really mature&#39; as a child and &#39;always looking after&#39; her cousins",
        "description": "The Duchess of Sussex&#39;s cousin Shawn Johnson has described her as &quot;infectious&quot; and &quot;really mature for her age&quot; as a child - and an expert has explained why she may have been like this <b>Meghan Markle</b> was a caring child who had to face many challenges ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-meghan-markle-canada-b2499377.html",
        "title": "Prince Harry and <b>Meghan</b> reflect on their ‘meaningful’ visit to Canada",
        "description": "<b>Meghan Markle</b> and Prince Harry have sweetly reflected on their “meaningful” trip to Canada, which they took in honour of the 2025 Invictus Games. The Duke and Duchess of Sussex opened up about their trip during an interview with People, published on 20 ..."
    },
    {
        "url": "https://www.hellomagazine.com/shopping/513569/best-trench-coats-for-women/",
        "title": "11 best trench coats to wear, whatever the weather",
        "description": "It&#39;s a royal go-to too, with Princess Kate, <b>Meghan Markle</b> and even Queen Camilla, who have all banked more than a few incredible trench coat fashion moments. And during the recent Copenhagen Fashion Week, trench coats came in all shapes, sizes and ..."
    },
    {
        "url": "https://startsat60.com/media/news/prince-philip-would-turn-in-his-grave-following-harry-and-meghans-latest-move-royal-biographer-claims",
        "title": "Prince Philip would ‘turn in his grave’ following Harry and <b>Meghan</b>’s latest move, royal biographer claims",
        "description": "The move has been seen as a significant deviation from royal tradition. Source: Getty Images. Prince Harry and <b>Meghan Markle</b>’s recent antics have significantly strained relations with the Royal Family. Nevertheless, it is believed that the late Prince ..."
    },
    {
        "url": "https://www.tag24.com/entertainment/royals/meghan-markle/meghan-markles-cousin-makes-surprising-admissions-about-their-childhood-3104188",
        "title": "<b>Meghan Markle</b>&#39;s cousin makes surprising admissions about their childhood",
        "description": "<b>Meghan Markle</b> has been out of contact with most of her family for years, but her relatives are still speaking out about the Duchess. Montecito, California - <b>Meghan Markle</b> has been out of contact with most of her family for years, but her relatives are ..."
    },
    {
        "url": "https://hollywoodlife.com/2024/02/20/suits-star-rick-hoffman-recalls-smell-at-meghan-markles-wedding/",
        "title": "<b>Meghan Markle</b>’s ‘Suits’ Co-Star Rick Hoffman Recalls ‘Foul’ Smell at Royal Wedding: It ‘Was Terrible’",
        "description": "Rick Hoffman wanted to clear the air about something that ruined Meghan Markle ’s wedding for him. The Suits alum, 53, recalled a “really terrible and foul” scent that hit him during his former co-star’s 2018 wedding, when she married her husband, Prince Harry."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159729-prince-harry-meghan-markle-argue-as-duke-wants-to-end-royal-feud",
        "title": "Prince Harry, <b>Meghan Markle</b> argue as Duke wants to ‘end royal feud’",
        "description": "Prince Harry and <b>Meghan Markle</b> don’t seem to be on the same page when it comes to the thought of repairing the “damage” caused to their relationship with the royal family. According to a source, Prince Harry and <b>Meghan Markle</b> have reportedly been ..."
    },
    {
        "url": "https://face2faceafrica.com/article/invictus-games-meghan-and-prince-harry-unveiled-a-historic-first-in-canada",
        "title": "Invictus Games: <b>Meghan</b> and Prince Harry unveiled a historic first in Canada",
        "description": "Meghan Markle and Prince Harry made headlines after they unveiled the groundbreaking Invictus Games Vancouver Whistler 2025 logo, a collaborative effort involving the Squamish, Tsleil-Waututh, Musqueam,"
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/royals-sporting-moments/",
        "title": "32 times the royals showed off their sporting prowess",
        "description": "The Princess of Wales might be known for her talents at tennis and more, but she&#39;s far from the only sporty royal!"
    },
    {
        "url": "https://people.com/prince-william-admits-had-other-things-on-my-mind-candid-moment-baftas-2024-8597601",
        "title": "Prince William Admits He&#39;s Had &#39;Other Things on My Mind&#39; in Rare Candid Moment at BAFTAs",
        "description": "&quot;All the ones I watch, she watches with me. So we go through it carefully,&quot; William shared. Prince Harry, who resides in California with his wife <b>Meghan Markle</b> and their two children, even made a short trip to the U.K. following news of his father&#39;s cancer ..."
    },
    {
        "url": "https://pagesix.com/2024/02/20/style/meghan-markle-wore-blenders-grove-sunglasses-in-canada-and-theyre-under-60/",
        "title": "<b>Meghan Markle</b> wore these under-$60 sunglasses during her trip to Canada",
        "description": "The Duchess of Sussex might be practically up to her eyeballs in designer duds, but she still loves a good pair of budget-friendly frames."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-william-kate-middleton-celebrity-195630649.html",
        "title": "All of Prince William Kate Middleton’s Celebrity Friends",
        "description": "After <b>Meghan Markle</b> and Prince Harry moved into the US, it seems as though they know everyone who’s anyone in Hollywood. From attending high-profile events together with other celebs and doing podcasts with them, we have a good rundown on who the Duke ..."
    },
    {
        "url": "https://www.aol.com/prince-harry-meghan-reflect-meaningful-174002512.html",
        "title": "Prince Harry and <b>Meghan</b> reflect on their ‘meaningful’ visit to Canada",
        "description": "It filled our hearts to once again be surrounded by Canadian people, food and culture,’ Duke and Duchess of Sussex say"
    },
    {
        "url": "https://www.aol.com/entertainment/meghan-markle-suits-costar-recalls-173814321.html",
        "title": "<b>Meghan Markle</b>’s ‘Suits’ Costar Recalls ‘Foul’ Smell at Prince Harry Wedding",
        "description": "Karwai Tang/WireImage Meghan Markle’s Suits costar Rick Hoffman went viral for making a face at her 2018 wedding to Prince Harry — and he says there’s a simple reason why. “If you type in my name in on Google,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159724-meghan-markles-cousin-shares-rare-details-about-duchess-childhood",
        "title": "<b>Meghan Markle</b>&#39;s cousin shares rare details about Duchess&#39; childhood",
        "description": "Meghan Markle was helpful and kind towards her family, as defined by her cousin Shawn Johnson.In conversation with Daily Mail, Shawn, who is no longer in contact with the Duchess of Sussex,"
    },
    {
        "url": "https://robbreport.com/motors/cars/king-charles-first-royal-ev-2018-jaguar-i-pace-auction-1235517317/",
        "title": "King Charles’s First EV Is Heading to Auction",
        "description": "A 2018 Jaguar I-Pace once owned by King Charles III will be sold by Historics Auctioneers in the U.K. later this month. The crossover, which was bought with the then-prince’s own money, has the distinction of being the royal family’s first EV."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/meghan-markle-nailed-low-effort-184545744.html",
        "title": "<b>Meghan Markle</b> Nailed the Low Effort Updo in a Brand New Pic from Her Canada Trip",
        "description": "Prince Harry and Meghan Markle arrived in Canada for the start of Invictus Games season in the middle of February. The Duchess of Sussex wasted no time in showing off her impeccable cold-weather style, as well as her commitment to skinny jeans —no matter what the Zoomers on TikTok have to say. Queen behavior, obviously."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-and-harry-were-serenaded-by-michael-buble-in-vancouver",
        "title": "<b>Meghan</b> and Harry Were Serenaded by Michael Bublé in Vancouver",
        "description": "At a Friday night gala dinner, the singer sent “healing wishes” to King Charles III and praised Harry for being a “visionary.”"
    },
    {
        "url": "https://www.afr.com/life-and-luxury/fashion-and-style/meghan-markle-s-beloved-designer-is-back-at-a-fraction-of-the-cost-20240214-p5f4wo",
        "title": "<b>Meghan Markle</b>’s beloved designer is back (at a fraction of the cost)",
        "description": "That really appealed to me,” she says. Prince Harry and <b>Meghan Markle</b> on the steps of St George’s Chapel, Windsor Castle, after their wedding ceremony on May 19, 2018. AP Though Waight Keller has spent much of her career designing for luxury houses ..."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-share-154804459.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Share Unseen Photo from Canada Visit: &#39;It Filled Our Hearts&#39; (Exclusive)",
        "description": "The Duke and Duchess of Sussex exclusively tell PEOPLE they &quot;loved being back in Canada&quot; for the countdown to next year&#39;s Invictus Games"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-difficult-call-over-32167110",
        "title": "Prince Harry has &#39;difficult call&#39; over reference to King Charles but <b>Meghan</b> has &#39;no filter&#39;",
        "description": "The Duke of Sussex appeared to face a &#39;difficult&#39; call when Michael Bublé mentioned his father King Charles in a rendition of &#39;My Way&#39; according to a body language expert."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-harry-william-cancer-news-b2498916.html",
        "title": "Royal news - live: Sarah Ferguson gives health warning after she and King Charles diagnosed with cancer",
        "description": "The King smiled and waved at wellwishers in his first public appearance since Prince Harry’s interview aired where he hinted he was hoping the royal family could reunify in the wake of his father’s shock cancer diagnosis."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/meghan-markles-no-filter-body-28666460",
        "title": "<b>Meghan Markle</b>&#39;s &#39;no filter&#39; body language with Prince Harry over King Charles",
        "description": "Meghan Markle showed &quot;no filter&quot; in her body language towards Prince Harry as Michael Buble mentioned the Duke of Sussex&#39;s father, King Charles, during a rendition of Frank Sinatra&#39;s &quot;My Way&quot;, an expert has said."
    },
    {
        "url": "https://www.ibtimes.co.uk/matt-smith-says-prince-harry-joked-about-his-role-crown-1723539",
        "title": "Matt Smith Says Prince Harry Joked About His Role In &#39;The Crown&#39;",
        "description": "The actor said the Duke of Sussex called him &quot;granddad&quot; because of his portrayal of Prince Philip in the Netflix series."
    },
    {
        "url": "https://arynews.tv/bad-news-for-meghan-markle-suits-fan/",
        "title": "Bad news for <b>Meghan Markle</b>’s ‘Suits’ fan",
        "description": "Suits&#39; fans of Meghan Markle are in for a disappointment as they might not be seeing the Duchess of Sussex in the series&#39; reboot. Watch ARY News live"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13101087/Hermes-jacket-Joan-Arctic-boots-Meghan-wardrobe-rich-mom.html",
        "title": "From a £3,000 Hermes bomber jacket to £195 Joan of Arctic boots, hidden meanings behind <b>Meghan</b>&#39;s &#39;rich mom energy&#39; ski-slope wardrobe (worth over £44,000!)",
        "description": "Getting dressed is a minefield these days. Not only do you have to worry about whether your clothes are in fashion, there&#39;s also increasing pressure to worry about their provenance."
    },
    {
        "url": "https://www.ibtimes.co.uk/king-charles-iii-good-spirits-first-sighting-since-prince-harrys-tv-interview-1723536",
        "title": "King Charles III In Good Spirits In First Sighting Since Prince Harry&#39;s TV Interview",
        "description": "His Majesty attended Sunday service at St. Mary Magdalene Church in Sandringham with Queen Camilla on Feb. 18."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/7/",
        "title": "Prince Harry updates — Duke not seeking a return to duty despite rumours as King Charles battles cancer",
        "description": "He will discuss the 2025 Invictus Games, his marriage to <b>Meghan Markle</b> as well as the King&#39;s health. It will air on Good Morning America. You can send King Charles your well wishes following his cancer diagnosis. The monarch, 75, returned to London ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-harry-william-cancer-news-b2498916.html?page=4",
        "title": "Royal family news - live: King in first outing since Harry interview as ‘zero chance’ of prince’s return",
        "description": "The King smiled and waved at wellwishers in his first public appearance since Prince Harry’s interview aired where he hinted he was hoping the royal family could reunify in the wake of his father’s shock cancer diagnosis."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-all-grift-no-duty-says-columnist.html/",
        "title": "<b>Meghan Markle</b> and Prince Harry Are ‘All Grift, No Duty’ Says Reporter",
        "description": "Backlash surrounding <b>Meghan Markle</b> and Prince Harry continues. A reporter agrees with Spotify executive Bill Simmons, who once called the couple “grifters,” saying that <b>Meghan</b> and Harry’s new website motto should be “all grift, no duty.”"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-return-uk-to-28666927",
        "title": "Prince Harry to return to UK &#39;to see family&#39; after first meeting with King Charles",
        "description": "Harry, who lives in the US with his wife <b>Meghan Markle</b>, spent just over 24 hours in the UK when he rushed to visit his father. But he&#39;s now revealed he plans to return to the UK to spend more time with Charles. &quot;Throughout all these [Invictus Games ..."
    },
    {
        "url": "https://people.com/meghan-markle-jeremy-allen-white-the-bear-apron-8597583",
        "title": "<b>Meghan Markle</b>’s Stain-Resistant Apron Is the Same One Jeremy Allen White Wore on The Bear — and Now, We Want One",
        "description": "If you click on links we provide, we may receive compensation. Learn more. Matt Sayles <b>Meghan Markle</b> is down to cook, though she’s not getting dirty. The Duchess of Sussex joined the Southern California Welcome Project for “an evening of cooking and ..."
    }
]