[
    {
        "url": "https://www.cheatsheet.com/entertainment/princess-eugenie-solidarity-prince-william-kate-middleton-christmas-expert-says.html/",
        "title": "Princess Eugenie Showed ‘Solidarity’ With Prince William and Kate Middleton on Christmas, Expert Says",
        "description": "Princess Eugenie has been one of the few royals who has managed to stay close with both Prince William and Prince Harry."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-unusual-appearance-endgame-book-launch-analyzed-body-language-expert-deliberately-low-key.html/",
        "title": "<b>Meghan Markle</b>’s ‘Unusual’ Appearance Before ‘Endgame’ Book Launch, Analyzed by a Body Language Expert: ‘Deliberately Low-Key’",
        "description": "Meghan Markle moderated a discussion about &#39;The After&#39; just weeks before &#39;Endgame.&#39; Here&#39;s a body lanaguage expert&#39;s analysis."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849316/meghan-markle-return-acting-test-relationship-prince-harry",
        "title": "<b>Meghan Markle</b>’s ‘want to go back to acting’ will test relationship with Prince Harry",
        "description": "Renowned astrologer Susan Miller has revealed her predictions for 2024, including what&#39;s in store for Prince Harry and Meghan Markle."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-huge-31752313",
        "title": "<b>Meghan Markle</b> and Prince Harry’s huge but minimalist Christmas tree at Montecito mansion",
        "description": "Prince Harry and Meghan Markle spent Christmas at their £11million nine-bedroom home in Montecito, California this year"
    },
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-moving-on-8420117",
        "title": "Kate Middleton and Prince William Have Reportedly“Moved on” From Rift With Prince Harry and <b>Meghan Markle</b>",
        "description": "After years of royal family drama, sources say Kate Middleton and Prince William, the Prince and Princess of Wales, are moving on. Get the details here."
    },
    {
        "url": "https://uk.style.yahoo.com/kate-middleton-king-charles-quite-170000522.html",
        "title": "Kate Middleton and King Charles &#39;Are Quite Close — Closer to Him Than William,&#39; Says Insider (Exclusive)",
        "description": "The Prince and Princess of Wales are an &quot;incredible enhancement&quot; to King Charles and Queen Camilla,&quot; royal biographer Sally Bedell Smith tells PEOPLE in this week&#39;s issue"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markles-lonely-31751417",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;lonely&#39; Christmas as they spend another year away from UK",
        "description": "Prince Harry and Meghan Markle have spent the past three Christmases in the US, but fans were hopeful that the couple would return to the UK this year"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghans-royal-family-feud-31609245",
        "title": "Harry and <b>Meghan</b>&#39;s Royal Family feud can&#39;t be fixed with &#39;just one reunion&#39;, says expert",
        "description": "There are rumours that Meghan Markle and Prince Harry could be spending Christmas with the Royal Family in the UK, but one expert has suggested that won&#39;t fix their relationship"
    },
    {
        "url": "https://uk.style.yahoo.com/did-u-k-prime-minister-160023303.html",
        "title": "Did U.K. Prime Minister Rishi Sunak Snub Prince Harry in His Christmas Video?",
        "description": "U.K. Prime Minister Rishi Sunak&#39;s Christmas video may have been misinterpreted."
    },
    {
        "url": "https://uk.movies.yahoo.com/royal-familys-best-christmas-day-155157481.html",
        "title": "The royal family&#39;s best Christmas Day outfits through the years",
        "description": "Kate Middleton wore a royal-blue Alexander McQueen coat with pair of Princess Diana&#39;s sapphire drop earrings to this year&#39;s service."
    },
    {
        "url": "https://metro.co.uk/2023/12/26/king-charles-shows-affection-towards-grandchildren-new-documentary-20026257/?ico=trending-module_author_jlreporter_item-1",
        "title": "King Charles shows tender affection towards grandchildren in new royal documentary",
        "description": "The ‘extraordinarily affectionate’ side of King Charles III will be shown in a new BBC documentary marking the first year of his reign. In contrast to the cold picture of the king alluded to by Prince Harry, he enters a rehearsal for his Coronation at Westminster Abbey showing his fondness for Prince William and the heir’s young family."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12881761/susan-miller-predictions-2024-taylor-swift-travis-kelce.html",
        "title": "Celebrity astrologer Susan Miller lays bare her expert predictions for 2024 - revealing whether Taylor Swift and Travis Kelce will REALLY last... and why there&#39;s TROUBLE ahead ...",
        "description": "FEMAIL has asked renowned astrologist Susan Miller, founder of Astrology Zone, to share her predictions for the coming year, including what&#39;s in store for celebrity A-list couples Taylor Swift and Travis Kelce, and Prince Harry and <b>Meghan Markle</b>."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/royal-family-christmas-sandringham-kings-speech-b2469259.html",
        "title": "King’s Speech live – Charles gives Christmas message after joining Kate and William at Sandringham",
        "description": "Earlier, Charles and Camilla were joined by the Prince and Princess of Wales and their children Prince George, Princess Charlotte and Prince Louis for morning service at St Mary Magdalene Church. It comes after the King and Queen waved to well-wishers while attending a Christmas Eve service at the church on Sunday."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849170/prince-harry-meghan-markle-reputation",
        "title": "Prince Harry and <b>Meghan Markle</b> urged to &#39;get new PR plan&#39; to claw back sympathy",
        "description": "A royal expert claimed Prince Harry and Meghan Markle&#39;s &#39;prestige&#39; has been damaged after Omid Scobie&#39;s Endgame release and suggested the next steps they should take to restore their popularity."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middletons-affordable-secret-for-glowing-skin-is-down-to-10-095733341.html",
        "title": "Kate Middleton&#39;s secret for glowing skin is down to just $10 during Amazon&#39;s Winter Sale",
        "description": "Get ready with dance fitness instructor Sadie Kurzban! Sadie is the founder of 305 Fitness in NYC and a champion for women’s confidence. Her beauty and business motto is “It’s not about covering up or hiding, but unapologetically showing up and embracing your unique beauty.” Her simple 5-minute look will empower you to take on the world."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markles-christmas-31749939",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Christmas reunion in UK &#39;ruined&#39; amid fresh drama",
        "description": "Before the release of bombshell book End Game, it was hooped by royal fans that t the Duke and Duchess of Sussex would able to make amends with the Royal family in time for Christmas"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12900775/Touching-friendship-Zara-Tindall-Prince-Williams-children-Mikes-bond-Prince-George-prove-Tindalls-Waleses-grown-closer-Harry-Meghan-drifted-away.html",
        "title": "Touching friendship between Zara Tindall and Prince William&#39;s children and Mike&#39;s bond with Prince George prove how the Tindalls and Waleses have grown ever closer since Harry ...",
        "description": "Members of the Royal Family, including the Prince and Princess of Wales, their children, and Mike and Zara Tindall, attended the Sandringham church service yesterday."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510071/meghan-harry-christmas-tree/",
        "title": "<b>Meghan Markle</b> and Prince Harry’s huge minimalist deco Christmas tree at their Montecito mansion",
        "description": "The tree - which appears to be a real fir tree - is the focal point of the couple’s living room, reaching all the way up to the ceiling at their Montecito mansion in Los Angeles. It’s decorated simply, with twinkly fairy lights and only a sparse scattering of simple ornaments - including baubles and a toy Santa."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middleton-secret-strength-she-130000646.html",
        "title": "Kate Middleton’s Secret Strength: &#39;She Is Prepared to Fight for What She Thinks Is Right&#39; (Exclusive)",
        "description": "“She has this public image of being nice and smiley and, dare I say, innocuous,” royal author Valentine Low tells PEOPLE in this week&#39;s issue. “But she is actually strong-minded, strong-willed and prepared to fight for what she wants and what she thinks is right.”"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-family-christmas-fashion-rules-31629931",
        "title": "The fashion rules Royals have to abide by on Christmas day",
        "description": "It&#39;s no secret that the royal family have to follow a myriad of fashion rules all year round, but come Christmas there&#39;s even more to remember - here&#39;s a list of them all"
    },
    {
        "url": "https://www.aol.com/victoria-beckham-gifts-david-beckham-194112184.html",
        "title": "Victoria Beckham Gifts David Beckham Chickens for Christmas",
        "description": "David Beckham and Victoria Beckham. Darren Gerrish/Darren Gerrish/WireImage Victoria Beckham and David Beckham added some farm friends to their family this Christmas. “What do you get @davidbeckham for Christmas?"
    },
    {
        "url": "https://www.yahoo.com/entertainment/member-british-royal-family-reportedly-210342402.html",
        "title": "This Member of the British Royal Family Has Reportedly Grown ‘Quite Close’ To King Charles",
        "description": "Between Prince Harry and <b>Meghan Markle</b>’s departure from the United Kingdom, King Charles III’s ascension to the throne, and more, the monarchy has endured a lot in the last few years. Now, a new report suggests King Charles has grown closer to one ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25167524/clemmie-moodie-crystal-ball-2024/",
        "title": "An end to Wagatha saga and Zelensky signing up for Strictly…. Clemmie Moodie gazes into her crystal ball for 2024",
        "description": "AS we say goodbye to another year, here’s hoping you all have a wonderful 2024. The last 12 months have, of course, been peak-mad, peak-woke and, sadly, peak-warry. In the words of D:Ream, things,"
    },
    {
        "url": "https://nypost.com/2023/12/26/entertainment/did-british-pm-rishi-sunak-mock-prince-harry-in-christmas-video/",
        "title": "‘Wrong number’: Did the UK prime minister Rishi Sunak mock Prince Harry in his Christmas video?",
        "description": "British Prime Minister Rishi Sunak’s new Christmas video has royal fans raising their eyebrows. The 43-year-old politician’s holiday clip has viewers questioning if he was mocking the Duke of Sussex, 39. Harry and his wife, Meghan Markle, moved away from the United Kingdom in 2020 after taking a step back as senior members of the royal family."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/uk/princess-of-wales-kate-middleton-uninterested-in-being-peacemaker-between-prince-harry-and-family-to-focus-on-herself-instead/articleshow/106300107.cms",
        "title": "Princess of Wales Kate Middleton uninterested in being &#39;peacemaker&#39; between Prince Harry and family; to focus on herself instead",
        "description": "Kinsey Schofield , speaking on GB News, expressed her belief that Middleton has been unfairly criticised, particularly by royal author Omid Scobie. Scobie&#39;s recent book, &#39;Endgame,&#39; released in November,"
    },
    {
        "url": "https://people.com/did-uk-prime-minister-rishi-sunak-snub-prince-harry-christmas-video-8420119",
        "title": "Did U.K. Prime Minister Rishi Sunak Snub Prince Harry in His Christmas Video?",
        "description": "U.K. Prime Minister Rishi Sunak released a joke video on Christmas, and some said he snubbed Prince Harry. Find out if it&#39;s referring to the Duke of Sussex or someone else."
    },
    {
        "url": "https://www.aol.com/lifestyle/11-strathberry-bags-royal-women-140000722.html",
        "title": "11 Strathberry Bags the Royal Women Love to Carry",
        "description": "Meghan Markle, Kate Middleton, and Zara Phillips are just some of the royals who give this luxury label their stamp of approval."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141978-prince-harry-meghan-markle-could-never-accept-king-charles-as-superior",
        "title": "Prince Harry, <b>Meghan Markle</b> &#39;could never accept&#39; King Charles as &#39;superior&#39;",
        "description": "Meghan Markle, Prince Harry &amp; Prince William and Kate Middleton have been compared in their approach towards obeying orders"
    },
    {
        "url": "https://www.yahoo.com/entertainment/sarah-fergusons-attendance-royal-family-135745722.html",
        "title": "Sarah Ferguson&#39;s Attendance at Royal Family Christmas Possibly Distracts From Prince Andrew&#39;s Issues",
        "description": "On Christmas Day, many royal fans were surprised to see Sarah Ferguson join the royal family on their annual walk to the Church of St. Mary Magdalene in Norfolk. The last time anyone has seen her with the royal family on their holiday tradition was 32 years ago."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/did-rishi-sunak-just-roast-prince-harry-for-calling-king-charles-on-christmas-101703587313156.html",
        "title": "Did Rishi Sunak just &#39;roast Prince Harry&#39; for calling King Charles on Christmas",
        "description": "Social media users said that the joke is in reference to Prince Harry and Meghan Markle being left off the invite list for the royal Christmas at Sandringham. One wrote on X (formerly Twitter), “Even Rishi, the UK’s Prime Minister roasts Prince Harry!”"
    },
    {
        "url": "https://people.com/kate-middleton-secret-strength-prepared-fight-8418412",
        "title": "Kate Middleton’s Secret Strength: &#39;She Is Prepared to Fight for What She Thinks Is Right&#39; (Exclusive)",
        "description": "Kate Middleton has a steely toughness behind the scenes as she supports her husband — and future king — Prince William. “She has this public image of being nice and smiley and, dare I say, innocuous,” royal author Valentine Low tells PEOPLE in this week&#39;s issue."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141956-prince-harry-meghan-markle-fail-to-convince-king-charles-prince-william",
        "title": "Prince Harry, <b>Meghan Markle</b> fail to convince King Charles, Prince William",
        "description": "Meghan Markle and Prince Harry&#39;s plan to reunite with King Charles and other members of the royal family have been ruined again as the US-based couple fail to convince senior royals after Omid Scobie&#39;s fresh drama."
    },
    {
        "url": "https://economictimes.indiatimes.com/magazines/panache/kate-middleton-to-focus-on-self-healing-princess-of-wales-uninterested-in-being-peacemaker-between-prince-harry-royal-family/articleshow/106296933.cms",
        "title": "Kate Middleton to focus on &#39;self healing&#39;? Princess of Wales uninterested in being &#39;peacemaker&#39; between Prince Harry &amp; royal family",
        "description": "Amidst the ongoing royal discord involving Prince William, Prince Harry, and Meghan Markle, Princess Kate Middleton finds herself the subject of controversy following claims made by royal author Omid Scobie in his book &#39;Endgame."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/does-meghan-markle-blame-the-royal-family-for-their-deals-drying-up-see-here-1267249",
        "title": "Does <b>Meghan Markle</b> blame the Royal Family for their deals drying up? See here",
        "description": "Prince Harry and Meghan Markle have been facing a lack of lucrative deals, an insider source reveal that it is due to a ‘vendetta’ against them by the Royal Family"
    },
    {
        "url": "https://www.jetss.com/entertainment/2023/12/sources-say-prince-harry-and-meghan-markle-believe-next-year-will-be-one-of-redemption/",
        "title": "Sources say Prince Harry and <b>Meghan Markle</b> believe next year will be one of redemption",
        "description": "Last Monday (25), according to the website US Weekly, close sources stated that Prince Harry and Meghan Markle believe that 2024 will be the year of redemption and a return for the couple. The information reports that the couple has been sought after by several vehicles with high demand."
    },
    {
        "url": "https://www.pinkvilla.com/sports/why-is-andrew-tate-not-allowed-to-visit-his-sick-mother-in-the-uk-1267559",
        "title": "Why is Andrew Tate not allowed to visit his sick mother in the UK?",
        "description": "The real reason why former kickboxing champion and controversial media icon Andrew Tate was not allowed to visit his sick mother in"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-say-first-christmas-royal-family-i-remember-so-vividly.html/",
        "title": "Here’s What <b>Meghan Markle</b> Had to Say About Her First Christmas With the Royal Family: ‘I Remember so Vividly’",
        "description": "Meghan Markle&#39;s first royal family Christmas happened in 2017. Here&#39;s what she remembers about it &#39;so vividly.&#39;"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harrys-frostbitten-penis-bed-070000903.html",
        "title": "Prince Harry&#39;s frostbitten penis, bed bugs galore and swine flus return: 2023 in memes",
        "description": "As the year draws to a close (the faster, the better tbh), we have a look back at 2023 - memes, news stories, royal drama and politics."
    },
    {
        "url": "https://www.arabtimesonline.com/news/from-scandal-to-strength-kate-middletons-journey-in-the-royal-spotlight/",
        "title": "From scandal to strength: Kate Middleton’s journey in the royal spotlight",
        "description": "Amidst recent allegations from Omid Scobie’s book, which described her as “cold” towards <b>Meghan Markle</b> and implicated her in conversations about Prince Archie’s skin color, Kate and Prince William maintained their composure. Despite the public ..."
    }
]