[
    {
        "url": "https://www.foxnews.com/entertainment/prince-harry-meghan-markle-expected-super-bowl-queen-camilla-update-king-charles-cancer",
        "title": "Prince Harry, <b>Meghan Markle</b> expected at Super Bowl; Queen Camilla gives update on King Charles&#39; cancer",
        "description": "The Fox News Entertainment newsletter brings you the latest Hollywood headlines, celebrity interviews and stories from Los Angeles and beyond."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13069409/meghan-markle-nicole-kidman-british-vogue-edward-enninful-final-cover.html",
        "title": "Why <b>Meghan Markle</b> and Nicole Kidman were missing from British Vogue and Edward Enninful&#39;s final cover that &#39;needed almost as much planning as D-Day&#39;",
        "description": "Who else but British Vogue editor-in-chief Edward Enninful could have persuaded Hollywood A-listers for what is hailed as one of the greatest magazine covers of all time."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markles-thoughtful-penmanship-revealed-32097156",
        "title": "<b>Meghan Markle</b>&#39;s thoughtful penmanship revealed in sweet thank you note written to artist",
        "description": "A sweet thank you note from <b>Meghan Markle</b> has been shared online after the Duchess of Sussex thanked an artist for her sketches. Artist Jennifer Vallez, who specialises in sketches of the royal family, has previously drawn out scenes of the couple ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-looks-confident-relaxed-32096845",
        "title": "<b>Meghan Markle</b> pictured alone in California after skipping Prince Harry&#39;s family reunion",
        "description": "Meghan Markle has been pictured driving alone in Santa Barbara, California, after skipping a visit to her sick father-in-law King Charles following his cancer diagnosis"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-faces-two-paths-32094755",
        "title": "Prince Harry faces &#39;two paths of pain&#39; amid his bitter feud with Royal Family",
        "description": "Prince Harry rushed back to the UK when it was announced his father King Charles had been diagnosed with cancer, with many believing it was the end of the royal feud"
    },
    {
        "url": "https://uk.style.yahoo.com/connecticut-artists-wound-meghan-markle-170000337.html",
        "title": "How a Connecticut Artist&#39;s Work Wound Up in <b>Meghan</b> and <b>Markle</b> and Prince Harry&#39;s Home Office: &#39;Simply Surreal&#39;",
        "description": "Artist and illustrator Jennifer Vallez tells PEOPLE how the couple&#39;s &#39;fairytale romance&#39; is a creative inspiration"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513128/king-charles-touched-enormously-prince-harry-visit-gesture/",
        "title": "Why the King was ‘enormously touched’ by Prince Harry’s trip to the UK",
        "description": "Royal fans were touched when - just hours after it was confirmed to the public that King Charles had been diagnosed with cancer - his son Prince Harry flew from California to London to see his dad during the troubling time."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067165/Prince-Harry-Meghan-Markle-Super-Bowl-Las-Vegas.html",
        "title": "Harry and <b>Meghan</b> &#39;WILL attend the Super Bowl&#39;: Duke of Sussex set to stay in Las Vegas after making no mention of cancer-stricken King Charles in gag-filled speech at NFL ...",
        "description": "The Duke of Sussex made a shock appearance at the NFL Honors awards night on Thursday, and Fox News now reports that he will be sticking around for the big game on Sunday night."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-wont-pleased-fathers-32094766",
        "title": "<b>Meghan Markle</b> &#39;won&#39;t be pleased&#39; with her father&#39;s unexpected message to King Charles",
        "description": "The relationship between Meghan and her father broke down after he staged paparazzi photos before she married Prince Harry in 2018."
    },
    {
        "url": "https://www.ok.co.uk/tv/celebrity-big-brother-start-date-32094069",
        "title": "Celebrity Big Brother start date confirmed as Kate Middleton&#39;s uncle among rumoured stars",
        "description": "Celebrity Big Brother will return to our screens very soon as rumoured stars going into the house include Love Island-royalty, Kate Middleton&#39;s uncle and RuPaul’s Drag Race star"
    },
    {
        "url": "https://www.telegraph.co.uk/books/what-to-read/review-ingrid-seward-my-mother-i-charles-queen-biography/",
        "title": "Take note, Omid Scobie – this is how you write a royal biography",
        "description": "My Mother and I, Ingrid Seward’s rich study of the King’s bond with the late Queen, is incisive, emotive and journalistically rigorous"
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fashion/valentines-day-jewellery-uniqlo-clare-waight-keller-b1138261.html",
        "title": "Your week in chic: from Valentine&#39;s jewellery treats to Uniqlo&#39;s next Clare Waight Keller drop",
        "description": "Ready to snap up some chic Valentine’s jewels and get the inside track on Clare Waight Keller’s next Uniqlo drop? Victoria Moss has the style news to know"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-accused-making-kings-28606930",
        "title": "Prince Harry accused of &#39;making King&#39;s cancer diagnosis all about him&#39;",
        "description": "Prince Harry has been accused of creating &#39;unnecessary drama&#39; and making The King&#39;s recent cancer diagnosis &#39;all about him&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1864794/meghan-markle-prince-harry-key-tactics",
        "title": "<b>Meghan Markle</b> adopts key tactic to get ‘reassurance’ from Prince Harry at events",
        "description": "During public events and front-facing occasions, <b>Meghan Markle</b> adopts a key tactic to get “reassurance” from Prince Harry, a dating coach and psychology expert has claimed. The Duke and Duchess of Sussex are “constantly holding hands” in public and ..."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/513140/i-tried-royal-beauty-tips-verdict/",
        "title": "I followed expert budget beauty tips on how to look like a royal for a week",
        "description": "Followers of the royal ladies will know that a natural makeup look comes with the territory. It is a look that the likes of the late Queen Elizabeth and Princess Diana perfected i"
    },
    {
        "url": "https://metro.co.uk/2024/02/10/ross-noble-if-make-enough-money-cant-cancelled-20247022/",
        "title": "Ross Noble: ‘If you make enough money, you can’t be cancelled’",
        "description": "One thing that isn’t too nuanced though, Ross thinks, is that if you’re making people enough money, you simply cannot be cancelled. ‘It’s amazing how quickly the whole concept of being cancelled disappears. That’s the aspect nobody talks about,’ he says."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/king-charles-health-updates-cancer-news/",
        "title": "Prince Harry updates — Duke and <b>Meghan</b> ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE William has been pictured for the first time since King Charles’ cancer diagnosis. The King, 75, has started treatment and was advised by doctors to cancel front line duties. The"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863742/meghan-markle-memoir-ex-royal-book",
        "title": "<b>Meghan Markle</b> warned she must &#39;play memoir right&#39; to avoid being seen as &#39;whiny ex-royal&#39;",
        "description": "EXCLUSIVE: Meghan Markle should avoid attacking the Royal Family in her anticipated memoir to turn her public image around, a PR expert has claimed."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-to-resume-royal-28604570",
        "title": "Prince Harry &#39;to resume Royal duties&#39; in 2024 after brief King Charles visit",
        "description": "Prince Harry could be set to resume his senior Royal duties in 2024 after his brief visit to King Charles earlier this week, according to the latest odds"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25845837/prince-harry-meghan-markle-super-bowl-king-charles/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> ‘WILL attend Super Bowl in Las Vegas’ this weekend after duke dashed to UK to see Charles",
        "description": "PRINCE Harry and Meghan Markle will attend the Super Bowl this weekend, sources claim. The Sussexes are rumoured to be attending the famous sporting event following Harry’s appearance at the"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-line-of-succession-charles-william-b2494002.html",
        "title": "British line of succession: Who is next heir to the throne as Charles diagnosed with cancer",
        "description": "His wife, <b>Meghan Markle</b>, is not in line for the throne - much like the Duchess of Cambridge - but their two children are. Four-year-old Archie Mountbatten-Windsor, the Duke and Duchess of Sussex’s first child, is sixth in line to the throne after his ..."
    },
    {
        "url": "https://pagesix.com/2024/02/10/entertainment/prince-harry-and-meghan-markle-to-skip-super-bowl-ahead-of-canada-trip/",
        "title": "Prince Harry and <b>Meghan Markle</b> to skip Super Bowl ahead of Canada trip",
        "description": "The Duke of Sussex has struck up a friendship with NFL commissioner Roger Goodell -— but Harry and the Duchess of Sussex won’t be at the Super Bowl."
    },
    {
        "url": "https://www.yahoo.com/entertainment/tom-cruises-ties-british-royal-202138505.html",
        "title": "All of Tom Cruise&#39;s Ties to the British Royal Family Members",
        "description": "More often than you think, Hollywood and the Royals end up mixing together ( and we’re not just talking about how Prince Harry and <b>Meghan Markle</b> moved to California and started working for big studios). No, we’re talking about how some a-listers end up ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-must-realise-hes-32096417",
        "title": "Prince Harry &#39;must realise he&#39;s not a baby and apologise&#39; to family&#39;, says royal expert",
        "description": "Following his mere 25 hours in the UK visiting King Charles after his shock cancer diagnosis, a royal expert has said Prince Harry should &quot;apologise&quot; to his father and brother"
    },
    {
        "url": "https://www.vanityfair.com/style/taylor-swift-travis-kelce-super-bowl-prince-harry-meghan-markle",
        "title": "Taylor Swift Departs Japan for Super Bowl, but Where Will She Park?",
        "description": "As the singer begins her 12-hour flight to Las Vegas, a possible Super Bowl appearance from Prince Harry and Meghan Markle threatens to overshadow Swift and boyfriend Travis Kelce."
    },
    {
        "url": "https://www.timesnownews.com/lifestyle/people/love-interrupted-john-lennon-and-yoko-onos-all-consuming-love-article-107564386",
        "title": "Love Interrupted: John Lennon And Yoko Ono&#39;s All-Consuming Love",
        "description": "Read More: Prince Harry and <b>Meghan Markle</b>, A Love That Survived The Society&#39;s Wrath Lennon and Yoko married in Gibraltar on March 20, 1969. The press was at their heels, and their relationship didn&#39;t go down well because Lennon was a married man when he ..."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/will-the-sports-loving-meghan-markle-and-prince-harry-be-at-the-super-bowl/",
        "title": "Will the sports-loving <b>Meghan Markle</b> and Prince Harry be at the Super Bowl?",
        "description": "The Super Bowl is this weekend, and fans want to know if the sports-loving Meghan Markle and Prince Harry will attend."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-next-152400068.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>’s Next Alleged Ultra-Public Appearance Will Be a First for Them as a Couple",
        "description": "After nearly a decade together, Meghan Markle and Prince Harry still have plenty of firsts together. They’ve done so much together, like traveling the world, doing projects together, and even welcoming multiple children;"
    },
    {
        "url": "https://www.foxnews.com/opinion/god-save-king-illness-harry-meghan",
        "title": "God save the king from illness, and from Harry and <b>Meghan</b>",
        "description": "King Charles III is ill and that can either be a great chance for family reconciliation or another awful opportunity for Harry and Meghan to inflict themselves on the royals."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156373-meghan-markles-reason-of-absence-from-popular-magazine-cover-laid-bare",
        "title": "<b>Meghan Markle</b>&#39;s reason of absence from popular magazine cover laid bare",
        "description": "Meghan Markle did not make it to British Vogue&#39;s 40 &#39;powerful women&#39; cover because her popularity dropped in recent times, claimed a PR expert.In a conversation with The Mirror, PR guru"
    },
    {
        "url": "https://www.btimesonline.com/articles/163890/20240210/prince-harry-and-meghan-markles-montecito-estate-reportedly-under-threat.htm",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Montecito Estate Reportedly Under Threat",
        "description": "Prince Harry and <b>Meghan Markle</b> are facing heightened security concerns at their Montecito estate in California following a series of burglaries in their upscale neighborhood, Business Times has learned. The couple, who made a surprise appearance at the ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royal-expert-reveals-prince-william-kate-middleton-need-rebrand-harry-meghan.html/",
        "title": "Royal Expert Reveals Why Prince William and Kate Middleton Need a ‘Rebrand’ Just as Much as Harry and <b>Meghan</b>",
        "description": "Prince William and Kate Middleton are more popular in the UK than ever, but expert still thinks they could use a rebrand."
    },
    {
        "url": "https://www.augustman.com/my/entertainment/film-tv/suits-tv-series-cast-members-then-and-now-meghan-markle-patrick-j-adams-gabriel-macht-sarah-rafferty-gina-torres/",
        "title": "The Cast Of The TV Series ‘Suits’: Where Are They Now?",
        "description": "Suits is a hit American TV series which began airing on USA Network on 23 June 2011. Today, Suits is most recognised as the show starring <b>Meghan Markle</b> as part of its cast, who is now a member of the British royal family as the Duchess of Sussex."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markles-slow-progress-netflix-projects-actually-good-sign.html/",
        "title": "Prince Harry and <b>Meghan Markle</b>’s Slow Progress on Netflix Projects Could Actually Be a Good Sign",
        "description": "Prince Harry and Meghan Markle inked a five-year contract with Netflix and haven&#39;t premiered a project with the streamer since summer 2023."
    },
    {
        "url": "https://radaronline.com/p/british-thrones-line-of-succession-whos-next-if-king-charles-dies/",
        "title": "Who&#39;s Next After King Charles? Meet the First 20 Royals in the Line for the Throne",
        "description": "When King Charles ascended to the throne after Queen Elizabeth II died, the royal family members following him in the line of succession also took a step up."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156294-meghan-markle-prince-harry-to-attend-super-bowl-amid-duchess-ad-snub",
        "title": "<b>Meghan Markle</b>, Prince Harry to attend Super Bowl after duchess&#39; ad snub",
        "description": "Meghan Markle is expected to join Prince Harry in Las Vegas from where they will head together to Allegiant Stadium to attend the Super Bowl. The news was reported by Fox News Digital shortly"
    },
    {
        "url": "https://abc7chicago.com/prince-harry-news-meghan-markle-mirror-group-hacking/14405120/",
        "title": "Prince Harry settles case against UK tabloid publisher that hacked his phone",
        "description": "A British newspaper publisher has agreed to pay Prince Harry a &quot;substantial&quot; sum in costs and damages for invading his privacy with phone hacking and other illegal snooping, Harry&#39;s lawyer said Friday."
    },
    {
        "url": "https://www.panasiabiz.com/83896/super-bowl-lviii-prince-harry-and-meghan-headed-to-super-bowl-in-las-vegas/",
        "title": "Super Bowl LVIII: Prince Harry and <b>Meghan</b> Headed to Super Bowl in Las Vegas",
        "description": "The game kicks off on February 11th, 2024. On Sunday, February 12, Prince Harry will attend the big game with his wife, <b>Meghan Markle</b>, according to Fox News. This follows his whirlwind trip to London earlier this week, where he briefly visited his father ..."
    },
    {
        "url": "https://thestarphoenix.com/entertainment/celebrity/meghan-markle-suits-spin-off",
        "title": "<b>Meghan Markle</b> reportedly &#39;won&#39;t appear in Suits spin-off&#39;",
        "description": "An insider told Dailymail.co.uk: “<b>Meghan</b> was clear that she didn’t want to be involved as an actor.” The report also stated <b>Markle</b> and Prince Harry’s Archewell production company won’t be involved in the new ‘Suits’ series either. <b>Markle</b> ..."
    },
    {
        "url": "https://sg.yahoo.com/style/prince-harry-leaves-london-24-154800098.html",
        "title": "Prince Harry Leaves London, 24 Hours After Arriving",
        "description": "Multiple outlets have reported that Harry stayed in a hotel last night, rather than a royal residence. (He and <b>Meghan Markle</b> moved out of their Frogmore Cottage home last year at the request of the King.) Yesterday, Prince Harry spent around 30 to 45 ..."
    },
    {
        "url": "https://www.gulftoday.ae/opinion/2024/02/10/harry-says-piers-morgan-knew-about-phone-hacking-at-mirror",
        "title": "Harry says Piers Morgan knew about phone hacking at Mirror",
        "description": "The siblings have endured a well-publicised fractured relationship in recent years, following Harry and his wife <b>Meghan Markle</b>’s decision to step back as senior royals in January 2020 and leave for the US. In the wake of the move, multiple grievances ..."
    }
]