[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/everything-meghan-markle-said-royal-31745219",
        "title": "Everything <b>Meghan Markle</b> said about Royal Christmas before claim she&#39;ll &#39;never return&#39;",
        "description": "The Duchess of Sussex was invited to spend Christmas with the Royal family in 2017 and 2018, and she excitedly told her mum back in the US about the experience"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848916/prince-harry-meghan-markle-christmas-2024-redemption",
        "title": "Prince Harry and <b>Meghan Markle</b> set for &#39;lonely Christmas&#39; before 2024 &#39;year of redemption&#39;",
        "description": "A royal commentator claimed there &quot;won&#39;t be much laughter&quot; in their Montecito home following their &quot;chaotic&quot; year."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12898221/King-Charles-Queen-Camilla-joined-Princess-Anne-Sir-Timothy-Laurence-Christmas-Eve-church-service-Sandringham.html",
        "title": "King Charles and Queen Camilla are joined by right-hand man Major Johnny Thompson and Anne at Sandringham before William and Kate tomorrow... while Harry and <b>Meghan</b> stay away again",
        "description": "King Charles offered a wave to well-wishers at Sandringham this morning as the royal family&#39;s Christmas kicked off in earnest."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898235/Meghan-Markle-royal-racists-identity-questioned-oath-Samantha-Markle-lawsuit.html",
        "title": "<b>Meghan Markle</b> &#39;could be questioned under oath about the identity of the &quot;royal racists&quot; who had &quot;concerns&quot; about Archie&#39;s skin colour&#39; - as sister Samantha&#39;s pursues libel ...",
        "description": "The Duchess of Sussex , who lives in the United States with her husband Prince Harry , could be questioned about &#39;family matters&#39; as part of a lawsuit against her."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25152079/royal-racism-row-meghan-quizz-oath-archie/",
        "title": "Twist in ‘royal racism’ row as <b>Meghan Markle</b> could be quizzed under oath about ‘Archie’s skin colour’ claim",
        "description": "THE Duchess of Sussex could be questioned under oath about the identity of the so-called “royal racists”. Lawyers want to quiz Meghan over “family matters” as part of sister Samantha Markle’s"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848894/meghan-markle-prince-harry-california-royal-family",
        "title": "<b>Meghan Markle</b> has &#39;failed&#39; in bid to find new role and make lots of money, expert claims",
        "description": "Meghan Markle is still to find her role, despite Prince Harry seemingly finding his, according to royal expert Matt Wilkinson, who added that the past 12 months have been a &quot;real rollercoaster&quot; for the couple."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/jess-impiazzi-dumps-jermaine-pennant-31743699",
        "title": "Jess Impiazzi dumps Jermaine Pennant as he denies cheating with dominatrix on stag do",
        "description": "Jermaine Pennant, who previously admitted being unfaithful to the &#39;majority&#39; of his girlfriends, has reportedly been told it&#39;s over by furious Jess Impiazzi over stag do claims"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25094257/queen-corgis-maul-present-meghan-markle-christmas/",
        "title": "Queen’s corgis ‘mauled Christmas present given to her by <b>Meghan Markle</b>’ after duchess chose ‘bizarre’ gift",
        "description": "THE Queen’s corgis mauled a Christmas present gifted to her by Meghan Markle, it has been claimed. The Duchess of Sussex gifted a “bizarre” hamster toy to the Queen in 2017 during Meghan’s"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/king-charles-breaks-royal-tradition-162255240.html",
        "title": "King Charles Breaks Royal Tradition with His Christmas Day Message",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! Ahead of the address hitting televisions across the U.K. and beyond, King Charles and Queen Camilla ..."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/king-charles-new-ideas-family-8995828",
        "title": "King Charles has new ideas for the family Christmas now he is in charge",
        "description": "The royals traditionally celebrate Christmas at Sandringham, with the senior members of the family from King Charles to Prince Louis attending church in the morning. However there will be some changes to the traditional Royal family Christmas, as King Charles has new ideas for the Christmas menu, as well as the guest list."
    },
    {
        "url": "https://metro.co.uk/2023/12/24/meghan-markle-quizzed-under-oath-royal-racism-row-20021382/?ico=trending-module_author_sarah-hooper_item-0",
        "title": "<b>Meghan Markle</b> could be quizzed ‘under oath’ over Royal racism row",
        "description": "Family matters&#39; could be part of the court case brought forth by Meghan&#39;s sister, according to lawyer Peter Ticktin."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510028/meghan-markles-prince-archie-christmas-gift-from-late-queen/",
        "title": "Prince Harry and <b>Meghan</b>&#39;s son Prince Archie received the sweetest Christmas gift from late Queen",
        "description": "The couple, who last spent the festive period in Sandringham back in 2018, tend to keep their children away from the limelight. But over the years, have offered small glimpses – including the sweet Christmas gift little Archie received from the late Queen ."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-christmas-world-away-harry-31700503",
        "title": "&#39;Royal Christmas a world away from Harry and <b>Meghan</b>&#39;s Californian life&#39;, says ex-chef",
        "description": "The Duke and Duchess of Sussex are expected to spend Christmas with their two children in California - with royal experts reflecting on how Harry will have adapted to spending the holidays differently"
    },
    {
        "url": "https://news.sky.com/story/amp/2023s-best-funniest-and-most-wtf-moments-13030106",
        "title": "2023&#39;s best, funniest and most WTF moments",
        "description": "Remember when that composer at the coronation had to come out and say he wasn&#39;t <b>Meghan Markle</b> in disguise? Well, 2023 was full of hilarious, jaw-dropping and laugh-out-loud moments just like that. We&#39;ve rounded up some of our favourites. Harry&#39;s virginity ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/christmas-royal-family-card-best-worst-b2469018.html",
        "title": "The best (and worst) royal Christmas cards of all time",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-george-charlotte-louis-super-120446880.html",
        "title": "Prince George, Charlotte and Louis have a super-sweet nickname for this relative",
        "description": "And the Royals still use the nickname even after the death of the Queen last year. In Harry’s memoir Spare, released this year, he recalled a moment when <b>Meghan Markle</b> bought a bauble with the Queen’s face on, before Prince Archie knocked it over."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harrys-attacks-press-misguided-134218084.html",
        "title": "Prince Harry&#39;s attacks on the press are &#39;misguided&#39; and &#39;paranoid&#39;, Nicholas Witchell says",
        "description": "Nicholas Witchell, who is retiring after 48 years at the corporation, said that the Prince and <b>Meghan Markle</b> are “overly sensitive” and as public figures who “make use of the media” they should be “more prepared to take the knocks with the ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509981/prince-harry-unexpected-christmas-gifts-left-staff-feeling-guilty/",
        "title": "Prince Harry&#39;s unexpected Christmas gifts that left staff feeling &#39;guilty&#39;",
        "description": "Prince Harry revealed he managed to organise two sentimental Christmas gifts for staff moments before officially stepping back as a senior member of the royal family."
    },
    {
        "url": "https://uk.yahoo.com/news/kate-middleton-attends-surprise-christmas-194600866.html",
        "title": "Kate Middleton Attends Surprise Christmas Tea Party in Sneak Peek of Carol Concert Broadcast",
        "description": "Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! “She has a lot of empathy and compassion. I think she doesn’t take her life for granted,&quot; Byrne ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markle-missed-31742164",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;missed off&#39; King Charles&#39; Christmas tradition",
        "description": "Prince Harry and <b>Meghan Markle</b> &quot;might not be included&quot; in King Charles III&#39;s Christmas tradition, according to reports. The Duke and Duchess of Sussex, who stepped down as senior royals in 2020 and moved to the States, have rarely returned to the UK since ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-deliberately-distancing-herself-31733501?int_source=nba",
        "title": "<b>Meghan Markle</b> &#39;deliberately distancing&#39; herself from Prince Harry may &#39;pay off&#39; next year - expert",
        "description": "<b>Meghan Markle</b>&#39;s deliberate ploy to distance herself from Prince Harry may be about to pay off, according to an expert. Over the course of 2023, the couple have been increasingly keeping their public lives and careers separate, making more solo appearances ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-lets-slip-what-31701518?int_source=nba",
        "title": "<b>Meghan Markle</b> lets slip what Archie wants for Christmas - and why he won&#39;t be getting it",
        "description": "During an appearance with her photographer friend Misan Harriman, <b>Meghan Markle</b> revealed a gift Prince Archie would want on his Christmas list - but she&#39;s not so sure if he will get one <b>Meghan Markle</b> has revealed what son Archie would like for Christmas ..."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/meghan-markle-could-be-questioned-under-oath-about-royal-racism-saga-in-samantha-markles-libel-suit/EK5NAEVLOFDNDJKI2TEPUR2R7M/",
        "title": "<b>Meghan Markle</b> could be questioned under oath about ‘royal racism’ saga in Samantha <b>Markle</b>’s libel suit",
        "description": "A main claim Samantha disputes is that Meghan grew up an only child. She is also fighting back against a claim that she changed her last name back to Markle after the Duke and Duchess of Sussex began dating."
    },
    {
        "url": "https://www.theaustralian.com.au/news/two-mikes-and-a-bill-christmas-excitement-eagles-and-meghan-markle/video/e729ac1daec6fbf40c23bcb84a2776ed",
        "title": "Two Mikes and a Bill: Christmas excitement; Eagles; and <b>Meghan Markle</b>",
        "description": "FOX 29&#39;s Mike Jerrick, Mike Greenidge and Bill Anderson get together on Christmas Eve to talk excitement around the holidays, the Eagles Christmas Day game against the Giants, and Meghan Markle&#39;s newest acting role."
    },
    {
        "url": "https://www.thedailybeast.com/prince-andrew-totally-tormented-over-publication-of-epstein-names",
        "title": "Prince Andrew ‘Totally Tormented’ Over Publication of Epstein Names",
        "description": "Plus, King Charles’ Christmas Day broadcast will reportedly have an eco-focus, while Harry and Meghan hope for a year of “redemption,” and “healing” with the royal family."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/king-charles-worried-about-how-other-royals-detest-prince-harry-meghan-markle-101703341464187.html",
        "title": "King Charles ‘worried’ about how other royals detest Prince Harry-<b>Meghan Markle</b>",
        "description": "Prince Harry and <b>Meghan Markle</b> have not been invited to Sandringham by the royal family for Christmas celebrations, it was reported. This comes after relations between the Sussexes and the royal family deteriorated this year following the release of Prince ..."
    },
    {
        "url": "https://ca.news.yahoo.com/prince-harrys-attacks-press-misguided-134218084.html",
        "title": "Prince Harry&#39;s attacks on the press are &#39;misguided&#39; and &#39;paranoid&#39;, Nicholas Witchell says",
        "description": "Prince Harry’s attacks on the press are “paranoid” and “misguided” and he is “unhealthily obsessed” with the way that he is portrayed, the BBC’s royal correspondent has said."
    },
    {
        "url": "https://uk.news.yahoo.com/gallery-royals-meet-babies-dogs-132147471.html",
        "title": "GALLERY: Royals meet babies and dogs on way to Sandringham Christmas Eve service",
        "description": "King Charles, Queen Camilla, Anne Princess Royal and Vice Admiral Sir Timothy Laurence attended a Sunday church service at St Mary Magdalene Church on Christmas Eve."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898125/meghan-markle-patient-aides-oprah-interview-bbc-royal-correspondant-nicholas-witchell-says.html",
        "title": "BBC royal correspondent Nicholas Witchell says <b>Meghan</b> should have been &#39;less impatient&#39; with royal aides who &#39;bent over backwards&#39; to support her - and dismisses Oprah ...",
        "description": "He rejected the idea that the Palace was against them from the start and praised the Sussexes&#39; team of courtiers which included Samantha Cohen, Jason Knauf and Sara Latham."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141401-prince-harry-meghan-markle-motive-to-be-with-royal-family-laid-bare",
        "title": "Prince Harry, <b>Meghan Markle</b> motive to be with Royal family laid bare",
        "description": "During this festive season, Prince Harry and Meghan Markle have come under fire for allegedly attempting to make amends with the Royal family for &quot;commercial gains.&quot;"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141381-meghan-markle-spreads-christmas-cheer-with-a-kind-hearted-gesture",
        "title": "<b>Meghan Markle</b> spreads Christmas cheer with a kind-hearted gesture",
        "description": "Meghan Markle recently made headlines for all the good reasons as the Duchess of Sussex made a generous donation to the non-profit organisation TrebeCafé in Germany as a pre-Christmas gift. As per Mirror, the former Suits actress signed a cheque worth €4,600 for the charitable institute which provides shelters to needy young women."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/meghan-markles-red-cape-dress-ultimate-outfit-inspiration-for-party-season/",
        "title": "<b>Meghan Markle</b>’s red cape dress is the ultimate outfit inspiration for party season",
        "description": "Recreate Meghan&#39;s stunning and sophisticated look with the Safiyaa&#39;s Kalika Scarlet Red Long Dress. The piece is sure to turn heads as it features a raised collar and sleek shoulder cape as well as an exaggerated back drape detail."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/real-reason-king-charles-relieved-harry-meghan-arent-coming-to-uk-for-christmas-not-what-you-think/",
        "title": "The real reason King Charles is ‘relieved’ Prince Harry and <b>Meghan Markle</b> aren’t coming to the UK for Christmas - and it’s not what you think",
        "description": "A royal expert has shared the reason why they believe King Charles will be ‘relieved’ that Prince Harry and Meghan Markle are not coming to visit the royals in the UK for Christmas this year and it’s surprisingly sweet."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-could-be-questioned-under-oath-about-royal-racism-saga/news-story/e9b94a8aef0c432168d3fc6bb854d490",
        "title": "<b>Meghan Markle</b> could be questioned under oath about ‘royal racism’ saga",
        "description": "The Duchess of Sussex could be questioned under oath about the identity of the so-called “royal racists”. Lawyers want to quiz Meghan over “family matters” as part of sister Samantha Markle’s libel action against her in the US."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/harry-meghan-christmas-plans-california-b2469020.html",
        "title": "How Harry and <b>Meghan</b> will spend Christmas this year",
        "description": "It is unlikely the Sussexes will fly back to the UK to spend Christmas at Sandringham this year, delaying any chance of a royal reconciliation"
    },
    {
        "url": "https://www.irishtimes.com/culture/tv-radio/review/2023/12/24/podcasts-of-2023-quality-audio-wins-out-but-some-behemoths-have-made-devastating-cuts/",
        "title": "Podcasts of 2023: Quality audio wins out - but some behemoths have made devastating cuts",
        "description": "Podcasting is still growing, with global listenership up year-on-year, but a plethora of entry-level pandemic-era podcasts have bowed out"
    },
    {
        "url": "https://nypost.com/2023/12/23/entertainment/heres-what-prince-william-is-giving-kate-middleton-for-christmas-royal-butler/",
        "title": "This is the luxury gift Prince William is giving Kate Middleton for Christmas: royal butler",
        "description": "Kate Middleton will be watch-ing out for a luxury Christmas gift from Prince William. The Princess of Wales is likely to receive a new timepiece or some jewelry from her husband this festive season, King Charles’ former butler Grant Harrold believes."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-felt-unloved-unappreciated-royal-family-christmas-way-meghan-markle.html/",
        "title": "Prince Harry Felt ‘Unloved’ and ‘Unappreciated’ at This Royal Family Christmas Way Before <b>Meghan Markle</b>",
        "description": "For that reason, there were only copies of a drafted statement detailing Harry and <b>Meghan</b>’s full exit from royal life, not any of the other discussed “options.” So Harry set out to prove the “summit was just [for] show” by seeing the printer for ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/meghan-markle-could-be-quizzed-over-royal-racists-row/news-story/6f9dc3d26e5182ed82c97a8f3172dba6",
        "title": "<b>Meghan Markle</b> could be quizzed over ‘royal racists’ row",
        "description": "<b>Meghan Markle</b>, pictured with Archie, has claimed members of the royal family commented on Archie’s skin colour. Picture: AFP “She doesn’t care if she destroys the monarchy.” Mr Ticktin said Ms <b>Markle</b>’s lawyers were “stonewalling” their ..."
    },
    {
        "url": "https://www.outlookindia.com/international/us/british-royal-christmas-2023-unwrapping-traditions-and-turmoil-news-338317",
        "title": "British Royal Christmas 2023: Unwrapping Traditions and Turmoil",
        "description": "This Christmas emerges as a chapter of transformation in the British Royal family. Amidst tensions and transitions, the Windsors prepare to navigate the festive season, crafting a narrative that intertwines the old and the new."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-and-kate-middleton-feud-deepens-over-christmas-day/news-story/2ae06465cbd871b041c4387c62834189",
        "title": "<b>Meghan Markle</b> and Kate Middleton feud deepens over Christmas Day",
        "description": "Strangely it’s proving hard for William and Kate to miraculously forget having been repeatedly thrown under the (double decker) bus by the Sussexes and over the course of years and all done across multiple forms of media including streaming, broadcast TV and print – and all in front of a global audience."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/did-catch-hidden-message-prince-223205817.html",
        "title": "Did You Catch the Hidden Message In Prince Harry and <b>Meghan Markle</b>’s Holiday Card?",
        "description": "It’s Tuesday afternoon—let’s overanalyze the Sussex holiday card, shall we? Cool. Prince Harry and <b>Meghan Markle</b> chose a photo from September and the Invictus Games in Dusseldorf, Germany—specifically the closing ceremony of the Games—as their ..."
    },
    {
        "url": "https://sg.style.yahoo.com/prince-harry-meghan-markle-reportedly-200535481.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Reportedly Blame “A Vendetta Being Waged Against Them” for Career Disappointments",
        "description": "It is a bit of respite in a season of rough waters for both Harry and <b>Meghan Markle</b>, who, Deadline reports, are reportedly complaining that their “string of failed projects and brand partnerships” have led them to believe that there is “a vendetta be ..."
    }
]