[
    {
        "url": "https://hollywoodlife.com/2024/02/17/prince-harry-gushes-children-archie-lilibet-fatherhood-comments-interview-video/",
        "title": "Prince Harry Gushes Over Children Archie, 4, and Lilibet, 2, in Rare Comments About Fatherhood: They ‘Make Us Laugh’",
        "description": "The Duke of Sussex revealed his kids, who he shares with wife Meghan Markle, are ‘growing up fast,’ in the new interview."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-wore-125k-necklace-32151455",
        "title": "<b>Meghan Markle</b> wore £12.5k necklace as she and Harry close Canada trip at glam banquet",
        "description": "The Duchess of Sussex finished off her evening look for her final public appearance at the Invictus Games One Year to Go Dinner by accessorising with a diamond tennis necklace"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-wore-thing-sentaler-220650676.html",
        "title": "<b>Meghan Markle</b> Wore a Thing: Sentaler Cape Coat Edition",
        "description": "Meghan Markle is continuing her week of chic Canada-ready coats while she&#39;s in town for the Invictus Games One Year To Go Winter Training Camp in Vancouver with her husband, Prince Harry. Photo&amp;colon;"
    },
    {
        "url": "https://www.hellomagazine.com/fashion/513699/melissa-mccarthy-53-wows-fans-in-incredible-sequin-bodysuit-see-the-photo/",
        "title": "Melissa McCarthy, 53, wows fans in incredible sequin bodysuit - see the photo",
        "description": "Melissa McCarthy is the moment! The comedian made her debut on RuPaul&#39;s Drag Race on Friday February 16, and dressed for the occasion as she hosted a viewing party, wearing a stunning silver sequin bodysuit that highlighted her gorgeous curves. She accessorized with a silver chain belt and what appeared to be a hot pink sequin shawl."
    },
    {
        "url": "https://metro.co.uk/2024/02/17/prince-harrys-rumoured-royal-return-swiftly-ruled-out-palace-20299681/?ico=trending-module_category_uk_item-0",
        "title": "Prince Harry’s rumoured royal return swiftly ‘ruled out’ by the Palace",
        "description": "Prince Harry, Duke of Sussex and <b>Meghan Markle</b> attending the final day of the One Year to Go Event before the Invictus Games Vancouver Whistler 2025 (Picture: Shutterstock) Gesturing towards Invictus competitors, Harry added: ‘Throughout all these ..."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-shares-latest-thoughts-on-potentially-becoming-a-us-citizen_n_65d0cd81e4b0f7fbe7b2d093",
        "title": "Prince Harry Shares Latest Thoughts On Potentially Becoming A U.S. Citizen",
        "description": "The Duke of Sussex and wife Meghan Markle have been living stateside since their famous split with the British royal family in 2020."
    },
    {
        "url": "https://metro.co.uk/2024/02/17/prince-harrys-rumoured-royal-return-swiftly-ruled-out-palace-20299681/?ico=trending-post-strip_item_1",
        "title": "‘No way back’ for Harry as rumoured royal return swiftly ‘ruled out’",
        "description": "Reports on Saturday suggested the Duke of Sussex had told pals he would consider a temporary return to the firm (Picture: Reuters) Prince Harry’s rumoured willingness to step back into royal life with a working role while his father the King is ill has already been ruled out by Buckingham Palace,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-downs-cocktails-shares-32150430",
        "title": "<b>Meghan Markle</b> downs cocktails and shares favourite food on &#39;spicy&#39; date with Harry and Michael Bublé",
        "description": "Prince Harry and Meghan Markle joined Michael Bublé and his wife Luisana Lopilato for dinner at a Vancouver hotspot, where they enjoyed various dishes alongside gin and tonics and cocktails"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13095485/harry-meghan-california-home-canada-visit-royal-duties-rumors.html",
        "title": "Flying high! Eco-warriors Harry and <b>Meghan</b> are seen jetting home to California after whirlwind Canadian visit - amid rumors prince may resume royal duties",
        "description": "Prince Harry and Meghan Markle have jetted home to California following a Canadian send off. The couple were seen boarding the Bombardier Execujet charter plane"
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/meghan-markle-new-podcast",
        "title": "<b>Meghan Markle</b> will be creating and hosting a brand new podcast",
        "description": "Yes, following her split from Spotify, Meghan Markle has now joined forces with Lemonada. And it is here that she will now house her record-breaking &#39;Archetypes&#39; podcast, which will be &quot;available to stream on all audio platforms for the first time this Spring&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-know-theyve-32150630",
        "title": "Prince Harry and <b>Meghan</b> &#39;know they&#39;ve gone too far&#39; and &#39;want reconciliation&#39; with Royals",
        "description": "Prince Harry and Meghan Markle aware they have &quot;went too far&quot; with their attacks on the Royal Family and seem to be looking for &quot;some sort of reconciliation&quot;, according to a PR expert. The Duke and Duchess of Sussex have not held back on their digs at the monarchy since stepping down as working royals in 2020 and moving to the US."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-might-return-royal-170029002.html",
        "title": "Prince Harry Might Return to Royal Duties Amid King Charles&#39;s Cancer Diagnosis",
        "description": "It&#39;s been four years since Prince Harry and Meghan Markle officially stepped back as working members of the royal family, but according to a new report, the Duke of Sussex could come back to reprise his role — temporarily, at least."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867867/meghan-markle-hollywood-bosses-suits-spin-off",
        "title": "<b>Meghan Markle</b> leaves Hollywood bosses &#39;dumbfounded&#39; as she turns down &#39;golden opportunity&#39;",
        "description": "EXCLUSIVE: Meghan Markle was tipped for a huge return to acting - but sources have claimed she has turned down as massive chance."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-interview-king-charles-cancer-news-b2497962.html",
        "title": "Prince Harry interview - live: Duke hints at royal reconciliation amid reports he ‘wants new role’",
        "description": "Prince Harry has said living in the US is “amazing - I love every single day” but stopped short of pledging allegiance to the star-spangled banner in a revealing interview. The duke spoke to Good Morning America reporter Will Reeve about King Charles’s shock cancer diagnosis, family life as well as his thoughts on becoming an American citizen."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/2/",
        "title": "Prince Harry updates — ‘Uncomfortable’ Duke breaks silence on King’s cancer battle in Good Morning America interview",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867830/meghan-markle-feminist-gb-news-angela-levin",
        "title": "<b>Meghan Markle</b> savaged as expert fumes Duchess of Sussex &#39;is not a feminist&#39;",
        "description": "Meghan Markle was savaged by a royal expert who accused her of lacking compassion an claimed she is &#39;not a feminist&#39;"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-prince-harry-had-160303789.html",
        "title": "<b>Meghan Markle</b>, Prince Harry Had ‘Magical’ Date with Michael Bublé and Wife at Canada Restaurant (Exclusive)",
        "description": "<b>Meghan Markle</b> and Prince Harry were &quot;extremely friendly&quot; during a &quot;fun&quot; double date with Michael Bublé and his wife, Luisana Lopilato, according to Chef Vikram Vij of Vij’s in Vancouver, Canada. The restaurateur spoke with PEOPLE about the Duke and ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-slammed-branding-herself-32148652",
        "title": "<b>Meghan Markle</b> slammed for branding herself &#39;one of the most influential women&#39;",
        "description": "Meghan Markle has been criticised after referring to herself as one of the &quot;most influential women in the world&quot; on the new Sussex website. The Sussex.com website which is titled &quot;The Office of Prince Harry &amp; Meghan, The Duke &amp; Duchess of Sussex&quot;, says it aims to shape the future &quot;through business and philanthropy&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13074835/What-went-wrong-Meghan-Markle-Suits-stars-invited-fairytale-wedding-Prince-Harry-2018-zero-communication-admit-dont-number.html",
        "title": "What went wrong between <b>Meghan Markle</b> and her Suits co-stars? They were all invited to her fairytale wedding to Prince Harry in 2018 but now have &#39;zero communication&#39; and admit ...",
        "description": "Flashback to 2018, and <b>Meghan Markle</b>&#39;s co-stars were all invited to her fairytale wedding to Prince Harry in Windsor, with the likes of Patrick J. Adams, Gina Torres and Sarah Rafferty mixing with A-listers and royalty. Yet lately, when the actors ..."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markles-off-shoulder-gown-160230660.html",
        "title": "<b>Meghan Markle</b>&#39;s Off-the-Shoulder Gown Is a Sophisticated Alternative to the Cutout Trend",
        "description": "Don&#39;t underestimate the power of the collarbone. Getty The Invictus Games may be Prince Harry&#39;s thing, but during this week&#39;s countdown celebrations in Canada, <b>Meghan Markle</b> stole the show with her slew of amazing looks. First, she kicked off the couple&#39;s ..."
    },
    {
        "url": "https://www.hellomagazine.com/shopping/513627/meghan-markle-bottega-drop-earrings-amazon-lookalike/",
        "title": "Loved <b>Meghan Markle</b>&#39;s Bottega earrings? I tried the viral Amazon pair and they look so expensive",
        "description": "Read our full commerce guidelines here. From her smart blazers to her glam evening dresses, <b>Meghan Markle</b>&#39;s luxurious sense of style never fails to have us swooning, and one thing that stays consistent no matter what the Duchess wears is her gorgeous ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-william-wont-harry-back-28654449",
        "title": "Prince William won&#39;t let Harry back into royal fold due to three-word stance",
        "description": "Harry returned to the UK recently to see King Charles in the wake of his worrying cancer diagnosis. Harry, who lives in the US with wife <b>Meghan Markle</b>, quit the UK four years ago alongside his wife as part of Megxit alongside the Suits actress. Speaking to ..."
    },
    {
        "url": "https://www.aol.com/entertainment/prince-harry-michael-buble-train-212054274.html",
        "title": "Prince Harry and Michael Buble Train for Curling at Invictus Games Training",
        "description": "Prince Harry, Duke of Sussex, and Michael Bublé DON MACKINNON/AFP via Getty Images With one year to go before the 2025 Invictus Games, Prince Harry took to the ice to try his hand at wheelchair curling alongside Michael Bublé."
    },
    {
        "url": "https://ca.news.yahoo.com/meghan-markle-continues-skinny-jeans-213643859.html",
        "title": "<b>Meghan Markle</b> Continues to Make Skinny Jeans the Star of Her Winter Wardrobe",
        "description": "On February 15, Markle started off the day in Whistler, Canada dressed in medium wash skinny jeans paired with brown knee-high riding boots, a striped button up, and long wool coat. You can see photos from her visit to the Mount Currie Community Centre here."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1158742-meghan-markle-gives-sweet-tribute-to-princess-diana-during-canadian-visit",
        "title": "<b>Meghan Markle</b> gives sweet tribute to Princess Diana during Canadian visit",
        "description": "Meghan Markle appeared to pay a subtle yet touching tribute to her late mother-in-law, Princess Diana, with her stylish attire during her recent outing in Canada.The Duke and Duchess of Sussex"
    },
    {
        "url": "https://www.usmagazine.com/celebrity-news/news/prince-harry-and-michael-buble-try-curling-at-invictus-training/",
        "title": "Prince Harry and Michael Buble Try Curling at Invictus Games Training Event",
        "description": "Prince Harry and Michael Buble both try their hands at curling during the One Year to Go celebrations leading up to the 2025 Invictus Games"
    },
    {
        "url": "https://www.rsvplive.ie/news/celebs/gallery/meghan-markle-adoring-wife-prince-32151161",
        "title": "<b>Meghan Markle</b> is the adoring wife as Prince Harry delivers emotional speech",
        "description": "Meghan Markle was the picture of an adoring wife as she offered support to her husband Prince Harry as he delivered an emotional speech during the launch event for the 2025 Invictus Games"
    },
    {
        "url": "https://clubofmozambique.com/news/s-africas-tshepo-jeans-from-township-to-stars-closets-254198/",
        "title": "S. Africa’s Tshepo Jeans, from township to stars’ closets",
        "description": "Growing up in a rough township outside Johannesburg, Tshepo Mohlala was mocked for wearing skinny jeans before they were popular. More than a decade later, ridicule has turned into admiration as the 3"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1158688-meghan-markle-faces-fresh-blow-after-trip-to-canada",
        "title": "<b>Meghan Markle</b> faces fresh blow after trip to Canada",
        "description": "Meghan Markle would have not been able to make it to the good books of her late mother-in-law Princess Diana, claims a royal expert.As per The Sun, royal editor Ingrid Seward believes that it"
    },
    {
        "url": "https://people.com/michael-buble-honors-prince-harry-king-charles-with-my-way-performance-8584609",
        "title": "Michael Bublé Honors Prince Harry, King Charles by Changing &#39;My Way&#39; Lyrics During Invictus Games Performance",
        "description": "Michael Bublé sang a rendition of Frank Sinatra&#39;s classic hit &#39;My Way,&#39; complete with new lyrics that both praised Prince Harry for being a &#39;visionary&#39; and offered &#39;healing wishes&#39; to King Charles amid his recent cancer diagnosis,"
    },
    {
        "url": "https://www.wtaj.com/entertainment-news/the-top-streamed-shows-are-almost-all-old-why/",
        "title": "The top streamed shows are almost all old. Why?",
        "description": "The most streamed show last year wasn’t the latest Netflix reality TV show craze. Nor was it the highly anticipated final season of “Succession” or the debut of “The Last"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-makes-rare-king-140000738.html",
        "title": "Prince Harry Makes Rare Comment on King Charles&#39;s Cancer Diagnosis",
        "description": "As Prince Harry and Meghan Markle wrap up their three-day visit to Whistler and Vancouver to celebrate one year until the 2025 Invictus Games, the Duke of Sussex made a rare comment on his father, King Charles, while speaking to Good Morning America &#39;s Will Reeve."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-interview-king-charles-cancer-news-b2497962.html?page=4",
        "title": "Prince Harry interview - live: Duke hints at royal reconciliation amid reports he ‘wants new role’",
        "description": "Prince Harry is set to discuss King Charles’s health in a television interview in the US for the first time since his father’s cancer diagnosis. The Duke of Sussex is also due to talk about his life with Meghan and the Invictus Games in the Good Morning America interview on Friday."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-wrap-124935762.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Wrap Invictus Games Countdown with Glam Banquet in Vancouver",
        "description": "The Duke and Duchess of Sussex checked out the Winter Training Camp this week, one year before the 2025 Invictus Games kick off"
    },
    {
        "url": "https://www.thesun.co.uk/royals/26001887/michael-buble-prince-harry-song-canada-invictus/",
        "title": "<b>Meghan Markle</b> &amp; Prince Harry serenaded by Michael Buble as singer calls Duke a ‘visionary’ for doing things ‘his way’",
        "description": "PRINCE Harry and Meghan Markle were serenaded by Michael Bublé last night – with the singer hailing the Duke a “visionary”. The Canadian crooner, 48, re-worded Frank"
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/513674/meghan-markle-totally-timeless-breathtaking-bardot-style-gown/",
        "title": "<b>Meghan Markle</b> is totally timeless in breathtaking Bardot-style gown",
        "description": "Meghan Markle swapped her ski style for something slinkier when she stepped out on Friday night for an emotional evening with her husband Prince Harry."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-branded-pompous-calling-28651533",
        "title": "<b>Meghan Markle</b> branded &#39;pompous&#39; for calling herself &#39;influential&#39; on new website",
        "description": "Meghan Markle has been criticised for calling herself one of the &quot;most influential women in the world&quot; on the new website she launched earlier this week with Prince Harry"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-reveals-he-considered-american-citizenship-in-interview-with-good-morning-america_art21181.html",
        "title": "Prince Harry reveals he considered American citizenship in interview with Good Morning America",
        "description": "Indeed, the last time <b>Meghan Markle</b> was seen in the UK was for Queen Elizabeth’s funeral in September 2022. Now that Prince Harry has been living in the US for four years and most likely for the foreseeable future, he revealed in an interview that he has ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/meghan-markles-co-star-details-32148191",
        "title": "<b>Meghan Markle</b>&#39;s co-star details &#39;foul&#39; smell at her wedding to Prince Harry",
        "description": "Meghan Markle&#39;s former Suits co-star Rick Hoffman has opened up about his viral expression at the royal wedding in 2018 as he revealed he could smell a &#39;foul&#39; odour"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-makes-dazzling-appearance-32132170",
        "title": "<b>Meghan Markle</b> makes dazzling appearance in new advert for luxury designer shoes",
        "description": "The Duchess of Sussex has made it known she is a big fan of Italian label Aquazzura&#39;s footwear in the past and now features in their latest campaign."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markles-off-shoulder-gown-160230660.html",
        "title": "<b>Meghan Markle</b>&#39;s Off-the-Shoulder Gown Is a Sophisticated Alternative to the Cutout Trend",
        "description": "Harry, for his part, wore a navy blue suit with a white dress shirt and a sage green tie that coordinated with Meghan&#39;s dress. During the event, the Duke of Sussex took the stage to share a speech with the audience, who he thanked for making the Invictus Games Vancouver Whistler 2025 &quot;possible.&quot;"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-meghan-markle-serenaded-32147775",
        "title": "Prince Harry and <b>Meghan Markle</b> serenaded by Michael Buble after attempting wheelchair curling",
        "description": "Meghan Markle and Prince Harry spent the final day of their trip to Canada at a curling rink in Vancouver as they tried out wheelchair curling alongside singer Michael Buble"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25954936/princess-diana-not-liked-meghan-markle-royal/",
        "title": "‘Princess Diana would NOT have liked <b>Meghan Markle</b>. It would be difficult for any mother-in-law to’, claims royal author",
        "description": "A ROYAL author has claimed that Princess Diana would not have liked Meghan Markle as the duchess likes things “her own way.” Royal editor Ingrid Seward exclusively told The Sun’s Royal"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-grateful-visits-father-032333703.html",
        "title": "Prince Harry Grateful for Visits as Father Battles Cancer: “I Love My Family”",
        "description": "In a rare U.S. television appearance on Friday, Prince Harry told ABC News that he is “grateful” to have the means to hop on a transatlantic flight at a moment’s notice to visit members of his estranged family,"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-harry-ready-put-28648279",
        "title": "<b>Meghan Markle</b> and Harry &#39;ready to put feud behind them&#39; after Duchess reached out to Kate",
        "description": "Meghan Markle and Prince Harry are said to be ready to &quot;put their feud behind them&quot; after the Duchess of Sussex reached out to Kate Middleton following her hospital stay"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-king-charles-iii-cancer-diagnosis_n_65cd31f1e4b0087d43c8e75b",
        "title": "Prince Harry Speaks Publicly About King Charles&#39; Cancer Diagnosis For The First Time",
        "description": "Buckingham Palace publicly confirmed Charles’s diagnosis Feb. 5, but not did disclose which type of cancer he has or its severity. The palace also noted that the 75-year-old “will continue to undertake State business and official paperwork as usual” while undergoing treatment."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/12/",
        "title": "Prince Harry breaks silence on King Charles’ cancer battle – latest news",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://www.instyle.com/banana-republic-presidents-day-sale-2024-8576654",
        "title": "<b>Meghan Markle</b>’s Go-To Mall Brand Just Dropped a Presidents Day Sale, and Staples Start at $26",
        "description": "The brand is home to elevated basics, transitional pieces, and easy-to-style neutrals that have previously been spotted on celebs like <b>Meghan Markle</b>. We scoured its virtual sale racks for can’t-miss deals on mini dresses, pants, button-down shirts ..."
    },
    {
        "url": "https://sg.finance.yahoo.com/news/prince-harry-meghan-markle-relaunch-092552707.html",
        "title": "Can Prince Harry and <b>Meghan Markle</b> Make Their Relaunch Work?",
        "description": "Prince Harry and <b>Meghan Markle</b>’s return to public view was always going to be dramatic—if there is one thing their supporters and detractors can agree on, it is their innate talent to cause a stir. On Thursday, during their second day attending the ..."
    }
]