[
    {
        "url": "https://www.skynews.com.au/opinion/prince-harry-and-meghan-downgraded-to-a-footnote-on-royal-family-website/video/30414094bdb5005f32de92d627c047a4",
        "title": "Prince Harry and <b>Meghan</b> downgraded to a ‘footnote’ on Royal Family website",
        "description": "&quot;There was a stipulation underneath Prince Harry’s bit that said that him are Meghan are going to continue to work with the King to fulfil their various patronages and to uphold the interests of the King and the Royal Family,” Ms Krakue told Sky News host Caroline Di Russo."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/dua-lipa-co-signs-square-010612378.html",
        "title": "Dua Lipa Co-Signs the Square Nail Trend With a Milky Jelly Manicure at the 2024 Grammys",
        "description": "For polish, nail artist Kim Truong kept Lipa&#39;s look simple and chic. She&#39;s wearing a shimmery, subtle, yet stunning milky jelly polish that allows the natural beauty of her nails to shine through. The end result is a natural but versatile look that works as well on the red carpet as it does in the office."
    },
    {
        "url": "https://startsat60.com/media/news/the-royal-family-member-queen-elizabeth-thought-princess-diana-was-a-far-better-match-for",
        "title": "The Royal Family member Queen Elizabeth thought Princess Diana was a ‘far better’ match for",
        "description": "In a surprising revelation from a new royal biography, it has been disclosed that Queen Elizabeth II once believed that Princess Diana was &quot;far better suited&quot; to Prince Andrew than to her eldest son,"
    },
    {
        "url": "https://www.skynews.com.au/world-news/hypocritical-meghan-markle-and-prince-harry-accused-of-bullying-late-queen-elizabeth-for-financial-gain/news-story/75d197d8c702b96671e67169346ad9ca",
        "title": "&#39;Hypocritical&#39;: <b>Meghan Markle</b> and Prince Harry accused of bullying late Queen Elizabeth for financial gain",
        "description": "Prince Harry and Meghan Markle have been accused of “bullying” frail Queen Elizabeth in the months before her death and slammed as “hypocritical” by Angela Levin."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-grandfather-allegedly-called-000026440.html",
        "title": "Prince Harry’s Grandfather Allegedly Called <b>Meghan Markle</b> This Spiteful Nickname",
        "description": "An upcoming book by a royal biographer has revealed the mean nickname the late Prince Philip gave his grandson&#39;s wife, <b>Meghan Markle</b>. The excerpt from the memoir also shared more details about how the late Queen Elizabeth II allegedly felt about <b>Meghan</b> and ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862858/royal-family-live-prince-harry-meghan-markle-queen-elizabeth",
        "title": "Royal Family LIVE: &#39;Hypocrites&#39; Prince Harry and <b>Meghan Markle</b> &#39;bullied royals for money&#39;",
        "description": "Royal expert Angela Levin has called Prince Harry and Meghan Markle &quot;hypocrites&quot; after the couple voiced &quot;concerns&quot; over cyber-bullying."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/hidden-meaning-behind-meghan-markle-32045312",
        "title": "Hidden meaning behind <b>Meghan Markle</b> and Prince Harry&#39;s family artwork at home",
        "description": "A hand drawn sketch of Prince Harry, Meghan Markle and their two children sits in their Montecito home, with the artist behind it revealing they never asked for freebies and she was paid in full"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harrys-seven-word-response-32044702",
        "title": "Prince Harry&#39;s seven-word response to being pushed down Royal line of succession",
        "description": "Prince Harry was once asked how he felt about being pushed down the Royal line of succession following the birth of George and Charlotte, and his response was rather sweet"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-branded-hypocrite-over-32043919.amp",
        "title": "<b>Meghan Markle</b> branded a &#39;hypocrite&#39; over cyber bullying campaign after own royal smears",
        "description": "The Duke and Duchess of Sussex have been accused being hypocrites according to a royal expert who spoke out as the couple voice their concerns on cyber bullying"
    },
    {
        "url": "https://uk.style.yahoo.com/princess-diana-almost-called-off-164759637.html",
        "title": "Princess Diana Almost Called Off Wedding to Prince Charles But Her Dad Changed Her Mind, New Book Claims",
        "description": "Royal biographer Ingrid Seward makes claims about the lead up to the Princess of Wales&#39; nuptials in her new book, &quot;My Mother And I&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13043769/Artist-created-sketch-Sussexes-2021-Christmas-card-says-shes-honoured-royal-fans-spot-work-framed-Prince-Harrys-shelf-reveals-Meghan-sent-beautiful-thank-card.html",
        "title": "Artist who created a sketch of the Sussexes&#39; 2021 Christmas card says she&#39;s &#39;honoured&#39; after royal fans spot the work framed on Prince Harry&#39;s shelf - and reveals <b>Meghan</b> sent a ...",
        "description": "Jennifer Vallez, a US-based artist who draws members of the royal family, revealed her shock in an Instagram post after a photo of Harry on a video call resurfaced on X/Twitter."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-two-word-response-32043528",
        "title": "Prince Harry&#39;s two-word response after &#39;snubbing Prince William&#39;s heart to heart&#39;",
        "description": "Prince William was said to have been keen to meet with brother Prince Harry to have a heart to heard but a book claims this never took place."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-meghan-send-very-clear-32043257",
        "title": "Harry and <b>Meghan</b> &#39;send a very clear signal&#39; to Royal Family with calculated move",
        "description": "Prince Harry and Meghan Markle have sent a very &quot;clear signal to the Palace&quot; with an intentional move, it has been claimed."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/prince-harry-meghan-markle-child-safety-statement",
        "title": "Prince Harry and <b>Meghan Markle</b> have issued an extremely important statement",
        "description": "Prince Harry and Meghan Markle are two of the most talked-about people in the world. This is particularly true when it comes to their charity work and activism, with the Duke and Duchess of Sussex never failing to stand up and speak out for what they believe in."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862930/prince-harry-meghan-markle-desperation-star-power",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;must not show signs of desperation&#39; to keep star power",
        "description": "EXCLUSIVE: Prince Harry and Meghan Markle &#39;must not show signs of desperation&#39; to hold onto their star power, an entertainment expert has claimed."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25670897/times-royals-broken-protocol-kate-middleton-selfies/",
        "title": "8 times the royals have broken protocol, from Kate Middleton’s selfies to <b>Meghan</b>’s wedding cake",
        "description": "THE royal family has millions of eyes on them at all times, leading them to have many rules so they don’t put a toe out of line. However, rules are made to be broken and these royals have"
    },
    {
        "url": "https://uk.movies.yahoo.com/snl-weekend-takes-suits-spinoff-055039361.html",
        "title": "‘SNL’s Weekend Update Takes On ‘Suits’ Spinoff, Donald Trump &amp; MAGA Conspiracies About Taylor Swift &amp; The Super Bowl",
        "description": "Colin Jost and Michael Che took shots at the Suits spinoff and Donald Trump during the Saturday Night Live Weekend Update segment. This week, it was announced that the Suits spinoff had received a pilot order from NBC and would be set in Los Angeles."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25715918/glamping-site-sandringham-estate-king-charles/",
        "title": "‘Ultra-luxurious’ woodland glamping site with safari tents ‘fit for a king’ to be built on Charles’ Sandringham Estate",
        "description": "A GLAMPING site fit for a king is set to be built on the royal Sandringham Estate. His Majesty has approved the plan to install 15 safari tents, each with its own veranda and built-in timber"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-risk-lot-going-oscars-even-skip-awards-show-expert.html/",
        "title": "Prince Harry and <b>Meghan Markle</b> Would ‘Risk’ a Lot by Going to the Oscars, But Even More if They Skip the Awards Show — Expert",
        "description": "It&#39;s not confirmed whether or not Prince Harry and Meghan Markle are going to the Oscars, but an expert says it&#39;s be a big deal for the pair."
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2950064/prince-harry-meghan-markle-family-sketch/",
        "title": "Eagle-Eyed Fans Noticed the Incredibly Heartwarming Momento Prince Harry Has in Honor of His Two Kids",
        "description": "Eagle-eyed fans on X, the social media platform formerly known as Twitter, noticed something incredibly sweet when looking through old videos of the Duke and Duchess of Sussex. An account run by @Le__Katerina, which was then made viral by Hello! US, showed that Harry has a sweet illustration of his family of four in his office."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154587-meghan-markle-warned-of-adverse-outcomes-amid-suits-spin-off-return",
        "title": "<b>Meghan Markle</b> warned of adverse outcomes amid &#39;Suits&#39; spin-off return",
        "description": "Meghan Markle has been warned of negative results if the Duchess of Sussex plans her acting comeback with the Suits spin-off. As per Express.co.uk, royal expert Richard Fitzwilliams"
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/royals-spiteful-meghan-markle-nickname-revealed/",
        "title": "Royal&#39;s &#39;Spiteful&#39; <b>Meghan Markle</b> Nickname Revealed",
        "description": "A new book about the British royal family claims that the late Prince Philip had a &quot;spiteful nickname&quot; for <b>Meghan Markle</b> – &quot;The Duchess of Windsor.&quot; This is a reference to royal history that may not be clear to most fans at first, but author Ingrid ..."
    },
    {
        "url": "https://www.sapeople.com/royals/harry-and-meghan-take-over-hollywood-with-new-netflix-projects/",
        "title": "Harry and <b>Meghan</b> take over Hollywood with new Netflix projects",
        "description": "A Netflix executive has shared that Prince Harry and Meghan Markle have several Netflix projects that are current in development."
    },
    {
        "url": "https://people.com/princess-diana-dad-changed-her-mind-about-canceling-wedding-book-claims-8558496",
        "title": "Princess Diana Almost Called Off Wedding to Prince Charles But Her Dad Changed Her Mind, New Book Claims",
        "description": "A new book by a royal biographer claims that Princess Diana had doubts ahead of her 1981 wedding to then-Prince Charles, as well as alleging that her father Earl Spencer convinced her she shouldn&#39;t call off the ceremony."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-always-thought-d-150000974.html",
        "title": "Prince Harry Always Thought He’d Get Married Before His Brother: “I Wanted It So Badly”",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.weeklytimesnow.com.au/news/national/dreaded-duo-harry-and-meghan-whinging-and-whining-in-the-name-of-privacy/video/3c9b6592b2bfd330f11300344b690a6f",
        "title": "‘Dreaded duo’: Harry and <b>Meghan</b> ‘whinging and whining’ in the name of privacy",
        "description": "The “dreaded duo” of Prince Harry and <b>Meghan Markle</b> cannot help “whinging and whining” in the name of privacy, Sky News host Danica De Giorgio says. The Jury panel, comprising of Sky News host James Macpherson and royal commentator Angela Mollard ..."
    },
    {
        "url": "https://www.businessghana.com/site/news/Entertainment/301536/Prince-Harry-and-Meghan-to-release-new-Netflix-projects",
        "title": "Prince Harry and <b>Meghan</b> to release new Netflix projects",
        "description": "Prince Harry and Meghan Markle are working on a new Netflix film and TV series, according to a company executive. The Duke and Duchess of"
    },
    {
        "url": "https://www.allvipp.com/royals/all-about-meghan-markle-s-first-husband-trevor-engelson",
        "title": "All About <b>Meghan Markle</b>&#39;s First Husband Trevor Engelson",
        "description": "<b>Meghan Markle</b> has been one of the most talked about names within British royalty in recent years. But her current marriage to Prince Harry has not been her first time sharing wedding vows... <b>Meghan Markle</b> is a famous actress and Duchess She used to be ..."
    },
    {
        "url": "https://english.aawsat.com/entertainment/4832286-harry-meghan-prepare-new-projects-netflix",
        "title": "Harry, <b>Meghan</b> Prepare for New Projects with Netflix",
        "description": "The Duke and Duchess of Sussex are working on multiple documentaries as well as a scripted television series and a film adaptation, a Netflix executive has revealed. According to The Telegraph, the couple,"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-prince-william-colonialism-scandals-1865537",
        "title": "How Prince Harry and William&#39;s Colonialism Scandals Compare",
        "description": "Prince Harry has faced calls to quit his role with conservation charity African Parks two years after Prince William came under fire for comments about the human population of the continent. Both brothers have fond memories of Africa and work with charities in the continent who target poachers and aim to protect the environment."
    },
    {
        "url": "https://www.news18.com/world/prince-philips-spiteful-nickname-for-granddaughter-in-law-meghan-markle-revealed-8765728.html",
        "title": "Prince Philip’s Spiteful Nickname for Granddaughter-in-Law <b>Meghan Markle</b> Revealed",
        "description": "The late prince Philip, husband of late British queen Elizabeth II, had ‘a spiteful’ nickname for Meghan Markle, as revealed in an excerpt from an upcoming book by royal biographer Ingrid Seward."
    },
    {
        "url": "https://www.mamamia.com.au/prince-philip-meghan-markle/",
        "title": "The meaning behind Prince Philip&#39;s cruel nickname for <b>Meghan Markle</b>.",
        "description": "Prince Philip&#39;s alleged nickname for Meghan shows that his opinion of her was not much better than the one he held for Wallis. According to Seward, the deceased royal thought it was &quot;uncanny&quot; how much Meghan reminded him of Wallis – chiefly due to her having been wed once before."
    },
    {
        "url": "https://startsat60.com/media/news/prince-philips-nickname-for-meghan-markle-revealed",
        "title": "Prince Philip’s nickname for <b>Meghan Markle</b> revealed",
        "description": "In a surprising revelation, Prince Philip&#39;s unique nickname for Meghan Markle has been uncovered, shedding light on the Duke of Edinburgh&#39;s perspective on the American actress who joined the Royal Family."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/royal-revelation-prince-philips-nickname-for-meghan-markle-unveiled-in-new-book/articleshow/107394953.cms",
        "title": "Royal revelation: Prince Philip&#39;s nickname for <b>Meghan Markle</b> unveiled in new book",
        "description": "Prince Philip, renowned for his straightforward demeanor, was reportedly one of the few within the Royal Family who remained cautious about Meghan Mar"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154581-real-reason-behind-prince-harry-williams-growing-differences-revealed",
        "title": "Real reason behind Prince Harry, William&#39;s growing differences revealed",
        "description": "Prince Harry and Prince William had already grown apart before <b>Meghan Markle</b> entered into the royal family, a new report claimed. As per The Time, the rift between the late Princess Diana&#39;s sons first sparked after they came up with their different ..."
    },
    {
        "url": "https://www.goldcoastbulletin.com.au/news/national/harry-and-meghan-to-hopefully-use-fame-to-advocate-for-worthy-causes/video/0920c388521481fb28be15c9e01fd3aa",
        "title": "Harry and <b>Meghan</b> to hopefully use fame to advocate for ‘worthy causes’",
        "description": "Sky News host Caroline Di Russo has expressed hope Prince Harry and Meghan Markle will use their “material influence” as celebrities to advocate for worthy causes. Ms Di Russo pointed to positive signs of growth for the couple after they contacted Buckingham Palace to check on the health of the King and Princess of Wales."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-door-firmly-32027649?int_source=nba",
        "title": "Prince Harry and <b>Meghan</b> have had &#39;door firmly shut&#39; in their face as royals employ new tactic",
        "description": "However, Harry and <b>Meghan</b> have tried to distance themselves from the latter, the Express reports. Shortly before Christmas, sources close to the former royal couple have let slip that they wish to mend their ongoing feud with the Royal Family. However ..."
    }
]