[
    {
        "url": "https://www.foxnews.com/entertainment/celebrities-leading-mental-health-advocacy",
        "title": "Selena Gomez, Prince Harry and other celebrities leading mental health advocacy",
        "description": "Prince Harry and his wife, <b>Meghan Markle</b>, the Duchess of Sussex, have been a driving force in the mental health advocacy space. Their foundation, Archewell, has partnered with several organizations to promote mental health initiatives, including the launch ..."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-could-earn-over-300000-if-she-makes-hollywood-comeback_art20721.html",
        "title": "<b>Meghan Markle</b> could earn over &#39;£300,000&#39; if she makes Hollywood comeback",
        "description": "<b>Meghan Markle</b> could be planning her Hollywood comeback soon and it could earn her over &#39;£300,000&#39;. But what role could the former actress be taking on? The two tied the knot on the show and left for Seattle to set up their own law firm. Adams said at the ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-williams-brutal-10-word-31834044",
        "title": "Prince William&#39;s brutal 10-word <b>Meghan Markle</b> warning after Prince Harry&#39;s life-changing news",
        "description": "So when Harry eventually found love and started dating wife <b>Meghan Markle</b>, it was natural he wanted to tell William his happy news. But when he plucked up the courage to tell his brother and sister-in-law about his new girlfriend, William seemingly had a ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854323/meghan-markle-princess-diana-royal-family",
        "title": "<b>Meghan Markle</b> &#39;considered the next Princess Diana&#39; but didn&#39;t realise the &#39;fame and glory&#39;",
        "description": "Meghan Markle has been compared to Princess Diana by a royal expert, who laid bare exactly how her life transformed."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854294/prince-harry-meghan-markle-exposed",
        "title": "Prince Harry and <b>Meghan Markle</b> set to be &#39;completely exposed&#39; in cryptic new prediction",
        "description": "Prince Harry and <b>Meghan Markle</b> are set to face a &quot;bomb&quot; in the spring of this year, as a royal expert claimed the couple would be &quot;completely exposed&quot; in a whole new way. The new year has already begun in shaky fasion for the Sussexes, after Golden Globes ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-deliberately-distanced-herself-31851434",
        "title": "<b>Meghan Markle</b> &#39;deliberately distanced&#39; herself from Prince Harry&#39;s Spare after &#39;gentle concerns&#39;",
        "description": "On this day last year, readers were finally able to get their hands on Prince Harry&#39;s bombshell memoir Spare - but his wife Meghan Markle was mysteriously missing from his promotional tour for the boo"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-67933971",
        "title": "Jeans: Hiut Denim worn by <b>Meghan Markle</b> shares secrets",
        "description": "Their jeans hit the fashion pages in 2018 when Meghan Markle wore a pair to Cardiff Castle. That was the Duchess of Sussex&#39;s first official royal visit to Wales. Now the Welsh company Hiut Denim has opened its doors to TV cameras to reveal exactly what goes into making its version of the wardrobe staple."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-prince-william-secret-195806196.html",
        "title": "Prince Harry and Prince William Have &#39;Secret&#39; 3-Word Code Used &#39;Only in Times of Extreme Crisis&#39;",
        "description": "Harry recounts how a heated exchange with his older brother and father King Charles after Prince Philip’s funeral in April 2021 took an emotional turn as they discussed the circumstances around Harry and wife <b>Meghan Markle</b>&#39;s decision to step back from ..."
    },
    {
        "url": "https://www.hellomagazine.com/homes/510957/opulent-living-rooms-princess-kate-meghan-markle-crown-princess-mary/",
        "title": "14 Opulent royal living rooms: Princess Kate, <b>Meghan Markle</b>, Crown Princess Mary, more",
        "description": "When it comes to interior design, the royal families of Europe don&#39;t hold back, particularly in a room as important as a living room. It is the room many of us go to relax and unwind, for others, it is a more formal spot you direct guests to when they enter your home."
    },
    {
        "url": "https://inews.co.uk/culture/television/criminal-record-review-apple-tv-line-of-duty-2845212",
        "title": "Criminal Record review: Apple TV+’s police drama could be the new Line of Duty",
        "description": "Cush Jumbo and Peter Capaldi make for gripping adversaries in this series about bent coppers and gangland shootings"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12946411/Will-Poulters-model-girlfriend-Bobby-T-44-14-years-senior.html",
        "title": "REVEALED: Will Poulter&#39;s model girlfriend Bobby T, 44, is 14 years his senior and a mother to a seven-year-old son as couple take their romance to the next level by spending ...",
        "description": "Will Poulter &#39;s model girlfriend Bobby T is 14 years his senior and a mother to a seven-year son, MailOnline can reveal."
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to Prince Andrew",
        "description": "ITV bosses have decided the Duchess of York Sarah Ferguson will not be given a full time presenting role on This Morning after her debut presenting role ended in disaster"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25299136/grifters-meghan-markle-prince-harry-spotify-ruined-them/",
        "title": "‘The grifters line has tarnished them for life’, <b>Meghan Markle</b> &amp; Prince Harry Spotify flop has ruined them, expert says",
        "description": "MEGHAN Markle and Prince Harry have “tarnished” their reputation, following their Spotify deal falling through, according to a royal author. The Duke and Duchess of Sussex were slammed as being"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25307131/prince-harrys-book-binned-by-readers/",
        "title": "Prince Harry’s book broke sales records… but was binned by readers leaving companies with ‘bookcases full of them’",
        "description": "PRINCE Harry’s book has been binned by readers – leaving companies with “bookcases full of them”. The memoir sold 3.2million copies in its first week of publication in ­January — and"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/news/john-mulaney-marvel-angela-bassett-governors-awards-b2476193.html",
        "title": "John Mulaney ‘takes aim at’ Marvel during Governors Awards opening monologue",
        "description": "John Mulaney reportedly poked fun at Marvel during his opening monologue at the Governors Awards."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markle-brutally-mocked-golden-globes-1722633",
        "title": "Prince Harry, <b>Meghan Markle</b> Brutally Mocked At Golden Globes",
        "description": "The Duke and Duchess of Sussex were roasted for getting &quot;paid millions of dollars for doing absolutely nothing&quot; by host Jo Koy."
    },
    {
        "url": "https://www.hellomagazine.com/homes/510979/prince-harry-meghan-markles-garden-at-30-million-home-paradise-for-archie-and-lilibet/",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s never-ending garden at $30 million home is paradise for Archie and Lilibet",
        "description": "When Prince Harry and <b>Meghan Markle</b> moved into their gorgeous mansion in Montecito, California, in June 2020, royal fans were desperate to see more of their home. The Duke and Duchess of Sussex moved in when their eldest Prince Archie was just two years ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-had-210404415.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Had to Return £7 Million in Wedding Gifts from Fans Because of Little-Known Royal Protocol",
        "description": "Fans flocked to Windsor for Prince Harry and Meghan Markle’s wedding on May 19, 2018—many of them bearing gifts. But, The Mirror reports, royal protocol—and a little-known rule—dictated that many of the gifts had to be returned, the outlet reports."
    },
    {
        "url": "https://www.westerntelegraph.co.uk/news/24037167.hiut-denim-features-bbc-2s-inside-factory/",
        "title": "Hiut Denim features in BBC 2&#39;s Inside the Factory",
        "description": "Greg visited factories in Italy and Cardigan to learn the fascinating secrets behind how Hiut makes its jeans which shot to fame after being seen sported by <b>Meghan Markle</b>. Greg learns how denim cloth is made and then transformed into one of the world&#39;s ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-william-harry-unwelcome-royals-31811743?int_source=nba",
        "title": "Kate Middleton and Prince William&#39;s &#39;clever move that shows Harry isn&#39;t welcome&#39; in Royal Family",
        "description": "As reported continue to swirl that Prince Harry and <b>Meghan Markle</b> are trying to action their &#39;2024 redemption plan&#39;, a royal author has claimed Prince William and Kate Middleton have made it &quot;clear&quot; the Sussexes are not welcome in the Royal Family. Harry, 39, and <b>Meghan</b>, 42, are said to be working on rehabilitating their image after a drama-filled few years, but the couple failed to attend ..."
    },
    {
        "url": "https://inews.co.uk/opinion/meghan-markle-is-poised-for-her-2024-comeback-2807047?ico=in-line_link",
        "title": "<b>Meghan Markle</b> is poised for her 2024 comeback",
        "description": "So the coming year could be a challenging one for Harry and <b>Meghan</b>. Their Archewell Foundation’s funding has dwindled: it fell by £8.7m between 2021 and 2022, resulting in an annual loss, according to a public disclosure form filed with the American tax ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12948431/Prince-Harry-honoured-21st-Annual-Living-Legends-Aviation-Awards-glitzy-Beverly-Hills-ceremony-hosted-John-Travolta.html",
        "title": "Prince Harry will be honoured at 21st Annual Living Legends of Aviation Awards at glitzy Beverly Hills ceremony hosted by John Travolta",
        "description": "The decorated event - which will be hosted by John Travolta in Beverley Hills, California next Friday - will see the royal inducted alongside other aerospace icons."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-prince-harry-news-royal-family-news-prince-william-news-101704814937892.html",
        "title": "Prince Harry- <b>Meghan Markle</b>&#39;s neighbours say ‘unimpressed by their soap opera’",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s neighbours are fed up of hearing about the couple. The Duke and Duchess of Sussex stepped down from their royal roles in 2020 and moved to the US. The couple now live in Montecito with their two children Prince Archie and ..."
    },
    {
        "url": "https://nypost.com/2024/01/10/entertainment/hollywood-medium-tyler-henry-reveals-toughest-celebrity-client/",
        "title": "‘Hollywood Medium’ Tyler Henry reveals toughest celebrity reading, the one star he’d love to work with",
        "description": "Tyler Henry, known to many as the “Hollywood Medium” for his celebrity readings, has a famous name he’d like to work with. “Meghan Markle would be really interesting just for the royal connection, all of what they’ve gone through, the cultural impact,” Henry told Fox News Digital."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-fought-prince-harry-meghan-markle-after-us-move-letter-reveals-imperative-security.html/",
        "title": "Queen Elizabeth Fought For Prince Harry and <b>Meghan Markle</b> After U.S. Move, Letter Reveals: ‘Imperative’ They Have Security",
        "description": "Queen Elizabeth reportedly fought for Prince Harry, Meghan Markle and their children&#39;s protection while in the UK. They left in 2020."
    },
    {
        "url": "https://www.btimesonline.com/articles/163186/20240110/prince-harrys-spare-unintentionally-strengthens-kate-middletons-public-image.htm",
        "title": "Prince Harry&#39;s &#39;Spare&#39; Unintentionally Strengthens Kate Middleton&#39;s Public Image",
        "description": "Prince Harry&#39;s memoir &quot;Spare&quot; has stirred a significant discourse, especially regarding the relationship between <b>Meghan Markle</b> and Princess Kate. A year since its record-breaking release, with sales surpassing three million copies, the book continues to ..."
    },
    {
        "url": "https://in.mashable.com/culture/67265/from-prince-harry-to-meghan-markle-and-king-charles-royal-family-drop-their-gta-7-avatars-and-its-ra",
        "title": "From Prince Harry To <b>Meghan Markle</b> And King Charles Royal Family Drop Their GTA 7 Avatars And It’s Rad",
        "description": "All Pics by David Zinyama .This AI content is a work of fiction and is intended solely for entertainment purposes. Any resemblance to real individuals, living or deceased, or to actual events or locations is purely coincidental."
    },
    {
        "url": "https://www.themountainpress.com/news/national/meghan-markle-s-hopes-of-reconciliation-with-kate-dashed-by-expert/video_96a84413-4d39-5a8f-81aa-b87f56d222df.html",
        "title": "<b>Meghan Markle</b>’s hopes of reconciliation with Kate dashed by expert",
        "description": "A royal expert has claimed that there is little chance of a reconciliation between Princess Kate and Meghan Markle.When questioned by host Mark Dolan if there&#39;s any hopes of a"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-sweet-fatherhood-moment-130136090.html",
        "title": "Prince Harry’s Sweet Fatherhood Moment Goes Viral After He Snubs Kate Middleton on Her Birthday",
        "description": "In the TikTok video that was first posted on Monday, January 8, Harry, 39, was seen reenacting Archie’s first steps alongside his wife, <b>Meghan Markle</b>. “Archie took his very first steps right here,” <b>Meghan</b>, 42, said in the clip, which was featured in ..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/could-2024-prince-harry-meghan-130000024.html",
        "title": "Could 2024 Be Prince Harry and <b>Meghan Markle</b>&#39;s Year?",
        "description": "With controversial memoir Spare now last year’s news, will the next 12 months mark a fresh chapter for the Sussexes?"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-roast-golden-globes-reputation-1859386",
        "title": "How Prince Harry and <b>Meghan Markle</b> Roast Will Impact their Reputations",
        "description": "Prince Harry and Meghan Markle &#39;s Golden Globes roast &quot;shows they&#39;re relevant&quot; going into a &quot;watershed&quot; year, a PR expert told Newsweek. The Duke and Duchess of Sussex were mocked by host Jo Koy during a monologue in which he discussed Imelda Staunton&#39;s role as Queen Elizabeth II in The Crown."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146531-meghan-markle-warned-she-might-lose-harry-in-war-against-royal-family",
        "title": "<b>Meghan Markle</b> warned she might lose Harry in war against royal family",
        "description": "<b>Meghan Markle</b>, who is said to be obsessed about the future, has been advised to heal rift with Prince Harry&#39;s family to strengthen her relationship with her husband. The Duchess of Sussex &#39;needs olive branch&#39; as the Duke wants to return to the UK."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146538-meghan-markle-set-to-make-strategic-move-amid-suits-spinoff",
        "title": "<b>Meghan Markle</b> set to make &#39;strategic move&#39; amid &#39;Suits&#39; spinoff?",
        "description": "<b>Meghan Markle</b> has been advised to make her acting comeback with her popular legal drama Suits spinoff. In conversation with The Mirror, PR expert Mayah Riaz shared that it could be a &quot;strategic move&quot; by the Duchess of Sussex to &quot;reconnect with her loyal ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/why-grifters-dig-tarnished-prince-harry-and-meghan-markles-image/news-story/35276fdd32ef5e7f49b960700015eb35",
        "title": "Why ‘grifters’ dig ‘tarnished’ Prince Harry and <b>Meghan Markle</b>’s image",
        "description": "As Prince Harry and <b>Meghan Markle</b> look towards a brighter 2024, one royal expert has claimed “redemption” might be a while off yet. The Duke and Duchess of Sussex were slammed as being “f***** grifters” by a well-known Spotify executive after ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163191/20240111/queen-camillas-podcast-success-overshadows-meghan-markles-spotify-exit.htm",
        "title": "Queen Camilla&#39;s Podcast Success Overshadows <b>Meghan Markle</b>&#39;s Spotify Exit",
        "description": "This success comes in the wake of <b>Meghan Markle</b>&#39;s less fortunate venture with Spotify, where her podcast &quot;Archetypes&quot; was canceled after its first season. Launched as an extension of her book club created during the 2021 lockdown, Queen Camilla&#39;s podcast ..."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937561/Meghan-Markles-Suits-stars-present-Golden-Globes-2024.html",
        "title": "Golden Globes 2024: <b>Meghan Markle</b>&#39;s former Suits co-stars Patrick J. Adams, Gabriel Macht, Sarah Rafferty and Gina Torres reunite to present",
        "description": "A number of Meghan Markle&#39;s former Suits co-stars enjoyed a reunion at the 81st Golden Globe Awards on Sunday."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-snapped-hanging-out-31804642?int_source=nba",
        "title": "Prince Harry snapped hanging out with new Hollywood pals without <b>Meghan Markle</b>",
        "description": "Prince Harry has been spotted rubbing shoulders with Hollywood TV stars in recently-shared snaps with wife <b>Meghan Markle</b> nowhere to be seen. The Duke and Duchess of Sussex have made friendships with many famous faces since leaving the Royal Family to ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/prince-williams-four-word-answer-31825440?int_source=nba",
        "title": "Prince William&#39;s four-word answer after <b>Meghan</b>&#39;s pregnancy announcement at royal wedding",
        "description": "Prince William had a simple four-word response when he found out that <b>Meghan Markle</b> was pregnant with her first child. He was on good terms with his brother Prince Harry at the time, however their relationship has taken a turn for the worst in recent years."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-prince-harry-relationship-31811542?int_source=nba",
        "title": "King Charles&#39; brief four-word comment over Prince Harry&#39;s return to UK",
        "description": "Back in January 2020, Prince Harry and <b>Meghan Markle</b> made the very public decision to step down as senior royals. The couple, who had married in a lavish ceremony only two years earlier, released a statement revealing that they intended to split their time between the UK and North America."
    }
]