[
    {
        "url": "https://uk.style.yahoo.com/fans-mixed-reactions-meghan-markle-193616895.html",
        "title": "Fans Have Mixed Reactions to <b>Meghan Markle</b>’s Recent Cameo in This Coffee Ad",
        "description": "In a totally unexpected turn of events, California coffee brand, Clevr, just landed a huge actress in their latest ad campaign. Meghan Markle, Suits actress and the current Duchess of Sussex, joined the coffee and tea company for an unassuming (but eye-catching) role in their latest Instagram ad campaign."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847741/meghan-markle-hugging-kate-middleton-prince-harry-william",
        "title": "<b>Meghan Markle</b> &#39;didn&#39;t realise hugging is jarring for Brits&#39; while sharing royal moment",
        "description": "Meghan Markle said she didn’t realise how “jarring” British people found hugging strangers while sharing an intimate royal moment. The Duchess of Sussex was taken aback by how formal the Royal Family was even behind closed doors."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meghan-markle-got-uncharacteristically-goofy-180802730.html",
        "title": "<b>Meghan Markle</b> Got Uncharacteristically Goofy For Her Coffee Company",
        "description": "Meghan announced that she invested in the female-run coffee company back in December 2020. It was a huge moment, as it was the first time that she&#39;d invested in a company since she stepped away from the royal family. Later that year, she notably gave her friend Oprah Winfrey coffee from Clevr."
    },
    {
        "url": "https://www.huffpost.com/entry/meghan-markle-coffee-ad-instagram_n_65831de6e4b06a9c6529e4b6",
        "title": "<b>Meghan Markle</b> Sorta Returns To Acting In Instagram Coffee Ad",
        "description": "The Duchess of Sussex is cheekily appearing as a background actor in a post promoting a latte company she&#39;s invested in."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25120552/meghan-markle-duchess-coffee-instagram-acting-suits-reveal/",
        "title": "<b>Meghan Markle</b> is ‘relaunching’ herself to show off her ‘fun side’ after ‘claiming her life is a misery’, expert reveals",
        "description": "MEGHAN Markle is trying to shrug off a difficult past year and return to her popular persona by appearing in a new ad, experts say. The Duchess of Sussex has appeared in a playful Instagram ad for"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847694/meghan-markle-clevr-blends-advert-cameo",
        "title": "<b>Meghan Markle</b> savaged over one &#39;awkward&#39; detail in new coffee advert",
        "description": "<b>Meghan Markle</b> has been savaged after an expert spotted one &quot;awkward&quot; detail during her cameo appearance in a coffee company&#39;s social media clip. The former royal, 42, appeared in the background in a new video posted by coffee brand Clevr Blends."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/culture/509824/meghan-markle-stanley-cup-tiktok-trend/",
        "title": "<b>Meghan Markle</b> has joined the most unexpected TikTok It-girl trend",
        "description": "The Duchess of Sussex stars in a new social media advert, and her desk prop is one of TikTok&#39;s biggest cool-girl trends of the year"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-makes-smart-move-31718468",
        "title": "<b>Meghan Markle</b> makes &#39;smart move&#39; in attempt to &#39;stay relevant&#39; and fend off bad publicity",
        "description": "Meghan Markle&#39;s return to acting in an Instagram advert for a coffee brand she&#39;s invested has been labelled a &#39;smart move&#39; by a PR expert who says it can help her keep in the public eye"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25113491/meghan-markle-prince-harry-live-palace-no-money-royal/",
        "title": "<b>Meghan Markle</b> didn’t realise Harry didn’t have much money &amp; she wasn’t going to live in a palace, claims royal author",
        "description": "WHEN Meghan Markle started dating Prince Harry she didn’t realise she wasn’t going to live in a palace, according to royal author Tom Bower. Before the couple relocated to California, they first"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12885685/experts-say-meghan-markle-advert-coffee-company-clevr-relaunching-herself.html",
        "title": "<b>Meghan Markle</b>&#39;s cameo in new advert for coffee company Clevr shows she is relaunching herself as &#39;kind&#39; and &#39;standalone&#39; brand and is &#39;not afraid to poke fun at herself&#39; after ...",
        "description": "The Duchess of Sussex features as a background extra in the new commercial for Clevr Blends, a firm based in Santa Barbara, California, in which she holds shares."
    },
    {
        "url": "https://www.itv.com/news/2023-12-20/meghan-markle-takes-role-as-intern-stacking-boxes-in-vegan-coffee-advert",
        "title": "<b>Meghan Markle</b> takes role as intern stacking boxes in vegan coffee advert",
        "description": "<b>Meghan Markle</b> has been spotted stacking boxes, missing a fist bump and making hot drinks in a new advert for a coffee brand she invests in. The former Suits actress is seen in the Clevr Blends&#39; social media advert acting in the background of each of the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middletons-savage-christmas-gift-31716349.amp",
        "title": "Kate Middleton&#39;s &#39;savage&#39; Christmas gift for Prince Harry after multiple failed romances",
        "description": "However, two people who are believed to have not made the guest list are Prince Harry and <b>Meghan Markle</b>. Since their dramatic exit from the Royal Family in 2020, they&#39;ve chosen to spend the festive season in the States with their two kids Prince Archie and ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-harry-force-deeply-nervous-31717006",
        "title": "<b>Meghan</b> and Harry force &#39;deeply nervous&#39; King Charles to take drastic precaution over Christmas",
        "description": "The monarch is said to be anxious about Prince Harry and Meghan Markle&#39;s next move as he keeps his guard up over the Christmas period."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-meghan-markles-embarrassing-cameo-123014925.html",
        "title": "OPINION - <b>Meghan Markle</b>&#39;s embarrassing cameo shows she and Prince Harry have begun their inevitable descent",
        "description": "The miracle of the latest advertisement for Clevr, a “mission-driven, women-led wellness brand” which sells revolting-sounding powdered coffee, is that it features Meghan Markle doing actual work. The Duchess of Sussex is seen packing boxes,"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12885429/Matthew-Wright-Christmas-Day-away-wife-daughter.html",
        "title": "Matthew Wright announces he will be spending Christmas Day away from his wife and daughter AGAIN as festive season &#39;does his head in&#39;",
        "description": "The presenter, 58, spent the day at work last year and defended his decision to miss his daughter Cassady&#39;s first Christmas in 2020 in favour of a Caribbean holiday."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/meghan-ad-clevr-coffee-cameo-b2467180.html",
        "title": "<b>Meghan Markle</b> stars as intern for wellness coffee brand in surprising cameo",
        "description": "California start-up Clevr, which sells “superlattes” with wellness benefits, was launched in 2017 as a pop-up coffee bar, before pivoting to selling coffee blends infused with adaptogens and probiotics to help ease stress, sleep better, and sharpen focus."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-secret-31713948",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;secret message&#39; in their simple Christmas card",
        "description": "Prince Harry and Meghan Markle recently released their 2023 Christmas card, which features a picture of them having fun at the Invictus Games closing ceremony in Germany"
    },
    {
        "url": "https://goss.ie/featured/meghan-markle-makes-surprise-return-to-acting-363141",
        "title": "<b>Meghan Markle</b> makes surprise return to acting",
        "description": "Meghan Markle made her surprise return to acting as she appeared in a new ad for coffee company Clevr Blends. The Duchess of Sussex split opinion when she popped up on their screens to promote a company she previously invested in."
    },
    {
        "url": "https://uk.style.yahoo.com/inside-meghan-markle-prince-harry-150400875.html",
        "title": "Inside <b>Meghan Markle</b> and Prince Harry’s Christmas Plans Away From the Royals",
        "description": "There will be no royal Christmas reunion or reconciliation between <b>Meghan Markle</b>, Prince Harry, and the British royal family. Multiple sources told Us Weekly that <b>Meghan</b> and Harry will be spending their Christmas in Montecito, California, with their kids ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/20/meghan-markle-returns-acting-advert-vegan-coffee/",
        "title": "Watch: Duchess of Sussex returns to acting in advert for vegan ‘super-lattes’",
        "description": "The Duchess of Sussex has returned to acting with a new advert for a vegan coffee brand. The former actress appears as an office worker in the Clevr Blends commercial, stacking boxes, making hot drinks and working on a computer."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-stars-intern-stacking-31713553",
        "title": "<b>Meghan Markle</b> stars as intern stacking boxes and making brews in new ad for coffee brand",
        "description": "Meghan Markle appears to have landed a new acting role, as she starred in an Instagram advert for a coffee brand where she is seen stacking boxes and making brews"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-pops-slightly-nerdy-050256873.html",
        "title": "<b>Meghan Markle</b> Pops up as &#39;Slightly Nerdy&#39; Digital Staffer in Cheeky Video for Her Favorite Latte Company: Watch!",
        "description": "The Duchess of Sussex appeared in a video uploaded on Clevr &#39;s Instagram page Tuesday. The instant latte brand teased Meghan&#39;s appearance by writing in the caption, &quot;Damn, you&#39;re keeping us BUSY right now! Had to call in some reinforcements 👀.&quot;"
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/meghan-markle-just-made-a-surprise-return-to-acting",
        "title": "<b>Meghan Markle</b> just made a surprise return to acting",
        "description": "<b>Meghan Markle</b> confirmed her retirement from acting when she announced her engagement to Prince Harry in 2017. While she had enjoyed a successful career in Hollywood, most notably starring in the popular legal drama Suits for seven seasons, <b>Meghan</b> said she ..."
    },
    {
        "url": "https://www.wmagazine.com/culture/meghan-markle-acting-return",
        "title": "What Made California Girl <b>Meghan Markle</b> Return to Acting? Adaptogens, Naturally",
        "description": "Suits fans will have to wait a bit longer for Meghan Markle’s big return to the beloved series. Because while the Duchess did put her acting shoes back on this week, she did so as a “slightly nerdy” digital staffer in the background of an Instagram advertisement for the latte company Clevr Blends. Yes, you read that correctly."
    },
    {
        "url": "https://www.avclub.com/meghan-markle-duchess-of-sussex-coffee-ad-clevr-1851115221",
        "title": "<b>Meghan Markle</b> (kind of) returns to acting in coffee ad",
        "description": "In the ad, Markle appears behind co-founder Hanna Mendoza a number of times as a staffer packing products and listening to Britney Spears, a member of the “slightly nerdy” digital team, and a giggling assistant with a clipboard and a fist bump at the ready."
    },
    {
        "url": "https://www.aol.com/lifestyle/meghan-markle-returns-acting-video-200146890.html",
        "title": "<b>Meghan Markle</b> Returns to Acting in New Video",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2921228/the-crown-prince-william-supermodel-scene/",
        "title": "The Crown Didn’t Shy Away From Prince William’s Obsession With Supermodels &amp; Cindy Crawford Loves It",
        "description": "Related story Prince Harry &amp; <b>Meghan Markle</b>&#39;s &#39;High Demand&#39; Offers Are Setting Them Up for a Busy New Year in Hollywood “I went bright red and didn’t know quite what to say. And sort of fumbled and I think pretty much fell down the stairs on the way up ..."
    },
    {
        "url": "https://nypost.com/2023/12/20/entertainment/royal-familys-2023-in-review-prince-harrys-book-racist-royal-scandal-more/",
        "title": "Nothing spared: The royal family’s ups and downs in 2023",
        "description": "The royals have endured a lot of history-making moments in 2023 — from Prince Harry’s “Spare” memoir to King Charles’ coronation."
    },
    {
        "url": "https://pagesix.com/2023/12/20/royal-family/lightweight-prince-williams-nickname-revealed-by-cousin/",
        "title": "Lightweight Prince William’s cheeky nickname revealed by cousin Mike Tindall: ‘You’re in so much trouble!’",
        "description": "The Duke of Sussex — who was there with his wife, Duchess of Sussex <b>Meghan Markle</b> — made sure to pick up the tab and leave the staff a hefty tip."
    },
    {
        "url": "https://www.aol.com/entertainment/meghan-markle-returns-her-acting-165813926.html",
        "title": "<b>Meghan Markle</b> Returns to Her Acting Roots With &#39;Nerdy&#39; Coffee Ad Cameo",
        "description": "Meghan Markle Patrick van Katwijk/Getty Images Meghan Markle has returned to her acting roots — sort of. The Suits alum, 42, made a surprise appearance as a “slightly nerdy” team member in an ad shared via the Clevr Blends Instagram account on Tuesday,"
    },
    {
        "url": "https://weisradio.com/2023/12/20/meghan-markle-cameos-in-coffee-brands-instagram-update/",
        "title": "<b>Meghan Markle</b> cameos in coffee brand’s Instagram update",
        "description": "For those who miss seeing Meghan Markle on camera in Suits, the so-called runaway royal plays multiple members of a hard-working coffee company team in a new Instagram video. Markle appears in a post from Clevr,"
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-markle-returns-to-acting-roots-with-cameo-in-coffee-ad",
        "title": "<b>Meghan Markle</b> Returns to Acting Roots with Cameo in Coffee Ad",
        "description": "Meghan Markle has been known to pitch in to help her friends, but her latest surprise appearance takes her generosity to another level. Markle appeared in an Instagram video for adaptogenic beverage brand Clevr, playfully hustling through roles in packing and order fulfillment, keeping the website updated, and lending a hand to the operations team."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/another-striking-royal-christmas-portrait-180413773.html",
        "title": "Another Striking Royal Christmas Portrait Unveiled Just Days After <b>Meghan Markle</b> &amp; Kate Middleton Reveal Theirs",
        "description": "Kate Middleton, 41, and Prince William, 41, were the first members of the British royal family to release their Christmas card for 2023. Next came King Charles, 75, and Queen Camilla, 76, who shared their festive greeting on the Instagram page dedicated to the royal family."
    },
    {
        "url": "https://uk.news.yahoo.com/inside-meghan-markle-prince-harry-150400875.html",
        "title": "Inside <b>Meghan Markle</b> and Prince Harry’s Christmas Plans Away From the Royals",
        "description": "There will be no Christmas reunion between Meghan Markle, Prince Harry, and the British royal family. Multiple sources told Us Weekly the Sussexes&#39; plan."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12884749/meghan-markle-cashmere-hoodie-clevr-advert.html",
        "title": "<b>Meghan Markle</b> dons £135 Cos cashmere jumper, £154 black jeans and branded hoodie as she makes surprise appearance as &#39;intern&#39; in Clevr advert",
        "description": "The Duchess of Sussex, 42, has been an investor for the California-based oat latte company since 2020 and flexed her acting skills in their latest Instagram post."
    },
    {
        "url": "https://metro.co.uk/2023/12/20/meghan-markle-stars-extra-christmas-advert-coffee-company-20001521/?ico=trending-module_category_uk_item-6",
        "title": "<b>Meghan Markle</b> stars as extra in Christmas advert for coffee company",
        "description": "The Duchess of Sussex has yet again jumped in to help a friend, featuring in a Christmas advert. Meghan Markle appeared in the Instagram ad for Clevr Blends, a California-based ‘wellness brand’. Wearing a casual outfit, the royal is seen pacing around with a laptop, making hot drinks and stacking boxes in their warehouse."
    },
    {
        "url": "https://metro.co.uk/video/meghan-markle-appears-extra-stacking-boxes-new-coffee-firm-advert-3085425/",
        "title": "Video: <b>Meghan Markle</b> appears as an extra stacking boxes in new coffee firm advert",
        "description": "Share this article via messenger Share this article via email Share this article via sms Share this article via flipboard"
    },
    {
        "url": "https://uk.style.yahoo.com/watch-meghan-markle-stars-intern-080946655.html",
        "title": "Watch: <b>Meghan Markle</b> stars in first role since royal book scandal",
        "description": "The Duchess of Sussex features as a background extra in a new Instagram advert for coffee company Clever Blends. Megan, who holds a share in the company, is seen as an intern stacking boxes, making hot drinks,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509806/meghan-markle-takes-on-surprising-role-as-an-intern-packing-boxes-in-new-coffee-ad/?campaign=hellous",
        "title": "<b>Meghan Markle</b> takes on surprising role as an intern packing boxes in new coffee ad",
        "description": "Meghan Markle, the Duchess of Sussex, showcased her light-hearted side in a recent Instagram advertisement for Clevr Blends, where she humorously took on the role of an intern."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-pops-slightly-nerdy-050256873.html",
        "title": "<b>Meghan Markle</b> Pops up as &#39;Slightly Nerdy&#39; Digital Staffer in Cheeky Video for Her Favorite Latte Company: Watch!",
        "description": "The Duchess of Sussex appeared in a video uploaded on Clevr &#39;s Instagram page Tuesday. The instant latte brand teased Meghan&#39;s appearance by writing in the caption, &quot;Damn, you&#39;re keeping us BUSY right now! Had to call in some reinforcements 👀.&quot;"
    },
    {
        "url": "https://www.northwestgeorgianews.com/watch-meghan-markle-branded-awkward-in-latest-appearance-with-coffee-company/video_ca44fb8a-d60e-5398-a1ce-699b604e5b16.html",
        "title": "WATCH: <b>Meghan Markle</b> branded &#39;awkward&#39; in latest appearance with coffee company",
        "description": "<b>Meghan Markle</b> has been mocked by GB News hosts Emily Carver and Ben Leo after making a cameo appearance in a coffee company&#39;s social media clip.The Duchess of Sussex features in a new video posted by coffee brand Clevr Blends, who the royal has previously ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/did-catch-hidden-message-prince-223205817.html",
        "title": "Did You Catch the Hidden Message In Prince Harry and <b>Meghan Markle</b>’s Holiday Card?",
        "description": "But there’s a detail of the Sussex holiday card you may have missed, a body language expert told The Daily Express. Darren Stanton believes that, while the card may look more “corporate,” that Harry and Meghan are subtly communicating their happiness to the public. (In the photo, both beam widely.)"
    }
]