[
    {
        "url": "https://www.hindustantimes.com/world-news/us-news/prince-harry-finally-reveals-how-he-found-out-about-king-charles-cancer-any-sickness-brings-101708127872358.html",
        "title": "Prince Harry finally reveals how he found out about King Charles’ cancer: ‘Any sickness brings..’",
        "description": "Prince Harry on King Charles&#39; cancer in new interview: ‘Could help…’ &quot;During an interview on Friday at the Invictus Games One Year to Go event in Whistler, Canada, Good Morning America correspondent Will Reeve inquired of the Duke of Sussex,"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-return-royal-role-support-king-charles/",
        "title": "Prince Harry &#39;willing to return to royal role&#39; to support King Charles and help heal family rift",
        "description": "Prince Harry and <b>Meghan Markle</b>. Picture: Alamy It comes after Harry suggested the King&#39;s illness could lead to a reconciliation with his father in an interview on Friday. He also said he loved his family and that he was &quot;grateful&quot; to be able to spend time ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/michael-bubl-s-outrageously-romantic-32147349",
        "title": "Michael Bublé &#39;s outrageously romantic gesture to <b>Meghan Markle</b> as he joins Sussexes in Canada",
        "description": "Meghan Markle and Prince Harry were seen hanging out with the King of Christmas, Michael Bublé at the Invictus Games Vancouver Whistler in Canada. Michael and Meghan in 2015"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-king-charles-iii-cancer-diagnosis_n_65cd31f1e4b0087d43c8e75b",
        "title": "Prince Harry Speaks Publicly About King Charles&#39; Cancer Diagnosis For The First Time",
        "description": "Buckingham Palace publicly confirmed Charles’s diagnosis Feb. 5, but not did disclose which type of cancer he has or its severity. The palace also noted that the 75-year-old “will continue to undertake State business and official paperwork as usual” while undergoing treatment."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13093799/meghan-markle-canada-ice-rink-prince-harry-wheelchair-curling-game.html",
        "title": "<b>Meghan Markle</b> makes a very elegant appearance at Canada ice rink in $1,295 cape coat and $1,195 riding boots as she cheers on Prince Harry in wheelchair curling game",
        "description": "The 42-year-old Duchess of Sussex was the epitome of &#39;quiet luxury&#39; in her ensemble, which featured a $1,295 camel-colored cape coat from female-owned Canadian outerwear brand Sentaler."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867735/meghan-markle-bobsledding-prince-harry",
        "title": "<b>Meghan Markle</b>&#39;s firm two-word reply when asked if she&#39;d join Harry skeleton bobsledding",
        "description": "Prince Harry took on the skeleton track to try bobsledding, but Meghan Markle had other thoughts when asked to participate."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867726/prince-harry-wheelchair-curling-meghan-markle-michael-buble-canada",
        "title": "Prince Harry tries out wheelchair curling alongside <b>Meghan Markle</b> and Michael Buble",
        "description": "Prince Harry has been pictured trying wheelchair curling alongside Meghan Markle and Michael Buble at events tied to the 2025 Invictus Games."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/18/",
        "title": "Prince Harry breaks silence on King Charles’ cancer battle – latest news",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513646/prince-harry-meghan-markle-canada-day-three-best-photos/",
        "title": "Prince Harry and <b>Meghan Markle</b> joined by Michael Buble on final day of Canada trip - best photos",
        "description": "And they weren&#39;t the only VIPs in attendance, as Canadian singer, Michael Buble, and his wife, Luisana Lopilato, joined them on the ice! Prince Harry and Meghan travelled north of Montecito to meet Invictus Games competitors at training camps in Whistler and Vancouver to mark the one-year countdown to the 2025 Winter Games."
    },
    {
        "url": "https://www.vogue.co.uk/article/why-prince-harry-and-meghan-markle-changed-their-childrens-last-names",
        "title": "Why Prince Harry And <b>Meghan Markle</b> Changed Their Children’s Last Names",
        "description": "When Prince Harry and Meghan Markle ’s first child, Archie, was born in May 2019, the couple announced their son’s full name was Archie Harrison Mountbatten-Windsor. However, in 2024, they’ve officially decided to use the last name of “Sussex” for both Archie and their daughter, Lilibet."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-prince-harry-not-204426066.html",
        "title": "<b>Meghan Markle</b> and Prince Harry &quot;Will Not Be Broken&quot; Over Recent Backlash",
        "description": "Prince Harry and Meghan Markle are used to the haters, so a little criticism over their recent rebrand isn&#39;t going to tear them down. Earlier this week, the couple revealed their new website sussex.com, which was met with some backlash as naysayers accused them of trying to reclaim their royal titles and status."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13093205/prince-harry-meghan-markle-king-charles-cancer-citizenship-interview.html",
        "title": "Prince Harry&#39;s most fashionable fan! Glamorous <b>Meghan Markle</b> cheers on her grinning husband as he competes against Michael Buble in wheelchair curling - hours after opening up ...",
        "description": "Prince Harry put the furor surrounding his latest television appearance on ice today - quite literally - when he tried his hand at yet another winter sport in Vancouver today: wheelchair curling."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-wore-thing-herm-203626098.html",
        "title": "<b>Meghan Markle</b> Wore a Thing: Hermès Puffer Coat Edition",
        "description": "Meghan Markle gave us another dose of wintry fashion inspiration while attending the Invictus Games Vancouver Whistler 2025 Winter Training Camp. The Duchess once again went with a tonal look on the Canadian slopes after sporting pale neutrals the day before."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-hit-192328928.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Hit Back at Recent Criticism: &#39;This Couple Will Not Be Broken&#39;",
        "description": "They’re still working and pursuing what they believe in, despite constantly being challenged and criticized,” a spokesperson for the couple reportedly said"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25995185/no-interest-prince-harry-meghan-wasnt-royal-links/",
        "title": "No one would be remotely interested in Harry and <b>Meghan</b> if it wasn’t for their Royal links, claims author",
        "description": "A ROYAL author has claimed that nobody would be interested in the Duke and Duchess of Sussex if it wasn’t for their Royal links. Royal editor Ingrid Seward exclusively told The Sun’s"
    },
    {
        "url": "https://www.instyle.com/prince-harry-king-charles-reunifying-royal-family-8584282",
        "title": "Prince Harry Thinks King Charles&#39;s Cancer Diagnosis Could Have a “Reunifying Effect&quot; on the Royal Family",
        "description": "Prince Harry revealed that he’s hoping King Charles’s cancer diagnosis can bring the royal family back together after years of tension. Read his full quote here."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46818132/can-royal-family-members-have-dual-citizenship/",
        "title": "Can British Royal Family Members Have Dual Citizenship?",
        "description": "Now you’re probably curious about Meghan and Harry’s two children, who do possess both U.K. and U.S. citizenship. When Prince Archie and Princess Lilibet were born, they automatically became dual citizens, since both of their parents were citizens of their respective countries at the time of their birth."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-breaks-silence-king-221600073.html",
        "title": "Prince Harry breaks silence on King Charles’ cancer diagnosis during ‘GMA’ interview",
        "description": "Prince Harry and King Charles appear to have put some of their differences aside in the wake of the British monarch’s cancer diagnosis. The Duke of Sussex, 39, broke his silence on the matter for an interview with “Good Morning America” while he and wife Meghan Markle were attending a training camp for the 2025 Invictus Winter Games in Whistler,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-former-co-star-32145750",
        "title": "<b>Meghan Markle</b>&#39;s former co-star claimed there was a &#39;foul&#39; stench at Sussexes wedding",
        "description": "Rick Hoffman - who appeared alongside the Duchess of Sussex - said he smelled a foul odour whilst he was a guest at her and Prince Harry&#39;s wedding in May 2018."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25977012/prince-harry-good-morning-america-interview-king-charles/",
        "title": "<b>Meghan Markle</b> was ‘snubbed’ from Good Morning America interview because she couldn’t be trusted, royal expert claims",
        "description": "MEGHAN Markle may have been told not to appear in Prince Harry’s bombshell interview by her new PRs, a royal expert has claimed. The Duke of Sussex this morning appeared on Good Morning"
    },
    {
        "url": "https://metro.co.uk/2024/02/16/harrys-one-key-gesture-suggests-wants-unity-family-20295621/?ico=metro-posts_article_whats-trending-now",
        "title": "Harry’s one key gesture that suggests he wants ‘unity’ with his family",
        "description": "The prince, 39, flew to the UK without his wife <b>Meghan Markle</b> and their children, Prince Archie, four, and Princess Lilibet, two, less than 24 hours after the announcement about His Majesty’s diagnosis was made public by Buckingham Palace."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-skeleton-sled_n_65cf55d3e4b0f7fbe7b258e5",
        "title": "Prince Harry Zooms Down Skeleton Sled Track: &#39;Everybody Should Do This&#39;",
        "description": "Harry hit high speeds as he and wife Meghan Markle visited the site of the 2025 Invictus Games in Whistler, British Columbia."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-meghan-markle-relaunch-092552707.html",
        "title": "Can Prince Harry and <b>Meghan Markle</b> Make Their Relaunch Work?",
        "description": "Photo Illustration by Luis G. Rendon//GettyPrince Harry and Meghan Markle’s return to public view was always going to be dramatic—if there is one thing their supporters and detractors can agree on, it is their innate talent to cause a stir."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-makes-first-move-32139565",
        "title": "<b>Meghan Markle</b> &#39;makes first move&#39; in mending relationship with Kate after lengthy feud",
        "description": "The Duchess of Sussex is said to have reached out to the Princess of Wales after her abdominal surgery last month while Harry is trying to make amends with his sick father, King Charles."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513656/i-joined-prince-harry-and-meghan-markle-for-day-three-in-vancouver-the-surprise-of-my-life/",
        "title": "I joined Prince Harry and <b>Meghan Markle</b> for day three in Vancouver - and got the surprise of my life",
        "description": "In classic Harry and <b>Meghan</b> fashion, they spent a lot of time meeting all of the guests and participants, shaking everyone&#39;s hands and hearing their personal stories. Michael did the same, alongside his wife Luisana Lopilato, and once they were in lane ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-wears-dianas-18000-32128958?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan Markle</b> wears Diana&#39;s £18,000 watch as she and Harry are accused of &#39;exploitation&#39;",
        "description": "<b>Meghan Markle</b> proudly modelled Princess Dianna&#39;s £18,000 watch after she and Harry were accused of exploiting royal links. It comes after <b>Meghan</b> dressed up in the keepsake for her podcast promo. <b>Meghan Markle</b> dazzled in Princess Diana&#39;s £18,000 Cartier ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/tiger-woods-brings-cashmere-golf-212121472.html",
        "title": "Tiger Woods Brings Cashmere to the Golf Course and New Looks From His Sun Day Red Clothing Brand at Genesis Invitational",
        "description": "Tiger Woods has transformed The Genesis Invitational tournament into a marketing moment for his new clothing and lifestyle brand, Sun Day Red. While playing the first rounds of the golf tournament at Riviera Country Club in Pacific Palisades, Calif., Woods was clad head-to-toe in pieces from his newest business venture."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/prince-harry-meghan-markle-surname-change",
        "title": "Prince Harry and <b>Meghan Markle</b> have changed their children&#39;s surnames",
        "description": "Yes, Prince Harry and Meghan Markle appear to have changed their children&#39;s surnames, with the miniature royals now listed on the site as &quot;Archie Sussex&quot; and &quot;Lilibet Sussex&quot;."
    },
    {
        "url": "https://www.instyle.com/prince-harry-proud-dad-comments-8584159",
        "title": "Prince Harry Says Prince Archie and Princess Lilibet Have “an Incredible Sense of Humor”",
        "description": "Prince Harry talked about his and Meghan Markle’s children, Prince Archie and Princess Lilibet, and how they’re growing up, noting they have an “incredible sense of humor.”"
    },
    {
        "url": "https://metro.co.uk/2024/02/16/harrys-one-key-gesture-suggests-wants-unity-family-20295621/?ico=related-posts",
        "title": "Harry’s one key gesture that suggests he wants ‘unity’ with his family",
        "description": "‘Harry’s one key gesture that he used emphatically here was a raising of both cupped hands to chest level and a “pushing” movement to suggest a strong desire for unity and the kind of protection a close family can provide,’ Judi said."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-another-proud-wife-153938094.html",
        "title": "<b>Meghan Markle</b> Has Another Proud Wife Moment as She Films Prince Harry&#39;s Daredevil Skeleton Ride",
        "description": "In a video captured by Elizabeth Holmes and shared on Instagram, Meghan holds out her phone before covering her mouth, laughing and cheering as Harry approaches. The Duchess of Sussex, 42, flinches backward as her husband, 39, cruises by before making sure to film the end of his run."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/meghan-harrys-children-archie-lilibets-32142975",
        "title": "<b>Meghan</b> and Harry&#39;s children Archie and Lilibet&#39;s new names explained",
        "description": "Meghan Markle and Prince Harry have broken a 64-year Royal tradition by referring to their children, Archie and Lilibet, by their new surnames on their revamped website, Sussex.com"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-breaks-silence-dad-9104475",
        "title": "Prince Harry breaks silence on dad King Charles&#39; cancer diagnosis after UK visit",
        "description": "Prince Harry has spoken out for the first time about his father&#39;s cancer diagnosis after he rushed to the UK to spend time with King Charles"
    },
    {
        "url": "https://graziadaily.co.uk/life/in-the-news/prince-harry-interview-today/",
        "title": "Prince Harry Addresses Rift In Light Of King Charles’ Cancer: ‘I Love My Family’",
        "description": "Prince Harry has opened up about King Charles&#39; cancer for the first time during an appearance on Good Morning America. Read more on Grazia."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-world-142250641.html",
        "title": "Prince Harry and <b>Meghan Markle</b> Have &#39;World Paying Attention&#39; to Veterans Through Invictus Games (Exclusive)",
        "description": "&quot;It was really nice to see them again,&quot; an Invictus Games alumni tells PEOPLE about reconnecting with the Duke and Duchess of Sussex in Canada"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-why-doesnt-the-duke-stay-in-clarence-house-when-he-visits-the-king_art21169.html",
        "title": "Prince Harry: Why doesn&#39;t the Duke stay in Clarence House when he visits the King?",
        "description": "During his express trip from the United States to the UK visit his father King Charles, Prince Harry did not sleep at a royal residence. Meghan Markle&#39;s husband spent the"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-opens-home-life-133121441.html",
        "title": "Prince Harry Opens Up About Home Life with Prince Archie and Princess Lilibet: ‘They Make Us Laugh’",
        "description": "The Duke of Sussex, who is in Canada for the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations alongside wife Meghan Markle, 42, opened up to Good Morning America on Friday about life in California with the couple&#39;s children, Prince Archie, 4, and Princess Lilibet, 2."
    },
    {
        "url": "https://www.heart.co.uk/news/prince-harry-king-charles-cancer-diagnosis-unify-royal-family/",
        "title": "Prince Harry says King Charles&#39; cancer diagnosis could &#39;unify&#39; the family",
        "description": "Prince Harry and <b>Meghan Markle</b> spoke to Good Morning America during a visit to Vancouver ahead of the Invictus Games 2025. Picture: Getty Harry went on to reflect on how illness in a family can help to unify people, after the reporter noted how often these ..."
    },
    {
        "url": "https://www.devonlive.com/news/celebs-tv/meghan-markle-prince-harry-break-9105094",
        "title": "<b>Meghan Markle</b> and Prince Harry break 64-year-old Royal tradition",
        "description": "Prince Harry and Meghan Markle have given their kids, Princess Lilibet and Prince Archie, a new surname as they break a 64 year old Royal tradition"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68314330?at_link_type=web_link&at_ptr_name=facebook_page&at_link_origin=BBC_News&at_campaign=Social_Flow&at_format=link&at_campaign_type=owned&at_medium=social&at_link_id=999A39F0-CCD0-11EE-8168-5814423A1DFE&at_bbc_team=editorial",
        "title": "Prince Harry speaks for the first time about King&#39;s cancer diagnosis",
        "description": "Prince Harry was speaking in his first interview since the King postponed all public-facing duties because of his cancer diagnosis. In 2020, the prince moved to the US with his wife, Meghan Markle, Duchess of Sussex, after they stepped back as senior royals."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/harry-meghan-markle-coat-of-arms-b2497375.html",
        "title": "Royal expert spots three mistakes in Harry and <b>Meghan</b>’s new coat of arms",
        "description": "The mistakes are unnoticable to the average eye but a royal expert explains how he thinks the Sussexes got it wrong"
    },
    {
        "url": "https://www.instyle.com/meghan-markle-black-and-navy-outfit-canada-8584076",
        "title": "<b>Meghan Markle</b>&#39;s Latest Winter Look Just Broke an Old-School Fashion Rule",
        "description": "Meghan Markle wore the taboo color combination of black and blue during her second day in Canada. See her look here."
    },
    {
        "url": "https://goss.ie/royals/prince-harry-reveals-his-children-archie-and-lilibet-keep-him-grounded-370756",
        "title": "Prince Harry reveals his children Archie and Lilibet ‘keep him grounded’",
        "description": "Prince Harry has revealed that his children Archie and Lilibet “keep him grounded.” The Duke of Sussex shares his two children with wife Meghan Markle – Archie, 4, and Lilibet, 2. The 39-year-old opened up to Will Reeves in an interview with Good Morning America that went live on Friday."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/prince-harry-good-morning-america-interview-king-charles-20290957/?ico=more_text_links",
        "title": "Prince Harry says Charles’s diagnosis will help ‘reunify’ the family",
        "description": "Harry flew over without his wife <b>Meghan Markle</b> and their children less than 24 hours after the announcement about His Majesty’s upcoming treatments was made to the nation by Buckingham Palace. When asked how the visit was for him emotionally ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12215868/prince-harry-meghan-markle-issue-defiant-statement/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> blast ‘we cannot be broken’ in defiant statement after fierce criticism of Sussex rebrand",
        "description": "PRINCE Harry and Meghan Markle have issued a defiant “we cannot be broken” statement amid fierce criticism of their rebrand. The couple this week ditched their Archewell website"
    },
    {
        "url": "https://www.glamourmagazine.co.uk/article/meghan-markle-winter-whites-vancouver",
        "title": "<b>Meghan Markle</b> proves she’s a true snow queen in her chic and toasty winter whites",
        "description": "I know she&#39;s a California girl, but Meghan Markle obviously knows her way around cold-weather outerwear. The Sussexes have arrived in snowy British Columbia for the Invictus Games, and in photos from the ski slopes on February 14,"
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/fashion/meghan-markles-chic-sorel-snow-32140859",
        "title": "<b>Meghan Markle</b>&#39;s chic Sorel snow boots are currently on sale and perfect for winter holidays",
        "description": "If you&#39;re in need of a warm and practical pair of snow boots, Meghan Markle&#39;s chic ones from Sorel are currently on sale and they&#39;re perfect for a winter getaway"
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/5/",
        "title": "Prince Harry breaks silence on King Charles’ cancer battle – latest news",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://news.stv.tv/world/prince-harry-to-talk-about-kings-cancer-diagnosis-in-new-tv-interview",
        "title": "Prince Harry to talk about King&#39;s cancer diagnosis in new TV interview",
        "description": "Prince Harry will discuss King Charles&#39; cancer diagnosis for the first time publicly in a new TV interview. Prince Harry will discuss King Charles’ cancer diagnosis for the first time publicly in a new TV interview."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/queens-brutal-two-word-assessment-9102837",
        "title": "Queen&#39;s brutal two-word assessment of <b>Meghan Markle</b> and Prince Harry&#39;s wedding",
        "description": "A brand new Royal book that examines the complex relationship between the late Queen and King Charles has hit the shelves"
    },
    {
        "url": "https://www.devonlive.com/news/uk-world-news/meghan-markle-prince-harry-hold-9104403",
        "title": "<b>Meghan Markle</b> and Prince Harry hold hands in defiant display as they hit the slopes",
        "description": "Meghan Markle and Prince Harry have been given new names on their website Sussexes.com, with their children Archie and Lilibet also being referred to differently"
    },
    {
        "url": "https://www.leeds-live.co.uk/news/uk-world-news/prince-harry-breaks-silence-king-28645056",
        "title": "Prince Harry breaks silence on King Charles&#39; cancer diagnosis after UK visit",
        "description": "A source previously told The Mirror that there was &quot;nothing in the diary&quot; for them to meet, with William reportedly focusing entirely on Princess Kate&#39;s recovery from surgery at the moment. Harry returned to Los Angeles on Wednesday, having spent just over 24 hours in the UK."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markle-reaches-out-kate-28644954",
        "title": "<b>Meghan Markle</b> &#39;reaches out&#39; to Kate Middleton as Duchess &#39;open to reconciling&#39;",
        "description": "Meghan Markle is said to have reached out to Kate Middleton as the Duchess of Cambridge is &#39;open to reconciling&#39; with the Sussexes after her recent health scare"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markles-8k-outfit-date-28644952",
        "title": "<b>Meghan Markle</b>&#39;s £8k outfit for date night with Prince Harry after 12-hour fashion spree",
        "description": "Meghan Markle and Prince Harry enjoyed a romantic date night in Canada, and the Duchess of Sussex wore a chic Loro Piana coat, which she previously wore to promote her children&#39;s book The Bench"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/meghan-markle-prince-harry-break-9104356",
        "title": "<b>Meghan Markle</b> and Prince Harry break Royal tradition to give children new surname",
        "description": "Prince Harry and Meghan Markle have given their kids, Princess Lilibet and Prince Archie, a new surname as they break a 64-year-old Royal tradition"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-left-late-queen-32140558",
        "title": "<b>Meghan Markle</b> left late Queen &#39;uncomfortable&#39; after Charles&#39; kind gesture on wedding day",
        "description": "The Duke and Duchess of Sussex did not follow royal tradition for several elements of their wedding but one moment of the big day made the late Queen feel particularly uncomfortable, according to a new book."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-rick-hoffman-reveals-he-smelt-something-foul-at-their-wedding_art21164.html",
        "title": "Prince Harry and <b>Meghan</b>: Rick Hoffman reveals he smelt something &#39;foul&#39; at their wedding",
        "description": "On TV Prince Harry and Meghan Markle’s wedding looked perfect and idyllic. But one guest reveals a ‘foul’ experience he had when"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-interview-king-charles-cancer-news-b2497295.html",
        "title": "Prince Harry interview - live: Duke breaks silence on King Charles’s cancer on Good Morning America",
        "description": "Prince Harry has spoken about his father&#39;s cancer for the first time since the King&#39;s diagnosis earlier this month. In an interview with Good Morning America, the Duke of Sussex said he &quot;loved his family&quot; and that he was &quot;grateful&quot; he was able to fly to the UK to see Charles after the news was made public."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/amanda-holden-completely-naked-shoot-32139748",
        "title": "Amanda Holden looks ageless at 53 as she poses completely naked for sexy shoot on rocky landscape",
        "description": "Britain&#39;s Got Talent judge Amanda Holden has celebrated her 53rd birthday by posing in her birthday suit on the edge of a cliff"
    },
    {
        "url": "https://goss.ie/royals/prince-harry-to-talk-about-kings-cancer-diagnosis-in-new-tv-interview-with-good-morning-america-370664",
        "title": "Prince Harry ‘to talk about King’s cancer diagnosis’ in new TV interview with Good Morning America",
        "description": "Prince Harry is reportedly to discuss the King’s recent cancer diagnosis in a new TV interview with Good Morning America. The Duke of Sussex will open up about his life with Meghan and how his father is doing,"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-stokes-palace-ire-120715554.html",
        "title": "King’s Friends Accuse Harry of ‘Sickening’ Abuse of Dad’s Cancer in ‘GMA’ Interview",
        "description": "Can Prince Harry and <b>Meghan Markle</b> Make Their Relaunch Work? Harry was being interviewed by GMA presenter Will Reeve, son of the Superman actor Christopher Reeve, who went on to make an apparent reference to his late father’s paralysis, saying ..."
    }
]