[
    {
        "url": "https://uk.news.yahoo.com/patrick-j-adams-thought-hed-204641551.html",
        "title": "Patrick J. Adams Thought He&#39;d Closed the &#39;History Book&#39; on “Suits” Before Show&#39;s &#39;Strange&#39; Second Swell (Exclusive)",
        "description": "Adams reunited with his former &#39;Suits&#39; costars, Gabriel Macht, Sarah Rafferty and Gina Torres at the 2024 Golden Globes on Sunday"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/first-royal-arrival-2024-prince-204057640.html",
        "title": "The First Royal Arrival of 2024! Prince Felix and Princess Claire of Luxembourg Welcome Third Child",
        "description": "The name Balthasar has Greek origins and has a royal meaning: &quot;God protects the king,&quot; according to Nameberry. Balthasar was also one of the biblical three kings who visited the infant Jesus, a fitting name given that the new prince arrived near the feast of the Epiphany."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/zara-mike-tindall-hang-prince-203740869.html",
        "title": "Zara and Mike Tindall Hang Out with Prince Harry&#39;s Polo Pals at Equestrian Event in Australia",
        "description": "Zara rode against Nacho Figueras and Delfina Blaquier in a playful celebrity polo match at the equestrian festival"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/news/golden-globes-2024-host-ratings-news-b2475268.html",
        "title": "Golden Globes 2024 live: Awards show sees huge ratings boost with controversial host",
        "description": "At last night’s joke-free Globes, ‘Barbie’ took home just two awards – Best Original Song and a controversial new category celebrating ‘Best Box Office Achievement’, with Margot Robbie, Ryan Gosling and Greta Gerwig otherwise snubbed. Adam White asks what this means for its award season future"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-not-suits-group-31836534",
        "title": "<b>Meghan Markle</b> not in Suits group chat for brutal reason according to former co-star",
        "description": "Suits actress Gina Torres explained why the Duchess of Sussex was absent from the group reunion at the Golden Globe Awards over the weekend."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12939419/Meghan-Markle-wasnt-invited-Suits-reunion-Golden-Globes-Patrick-J-Adams-Gabriel-Macht-Sarah-Rafferty-dont-number-reveals-former-star-Gina-Torres.html",
        "title": "<b>Meghan Markle</b> didn&#39;t join Suits reunion at Golden Globes because of a &#39;previous commitment&#39;, awards insider claims - as former co-star Gina Torres says the cast &#39;don&#39;t have her ...",
        "description": "Speaking to Page Six , a source alleged that the Duchess of Sussex was asked to come, but &#39;unfortunately&#39; wasn&#39;t able to make an appearance because of other plans."
    },
    {
        "url": "https://www.ladbible.com/entertainment/netflix/suits-netflix-spinoff-update-982587-20240108",
        "title": "Suits star shares update on spin-off after series had huge resurgence on Netflix",
        "description": "Suits has earned a new generation of fans since landing on Netflix and Patrick J. Adams revealed he wouldn&#39;t mind reprising his role as Mike Ross."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853400/prince-harry-regret-statement-meghan-markle-quit-royal-family",
        "title": "Prince Harry &#39;regretted&#39; bombshell statement as he and <b>Meghan Markle</b> quit Royal roles",
        "description": "Prince Harry and Meghan Markle sent shockwaves around the world when they announced they were stepping back from their Royal roles on this day in 2020."
    },
    {
        "url": "https://www.hellomagazine.com/film/510807/suits-star-gabriel-macht-on-why-meghan-markle-and-co-stars-probably-wont-return-for-reboot-exclusive/",
        "title": "Exclusive: Suits star Gabriel Macht on why <b>Meghan Markle</b> and co stars &#39;probably won&#39;t return for reboot&#39;",
        "description": "Meghan Markle &#39;s hit USA series Suits has found renewed success in the past year, leading to showrunner Aaron Korsh working on an upcoming reboot. Star Gabriel Macht tells HELLO! why the cast probably won&#39;t return – although his phone line is always open."
    },
    {
        "url": "https://www.theguardian.com/wellness/2024/jan/08/does-face-yoga-work-exercise",
        "title": "I tried face yoga. I hate that I spent any of my wild, precious life on it",
        "description": "Like <b>Meghan Markle</b> or Gwyneth Paltrow. The Kardashians once worked with face yoga expert Koko Hayashi, who charges $350 for a 50-minute private online session. So if the famously beautiful are into it, what is this wretched mortification of the flesh ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-left-out-suits-31834984.amp",
        "title": "<b>Meghan Markle</b> left out of Suits reunion as co-stars make confession at Golden Globes",
        "description": "Meghan Markle has reportedly been left out of the Suits reunion despite portraying lead character Rachel Zane in the show, as her co-stars admit they can&#39;t reach her"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853353/prince-harry-meghan-markle-cautious-2024-failure",
        "title": "Prince Harry and <b>Meghan Markle</b> set for &#39;cautious&#39; 2024 after &#39;credibility lost&#39;",
        "description": "Prince Harry and <b>Meghan Markle</b> have made a lot of money since stepping back from Royal duties, but one key failure will make them more &quot;cautious&quot; in 2024, says an expert. Today is the fourth anniversary of the Sussexes&#39; decision to leave their Royal roles ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25288290/meghan-markle-suits-star-duchess-wasnt-invited-golden-globes/",
        "title": "<b>Meghan Markle</b>’s Suits co-star reveals why the Duchess wasn’t invited to the Golden Globes reunion",
        "description": "SUITS fans got a treat last night as most of the cast had a heartwarming reunion at the Golden Globes. However, one key star, Meghan Markle – who played paralegal Rachel Zane on the hit"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-andrews-uncomfortable-encounter-well-155440962.html",
        "title": "Prince Andrew&#39;s Uncomfortable Encounter with Well-Wishers on Christmas Caught on Camera",
        "description": "A crowd of well-wishers captured a bizarre exchange with the Duke of York, who is no longer a working member of the royal family"
    },
    {
        "url": "https://metro.co.uk/2024/01/08/fans-call-shade-targeted-meghan-markle-suits-reunion-20082860/?ico=trending-post-strip_item_2",
        "title": "Suits cast accused of ‘shading’ <b>Meghan Markle</b> with bombshell at reunion",
        "description": "Meghan Markle ’s former Suits co-stars have been accused of ‘shading’ her after it was revealed she wasn’t part of their group chat. At today’s Golden Globes ceremony, some of the cast of the legal drama, which ran from 2011 until 2019, appeared on stage to present an award."
    },
    {
        "url": "https://www.ladbible.com/entertainment/celebrity/meghan-markle-suits-golden-globes-gina-torres-942908-20240108?c=1704724051880",
        "title": "Suits star is brutally honest after being asked why <b>Meghan Markle</b> didn&#39;t join cast at Golden Globes",
        "description": "The cast of Suits are just like the rest of us and love a group chat - but Meghan Markle is not in it, much to the surprise of fans."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-left-out-of-sandhurst-guide-they-also-served-british-army-b1130967.html",
        "title": "Prince Harry left out of Sandhurst guide to most notable graduates",
        "description": "Prince Harry has not been included in a book celebrating the Sandhurst&#39;s top 200 alumni. The Duke of Sussex was left out of the guide called They Also Served, by Vaughan Kent-Payne, despite his brother William being included and writing the foreword."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-accused-asking-queen-31833327",
        "title": "Prince Harry accused of &#39;asking Queen for money&#39; in embarrassing Golden Globes roasting",
        "description": "Prince Harry was savagely mocked during the Golden Globe Awards, and accused of &#39;asking the Queen for money&#39; while being paid &#39;millions of dollars for doing absolutely nothing&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/08/harry-and-meghan-mocked-in-golden-globes-joke-about-the-cro/",
        "title": "Duke and Duchess of Sussex’s finances mocked in Golden Globes joke about The Crown",
        "description": "The Duke and Duchess of Sussex were mocked at the Golden Globes on Sunday night as the ceremony’s host cracked jokes about their finances. Comedian Jo Koy, who was revealed as the host of the awards ceremony less than three weeks ago, levelled two jokes against Prince Harry and Meghan in his opening monologue."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/suits-gabriel-macht-breaks-silence-31832796",
        "title": "Suits&#39; Gabriel Macht breaks silence on <b>Meghan Markle</b>&#39;s potential return to show",
        "description": "A former co-star of the Duchess who worked alongside her on the show has broken his silence on a potential return."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937757/Golden-Globes-Jo-Koy-outrage-Royal-Family-Prince-Harry-Meghan-Markle.html",
        "title": "Golden Globes 2024: Host Jo Koy sparks outrage as he mocks the &#39;rich, white and dysfunctional&#39; Royal Family and quips Prince Harry and <b>Meghan Markle</b> were &#39;paid millions for ...",
        "description": "The comedian took aim at King Charles in his opening monologue by branding the family &#39;rich, white and dysfunctional&#39; while referencing Netflix&#39;s The Crown."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25249516/queen-camilla-revenge-meghan-harry-podcast/",
        "title": "Queen Camilla ‘finally gets her own back’ on <b>Meghan</b> &amp; Harry with the ‘perfect revenge’ – and ‘it will leave them livid’",
        "description": "QUEEN Camilla has “finally got her own back” on Prince Harry and Meghan Markle by releasing her own podcast – just months after their lucrative deal was canned.  Today, Camilla, 76,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markles-suits-co-star-31831384",
        "title": "<b>Meghan Markle</b>&#39;s Suits co-star admits Duchess is left out of group chat for brutal reason",
        "description": "There was a Suits cast reunion at the Golden Globe Awards this weekend, but Meghan Markle was absent after not being invited because she isn&#39;t in their group chat"
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-not-suits-cast-112000101.html",
        "title": "<b>Meghan Markle</b> Is Not in the ‘Suits’ Cast Group Chat — Because the Stars Don’t Have Her Number",
        "description": "<b>Meghan Markle</b> is hard to get in touch with, at least according to her former Suits costar Gina Torres. &quot;We don&#39;t have her number,” Torres, 54, told Variety while walking the Golden Globes red carpet on Sunday, January 7. &quot;We just don&#39;t, so she&#39;ll see."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-in-the-spotlight-during-golden-globes-despite-absence-why-didnt-she-attend_art20675.html",
        "title": "<b>Meghan Markle</b> in the spotlight during Golden Globes despite absence: Why didn&#39;t she attend?",
        "description": "One of Hollywood’s biggest events took place last night: the Golden Globes. Though this usually doesn’t involve real royalty, this year, Meghan Markle was on everyone’s"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-golden-globes-royal-31829518",
        "title": "<b>Meghan Markle</b>&#39;s former Suits co-stars joke about her popularity before brutal remark at Golden Globes",
        "description": "Before she left to marry Prince Harry, Meghan Markle was a star on the hit legal series Suits but her former co-stars joked about her popularity during the 81st Golden Globes"
    },
    {
        "url": "https://www.sundaystar.co.uk/royal-family-news/meghan-markle-moving-england-prince-harry/1883/",
        "title": "<b>Meghan Markle</b> &#39;caving&#39; as she considers move back to England with Prince Harry",
        "description": "HOUSE hunters Meghan Markle and Prince Harry are desperately trying to flog their £11million mansion in Montecito, California.   The"
    },
    {
        "url": "https://www.hellomagazine.com/film/510737/meghan-markle-why-not-invited-golden-globes-reunion/",
        "title": "<b>Meghan Markle</b>&#39;s Suits co-star Gina Torres reveals reason why Duchess is not on show&#39;s group chat",
        "description": "Fans of the hit show Suits were delighted when several key members of the cast reunited to present an award together at the 2024 Golden Globes, but the auspicious evening was missing Meghan Markle, who played Rachel Zane in the drama."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/golden-globes-host-joy-koy-014151556.html",
        "title": "Golden Globes host Jo Koy cracks ‘brutal’ Harry and <b>Meghan</b> joke at 2024 ceremony",
        "description": "Comedian Jo Koy shared an anti-Prince Harry and <b>Meghan Markle</b> joke at the Golden Globes. The Filipino-American comedy star didn’t hold back in his debut as host of the annual awards ceremony – a job he acquired just two weeks ago – whose winners ..."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/celebrity/meghan-harry-golden-globes-ceremony-2024-comedian-jo-koy-b1130940.html",
        "title": "Golden Globes comedian Jo Koy cracks &#39;savage&#39; joke about Harry and <b>Meghan</b> during ceremony",
        "description": "Acknowledging the jibe, he added: &quot;Like I said, I didn’t write all of these! That one wasn’t mine!&quot; He then continued: &quot;Harry and <b>Meghan Markle</b> got paid millions for doing absolutely nothing. And that&#39;s just by Netflix.&quot; Koy was addressing the ..."
    },
    {
        "url": "https://www.eastbaytimes.com/2024/01/08/harry-and-meghan-target-of-jokes-shrugs-at-golden-globes-suits-co-star-we-dont-have-her-number/",
        "title": "Harry and <b>Meghan</b> target of jokes, shrugs at Golden Globes; ‘Suits’ co-star: ‘We don’t have her number’",
        "description": "Meghan’s ‘Suits’ colleague Gina Torres was asked on the red carpet to explain why Meghan, the legal drama’s most famous cast member, wasn’t part of the show’s"
    },
    {
        "url": "https://www.stuff.co.nz/entertainment/tv-radio/301036973/golden-globes-the-moments-that-people-are-really-talking-about-at-the-awards",
        "title": "Golden Globes: The moments that people are really talking about at the awards",
        "description": "Slow down. I wrote some of these, and they’re the ones you’re laughing at.” Yikes. A Suits reunion ... Without <b>Meghan Markle</b> It’s like bringing the Harry Potter cast together and forgetting to invite Daniel Radcliffe – what’s a Suits “reunion ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-accused-asking-money-31831169",
        "title": "Prince Harry accused of &#39;asking for money&#39; in embarrassing attack by Golden Globes host",
        "description": "Jo Koy took over hosting duties for this year&#39;s Golden Globe Awards and the comedian hit out at Prince Harry for &#39;asking for money&#39; during his opening monologue"
    },
    {
        "url": "https://www.standard.co.uk/culture/film/golden-globes-2024-best-moments-tv-film-awards-b1130871.html",
        "title": "Golden Globes 2024: the best moments, from Lily Gladstone&#39;s speech to Jacob Elordi&#39;s bathwater",
        "description": "Face it: one of the best parts of watching a ceremony like the Golden Globes is all the weird and wacky moments that take place over the course of the night. And this year, they certainly didn&#39;t disappoint."
    },
    {
        "url": "https://www.nme.com/news/music/taylor-swift-reaction-jo-koy-travis-kelce-joke-golden-globes-viral-3567096",
        "title": "Taylor Swift’s reaction to Jo Koy’s terrible Travis Kelce joke at Golden Globes goes viral",
        "description": "Taylor Swift has gone viral following her unimpressed reaction to one of Jo Koy’s jokes at the Golden Globes ceremony."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-humiliated-golden-31831577",
        "title": "Prince Harry and <b>Meghan</b> humiliated at Golden Globes by host Jo Koy&#39;s savage joke",
        "description": "The Sussexes did not attend the awards ceremony in LA last night but were brutally mocked alongside the rest of the Royal Family who were described as &#39;rich, white and dysfunctional&#39; in the comedian&#39;s opening speech."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/suits-patrick-j-adams-responds-105044679.html",
        "title": "Suits’ Patrick J. Adams responds to spin-off news: &quot;I&#39;d be ready to suit up again&quot;",
        "description": "Suits actor Patrick J. Adams, who played Mike Ross on the hit legal drama, has reacted to news of an upcoming L.A.-set spin-off. &quot;I think it’s all in [the] early stages. It’s a show in the Suits universe, like a &#39;Suits L.A.&#39;&quot; Adams said at the Golden Globes pre-show (via Variety )."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853174/meghan-markle-following-kardashians-public-interest",
        "title": "<b>Meghan Markle</b> &#39;following Kardashians&#39; in next steps after &#39;waning&#39; public interest",
        "description": "Meghan Markle is said to be planning a &quot;return&quot; in 2024 as she works with top publicists on &quot;exciting&quot; new career opportunities."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/news/golden-globes-prince-harry-meghan-b2474723.html",
        "title": "Golden Globes host Jo Koy cracks ‘brutal’ Harry and <b>Meghan</b> joke at 2024 ceremony",
        "description": "Oppenheimer was the big movie winner at the Golden Globes, with Succession and The Bear sweeping the TV categories. Koy seemingly left Taylor Swift unimpressed with a joke aimed at the singer, while comedian Jim Gaffigan left the audience wincing with a controversial quip addressing the unsealed Jeffrey Epsetin court records."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-extra-085227768.html",
        "title": "Prince Harry and <b>Meghan Markle</b> have some extra help with Prince Archie and Princess Lilibet as this relative moves in",
        "description": "Prince Harry and Meghan Markle will have an extra pair of hands to help with Prince Archie and Princess Lilibet as Meghan’s mum, Doria Ragland, has moved in."
    },
    {
        "url": "https://www.telegraph.co.uk/tv/2024/01/08/golden-globes-review-jo-koy-jokes-taylor-swift-monolgue/",
        "title": "Even a brutal Harry and <b>Meghan</b> joke couldn’t save this Golden Globes from disaster",
        "description": "Taylor Swift’s icy reaction to host Jo Koy’s gags said it all – this abominable orgy of backslapping and anti-humour has no reason to exist"
    },
    {
        "url": "https://graziadaily.co.uk/celebrity/news/golden-globes-host-jo-koy-booed/",
        "title": "Why Golden Globes Host Jo Koy Got Booed During His Opening Monologue",
        "description": "Jo Koy hosted the Golden Globes 2024, but his opening monologue went down like a led balloon. Find out who he offended and why. Read more on Grazia."
    },
    {
        "url": "https://uk.news.yahoo.com/suits-star-patrick-j-adams-122000925.html",
        "title": "Suits star Patrick J Adams calls for spin-off with <b>Meghan Markle</b>",
        "description": "Suits star Patrick J Adams has has revealed he would love to do a spin-off with co-star Meghan Markle, following their characters Mike Ross and Rachel Zane."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937561/Meghan-Markles-Suits-stars-present-Golden-Globes-2024.html",
        "title": "Golden Globes 2024: <b>Meghan Markle</b>&#39;s former Suits co-stars Patrick J. Adams, Gabriel Macht, Sarah Rafferty and Gina Torres reunite to present",
        "description": "A number of <b>Meghan Markle</b>&#39;s former Suits co-stars enjoyed a reunion at the 81st Golden Globe Awards on Sunday. Patrick J. Adams, 42, Gabriel Macht, 51, Sarah Rafferty, 51, and Gina Torres, 54, were tasked with presenting the Best TV Drama award."
    },
    {
        "url": "https://uk.style.yahoo.com/golden-globes-tv-review-taylor-050640139.html",
        "title": "Golden Globes TV Review: Taylor Swift, Kevin Costner &amp; “White People Roles” Help Ceremony Pick Up The Pace After Stumbling Start",
        "description": "A lot less boozy than the Golden Globes at its traditional best, the return of the once flatlining ceremony to broadcast TV on Sunday proves what every 12-step program participant knows: You got to start somewhere,"
    },
    {
        "url": "https://uk.movies.yahoo.com/why-meghan-markle-skipped-2024-011800801.html",
        "title": "Why <b>Meghan Markle</b> Skipped the 2024 Golden Globes Despite Those &#39;Suits&#39; Reunion Rumors",
        "description": "Despite those &#39;Suits&#39; reunion rumors, Meghan Markle opted not to attend the 2024 Golden Globes this evening. Here’s why."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markles-former-suits-costars-003324079.html",
        "title": "<b>Meghan Markle</b>&#39;s Former “Suits” Costars&#39; Group Chat Is &#39;Insane Right Now&#39; — but They &#39;Don&#39;t Have Her Number&#39;",
        "description": "On the Golden Globes red carpet, &#39;Suits&#39; star Gina Torres reflected on the recent resurgence of viewership for the 2010s legal drama"
    },
    {
        "url": "https://www.harpersbazaar.com/uk/culture/culture-news/a46311880/suits-cast-reunion-golden-globes/",
        "title": "The cast of Suits reunited at the Golden Globes",
        "description": "<b>Meghan</b>, the Duchess of Sussex – who played Rachel Zane ... where they&#39;re “all texting each other.” <b>Markle</b> is not part of the chat, as “we don’t have her number,” she said. “We just don’t. So she’ll see, she’ll watch."
    },
    {
        "url": "https://uk.style.yahoo.com/gina-torres-explains-why-meghan-233353019.html",
        "title": "Gina Torres explains why <b>Meghan Markle</b> is not in Suits group chat",
        "description": "She’ll be happy that we’re here,’ Torres says of Duchess of Sussex’s reaction to ‘Suits’ reunion at Golden Globes"
    }
]