[
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937561/Meghan-Markles-Suits-stars-present-Golden-Globes-2024.html",
        "title": "Golden Globes 2024: <b>Meghan Markle</b>&#39;s former Suits co-stars Patrick J. Adams, Gabriel Macht, Sarah Rafferty and Gina Torres reunite to present",
        "description": "A number of Meghan Markle&#39;s former Suits co-stars enjoyed a reunion at the 81st Golden Globe Awards on Sunday."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853883/prince-harry-meghan-markle-Sarah-Ferguson",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;followed Sarah Ferguson&#39;s lead&#39; and kept royal titles",
        "description": "Prince Harry and Meghan Markle are &quot;following Sarah Ferguson&quot; in keeping hold of their royal titles to make money in the US, according to a royal expert. US royal commentator Kinsey Schofield says the pair&#39;s titles have allowed them to “maintain the perception of royalty&quot;, giving them a status similar to reality stars."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853881/meghan-markle-suits-patrick-j-adams-hollywood-return",
        "title": "The ten words from <b>Meghan Markle</b>’s former co-star which may hint at her Hollywood return",
        "description": "Meghan Markle found fame playing Rachel Zane in Suits alongside Patrick J. Adams, but quit acting when she married Prince Harry."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-markle-the-obscure-royal-rule-that-forced-them-to-return-their-wedding-gifts_art20706.html",
        "title": "Prince Harry and <b>Meghan Markle</b>: The obscure Royal rule that forced them to return their wedding gifts",
        "description": "A little-known rule made the Duke and Duchess of Sussex return their wedding gifts worth £7 million. Here’s the obscure reason"
    },
    {
        "url": "https://www.redonline.co.uk/fashion/buyers-guide/g46316701/barrel-leg-jeans/",
        "title": "Barrel leg jeans are the flattering new denim shape you need to try now",
        "description": "For 2024, there&#39;s a hot new kid on the block: barrel leg jeans. Loved by Red &#39;s editor-in-chief Sarah Tomczak as &#39;an everyday shape to wear with heels and flats&#39;, they still have the cool wide leg that the fashion set loves, but they taper in towards the ankle for that perfect balance of elevated and effortless."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middletons-pre-royal-life-160315257.html",
        "title": "Kate Middleton&#39;s Pre-Royal Life Unveiled on TikTok: Ugg Boots and Wild Nights with Prince William!",
        "description": "Kate hits the club with Prince William in resurfaced photos making the rounds on TikTok Max Mumby/Indigo/Getty Kate Middleton attends The Day-Glo Midnight Roller Disco in September 2008 in London. Before she was a royal,"
    },
    {
        "url": "https://www.hellomagazine.com/brides/510880/carol-kirkwood-opulent-five-star-wedding-venue-links-meghan-markle/",
        "title": "Carol Kirkwood&#39;s &#39;opulent&#39; five-star wedding venue – with links to <b>Meghan Markle</b>",
        "description": "Nestled in 376 acres of Berkshire countryside, the Grade I stately home is described as having an &quot;opulent history&quot; and &quot;luxuriant interiors.&quot; Brides such as Carol can choose a range of locations to exchange vows depending on the size of their guest list."
    },
    {
        "url": "https://www.hellomagazine.com/brides/510851/king-charles-dependent-on-queen-camilla-in-intense-relationship/",
        "title": "King Charles &#39;dependent&#39; on Queen Camilla in &#39;intense&#39; relationship",
        "description": "They&#39;ve been in love a long time and it&#39;s been an intense relationship where they&#39;ve had to overcome a lot. Even looking at pictures of them when they were younger, whenever Camilla was photographed,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/inside-meghan-harrys-cost-living-31842185",
        "title": "Inside <b>Meghan</b> and Harry&#39;s cost of living crisis as they struggle to upkeep lavish lifestyle",
        "description": "The Sussexes&#39; have built up a very luxurious life for themselves since moving to the States but are facing &quot;financial challenges&quot; as they are struggling to make a success out of their careers."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/queen-camilla-plans-perfect-revenge-31841521",
        "title": "Queen Camilla plans &#39;perfect revenge&#39; on Prince Harry after his cruel attacks in Spare",
        "description": "The Duke of Sussex did not hold back when it came to his stepmother in his tell-all memoir as he branded her as a &quot;dangerous&quot; villain in the Royal Family."
    },
    {
        "url": "https://inews.co.uk/culture/queen-camilla-podcast-wont-make-royals-relatable-2844333?ico=more_from_this_author",
        "title": "Queen Camilla’s waffling podcast won’t make the royals relatable",
        "description": "Launched off the back of her books charity, The Queen&#39;s Reading Room, it has a host of literary guests - but Camilla herself is rarely heard"
    },
    {
        "url": "https://www.tivysideadvertiser.co.uk/news/24037167.hiut-denim-features-bbc-2s-inside-factory/",
        "title": "Hiut Denim features in BBC 2&#39;s Inside the Factory",
        "description": "A local manufacturer with a product favoured and fashion icons and royalty will feature in a BBC 2 series this evening."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/inside-harry-meghans-cost-living-31840454",
        "title": "Inside Harry and <b>Meghan</b>&#39;s cost of living crisis as they&#39;re &#39;more desperate than ever&#39;",
        "description": "Meghan Markle and Prince Harry have worked to become financially independent from the Royal Family, but it&#39;s been reported they&#39;re facing &#39;long-term financial challenges&#39;"
    },
    {
        "url": "https://www.westerntelegraph.co.uk/news/24037167.huit-denim-features-bbc-2s-inside-factory/",
        "title": "Huit Denim features in BBC 2&#39;s Inside the Factory",
        "description": "A local manufacturer with a product favoured and fashion icons and royalty will feature in a BBC 2 series this evening."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12941971/Did-Patrick-Adams-snub-Meghan-Markle-Suits-actor-said-Golden-Globes-asked-hed-work-Duchess-again.html",
        "title": "Did Patrick Adams snub <b>Meghan Markle</b>? What the Suits actor said at Golden Globes when asked if he&#39;d work with Duchess again",
        "description": "Suits leading man Patrick J Adams has said Meghan Markle is a &#39;fantastic actor&#39; and the industry would be &#39;lucky&#39; to have her back during an interview with E! at the Golden Globes in LA."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25295595/meghan-markle-prince-harry-failed-hollywood-desperate-royal/",
        "title": "‘Desperate’ <b>Meghan Markle</b> &amp; Prince Harry ‘have failed in Hollywood’ &amp; ‘have nothing of credibility there’, expert claims",
        "description": "MEGHAN Markle and Prince Harry have “failed in Hollywood” after failing to land new income streams, according to a royal author. This comes after the Duke and Duchess of Sussex’s £18million"
    },
    {
        "url": "https://uk.style.yahoo.com/best-kate-middleton-accessories-classic-164417971.html",
        "title": "Kate Middleton&#39;s best accessories — 7 wardrobe staples the Princess always wears",
        "description": "The Edinburgh-based accessory brand is a favourite for the royal family, with sister-in-law <b>Meghan Markle</b> among its fans. Shop the Strathberry Multrees Chain Wallet in 15 colours. No Kate Middleton accessories roundup would be complete without a pair of ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/entertainment/film-tv/golden-globes-2024-the-best-moments-from-lily-gladstones-speech-to-jacob-elordis-bathwater/a150560153.html",
        "title": "Golden Globes 2024: the best moments, from Lily Gladstone&#39;s speech to Jacob Elordi&#39;s bathwater",
        "description": "Face it: one of the best parts of watching a ceremony like the Golden Globes is all the weird and wacky moments that take place over the course of the night. And this year, they certainly didn&#39;t disappoint."
    },
    {
        "url": "https://www.ibtimes.co.uk/patrick-j-adams-wants-suits-spinoff-meghan-markle-set-seattle-1722603",
        "title": "Patrick J. Adams Wants A &#39;Suits&#39; Spinoff With <b>Meghan Markle</b> Set In Seattle",
        "description": "The &quot;Suits&quot; cast (L-R front) Gina Torres, Patrick J. Adams, Gabriel Macht, IL-R back) <b>Meghan Markle</b>, Sarah Rafferty, and Rick Hoffman. Photo: Suits Peacock/Instagram Suits Peacock/Instagram Patrick J. Adams said it would be great to have <b>Meghan Markle</b> back ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/prince-harry-meghan-markle-failed-28418475",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;failed in Hollywood&#39; - royal expert",
        "description": "A royal commentator has claimed Prince Harry and <b>Meghan Markle</b> have &#39;failed in Hollywood&#39; and are &#39;scrambling for new deals&#39;. Their lucrative Spotify deal was axed last year after they only produced one series.. Royal author Tom Bower said: “They’ve ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/inside-kate-middletons-birthday-curse-31840820",
        "title": "Inside Kate Middleton&#39;s birthday curse: The 4 times her special day was ruined",
        "description": "In the past, events involving Prince Harry and <b>Meghan Markle</b> have often taken the spotlight away from Kate&#39;s special day. From controversial memoir revelations to Megxit and even a lockdown, the Princess&#39; birthday has rarely been plain sailing. Last year ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-way-31825266?int_source=nba",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;way back to royal life&#39; and reconciliation revealed",
        "description": "Prince Harry&#39;s &quot;way back to royal life&quot; has been revealed four years after he and <b>Meghan Markle</b> announced that they were stepping down as senior working members of the British Royal Family. The Duke and Duchess of Sussex stepped down from the Monarchy in ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wants-answers-king-31781478?int_source=nba",
        "title": "<b>Meghan Markle</b> &#39;wants answers&#39; from King Charles, says royal expert",
        "description": "<b>Meghan Markle</b> reportedly wants answers from King Charles about her royal title, according to a royal expert. Neil Sean, a royal commentator, has claimed that <b>Meghan</b> and Prince Harry are confused about why they&#39;re treated differently from other royals."
    },
    {
        "url": "https://www.etonline.com/etonline-staff/monica-sisavat-solis-217607",
        "title": "Monica Sisavat Solis",
        "description": "When she&#39;s not obsessing over Prince Harry and <b>Meghan Markle</b>&#39;s latest appearance, she&#39;s probably planning her next vacation or frolicking through vineyards in Napa Valley."
    },
    {
        "url": "https://www.xfire.com/suits-reunion-fuels-hopes-of-the-return-of-familiar-faces-in-new-series/",
        "title": "New Suits Story Coming, But Will <b>Markle</b> &amp; Others Join New Characters After Ratings Surge?",
        "description": "Mike Ross is ready to return to action in the upcoming Suits series, with the hope that Rachel Zane will also be joining him."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/suits-patrick-adams-left-baffled-over-meghan-markle-rumour-she-told-you-that-220617858.html",
        "title": "Suits&#39; Patrick Adams left baffled over <b>Meghan Markle</b> rumour: &#39;She told you that?&#39;",
        "description": "Suits star Patrick Adams has responded to a rumour about Meghan Markle after being left baffled at the Golden Globes. Read more."
    },
    {
        "url": "https://pagesix.com/2024/01/09/style/kate-middleton-veja-sneakers-sale-rue-la-la/",
        "title": "Kate Middleton’s favorite Veja sneakers are 40% off for a limited time",
        "description": "Kate Middleton’s a longtime fan of French footwear brand Veja, having worn its sneakers on repeat throughout her years as a royal. And just in time for her birthday, the sleek sneakers can be yours for up to 40% off, thanks to a sweeping sale at Rue La La — but only for the next two days."
    },
    {
        "url": "https://www.btimesonline.com/articles/163167/20240110/anticipated-bombshell-for-prince-harry-and-meghan-markle-lady-colin-campbell-predicts-2024-challenges.htm",
        "title": "Anticipated &#39;Bombshell&#39; for Prince Harry and <b>Meghan Markle</b>: Lady Colin Campbell Predicts 2024 Challenges",
        "description": "Prince Harry and Meghan Markle, already under the glare of public scrutiny, might face fresh challenges in 2024, according to Lady Colin Campbell, a noted British commentator."
    },
    {
        "url": "https://www.etonline.com/why-meghan-markle-was-not-at-the-suits-reunion-at-the-golden-globes-despite-being-invited-217592",
        "title": "Why <b>Meghan Markle</b> Was Not at the &#39;Suits&#39; Reunion at the Golden Globes Despite Being Invited",
        "description": "Meghan Markle was invited to reunite with her Suits family. After Gabriel Macht, Patrick J. Adams, Sarah Rafferty and Gina Torres reunited sans Markle to present the Best Television Series, Drama category at the 2024 Golden Globes, ET has learned why the Duchess of Sussex wasn&#39;t present."
    },
    {
        "url": "https://www.outlookindia.com/art-entertainment/golden-globes-2024-here-s-why-meghan-markle-wasn-t-a-part-of-the-suits-reunion-news-341850",
        "title": "Golden Globes 2024: Here&#39;s Why <b>Meghan Markle</b> Wasn&#39;t A Part Of The &#39;Suits&#39; Reunion",
        "description": "The prestigious Golden Globes Awards took place Sunday night PT in Beverly Hills, California. Many stars marked their presence at the award ceremony. Among the list of stars were &#39;Suits&#39; stars Patrick J. Adams, Gabriel Macht, Sarah Rafferty and Gina Torres, who were asked to present the award for the Best Television Drama."
    },
    {
        "url": "https://www.btimesonline.com/articles/163163/20240110/why-did-meghan-markle-miss-the-golden-globes-2024-suits-reunion.htm",
        "title": "Why Did <b>Meghan Markle</b> Decline the Golden Globes 2024 &#39;Suits&#39; Reunion?",
        "description": "Meghan Markle, the Duchess of Sussex, was notably absent from the 2024 Golden Globes, despite being a topic of conversation during the event. The former &quot;Suits&quot; actress turned down an invitation to reunite with her castmates at the prestigious awards ceremony,"
    },
    {
        "url": "https://www.samaa.tv/208737719-meghan-markle-prince-harry-face-public-scrutiny-after-jo-koy-s-golden-globe-roast",
        "title": "<b>Meghan Markle</b>, Prince Harry face public scrutiny after Jo Koy&#39;s Golden Globe roast",
        "description": "The comedian didn&#39;t stop there, playfully referencing the acclaimed series &quot;Succession&quot; and drawing parallels with &quot;The Crown,&quot; teasing, &quot;Just a great series about a rich, white, dysfunctional family,"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2931543/prince-william-kate-middleton-want-royal-lodge/",
        "title": "Prince William &amp; Kate Middleton Reportedly Pulled Their Royal Ranking To Make This Real Estate Move",
        "description": "King Charles III is reportedly pulling away Prince Andrew ‘s security detail that he privately funds out of his own pocket after the recent Jeffrey Epstein document dump. Now, it seems that Prince William and Kate Middleton might be using their royal rank to get ahold of the Duke of York’s Royal Lodge residence."
    },
    {
        "url": "https://www.foxnews.com/entertainment/king-charles-wishes-beloved-kate-middleton-happy-birthday-amid-prince-andrews-epstein-drama",
        "title": "King Charles wishes &#39;beloved&#39; Kate Middleton happy birthday amid Prince Andrew&#39;s Epstein drama",
        "description": "Kate Middleton, the Princess of Wales, is celebrating her 42nd birthday on Jan. 9. She is married to Prince William, heir to the British throne. They share three children."
    },
    {
        "url": "https://www.outlookindia.com/topic/suits-reunion",
        "title": "Suits Reunion",
        "description": "It has been known why Meghan Markle was not a part of the popular &#39;Suits&#39; reunion at the Golden Globes. Subscribe to get complete access to Outlook Print and Digital Magazines, Web Exclusive stories and the Archive."
    },
    {
        "url": "https://madamenoire.com/1358531/meghan-markle-golden-globes-suits-reunion/",
        "title": "Golden Globes Rep Says <b>Meghan Markle</b> Turned Down ‘Suits’ Reunion Due To ‘Previous Commitment.’ Fans Aren’t Buying It",
        "description": "Fans of the TV drama Suits were able to see the cast reunite Sunday at the Golden Globes, but noticeably absent (and I mean, everybody seemed to notice) was the Duchess of Sussex herself, <b>Meghan Markle</b>. The other four members of the main cast of the hit ..."
    },
    {
        "url": "https://popculture.com/tv-shows/news/suits-star-gives-update-spinoff-after-golden-globes-reunion/",
        "title": "&#39;Suits&#39; Star Gives Update on Spinoff After Golden Globes Reunion",
        "description": "News he would be happy to reunite with former co-star <b>Meghan Markle</b> for a spinoff if asked. &quot;I think <b>Meghan</b> is a fantastic actress,&quot; Adams said ahead of the Suits cast reunion at Sunday&#39;s award show. &quot;We&#39;d be lucky to have her back in the industry.&quot;"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-once-called-invisible-illness-debilitating-it-reportedly-caused-hospitalization.html/",
        "title": "<b>Meghan Markle</b>’s Once Called Her Invisible Illness ‘Debilitating’: Said It Caused Hospitalization",
        "description": "Meghan Markle once called her invisible illness &#39;debilitating.&#39; She had symptoms that required hospitalization she said in an interview."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2931361/meghan-markle-invited-suits-reunion/",
        "title": "New Insiders Revealed <b>Meghan Markle</b> Was Actually Invited to the Long-Awaited Golden Globe Suits Reunion",
        "description": "On Sunday night, four of the main stars of Suits, Patrick J. Adams, Sarah Rafferty, Gina Torres and Gabriel Macht, joined onstage at the Golden Globe Awards for a long-awaited reunion for the fans. And while the reunion was already enough for any Suits fan to go wild, others kept asking themselves: where’s Meghan Markle ?"
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/meghan-markle-mom-reportedly-moves-in-with-her-prince-harry/",
        "title": "<b>Meghan Markle</b>&#39;s Mom Reportedly Moves in With Her and Prince Harry",
        "description": "Meghan Markle&#39;s mother, Doria Ragland, has reportedly moved in with her and Prince Harry out of convenience and a desire to be close to her grandchildren. Last week, a source close to the family told Express that Ragland rarely goes back to her own home,"
    },
    {
        "url": "https://www.elle.com/culture/celebrities/a46327982/timothee-chalamet-kylie-jenner-selena-gomez-drama-response/",
        "title": "Timothée Chalamet Clarifies Where He and Kylie Jenner Stand With Selena Gomez After Golden Globes Rumors",
        "description": "The pap asked Chalamet point-blank about the internet’s speculation that his girlfriend, Jenner, blocked Gomez, his former A Rainy Day in New York co-star, from getting a photo with him at the Globes. He ignored the line of questioning initially, then chose to clear the air on the drama."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/kate-middleton-is-predicted-to-have-a-smoother-year-starting-with-her-birthday-says-a-royal-expert/",
        "title": "Kate Middleton is predicted to have a ‘smoother’ year starting with her birthday, says a Royal expert",
        "description": "It is a special day for Kate Middleton, the Princess of Wales. She is turning 42 years old and will be celebrated and pampered as a Queen to be only can, one would hope. Kate Middleton is the wife of Prince William,"
    },
    {
        "url": "https://people.com/kate-middleton-before-royal-life-prince-william-tiktok-video-8424069",
        "title": "Kate Middleton&#39;s Pre-Royal Life Unveiled on TikTok: Ugg Boots and Wild Nights with Prince William!",
        "description": "Kate Middleton snuck in plenty of fun before she was the Princess of Wales! See the viral TikTok video of her nights out with Prince William and her sister Pippa Middleton in honor of her 42nd birthday on Jan."
    },
    {
        "url": "https://www.aol.com/entertainment/gayle-king-marks-12-years-210059392.html",
        "title": "Gayle King Marks 12 Years at ‘CBS Mornings’ in Original First-Day Dress",
        "description": "12 years later, here we are! Still psyched to be sitting here.” Related: Every Time Gayle King Defended Prince Harry and <b>Meghan Markle</b> From Critics In their corner. Gayle King has stood by Prince Harry and <b>Meghan Markle</b> amid their many royal ..."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-acting-royal-comeback-suits-netflix-1859090",
        "title": "<b>Meghan Markle</b>&#39;s Acting Comeback? What We Know",
        "description": "On the show, the future duchess played paralegal Rachel Zane, a character whose main storyline was her developing love story with colleague Mike Ross (played by Patrick J. Adams). Some of Markle&#39;s co-stars were guests at her royal wedding in Windsor Castle, Berkshire, England."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146193-meghan-markle-prince-harry-branded-figures-of-fun-after-golden-globes-snub",
        "title": "<b>Meghan Markle</b>, Prince Harry branded &#39;figures of fun&#39; after Golden Globes snub",
        "description": "Prince Harry and Meghan Markle, who stepped down from their senior royal roles in 2020, recently branded &#39;figures of fun&#39; after the couple brutally snubbed at the 2024 Golden Globe"
    },
    {
        "url": "https://www.heraldsun.com.au/entertainment/celebrity-life/royals/prince-harry-cops-further-humiliation-over-sandhurst-book/news-story/02d49314440329b026f12ea98f688f30",
        "title": "Prince Harry cops further humiliation over Sandhurst book",
        "description": "Prince Harry has copped further humiliation by being excluded from a prestigious book celebrating Sandhurst’s top 200 alumni."
    },
    {
        "url": "https://www.joe.co.uk/entertainment/suits-star-shares-update-on-spin-off-after-massive-netflix-resurgence-418245",
        "title": "Suits star shares update on spin-off after massive Netflix resurgence",
        "description": "While Netflix is notorious for cancelling fan favourites after just a season or two, it can also lead a resurgence in old series after they look to be dead and buried. One resurgence in particular is the beloved Suits, which, after ending in 2019, gained a whole new hoard of fans when it landed on the streamer."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146183-prince-harry-meghan-markle-to-be-exposed-they-are-in-deep-trouble",
        "title": "Prince Harry, <b>Meghan Markle</b> to be &#39;exposed&#39;: ‘They are in deep trouble’",
        "description": "A huge blow awaits for Prince Harry and Meghan Markle as they push through already ghastly 2024.Speaking to GB News, royal expert Lady Colin Campbell warned that things are “going to get"
    },
    {
        "url": "https://www.guampdn.com/news/national/harry-and-meghan-branded-figures-of-ridicule-after-golden-globes-mockery/video_cce7e421-d4f7-57ec-bdfa-724cd4243c12.html",
        "title": "Harry and <b>Meghan</b> branded ‘figures of ridicule’ after Golden Globes mockery",
        "description": "Prince Harry and Meghan Markle have been warned that their &quot;star has fallen&quot;, as the royal couple were among the few to be mocked at Sunday night&#39;s Golden Globes ceremony.The"
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-prince-harry-oprah-winfrey-interview-trumps-future-podcast-1858957",
        "title": "Why <b>Meghan</b> and Harry&#39;s Oprah Interview Trumps Anything They Do Next",
        "description": "<b>Meghan Markle</b> and Prince Harry&#39;s 2021 interview with Oprah Winfrey will continue to be discussed for years to come, potentially overshadowing future narratives about royal experiences they may choose to share, a new episode of Newsweek&#39;s The Royal Report ..."
    },
    {
        "url": "https://her.ie/celeb/meghan-markles-suits-golden-globe-reunion-597671",
        "title": "<b>Meghan Markle</b>’s co-star reveals why she wasn’t at ‘Suits’ Golden Globe reunion",
        "description": "Meghan Markle was noticeably absent when her former co-stars Gina Torres, Patrick J. Adams, Sarah Rafferty and Gabriel Macht took to"
    },
    {
        "url": "https://www.instyle.com/editor-loved-amazon-winter-fashion-staples-8423807",
        "title": "I’m Upgrading My Winter Wardrobe With These 7 Staples Starting at $8",
        "description": "An InStyle editor is revamping her winter wardrobe with Amazon fashion staples, including sweaters, jeans, jackets, boots, and handbags. Check out seven editor-approved winter pieces from Madewell, Dr."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/news/jo-koy-jokes-harry-meghan-golden-globes-b2475389.html",
        "title": "Golden Globes host Jo Koy cracks ‘brutal’ Harry and <b>Meghan</b> joke at 2024 ceremony",
        "description": "Oppenheimer was the big movie winner at the Golden Globes, with Succession and The Bear sweeping the TV categories. Koy seemingly left Taylor Swift unimpressed with a joke aimed at the singer, while comedian Jim Gaffigan left the audience wincing with a controversial quip addressing the unsealed Jeffrey Epsetin court records."
    },
    {
        "url": "https://www.nme.com/en_au/news/music/taylor-swift-reaction-jo-koy-travis-kelce-joke-golden-globes-viral-3567374",
        "title": "Taylor Swift’s reaction to Jo Koy’s terrible Travis Kelce joke at Golden Globes goes viral",
        "description": "Taylor Swift has gone viral following her unimpressed reaction to one of Jo Koy’s jokes at the Golden Globes ceremony."
    },
    {
        "url": "https://www.instyle.com/lee-mid-rise-boyfriend-jeans-sale-amazon-8423907",
        "title": "Amazon Shoppers Are Stocking Up on These Butt-Flattering Jeans While They&#39;re Just $16",
        "description": "The Lee Mid-Rise Boyfriend Jeans are on sale for $16 at Amazon. Shoppers are stocking up on multiple pairs of the butt-flattering jeans thanks to how comfy and durable they are."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-suits-co-star-idea-rachel-mike-spinoff.html/",
        "title": "<b>Meghan Markle</b>’s ‘Suits’ Co-Star Has an Idea for a Rachel and Mike Spinoff",
        "description": "Patrick J. Adams is ready for a Suits reunion. The actor addressed his former co-star <b>Meghan Markle</b>’s rumored return to acting during a red carpet interview at the Golden Globes on Jan. 7. He even had an idea for a spinoff involving their characters."
    },
    {
        "url": "https://uproxx.com/tv/suits-reunion-meghan-markle-golden-globes/",
        "title": "The Golden Globes Allegedly Asked <b>Meghan Markle</b> To Appear At The ‘Suits’ Reunion, But She Turned It Down",
        "description": "Noticeably absent was <b>Meghan Markle</b>, who starred on the show for seven seasons, and then went on to marry into the British Royal Family, as one does. Even though it might seem like she was left out on purpose, a source confirmed that <b>Markle</b> was asked to ..."
    },
    {
        "url": "https://www.vanityfair.com/hollywood/mean-girls-and-music-with-renee-rapp",
        "title": "Get In, Loser: We’re Talking Mean Girls and Music With Reneé Rapp",
        "description": "Prince Harry and <b>Meghan Markle</b>’s Holiday Card Is All Business While Prince William and Kate Middleton opted for the personal touch, the California royals’ card came from their production company. Organizers of the presidential candidate’s birthday ..."
    }
]