[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-reveals-one-christmas-31703088",
        "title": "<b>Meghan Markle</b> reveals the one Christmas present she won&#39;t be buying for Prince Archie",
        "description": "<b>Meghan Markle</b> has shared the one Christmas present that she won&#39;t be buying for her son Prince Archie this year, and by doing so she has revealed some sweet details about the tot. Taking part in a Q&amp;A last month, following a special screening of Netflix&#39;s ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847004/prince-harry-meghan-markle-christmas-card",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;rubbish&#39; Christmas card misses one important thing",
        "description": "Prince Harry and Meghan Markle’s official Christmas card has been slammed as “rubbish” by one critic who was left upset that the royal couple chose not to include their two year old baby, Lillibet, and four year old Archie."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-reveals-one-gift-200900523.html",
        "title": "<b>Meghan Markle</b> Reveals the One Gift Archie Wants—But Isn’t Getting—for Christmas",
        "description": "This year, there’s one item on Meghan Markle and Prince Harry’s son Archie’s wish list that he won’t be getting this Christmas—and understandably so."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-revealed-one-gift-182618024.html",
        "title": "<b>Meghan Markle</b> Revealed the One Gift She Won&#39;t Be Giving to Her Son Archie This Christmas",
        "description": "The Hollywood actor’s starring role in the 1984 original shot him to stardom and secured him a Golden Globe nomination. Eddie Murphy, Dan Aykroyd, and Jamie Lee Curtis starred together in this unlikely Christmas classic which features some now-questionable scenes."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-archie-christmas-list-b2466120.html",
        "title": "<b>Meghan Markle</b> reveals surprising item on Archie’s Christmas list",
        "description": "Meghan Markle has revealed the unlikely item her son Prince Archie is asking Santa Claus for this Christmas - and why he won’t get it."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846963/meghan-markle-saturday-night-live-royal-family",
        "title": "<b>Meghan Markle</b> torn apart in brutal SNL sketch as Hollywood laughs at her",
        "description": "Meghan Markle came in for a royal roasting on Saturday Night Live in a skit that took aim at Prince William and Princess Kate’s Christmas card. The Waleses recently sent royal onlookers into a frenzy after they released their adorable Christmas card."
    },
    {
        "url": "https://www.hellomagazine.com/homes/509713/heartfelt-royal-christmas-decorations-princess-kates-family-tribute-meghan-markles-weird-queen-elizabeth-ornament-more/?n=%40",
        "title": "Heartfelt royal Christmas decorations: Princess Kate&#39;s family tribute, <b>Meghan Markle</b>&#39;s &#39;weird&#39; Queen Elizabeth ornament &amp; more",
        "description": "From Corgis to Paddington Bears, look back at the most heartfelt royal Christmas decorations."
    },
    {
        "url": "https://uk.style.yahoo.com/princess-diana-jacques-azagury-evening-170000916.html",
        "title": "Princess Diana’s Jacques Azagury Evening Dress Just Sold for a Record $1.1 Million",
        "description": "Designed by Jacques Azagury, the ballerina-length gown sold for 11 times its original estimate of $100,000. It now holds the world record for the most expensive Lady Di-worn dress sold at auction. (The previous record holder was a velvet Victor Edelstein gown that sold for $604,800 at auction in January.)"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/joke-had-prince-william-laughing-165038199.html",
        "title": "This Joke Had Prince William Laughing So Hard He Wiped Away Tears at Royal Variety Performance with Kate",
        "description": "The Prince and Princess of Wales attended the annual Royal Variety Performance at London&#39;s iconic Royal Albert Hall last month"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-meghan-markle-using-sussex-royal-title-despite-pledge-to-stop/",
        "title": "Harry and <b>Meghan</b> still using &#39;Sussex Royal&#39; title online despite pledge to stop",
        "description": "Although the royal couple stepped down as senior Royals three years ago, the pair are still using their &#39;Sussex Royal&#39; title."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/fashion/article-12877485/The-death-natural-diamonds-Owner-Beers-shares-drop-20-production-cuts-eco-conscious-customers-opt-lab-grown-gems-loved-celebs-like-Taylor-Swift-instead.html",
        "title": "The death of natural diamonds: Owner of De Beers&#39; shares drop by 20% after mine production cuts as eco-conscious customers opt for lab-grown gems loved by celebs like Taylor ...",
        "description": "These days, for environmentally conscious customers, lab-grown gems are preferred over mined rock, with celebs like British actress Emma Watson showing off lab-created accessories."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-lets-slip-what-31701182.amp",
        "title": "<b>Meghan Markle</b> lets slip what Prince Archie wants for Christmas - and why he won&#39;t be getting it",
        "description": "During an appearance with her photographer friend Misan Harriman, Meghan Markle revealed a gift Prince Archie would want on his Christmas list - but she&#39;s not so sure if he will get one"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-revealed-whats-likely-142359182.html",
        "title": "<b>Meghan Markle</b> Revealed What&#39;s Likely on Son Prince Archie&#39;s Christmas List — and Why He Won&#39;t Get It!",
        "description": "Both Meghan, 42, and Harry, 39, have also shared their view behind the lens. Prince Harry took over National Geographic’s Instagram in 2019, and both the Duke and Duchess of Sussex had their photos featured on Instagram during their royal tour of Australia, New Zealand, Fiji and Tonga in the fall of 2018."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-prince-harry-christmas-card-b2466035.html",
        "title": "Prince Harry and <b>Meghan Markle</b> share 2023 Christmas card",
        "description": "Meghan Markle and Prince Harry are ringing in the holiday season with their 2023 Christmas cards. On Friday 15 December, the Duke and Duchess of Sussex sent out an email with their virtual Christmas cards on behalf of their Archewell organisation. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads."
    },
    {
        "url": "https://uk.style.yahoo.com/jennifer-anistons-skin-care-secret-for-erasing-fine-lines-130852129.html",
        "title": "Jennifer Aniston&#39;s skin-care secret for erasing fine lines is on rare sale for $38 at Amazon",
        "description": "Reviewers over 50 say the all-natural serum stick plumped up crepey undereye skin — and it&#39;s more than 20% off."
    },
    {
        "url": "https://metro.co.uk/2023/12/18/william-bauble-with-long-hair-back-branded-abomination-19990638/",
        "title": "Someone’s made a load of royal baubles and they’re utterly horrifying",
        "description": "These Christmas ornaments may have been a thoughtful tribute to members of the Royal Family – but they have been branded an ‘abomination’. King Charles, Queen Camilla, and the Prince and Princess of Wales were all turned into dangly decorations for the festive tree."
    },
    {
        "url": "https://metro.co.uk/2023/12/18/william-bauble-with-long-hair-back-branded-abomination-19990638/?ico=metro-posts_article_whats-trending-now",
        "title": "William bauble ‘with long hair at the back’ branded an ‘abomination’",
        "description": "King Charles, Queen Camilla, and the Prince and Princess of Wales were all turned into dangly decorations for the festive tree. Sold at Fenwick department store at £26 per piece, the baubles cost more than some in Liberty London and even Harrods."
    },
    {
        "url": "https://www.thesun.ie/royals/11869073/meghan-markle-archie-devastated-camera/",
        "title": "<b>Meghan Markle</b> reveals Prince Archie, four, was devastated when she didn’t buy him an £8,000 camera",
        "description": "MEGHAN Markle has revealed that little Archie has developed a new hobby – but he wasn’t very impressed when she bought him a present to encourage him. The Duchess of Sussex, 42, shared how"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12876365/Christmas-tree-bauble-Prince-William-slammed-royal-fans-say-looks-like-him.html",
        "title": "Christmas tree bauble of Prince William is slammed by royal fans who say it looks nothing like him",
        "description": "The festive glass decoration, created by Nebraska vintage collectibles company Cody Foster and Co, is currently on sale for around $25 and features the Prince of Wales in full regalia"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509684/meghan-markle-christmas-tradition-prince-archie-and-princess-lilibet/?campaign=hellous",
        "title": "<b>Meghan Markle</b> reveals sweet new Christmas tradition with Prince Archie and Princess Lilibet",
        "description": "The royal family tend to take part in a number of annual traditions, including their ritual visit to St Mary Magdalene Church in Sandringham, and a group viewing of the monarch&#39;s televised Christmas message. Furthermore, the royals exchange their gifts on Christmas Eve, in honour of their German heritage."
    },
    {
        "url": "https://www.thesun.co.uk/royals/24975148/kate-middleton-royal-secret-weapon-omid-scobie-crisis-queen/",
        "title": "How Kate Middleton is using the late Queen’s ‘invisibility shield’ trick to respond to latest <b>Meghan Markle</b> attack",
        "description": "IT’S believed she was given lessons on how to be a ‘royal wife’, but Kate Middleton learned so much more than that from the late Queen, we can reveal.  The Princess of Wales and the"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-still-31702412",
        "title": "Prince Harry and <b>Meghan Markle</b> still using royal titles",
        "description": "Prince Harry and his wife <b>Meghan Markle</b> have held onto their &quot;Sussex Royal&quot; website, despite making a promise to stop using the term after they stepped back from the monarchy in 2020. The Duke and Duchess of Sussex agreed to stop using their Royal titles ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-edward-rubbishes-omid-scobies-31654081",
        "title": "Prince Edward rubbishes Omid Scobie&#39;s Endgame claims in public with one subtle move",
        "description": "The explosive book has dominated headlines ever since a Dutch version of the biography seemed to name the two senior royals who were accused of voicing their concerns about the skin colour of Prince Harry and <b>Meghan</b>&#39;s <b>Markle</b>&#39;s first child, Prince Archie."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/harry-and-meghan-will-be-relieved-kate-middletons-uncle-pulls-plug-on-tellall-book-on-sussex-feud-after-family-intervention/news-story/c6c5b4bb3d5c02eb90940821a472244e",
        "title": "&#39;Harry and <b>Meghan</b> will be relieved&#39;: Kate Middleton&#39;s uncle pulls plug on tell-all book on Sussex feud after family intervention",
        "description": "An uncle of Princess Catherine has reportedly changed his mind about writing a tell-all book that was supposed to defend his globally famous niece following repeated attacks by the Sussexes."
    },
    {
        "url": "https://www.who.com.au/the-crown-season-six-cast",
        "title": "EXCLUSIVE: Ed McVey, Meg Bellamy and Luther Ford discuss playing William, Kate and Harry in The Crown",
        "description": "Meg Bellamy, Ed McVey and Luther Ford discuss playing Kate Middleton, Prince William and Prince Harry in the final season of Netflix hit The Crown."
    },
    {
        "url": "https://www.rollingstone.com/product-recommendations/lifestyle/how-to-watch-suits-streaming-online-1234931832/",
        "title": "‘Suits’ Is Now Streaming: Here’s Where to Watch the Hit Legal Drama Online",
        "description": "Here&#39;s where to find old episodes of Suits streaming online on Peacock. Plus: how to watch Suits online free without cable on Amazon Prime Video."
    },
    {
        "url": "https://hollywoodlife.com/2023/12/18/meghan-markle-reveals-what-son-prince-archie-wants-for-christmas/",
        "title": "<b>Meghan Markle</b> Reveals What Her Son Prince Archie, 4, Wants for Christmas &amp; What Inspired Him",
        "description": "Meghan Markle ’s son, Prince Archie, wanted one thing for Christmas but couldn’t get it! The Duchess of Sussex, 42, revealed in a recent Q&amp;A what her 4-year-old wanted from Santa Claus: the same camera that photographer Misan Harriman used to take the Duke and Duchess’ portraits."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139502-princess-kates-uncle-forced-to-shelve-his-plan-of-revealing-truth-about-harry-meghan",
        "title": "Princess Kate&#39;s uncle forced to shelve his plan of revealing truth about Harry, <b>Meghan</b>",
        "description": "Prince Harry and <b>Meghan Markle</b> won&#39;t be disgraced by Kate Middleton&#39;s uncle Kate Middleton&#39;s uncle Gary Goldsmith has reportedly pulled plug on tell-all book on Prince Harry and <b>Meghan Markle</b>&#39;s feud with royal family after key intervention, according to a ..."
    },
    {
        "url": "https://nypost.com/2023/12/18/entertainment/former-chef-scoffs-at-royal-familys-boring-christmas-day-lunch/",
        "title": "Former royal chef scoffs at King Charles and family’s ‘boring’ Christmas Day lunch",
        "description": "The royal family’s big day actually kicks off with a personal breakfast before heading over to St Mary Magdalene Church for an 11 a.m. service. After lunch and a supper filled with roasted hams and boar’s head, they all gather to watch the monarch’s Christmas message on television."
    },
    {
        "url": "https://www.aol.com/entertainment/meghan-markle-says-archie-isnt-174343275.html",
        "title": "<b>Meghan Markle</b> Says Archie Isn&#39;t Getting This 1 Gift on His Christmas List",
        "description": "Robin L Marshall/FilmMagic Meghan Markle and Prince Harry’s son, Archie, has a big-ticket gift on his Christmas list this year — but he might be disappointed when Santa Claus swings by Montecito. Meghan,"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-former-pals-blame-191200920.html",
        "title": "Prince Harry’s Former Pals Blame <b>Meghan Markle</b> for His Sudden Personality Change",
        "description": "Former friends of Prince Harry and Meghan Markle have both spoken out about numerous aspects of the couple: what their friendship was like, who they are now, their early dating years, and now, one of them is talking about how much Harry has changed since marrying Meghan."
    },
    {
        "url": "https://www.allvipp.com/royals/meghan-markle-reveals-prince-archie-s-photography-flair",
        "title": "<b>Meghan Markle</b> Reveals Prince Archie&#39;s Photography Flair",
        "description": "Discover Prince Archie&#39;s budding photography skills as <b>Meghan Markle</b> shares a charming anecdote about her son&#39;s creative pursuits and their royal holiday traditions. <b>Meghan Markle</b> showcases Prince Archie&#39;s talent for photography Megan reveals Archie&#39;s ..."
    },
    {
        "url": "https://www.eonline.com/news/1391662/meghan-markle-reveals-the-one-gift-budding-photographer-archie-wont-be-getting-for-christmas",
        "title": "<b>Meghan Markle</b> Reveals the One Gift Budding Photographer Archie Won&#39;t Be Getting for Christmas",
        "description": "Meghan Markle revealed her 4-year-old son Archie has developed an interest in photography and might be asking Santa for some very expensive equipment."
    },
    {
        "url": "https://www.romper.com/entertainment/prince-archie-christmas-gift-not-getting-meghan-markle",
        "title": "<b>Meghan Markle</b> Says Prince Archie Is “Not Getting” This Expensive Gift For Christmas",
        "description": "Meghan Markle revealed that her son with Prince Harry, 4-year-old Prince Archie, won&#39;t be getting a certain pricey gift for Christmas."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-markle-says-prince-archie-might-not-get-his-christmas-wish",
        "title": "<b>Meghan Markle</b> Says Prince Archie Might Not Get His Christmas Wish",
        "description": "In a panel discussion, the duchess explained that her four-year-old son has taken up an interest in a new hobby after some lessons from her friend Misan Harriman."
    },
    {
        "url": "https://radaronline.com/p/meghan-harry-sussex-royal-website-still-up-after-stepping-back-senior-duties/",
        "title": "<b>Meghan</b> and Harry&#39;s &#39;Sussex Royal&#39; Website Still Up Despite Vow to Not Use Label After Stepping Back From Senior Duties",
        "description": "&quot;I am amazed that their Sussex Royal website is still in the public domain. The Queen is deceased and the Sussexes agreed not to use Sussex Royal moving forwards,&quot; one royal watcher said."
    },
    {
        "url": "https://pagesix.com/2023/12/18/royal-family/meghan-markle-reveals-whats-on-prince-archies-christmas-list/",
        "title": "<b>Meghan Markle</b> reveals what’s on Prince Archie’s Christmas list — and why he won’t get it",
        "description": "The Duke and Duchess of Sussex’s son was inspired by famed photographer Misan Harriman, who uses pricey Leica cameras for his work."
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2919497/queen-elizabeth-prince-archie-common-trait/",
        "title": "<b>Meghan Markle</b> Revealed the One Fascinating Trait Prince Archie Has in Common With Queen Elizabeth",
        "description": "<b>Meghan Markle</b> recently revealed that her son is into photography, a hobby the late monarch also enjoyed. “Our 4-year-old,” she said, before correcting herself, “4 ½ -year-old son — he would say, ‘No, I’m not 4. I’m 4 ½ — Misan was showing ..."
    },
    {
        "url": "https://www.aol.com/lifestyle/meghan-markle-revealed-whats-prince-151100629.html",
        "title": "<b>Meghan Markle</b> Revealed What&#39;s on Prince Archie&#39;s Christmas Wish List",
        "description": "Last month, Meghan Markle moderated a conversation with David Oyelowo and Misan Harriman. Harriman, a close friend of Markle, released a debut short film, The After, on Netflix, and the event was to promote the film."
    },
    {
        "url": "https://www.etonline.com/suits-star-abigail-spencer-talks-shows-resurgence-and-the-cast-text-chain-exclusive-216678",
        "title": "&#39;Suits&#39; Star Abigail Spencer Talks Show&#39;s Resurgence and the Cast Text Chain (Exclusive)",
        "description": "The &#39;Extended Family&#39; star opens up about the show&#39;s renaissance after the first eight seasons dropped on Netflix in the summer."
    },
    {
        "url": "https://ca.finance.yahoo.com/news/princess-diana-jacques-azagury-evening-170000916.html",
        "title": "A Princess Diana Evening Dress Rocketed Past Estimates to Sell for $1.1 Million",
        "description": "The four-day sale, which wrapped up on Sunday, raked in more than $7 million and attracted a record 16,351 bidders from across the globe. The bestseller was an evening dress worn by the late Diana, Princess of Wales that hammered down for a bonkers $1.15 million."
    },
    {
        "url": "https://people.com/prince-william-laughed-tears-joke-royal-variety-performance-kate-middleton-8417366",
        "title": "This Joke Had Prince William Laughing So Hard He Wiped Away Tears at Royal Variety Performance with Kate",
        "description": "Find out which comedian had Kate Middleton laughing and Prince William wiping away tears at the 2023 Royal Variety Performance."
    },
    {
        "url": "https://www.vogue.fr/article/prince-harry-meghan-markle-2023-holiday-card-meaning",
        "title": "The deeper meaning behind Prince Harry and <b>Meghan Markle</b>’s 2023 holiday card",
        "description": "Prince Harry and Meghan Markle sent a virtual holiday card on behalf of their foundation, Archewell. It showed a picture of them smiling and clapping at the 2023 Invictus Games in Düsseldorf—the multi-sport tournament for wounded and injured veterans that Prince Harry founded in 2014."
    },
    {
        "url": "https://popculture.com/lifestyle/news/prince-harry-meghan-markle-reportedly-believe-royal-family-blocking-business-deals/",
        "title": "Prince Harry and <b>Meghan Markle</b> Reportedly Believe Royal Family Is Blocking Business Deals",
        "description": "A source says that the pair held talks &quot;with high profile brands that didn&#39;t lead to anything but should have...&#39;"
    },
    {
        "url": "https://www.allvipp.com/royals/prince-harry-and-meghan-markle-s-holiday-card",
        "title": "Prince Harry And <b>Meghan Markle</b>&#39;s Holiday Card",
        "description": "In a dazzling display of holiday spirit, Meghan Markle and Prince Harry have gifted the world with their 2023 virtual holiday card, and it&#39;s nothing short of"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/duchess-meghan-revealed-whats-prince-155000244.html",
        "title": "Duchess <b>Meghan</b> Revealed What&#39;s on Prince Archie&#39;s Christmas Wish List",
        "description": "During the conversation, Meghan spoke about her eldest son, Prince Archie Harrison. &quot;The inspiration runs deep,&quot; Meghan shared. &quot;Our four-and-a-half year old son—he would say, &#39;"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/princess-charlottes-reaction-sees-meghan-markle-queen-elizabeths-funeral-goes-viral.html/",
        "title": "Princess Charlotte’s Reaction When She Sees <b>Meghan Markle</b> at Queen Elizabeth’s Funeral Goes Viral",
        "description": "Was Princess Charlotte reacting after seeing Meghan Markle smile at Queen Elizabeth&#39;s funeral? Check out the viral clip that&#39;s being debated."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139496-overhyped-meghan-markle-prince-harry-accused-of-breaking-promises",
        "title": "&#39;Overhyped&#39; <b>Meghan Markle</b>, Prince Harry accused of breaking promises",
        "description": "Prince Harry and his wife <b>Meghan Markle</b> have received massive backlash for their &#39;false promises&#39;. <b>Meghan</b> and Harry have experienced a spectacular fall from grace, including the embarrassing exit from Spotify amid accusations by top executives that the ..."
    },
    {
        "url": "https://theindependent.co/meghan-harry-christmas-card/",
        "title": "<b>Meghan Markle</b> and Prince Harry reveal Christmas Card and Seasons Greetings",
        "description": "Harry had worn a black suit and a black dress shirt while <b>Meghan</b> wore a strapless green dress for the event. Harry had a lot to celebrate this holiday season after winning the phone hacking lawsuit against the Mirror Group Newspapers. After winning the l ..."
    },
    {
        "url": "https://www.vogue.in/content/how-to-achieve-that-celebrity-glow-according-to-mindy-kaling-and-meghan-markles-aesthetician",
        "title": "How to achieve that celebrity glow, according to Mindy Kaling and <b>Meghan Markle</b>&#39;s aesthetician",
        "description": "Mindy Kaling, Greta Gerwig, Vanessa Hudgens, <b>Meghan Markle</b>, and so many more, Vargas’ celebrity clientele is an extensive roster of popular names and complexions—it’s almost like the Walk Of Fame, but for really good skin. Bringing her Midas-touch to ..."
    }
]