[
    {
        "url": "https://www.btimesonline.com/articles/163214/20240112/prince-harry-and-meghan-markle-face-lowest-point-in-2024-after-tumultuous-2023-setbacks.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Face &#39;Lowest Point&#39; in 2024 After Tumultuous 2023 Setbacks",
        "description": "Prince Harry and Meghan Markle enter 2024 at what royal commentators describe as their &quot;lowest point&quot; in over a decade, following a series of setbacks in 2023 that have left their public image and professional ventures in a precarious state."
    },
    {
        "url": "https://www.samaa.tv/208737875-will-2024-be-their-comeback-harry-meghan-face-make-or-break-year",
        "title": "Will 2024 be their comeback? Harry &amp; <b>Meghan</b> face make-or-break year",
        "description": "While their participation in the 2023 Invictus Games provided a brief respite, the release of Omid Scobie&#39;s &quot;Endgame&quot; in late November reignited the spotlight on their personal and professional struggles."
    },
    {
        "url": "https://www.samaa.tv/208737873-meghan-markle-and-prince-harry-find-themselves-unnoticed-amongst-us-neighbours",
        "title": "<b>Meghan Markle</b> and Prince Harry find themselves unnoticed amongst US neighbours",
        "description": "Renowned royal expert Barry Maher shed light on the situation, stating, &quot;Harry and Meghan live down the street but in a considerably pricier spot, though nobody around here is exactly living in cardboard boxes."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/why-meghan-markle-prince-harry-190058184.html",
        "title": "Why <b>Meghan Markle</b> and Prince Harry Had to Return $7 Million in Wedding Gifts",
        "description": "Related: Prince Harry Will Reportedly Give Meghan Markle a Sentimental Gift for Their 5th Wedding Anniversary"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854759/meghan-markle-prince-harry-royal-peace-king-charles-olive-branch",
        "title": "<b>Meghan Markle</b> and Prince Harry can still secure royal peace after King&#39;s subtle &#39;move&#39;",
        "description": "King Charles&#39;s holiday guest list could prove to be a &quot;turning point&quot; for his relationship with Prince Harry and Meghan Markle, an expert has said"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-livid-queen-camillas-31861796",
        "title": "<b>Meghan Markle</b> will be &#39;livid&#39; if Queen Camilla&#39;s new podcast succeeds, expert says",
        "description": "Royal expert, Denise Palmer Davies, believes that the Duchess of Sussex, Meghan Markle, will be &quot;livid&quot; once she listens to Queen Camilla&#39;s anticipated podcast, The Reading Room"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/inside-harry-meghans-garden-pool-31861185",
        "title": "Inside Harry and <b>Meghan</b>&#39;s garden with pool, never-ending lawn and romantic terrace",
        "description": "Prince Harry and Meghan Markle settled comfortably into their $30million (£23.6m) Montecito home and have shared glimpses of their gorgeous garden, boasting a romantic terrace and a pool"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-william-says-mike-tindall-172742323.html",
        "title": "Prince William Says Mike Tindall Apologized for Revealing His &#39;One-Pint Willy&#39; Nickname",
        "description": "According to the Mirror, Prince William told Burrow on Thursday, &quot;It was you who got the nicknames out of him. He apologized to me about that. When I saw him, I said, &#39;Mike, when you&#39;re not going to mention your nicknames doesn&#39;t mean you mention mine, it&#39;s not fair.&#39; I&#39;m sure it&#39;s quite fun with Mike.&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854732/meghan-markle-hollywood-reunion-john-travolta",
        "title": "<b>Meghan Markle</b> set for reunion with unlikely Hollywood megastar at A-list event",
        "description": "Prince Harry and Meghan Markle are speculated to be attending the Aviation Hall of Fame awards in Beverly Hills, as the Duke is being honoured."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/kate-middletons-uncle-slams-crown-170503242.html",
        "title": "Kate Middleton&#39;s Uncle Slams “The Crown”&#39;s Portrayal of His Family: &#39;Ridiculous and Fantastical&#39;",
        "description": "Gary Goldsmith said his sister Carole Middleton is not as the &quot;manipulative&quot; character portrayed on the Netflix royal drama"
    },
    {
        "url": "https://uk.style.yahoo.com/unashamedly-opulent-country-hotel-know-162400778.html",
        "title": "The unashamedly opulent country hotel you should know about",
        "description": "A solitary field is stranded between junction 3 of the M25 and the edge of the town of Swanley in Kent. Half wheat stubble and half ploughed earth, the mix of gold and brown aptly resembles the striped shirts of Wasps Rugby Football Club."
    },
    {
        "url": "https://uk.news.yahoo.com/queen-margrethe-denmark-told-heir-211530558.html",
        "title": "Queen Margrethe of Denmark Told Heir Prince Frederik About Abdication 3 Days Before World Knew: Report",
        "description": "Historian Mie Ellekilde said the reign change would be a &quot;huge upheaval&quot; in Frederik&#39;s life whenever the day came"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12951503/adult-sippy-cup-viral-review-Hollywood-stanley.html",
        "title": "I have been ridiculed for my gigantic £42 &#39;adult sippy cup&#39;. But I&#39;m gulping more water than ever. This is why I am a fully signed-up member of the Stanley Squad along with ...",
        "description": "The latest craze among celebrities and on social media is not a designer bag. It&#39;s an almost comically gigantic &#39;adult sippy cup&#39; insulated water tumbler"
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middletons-fingers-went-white-31859294",
        "title": "Kate Middleton&#39;s fingers &#39;went white as she gripped chair in tense <b>Meghan</b> and Harry meeting&#39;",
        "description": "In his memoir Spare, Prince Harry laid bare the early tensions between his wife Meghan Markle and the Princess of Wales as he revealed a chat between them that ended badly"
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/511065/meghan-markle-unforgettable-mini-skirt-moments-prince-harry/",
        "title": "10 <b>Meghan Markle</b> mini dress moments we&#39;ll never forget",
        "description": "Take a look at 10 of Meghan&#39;s shining moments in mini dresses, they don&#39;t disappoint… Meghan was spotted at the UK Premiere of The Hunger Games: Catching Fire at Odeon Leicester Square in 2013 wearing a black mini dress that was simple yet elegant."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25325473/inside-harry-and-meghans-friendship-hollywood-megastar-a/",
        "title": "Inside Harry and <b>Meghan</b>’s friendship with Hollywood megastar as they’re set for reunion after fallouts with other pals",
        "description": "PRINCE Harry and Meghan Markle are set to reunite with a Hollywood megastar pal after they had a fallout with other famous mates. The Duke and Duchess of Sussex will be celebrating with movie star"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-blunt-one-word-31856491",
        "title": "<b>Meghan Markle</b>&#39;s blunt one-word remark about Trooping the Colour was met with &#39;yawning silence&#39;",
        "description": "The Duchess of Sussex attended her first Trooping the Colour in 2018 but it appears Kate Middleton was not impressed with Meghan when she gave a simple one word remark about the ceremony."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511035/prince-harry-and-meghan-markle-astrology-compatibility/",
        "title": "Virgo Prince Harry and Leo <b>Meghan Markle</b> are from &#39;different galaxies&#39; but &#39;can weather any storm&#39;, astrology says",
        "description": "It&#39;s safe to say that everyone has their own opinions about Prince Harry and Meghan Markle&#39;s relationship. But no matter how you feel about them, it&#39;s impossible not to appreciate and respect the pair&#39;s unwavering united front and their electric chemistry — they are a magnetic presence when together."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25320399/meghan-harry-long-term-financial-challenge-william/",
        "title": "<b>Meghan</b> &amp; Harry ‘face long-term financial challenge’ as career relaunch flops – while Wills’ gets to work on £1bn estate",
        "description": "MEGHAN Markle and Prince Harry are facing a “long-term financial challenge” after stepping back as senior royals, claims a royal author. This follows the Duke and Duchess of Sussex’s £18million"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-forced-31855517",
        "title": "<b>Meghan Markle</b> and Prince Harry forced to send back £7m worth of gifts from fans",
        "description": "The former royal couple received an overwhelming amount of presents from well wishers on their lavish wedding day in May 2018 but were unfortunately not allowed to keep any of the gifts."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12949471/prince-harry-legends-aviation-beverly-hills-ceremony.html",
        "title": "&#39;Is this a joke?&#39; Outrage as Prince Harry is to be named a &#39;Legend of Aviation&#39; alongside moon heroes Neil Armstrong and Buzz Aldrin at glitzy Beverly Hills ceremony... after ...",
        "description": "The Duke of Sussex , 39, has been recognised ahead of Charles Duke - who became the youngest person to walk on the moon in 1972 when he was aged 36."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/life/time-is-free-to-give-yet-priceless-to-receive-volunteers-urge-public-to-donate-free-minutes-to-help-others/a1238889516.html",
        "title": "‘Time is free to give yet priceless to receive’: Volunteers urge public to donate free minutes to help others",
        "description": "Volunteering has not only changed my life, but it has also saved my life,” says Carrickfergus woman Karolyn Gaston (52)."
    },
    {
        "url": "https://uk.yahoo.com/news/prince-harry-prince-william-secret-195806196.html",
        "title": "Prince Harry and Prince William Have &#39;Secret&#39; 3-Word Code Used &#39;Only in Times of Extreme Crisis&#39;",
        "description": "Harry recounts how a heated exchange with his older brother and father King Charles after Prince Philip’s funeral in April 2021 took an emotional turn as they discussed the circumstances around Harry and wife <b>Meghan Markle</b>&#39;s decision to step back from ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-golden-globes-royal-31829518?int_source=nba",
        "title": "<b>Meghan Markle</b>&#39;s former Suits co-stars joke about her popularity before brutal remark at Golden Globes",
        "description": "<b>Meghan Markle</b>&#39;s former Suits co-stars revealed they have very little contact with the Duchess during an interview at the 2024 Golden Globe Awards last night (Sunday, January 7). While <b>Meghan</b> wasn&#39;t in attendance at the annual event in Los Angeles, that didn&#39;t stop her from becoming a topic of conversation among stars of the hit legal series."
    },
    {
        "url": "https://www.vanityfair.com/style/prince-harrys-newest-title-living-legend-of-aviation",
        "title": "Prince Harry’s Newest Title: Living Legend of Aviation",
        "description": "Prince Harry has a date with the wide-open sky—and John Travolta."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/prince-harry-and-meghan-markle-south-park-episode-plot-where-to-watch-episode-number-and-more-1270932",
        "title": "Prince Harry and <b>Meghan Markle</b> South Park Episode: Plot, where to watch, episode number and more",
        "description": "South Park&#39;s 26th season dives into royal satire with The Worldwide Privacy Tour, hilariously paralleling Prince Harry and Meghan Markle&#39;s journey."
    },
    {
        "url": "https://radaronline.com/p/prince-harry-meghan-markle-lowest-point-decade-disastrous-2023-source/",
        "title": "Prince Harry and <b>Meghan Markle</b> at &#39;Their Lowest Point&#39; in a Decade After Disastrous 2023: Report",
        "description": "Prince Harry and Meghan Markle are reportedly at “their lowest point” in more than a decade. Prince Harry and Meghan Markle are reportedly at “their lowest point” in more than a decade following a disastrous and tumultuous 2023 for the royal renegades, RadarOnline.com has learned."
    },
    {
        "url": "https://www.mercurynews.com/2024/01/11/prince-harrys-living-legends-of-aviation-award-is-pathetic-publicity-stunt-says-ex-royal-navy-chief/",
        "title": "World News",
        "description": "Celebrities massaging each other’s egos,’ is how Britain’s former commander in Afghanistan labeled Harry’s awards event, which is being hosted by John Travolta and"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2933265/kate-middleton-superstar-royal-family/",
        "title": "Kate Middleton Has Become the Palace’s ‘Shining Star’ After a Rough Royal Year",
        "description": "In her new role as the Princess of Wales, Kate Middleton tried to rise above the noise and rumors to become the person at the palace that everyone wanted to see. If she can weather through rough waters of 2023,"
    },
    {
        "url": "https://www.newsweek.com/everything-meghan-markle-said-bombshell-oprah-winfrey-interview-1859844",
        "title": "Everything <b>Meghan Markle</b> Said About Her Bombshell Oprah Interview",
        "description": "&quot;It was less about setting the record straight than at least filling in the blanks,&quot; Meghan said of her interview with Winfrey."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-camilla-finally-gets-perfect-revenge-prince-harry-meghan-expert-says-will-leave-them-livid-embarrassed.html/",
        "title": "Queen Camilla Finally Gets ‘Perfect Revenge’ on Prince Harry and <b>Meghan</b> That Expert Says Will Leave Them ‘Livid’ and ‘Embarrassed’",
        "description": "According to an expert, Queen Camilla&#39;s new project is the &quot;perfect revenge&quot; for her that will anger Prince Harry and Meghan Markle."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/south/exclusive-teja-sajja-opens-up-on-overwhelming-response-to-hanumans-teaser-1270907",
        "title": "EXCLUSIVE: Teja Sajja opens up on overwhelming response to HanuMan’s teaser",
        "description": "HanuMan featuring Teja Sajja in the lead role is set to arrive in theaterssoon and in an exclusive Pinkvilla interview he revealed the reactions he saw after the teaser’s release. Check it out!"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146833-meghan-markle-expected-royal-racist-scandal-to-ruin-princess-kates-birthday",
        "title": "<b>Meghan Markle</b> &#39;expected royal racist scandal to ruin&#39; Princess Kate&#39;s birthday",
        "description": "Meghan Markle was dealt a major blow after Princess Kate was able to ring in a relatively peaceful birthday earlier this week.Speaking to GB News, royal editor for the Mail on Sunday"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146824-queen-camilla-brings-meghan-markle-to-earth-with-major-blow",
        "title": "Queen Camilla brings <b>Meghan Markle</b> to earth with major blow",
        "description": "Queen Camilla&#39;s new podcast has shot to the top of the charts in major blow to her daughter-in-law Meghan Markle.The 76-year-old British Queen has seemingly brought the former Hollywood actress"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/meghan-markle-declined-suits-reunion/",
        "title": "<b>Meghan Markle</b> declined ‘Suits’ reunion",
        "description": "Meghan Markle turned down the chance to reunite with her &#39;Suits&#39; co-stars on stage at the Golden Globes awards."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-celebrity-fight-back-awards-1859703",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Celebrity Comeback Continues",
        "description": "Prince Harry and Meghan Markle may get a first joint L.A. red carpet gig for an honor previously held by Elon Musk and Tom Cruise."
    },
    {
        "url": "https://nypost.com/2024/01/11/entertainment/prince-harry-named-living-legend-as-hes-inducted-into-aviation-hall-of-fame-alongside-buzz-aldrin/",
        "title": "Prince Harry faces backlash over being named to ‘Living Legend of Aviation’ Hall of Fame, which features Neil Armstrong, Buzz Aldrin",
        "description": "According to author Omid Scobie, the star-studded ceremony will see the Duke of Sussex be honored in Beverly Hills on January 19."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/year-later-bombshells-prince-harry-spare-memoir-meghan-markle/",
        "title": "A year later: Three bombshells from Prince Harry’s ‘Spare’",
        "description": "Prince Harry released his controversial memoir &#39;Spare&#39; a year ago, but an expert claims that the book backfired."
    },
    {
        "url": "https://www.foxnews.com/entertainment/meghan-markle-skips-suits-reunion-expert-claims-hollywood-not-kind",
        "title": "<b>Meghan Markle</b> skips &#39;Suits&#39; reunion as expert says &#39;Hollywood has not been kind&#39;",
        "description": "&quot;Suits&quot; castmates Gabriel Macht, Patrick J. Adams, Sarah Rafferty and Gina Torres presented the Best Television, Drama category at the 81st Golden Globes. Meghan Markle a no-show."
    },
    {
        "url": "https://au.news.yahoo.com/reformer-pilates-explained-125400731.html",
        "title": "How reformer Pilates can work for you",
        "description": "The famous and influential – from Margot Robbie to Meghan Markle – swear by the body conditioning benefits of reformer Pilates (where the low-impact, mind-body discipline is performed on specialist equipment, allowing for a more dynamic, supportive, and/or targeted workout). But the practice is for all."
    },
    {
        "url": "https://www.theaustralian.com.au/commentary/a-pox-on-the-veryworst-cliche-since-sliced-bread/news-story/f21dca42e7bf2311b0f959ec6269526b",
        "title": "A pox on the very worst cliche since sliced bread",
        "description": "The best thing since sliced bread is a cliche of uncertain origin, but we can trace it back to 1928 where, in a light bulb moment in the US, a loaf of bread was sliced and packaged before sale."
    },
    {
        "url": "https://www.mundiario.com/articulo/cr-turismo/discovering-adventure-in-costa-rica-14-day-trip-through-natural-paradises/20240111041904294035.html",
        "title": "Discovering adventure in Costa Rica: A 14-day trip through natural paradises",
        "description": "Prince Harry and Meghan Markle choose Costa Rica for their pre-Christmas vacation, a country with green, serene landscapes bathed in sunshine all year round."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royal-biographer-believes-prince-harry-meghan-markle-going-struggle-financially-duchess-isnt-a-great-actress.html/",
        "title": "Royal Biographer Believes Prince Harry and <b>Meghan Markle</b> Are Going to Struggle Financially Because the Duchess ‘Isn’t a Great Actress’",
        "description": "A royal commentator is slamming Meghan Markle&#39;s acting saying she&#39;s a &quot;low-class actress&quot; and &quot;isn&#39;t great&quot; at her job."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-receive-high-honor-021433952.html",
        "title": "Prince Harry To Receive High Honor At Annual Living Legends of Aviation Awards",
        "description": "After two tours of military duty and extensive humanitarian work as a veteran, The Duke of Sussex Prince Harry will receive an honor at the 21st Annual Living Legends of Aviation Awards. Harry has previously spoken about how his time in the military turned the pain from his mother,"
    },
    {
        "url": "https://www.aol.com/entertainment/prince-harry-receive-aviation-award-212613815.html",
        "title": "Prince Harry Will Receive Aviation Award for Prior Military Service",
        "description": "Prince Harry Max Mumby/Indigo/Getty Images Prince Harry is set to receive a special award for this service as a military helicopter pilot. The Duke of Sussex, 39, was announced on Wednesday, January 10,"
    },
    {
        "url": "https://www.barrons.com/articles/soho-houses-longtime-designer-on-antiquing-rome-and-other-favorite-things-96d76786",
        "title": "Soho House’s Longtime Designer on Antiquing, Rome, and Other Favorite Things",
        "description": "Vicky Charles, after 20 years as global head of design for Soho House—known for its trendy, members-only properties—decided to stri..."
    },
    {
        "url": "https://www.foxnews.com/entertainment/celebrities-leading-mental-health-advocacy",
        "title": "Selena Gomez, Prince Harry and other celebrities leading mental health advocacy",
        "description": "Prince Harry and his wife, <b>Meghan Markle</b>, the Duchess of Sussex, have been a driving force in the mental health advocacy space. Their foundation, Archewell, has partnered with several organizations to promote mental health initiatives, including the launch ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163196/20240111/prince-harry-and-meghan-markle-forced-to-return-9-million-in-wedding-gifts-following-royal-protocol.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Forced to Return $9 Million in Wedding Gifts Following Royal Protocol",
        "description": "In a reflection of the stringent protocols that govern royal life, Prince Harry and <b>Meghan Markle</b>, after their fairytale wedding in 2018, found themselves compelled to return an estimated $8.9 million worth of wedding gifts. This action was guided by royal ..."
    }
]