[
    {
        "url": "https://uk.news.yahoo.com/sarah-jessica-parker-volumizing-spray-amazon-210520900.html",
        "title": "Sarah Jessica Parker calls this volumizing spray &#39;a must&#39; for giving hair &#39;more body&#39; — and it&#39;s down to $20",
        "description": "To use, all you do is lift up small sections of dry hair and give a little spritz underneath, aiming at the roots. You can use your fingers to style it as you like once that&#39;s done — easy breezy. While a little goes a long way, its lightweight formulation means you won&#39;t feel greasy, even if you apply a little too much."
    },
    {
        "url": "https://nypost.com/2024/01/31/entertainment/prince-harry-warned-to-lay-off-kate-middleton-as-meghan-markle-prepares-for-explosive-memoir/",
        "title": "Prince Harry warned to ‘lay off’ Kate Middleton as <b>Meghan Markle</b> prepares for ‘explosive’, ‘inevitable’ memoir: ex-butler",
        "description": "Former royal butler Paul Burrell claims it’s “inevitable” for the Duchess of Sussex to “tell her side of the story” in a similar way her husband did with his memoir"
    },
    {
        "url": "https://www.mansionglobal.com/articles/mansion-global-daily-anna-paquin-stephen-moyer-list-their-custom-built-los-angeles-home-90b77ce2",
        "title": "Mansion Global Daily",
        "description": "But now the affluent Santa Maria-Santa Barbara metropolitan area on the Central Coast of California nestled between the Santa Ynez Mountains and the Pacific Ocean has ranked as the top housing market in the latest Wall Street Journal/Realtor.com Emerging Housing Markets Index, released Wednesday."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153322-meghan-markle-prince-harry-fail-to-set-good-example-for-archewell-employees",
        "title": "<b>Meghan Markle</b>, Prince Harry fail to set &#39;good example&#39; for Archewell employees",
        "description": "Meghan Markle and Prince Harry reportedly failed to set a &#39;good example&#39; for their employees at Archewell Productions.In conversation with The Mirror, PR expert Ryan McCormick claimed there must"
    },
    {
        "url": "https://uk.news.yahoo.com/suits-cast-reunite-super-bowl-165100819.html",
        "title": "Suits cast reunite for Super Bowl special",
        "description": "Now, some of its cast – Gina Torres, Rick Hoffman and Sarah Rafferty to be exact – are set to reunite in a special advert (or commercial, if you will) for e.l.f. cosmetics during the 2024 Super Bowl, taking place on February 11."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harrys-fresh-32012452",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s fresh &#39;slap in the face&#39; for royals as comeback fails",
        "description": "The Duke and Duchess of Sussex have made a few public appearances since King Charles and Kate Middleton&#39;s health scares this month but have failed to comment on their family members&#39; wellbeing."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861453/royal-family-live-meghan-markle-prince-harry-latest-news",
        "title": "Royal Family LIVE: Prince Harry and <b>Meghan Markle</b> &#39;spiralling&#39; as Netflix deal in jeopardy",
        "description": "Prince Harry and Meghan Markle&#39;s future with Netflix is in jeopardy as the couple&#39;s prospects are &quot;spiralling&quot;, according to one royal expert."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fergie-sarah-ferguson-cancer-royal-family-reunited-b1135999.html",
        "title": "The royal rehabilitation of Fergie: is she finally back in from the cold?",
        "description": "After decades in exile, and despite her ongoing friendship with pariah Prince Andrew, has Sarah Ferguson has been welcomed back into the royal fold. Luciana Bellini reports"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-left-sick-due-28544912",
        "title": "Kate Middleton left &#39;sick&#39; due to little-known illness and &#39;the truth is&#39;",
        "description": "Kate joined the now-Queen Camilla, Prince Harry and <b>Meghan Markle</b> in a royal carriage on the way to the annual Trooping The Colour event. Princess Kate was reportedly &quot;feeling sick&quot; during the less-than-smooth ride, though. A source at the time said ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-cried-demand-queens-32011104",
        "title": "<b>Meghan Markle</b> &#39;cried on demand&#39; at Queen&#39;s funeral as actress has mastered &#39;fake&#39; tears",
        "description": "The Duchess of Sussex reportedly only cries out of her left eye as she has &#39;mastered&#39; fake crying due to her acting profession."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-forced-apologise-kate-32010245",
        "title": "<b>Meghan Markle</b> forced to apologise to Kate Middleton after Easter mix-up",
        "description": "Princess Kate and Meghan Markle first met at the start of 2017 but despite both marrying into the royal family, they struggled to bond after getting off &#39;on the wrong foot&#39;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-new-32010721",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s new &#39;slap in the face&#39; for Royals as comeback misfires",
        "description": "A string of public events should have left Prince Harry and Meghan Markle with a lot to smile about but a source claims they are instead &#39;stinging from the criticism&#39;"
    },
    {
        "url": "https://uk.style.yahoo.com/kylie-minogues-feather-crystal-mini-124800812.html",
        "title": "Kylie Minogue&#39;s feather and crystal mini-dress is getting us in the party mood",
        "description": "Grammy Awards party in a gorge mini-dress by Self-Portrait, that&#39;s surprisingly affordable and still in stock."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/512443/idris-elba-wife-sabrina-red-carpet-appearance-bond-girl-dress/",
        "title": "Idris Elba&#39;s wife Sabrina has a total Bond-girl moment in silhouette-skimming silky dress",
        "description": "Idris Elba may have ruled himself out of the running to play the next James Bond, but that didn&#39;t stop his breathtaking wife Sabrina from conveying serious Bond girl glamour at the premiere of Bob Marley: One Love at the BFI IMAX in London on Tuesday."
    },
    {
        "url": "https://www.hellomagazine.com/homes/512430/princess-kate-fortress-style-security-features-private-home-with-three-kids/",
        "title": "Princess Kate&#39;s fortress-style security features at private family home with three kids",
        "description": "The Prince and Princess of Wales reportedly wanted to leave the &#39;goldfish bowl&#39; of London in favour of the private countryside when they moved to Adelaide Cottage in September 2022, but it also has the added advantage of allowing Kate the space to recover from her abdominal surgery away from the watchful eyes of the world."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markle-prince-harry-dealt-huge-new-blow-archewell-productions-boss-quits-1723114",
        "title": "<b>Meghan Markle</b>, Prince Harry Dealt Huge New Blow As Archewell Productions Boss Quits",
        "description": "News about his departure comes at the heels of two resignations last year. Ben Browning, an Oscar-nominated producer who led content at Archewell Productions, also left his post after his contract expired. Likewise, the company&#39;s head of marketing, Fara Taylor, left the company amid the Sussexes&#39; plans to &quot;streamline the company&#39;s marketing arm&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861501/meghan-markle-memoir-prince-harry-royal-family",
        "title": "<b>Meghan Markle</b>&#39;s memoir would only have &#39;short-term success&#39; and just &#39;strain&#39; royal ties",
        "description": "PR expert Ryan McCormick believes Markle should refocus the aim of her book to save the relationship with her estranged family-in-law."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153306-prince-harry-meghan-markles-tone-deaf-move-fuels-rift-with-royal-family",
        "title": "Prince Harry, <b>Meghan Markle</b>&#39;s &#39;tone-deaf&#39; move fuels rift with royal family",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s recent &#39;insensitive&#39; trip to Jamaica reportedly fueled their woes with the royal family. For the unversed, the Duke and Duchess of Sussex made a surprising appearance at the premiere of &quot;Bob Marley: One Love&quot; on January 23."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-demanded-prince-harry-put-her-ahead-royal-family-insider.html/",
        "title": "<b>Meghan Markle</b> ‘Demanded’ Prince Harry Put Her Ahead of Royal Family: Insider",
        "description": "Prince Harry had to make some hard choices regarding his marriage to <b>Meghan Markle</b>. A royal insider claims that the Duchess of Sussex “demanded” her husband put her ahead of the royal family. Here’s why. Royal insider Angela Levin believes Prince ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/suits-star-rick-hoffman-says-214831333.html",
        "title": "Suits star Rick Hoffman says he would do a spin-off &quot;in a heartbeat&quot;",
        "description": "The cast includes Gina Torres, Sarah Rafferty, Abigail Spencer, Amanda Schull, and <b>Meghan Markle</b>. Hoffman plays Louis Litt, a cat-loving corporate attorney with the catchphrase, &quot;You just got Litt up!&quot; The character remains a fan-favorite. Continued ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022509/Archewell-exodus-staff-Harry-Meghan-production-company-Netflix-documentary.html",
        "title": "Just what IS going on behind the scenes at Archewell? Inside mass exodus from Harry and <b>Meghan</b>&#39;s production company as yet another exec leaves couple&#39;s employ",
        "description": "A lynchpin of Prince Harry and <b>Meghan Markle</b>&#39;s bombshell Netflix series has left the couple&#39;s California production company - bringing the total number of staff the Sussexes have lost since they married to at least 17. Archewell TV executive Bennett ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25609192/harry-meghan-netflix-archwell-paramount-royal-family/",
        "title": "Harry and <b>Meghan</b> ‘blatantly’ pushing Paramount deal, says expert as Archewell suffers blow &amp; Netflix collab to end soon",
        "description": "HARRY and Meghan are “blatantly” after a deal with media giant Paramount just as a key Archewell Productions member has quit. With their reported £80million Netflix deal drawing to a"
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-influential-impact-small-154030955.html",
        "title": "<b>Meghan Markle</b>&#39;s Influential Impact on a Small Jewelry Brand Changed Their Business Forever",
        "description": "Meghan Markle’s influence is being felt everywhere these days. After her Suits costar, Abigail Spencer, discussed the Duchess of Sussex’s star power in helping the show’s 2023 resurgence on Netflix, a small jewelry brand is crediting her with putting them on the map and changing the entire course of their business."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153291-meghan-markle-accused-of-acting-at-queens-funeral",
        "title": "<b>Meghan Markle</b> accused of acting at Queen&#39;s funeral",
        "description": "Meghan Markle, who was among hundreds of mourners at Queen Elizabeth II’s funeral in September 2022, has been accused of producing fake tears.The Duchess of Sussex, travelled to the UK"
    },
    {
        "url": "https://www.mansionglobal.com/articles/its-one-of-americas-most-expensive-cities-and-home-buyers-cant-get-enough-31bad79f",
        "title": "It’s One of America’s Most Expensive Cities, and Home Buyers Can’t Get Enough",
        "description": "A metro area on California’s central coast ranked No. 1 in the latest WSJ/Realtor.com Emerging Housing Markets Index"
    },
    {
        "url": "https://www.professionaljeweller.com/meghan-markle-dragons-den-kimai/",
        "title": "Kimaï reveals that <b>Meghan Markle</b> was not gifted the earrings that shot the brand to success",
        "description": "Meghan Markle has recently come under fire for accepting a free gift from Kimaï, so its founders have confirmed that she purchased the earrings"
    },
    {
        "url": "https://www.allvipp.com/fashion/duchess-meghan-has-a-make-up-trick-no-one-has-noticed",
        "title": "Duchess <b>Meghan</b> Has A Make-Up Trick No One Has Noticed!",
        "description": "Duchess Meghan prefers a more subtle look when it comes to make-up, but some of her tricks are pretty sophisticated. We&#39;ll show you her trick that no one has noticed!"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-end-starring-directing-upcoming-suits-spinoff.html/",
        "title": "<b>Meghan Markle</b> Could End up Starring in — and Even Directing — an Upcoming ‘Suits’ Spinoff",
        "description": "A &#39;Suits&#39; spinoff is on the way and, according to a report, Meghan Markle&#39;s been offered a &#39;dream role&#39; in the upcoming series."
    },
    {
        "url": "https://ca.style.yahoo.com/kylie-minogues-feather-crystal-mini-124800812.html",
        "title": "Kylie Minogue&#39;s feather and crystal mini-dress is getting us in the party mood",
        "description": "Grammy Awards party in a gorge mini-dress by Self-Portrait, that&#39;s surprisingly affordable and still in stock."
    },
    {
        "url": "https://nz.news.yahoo.com/meghan-trainor-says-son-riley-171914143.html",
        "title": "<b>Meghan</b> Trainor Says Son Riley Wants a Cake of the Family Car for His Birthday: &#39;Has to Be Specific&#39; (Exclusive)",
        "description": "Barry and Riley – with husband Daryl Sabara Meghan Trainor Meghan Trainor and her sons, Barry and Riley Meghan Trainor already has some fun plans underway for son Riley&#39;s upcoming birthday. While chatting with PEOPLE about her partnership with Nanit,"
    },
    {
        "url": "https://www.heraldsun.com.au/entertainment/celebrity-life/royals/prince-harrys-former-polo-playing-friend-threatens-to-publish-damaging-letter/news-story/6b0120919095c66ede8874731d241f74",
        "title": "Prince Harry’s former polo playing friend threatens to publish damaging letter",
        "description": "A former polo mate of Prince Harry has threatened to publish a damaging letter about the royal that could include shock revelations."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-infamous-gesture-king-charles-coronation-1865252",
        "title": "<b>Meghan Markle</b>&#39;s &#39;Infamous&#39; Gesture Compared to Royal Pageantry",
        "description": "Meghan Markle performing her famous mock curtsy during her Netflix show has been compared to King Charles&#39; coronation."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153245-meghan-markle-takes-sigh-of-relief-as-mystery-of-expensive-diamond-earrings-solved",
        "title": "<b>Meghan Markle</b> takes sigh of relief as mystery of expensive diamond earrings solved",
        "description": "Meghan Markle, who received massive backlash for allegedly accepting £2,000 diamond earrings from the Dragon&#39;s Den hopefuls in 2019, has taken a sigh of relief as the jewellery company"
    },
    {
        "url": "https://www.newsweek.com/prince-william-prince-harry-moment-unity-viral-video-tiktok-1865495",
        "title": "Prince William and Prince Harry&#39;s Moment of Unity Goes Viral",
        "description": "Prince William and Prince Harry &#39;s moment of fraternal unity following the death of their grandmother, Queen Elizabeth II, has featured in a new viral video, as footage from the late monarch&#39;s lying-in-state period has resurfaced on social media site TikTok."
    },
    {
        "url": "https://www.aol.com/entertainment/kingsley-ben-adir-bob-marley-012540980.html",
        "title": "Kingsley Ben-Adir and the &#39;Bob Marley&#39; Cast React to Meeting Prince Harry and <b>Meghan Markle</b> (Exclusive)",
        "description": "One Love cannot believe that Prince Harry and Meghan Markle showed up to support their movie in Jamaica. Talking with ET&#39;s Kevin Frazier at the film&#39;s premiere on Jan. 23, Kingsley Ben-Adir -- the actor who takes on the role of the iconic reggae singer -- said that he was honored to meet the couple in Bob Marley&#39;s home country."
    },
    {
        "url": "https://nz.news.yahoo.com/suits-cast-reunited-not-way-091200762.html",
        "title": "&#39;The Suits&#39; Cast Has Reunited, But Not In The Way You Might Expect",
        "description": "Ahead of the 2024 Super Bowl, the cast of Suits have finally reunited to star in E.l.f Cosmetics&#39; 2024 Super Bowl commercial."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/do-better-inside-staff-exodus-at-meghan-markle-and-prince-harrys-archewell-production-company-as-another-exec-quits/news-story/c15baa54fc0ddcc9f70eb919c2462b3c",
        "title": "&#39;Do better&#39;: Inside staff exodus at <b>Meghan Markle</b> and Prince Harry&#39;s Archewell production company as another exec quits",
        "description": "Prince Harry and Meghan Markle are reeling from the latest major staff departure at the production arm of their Archewell organisation after the Sussexes dropped a major hint they could be leaving Netflix."
    },
    {
        "url": "https://www.allvipp.com/royals/whoa!-harry-and-meghan-s-production-manager-jumps-ship",
        "title": "WHOA! Harry and <b>Meghan</b>&#39;s Production Manager Jumps Ship",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s Archewell Productions hit with a surprise as manager Bennett Levine departs for Cinetic Media amid Netflix and Spotify deal developments. Shocking shake-up at Sussex HQ Harry and <b>Meghan</b>&#39;s TV boss quits Archewell Productions ..."
    }
]