[
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markles-bridesmaid-dress-tailor-31785142",
        "title": "<b>Meghan Markle</b>&#39;s bridesmaid dress tailor lifts lid on row that made Charlotte cry",
        "description": "Meghan Markle, who married Prince Harry in May 2018, a ceremony for which bridesmaid dresses were tailored by Ajay Mirpuri, who has spoken out about Meghan&#39;s row with Kate Middleton at the time"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-albert-shares-2024-message-205539878.html",
        "title": "Prince Albert Shares 2024 Message with Princess Charlene, Focusing on &#39;Gratitude&#39; amid &#39;Difficult&#39; Times",
        "description": "&quot;We must continue to mobilize our efforts and devote all our energy to the cause of peace, mutual acceptance, and solidarity,&quot; the Monaco royal said"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850859/meghan-markle-prince-harry-2024-high-risk-plan",
        "title": "<b>Meghan Markle</b> and Prince Harry have &#39;high risk&#39; 2024 plan - but warned &#39;world is watching&#39;",
        "description": "It has been almost four years since Prince Harry and Meghan Markle quit as working royals - now, an expert claims, the Sussexes have a &quot;high risk&quot; plan for 2024."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-harry-showing-no-signs-31784793?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Meghan</b> and Harry showing no signs of apologising to heal Royal rift, says expert",
        "description": "Meghan Markle and Prince Harry have been scrutinised by a Royal expert who claims that they have done too much damage to ever hope to reconcile with their families"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850836/prince-harry-meghan-markle-2024-reputation",
        "title": "Prince Harry and <b>Meghan Markle</b> urged to &#39;go back to basics&#39; to boost damaged reputation",
        "description": "A culture expert has suggested the next steps Prince Harry and Meghan Markle should take in order to rebuild their reputation in 2024."
    },
    {
        "url": "https://www.heraldscotland.com/news/24021066.queen-margrethe-abdicates-new-danish-queen-scottish-descent/",
        "title": "Queen Margrethe abdicates: new Danish queen is of Scottish descent",
        "description": "Scotland&#39;s and Scandinavia&#39;s histories have long been intertwined with smatterings of Old Norse in the language, Viking and Norse settlement -"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510355/meghan-markle-pushing-to-be-someone-2024/",
        "title": "<b>Meghan Markle</b> will &#39;take the world by storm&#39; in 2024 as she pushes to &#39;be someone&#39;",
        "description": "Twenty twenty-four is shaping up to be Meghan Markle &#39;s year, when she will feel like she&#39;s &quot;taken the world by storm,&quot; astrologer to the stars, Debbie Frank, has predicted."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12916207/Charles-Camillas-carriage-2024.html",
        "title": "Charles and Camilla&#39;s New Year shout-outs: King and Queen share 2023 highlights video which includes William and Kate, Gareth Southgate and Andy Burnham - but NOT Harry, <b>Meghan</b> ...",
        "description": "His Majesty is seen talking to his wife and waving to crowds in a rare glimpse inside their horse drawn carriage after it left Buckingham Palace and headed down The Mall on November 7 this year."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-makes-same-new-31783305",
        "title": "<b>Meghan Markle</b> makes the same New Year resolutions each year but always fails after a &#39;few drinks&#39;",
        "description": "The Duchess of Sussex previously revealed some of her most &#39;unladylike&#39; habits that she tries to give up each year but never abides by after consuming alcohol."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510348/prince-harry-meghan-markle-preparing-family-move/",
        "title": "&#39;Restless&#39; Prince Harry preparing for family move: &#39;He&#39;ll do what the royal family least expects&#39;",
        "description": "Reading Prince Harry and Meghan Markle &#39;s astrological charts for 2024, Debbie, who was Princess Diana&#39;s close confidante, has exclusively told HELLO! that a move is on the cards for the Sussex family – and that Harry will do what the royal family &quot;least expects&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middletons-affordable-secret-for-glowing-skin-is-down-to-10-its-black-friday-price-122450423.html",
        "title": "Kate Middleton&#39;s affordable secret for glowing skin is down to $10 — its Black Friday price!",
        "description": "Prince William and Kate Middleton shared a reel to Instagram looking back on their 2023. However, the selection of pics included an unseen image of their kids."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wants-answers-king-31781478",
        "title": "<b>Meghan Markle</b> &#39;wants answers&#39; from King Charles, says royal expert",
        "description": "Meghan Markle has reportedly tried to arrange a meeting with King Charles to discuss why she has been subjected to different rules to other members of the Royal Family"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-seeking-answers-king-31781789",
        "title": "<b>Meghan Markle</b> is seeking &#39;answers&#39; from King Charles amid &#39;confusion&#39;, royal expert claims",
        "description": "The Duchess of Sussex is said to have questions about why she and Prince Harry have been subjected to different rules to other members of the Royal Family, according to an expert."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25173703/celebrity-tarot-horoscope-2024-molly-mae-meghan-markle/",
        "title": "What’s in store for celebs such as Molly-Mae and <b>Meghan Markle</b> in 2024 according to their horoscopes?",
        "description": "ANOTHER year is over and done and after going out with a bang last night it’s now time to say goodbye to 2023. As many of us nurse hangovers today, we will be looking forward to the year"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12876217/I-begged-comrades-shoot-head-Taliban-booby-trap-blew-legs-arm-Im-eternally-grateful-DIDNT.html",
        "title": "I begged my comrades to shoot me in the head after a Taliban booby-trap blew off my legs and arm... but now I&#39;m eternally grateful they DIDN&#39;T",
        "description": "EXCLUSIVE: Mark Ormrod, 40, was serving in Helmand Province, Afghanistan, on Christmas Eve in 2007 when he detonated a Taliban bomb hat ripped off both his legs and his right arm."
    },
    {
        "url": "https://metro.co.uk/2024/01/01/psychic-craig-hamilton-parker-predicts-imminent-death-putin-20042218/?ico=trending-module_tag_weird-news_item-0",
        "title": "Psychic predicts Putin might die and pop star will fall pregnant this year",
        "description": "Craig Hamilton-Parker has once again made some detailed predictions about what will happen in 2024 (Picture: Craig Hamilton-Parker) A psychic has predicted that Vladimir Putin is on the verge of dying and Taylor Swift will fall pregnant this year."
    },
    {
        "url": "https://www.btimesonline.com/articles/162986/20240102/prince-harry-misses-uk-life-as-meghan-markle-faces-spoilt-label-amidst-royal-feud.htm",
        "title": "Prince Harry Misses UK Life as <b>Meghan Markle</b> Faces Spoilt Label Amidst Royal Feud",
        "description": "Prince Harry&#39;s public declarations of missing &quot;the weird family gatherings&quot; and the &quot;British way of life,&quot; as shared in their Netflix documentary, have sparked a debate about the authenticity of his sentiments."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeths-very-different-reactions-kate-middleton-meghan-markles-wedding-dresses-caught-camera.html/",
        "title": "Queen Elizabeth’s Very Different Reactions to Kate Middleton and <b>Meghan Markle</b>’s Wedding Dresses Caught on Camera",
        "description": "Prince William and Kate Middleton were married at London’s Westminster Abbey in 2011. Then seven years later, Prince Harry and Meghan Markle tied the knot in St. George’s Chapel at Windsor Castle. Each wedding was a grand affair watched by millions around the world and both brides donned show-stopping wedding gowns."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-decline-predicted-last-through-2024-so-many-fails.html/",
        "title": "<b>Meghan Markle</b> and Prince Harry’s ‘Decline’ Predicted to Last Through 2024: ‘So Many Fails’",
        "description": "Meghan Markle and Prince Harry&#39;s decline is predicted to last through 2024 says a royal commentator. &#39;So many fails,&#39; they say as 2023 ends."
    },
    {
        "url": "https://dailytimes.com.pk/1156943/kate-middletons-latest-royal-blue-look-connects-to-meghan-markle/",
        "title": "Kate Middleton’s latest royal blue look connects to <b>Meghan Markle</b>",
        "description": "Kate Middleton’s latest fashion moment is bringing the high tea. The Princess of Wales commanded the room in a vibrant blue gown at the 2023 Royal Variety Performance on Nov. 30. For the special occasion,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1143807-prince-harry-meghan-markle-forced-to-prove-their-worth-with-notable-projects",
        "title": "Prince Harry, <b>Meghan Markle</b> forced to ‘prove their worth’ with notable projects",
        "description": "Prince Harry and Meghan Markle have been advised to prove their worth in 2024 with their involvement in some notable projects. As per PR expert Nick Ede, the Montecito couple needs to use"
    },
    {
        "url": "https://www.livemint.com/news/world/queen-margrethe-ii-abdication-after-52-year-reign-new-years-eve-address-prince-frederik-royals-11704069723073.html",
        "title": "Queen Margrethe II surprises nation with abdication after 52-year reign in New Year&#39;s Eve address",
        "description": "Denmark&#39;s Queen Margrethe II unexpectedly announced that she will step down in 2024 and hand over the crown to her son, Crown Prince Frederik, during her New Year&#39;s Eve address."
    },
    {
        "url": "https://www.ok.co.uk/celebrity-pictures/gallery/celeb-psychic-sally-morgans-2024-31718821",
        "title": "Celeb psychic Sally Morgan’s 2024 predictions in full - from Josie Gibson to Harry and <b>Meghan</b>",
        "description": "EXCLUSIVE: Psychic Sally Morgan has made her predictions about what&#39;s in store for some of our favourite stars in 2024 - and a few of them are in for a wild ride"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1143804-meghan-markles-fashion-choices-raise-questions-over-royal-influence",
        "title": "<b>Meghan Markle</b>’s fashion choices raise questions over royal influence",
        "description": "Meghan Markle failed to live up to her words once again raising eyebrows over her revelations about the royal family.During a new episode of Newsweek’s The Royal Report podcast, fashion"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-mocked-comedian-1856849",
        "title": "Prince Harry and <b>Meghan</b> Brutally Mocked by Comedian",
        "description": "British comic Simon Brodkin said Prince Harry and Meghan Markle&#39;s cringiest moment was so bad he started rooting for Prince Andrew."
    },
    {
        "url": "https://eng.obozrevatel.com/section-entertainment/news-strong-genes-what-kate-middleton-meghan-markle-and-other-royals-children-look-like-01-01-2024.html",
        "title": "Strong genes: what Kate Middleton, <b>Meghan Markle</b> and other royals&#39; children look like",
        "description": "Prince William and Princess Charlotte. The first question that most often interests pregnant women is who will be born, a boy or a girl. And the second is who the baby will resemble. Sometimes there are miracles of genetics: children &quot;borrow&quot; from their ..."
    },
    {
        "url": "https://mbaretimes.com/2024/01/south-africans-call/",
        "title": "South Africans call for the arrest of Zodwa Wabantu as her disturbing video goes viral",
        "description": "Back in 2021, in Brothers And Wives: Inside The Private Lives of William, Kate, Harry, and <b>Meghan</b> author Christopher Andersen alleged that the Queen asked for the Sussexes image to be removed during the monarch’s 2019 festive broadcast. In his book ..."
    },
    {
        "url": "https://www.newsweek.com/us-views-meghan-markle-royal-race-poll-1856805",
        "title": "How U.S. Really Views <b>Meghan Markle</b>&#39;s Royal Race Allegation",
        "description": "Meghan is 42 while the median age for U.S. women giving birth is 30, NBC News reported in 2022. In other words, those above this age or old enough to be grandparents appeared to be most critical of the royal race saga while those most likely to be expecting themselves were the least."
    },
    {
        "url": "https://www.skynews.com.au/opinion/meghan-and-harry-have-been-so-horrendous-to-the-royal-family/video/5d995210826c8b22a0fce956b8c307ea",
        "title": "<b>Meghan</b> and Harry have been ‘so horrendous’ to the Royal Family",
        "description": "Royal commentator and biographer Angela Levin says Meghan Markle and Prince Harry have been “so horrendous” to the Royal Family. “I fear if they do come back as Harry is alleged to want – Meghan does not,” she told Sky News host James Macpherson."
    },
    {
        "url": "https://www.cosmopolitan.com/uk/reports/a42374411/meghan-markle-new-years-resolution/",
        "title": "<b>Meghan Markle</b>&#39;s former New Year&#39;s resolution is basically proof she manifested her royal romance",
        "description": "Meghan went on to reveal a piece of advice her former co-star Gina Torres had given her too. &quot;She stopped me, &#39;Meg, I will just say one thing. Make sure you leave room for magic&#39;,&quot; Meghan recalled, adding: &quot;And that is my point. My New Year’s resolution is to leave room for magic.&quot;"
    },
    {
        "url": "https://au.news.yahoo.com/inside-harry-life-changing-aussie-010400886.html",
        "title": "Inside Harry’s ‘life-changing’ Aussie trip",
        "description": "Long before he married <b>Meghan Markle</b> and made a new life for himself away from royal life, Prince Harry spent a “gap year” in the Australian outback, where he said he had the “best weeks of (his) life”. A tranche of cabinet documents and photos ..."
    }
]