[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-accused-making-huge-31998524",
        "title": "<b>Meghan Markle</b> accused of making huge demand &#39;to compete with Kate Middleton&#39;",
        "description": "Meghan Markle and Prince Harry moved into Nottingham Cottage in the grounds of Kensington Palace after they were engaged, but the Duchess of Sussex reportedly had grander ideas"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-hyper-concerned-money-31998540",
        "title": "<b>Meghan Markle</b> &#39;hyper-concerned&#39; about money and worries she could &#39;lose everything&#39;",
        "description": "Meghan Markle is reportedly &#39;hyper-concerned&#39; about money and worries she could &#39;lose everything&#39;, with the Duchess of Sussex now taking control of her and husband Prince Harry&#39;s finances"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25591827/meghan-markle-prince-harry-archewell-productions-manager-quits/",
        "title": "Blow to <b>Meghan Markle</b> and Prince Harry as key member of Archewell staff quits after string of employees leave",
        "description": "HARRY and Meghan have been hit with a fresh blow after their Archewell Productions manager walked out. The company, which boasts a collaboration with Netflix, was launched in 2020 by the Sussexes"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-demanded-windsor-suite-31998705",
        "title": "<b>Meghan Markle</b> &#39;demanded Windsor Suite&#39; in attempt to compete with Kate Middleton",
        "description": "The Duchess of Sussex was reportedly left unhappy with the smaller royal property that she and Harry received after their wedding as she complained she had expected something more &quot;regal&quot; like Kate and William&#39;s apartment."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-wants-second-trial-mirror-phone-hacking/",
        "title": "Harry wants second trial with Mirror publisher over phone-hacking claims despite winning £140k in December",
        "description": "The second trial that Harry is pushing for is said to concern articles on his relationship with his father King Charles, as well as his brother Prince William, his previous girlfriends before <b>Meghan Markle</b>, and his career in the army. His barrister James ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/andrew-holness-marlene-malahoo-forte-o-1723081",
        "title": "Prince Harry, <b>Meghan Markle</b>&#39;s Jamaica Visit Sparks Claims Of &#39;Harry &amp; <b>Meghan</b>&#39; Sequel",
        "description": "Prince Harry and <b>Meghan Markle</b> stirred speculations of a new film or TV project in the works when they were pictured alongside a Paramount Pictures executive during the &quot;Bob Marley: One Love&quot; premiere in Jamaica last week. The Duke and Duchess of Sussex ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861093/Meghan-Markle-change-appearance-eyebrows-Hollywood-return-Bob-Marley",
        "title": "<b>Meghan Markle</b> debuts dramatic change to appearance as Hollywood rumours heat up",
        "description": "One Love film premiere with her husband Prince Harry, but all eyes were on the Duchess of Sussex&#39;s new eyebrows."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dragons-den-episode-ear-seeds-controversy-b2487154.html",
        "title": "BBC reinstates Dragons’ Den episode with disclaimer after ear seeds complaints",
        "description": "The BBC has been forced to edit an episode of Dragon’s Den following concerns over “unfounded claims” regarding a product that historically received offers from all six Dragons."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13021803/Grant-Denyer-denies-claims-cheating-Deal-No-Deal-absolutely-dont-know-theyre-going-picked.html",
        "title": "Grant Denyer denies claims of cheating on Deal Or No Deal: &#39;They absolutely don&#39;t know they&#39;re going to be picked&#39;",
        "description": "The revamped Deal or No Deal no longer features a line-up of glamorous models. It was a role etched in history after the future Duchess of Sussex <b>Meghan Markle</b> served as one such model between 2006 and 2007 on the U.S. version of the show. Instead ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861076/meghan-markle-royal-titles-princess",
        "title": "<b>Meghan Markle</b> is technically a princess and here’s why",
        "description": "When Meghan Markle resigned as a senior working royal, she agreed not to use her HRH title, but she is a Duchess, and if you look at the fine print, she is in fact a… Princess."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13021205/EPHRAIM-HARDCASTLE-Dragons-Dens-Steven-Bartlett-diamond-Meghan-Markle.html",
        "title": "EPHRAIM HARDCASTLE: Dragons&#39; Den&#39;s Steven Bartlett is impressed by diamond maker whose jewellery was worn by <b>Meghan Markle</b>",
        "description": "Dragons&#39; Den&#39;s Steven Bartlett was impressed when the Belgian owners of artificial diamond maker Kimai boasted that the Duchess of Sussex had worn their jewellery."
    },
    {
        "url": "https://uk.style.yahoo.com/better-call-saul-bob-odenkirk-221436229.html",
        "title": "“Better Call Saul”&#39;s Bob Odenkirk Learns He&#39;s Related to King Charles: &#39;That Is Crazy&#39;",
        "description": "The Better Call Saul star, 61, was shocked when he learned he&#39;s related to King Charles during an appearance on the hit PBS show Finding Your Roots, in which host Henry Louis Gates Jr. helps celebrities learn about their family history."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-urged-step-down-172940807.html",
        "title": "Prince Harry Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "African Parks issued a statement saying that an &quot;active, ongoing investigation&quot; into the claims was its &quot;highest priority&quot;"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25581881/meghan-markle-new-role-suits-spin-off/",
        "title": "<b>Meghan Markle</b> ‘offered role in Suits spinoff in biggest TV deal of the year’ – as co-star calls for her to join cast",
        "description": "A “DREAM role” in a Suits spinoff series has been offered to Meghan Markle, according to senior network execs. The Duchess, 42, could even see herself in the director’s seat on"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-warned-31992931",
        "title": "<b>Meghan Markle</b> and Prince Harry warned by police as £11.8 million mansion is targeted by thieves",
        "description": "Meghan Markle and Prince Harry have received a warning from local police after a home nearby was broken into, with a string of similar incidents in the area"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-fears-over-meghans-31968913",
        "title": "Prince Harry&#39;s fears over <b>Meghan</b>&#39;s tell-all threat as she wants to &#39;set the record straight&#39;",
        "description": "EXCLUSIVE: A source tells OK! that Prince Harry has shut down plans for wife Meghan Markle to tell her own story in what would likely be another bombshell royal autobiography"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-blocks-meghan-markles-31993669",
        "title": "Prince Harry &#39;blocks&#39; <b>Meghan Markle</b>&#39;s memoir as it would &#39;cause more angst with family&#39;",
        "description": "Prince Harry has seemingly warned his wife, <b>Meghan Markle</b>, against writing a tell-all memoir, according to sources. The Duchess of Sussex was ready to &#39;set the record straight&#39; about her time as part of the Firm, but Harry has &#39;put an end to her plans&#39; as he was worried about the repercussions, reports the Mirror."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-stomach-surgery-king-charles-latest-b2486430.html",
        "title": "Royal news – live: King leaves hospital hours after Kate returns home from surgery",
        "description": "Kate, the Princess of Wales, has returned home from hospital after receiving abdominal surgery, Kensington Palace has said. Prince Harry and Meghan Markle shared a sweet moment during their surprise visit to Jamaica for the premiere of Bob Marley: One Love."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-set-swap-school-121914262.html",
        "title": "<b>Meghan Markle</b> set to swap the school run for learning scripts as she’s offered ‘dream role’ in new Suits spin-off show",
        "description": "Meghan Markle is reportedly considering making a huge change to family life as it&#39;s claimed she&#39;s been offered her &#39;dream role&#39; in a Suits spin-off show."
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middleton-grateful-well-wishes-140645732.html",
        "title": "Kate Middleton &#39;Grateful for Well Wishes&#39; as She Continues Recovery at Home Following Surgery",
        "description": "We can all learn from that.&quot; Can&#39;t get enough of PEOPLE&#39;s Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, <b>Meghan Markle</b> and more! Prince William is expected to postpone some engagements to be by his wife ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markles-loveliness-inspired-suits-resurgence-says-co-star-1723051",
        "title": "<b>Meghan Markle</b>&#39;s &#39;Loveliness&#39; Inspired &#39;Suits&#39; Resurgence, Says Co-Star",
        "description": "The &quot;Suits&quot; cast (L-R front) Gina Torres, Patrick J. Adams, Gabriel Macht, IL-R back) <b>Meghan Markle</b>, Sarah Rafferty, and Rick Hoffman. Photo: Suits Peacock/Instagram Suits Peacock/Instagram Abigail Spencer credits <b>Meghan Markle</b>&#39;s charm as one of the ..."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-reportedly-landed-her-103300529.html",
        "title": "<b>Meghan Markle</b> Has Reportedly Landed Her &#39;Dream Role&#39; In A Spin-Off Series Of Suits",
        "description": "<b>Meghan Markle</b> has reportedly landed her &#39;dream&#39; TV role after being offered a place in a Suits spin-off series. It comes as NBCUniversal has apparently been given the go-ahead to start work on Suits: Los Angeles, and that episodes have already been written ..."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fashion/jewellery-valentines-day-gifts-missoma-astrid-and-miyu-b1124905.html",
        "title": "12 of the best jewellery brands to gift this Valentine&#39;s Day",
        "description": "It would probably be quicker to say what celebrities haven’t worn Mejuri. Mejuri is regularly seen on Margot Robbie, Selena Gomez, <b>Meghan Markle</b>, Taylor Swift and many other ultra A listers, and before you ask - no, it’s not even expensive either ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152888-meghan-markles-new-role-confirmed-as-king-charles-kate-step-back-from-royal-duties",
        "title": "<b>Meghan Markle</b>&#39;s new role confirmed as King Charles, Kate step back from royal duties?",
        "description": "Prince Harry&#39;s wife Meghan Markle seems to be delighted as she is reportedly being offered dream role amid king Charles and Kate Middleton&#39;s temporary exit from the royal duties.The Duchess"
    },
    {
        "url": "https://www.koimoi.com/television/suits-is-2023s-most-watched-tv-show-with-57-7-billion-views-130-higher-than-friends-guess-where-greys-anatomy-others-stand/",
        "title": "Suits Is 2023’s Most Watched TV Show With 57.7 Billion Views, 130% Higher Than Friends; Guess Where Grey’s Anatomy &amp; Others Stand?",
        "description": "Meghan Markle, Patrick J Adams starrer Suits ranks #1 in most-watched TV shows of 2023; check out the complete list now!"
    },
    {
        "url": "https://www.straitstimes.com/life/entertainment/legal-drama-suits-sets-new-streaming-record-in-2023-eclipsing-the-office",
        "title": "Legal drama Suits sets new streaming record in 2023, eclipsing The Office",
        "description": "Starring Gabriel Macht, Patrick J. Adams and Meghan Markle, it racked up 57.7 billion viewing minutes last year. Read more at straitstimes.com."
    },
    {
        "url": "https://www.firstpost.com/entertainment/prince-harry-has-no-power-it-is-meghan-who-takes-the-call-harry-meghan-latest-13667542.html",
        "title": "Prince Harry has no power; it is <b>Meghan</b> who takes the call | Harry &amp; <b>Meghan</b> Latest",
        "description": "Royal expert Angela Levin says of Duke and Duchess of Sussex&#39;s marriage: ‘He&#39;s given in. He walks behind them.&#39; He ‘has no power’ and is ‘outnumbered’ by Meghan Markle and her mum Doria."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/prepared-to-pay-what-it-takes-meghan-markle-negotiating-a-gig-in-suits-reboot-as-staff-exodus-continues-at-archewell/news-story/abaf9ababca7a7cacba1c1a55a2d0f92",
        "title": "‘Prepared to pay’: <b>Meghan Markle</b> offered a lifeline as staff exodus continues",
        "description": "Meghan Markle has reportedly been offered a “dream role” in the upcoming revival of her former series Suits but the job would not involve reprising her role as paralegal Rachel Zane."
    },
    {
        "url": "https://www.hindustantimes.com/entertainment/web-series/suits-ted-lasso-most-viewed-streaming-shows-of-2023-101706580722587.html",
        "title": "From Suits to Ted Lasso, here are the most viewed streaming shows of 2023",
        "description": "Here&#39;s what People in America were streaming online in 2023. Popular series Suits topped the chart, beating the record made by The Office during the pandemic."
    },
    {
        "url": "https://www.btimesonline.com/articles/163629/20240130/prince-harry-halts-meghan-markles-memoir-amid-royal-reconciliation-efforts.htm",
        "title": "Prince Harry Halts <b>Meghan Markle</b>&#39;s Memoir Amid Royal Reconciliation Efforts",
        "description": "Prince Harry has reportedly taken decisive steps to prevent the publication of a potentially revelatory memoir by his wife, Meghan Markle. This development unfolds against a backdrop of ongoing tensions and delicate negotiations within the British Royal Family,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/psychic-says-meghan-markle-will-struggle-feeling-disappointed-short-changed-negotiations-deal-wanted-falls-through.html/",
        "title": "Psychic Says <b>Meghan Markle</b> Will ‘Struggle’ Feeling ‘Disappointed’ and ‘Short-Changed’ After Negotiations for Deal She Wanted Falls Through",
        "description": "Here&#39;s what a celebrity psychic has predicted about how Meghan Markle will be feeling when she doesn&#39;t get a coveted deal."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-could-join-the-suits-spin-off/",
        "title": "<b>Meghan Markle</b> could join the Suits spin-off",
        "description": "After a disastrous 2023, Meghan Markle and her famous princely husband, Harry, are looking for ways to reinvent themselves. A part as an actress or even director on the spin-off would generate income and hopefully good press for Meghan."
    },
    {
        "url": "https://www.theroot.com/if-you-loved-meghan-markle-in-suits-here-are-more-tv-1851205968",
        "title": "If You Loved <b>Meghan Markle</b> in ‘Suits,’ Here Are More Black TV Characters to Revisit",
        "description": "As the excitement around the legal drama co-starring Markle builds, here are our suggestion for good TV with great Black characters."
    },
    {
        "url": "https://www.dailytelegraph.com.au/news/national/meghan-markle-thinks-a-suits-spinoff-is-beneath-her/video/8702ed31c7296ec10496b899ee004eac",
        "title": "<b>Meghan Markle</b> thinks a suits spin-off is ‘beneath her’",
        "description": "Royal commentator Kinsey Schofield says Meghan Markle probably thinks that a Suits spin-off is “beneath her”. Suits creator Aaron Korsh has written a new spin-off, with a role that has some believing it has been “tailor-made” for the Duchess of Sussex."
    },
    {
        "url": "https://people.com/prince-harry-urged-step-down-african-parks-board-reports-abuse-rangers-8551205",
        "title": "Prince Harry Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "Prince Harry is being called to step down from the Board of Directors at African Parks Network amid claims that the organization&#39;s rangers raped, beat and tortured indigenous people in the Republic of the Congo."
    },
    {
        "url": "https://www.mensjournal.com/news/suits-most-streamed-show-2023-nielsen",
        "title": "‘Suits’ Is Now the Most-Streamed Show of All Time Over a Single Year",
        "description": "Suits is now the most-streamed show of all time over the course of a single year. Nielsen released its list of the top 10 most-streamed shows of 2023, with USA’s lightweight legal dramedy topping the ranks."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-surgery-big-mistake-unveiled-could-have-made-huge-difference.html/",
        "title": "Kate Middleton’s Surgery ‘Big Mistake’ Unveiled: ‘Could Have Made a Huge Difference’",
        "description": "Kate Middleton had the opportunity to make a lasting impact with her surgery announcement. A royal commentator says she missed the boat."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markles-trip-155126050.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>&#39;s Trip to Jamaica Might Signal a New Hollywood Deal on the Horizon",
        "description": "Prince Harry and Meghan Markle’s surprise trip to Jamaica last week in support of the film, Bob Marley: One Love, has a lot of people talking. While the British tabloids are busy trying to turn it into a scandal like they always do,"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-charity-promotion-rape-african-parks-1864758",
        "title": "Prince Harry&#39;s Charity Promotion Is Hugely Problematic",
        "description": "Prince Harry was warned of rapes by rangers, months before his promotion to the board of charity African Parks was publicized."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/29/65b7cade22601da80d8b4580.html",
        "title": "Kate Middleton out of hospital after two weeks, Kensington Palace gives details on her condition",
        "description": "The British Royal Family had been waiting for 14 days since it was revealed that Kate Middleton, Princess of Wales, was admitted to hospital due to complications in her abdomen fro"
    },
    {
        "url": "https://www.rte.ie/lifestyle/fashion/2024/0129/1429237-meghan-markle-stuns-in-carolina-herrera-while-visiting-jamaica/",
        "title": "<b>Meghan Markle</b> stuns in Carolina Herrera while visiting Jamaica",
        "description": "<b>Meghan Markle</b> and Prince Harry were spotted at the premiere of Bob Marley: One Love at the Carib 5 Theatre in Jamaica. The Duke and Duchess of Sussex were pictured attending the event with CEO of Paramount Pictures and Nickelodeon Brian Robbins and fashion ..."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-designer-skirt-looks-140000775.html",
        "title": "<b>Meghan Markle</b>’s Designer Skirt Looks Like This $36 Amazon One Shoppers Say Is ‘Very Flattering’",
        "description": "She wore the Carolina Herrera look to the &#39;Bob Marley: One Love&#39; premiere in Jamaica Marcus Ingram/Getty Images Prince Harry and <b>Meghan Markle</b> touched down in Jamaica. The couple attended the premiere of Bob Marley: One Love in the Caribbean last week and ..."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/taylor-swift-celebrated-travis-kelces-171815354.html",
        "title": "Taylor Swift Celebrated Travis Kelce’s Championship Win With a Very ’00s Nail Trend",
        "description": "Now we’re kind of wondering…are square nails officially back? It certainly seems so. <b>Meghan Markle</b>, the other people’s princess, wore a square-shaped mani on her most recent public outing with Prince Harry. So now that actual royalty and pop royalty ..."
    },
    {
        "url": "https://www.hellomagazine.com/celebrities/512160/oprah-winfrey-at-70-look-back-personal-life-career-weight-loss/",
        "title": "Oprah at 70: her multi-billion-dollar empire, controversial weight loss, sex trafficking claims, and her &#39;spiritual partnership&#39;",
        "description": "Oprah doesn&#39;t keep her billions to herself. Over the years she has donated an estimated $400 million through her charities, the Oprah Winfrey Foundation, and the Oprah Winfrey Charitable Foundation, to organizations that &quot;serve children, families, and communities, with a specific focus on youth education&quot;."
    },
    {
        "url": "https://www.btimesonline.com/articles/163620/20240130/prince-harry-and-meghan-markles-hollywood-hustle-hits-hurdles-as-the-sussexes-losing-public-support.htm",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Hollywood Hustle Hits Hurdles as the Sussexes &#39;Losing Public Support&#39;",
        "description": "Prince Harry and <b>Meghan Markle</b>, the Duke and Duchess of Sussex, are reportedly in a scramble to secure new business ventures as their public support wanes amid ongoing royal controversies. Since their high-profile departure from senior royal duties in ..."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/511964/alex-jones-cotton-traders-winter-fashion-edit/",
        "title": "Exclusive: Alex Jones shares her favourite fashion tips – and reveals the £36 knit she loves",
        "description": "The Welsh presenter has been at the helm of some major TV moments, including the wedding of Prince Harry and <b>Meghan Markle</b>, Eurovision, and Comic Relief. A semi-finalist on Strictly Come Dancing in 2011 and a busy mum-of-three, Alex has unveiled her latest ..."
    },
    {
        "url": "https://www.arabtimesonline.com/news/prince-william-concerned-about-kate-middletons-health-after-her-surgery/",
        "title": "Prince William concerned about Kate Middleton’s health after her surgery",
        "description": "The insider queried about Prince William’s response to <b>Meghan Markle</b> and Prince Harry’s unexpected trip to Jamaica, conveyed that the Prince of Wales is preoccupied with matters close to home, particularly Kate’s recuperation post-surgery."
    },
    {
        "url": "https://ca.finance.yahoo.com/news/viral-tiktok-video-captures-prince-195006441.html",
        "title": "Viral TikTok Video Captures Prince Harry and <b>Meghan Markle</b>’s Off the Charts Chemistry While in Jamaica for the ‘Bob Marley: One Love’ Premiere",
        "description": "We’ve always known Prince Harry and <b>Meghan Markle</b>’s chemistry is off the charts—and the shine hasn’t dulled even the least bit after nearly six years of marriage. While on a surprise visit to Kingston, Jamaica to attend the premiere of the biopic ..."
    },
    {
        "url": "https://www.thedailybeast.com/prince-harry-and-meghan-markles-jamaica-trip-misguided-royal-source-says",
        "title": "Harry and <b>Meghan</b>’s Jamaica Trip ‘Misguided,’ Royal Source Says",
        "description": "Prince Harry and <b>Meghan Markle</b>’s photocall with Andrew Holness, the prime minister of Jamaica, was “not what you would call ideal,” according to one royal source speaking to the Times of London. The timing of the Sussexes’ visit as the guests of ..."
    }
]