[
    {
        "url": "https://www.thenews.com.pk/latest/1142914-meghan-markle-issued-new-warning-for-2024",
        "title": "<b>Meghan Markle</b> issued new warning for 2024",
        "description": "Prince Harry&#39;s wife Meghan Markle, who&#39;s said to be planning to write her tell-all memoir, has been warned that 2024 is not the year for her new book.The Duchess of Sussex, who might have"
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/the-sign-that-forgiving-monarch-king-charles-could-welcome-harry-and-meghan-back-under-one-condition/",
        "title": "The sign that ‘forgiving monarch’ King Charles could welcome Harry and <b>Meghan</b> back – under one condition",
        "description": "King Charles is determined to be a ‘forgiving monarch’ and could welcome back Harry and Meghan, a royal expert has claimed"
    },
    {
        "url": "https://www.btimesonline.com/articles/162945/20231229/royal-snubs-meghan-markles-struggle-to-enter-amal-clooney-and-michelle-obama-circle.htm",
        "title": "Royal Snubs: <b>Meghan Markle</b>&#39;s Struggle to Enter Amal Clooney and Michelle Obama Circle",
        "description": "Meghan Markle, the Duchess of Sussex, is reportedly grappling with feelings of exclusion from the elite circles of Amal Clooney and Michelle Obama. Sources close to the Duchess reveal a tale of unreciprocated attempts at friendship and a perceived cold shoulder from some of the most influential women in the global spotlight."
    },
    {
        "url": "https://www.btimesonline.com/articles/162944/20231229/meghan-markles-falling-out-with-jessica-mulroney-sparks-tell-all-fears.htm",
        "title": "<b>Meghan Markle</b>&#39;s Falling Out with Jessica Mulroney Sparks Tell-All Fears",
        "description": "Amidst the glamour and scrutiny of royal life, a potentially explosive situation is simmering between Meghan Markle and her once best friend, Jessica Mulroney. The friendship that seemed unshakeable is now under intense examination as fears mount that Mulroney might divulge private details about the Duchess of Sussex,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-trashing-reputations-absolute-bonfire-says-expert.html/",
        "title": "<b>Meghan Markle</b> and Prince Harry ‘Trashing’ Their Reputations: 2023 Was an ‘Absolute Bonfire’ Says Expert",
        "description": "Meghan Markle and Prince Harry were &#39;trashing&#39; their reputations in 2023 says a royal expert. What will 2024 bring for the royal couple?"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-lots-say-warned-31767956",
        "title": "<b>Meghan Markle</b> has &#39;lots to say&#39; but is warned 2024 is not the year for a tell-all memoir",
        "description": "An expert has predicted that Meghan Markle has &#39;lots to say&#39; should she pen a book, but the Duchess of Sussex has been warned that 2024 is not the year for her tell-all memoir"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142854-meghan-markle-braces-for-ultimate-betrayal-as-intimate-secrets-to-be-exposed",
        "title": "<b>Meghan Markle</b> braces for &#39;ultimate betrayal,&#39; ex pal teases &#39;there&#39;s more to come&#39;",
        "description": "Meghan Markle is constantly looking over her shoulder as she anticipates another betrayal.Speaking to Life &amp; Style, a source revealed that the Duchess of Sussex is afraid that her former"
    },
    {
        "url": "https://ijr.com/prince-harry-meghan-receive-major-snub-royal-family-christmas/",
        "title": "Prince Harry and <b>Meghan</b> Receive Major Snub From Royal Family for Christmas",
        "description": "After years of badmouthing the royal family, Harry and Meghan&#39;s relationship with King Charles may finally be over."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12907185/Here-come-society-brides-grooms-Norways-Princess-M-rtha-Louise-Duke-Westminster-granddaughter-Shah-Iran-tie-knot-year-wedding-come-top.html",
        "title": "Here come the society brides (and grooms)! Norway&#39;s Princess Märtha Louise, the Duke of Westminster and the granddaughter of the last Shah of Iran will all tie the knot this ...",
        "description": "From Prince George&#39;s godfather to the King of Norway&#39;s daughter, a host of royals, well-connected socialites and aristocrats are tying the knot in 2024."
    },
    {
        "url": "https://www.thestar.com.my/lifestyle/entertainment/2023/12/29/the-crown-star-dominic-west-prince-harry-had-falling-out-over-an-interview",
        "title": "‘The Crown’ star Dominic West, Prince Harry had falling out over an interview",
        "description": "The Crown star Dominic West says he fell out of favour with former pal Prince Harry after sharing “too much” in an interview."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/prince-william-kate-middleton-have-learnt-this-from-prince-harrys-memoir-101703770391975.html",
        "title": "Prince William-Kate Middleton have learnt this from Prince Harry&#39;s memoir",
        "description": "Royal commentator Gareth Russell said that Prince Harry&#39;s emotions came across strongly in the book. “It&#39;s very clear from his memoir, whether rightly or wrongly, that he felt shunted to one side and that even was with a mother as loving as Diana,"
    },
    {
        "url": "https://www.skynews.com.au/opinion/meghan-markle-could-be-quizzed-under-oath-amid-ongoing-defamation-case/video/fe443f1f452139865378f2280c9eddf4",
        "title": "<b>Meghan Markle</b> could be quizzed under oath amid ongoing defamation case",
        "description": "Samantha Markle’s lawyers are looking for a “deposition” in the ongoing defamation case which could see Meghan Markle quizzed under oath, Writer and Broadcaster Esther Krakue says. “Apparently Samantha Markle’s lawyers are looking to have a deposition with the Sussexes in the ongoing lawsuit,” Ms Krakue told Sky News host Caroline Di Russo."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-were-31766221.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> were tipped &#39;over the edge&#39; by tense moment at Christmas",
        "description": "Meghan Markle and Prince Harry last spent Christmas with the Royal Family in 2018 and it seems one thing left them &#39;furious&#39; after the final festive gettogether"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850042/meghan-markle-prince-harry-omid-scobie-endgame",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s biographer Omid Scobie &#39;threw spanner in Sussexes&#39; plans&#39;",
        "description": "Meghan Markle and Prince Harry&#39;s year appears to be ending on a low, after they were branded among the &quot;biggest losers in Hollywood&quot; by a prestigious publication."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25185585/meghan-markle-queen-kate-middleton-royal-author-tom-bower/",
        "title": "<b>Meghan Markle</b> ‘jealous of everything Kate Middleton has’ and ‘wants to be Queen’, claims royal author Tom Bower",
        "description": "MEGHAN Markle “wants to be the Queen” and “Kate Middleton has everything she wants”, according to a royal author. Tom Bower claimed that the Princess of Wales is proving highly successful in her"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25189982/meghan-markle-new-year-resolutions-redemption/",
        "title": "<b>Meghan Markle</b>’s New Year resolutions revealed as she plots to break bad habits in ‘year of redemption’",
        "description": "<b>MEGHAN Markle</b>&#39;s New Year&#39;s resolutions have resurfaced amid hopes for a &quot;year of redemption&quot;. On January 1, 2016 - just six months before meeting Prince Harry - <b>Meghan</b> took to her now-defunct blog The Tig to share her resolutions. <b>Meghan</b> wrote ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847087/prince-harry-meghan-markle-year-in-review",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s 2023 highs and lows, from Frogmore eviction to Invictus",
        "description": "The past year has been a turbulent one for Prince Harry and Meghan Markle, with their names never far from the headlines."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12810191/meghan-markle-wardrobe-total.html",
        "title": "<b>Meghan Markle</b>&#39;s Hollywood wardrobe! Duchess of Sussex was seen in new clothes worth more than £86,000 in 2023 as she partied with A-listers and posed on red carpets",
        "description": "The Duchess of Sussex, 42, who now lives in Montecito, California, is known for her expensive clothing and jewellery collection - and this year she added to it even further."
    },
    {
        "url": "https://www.ibtimes.co.uk/author-calls-kate-middleton-strong-willed-despite-innocuous-public-image-1722442",
        "title": "Author Calls Kate Middleton &#39;Strong-Willed&#39; Despite &#39;Innocuous&#39; Public Image",
        "description": "Royal author Valentine Low says the Princess of Wales is &quot;prepared to fight for what she wants and what she thinks is right&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-were-31769044",
        "title": "Prince Harry and <b>Meghan Markle</b> were tipped &#39;over the edge&#39; by tense Christmas moment",
        "description": "In the book Finding Freedom, authors Omid Scobie and Carolyn Durand claimed the Sussexes believed the Royal Family were &quot;conspiring against them&quot; with the move. They said the couple felt they had &quot;long been sidelined by the institution and were not a fundamental part of its future&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/christmas-incident-sent-prince-harry-31764783",
        "title": "The Christmas incident that sent Prince Harry and <b>Meghan</b> &#39;over the edge&#39;",
        "description": "The Duke and Duchess of Sussex were reportedly left &quot;furious&quot; after one event during their final Christmas with the Royal Family that sent them &#39;over the edge&#39;."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/music/news/katy-perry-new-album-2024-tour-b2470593.html",
        "title": "Katy Perry set to release ‘most personal’ album in 2024",
        "description": "Katy Perry is expected to release her first album in four years in 2024, with a source saying the new record will feature the “most personal” music of her career. The pop star’s last new release was her sixth album Smile in 2020, which reached the top five in Australia, Canada, New Zealand, the United Kingdom and the United States."
    },
    {
        "url": "https://uk.yahoo.com/news/fact-check-shocking-meghan-markle-184400447.html",
        "title": "Fact Check: &#39;Shocking <b>Meghan Markle</b> Announcement&#39;: Online Ad Makes Evidence-Free Claims About Royal Couple",
        "description": "The online ad said that Prince Harry had been &quot;humiliated&quot; over Meghan&#39;s purportedly &quot;shocking&quot; announcement. Here&#39;s why these made-up claims exist."
    },
    {
        "url": "https://www.marieclaire.co.uk/beauty/megan-foxs-hungover-updo-is-the-perfect-new-years-day-style",
        "title": "Megan Fox&#39;s &#39;hungover updo&#39; is the perfect New Year&#39;s Day style",
        "description": "Over the festive season when everything gets a little bit hectic, we&#39;re here for low-maintenance hairstyles. And Megan Fox &#39;s take on the undone bun—appropriately called the &#39;hungover updo&#39; is the perfect next-day look after a night out. We know who we&#39;ll be channelling come New Year&#39;s Day."
    },
    {
        "url": "https://eng.obozrevatel.com/section-entertainment/news-a-rare-photo-of-meghan-markle-posing-in-a-santa-mini-dress-was-found-online-29-12-2023.html",
        "title": "A rare photo of <b>Meghan Markle</b> posing in a Santa mini-dress was found online",
        "description": "<b>Meghan Markle</b>, the wife of Prince Harry of Sussex, the biggest &quot;loser of the royal family,&quot; was photographed back in 2006 wearing a glamorous Miss Santa costume. It is quite difficult to recognize her. The look of the Duchess of Sussex in the photo is ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510256/royals-not-invited-sandringham-christmas/",
        "title": "How royals not invited to King Charles&#39; Sandringham gathering spent Christmas",
        "description": "Seven-year-old Christopher was absent from the royal celebrations in Norfolk this year, spending Christmas in the US with his mother, Dara Huang, even making time to visit Disneyland, with Dara sharing snaps from their trip on Instagram - what a dream come true for a little boy!"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142853-meghan-markles-huge-efforts-to-grab-lucrative-deals-go-in-vain",
        "title": "<b>Meghan Markle</b>’s ‘huge efforts’ to grab lucrative deals go in vain",
        "description": "Meghan Markle is reportedly desperate to collaborate with some high-end fashion brands in order to revive her crumbling career in Hollywood. Earlier, it was reported that the former"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-cute-moment-young-fan-viral-video-tiktok-1856375",
        "title": "Prince Harry&#39;s &#39;Cute&#39; Moment With Young Fan Caught on Camera",
        "description": "Harry&#39;s interaction with a young fan holding a &quot;Gingers Unite&quot; sign at a royal event has gone viral on TikTok."
    },
    {
        "url": "https://www.newsweek.com/kate-middleton-meghan-markle-matching-curtsies-1856346",
        "title": "Kate Middleton and <b>Meghan</b>&#39;s Historic Matching Curtsies Go Viral",
        "description": "The Princess of Wales and Duchess of Sussex&#39;s curtsies during the funeral of Queen Elizabeth II have gone viral online."
    },
    {
        "url": "https://www.dublinlive.ie/news/dublin-news/old-moores-2024-predictions-including-28337976",
        "title": "Old Moore&#39;s 2024 predictions including Ireland&#39;s first female Taoiseach and assassination warning for Donald Trump",
        "description": "An assassination warning for Donald Trump and plans for Ireland’s first female Taoiseach are Old Moore’s predictions for 2024."
    },
    {
        "url": "https://www.vogue.in/content/why-manushi-chhillars-thigh-high-slit-gown-is-the-perfect-choice-to-close-the-year",
        "title": "Why Manushi Chhillar&#39;s thigh-high slit gown is the perfect choice to close the year",
        "description": "Manushi Chhillar&#39;s outfit draws parallels with the iconic style of Marilyn Monroe, the pop culture icon, particularly in a scene from &#39;Ladies Of The Chorus&#39; where she wore a glittery black chiffon gown designed by Jean Louis."
    },
    {
        "url": "https://www.vogue.in/content/the-biggest-bombshell-royal-moments-of-2023",
        "title": "The biggest bombshell royal moments of 2023",
        "description": "Need a recap of all the royal moments that happened in 2023? Most people probably do—the past 12 months have been some of the most dramatic on record for the royal family. (Which is saying a lot: since the abdication of King Edward VIII in 1936, the Windsors have regularly made headlines for their sensational behaviour.)"
    },
    {
        "url": "https://www.aol.com/biggest-celeb-memoir-bombshells-2023-230215740.html",
        "title": "The Biggest Celeb Memoir Bombshells of 2023: Prince Harry&#39;s Todger and More",
        "description": "Celebrity memoir fans received an enormous bounty in 2023, with stars including Britney Spears, Prince Harry and Barbra Streisand dropping books packed with juicy recollections. Harry kicked off the year with his much-discussed memoir,"
    },
    {
        "url": "https://news.yahoo.com/buccaneers-stars-alisha-boe-kristine-192601615.html",
        "title": "‘The Buccaneers’ Stars Alisha Boe And Kristine Frøseth On <b>Meghan Markle</b> Parallels, What They’d Like To See In Season 2",
        "description": "The Buccaneers has wowed audiences this season with drama and revelations regarding the group of young American socialites finding love and themselves as they navigate Gilded Age London. Shadow and Act Managing Editor Trey Mangum talked with Kristine Frøseth and Alisha Boe about their characters Annabel “Nan” St."
    },
    {
        "url": "https://www.snopes.com/fact-check/meghan-markle-shocking-announcement/",
        "title": "&#39;Shocking <b>Meghan Markle</b> Announcement&#39;: Online Ad Makes Evidence-Free Claim About Royal Couple",
        "description": "The online ad said that Prince Harry had been &quot;humiliated&quot; over Meghan&#39;s purportedly &quot;shocking&quot; announcement. Here&#39;s why these made-up claims exist."
    },
    {
        "url": "https://www.yahoo.com/entertainment/actresses-married-royal-family-meghan-182544199.html",
        "title": "Actresses Who Married into the Royal Family: <b>Meghan Markle</b> More",
        "description": "When news broke back in 2017 that Suits star Meghan Markle would be marrying into the British Royal family, the world nearly exploded. Everyone who followed the family was losing their mind over not only an outsider being wed into the family,"
    },
    {
        "url": "https://bestlifeonline.com/prince-philip-banned-fergie-news/",
        "title": "Prince Philip Banned Fergie From the Royal Family—Here&#39;s What Brought Her Back",
        "description": "Prince Philip and Sarah Ferguson had a decades-long feud, but now, she&#39;s been publicly welcomed back into the royal family."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-fears-ex-best-164422098.html",
        "title": "<b>Meghan Markle</b> Fears Ex-Best Friend Jessica Mulroney Will ‘Betray’ Her and Share ‘Intimate Secrets’",
        "description": "Her messages were loaded. In early December, Jessica Mulroney — Meghan Markle’s best friend whose 2020 white privilege scandal amid the rise of the Black Lives Matter movement fueled widespread reports they’d fallen out — reposted a video on her Instagram Story about people who won’t look for the truth."
    }
]