[
    {
        "url": "https://www.thesun.ie/royals/11869073/meghan-markle-archie-devastated-camera/",
        "title": "<b>Meghan Markle</b> reveals Prince Archie, four, was devastated when she didn’t buy him an £8,000 camera",
        "description": "MEGHAN Markle has revealed that little Archie has developed a new hobby – but he wasn’t very impressed when she bought him a present to encourage him. The Duchess of Sussex, 42, shared how"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/are-prince-harry-and-meghan-markle-trying-to-reconcile-with-royal-family-exploring-their-turbulent-relationship-amid-racism-scandal-1265769",
        "title": "Are Prince Harry and <b>Meghan Markle</b> trying to reconcile with royal family? Exploring their turbulent relationship amid racism scandal",
        "description": "Prince Harry and Meghan Markle are reportedly having a change of heart. As Christmas approaches, is a reunion around the corner for the British royal family?"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/breaking-prince-harry-meghan-markle-2023-christmas-card-16-december-2023/",
        "title": "Prince Harry and <b>Meghan Markle</b> reveal their 2023 Christmas card",
        "description": "The Duke and Duchess of Sussex, Prine Harry and Meghan Markle have finally revealed their 2023 Christmas cards."
    },
    {
        "url": "https://www.kiro7.com/news/trending/prince-harry-meghan-markle-release-holiday-card-2023/I4LZVQ3YABAWNC5SGBGETJ3YZM/",
        "title": "Prince Harry, <b>Meghan Markle</b> release holiday card for 2023",
        "description": "The Duke and Duchess of Sussex on Friday released their 2023 holiday card. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads, according to People Magazine. The card was sent in an email on behalf of their Archwell organization."
    },
    {
        "url": "https://www.aol.com/black-style-meghan-markle-prince-172140257.html",
        "title": "Black in Style: <b>Meghan Markle</b> and Prince Harry’s holiday card debuts as Harry wins phone-hacking lawsuit",
        "description": "In Black style this week, your house can smell like Prince, Fashion Fair takes on breast cancer, Ambi skincare offers […] The post Black in Style: Meghan Markle and Prince Harry’s holiday card debuts as Harry wins phone-hacking lawsuit appeared first on TheGrio."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872049/meghan-markle-netflix-questions-director-misan-harriman.html",
        "title": "<b>Meghan Markle</b> hosts Netflix Q&amp;A with friend and director Misan Harriman one year after the Duke and Duchess of Sussex&#39;s bombshell documentary premiered on the streaming service",
        "description": "Meghan joined new film director and friend Misan Harriman, who had just released the live-action short film hopeful The After at an exclusive premiere in a private Californian residence."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-no-fun-marrying-31689003",
        "title": "Prince Harry is &#39;no fun&#39; since marrying <b>Meghan Markle</b>, jokes pal James Haskell",
        "description": "Former England rugby player James Haskell has spoken out about how Prince Harry has reportedly changed since meeting his wife Meghan Markle, claiming the Duke is &quot;no fun&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846382/meghan-markle-christmas-card-dress-fashion",
        "title": "<b>Meghan Markle</b>’s Christmas card dress cost £830 - but is less pricey than her 2022 dress",
        "description": "Meghan Markle and Prince Harry has shared their 2023 Christmas card, and the Duchess&#39; festive dress costs much less than her 2022 custom-made dress."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846369/prince-harry-meghan-markle-royal-family-reunion",
        "title": "<b>Meghan Markle</b> &#39;a thorn in Harry&#39;s side&#39; as prince &#39;won&#39;t be welcome back to UK with her&#39;",
        "description": "A royal commentator branded Meghan Markle a &#39;thorn&#39; and claimed Prince Harry would have to come back to the UK &#39;divorced&#39; to win back the public&#39;s trust."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-meghans-christmas-card-shows-31687954",
        "title": "Harry and <b>Meghan</b>&#39;s Christmas card shows &#39;united display&#39; but &#39;something missing&#39;",
        "description": "Harry and Meghan&#39;s green-hued festive card shows both happy and clapping side by side at the Invictus Games earlier this year. Now, PR guru Lynn Carratt of Press Box analysed the snap and has given her professional insight as to how viewers may interpret it."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509617/meghan-markle-reveals-gifts-she-and-prince-harry-gave-prince-archie/",
        "title": "Prince Archie left confused by <b>Meghan Markle</b>&#39;s latest gift to him",
        "description": "Now four-and-a-half, Prince Archie&#39;s personality is shining through. Opening up about her son&#39;s latest hobby, Meghan Markle, 42, revealed that her close friend and filmmaker, Misan Harriman has been teaching him all about photography."
    },
    {
        "url": "https://uk.style.yahoo.com/harry-meghan-believe-royal-family-124841557.html",
        "title": "Harry And <b>Meghan</b> “Believe Royal Family Behind Vendetta Blocking Big Brand Deals”",
        "description": "During yet another dramatic week for the British royal family, UK media reports that WME has been holding crisis talks with its high-profile clients Prince Harry and Meghan Markle. Despite Harry’s victory in the UK’s High Court on Friday – where he won a $180,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509612/prince-george-princess-charlotte-prince-louis-individual-christmas-trees-bucklebury-manor/",
        "title": "Prince George, Princess Charlotte and Prince Louis&#39; incredible Christmas tree at grandparent&#39;s home",
        "description": "King Charles and Queen Camilla were not in attendance, however, the Wales&#39; were joined by a long list of royal family members including; The Duchess of Edinburgh, Princess Eugenie, Princess Beatrice Zara Tindall, Peter Phillips, and Lady Sarah Chatto who all came out to support Princess Kate."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghans-christmas-card-missing-31686802",
        "title": "Harry and <b>Meghan</b>&#39;s Christmas card was missing something important amid &#39;united display&#39;",
        "description": "Prince Harry and Meghan Markle&#39;s Christmas card was missing something important amid their &#39;united display&#39;, an expert has analysed following the 2023 festive offering being released"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073801/prince-harry-no-fun-since-marrying-meghan-james-haskell/",
        "title": "Prince Harry is no fun since marrying <b>Meghan Markle</b>, pal James Haskell reveals",
        "description": "PRINCE Harry is “no fun” since marrying Meghan Markle, according to friend James Haskell. The former England rugby star hinted at how much the Duke of Sussex had changed since tying"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/prince-harry-no-fun-marrying-28302125",
        "title": "Prince Harry is &#39;no fun&#39; since marrying <b>Meghan Markle</b>, James Haskell says",
        "description": "I&#39;m A Celebrity star, who split from Chloe Madeley last month, has claimed the Duke of Sussex lacks the fun and good humour of old since he married the former Suits actress."
    },
    {
        "url": "https://goss.ie/uk-showbiz/longtime-friend-brands-prince-harry-no-fun-since-he-married-meghan-markle-362807",
        "title": "Longtime friend brands Prince Harry ‘no fun’ since he married <b>Meghan Markle</b>",
        "description": "James Haskell, a longtime friend of Prince Harry, has claimed he’s been “no fun” since he married Meghan Markle. While the former rugby union player has jumped to their defence in the past, the 38-year-old made a sly dig towards the couple on stage during a live version of his podcast in Bath this week."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-could-return-royal-31686307",
        "title": "<b>Meghan Markle</b> could return to the Royal Family if she abides by one simple condition",
        "description": "Meghan Markle would have to abide by one condition should she return to the Royal Family, it has been claimed by an author, which comes as the Sussexes continue their lives in California"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073670/meghan-markles-christmas-card-political-aspirations-body-language-expert/",
        "title": "<b>Meghan Markle</b>’s Christmas card pose ‘reeks of success’ &amp; hints at political aspirations, body language expert claims",
        "description": "Meghan Markle’s “professional” Christmas card pose alongside the music accompaniment “‘reeks of success, celebration and glory” and hints at her political"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12870377/Zoe-Saldana-holding-hands-husband-Marco-Perego-Montecito.html",
        "title": "Zoe Saldana spotted holding hands with husband Marco Perego at Montecito farmer&#39;s market... after spending $17.5M on a new house in the chic beachside enclave",
        "description": "The Avatar star, 45, and her family bought a $17.5 million mansion this fall in the city that is home to Meghan Markle and Prince Harry , Oprah Winfrey, and Ellen DeGeneres and Portia de Rossi."
    },
    {
        "url": "https://uk.style.yahoo.com/12-years-premiere-suits-trending-013000884.html",
        "title": "12 Years After Its Premiere, ‘Suits’ Is Trending Again: <b>Meghan Markle</b> Explains Why",
        "description": "The People’s Choice Award- and NAACP Image Award-nominated show developed a global fan base and became a classic, binge-worthy show that topped Netflix’s charts this summer and fall, setting a record with 12 consecutive weeks at No. 1."
    },
    {
        "url": "https://goss.ie/uk-showbiz/piers-morgan-claims-prince-harry-and-meghan-markle-are-on-a-mission-to-destroy-the-british-monarchy-362800",
        "title": "Piers Morgan claims Prince Harry and <b>Meghan Markle</b> are on a mission to ‘destroy the British monarchy’",
        "description": "Piers Morgan has claimed Prince Harry and <b>Meghan Markle</b> are on a mission to “destroy the British monarchy”. His latest war of words against the Duke and Duchess of Sussex has come after Harry was awarded damages in his phone hacking trial against ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-meghan-markle-christmas-31685669",
        "title": "<b>Meghan</b> and Harry release their official 2023 Christmas card and thank fans for support",
        "description": "Prince Harry and Meghan Markle have released their official Christmas card just over a week before the big day, and have treated some lucky recipients to the virtual greeting"
    },
    {
        "url": "https://www.vogue.co.uk/article/harry-meghan-christmas-card-2023",
        "title": "The Deeper Meaning Behind The Duke &amp; Duchess Of Sussex’s 2023 Christmas Card",
        "description": "Prince Harry and Meghan Markle sent a virtual holiday card on behalf of their foundation, Archewell. It showed a picture of them smiling and clapping at the 2023 Invictus Games in Düsseldorf – the multi-sport tournament for wounded and injured veterans that Prince Harry founded in 2014."
    },
    {
        "url": "https://www.samaa.tv/208736384-king-charles-sets-strict-conditions-for-potential-reunion-with-prince-harry",
        "title": "King Charles sets strict conditions for potential reunion with Prince Harry",
        "description": "&quot;If there will be a meeting, it will have to be done properly with aides and officials present, and everything documented with minutes taken,&quot; revealed an insider to Express UK, emphasizing the King&#39;s stance on establishing a framework for trust."
    },
    {
        "url": "https://nypost.com/2023/12/16/news/bestselling-celeb-memoirs-by-britney-spears-prince-harry-and-others-may-have-failed-to-earn-back-advances-report/",
        "title": "Bestselling celeb memoirs by Britney Spears, Prince Harry and others may have failed to earn back advances: report",
        "description": "NewsNation’s “The Scoop” from Paula Froelich crunched the numbers to see if a book earned back its advance based on how much the celebs were paid — numbera that are rarely"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-2023-182758284.html",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>’s 2023 Holiday Card Might Hint at Their Main Focus Heading Into 2024",
        "description": "It’s an unofficial tradition at this point that members of the royal family share their annual holiday cards with the public or significant recipients. Since their move to the United States, Prince Harry and Meghan Markle have kept up with the practice."
    },
    {
        "url": "https://www.pinkvilla.com/trending/world/what-can-convince-meghan-markle-to-return-to-british-royal-family-exploring-a-royal-experts-comments-1265756",
        "title": "What can convince <b>Meghan Markle</b> to return to British royal family? Exploring a royal expert&#39;s comments",
        "description": "Insights suggest Meghan Markle&#39;s potential royal return amid family dynamics and legal rulings, sparking speculation on future reconciliation."
    },
    {
        "url": "https://www.wsbtv.com/news/trending/prince-harry-meghan-markle-release-holiday-card-2023/I4LZVQ3YABAWNC5SGBGETJ3YZM/",
        "title": "Prince Harry, <b>Meghan Markle</b> release holiday card for 2023",
        "description": "The Duke and Duchess of Sussex on Friday released their 2023 holiday card. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads, according to People Magazine. The card was sent in an email on behalf of their Archwell organization."
    },
    {
        "url": "https://www.foxnews.com/entertainment/the-crown-prince-william-kate-middleton-romance-madonna-fans",
        "title": "‘The Crown’ highlights Prince William, Kate Middleton&#39;s rocky romance; Madonna fans outraged",
        "description": "The Fox News Entertainment newsletter brings you the latest Hollywood headlines, celebrity interviews and stories from Los Angeles and beyond."
    },
    {
        "url": "https://www.timesfreepress.com/news/2023/dec/16/opinion-in-british-royal-racist-scandal-dont/",
        "title": "Opinion: In British ‘royal racist’ scandal, don’t confuse simple curiosity with racism that knows how to hide",
        "description": "As a result, &quot;concern&quot;— a word that can mean care or worry or interest, can be taken in any one of those ways. In the collective repudiation by which the media frenzy about the &quot;royal racists&quot; may be described, what may be the actual truth of its intended meaning — which only those directly involved can know — we can turn it into anything."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-convinced-160001051.html",
        "title": "Prince Harry And <b>Meghan Markle</b> ‘Convinced’ Brand Deals Are Being ‘Blocked’ By Royal Family",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, reportedly blame their recent business woes on a royal family vendetta. After losing their Spotify deal, and suffering a donation decline to their Archewell foundation,"
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2917021/jeannie-mai-monaco-twinning/",
        "title": "Jeannie Mai &amp; Daughter Monaco’s Lookalike Facial Expressions Show They’re Truly Twins",
        "description": "In the first four photos, we see Mai living her best life while partying with friends, doing photoshoots, and looking as fabulous as ever. Then we reach slide five. Get ready for your hearts to explode because then we see Monaco riding a carousel in her checkered orange overalls,"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2916991/meghan-markle-kate-middleton-monochromatic-look/",
        "title": "People Are Speculating That <b>Meghan Markle</b>’s Latest Look Is a Subtle Snub to a Royal Family Member",
        "description": "Either way, they both look amazing in the monochromatic looks, and we hope to see more from both of them."
    },
    {
        "url": "https://www.btimesonline.com/articles/162701/20231216/kate-middleton-forced-to-reach-out-to-meghan-markle-amid-controversy.htm",
        "title": "Kate Middleton &#39;Forced&#39; to Reach Out to <b>Meghan Markle</b> Amid Controversy",
        "description": "Princess Kate has extended an olive branch to Meghan Markle, indicating a possible thaw in the frosty relations between the Sussexes and the British Royal Family. This development, reportedly prompted by King Charles&#39; desire to mend the widening rift within the family,"
    },
    {
        "url": "https://www.allvipp.com/royals/the-reason-kate-and-meghan-didn-t-get-the-chance-to-get-that-close",
        "title": "The Reason Kate And <b>Meghan</b> Didn&#39;t Get The Chance To Get That Close",
        "description": "Princess Kate and Meghan Markle are clearly at odds with one another today and according to Omid Scobie, they never had a proper relationship of any kind."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-ruined-relationship-kate-middleton-thinking-she-could-teach-royals.html/",
        "title": "<b>Meghan Markle</b> Ruined Her Relationship With Kate Middleton By Thinking She Could Teach The Royals ‘A Thing or Two’",
        "description": "Meghan Markle reportedly ruined her relationship with Kate Middleton by thinking she could tech the royals &#39;a thing or two.&#39;"
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/uk/meghan-markle-and-prince-harrys-2023-christmas-greetings-all-you-need-to-know-about-the-holiday-card/articleshow/106049675.cms",
        "title": "<b>Meghan Markle</b> and Prince Harry’s 2023 Christmas greetings: All you need to know about the holiday card",
        "description": "Prince Harry and Meghan Markle share a stylish Christmas card, applauding supporters in a joy-filled photo, following their impactful year through the Archewell Foundation. The digital card not only extends warm wishes but also shares a highlight reel,"
    },
    {
        "url": "https://www.btimesonline.com/articles/162698/20231216/meghan-markles-decisive-break-from-the-royal-family.htm",
        "title": "<b>Meghan Markle</b>&#39;s Stark Choice for Prince Harry: Family Reconciliation or Risking Two Kids and &#39;More Than $40 Million&#39; Assets",
        "description": "Sources close to the royal couple have indicated that Meghan has made it clear to Harry: it&#39;s her and their children or the royal family. This decisive stance comes amid the backdrop of claims of racism and insensitivity within the royal family,"
    },
    {
        "url": "https://www.gulftoday.ae/opinion/2023/12/16/a-great-day-for-truth-as-harry-wins-case",
        "title": "‘A great day for truth’ as Harry wins case",
        "description": "A London judge has awarded 140,600 pounds ($180,700) to Prince Harry for the phone hacking he was subjected to by the Mirror Group of Newspapers (MGN)."
    },
    {
        "url": "https://www.wionews.com/entertainment/meghan-markle-and-prince-harry-are-all-smiles-in-their-2023-christmas-card-670280",
        "title": "<b>Meghan Markle</b> and Prince Harry are all smiles in their 2023 Christmas card",
        "description": "Meghan Markle and Prince Harry are getting into the holiday spirit in a joyful mood. Christmas is just around the corner and it&#39;s time for the annual Christmas card. Like the last year, this time the couple chose not to feature their children,"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/prince-harry-news-meghan-markle-news-seasons-greetings-from-prince-harry-meghan-see-couples-christmas-message-101702726295929.html",
        "title": "Season&#39;s greetings from Prince Harry-<b>Meghan</b>: See couple&#39;s Christmas message",
        "description": "Meghan Markle and Prince Harry are sending seasons greetings as the Duke and Duchess of Sussex revealed their 2023 holiday card- a virtual greeting sent via email by their Archewell organization. &quot;We wish you a very happy holiday season."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1138847-meghan-markle-prince-harry-send-message-to-royal-family-with-christmas-card",
        "title": "<b>Meghan Markle</b>, Prince Harry send message to royal family with Christmas card",
        "description": "Prince Harry and Meghan Markle, who surprisingly released their 2023 Christmas card after the Duke&#39;s UK court victory, have seemingly sent a message to the royal family with their powerful photo."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/harry-meghan-release-2023-holiday-164030748.html",
        "title": "Harry and <b>Meghan</b> Release 2023 Holiday Card",
        "description": "Harry and <b>Meghan</b> wish you happy holidays! The Duke and Duchess sent out their yearly Christmas card featuring a picture of them clapping at the Invictus Games and the message “On behalf of the office of Prince Harry &amp; <b>Meghan</b>, The Duke and Duchess of ..."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-royal-family-news-meghan-markle-could-return-to-the-royal-family-under-this-condition-101702723407487.html",
        "title": "<b>Meghan Markle</b> &#39;could return&#39; to the royal family under this condition",
        "description": "Meghan Markle could return to the royal family under an unlikely condition, a royal expert said. Tom Quinn, author of Scandals of the ‘Royal Palaces: An Intimate Memoir of Royals Behaving Badly’ claimed that the Duchess of Sussex could return."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-nightmare-year-1852729",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Nightmare Year",
        "description": "The Duke and Duchess of Sussex have faced &quot;one PR nightmare after another&quot; in 2023, an entertainment expert tells Newsweek."
    },
    {
        "url": "https://www.harpersbazaar.com/uk/culture/culture-news/a46152262/prince-harry-meghan-markle-christmas-card-2023/",
        "title": "The Duke and Duchess of Sussex release their 2023 Christmas card",
        "description": "Prince Harry and Meghan have released their 2023 Christmas card, which features a photo of the couple laughing and clapping at the closing ceremony of the 2023 Invictus Games."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1138824-meghan-markles-reunion-with-royal-family-possible-only-on-one-demand",
        "title": "<b>Meghan Markle</b>&#39;s reunion with royal family possible only on one demand",
        "description": "Meghan Markle, who does not share a good rep with the royal family, may still have a chance to mend her relationship, if she is willing to change her lifestyle. Royal expert Tom Quinn told Royally Us that the Duchess of Sussex&#39;s return is possible if she leaves her opinionated nature to Montecito."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-meghan-markle-christmas-card-children-b1127373.html",
        "title": "Harry and <b>Meghan</b> choose Christmas card without picture of children",
        "description": "Harry and Meghan have chosen not to include a picture with their children on their annual Christmas card, according to reports."
    },
    {
        "url": "https://www.wsgw.com/prince-harry-and-meghan-markle-release-virtual-christmas-card/",
        "title": "Prince Harry and <b>Meghan Markle</b> release virtual Christmas card",
        "description": "Prince Harry and Meghan have released their holiday card – this year, a virtual one sent via email from the couple’s Archewell organization. The card includes an image of the Duke and Duchess of Sussex at the Invictus Games and links to the Archwell Foundation’s Impact Report – which highlights the projects they’ve done between 2022 and 2023."
    },
    {
        "url": "https://www.news18.com/movies/prince-harry-and-meghan-markle-are-glowing-in-their-2023-christmas-card-8706132.html",
        "title": "Prince Harry And <b>Meghan Markle</b> Are Glowing In Their 2023 Christmas Card",
        "description": "The Duke and Duchess of Sussex revealed their 2023 Christmas card on Friday,5. The virtual greeting was sent by mail by the Archewell organization."
    },
    {
        "url": "https://www.mamamia.com.au/prince-harry-and-meghan-markle-now/",
        "title": "A flailing charity and a disappearing act: What <b>Meghan</b> and Harry&#39;s life looks like now.",
        "description": "Prince Harry kicked off the year with the release of his memoir, Spare, in January. The much-anticipated book detailed his life as a child, how he dealt with the loss of his mother, Princess Diana, and of course, the breakdown of his relationship with both his father, King Charles, and brother, Prince William."
    },
    {
        "url": "https://news.sky.com/story/seasons-greetings-from-harry-and-meghan-as-couple-release-christmas-message-13031466",
        "title": "Season&#39;s greetings from Harry and <b>Meghan</b> as couple release Christmas message",
        "description": "Meghan and Harry used a photo from the closing ceremony of the 2023 Invictus Games, which took place in September in Dusseldorf, Germany."
    },
    {
        "url": "https://www.hollywoodreporter.com/business/business-news/mandana-dayani-caa-1235758729/",
        "title": "‘I Am a Voter’ Co-Founder Mandana Dayani Signs With CAA (Exclusive)",
        "description": "The human rights activist was most recently president of Meghan Markle and Prince Harry&#39;s Archewell production and philanthropic banner."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/royal-family-fans-want-to-know-why-prince-harry-and-meghan-markles-kids-were-left-out-of-annual-christmas-card/",
        "title": "Royal family fans want to know why Prince Harry and <b>Meghan Markle</b>’s kids were left out of annual Christmas card",
        "description": "Prince Harry and Meghan Markle have dropped their yearly holiday card but a huge omission has royal family fans wanting to know what&#39;s up."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-blame-royal-family-failed-projects.html/",
        "title": "Why Prince Harry and <b>Meghan Markle</b> Blame the Royal Family for Their Failed Projects",
        "description": "Prince Harry and Meghan Markle have had a year they&#39;d like to forget, and the pair reportedly think the royal family has had a lot to do with that."
    },
    {
        "url": "https://www.aol.com/meghan-markle-prince-harry-share-195628717.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Share Holiday Video Card of Their Sweetest Moments This Year",
        "description": "Prince Harry and <b>Meghan Markle</b> are looking back on their year. On Friday, the Duke and Duchess of Sussex released a virtual holiday card, which featured a video that showcased some of their sweetest moments from 2023. Set to Saint Phnx&#39;s 2022 song ..."
    }
]