[
    {
        "url": "https://metro.co.uk/2024/01/17/south-park-episodes-banned-offensive-20132239/?ico=trending-post-strip_item_2",
        "title": "All the South Park episodes banned for being too ‘offensive’",
        "description": "In 200, Tom Cruise and other celebrities mocked by South Park residents threaten a class action suit over their jibes, which they promise will be pulled only on the condition they can get Mohammed to meet them."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12975285/Why-Prince-Harry-jogging-beanie-puffer-coat-Duke-following-wife-Meghans-footsteps-wrapping-mild-LA-winter-weather.html",
        "title": "Why is Prince Harry jogging in a beanie and puffer coat? How the Duke be following in his wife <b>Meghan</b>&#39;s footsteps by wrapping up in mild LA winter weather",
        "description": "It is not known why Harry chose to wrap up warm. It&#39;s possible that the Duke could be following in the footsteps of his wife, <b>Meghan Markle</b>, who earlier this summer had fashionistas scratching their heads at her desire to pop on a warm coat, no matter ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/seven-royals-who-might-stand-28465345",
        "title": "Seven royals who might stand in for King Charles during hospital treatment for enlarged prostate",
        "description": "King Charles could call on fellow members of the Royal Family to step in as he plans to have hospital treatment for an enlarged prostate. The 75-year-old will go into hospital next week for a &#39;corrective procedure&#39;, Buckingham Palace confirmed."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/fashion-trends/511505/michelle-keegan-style-evolution/",
        "title": "Michelle Keegan’s style evolution: from soap opera star to global fashion icon",
        "description": "Michelle Keegan has catapulted back into the spotlight after her latest Netflix series Fool Me Once became a global sensation (trust me, it’s worth the binge-watch), and I am so glad she has."
    },
    {
        "url": "https://www.hellomagazine.com/brides/511500/private-royal-wedding-mornings-queen-camilla-meghan-markle/",
        "title": "Bedridden Queen Camilla, <b>Meghan Markle</b>&#39;s &#39;chill&#39; breakfast &amp; more private royal wedding mornings",
        "description": "While Prince William and the late Queen Elizabeth II caved under pre-wedding pressures, Meghan Markle managed to remain very calm and even enjoyed a relaxed breakfast with her mother. From Queen Camilla being bedridden to Princess Eugenie &#39;s last-minute planning, see exactly what happened behind closed doors on the morning of their weddings..."
    },
    {
        "url": "https://www.independent.co.uk/voices/queen-lilibet-harry-meghan-upset-nickname-b2480125.html",
        "title": "Of course the late Queen was upset about ‘Lilibet’ – if someone pinched my nickname I’d be appalled",
        "description": "Naming a child after somebody isn’t always the compliment we might think it is, writes Anne Atkins – especially when the name is intensely personal"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25392431/king-charles-agressive-tactic-harry-meghan/",
        "title": "‘Aggressive’ tactic King Charles needs to use on Harry and <b>Meghan</b> in a bid to ‘silence them’, royal author claims",
        "description": "Harry also said William had called <b>Meghan Markle</b> “rude” and “difficult” which escalated tensions. The dad-of-two also claimed Will and Kate encouraged him to don the notorious Nazi uniform at a fancy dress party, and &quot;howled with laughter ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/harrys-swipe-kate-middleton-lowest-31901962",
        "title": "Harry&#39;s &#39;swipe&#39; at Kate Middleton was &#39;lowest of the low&#39; for Prince William",
        "description": "Prince Harry&#39;s Netflix series, which he released with wife Meghan Markle, caused a huge rift between the brothers - and it wasn&#39;t just because of the criticisms levelled at William and King Charles"
    },
    {
        "url": "https://www.itv.com/thismorning/articles/the-best-reusable-bottles-travel-mugs-and-lunch-boxes",
        "title": "The best reusable bottles, travel mugs and lunch boxes!",
        "description": "Loved by celebrities like Adele and <b>Meghan Markle</b> - the Stanley Cup is the stainless steel, insulated bottle with a straw - that’s taken the world by storm. These luxury £40 reusable bottles have become covetable accessories, sparking chaos across ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25392234/meghan-markle-prince-harry-in-house-marriage-counsellor/",
        "title": "<b>Meghan Markle</b> &amp; Prince Harry’s in-house ‘marriage counsellor’ who they turn to after arguments, insider claims",
        "description": "MEGHAN Markle and Prince Harry are said to have an “in-house marriage counsellor” who they can trust if they need advice. Meghan’s mum Doria Ragland has reportedly moved into the guesthouse of"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856689/meghan-markle-AI-future-royal-family",
        "title": "<b>Meghan Markle</b>&#39;s missed destiny as international aid worker revealed in new images",
        "description": "The Royal Family have a number of titles and responsibilities, but what would they be doing if they had ordinary jobs? AI has the answer."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856551/meghan-markle-prince-harry-latest-disrespectful-claims",
        "title": "<b>Meghan Markle</b> &#39;doesn&#39;t care&#39; what Prince Harry thinks as expert points out she&#39;s in charge",
        "description": "Meghan Markle&#39;s recent actions and decisions show Prince Harry just &quot;who is in charge&quot;, claims a royal commentator."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-seen-glowering-amid-allegations-he-angered-queen-over-lilibet-naming-1722793",
        "title": "Prince Harry Seen &#39;Glowering&#39; Amid Allegations He Angered Queen Over Lilibet Naming",
        "description": "A new book about the royals claimed that Queen Elizabeth II was left furious after the Sussexes announced they received her support in naming their daughter Lilibet."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-made-appalling-decision-31899144",
        "title": "<b>Meghan Markle</b> made &#39;appalling&#39; decision to &#39;copyright Lilibet&#39; before daughter&#39;s birth",
        "description": "Prince Harry and Meghan Markle are at the centre of a name row after it was claimed the late Queen Elizabeth II was furious when the couple named their daughter Lilibet"
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/stoke-trent-link-famous-princess-9041662",
        "title": "The Stoke-on-Trent link to famous Princess Diana scenes in Netflix&#39;s The Crown",
        "description": "In another scene, she is seen in a pink costume gazing out to sea. Seventy-one-year-old John, whose main home is a mansion near Eccleshall where <b>Meghan Markle</b> previously stayed the night, told Forbes: “I&#39;ve watched every bit of it [The Crown]."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-suffer-31892890",
        "title": "<b>Meghan Markle</b> and Prince Harry suffer &#39;devastating&#39; snub at Emmy Awards",
        "description": "Prince Harry and <b>Meghan Markle</b> are moving onto bigger and better things after their brutal Emmy Award snub. The Duke and Duchess of Sussex made a comeback to Hollywood in 2022 with their bombshell Netflix documentary series, Harry &amp; <b>Meghan</b>. The shocking ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-sitting-gold-mine-31879929?int_source=nba",
        "title": "<b>Meghan Markle</b> is sitting on a &#39;gold mine&#39; which could fix &#39;financial crisis&#39;, claims expert",
        "description": "<b>Meghan Markle</b> and Prince Harry&#39;s Netflix contract is nearing its end with many wondering what the Sussexes will do next for income. With further book deals, endorsements and even property moves touted as a money maker for the couple, it remains to be seen what their next power play will be."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/meghan-markles-wedding-tailor-reveals-31872936?int_source=nba",
        "title": "<b>Meghan Markle</b>&#39;s wedding tailor reveals what happened to make Charlotte cry",
        "description": "<b>Meghan Markle</b> and Kate Middleton&#39;s bridesmaid row is an infamous - and disputed - event in the run up to the 2018 wedding. The specifics of the hiccup, including who exactly made who cry, was a major story in the wake of the nuptials It wasn&#39;t until the ..."
    },
    {
        "url": "https://nypost.com/2024/01/17/opinion/ailing-charles-and-kates-first-thought-was-for-others-wailing-meghan-and-harrys-only-thought-is-for-themselves/",
        "title": "Ailing Charles and Kate’s first thought was for others — wailing <b>Meghan</b> and Harry’s only thought is for themselves",
        "description": "If ever there was a day to reflect on the stark difference between the Royal Family in Britain, and the renegade Sussexes in California, this was it."
    },
    {
        "url": "https://www.skynews.com.au/insights-and-analysis/piers-morgan-king-charles-and-princess-kates-selflessness-over-health-issues-puts-sussexes-to-shame-as-couple-wail-about-their-emmys-snub/news-story/34800ec8f77aa385a3d2976ce19d915b",
        "title": "Piers Morgan: King Charles and Princess Kate&#39;s selflessness over health issues puts Sussexes to shame as couple wail about their Emmys snub",
        "description": "If ever there was a day to reflect on the stark difference between the royal family in Britain and the renegade Sussexes in California, this was it."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12974849/You-dont-words-mouth-Queen-Robert-Hardman-revelation-Harry-Meghan-angered-Majesty-naming-baby-Lilibet-joins-Mails-YouTube-talk-Reaction.html",
        "title": "Robert Hardman on his revelation that Harry and <b>Meghan</b> angered Her Majesty over naming of baby Lilibet as he joins the Mail&#39;s YouTube talk show The Reaction",
        "description": "The row over Harry and Meghan calling their daughter Lilibet shows you &#39;don&#39;t put words in the mouth of the Queen&#39;, Robert Hardman has said."
    },
    {
        "url": "https://www.btimesonline.com/articles/163344/20240118/meghan-markles-memoir-plans-face-doubts-amid-sussex-fatigue.htm",
        "title": "<b>Meghan Markle</b>&#39;s Memoir Plans Face Doubts Amid &#39;Sussex Fatigue&#39;",
        "description": "Amid the flurry of royal tell-alls and biographies, the prospect of Meghan Markle, Duchess of Sussex, penning her own memoir has sparked debate among royal commentators and analysts."
    },
    {
        "url": "https://www.yahoo.com/entertainment/harry-meghan-did-permission-queen-211731386.html",
        "title": "Harry &amp; <b>Meghan</b> DID Get Permission To Use Queen Elizabeth II Name For Daughter",
        "description": "Duke and Duchess of Sussex, Prince Harry and <b>Meghan Markle</b>, DID get permission from the late Queen Elizabeth II to name their daughter her childhood nickname &quot;Lilibet.&quot; As we reported, it was earlier claimed that the couple lied when they revealed that the ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163343/20240118/prince-harrys-isolated-eton-milestone-stirs-emotions-amid-royal-family-dynamics.htm",
        "title": "Prince Harry&#39;s Isolated Eton Milestone Stirs Emotions Amid Royal Family Dynamics",
        "description": "The poignant moment of Prince Harry signing in at Eton College without the presence of his mother, Princess Diana, has captured the hearts of many, underscoring the unique challenges he faced in the Royal Family."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/percy-jackson-and-the-olympians-season-1-episode-7-release-date-plot-details-where-to-watch-more-1272150",
        "title": "Percy Jackson and the Olympians Season 1 Episode 7: Release Date, Plot Details, Where To Watch &amp; More",
        "description": "Disney+ will release Episode 7 of Percy Jackson and the Olympians, titled We Find Out the Truth Sort Of, on January 23."
    },
    {
        "url": "https://clutchpoints.com/meghan-markle-prince-harry-wounded-after-consecutive-emmys-snubs-pr-says",
        "title": "<b>Meghan Markle</b>, Prince Harry &#39;wounded&#39; after consecutive Emmys snubs, PR says",
        "description": "It seems like Prince Harry and Meghan Markle can&#39;t catch a break in the lane they&#39;re transitioning into after another Emmy snub."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1148781-meghan-markle-receives-career-warning-after-late-queens-fury-exposed",
        "title": "<b>Meghan Markle</b> receives career warning after late Queen&#39;s fury exposed",
        "description": "Meghan Markle has been advised against writing her own memoir in the wake of latest claims about the late Queen’s fury at the couple. In his upcoming book about King Charles III, royal"
    },
    {
        "url": "https://cfjctoday.com/2024/01/17/celebrity-buzz-with-ryan-gosling-kate-beckinsale-and-meghan-markle-and-prince-harry/",
        "title": "Celebrity Buzz with Ryan Gosling, Kate Beckinsale, and <b>Meghan Markle</b> and Prince Harry",
        "description": "Ryan Gosling is clearly in love with his wife, Eva Mendes. While accepting the Kirk Douglas Award for Excellence in Film award at the Santa Barbara International Film Festival recently, the Barbie actor said,"
    },
    {
        "url": "https://nypost.com/2024/01/17/entertainment/meghan-markle-prince-harry-wounded-after-emmys-2024-snub-expert/",
        "title": "<b>Meghan Markle</b> and Prince Harry ‘feel wounded’ after another Emmys snub: expert",
        "description": "The Sussexes’ names were once again left out of the nominations list — despite their “Harry &amp; Meghan” docuseries setting a record for the biggest debut for a Netflix"
    },
    {
        "url": "https://goss.ie/royals/new-book-alleges-the-queen-was-angry-over-harry-and-meghans-claim-she-gave-permission-to-name-their-daughter-after-her-365812",
        "title": "New book alleges the Queen was ‘angry’ over Harry and <b>Meghan</b>’s claim she gave permission to name their daughter after her",
        "description": "A new book has alleged Queen Elizabeth II was angered over Prince Harry and Meghan Markle’s claim she gave them permission to name their daughter after her. The Duke and Duchess of Sussex announced the birth of their daughter Lilibet Diana Mountbatten-Windsor, nicknamed Lili, on June 4, 2021."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-harry-feel-wounded-after-31899044",
        "title": "<b>Meghan</b> and Harry &#39;feel wounded&#39; after snub as they plot next move",
        "description": "A PR expert believes Prince Harry and Meghan Markle are feeling ‘wounded’ after their Netflix documentary failed to win an Emmy despite being watched by millions"
    }
]