[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/real-reason-prince-harry-meghan-31982469",
        "title": "Real reason Prince Harry and <b>Meghan Markle</b> flew to Jamaica for Bob Marley film premiere",
        "description": "Prince Harry and Meghan Markle came in for criticism for their decision to head to Jamaica for the premiere of the Bob Marley: One Love film, but are said to have had a good reason"
    },
    {
        "url": "https://www.sapeople.com/celeb-news/meghan-markle-resurfaces-with-iconic-engagement-ring/",
        "title": "<b>Meghan Markle</b> resurfaces with iconic engagement ring",
        "description": "<b>Meghan Markle</b>, the Duchess of Sussex, reappeared on the red carpet, sporting her iconic engagement ring for the first time in over six months. The sighting occurred at the premiere of the much-anticipated Bob Marley film, ‘One Love,’ held in Kingston ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151922-meghan-markle-bags-lucrative-deal-amid-royal-health-issues",
        "title": "<b>Meghan Markle</b> bags &#39;lucrative deal&#39; amid royal health issues",
        "description": "Meghan Markle is reportedly being offered to make her head-turning comeback in the spin-off of her popular legal drama Suits.As per Express.co.uk, a senior production source revealed that"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860436/prince-harry-meghan-markle-spotify-deal",
        "title": "Prince Harry and <b>Meghan Markle</b> still plugging Spotify deal despite being axed",
        "description": "Prince Harry and <b>Meghan Markle</b>&#39;s Archewell website still lists their partnership with Spotify, even though the couple&#39;s deal with the streaming giant fell through last summer. Upon leaving the Royal Family in 2020 and moving to California the Duke and ..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-asked-queen-permission-150000393.html",
        "title": "Prince Harry Asked the Queen’s Permission to Marry <b>Meghan Markle</b> and Her Response Was...Rough",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meghan-markle-disc-earrings-stole-140000513.html",
        "title": "<b>Meghan Markle</b>’s Disc Earrings Stole the Show at the ‘Bob Marley: One Love’ Premiere",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.allvipp.com/royals/duchess-meghan-this-is-the-popular-soap-opera-she-was-in",
        "title": "Duchess <b>Meghan</b>: THIS Is The Popular Soap Opera She Was In",
        "description": "Meghan Markle is a household name nowadays. But there was a time when the Duchess of Sussex was an aspiring actor, and THIS legendary soap opera was her very first role."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151865-princess-diana-would-be-apalled-at-prince-harry-for-abandoning-royal-family",
        "title": "Princess Diana would be &#39;apalled&#39; at Prince Harry for abandoning royal family",
        "description": "Former butler of Princess Diana believes that the late mother of Prince William and Prince Harry wouldn&#39;t be pleased with her younger son. Speaking to the Daily Express on behalf of Slingo,"
    },
    {
        "url": "https://metro.co.uk/2024/01/27/celebrity-big-brother-signs-kate-middletons-uncle-2024-series-20181836/?ico=trending-post-strip_item_3",
        "title": "Kate, Princess of Wales’s uncle Gary Goldsmith ‘signed up for Celebrity Big Brother’",
        "description": "Gary has reportedly ‘made it clear he will talk about everything and anything’ and is ‘pretty outspoken’ when it comes to Prince Harry and <b>Meghan Markle</b>. The source said: ‘Gary also holds a deep affection for Kate and Wills and will be able to ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860409/meghan-markle-dream-role-suits-tv-deal",
        "title": "<b>Meghan Markle</b> offered dream role in &#39;one of the biggest TV deals&#39; in history",
        "description": "EXCLUSIVE: As speculation swirls surrounding the Sussexes&#39; next move, Daily Express US can reveal that a Suits reboot has a role &quot;tailor-made&quot; for Meghan Markle."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-archies-ex-nanny-stunned-31973165",
        "title": "Prince Archie&#39;s ex-nanny stunned by how Prince Harry and <b>Meghan Markle</b> first greeted her",
        "description": "Prince Harry and Meghan Markle have very busy schedules and so hired Lorren Khumalo to help look after their son Prince Archie when he was just a few months old"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghan-still-publicising-expired-31980738",
        "title": "Harry and <b>Meghan</b> still publicising their expired Spotify partnership after axe",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, are still boasting about their expired Spotify partnership after they were labelled as &quot;f***ing grifters&quot;"
    },
    {
        "url": "https://metro.co.uk/2024/01/27/celebrity-big-brother-signs-kate-middletons-uncle-2024-series-20181836/?ico=trending-post-strip_item_1",
        "title": "Kate Middleton’s outspoken uncle Gary Goldsmith ‘signs up’ for Celebrity Big Brother",
        "description": "Kate Middleton ’s uncle is said to be entering the Celebrity Big Brother house when the show returns to ITV in March. Gary Goldsmith reportedly signed a big money deal with CBB bosses on Saturday (January 27) in a controversial casting. It’s believed the outspoken businessman was locked in talks for a while."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dragons-den-episode-pulled-ear-seeds-controversy-b2485842.html",
        "title": "BBC forced to remove Dragons’ Den episode after complaint from charity",
        "description": "Her pitch to the Dragons produced a historic moment for the show as all six put in an offer for her Acu Seeds product, which is described as a “DIY needle-free ear acupuncture for anxiety, migraines, hormonal issues, insomnia, weight loss and more”."
    },
    {
        "url": "https://britpopnews.com/meghan-markle-plays-tennis-in-gorgeous-ai-photos/",
        "title": "<b>Meghan Markle</b> Plays Tennis In Gorgeous AI Photos",
        "description": "Meghan Markle, the Duchess of Sussex, has been a notable public figure since her marriage to Prince Harry in 2018."
    },
    {
        "url": "https://uk.news.yahoo.com/ellen-degeneres-hits-gym-she-005037409.html",
        "title": "Ellen DeGeneres Hits the Gym as She Celebrates Her Birthday: &#39;This Is What 66 Looks Like&#39;",
        "description": "&quot;Happy Birthday to the strongest, sweetest, most brilliant person I know,&quot; wrote Portia De Rossi in her Instagram tribute to her wife"
    },
    {
        "url": "https://www.cinemablend.com/television/meghan-markle-suits-wendell-pierce-real-about-trolling-she-gets",
        "title": "<b>Meghan Markle</b>’s Suits TV Dad Gets Real About The Trolling She Gets Online: ‘Friends Are There For You’",
        "description": "<b>Meghan Markle</b> may be mostly known as the Duchess of Sussex these days but, all the while, many TV viewers still remember her for her role as Rachel Zane on Suits. (That’s arguably in part because the show has become a hit with Netflix subscribers as of ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/harry-meghans-awkward-reaction-film-31981123",
        "title": "Harry and <b>Meghan</b>&#39;s awkward reaction at film premiere as they&#39;re given &#39;bad seats&#39;",
        "description": "Prince Harry and <b>Meghan Markle</b> appeared to have suffered an awkward blunder as they attended a glamourous film premiere earlier this week, with royal fans on social media commenting &#39;karma is real&#39;. The Duke and Duchess of Sussex were in Jamaica this week ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-kate-middleton-health-royal-family-b2485849.html?page=5",
        "title": "Royal news - live: King Charles ‘doing well’ after prostate surgery as Kate continues hospital recovery",
        "description": "But she opens up to Guy Walters about happiness, helping people and the things that have helped her through the toughest of times Prince Harry has proven once again he’s <b>Meghan Markle</b>’s biggest fan. The Duke of Sussex, 39, attended the Living Legends ..."
    },
    {
        "url": "https://www.standard.co.uk/culture/tvfilm/gary-goldsmith-celebrity-big-brother-cbb-itv-b1135209.html",
        "title": "Princess of Wales&#39; uncle Gary Goldsmith &#39;signs up for Celebrity Big Brother 2024&#39;",
        "description": "The Duchess of Cambridge&#39;s uncle, Gary Goldsmith, arrives at Westminster Magistrates&#39; Court, London, where he is accused of assault by beating of Julie-Ann Goldsmit It is thought Mr Goldsmith has strong opinions about Prince Harry and <b>Meghan Markle</b>’s US ..."
    },
    {
        "url": "https://uk.news.yahoo.com/the-five-best-sales-this-weekend-save-up-to-80-with-these-deals-from-kate-spade-uggs-le-creuset-and-more-231240691.html",
        "title": "The five best sales this weekend: Save up to 80% with these deals from Kate Spade, Uggs, Le Creuset and more",
        "description": "During Sur La Table&#39;s End of Season Sale, you can score serious savings on Le Creuset, All-Clad and more. If you&#39;ve resolved to nix the takeout and do more cooking at home in 2024, go ahead and turn your kitchen into one you&#39;ll actually want to prepare meals in, starting with these cookware upgrades."
    },
    {
        "url": "https://uk.movies.yahoo.com/abigail-spencer-credits-meghan-markles-215134556.html",
        "title": "Abigail Spencer Credits <b>Meghan Markle</b>&#39;s &#39;Loveliness&#39; as One Force Behind “Suits”&#39; Resurgence 4 Years Post-Finale",
        "description": "In November 2023, the Duchess of Sussex called the legal drama &quot;everlasting&quot; while reacting to its &quot;wild&quot; comeback on Netflix"
    },
    {
        "url": "https://www.dailymail.co.uk/news/royals/article-13010581/Liz-Jones-Meghan-online-abuse.html",
        "title": "LIZ JONES: I&#39;m no <b>Meghan</b> fan, but this unrelenting online abuse has to stop",
        "description": "Like the vast majority of people in this country, I welcomed Meghan Markle into the Royal family. A huge fan of Harry, I wrote long think pieces about the &#39;Markle Sparkle&#39;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-telling-gesture-red-31973810",
        "title": "<b>Meghan Markle</b>&#39;s telling gesture on red carpet that exposes true state of marriage to Prince Harry",
        "description": "<b>Meghan Markle</b> and Prince Harry were showcasing their &quot;unity&quot; as a strong couple during their surprise appearance at the premiere of the new Bob Marley film in Jamaica this week, according to a body language expert. The Duke and Duchess of Sussex made an unexpected visit to Kingston and were snapped with Jamaican prime minister Andrew Holness at the screening of the film which celebrates the ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151876-prince-harry-meghan-markles-alleged-new-business-laid-bare",
        "title": "Prince Harry, <b>Meghan Markle</b>&#39;s alleged new business laid bare",
        "description": "Prince Harry and Meghan Markle - who made a surprise red carpet appearance in Jamaica this week - have sparked massive reactions with their stunt. The Duke and Duchess of Sussex&#39;s"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13013171/Harry-Meghans-Jamaica-trip-not-welcome-London-jaunt-criticised-misguided-political-connotations.html",
        "title": "Harry and <b>Meghan</b>&#39;s Jamaica trip was &#39;not especially welcome back in London&#39; as jaunt is criticised as being &#39;misguided&#39; due its political connotations",
        "description": "The Duke and Duchess of Sussex made a surprise visit to the Caribbean country this week to attend the premiere of Bob Marley: One Love and support the Marley family."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25540604/palace-surprised-harry-meghan-jamaica-kate-charles-surgery/",
        "title": "Palace ‘surprised’ by Harry and <b>Meghan</b>’s ‘misguided’ photo shoot with Jamaican PM as Kate &amp; Charles recover from surgery",
        "description": "HARRY and <b>Meghan</b>&#39;s &quot;misguided&quot; photo shoot with the Jamaican PM was not &quot;ideal&quot;, slammed a Palace source. The Duke and Duchess were branded &quot;embarrassing&quot; after posing on the red carpet with Jamaican leaders at the star-studded Bob Marley premier on Tuesday."
    },
    {
        "url": "https://www.samaa.tv/208738787-kate-middleton-s-surgery-prompts-healing-gesture-from-prince-harry",
        "title": "Kate Middleton&#39;s surgery prompts healing gesture from Prince Harry",
        "description": "William would quite happily never speak to either of them again, but Kate’s a peacemaker at heart. She would definitely be open to using this situation to build bridges. Never waste a good crisis, right?"
    },
    {
        "url": "https://www.couriermail.com.au/entertainment/tv-glamour-girl-nowhere-to-be-seen-in-modern-television/news-story/422b9704ee0431438ba314e3ebeca322",
        "title": "TV glamour girl nowhere to be seen in modern television",
        "description": "Hosts Glenn Ridge &amp; Jo Bailey from TV show &quot;Sale of the Century&quot;. Internationally <b>Meghan Markle</b> was Deal’s most famous dealette. Ten is also bringing back Wheel of Fortune with UK identity Graham Norton hosting. If, as expected, the Australian version ..."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/meghan-markle-resurfaces-with-iconic-engagement-ring/",
        "title": "<b>Meghan Markle</b> resurfaces with iconic engagement ring",
        "description": "Meghan Markle, the Duchess of Sussex, made a stunning comeback, revealing her iconic engagement ring after a mysterious six-month hiatus."
    },
    {
        "url": "https://www.marca.com/en/nfl/kansas-city-chiefs/2024/01/27/65b49f12e2704e8b088b4595.html",
        "title": "Brittany Mahomes opens up about the time they had to rush to the ER after Bronze&#39;s bathtub discovery",
        "description": "Brittany Mahomes and Patrick Mahomes had to pause everything and head to the emergency room after their 8-month-old son Bronze was covered in hives that soon turned into welts. Bro"
    },
    {
        "url": "https://nypost.com/2024/01/26/entertainment/abigail-spencer-says-meghan-markles-loveliness-contributed-to-suits-resurgence/",
        "title": "Abigail Spencer says <b>Meghan Markle</b>’s ‘loveliness’ contributed to ‘Suits’ resurgence",
        "description": "And also <b>Meghan</b>’s loveliness, you know, that everyone is aware of her and her being on the show,” she gushed about the estranged Duchess of Sussex, also 42. “Suits” ran for nine seasons — from 2011 to 2019 — on the USA Network, but <b>Markle</b> ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25535398/harry-and-meghan-royals-for-hire/",
        "title": "Harry &amp; <b>Meghan</b> will become ‘royals for hire’ after disastrous Netflix &amp; Spotify deals &amp; being saddled with HUGE expenses",
        "description": "IT was billed as a rare “date night” for the supposedly privacy-loving couple. But as Harry and Meghan glad-handed Hollywood executives on the red carpet this week, some royal aides are concerned"
    },
    {
        "url": "https://www.etonline.com/what-prince-harry-meghan-markle-reaching-out-to-kate-middleton-and-king-charles-means-for-their",
        "title": "What Prince Harry &amp; <b>Meghan Markle</b> Reaching Out to Kate Middleton and King Charles Means for Their Relationship",
        "description": "Prince Harry Jokes About Dad King Charles at Awards Ceremony Amid Royal Rift 50 Cent Sued by Radio Host for Allegedly"
    },
    {
        "url": "https://pagesix.com/2024/01/26/entertainment/abigail-spencer-credits-pal-meghan-markles-loveliness-for-inspiring-a-suits-resurgence/",
        "title": "Abigail Spencer credits pal <b>Meghan Markle</b>’s ‘loveliness’ for inspiring a ‘Suits’ resurgence",
        "description": "The Duchess of Sussex starred on the USA Network show as a paralegal up until Season 7. She was written out amid her engagement to Prince Harry."
    },
    {
        "url": "https://www.marca.com/en/nfl/kansas-city-chiefs/2024/01/27/65b461eae2704ee3248b4572.html",
        "title": "Brittany Mahomes confesses how binge-watching <b>Meghan Markle</b> made her rethink what she wears",
        "description": "Kansas City Chiefs. Patrick Mahomes reflects on what has made this season &#39;challenging&#39; for the Kansas City Chiefs Kansas City Chiefs. Taylor Swift is essentially a free marketing agency, generating hundreds of millions for the NFL Brittany Mahomes has ..."
    },
    {
        "url": "https://www.usatoday.com/videos/entertainment/2024/01/26/showbiz-minute-nolan-gosling-prince-harry/72335282007/",
        "title": "ShowBiz Minute: Nolan, Gosling, Prince Harry",
        "description": "Christopher Nolan on &quot;Oppenheimer&quot; Oscar success: &quot;Sometimes you catch a wave&quot;; Ryan Gosling &quot;disappointed&quot; after Margot Robbie and Greta Gerwig are snubbed in Oscar nominations; Prince Harry and Meghan Markle make surprise appearance at Jamaican premiere of Bob Marley biopic."
    },
    {
        "url": "https://www.brisbanetimes.com.au/lifestyle/fashion/queen-gee-the-australian-designer-with-the-right-royal-touch-20240125-p5f06e.html",
        "title": "Queen Gee. The Australian designer with the right royal touch",
        "description": "<b>Meghan Markle</b> in a Karen Gee dress at Admiralty House, 2018; Prime Minister Anthony Albanese’s partner Jodie Haydon wearing Karen Gee with French First Lady Brigitte Macron.Credit: AP, Alex Ellinghausen While working behind the scenes, dressing leading ..."
    },
    {
        "url": "https://www.cairnspost.com.au/entertainment/celebrity-life/royals/prince-harrys-insult-to-injury-after-kates-gut-punch/news-story/f110793961f1a9d00e2c256a5ac3ecd1",
        "title": "Prince Harry and <b>Meghan</b> pose with anti-monarchists to hang with Hollywood heavyweight",
        "description": "Paramount boss Brian Robbins and wife Tracy invited <b>Meghan Markle</b> and Prince Harry to Jamaica. Picture: Getty Images It comes amid reports Harry and <b>Meghan</b> have been stepping up their Hollywood charm offensive to secure a new content production deal before ..."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-fashion-meet-world-leaders-1864296",
        "title": "What <b>Meghan Markle</b> Wore to Meet 5 World Leaders",
        "description": "Since marrying Prince Harry in 2018, <b>Meghan Markle</b> has met a number of world leaders during official and private visits overseas with her husband, from presidents to prime ministers, often winning praise for her stylish outfit choices on these high-profile ..."
    },
    {
        "url": "https://ca.style.yahoo.com/meghan-mccain-criticises-woke-jon-193259362.html",
        "title": "<b>Meghan</b> McCain criticises ‘woke’ Jon Stewart’s return to The Daily Show",
        "description": "<b>Meghan</b> McCain has claimed she is “horrified” with what Jon Stewart has “morphed into” ahead of his return to The Daily Show. The controversial right-wing political commentator took to her podcast, <b>Meghan</b> McCain Has Entered the Chat, to express her ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163570/20240127/prince-harry-criticized-for-allegedly-favoring-meghan-over-family.htm",
        "title": "Prince Harry Criticized for Allegedly Favoring <b>Meghan Markle</b> Over Family",
        "description": "Prince Harry is facing criticism for allegedly prioritizing the needs and wishes of his wife, <b>Meghan Markle</b>, above those of his own family. According to royal expert Angela Levin, the Duke of Sussex appears to be ensnared in a dilemma that places him at ..."
    }
]