[
    {
        "url": "https://www.skynews.com.au/opinion/people-are-sick-of-prince-harry-and-meghan-markles-narcissism-and-selfpity/video/5026bc2dec3c2f5748a613cd55c18b5f",
        "title": "People are sick of Prince Harry and <b>Meghan Markle</b>’s ‘narcissism’ and ‘self-pity’",
        "description": "Spiked Online Chief Political Reporter Brendan O’Neill says people are sick of Prince Harry and <b>Meghan Markle</b>’s “narcissism” and “self-pity”. “Lots of people are saying 2023 seemed to be their annus horribilis to use a phrase that the Queen ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851732/prince-harry-and-meghan-markle-advised-to-come-out-of-a-new-box",
        "title": "Prince Harry and <b>Meghan Markle</b> advised to ‘come out of a new box’",
        "description": "Prince Harry and Meghan Markle are getting a lot of advice, and this time it&#39;s coming from royal commentator Michael Cole who says they need to “come out of a new box” because last year was filled with “criticism, relentlessly, repetitively, of their own family.”"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-smiles-photo-rob-210100860.html",
        "title": "Prince Harry Smiles in New Photo with Rob McElhenney and Glenn Howerton at Soccer Game",
        "description": "Rob McElhenney is giving a glimpse of his hangout with Prince Harry."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-flashes-huge-grin-31801024",
        "title": "Prince Harry flashes huge grin as he poses with Hollywood star at football game without <b>Meghan</b>",
        "description": "Prince Harry was all smiles as he joined American actors Rob McElhenney and Glenn Howerton for a sport outing in Los Angeles, and Meghan Markle was noticeably absent"
    },
    {
        "url": "https://www.hellomagazine.com/film/510504/meghan-markle-suits-co-stars-patrick-j-adams-gabriel-macht-golden-globes-reunion/",
        "title": "<b>Meghan Markle</b>&#39;s former Suits co-stars to reunite at Golden Globes after spin-off approved",
        "description": "The show famously featured Meghan Markle ahead of her meeting Prince Harry and becoming the Duchess of Sussex, with the royal retiring from the show in 2018. However, it still holds a firm place in her heart."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851633/prince-harry-meghan-markle-2023-success",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s 2023 &#39;success&#39; revealed as they&#39;re urged to do one thing",
        "description": "A royal commentator has urged Prince Harry and Meghan Markle to adopt a different approach in 2024 as the public are &quot;sick and tired&quot; of their &quot;whining&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12922667/Rob-McElhenney-shares-selfie-Prince-Harry-star-Duke-attended-football-match-David-Beckhams-Inter-Miami-CF-Los-Angeles-without-Meghan-Markle.html",
        "title": "Rob McElhenney shares selfie with Prince Harry and his co-star after the Duke attended football match between David Beckham&#39;s Inter Miami CF and Los Angeles without <b>Meghan Markle</b>",
        "description": "The beaming Wrexham co-owner poses for the selfie in a bar alongside his It&#39;s Always Sunny in Philadelphia co-star Glenn Howerton, 47, and a grinning Duke of Sussex."
    },
    {
        "url": "https://uk.news.yahoo.com/even-though-archewell-foundation-named-145115419.html",
        "title": "Even though the Archewell Foundation was named after him, here&#39;s the real reason Prince Harry and Megan won&#39;t let Archie near it",
        "description": "Meghan Markle and Prince Harry are set to continue keeping Archie and Lilibet away from their Archewell Foundation, a royal expert has claimed - despite it being named after their son."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25237293/omid-scobie-spotted-la-meghan-markle-royal-racist-names/",
        "title": "Omid Scobie spotted in LA after author claims there’s ‘no doubt’ <b>Meghan Markle</b> ‘fed’ him ‘royal racist’ names",
        "description": "OMID Scobie has been spotted in LA following the release of his bombshell Endgame book which caused a royal racism storm. The royal author, who has been dubbed by some as the Sussexes’"
    },
    {
        "url": "https://pressgazette.co.uk/media_law/group-discrimination-press-editors-code-ipso/",
        "title": "Editors reject extra protection in Code for Jews, Muslims and those with ADHD",
        "description": "Top editors have rejected new calls for the Editors&#39; Code of Practice to ban group discrimination in the press."
    },
    {
        "url": "https://uk.style.yahoo.com/turns-prince-harry-hung-always-131727279.html",
        "title": "It Turns Out Prince Harry Hung Out With &#39;It&#39;s Always Sunny in Philadelphia&#39; Stars in 2023",
        "description": "Taking to Instagram, actor Rob McElhenney shared a previously unseen selfie of him with It&#39;s Always Sunny in Philadelphia costar Glenn Howerton and Prince Harry hanging out in a sports bar and looking like they were having the time of their lives. &quot;That picture with Prince Harry is iconic,&quot; commented one person."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25225355/meghan-markle-fed-omid-scobie-royal-racist-names-biographer/",
        "title": "‘No doubt’ <b>Meghan Markle</b> ‘fed’ Omid Scobie ‘royal racist’ names, claims biographer – but something doesn’t quite add up",
        "description": "SCANDAL hit the royals last year as author Omid Scobie “accidentally named” members of the family in his Endgame book implying they were racist. However, royal author Tom Bower has now claimed"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-not-31795811.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;not welcome&#39; with royals as &#39;redemption plan&#39; in ruins",
        "description": "Prince Harry and Meghan Markle stepped down from the Royal Family in 2020 and have had a tense relationship with The Firm ever since, with their &#39;redemption&#39; said to be ruined"
    },
    {
        "url": "https://www.hellomagazine.com/brides/510468/prince-harry-meghan-markle-no-longer-openly-passionate-after-relationship-evolved/",
        "title": "Prince Harry and <b>Meghan Markle</b> no longer &#39;openly passionate&#39; after relationship &#39;evolved&#39;",
        "description": "While the likes of King Charles and Queen Camilla and Prince William and Princess Kate have very rarely held hands or shared a kiss in public, Prince Harry and Meghan Markle regularly broke the status quo and couldn&#39;t hide how in love they were feeling."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-frustrated-harry-becomes-31796814",
        "title": "<b>Meghan Markle</b> is &#39;frustrated&#39; with Harry as he becomes more &#39;willing to speak his mind&#39;",
        "description": "The Duchess of Sussex often appears &quot;unhappy&quot; with her husband in public through her body language, according to expert Darren Stanton."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harrys-2024-31795473",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s &#39;2024 redemption plan&#39; with royals destroyed after Christmas snub",
        "description": "A royal author claims any of hopes of reconciliation between the Duke and Duchess of Sussex and the rest of the royals are slim as they failed to &#39;show unity&#39; at Christmas."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markles-memoir-drama-exposed-31794997.amp",
        "title": "<b>Meghan Markle</b>&#39;s memoir drama in full from &#39;humiliating&#39; demand to &#39;repercussions&#39; of book",
        "description": "Speculation is rife that Meghan Markle is set to release an explosive tell-all memoir, but there are worries it could further damage her tense relationship with the Royal Family"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markles-2024-31794960",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s &#39;2024 redemption plan&#39; in ruins after Christmas snub",
        "description": "Prince Harry and Meghan Markle&#39;s hope for &#39;redemption&#39; in 2024 is thought to have been &#39;ruined&#39; following their decision to not join the Royal Family for Christmas"
    },
    {
        "url": "https://www.ibtimes.co.uk/comedian-mocks-prince-harry-meghan-markle-compares-sussexes-prince-andrew-1722512",
        "title": "Comedian Mocks Prince Harry, <b>Meghan Markle</b>, Compares Sussexes To Prince Andrew",
        "description": "Prince Harry and Meghan Markle became the brunt of the joke in a stand-up sketch by Simon Brodkin, who mocked how the couple celebrated their Halloween together in 2016."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-demands-answers-king-charles-follow-different-rules-comes-using-title.html/",
        "title": "<b>Meghan Markle</b> Demands Answers From King Charles Over Why She Has to Follow Different Rules When it Comes to Using Her Title",
        "description": "Meghan Markle is reportedly unhappy about the rules regarding the use of her title and wants answers from King Charles."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-riled-over-royal-224511198.html",
        "title": "<b>Meghan Markle</b> Is ‘Riled Up’ Over The Royal Family Having ‘Different’ Rules For Her",
        "description": "The Duchess of Sussex Meghan Markle has reportedly had enough of being treated to a different set of rules by the monarchy. Reports have swirled that the former “Suits” actress is “furious” about the situation and doesn’t “understand” why things are like that."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-wants-to-be-the-queen-says-a-royal-author/",
        "title": "<b>Meghan Markle</b> ‘wants to be the Queen,’ says a Royal author",
        "description": "Prince Harry&#39;s famous wife, Meghan Markle is not happy with her Duchess title as a royal author says she wants to &#39;be the queen.&#39;"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144459-meghan-markle-prince-harrys-tough-time-begins",
        "title": "<b>Meghan Markle</b>, Prince Harry&#39;s tough time begins?",
        "description": "Prince Harry and Meghan Markle have received the first major snub of 2024 from the royal family.The royal family&#39;s official social media accounts have shared sweet pictures of King Charles,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163037/20240104/prince-harry-speaks-out-meghan-markle-shows-strain-the-sussexes-struggle-for-individuality.htm",
        "title": "Prince Harry Speaks Out, <b>Meghan Markle</b> Shows Strain: The Sussexes&#39; Struggle for Individuality",
        "description": "Prince Harry and Meghan Markle have entered a phase where the dynamics of their relationship and individual paths are under intense scrutiny. 2023 saw them branded as the &quot;biggest losers,&quot; but they&#39;re eyeing 2024 as a year of redemption and rebranding."
    },
    {
        "url": "https://ca.news.yahoo.com/suits-fan-favourites-set-reunite-192200697.html",
        "title": "Suits fan-favourites set to reunite for TV event",
        "description": "Two fan-favourite actors from Suits are reuniting for an upcoming TV event later this week. Harvey Spector and Michael Ross actors Gabriel Macht and Patrick Adams will serve as presenters for the 81st Annual Golden Globe Awards this Sunday (January 7)."
    },
    {
        "url": "https://www.samaa.tv/208737349-meghan-markle-set-to-embark-on-a-transformative-journey-in-2024",
        "title": "<b>Meghan Markle</b> set to embark on a transformative journey in 2024",
        "description": "In an exclusive conversation with Hello! Magazine, Frank shared her insights into Meghan&#39;s astrological profile, emphasizing her perpetual drive to &#39;be someone&#39; and the continuous pursuit of fame, fortune,"
    },
    {
        "url": "https://www.yahoo.com/entertainment/royal-fans-believe-meghan-markle-183500419.html",
        "title": "Royal Fans Believe <b>Meghan Markle</b> May Have Already Been Dealt a Major Career Blow in 2024",
        "description": "We’re only three days into 2024 and the royal news world is already aflame. Amid musings of Meghan Markle and Prince Harry’s reported next era of projects, and Prince William and Kate Middleton’s global takeover,"
    },
    {
        "url": "https://wealthofgeeks.com/historic-moments-covered-on-tv/",
        "title": "From Volcanic Eruptions to Royal Weddings: 50 Historic Moments Covered on TV",
        "description": "There are events that have transpired throughout history, some of which we weren’t able to witness. Over time, with the advent of the"
    },
    {
        "url": "https://www.forbes.com/sites/monicamercuri/2024/01/03/suits-stars-patrick-j-adams-and-gabriel-macht-to-reunite/",
        "title": "‘Suits’ Stars Patrick J. Adams And Gabriel Macht To Reunite",
        "description": "Following Suits’ massive success on Netflix, two of the show’s stars, Patrick J. Adams and Gabriel Macht, are finally reuniting after the show ended in 2019."
    },
    {
        "url": "https://entertainment.inquirer.net/534790/meghan-markle-reportedly-eyeing-a-comeback-to-acting",
        "title": "<b>Meghan Markle</b> reportedly eyeing a comeback to acting",
        "description": "Before <b>Meghan Markle</b> received global attention for being part of the royal family, she rose to fame after starring in the American legal drama “Suits,” and in 2024, the Duchess of Sussex will reportedly return to acting. The Mirror reported that The ..."
    },
    {
        "url": "https://nypost.com/2024/01/03/entertainment/meghan-markle-furious-at-the-royal-family-over-different-rules-for-her-expert/",
        "title": "<b>Meghan Markle</b> ‘furious’ at the royal family over ‘different rules for her’: expert",
        "description": "Royal expert Neil Sean has drawn comparisons between the Duchess of Sussex and Sarah Ferguson, the Duchess of York’s media presence."
    },
    {
        "url": "https://www.btimesonline.com/articles/163030/20240103/meghan-markles-year-of-ambition-astrologer-predicts-major-moves.htm",
        "title": "<b>Meghan Markle</b>&#39;s Year of Ambition: Astrologer Predicts Major Moves",
        "description": "<b>Meghan Markle</b> is set to make strategic moves that could dramatically elevate her public profile and personal endeavors. According to astrologer Debbie Frank, a friend of the late Princess Diana, <b>Meghan</b>&#39;s relentless quest for greater recognition and ..."
    },
    {
        "url": "https://variety.com/2024/tv/awards/suits-patrick-j-adams-gabriel-macht-present-golden-globes-1235859957/",
        "title": "‘Suits’ Stars Patrick J. Adams and Gabriel Macht Set to Present at 81st Annual Golden Globes (EXCLUSIVE)",
        "description": "Amid the &#39;Suits&#39; resurgence, stars Patrick J. Adams and Gabriel Macht will present at the 81st annual Golden Globes."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-tried-to-arrange-a-meeting-with-king-charles-wants-answers-101704282291197.html",
        "title": "<b>Meghan Markle</b> tried to arrange a meeting with King Charles: ‘Wants answers…’",
        "description": "Meghan Markle &quot;wants answers&quot; from King Charles about use of her royal title, a royal expert claimed. Commentator Neil Sean claimed that both Meghan Markle and Prince Harry &quot;don&#39;t understand why&quot; they have been subjected to different rules than other members of the royal family."
    },
    {
        "url": "https://www.samaa.tv/208737301-psychic-sally-morgan-predicts-meghan-and-harry-s-future",
        "title": "Psychic Sally Morgan predicts <b>Meghan</b> and Harry&#39;s future",
        "description": "Renowned psychic Sally Morgan has shared insights into Meghan Markle and Prince Harry&#39;s future as a married couple, predicting that they will continue to stand strong together."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144390-meghan-markle-fumes-of-special-treatment-of-this-royal-family-member",
        "title": "<b>Meghan Markle</b> fumes over &#39;special treatment&#39; of THIS royal family member",
        "description": "Meghan Markle has reportedly been fuming at the royal family after she was made to follow a “different set of rules” than the rest of the members of the royal family.After stepping"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/forest-whitakers-ex-wife-keisha-whitakers-cause-of-death-revealed-exploring-the-reason-behind-her-death-1269020",
        "title": "Forest Whitaker&#39;s ex-wife Keisha Whitaker&#39;s cause of death revealed; Exploring the reason behind her death",
        "description": "Forest Whitaker&#39;s ex-wife Keisha Whitaker passed away from alcoholic liver failure and acute renal failure due to years of alcoholism and liver disease."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/south/3-south-movies-to-watch-on-netflix-nanis-hi-nanna-nayantharas-annapoorani-and-jigarthanda-doublex-1269128",
        "title": "3 South movies to watch on Netflix: Nani’s Hi Nanna, Nayanthara’s Annapoorani and Jigarthanda DoubleX",
        "description": "Confused about which movie to watch today? Here are the top 3 newly released South Indian films to watch on Netflix."
    },
    {
        "url": "https://www.skynews.com.au/opinion/harry-and-meghans-2023-was-annus-horribilis-brendan-oneill/video/faf61f2dbadce1146ed76571ba11ce14",
        "title": "Harry and <b>Meghan</b>’s 2023 was ‘annus horribilis’: Brendan O’Neill",
        "description": "Prince Harry and Meghan Markle’s 2023 was “annus horribilis” says Chief Political Reporter of Spiked Online Brendan O’Neill. “Lots of people are saying that 2023 seemed to be their [Harry and Meghan’s] annus horribilis to use a phrase that the Queen once used, and I think that’s right,” Mr O’Neill told Sky News Senior Reporter Caroline Marcus."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/when-meghan-markle-wanted-to-confide-in-kate-prince-williams-wife-said-101704272704913.html",
        "title": "When <b>Meghan Markle</b> wanted to ‘confide’ in Kate, Prince William&#39;s wife said…",
        "description": "Kate Middleton and Meghan Markle did not have an “instant bond” despite being outsiders in the royal family, a book claimed. Omid Scobie detailed the early days of Meghan and Kate&#39;s connection. In ‘Endgame’, the author revealed how Prince William and Prince Harry&#39;s relationship played into their wives&#39; dynamic."
    },
    {
        "url": "https://www.foxnews.com/entertainment/sarah-ferguson-return-royal-family-stark-contrast-prince-harry-meghan-markle-exile",
        "title": "Sarah Ferguson return to royal family &#39;stark contrast&#39; to Prince Harry, <b>Meghan Markle</b> exile: expert",
        "description": "Sarah Ferguson walked with the royal family to church on Christmas morning this year for the first time in decades. Royal experts tell Fox News Digital what her return might mean."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markle-will-take-world-storm-search-fame-2024-says-astrologer-1722505",
        "title": "<b>Meghan Markle</b> Will &#39;Take World By Storm&#39; In Search For Fame In 2024, Says Astrologer",
        "description": "&quot;She is always looking for the next step towards fame, fortune and expansion in her message and reach,&quot; Debbie Frank said."
    }
]