[
    {
        "url": "https://news.yahoo.com/prince-philip-nicknamed-meghan-dow-201437438.html",
        "title": "Prince Philip nicknamed <b>Meghan</b> ‘DoW’ because she reminded him of Wallis Simpson, Duchess of Windsor",
        "description": "Prince Philip nicknamed <b>Meghan Markle</b> “DoW” because she reminded him so much of Wallis Simpson, the Duchess of Windsor, a new book has claimed. Prince Philip was “one of the few wary of succumbing to her charm offensive”, it has been reported ..."
    },
    {
        "url": "https://www.hindustantimes.com/entertainment/tv/good-news-suits-fans-nbc-greenlights-pilot-for-spinoff-101706864909419.html",
        "title": "Good news, Suits fans: NBC greenlights pilot for spinoff",
        "description": "Adams as Mike Ross, <b>Meghan Markle</b> as Rachel Zane, and Sarah Rafferty as Donna Paulsen.(API) The project comes from Suits creator Aaron Korsh and will inhabit the familiar world of the original show while introducing a fresh set of characters. Universal ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-show-32034172",
        "title": "Prince Harry and <b>Meghan Markle</b> show off unseen underground lair in their Montecito home",
        "description": "Prince Harry and Meghan Markle gave fans a sneak peek at their impressive cellar room in their £14million Montecito property after filming in acceptance speech in the lair"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/queens-criticism-meghan-markles-wedding-32034559.amp",
        "title": "Queen Elizabeth&#39;s two-word criticism of <b>Meghan Markle</b>&#39;s wedding dress shared by close pal",
        "description": "<b>Meghan Markle</b> may have fallen in love with her Givenchy wedding dress, but it seems not everyone was a fan - including Queen Elizabeth II. Fans waited with bated breath back in 2018 as the Duchess of Sussex emerged from the burgundy Rolls Royce outside St ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/harry-meghans-new-netflix-project-32034728",
        "title": "Harry and <b>Meghan</b>&#39;s new Netflix project confirmed following eye-watering deal",
        "description": "The Duke and Duchess of Sussex are working on a &#39;couple of unscripted&#39; projects which has been confirmed by a Netflix executive."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862600/meghan-markle-suits-la-spin-off-rachel-zane",
        "title": "<b>Meghan Markle</b>&#39;s Suits character set for &#39;triumphant return&#39; and &#39;top of Hollywood A-list&#39;",
        "description": "EXCLUSIVE: Meghan Markle find herself being paid a huge amount per episode if she stars in the newly-confirmed Suits spin-off, an expert believes."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13023469/prince-harry-warned-africa-rapes-human-rights-board-directors.html",
        "title": "Prince Harry &#39;was warned about rapes and human rights atrocities in Africa carried out by rangers at charity months before he was promoted to its board of directors&#39;",
        "description": "The royal was asked by charity Survival International to use his &#39;influence and position to stop these abuses being committed&#39; in a letter sent to both him and Meghan Markle in May last year."
    },
    {
        "url": "https://www.thesun.co.uk/web-stories/princess-lilibet-inherit-980k-from-meghan/",
        "title": "Princess Lilibet set to inherit stunningly valuable gifts from <b>Meghan</b> - with a big nod to Diana",
        "description": "Meghan has also been seen wearing another one of Diana’s signature pieces, her Cartier watch. The Tank Francaise in 18ct yellow gold was a gift from Diana’s father on her 21st birthday."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862575/meghan-markle-nickname-king-charles",
        "title": "<b>Meghan Markle</b> given no nonsense nickname by King Charles",
        "description": "Meghan Markle was reportedly given a nickname by King Charles soon after she officially entered the Royal Family in 2018. Struck by her strength at that time, King Charles came up with an unusual nickname, a royal expert has claimed."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/suits-spinoff-gets-pilot-order-153210810.html",
        "title": "&#39;Suits&#39; spinoff gets pilot order, will begin filming in March",
        "description": "Suits L.A. will begin filming in Vancouver, Canada, in late March. The pilot is written and executive produced by Suits creator Aaron Korsh. Casting has yet to be announced."
    },
    {
        "url": "https://inews.co.uk/culture/television/url-harry-meghan-movie-2886406?ITO=msn",
        "title": "So Prince Harry and <b>Meghan Markle</b> are making a movie. Does anyone care?",
        "description": "Their transition from royals to celebrity-seeking &#39;multi-hyphenates&#39; is like something from &#39;Black Mirror&#39; - and won&#39;t help them stay relevant"
    },
    {
        "url": "https://www.standard.co.uk/showbiz/suits-la-spin-off-series-start-date-filming-meghan-markle-nbcuniversal-b1136633.html",
        "title": "Suits spin-off confirmed with production starting next month",
        "description": "A spin-off of popular legal drama Suits, where Meghan Markle found fame, has been confirmed with production expected to start as early as March. According to reports on Friday, NBCUniversal has ordered a pilot off Suits: LA."
    },
    {
        "url": "https://metro.co.uk/2024/02/02/fans-rejoice-iconic-netflix-show-gets-massive-reboot-20212700/?ico=trending-post-strip_item_3",
        "title": "Netflix show finally getting reboot after huge fan demand",
        "description": "Suits, which starred <b>Meghan Markle</b>, had a resurgence when it appeared on Netflix and its renewed popularity has led to a pilot, which could become a series. The people have spoken with their remotes by watching 57.7 billion minutes of Suits on the ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/spotify-ups-joe-rogan-experience-172025039.html",
        "title": "Spotify Re-Ups ‘The Joe Rogan Experience’ But Shifts To Non-Exclusive Distribution Plan",
        "description": "While Rogan and other notable names like The Ringer’s Bill Simmons have remained at Spotify, several high-profile signings have left the fold, among them production shingles overseen by Prince Harry and <b>Meghan Markle</b> and Barack and Michelle Obama."
    },
    {
        "url": "https://uk.style.yahoo.com/suits-tv-show-confirmed-113900835.html",
        "title": "A &#39;Suits&#39; Follow-Up TV Show Has Been Confirmed",
        "description": "The creator of TV series Suits, which originally starred Meghan Markle, is in development from the original creator of the series."
    },
    {
        "url": "https://www.ok.co.uk/royal/paul-burrell-harry-meghan-family-32028895",
        "title": "&#39;Royal Family has shut the door on <b>Meghan</b> and Harry in tight-lipped tactic&#39;",
        "description": "Princess Diana&#39;s former butler, Paul Burrell, has shed light on the alleged state of the relationship between Prince Harry and Meghan Markle, and the rest of the Royal Family"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/512614/prince-harry-duchess-meghan-talk-children-online-safety-our-view/",
        "title": "I fear for my kids online – and thank Prince Harry and <b>Meghan Markle</b> for speaking up",
        "description": "This week, Prince Harry and his wife Meghan Markle have brought the issue of children&#39;s online safety to the world stage once again, releasing a statement in response to a landmark U.S. Senate Judiciary Committee hearing."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25670557/harry-meghan-obsessing-security-montecito/",
        "title": "‘Security obsessed’ Harry &amp; <b>Meghan</b> ‘don’t want smaller mansion despite Montecito life costing $20m a year’, experts say",
        "description": "The Duke and Duchess of Sussex are still “obsessed with security and they don’t want to live in a smaller house,” despite living in pricey Montecito, experts have claimed. Prince"
    },
    {
        "url": "https://www.ibtimes.co.uk/suits-la-gets-pilot-order-nbc-new-story-new-characters-1723178",
        "title": "&#39;Suits: LA&#39; Gets Pilot Order At NBC With New Story, New Characters",
        "description": "An expansion of the &quot;Suits&quot; universe, this time set in Los Angeles, is heading to NBC. The network has given a pilot order for the aptly titled &quot;Suits: LA&quot; with Victoria Mahoney set to direct and executive produce the offshoot."
    },
    {
        "url": "https://www.joe.co.uk/entertainment/suits-spin-off-series-confirmed-after-legal-dramas-huge-netflix-resurgence-420734",
        "title": "Suits spin-off series confirmed after legal drama’s huge Netflix resurgence",
        "description": "Old fans and new fans of the slick legal series can rejoice, as a Suits spin-off has just been confirmed for a pilot order at NBC"
    },
    {
        "url": "https://www.ladbible.com/entertainment/tv/suits-spin-off-series-confirmed-netflix-260723-20240202",
        "title": "Suits spin-off series has been confirmed after series had huge resurgence on Netflix",
        "description": "The all-star cast also includes <b>Meghan Markle</b> as Rachel Zane, Sarah Rafferty as Donna Paulsen and Rick Hoffman as Louis Litt. On the show&#39;s resurgence on Netflix, Patrick J. Adams told E! News: &quot;I&#39;m totally astounded it&#39;s found a second life. I feel honoured."
    },
    {
        "url": "https://www.ibtimes.co.uk/netflix-teases-whats-next-prince-harry-meghan-markle-their-multi-million-contract-1723171",
        "title": "Netflix Teases What&#39;s Next For Prince Harry, <b>Meghan Markle</b> On Their Multi-Million Contract",
        "description": "The Duke and Duchess of Sussex are working on several new projects, says Netflix&#39;s chief content officer Bela Bajaria."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512572/meghan-markle-extra-long-hair-home-video-acceptance-speech/",
        "title": "<b>Meghan Markle</b> shows off extra long hair in new home video filmed in unseen room",
        "description": "Meghan Markle and Prince Harry have created their new life in Montecito, California and while fans have been offered several glimpses inside their £14 million mansion, the royal couple have now shown off a never-before-seen corner."
    },
    {
        "url": "https://www.realitytitbit.com/shows/dr-asif-munafs-dragons-den-fail-to-greatest-moment-of-all-time-on-the-apprentice",
        "title": "Dr Asif Munaf’s Dragons Den ‘fail’ to ‘greatest moment of all time’ on The Apprentice",
        "description": "OMG: Diamond experts ‘hounded down <b>Meghan Markle</b>’ to boost brand before Dragons Den When it comes to his “biggest success to date,” Asif says: “Launching a business whilst working 12-hour shifts as a doctor during Covid.” As The Apprentice ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-heart-warming-four-32024401.amp",
        "title": "Prince Harry&#39;s heart-warming four-word remark about George and Charlotte",
        "description": "In the same interview, he also expressed his desire to have kids of his own one day. Harry and his wife <b>Meghan Markle</b> would later go on to welcome their son Prince Archie in May 2019, followed by their daughter Lilibet in June 2021. The duke previously ..."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/suits-spinoff-on-its-way-nbc-universal-orders-suits-la-pilot-see-when-the-production-starts-1275690",
        "title": "Suits Spinoff On Its Way? NBC Universal Orders Suits: LA Pilot; See When The Production Starts",
        "description": "Suits featured a stellar cast including Gabriel Macht, Patrick J. Adams, Rick Hoffman, <b>Meghan Markle</b>, Gina Torres, Sarah Rafferty, and more in key roles. Where can I watch the original Suits series? The original series is available for streaming on Netflix ..."
    },
    {
        "url": "https://news.yahoo.com/suits-la-spinoff-heading-nbc-191700412.html",
        "title": "‘Suits: LA’ spinoff heading to NBC after Netflix success",
        "description": "A new spin on “Suits” is heading to NBC after the legal dramedy’s resurgence in popularity, thanks to Netflix. Production on “Suits: LA” — which has received a pilot order from the legacy network — is slated to start next month in Vancouver,"
    },
    {
        "url": "https://www.livemint.com/special-report/help-wanted-with-ribbon-cutting-medal-pinning-must-be-british-royalty-11706858959200.html",
        "title": "Help Wanted With Ribbon Cutting, Medal Pinning. Must Be British Royalty.",
        "description": "Health trouble, defection and disgrace have reduced the number of princes, princesses and dukes available to spread royal stardust."
    },
    {
        "url": "https://www.latimes.com/entertainment-arts/business/story/2024-02-02/with-new-joe-rogan-deal-spotifys-exclusive-big-name-podcasting-era-is-done",
        "title": "With new Joe Rogan deal, Spotify’s exclusive big-name podcasting era is done",
        "description": "Spotify on Friday said it signed a new deal with Joe Rogan, which will make his podcast no longer exclusive on Spotify. The podcast will be distributed widely, with ad revenue sharing."
    },
    {
        "url": "https://www.today.com/popculture/tv/suits-cast-now-rcna136128",
        "title": "Where are is the cast of ‘Suits’ now? See stars <b>Meghan Markle</b>, Patrick J. Adams and more",
        "description": "The legal drama launched in 2011 and closed its doors in 2019. See what’s become of the familiar faces that made the show such a success."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-and-prince-harrys-last-chance-at-fixing-their-netflix-deal/",
        "title": "<b>Meghan Markle</b> and Prince Harry’s last chance at fixing their Netflix deal",
        "description": "Meghan Markle and Prince Harry&#39;s deal with Netflix is expiring soon and they may have one last chance at proving their worth."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-markle-and-prince-harry-invictus-games-2025-netflix-deal",
        "title": "<b>Meghan Markle</b> and Prince Harry Have Plans for Valentine’s Day—And Their Netflix Deal",
        "description": "The royals will be in Vancouver on February 14 for a One Year to Go event for the 2025 Invictus Games. Meanwhile, Netflix made an announcement about their future forays into unscripted television."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/us/netflix-teases-prince-harry-meghan-markles-upcoming-projects-know-their-movie-tv-and-unscripted-shows/articleshow/107369607.cms",
        "title": "Netflix teases Prince Harry, <b>Meghan Markle</b>&#39;s upcoming projects. Know their movie, TV, and unscripted shows",
        "description": "After signing the deal with Netflix in 2020, Prince Harry and Meghan Markle said their Archewell Productions would create documentaries, docuseries, feature films, scripted shows and childrens shows for the streaming platform."
    },
    {
        "url": "https://localnews8.com/entertainment/2024/02/01/suits-spinoff-is-one-step-closer-to-being-a-reality/",
        "title": "‘Suits’ spinoff is one step closer to being a reality",
        "description": "The show that found a robust second life thanks to streaming is one step closer to starting a new chapter – this time in a fancy law office in sunny LA."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meghan-trainor-wanted-six-kids-162843357.html",
        "title": "<b>Meghan</b> Trainor wanted six kids—until she started sleep training her second",
        "description": "Even if you read all the books and talk to all the pros, it’s time to admit that sleep training is so hard. Hell, even if you nail it with your first child, there’s a good chance your subsequent kiddos won’t be so easy,"
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46625418/prince-harry-meghan-markle-canada-invictus-games-vancouver-whistlers/",
        "title": "Prince Harry and Duchess <b>Meghan</b> Will Travel to Canada for a Cause Close to Their Hearts",
        "description": "The Sussexes will be spending Valentine’s Day supporting a cause that is very close to their hearts."
    },
    {
        "url": "https://www.yahoo.com/entertainment/read-suits-secrets-while-binge-152309721.html",
        "title": "Read Up on These Suits Secrets While You Binge-Watch",
        "description": "All rise, Suits fans, because E! News&#39; breakdown of the USA legal dramedy is in session and we&#39;re testifying about all the series&#39; secrets, including how Meghan Markle influenced her character."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153949-meghan-markle-scores-big-career-win-everything-she-touches-turns-gold",
        "title": "<b>Meghan Markle</b> scores big career win: &#39;Everything she touches turns gold&#39;",
        "description": "Meghan Markle achieved another milestone as her coffee business, Clevr Blends, made it to the shelves of 500 Target stores.For the unversed, the Duchess of Sussex made an unknown amount of money"
    },
    {
        "url": "https://www.usmagazine.com/entertainment/news/netflix-cco-teases-prince-harry-and-meghan-markles-upcoming-projects/",
        "title": "Netflix CCO Hints Prince Harry and <b>Meghan Markle</b> Have ‘A Bunch’ of Projects in Development",
        "description": "Prince Harry and Meghan Markle are currently producing ‘a bunch’ of TV and film projects, according to Netflix chief content officer Bela Bajaria"
    },
    {
        "url": "https://people.com/palace-denies-kate-middleton-coma-spanish-media-reports-8557883",
        "title": "Palace Denies Reports That Kate Middleton Was in a Coma After Abdominal Surgery: &#39;Total Nonsense&#39;",
        "description": "Following a Spanish media outlet&#39;s report that Kate Middleton was in a coma during her recent health scare, the palace is slamming the claim as &quot;totally made-up&quot; and &quot;nonsense.&quot;"
    },
    {
        "url": "https://www.forbes.com/sites/marcberman1/2024/02/02/suits-la-pilot-ordered-by-nbc/",
        "title": "‘Suits: LA’ Pilot Ordered By NBC",
        "description": "LA, which will follow Ted Black, a former federal prosecutor from New York, who has reinvented himself representing the most"
    },
    {
        "url": "https://www.upi.com/Entertainment_News/TV/2024/02/02/Suits-LA-spinoff-details-NBC/1861706886243/",
        "title": "&#39;Suits&#39; spinoff gets pilot order, will begin filming in March",
        "description": "Suits L.A. will begin filming in Vancouver, Canada, in late March. The pilot is written and executive produced by Suits creator Aaron Korsh. Casting has yet to be announced."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-symbolic-visit-canada-invictus-games-1866241",
        "title": "Prince Harry and <b>Meghan Markle</b>&#39;s Symbolic Visit",
        "description": "Harry and Meghan are set to make a working visit to Canada where they will mark the one-year waypoint to the 2025 Invictus Games."
    },
    {
        "url": "https://www.allvipp.com/royals/the-9-times-princess-diana-was-honoured-at-harry-meghan-s-wedding",
        "title": "The 9 Times Princess Diana Was Honoured At Harry &amp; <b>Meghan</b>&#39;s Wedding",
        "description": "Lady Diana died in a tragic car accident in Paris in 1997 some twenty years before Prince Harry and Meghan Markle&#39;s wedding in 2018. This is how she was remembered there!"
    },
    {
        "url": "https://www.aol.com/entertainment/prince-harry-meghan-markle-bunch-145234611.html",
        "title": "Prince Harry, <b>Meghan Markle</b> Have &#39;A Bunch&#39; of Netflix Projects in the Works",
        "description": "Prince Harry and Meghan Markle will soon take over Netflix with several upcoming projects already in the works. “They have a couple of unscripted things they’re working on with Brandon [Reigg, Netflix’s VP of Unscripted and Documentary],"
    },
    {
        "url": "https://www.samaa.tv/208739132-meghan-markle-contemplates-explosive-memoir-amidst-royal-rift",
        "title": "<b>Meghan Markle</b> contemplates explosive memoir amidst royal rift",
        "description": "&quot;I am waiting for Meghan to release her own memoir. It is inevitable for her to write her side of the story because of how absent she was from &#39;Spare,&#39; and that is because she is penning her memoir and telling it from a woman&#39;s perspective,"
    },
    {
        "url": "https://www.skynews.com.au/world-news/united-kingdom/netflix-reveals-several-projects-lined-up-for-harry-and-meghan/video/8df6302d2e343276afc7f0a3a47fae78",
        "title": "Netflix reveals several projects lined up for Harry and <b>Meghan</b>",
        "description": "Prince Harry and Meghan Markle have &quot;a bunch&quot; of projects in development, according to Netflix. Chief content officer Bela Bajaria told Hollywood insiders the couple has multiple projects – including unscripted and early works. One film project is thought to be an adaptation of the novel &#39;Meet Me at the Lake&#39;."
    },
    {
        "url": "https://thenews-chronicle.com/see-prince-harry-and-meghan-markles-new-netflix-projects/",
        "title": "See Prince Harry and <b>Meghan Markle</b>’s New Netflix projects",
        "description": "Since sealing a five-year partnership with Netflix in 2020, estimated at $100 million, the Duke and Duchess of Sussex have been actively developing content through their Archewell Productions"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153900-meghan-markle-prince-harrys-valentines-day-plan-revealed",
        "title": "<b>Meghan Markle</b>, Prince Harry&#39;s Valentine&#39;s Day plans revealed",
        "description": "Prince Harry and Meghan Markle will celebrate Valentine&#39;s Day in Canada to recall sweet memories of their early relationship.The Duke and Duchess of Sussex are heading to Canada this month for"
    },
    {
        "url": "https://guardian.ng/life/prince-harry-and-meghan-to-release-new-netflix-projects/",
        "title": "Prince Harry And <b>Meghan</b> To Release New Netflix Projects",
        "description": "Prince Harry and Meghan Markle are working on a new Netflix film and TV series, according to a company executive. The Duke"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-door-firmly-32027649",
        "title": "Prince Harry and <b>Meghan</b> have had &#39;door firmly shut&#39; in their face as royals employ new tactic",
        "description": "The Duke and Duchess of Sussex were said to be hoping to make amends with Harry&#39;s relatives in the near future but it seems the royals have other plans as they have shut them out with a new tactic."
    },
    {
        "url": "https://timesofindia.indiatimes.com/web-series/news/english/nbc-orders-pilot-for-suits-la-spinoff/articleshow/107351349.cms",
        "title": "NBC orders pilot for &#39;Suits: LA&#39; spinoff",
        "description": "The new series will focus on Ted Black, a former federal prosecutor from New York who has transitioned into representing powerful clients in Los Angel"
    },
    {
        "url": "https://www.firstpost.com/entertainment/end-of-netflix-contract-harry-meghan-still-cashing-in-on-royal-connections-13682142.html",
        "title": "End of Netflix contract, Harry, <b>Meghan</b> still cashing in on royal connections?",
        "description": "Netflix contract nearing an end for Harry and Meghan. So as they try proving themselves as independent filmmakers, will they continue to exploit their royal connections?"
    },
    {
        "url": "https://theblast.com/575448/prince-andrew-is-terrified-after-learning-of-his-rock-sarah-fergusons-skin-cancer-diagnosis/",
        "title": "Prince Andrew ‘Terrified’ After Learning Of Sarah Ferguson’s Second Cancer Diagnosis",
        "description": "Prince Andrew is reportedly spiraling following the news of his ex-wife, Sarah Ferguson&#39;s second skin cancer diagnosis."
    },
    {
        "url": "https://www.nbcnewyork.com/entertainment/entertainment-news/suits-spinoff-confirmed-nbc/5098392/",
        "title": "‘Suits&#39; spinoff confirmed and will begin production in March 2024",
        "description": "After months of speculation, a “Suits” spinoff is officially in the works for NBC, the network announced on Thursday."
    },
    {
        "url": "https://www.eonline.com/news/1394342/suits-spinoff-tv-show-states-new-details-for-the-record",
        "title": "Suits Spinoff TV Show States New Details for the Record",
        "description": "Adams, <b>Meghan Markle</b> and Sarah Rafferty during its nine-season run on the USA Network. Perhaps the biggest new piece of evidence? The upcoming TV show, titled Suits: L.A., won&#39;t see Harvey Specter (Mocht) delivering its opening remarks."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25661652/inside-harry-meghans-bid-rescue-netflix-deal/",
        "title": "Inside Harry &amp; <b>Meghan</b>’s last ditch bid to rescue ‘ticking time bomb’ £80m Netflix deal with ‘unscripted’ shows &amp; film",
        "description": "PRINCE Harry and Meghan Markle are said to be making a last-ditch bid to rescue their £80million Netflix deal. The Duke and Duchess of Sussex are planning “unscripted” shows and a film"
    },
    {
        "url": "https://www.aol.com/entertainment/nbc-orders-pilot-suits-spinoff-223520694.html",
        "title": "NBC Orders Pilot of &#39;Suits&#39; Spinoff Set in Los Angeles",
        "description": "A whole new generation of suits could be coming soon. According to The Hollywood Reporter on Thursday, Aaron Korsch was given a pilot order by NBC to produce the first episode of his Suits spinoff. The new show,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royal-expert-convinced-meghan-markle-will-cause-chaos-foam-at-the-mouth-kate-middleton-becomes-queen.html/",
        "title": "Royal Expert Convinced That <b>Meghan Markle</b> Will Cause Chaos and ‘Foam at the Mouth’ When Kate Middleton Becomes Queen",
        "description": "If King Charles were to abdicate making William and Kate king and queen, Meghan Markle would &#39;foam at the mouth,&#39; says commentator."
    },
    {
        "url": "https://www.freemalaysiatoday.com/category/leisure/2024/02/02/top-streaming-tv-shows-and-movies-in-the-us-last-year/",
        "title": "Top-streaming TV shows and movies in the US last year",
        "description": "Suits’, which brought Meghan Markle to the small screen, ranked No. 1 alongside ‘Ted Lasso’ and ‘Moana’ on Top 10 streaming lists in 2023."
    },
    {
        "url": "https://www.2oceansvibe.com/2024/02/02/former-friend-says-prince-harry-is-nothing-like-the-man-i-met/",
        "title": "Former Friend Says Prince Harry Is “Nothing Like The Man I Met”",
        "description": "OK! previously reported a Wales insider shared the future king and queen didn’t want to spend time with Harry or his wife, <b>Meghan Markle</b>. “Kate may have grudgingly put the past behind her out of loyalty to the family,” a source said."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/suits-la-spin-off-nbc-b2489203.html",
        "title": "Suits LA spin-off gets significant production update",
        "description": "In an interview with the LA Times, Suits creator Aaron Korsch credited the show’s renewed success in part to Markle’s role in the royal family. “ [The show] has an inherent optimism to it, and I think that’s a real part of what people respond to,” Korsh said."
    },
    {
        "url": "https://ca.news.yahoo.com/suits-spin-off-gets-huge-232700839.html",
        "title": "Suits spin-off gets huge update",
        "description": "The Suits spin-off show is officially moving forward with a pilot order at NBC. According to TVLine, Suits: L.A. will introduce a brand new character, Ted Black, as a former federal prosecutor who moves his high-powered practice from New York to Los Angeles."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13035663/Suits-creators-new-LA-based-legal-drama-lands-pilot-order-NBC.html",
        "title": "Suits creator&#39;s new LA-based legal drama lands pilot order at NBC - but will <b>Meghan Markle</b> return for shock spin-off?",
        "description": "LA has landed a pilot order at NBCUniversal.  The new drama from Suits creator Aaron Korsh tells the tale of the life and loves of toilers in a Hollywood law firm - after the huge renewed success of the original series which starred Meghan Markle and ran from 2011-2019."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/meghan-markle-prince-harry-many-195747341.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Have So Many New Projects at Netflix",
        "description": "But yeah, the movie&#39;s great,&quot; she also said, according to People, via Hello! Chris Jackson/Getty Images for the Invictus Games Foundation Related: Prince Harry and <b>Meghan Markle</b> Have Their Next Netflix Project Lined Up Back in 2020, after Harry and <b>Meghan</b> ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-hard-time-rebranding-silence-speaks-volumes.html/",
        "title": "Prince Harry and <b>Meghan Markle</b> are ‘Having a Hard Time’ Rebranding — and Their Silence Speaks Volumes",
        "description": "Prince Harry and Meghan Markle could be figuring out their next re-branding move based on their recent silence."
    }
]