[
    {
        "url": "https://nypost.com/2024/02/03/entertainment/prince-philips-nasty-nickname-for-meghan-markle-revealed-book/",
        "title": "Prince Philip’s nasty nickname for <b>Meghan Markle</b> revealed: book",
        "description": "According to Ingrid Seward’s new book, My Mother And I, the Duke of Edinburgh — who died in 2021 — alluded to Markle as the “Duchess of Windsor.”"
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-prince-harry-reported-204200611.html",
        "title": "<b>Meghan Markle</b> &amp; Prince Harry’s Reported Valentine’s Day Plans May Show Their Real Focus for 2024",
        "description": "Meghan Markle and Prince Harry’s Valentine’s Day plans are reportedly all business. While it seemed as though Prince William and Kate Middleton will be spending their Valentine’s Day in recovery and bed rest,"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/03/65beaed9e2704ee7a48b45b4.html",
        "title": "Book reveals Prince Philip&#39;s unflattering nickname for <b>Meghan Markle</b>",
        "description": "Revelations in an upcoming book by royal biographer Ingrid Seward shed light on Prince Philip&#39;s reportedly spiteful nickname for Meghan Markle. In the bombshell excerpt from &quot;My Mo"
    },
    {
        "url": "https://nypost.com/2024/02/03/entertainment/why-prince-william-and-prince-harry-really-had-a-feud/",
        "title": "The real reason for William and Harry’s feud — and it’s not about <b>Meghan Markle</b>",
        "description": "Princes William and Harry appeared to be the closet of siblings before Meghan Markle arrived on the scene in 2016. The Duchess of Sussex has long been seen as the catalyst for the brother’s bitter fall-out — but a new report claims they were already at odds over their differing approaches to charity work."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862828/Prince-Harry-Meghan-Markle-alarming-feedback",
        "title": "Prince Harry and <b>Meghan Markle</b> get &#39;alarming&#39; feedback as TV careers left in tatters",
        "description": "EXCLUSIVE: Americans appears to have lost all interest in Prince Harry and Meghan Markle - with experts branding them a &#39;one trick pony&#39;."
    },
    {
        "url": "https://deadline.com/2024/02/prince-harry-prince-william-dispute-pre-dated-meghan-markle-arrival-1235813484/",
        "title": "Princes Harry And William’s Dispute “Pre-dated <b>Meghan</b>’s Arrival,” With Real Reason Revealed",
        "description": "While the feud between royal princely siblings William and Harry was indubitably fueled by the arrival of Meghan Markle in the latter’s life, it has now been revealed that the pair’s dispute"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/real-reason-prince-philips-spiteful-32040238",
        "title": "Real reason for Prince Philip&#39;s spiteful nickname for <b>Meghan Markle</b> explained",
        "description": "Prince Phillip gave Meghan Markle a nickname based on another Royal figure who didn&#39;t have the best standing with the family"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-makes-intentional-move-32040003",
        "title": "<b>Meghan Markle</b> makes &#39;intentional&#39; move signalling she&#39;s &#39;in charge&#39; of Prince Harry",
        "description": "<b>Meghan Markle</b> made it clear she was &quot;in charge&quot; of Prince Harry and holding the reigns in the relationship with an &quot;intentional&quot; move, it has been revealed according to a body language expert. It comes as The Duke and Duchess of Sussex made a surprise appearance at the premiere of Bob Marley: One Love in Kingston, Jamaica last month courtesy of Paramount Pictures CEO Brian Robbins - according ..."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/prince-harry-and-meghan-markle-are-facing-business-hardships-says-royal-author/",
        "title": "Prince Harry and <b>Meghan Markle</b> are facing business hardships, says royal author",
        "description": "Harry and Meghan may be headed for trouble if their business expenses are more than the income they bring in with these deals. Martha McGinnis, the author of 10 Lessons from Harry &amp; Meghan, has a warning for the couple. She worries that they spend more than they take in with their businesses."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2949732/prince-harry-meghan-markle-netflix-deal-new-projects-report/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b>’s Netflix Deal Is Reportedly Still Going Strong With Future Projects",
        "description": "Despite some potential recent setbacks, Prince Harry and Meghan Markle ‘s joint business ventures are still going strong. The couple, who inked a deal with Netflix back in 2020, still have a quite a few projects in store with the streamer."
    },
    {
        "url": "https://radaronline.com/p/prince-philip-spiteful-nickname-meghan-markle-new-book/",
        "title": "Prince Philip Allegedly Had a &#39;Spiteful Nickname&#39; for <b>Meghan Markle</b>, According to New Book",
        "description": "Prince Philip, the late Duke of Edinburgh, allegedly had a spiteful nickname for Meghan Markle, according to a shocking revelation in Ingrid Seward&#39;s upcoming book, My Mother And I, RadarOnline.com has learned."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862796/prince-harry-meghan-markle-spending-royal-family-money-california",
        "title": "Harry and <b>Meghan</b>&#39;s spending &#39;worries&#39; royals: &#39;What happens when the money runs out?&#39;",
        "description": "Katie Nicholl, the royal editor of Vanity Fair, added that Harry and Meghan&#39;s annual spending could be as much as $20million a year. She said: &quot;I was speaking to someone in Montecito who said you can&#39;t live in Montecito the way they&#39;re living without it costing about $20million a year.&quot;"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-ageless-lost-tv-32037731",
        "title": "<b>Meghan Markle</b> &#39;ageless&#39; in lost TV ad filmed 15 years ago",
        "description": "Before marrying into the Royal Family, Meghan Markle was best known for her role in legal drama Suits, but now she&#39;s been spotted in a resurfaced television advert from 2009"
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/meghan-markle-oscars",
        "title": "Will <b>Meghan Markle</b> and Prince Harry be making an appearance at this year&#39;s Oscars?",
        "description": "Nominated alongside The After (Misan Harriman, Nicky Bentham) are: The Wonderful Story of Henry Sugar (Wes Anderson, Steven Rales), Knight of Fortune (Lasse Lyskjær Noer, Christian Norlyk), Invincible (Vincent René-lortie, Samuel Caron), and Red, White and Blue (Nazrin Choudhury, Sara McFarlane)."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12995109/Fashion-designers-royal-women-REALLY-want.html",
        "title": "The A-Z of fashion designers that royal women turn to when they REALLY want a regal look. (And, yes, we have Y and Z!) By ELIZA SCARBOROUGH",
        "description": "Perhaps it&#39;s natural that many of the leading ladies, from Queen Letizia of Spain to Queen Mary of Denmark, or from Beatrice to Kate, turn to the same designers."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-brutally-32037291",
        "title": "<b>Meghan Markle</b> and Prince Harry brutally downgraded on Royal Family website amid &#39;errors&#39;",
        "description": "Prince Harry and Meghan Markle&#39;s profiles on the website for the Royal Family contain several errors, but the pair have now also been significantly downgraded to the bottom of the page"
    },
    {
        "url": "https://www.lbc.co.uk/news/queen-meghan-markle-wedding-dress/",
        "title": "Queen Elizabeth thought <b>Meghan</b>&#39;s wedding dress was &#39;too white&#39; in secret remarks to cousin",
        "description": "Queen Elizabeth was critical of Meghan&#39;s wedding dress when she tied the knot with Prince Harry, it has emerged."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-brutally-32037025.amp",
        "title": "Prince Harry and <b>Meghan Markle</b> brutally downgraded on official Royal Family website",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, have been brutally downgraded on the official Royal Family website, with the couple now moved to the bottom"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25626114/the-unlikely-royals-the-fashion-world-kate-meghan/",
        "title": "The unlikely royals the fashion world is obsessed with – and it’s not Kate Middleton or <b>Meghan Markle</b>",
        "description": "THE Princess of Wales is one of the most stylish women in the world.  Kate’s earned her style stripes by wearing a mix of high street and designer looks we all love.  She’s even"
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-feud-william-conservation/",
        "title": "Harry&#39;s feud with William &#39;pre dates <b>Meghan Markle</b> and originated with a row about conserving elephants in Africa&#39;",
        "description": "The feud between Prince Harry and Prince William pre-dates his relationship with Meghan and took off during a row about conservation."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/fashion-trends/512494/nicola-peltz-victoria-beckham-white-power-suit/?n=%40",
        "title": "Nicola Peltz is the spitting image of Victoria Beckham in white power suit",
        "description": "The fashion set has been obsessed with winter whites this season. <b>Meghan Markle</b> nailed casual chic in a round neck jumper and palazzo pants from Ralph Lauren, the Princess of Wales opted for straight-leg trousers with statement gold buttons and a longline ..."
    },
    {
        "url": "https://www.billboard.com/pro/k-pop-stocks-down-spotify-shares-up-joe-rogan-deal-news/",
        "title": "K-Pop Stocks Down 17% Overall in 2024, Spotify Soars on Joe Rogan News &amp; Earnings Anticipation",
        "description": "The Billboard Global Music Index dropped 0.4% to 1,588.68 this week as 13 of 20 stocks finished in negative territory."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13039785/Is-real-reason-William-Harry-fell-Palace-insiders-claim-brothers-heated-disagreement-approach-conservation-Harry-met-Meghan-Duke-Sussex-faces-questions-rapes-carried-charity-rangers.html",
        "title": "Is THIS the real reason William and Harry fell out? Palace insiders claim brothers had heated disagreement on approach to conservation BEFORE Harry met <b>Meghan</b> - as Duke of ...",
        "description": "While the Prince of Wales is said to support community-led initiatives to help local people conserve the land, the Duke of Sussex favours a more interventionist approach."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25693934/prince-philip-meghan-markle-duchess-of-windsor/",
        "title": "Prince Philip called <b>Meghan Markle</b> the ‘D.O.W’ after the American divorcee who led Edward VIII to abdicate",
        "description": "PRINCE Philip called Meghan Markle the “D.O.W” after the Duchess of Windsor — the American divorcee who led Edward VIII to abdicate. And he warned the late Queen to be “cautious” of Prince Harry’s"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-suffer-32014568",
        "title": "Prince Harry and <b>Meghan Markle</b> suffer &#39;chaos&#39; behind closed doors as more staff quit",
        "description": "Prince Harry and <b>Meghan Markle</b> are facing more issues after a TV executive within their production company quits. Archewell - which the Duke and Duchess of Sussex set up in 2020 - has worked with some huge companies throughout the years, including Netflix ..."
    },
    {
        "url": "https://uk.yahoo.com/style/prince-harry-allegedly-put-end-130703380.html",
        "title": "Prince Harry Allegedly &quot;Put an End&quot; to <b>Meghan Markle</b>&#39;s Memoir Plans",
        "description": "Rumors that <b>Meghan Markle</b> wished to write a memoir of her own have been swirling around for months, culminating recently in incendiary royal expert Tom Bower claiming that such a &quot;tell-all&quot; book would be imminent. It was reported that <b>Meghan</b> wanted to &quot;set ..."
    },
    {
        "url": "https://www.thechronicle.com.au/entertainment/celebrity-life/royals/three-words-confirm-harry-and-meghan-are-spiralling-out-of-control/news-story/344ce0a6858c84d5cf9d5613f1bf9e73",
        "title": "Three words confirm Harry and <b>Meghan</b> are spiralling out of control",
        "description": "COMMENT"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-meghan-markles-very-different-reactions-same-uncomfortable-encounters-caught-camera.html/",
        "title": "Kate Middleton and <b>Meghan Markle</b>’s Very Different Reactions to the Same Uncomfortable Encounters Caught on Camera",
        "description": "A viral video has fans comparing the reactions of Kate Middleton and Meghan Markle experiencing the same situation."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154296-prince-harry-meghan-markle-to-produce-sequel-of-netflix-docuseries",
        "title": "Prince Harry, <b>Meghan Markle</b> to produce sequel of Netflix docuseries?",
        "description": "Prince Harry and Meghan Markle, who are working on some exciting projects for Netflix, are reportedly planning to drop the sequel of their explosive docuseries amid an intensifying rift with"
    },
    {
        "url": "https://www.wionews.com/entertainment/lifestyle/news-harry-and-williams-dispute-pre-dates-meghan-markles-arrival-in-family-claims-insiders-686725",
        "title": "Harry And William&#39;s dispute pre-dates <b>Meghan Markle</b>&#39;s arrival in family, claims insiders",
        "description": "The longstanding rift between royal siblings Prince William and Prince Harry, often attributed to the arrival of Meghan Markle in Harry&#39;s life, is now revealed to have deeper roots. According to insights from palace insiders reported by The Times of London,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154294-meghan-markle-prince-harry-decide-to-drop-royal-titles-amid-growing-outrage",
        "title": "<b>Meghan Markle</b>, Prince Harry decide to drop royal titles amid growing outrage?",
        "description": "Prince Harry and Meghan Markle, who have come under fire after their latest stunt in Jamaica, are facing mounting pressure to drop their royal titles.The Duke and Duchess of Sussex have"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-and-prince-harrys-spending-problem-concerns-the-palace-how-expensive-is-their-lifestyle-101706965778233.html",
        "title": "<b>Meghan Markle</b> and Prince Harry&#39;s ‘spending problem’ concerns the Palace; How expensive is their lifestyle?",
        "description": "Royal expert Matt Wilkinson dishes that Buckingham Palace actively worries about what will happen when the money runs out."
    },
    {
        "url": "https://www.btimesonline.com/articles/163728/20240203/prince-harry-and-meghan-markle-eportedly-targeted-by-travolta-in-scientology-recruitment-bid.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Reportedly Targeted by John Travolta in Scientology Recruitment Bid",
        "description": "John Travolta, the iconic actor known for his roles in &quot;Saturday Night Fever&quot; and &quot;Grease,&quot; is reportedly making overtures to Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, with an aim to introduce them to Scientology."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-movie-premiere-appearance-hollywood-podcast-1865591",
        "title": "Why Harry and <b>Meghan</b>&#39;s Latest Appearance Strengthens Ties With Hollywood",
        "description": "The Duke and Duchess of Sussex&#39;s appearance at a red-carpet event boosts their Hollywood credibility, Newsweek&#39;s &quot;The Royal Report&quot; has discussed."
    },
    {
        "url": "https://www.thehindu.com/entertainment/movies/suits-la-lands-pilot-order-at-nbc/article67807692.ece",
        "title": "‘Suits: LA’ lands pilot order at NBC",
        "description": "Suits: LA, the Suits spinoff, has landed a pilot order at NBCUniversal, reported Variety. The production of the spinoff project will begin in late March in Vancouver. New ‘Suits’ series in early development: reports In the new version,"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-william-harry-meghan-markle-feud-wildlife-conservation-africa-b1136809.html",
        "title": "Prince Harry&#39;s rift with brother William &#39;began following heated disagreement over wildlife conservation&#39;",
        "description": "The rift between the Prince of Wales and the Duke of Sussex began due to a heated disagreement over conservation work, it has been reported. The brothers fell out with each other following a dispute on the best methods to stop poaching and protect endangered species in Africa, The Times reported."
    },
    {
        "url": "https://www.samaa.tv/208739187-royal-family-website-changes-signal-strained-ties-with-prince-harry-and-meghan",
        "title": "Royal family website changes signal strained ties with Prince Harry and <b>Meghan</b>",
        "description": "Despite the major changes within the Royal Family, the official website has been discovered with notable mistakes, raising eyebrows about whether these were inadvertent errors or a deliberate message to the Sussexes."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25696924/prince-harry-williams-feud-started-before-meghan/",
        "title": "Prince Harry and William’s feud began before <b>Meghan</b>, says insider as they reveal row which sparked long-lasting rivalry",
        "description": "PRINCE Harry and William’s feud started before his relationship with Meghan Markle, a palace insider has claimed. Rumours that there was a feud between the Duke of Sussex and the Prince of"
    },
    {
        "url": "https://www.geelongadvertiser.com.au/entertainment/celebrity-life/royals/prince-philips-secret-nickname-for-meghan-markle-as-new-details-emerge-about-prince-harrys-feud-with-prince-william/news-story/e9e1ab8f4509c950f4fe3d172876b28c",
        "title": "Prince Philip’s ‘secret nickname’ for <b>Meghan Markle</b> as new details emerge about Prince Harry’s feud with Prince William",
        "description": "The feud between Prince Harry and Prince William started before the younger brother’s relationship with Meghan Markle, a palace insider has claimed."
    },
    {
        "url": "https://www.spectator.com.au/2024/02/netflix-rides-to-the-rescue-for-meghan-and-harry-again/",
        "title": "Netflix rides to the rescue for <b>Meghan</b> and Harry – again",
        "description": "After a catastrophic 2023, the Duke and Duchess of Sussex have taken some time to regroup and rethink. Now they have decided to grace us with their decision on to how to re-enter the public sphere"
    },
    {
        "url": "https://www.allvipp.com/royals/this-is-how-harry-and-meghan-are-spending-valentine-s-day",
        "title": "THIS Is How Harry And <b>Meghan</b> Are Spending Valentine&#39;s Day",
        "description": "What will Valentine&#39;s Day be like for stars like Prince Harry and Duchess <b>Meghan</b>? The two apparently already have a precise plan for the day of lovers which involves doing what they love most: work! THIS is Valentine&#39;s Day with Harry and <b>Meghan</b> The two ..."
    },
    {
        "url": "https://dailyhive.com/canada/prince-harry-meghan-markle-coming-vancouver",
        "title": "Prince Harry and <b>Meghan Markle</b> are coming to Vancouver this month — and here&#39;s why",
        "description": "Prince Harry and Meghan Markle could have some Vancouver Valentine&#39;s Day plans, as they&#39;re set to visit the city later this month."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royals-warned-another-bomb-coming-meghan-markle-must-prepare-inevitable.html/",
        "title": "Royals Warned of ‘Another Bomb’ Coming From <b>Meghan Markle</b> So They Must Prepare for the ‘Inevitable’",
        "description": "Find out what a former royal employee said about the family needing to be prepared because the Duchess of Sussex is going to toss &quot;another bomb&quot; their way."
    },
    {
        "url": "https://news.yahoo.com/where-stars-suits-now-000326441.html",
        "title": "Where are the stars of ‘Suits’ now?",
        "description": "&quot;Suits&quot; launched in 2011 and closed its doors in 2019. See what’s become of the familiar faces like Meghan Markle, Patrick J. Adams and Sarah Rafferty."
    },
    {
        "url": "https://scrippsnews.com/stories/suits-spinoff-gets-pilot-order-at-nbc-here-s-what-fans-can-expect/",
        "title": "&#39;Suits&#39; spinoff gets pilot order at NBC. Here&#39;s what fans can expect",
        "description": "The &quot;Suits&quot; crew is headed to Los Angeles. A spinoff of the streaming hit has a pilot order at NBC. Here&#39;s what we know so far."
    },
    {
        "url": "https://www.hola.com/us/royals/20240202355537/meghan-markle-prince-harry-canada-valentines-day-2024/",
        "title": "<b>Meghan Markle</b> and Prince Harry to celebrate Valentine’s Day away from home",
        "description": "The Duke and Duchess’ upcoming trip will coincide with Valentine’s Day. Before she met Harry, <b>Meghan</b> once admitted on her now-defunct lifestyle blog The Tig that she is a “sucker” for the holiday. She wrote (via PEOPLE), “Hook, line and sinker ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-wants-to-build-bridges-focus-healing-2024-expert-says.html/",
        "title": "Prince Harry Wants to ‘Build Bridges’ and Focus on ‘Healing’ in 2024, Expert Says",
        "description": "Prince Harry still has hardly spent any time with his family in the last few years. He and his wife, <b>Meghan Markle</b>, stepped back from their roles as senior royals back in 2020, and this will be the fourth year since they have taken on any official royal ..."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2948246/meghan-markle-investment-clevr-blends-target/",
        "title": "<b>Meghan Markle</b> Scores Her First Big Win in 2024 With a Major Business Deal",
        "description": "Meghan Markle invested in a small business that had some royal watchers scratching their heads. Why would the Duchess of Sussex be interested in a brand that makes instant-drink mixes for plant-based lattes?"
    }
]