[
    {
        "url": "https://au.lifestyle.yahoo.com/prince-harry-meghan-markle-hit-back-at-critics-will-not-be-broken-213300340.html",
        "title": "Prince Harry, <b>Meghan Markle</b> hit back at critics: &#39;Will not be broken&#39;",
        "description": "The couple stand united amid backlash over their trip to Canada in the wake of King Charles&#39; health. Read more."
    },
    {
        "url": "https://www.aol.com/entertainment/meghan-markles-snowy-style-waterproof-193055786.html",
        "title": "Get <b>Meghan Markle</b>&#39;s Snowy Style With These Waterproof Boots on Sale",
        "description": "Getty Images While we spent Valentine’s Day watching The Crown, a royal romance was playing out in real time. Prince Harry and Meghan Markle were spotted walking hand in hand yesterday in Whistler, Canada while visiting the Winter Training Camp for the 2025 Invictus Games."
    },
    {
        "url": "https://uk.news.yahoo.com/save-a-royal-bundle-on-meghan-markles-go-to-waterproof-winter-boots-nearly-50-off-at-zappos-203934321.html",
        "title": "Save a royal bundle on <b>Meghan Markle</b>&#39;s go-to waterproof winter boots — nearly 50% off at Zappos",
        "description": "For as little as $129 a pair, you can keep your feet warm, dry and comfortable even in the worst winter weather."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-hit-back-32137441",
        "title": "Prince Harry and <b>Meghan</b> hit back at &#39;make or break&#39; claims during Invictus Games appearance",
        "description": "The Duke and Duchess of Sussex are in the middle of a three-day in Canada for the Invictus Games although have been warned to &#39;behave&#39; after believed attempts to build bridges."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-gets-recharged-invictus-190018438.html",
        "title": "Prince Harry &#39;Gets Recharged&#39; at the Invictus Games: &#39;He&#39;s with His People Now,’ Athlete Says",
        "description": "Mike Bourgeois, who served as a member of Canada&#39;s archery team at the 2020 Invictus Games in The Netherlands, shared insights with reporters, including PEOPLE, on his conversatio"
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-meghan-defiant-statement-32137061",
        "title": "<b>Meghan Markle</b> and Prince Harry hit back over criticism with defiant statement",
        "description": "Prince Harry and Meghan Markle have hit back at claims that their Invictus Games trip is &quot;make or break&quot;, if they want to salvage a relationship with the Royal Family"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-wears-almost-8000-32136683.amp",
        "title": "<b>Meghan Markle</b> wears almost £8,000 worth of clothes in just 12 hours during Canada trip",
        "description": "Meghan Markle and husband Prince Harry are in Canada to promote the One Year To Go event ahead of the 2025 Invictus Games, which will be held in the country for the second time"
    },
    {
        "url": "https://www.thesun.co.uk/tv/25969271/love-island-toby-chloe-body-language-cheating/",
        "title": "Love Island’s Toby and Chloe BOTH can’t be trusted’ reveals body language expert as exes accuse each other of cheating",
        "description": "LOVE Island’s warring exes Toby Aromolaran and Chloe Burrows have both accused each other of cheating on them – and now a body langauge expert has analysed who is lying. On the ITV2"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-celebrate-175959309.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Celebrate Valentine&#39;s Day with Romantic Dinner in Canada: See the Menu!",
        "description": "Meghan Markle wore a red peplum coat entering Italian restaurant Il Caminetto Courtesy Invictus Games Vancouver Whistler 2025 Meghan Markle and Prince Harry at the Invictus Games training camp on Feb."
    },
    {
        "url": "https://www.ok.co.uk/celebrity-pictures/meghan-markle-letting-harry-take-32134380",
        "title": "<b>Meghan Markle</b> letting Harry &#39;take the lead&#39; as she takes &#39;significant&#39; step back",
        "description": "Meghan Markle and Prince Harry put on a loved-up display as they arrived in Whistler, Canada, to promote the Invictus Games – with both dressed for the wintery weather"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25969514/prince-harry-meghan-markle-issue-defiant-statement/",
        "title": "Prince Harry &amp; <b>Meghan Markle</b> blast ‘we cannot be broken’ in defiant statement after fierce criticism of Sussex rebrand",
        "description": "PRINCE Harry and Meghan Markle have issued a defiant “we cannot be broken” statement amid fierce criticism of their rebrand. The week has seen a flurry of announcements from the"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867220/royal-family-prince-harry-meghan-markle-new-statement-make-or-break",
        "title": "&#39;We won&#39;t be broken&#39;: Prince Harry and <b>Meghan Markle</b> hit back at &#39;make or break&#39; claims",
        "description": "Prince Harry and Meghan will continue to &#39;work and pursue what they believe in&#39; despite the challenges and the critics."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/best-photos-meghan-markle-prince-171849947.html",
        "title": "All the Best Photos from <b>Meghan Markle</b> and Prince Harry&#39;s Trip to Canada for the Invictus Games Countdown",
        "description": "The Duke and Duchess of Sussex are in Vancouver and Whistler for the Invictus Games 2025&#39;s One Year to Go celebrations"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13088389/Meghan-Markle-Jessica-Mulroney-cryptic-post-Valentines-Day.html",
        "title": "<b>Meghan Markle</b>&#39;s estranged BFF Jessica Mulroney shares cryptic post on Valentine&#39;s Day - while the Sussexes put on a loved-up display on the slopes",
        "description": "Meghan Markle&#39;s estranged BFF Jessica Mulroney shared a cryptic post on Valentine&#39;s Day as the Sussex&#39;s gave a loved up display on the slopes."
    },
    {
        "url": "https://uk.movies.yahoo.com/suits-rick-hoffman-reveals-smelly-170006294.html",
        "title": "“Suits&#39; ”Rick Hoffman Reveals the Smelly Reason for His Viral Moment at <b>Meghan Markle</b> and Prince Harry&#39;s Wedding",
        "description": "Hoffman revealed during a conversation on &#39;Chicks in the Office&#39; that his reaction was a response to smelling something &quot;terrible and foul.&quot;"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-was-just-spotted-wearing-perfect-sorel-winter-boots-in-bc--and-theyre-40-off-165521583.html",
        "title": "<b>Meghan Markle</b> was just spotted wearing &#39;perfect&#39; Sorel winter boots in B.C. — and they&#39;re 40% off",
        "description": "The Duchess of Sussex is back in Canada, and she brought her $162 Sorel boots with her. Meghan Markle and Prince Harry are back on Canadian soil, and the royal couple came dressed for the weather."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513547/meghan-markle-prince-harry-canada-day-two/",
        "title": "Prince Harry and <b>Meghan Markle</b> step out for second day of Canada trip - live updates",
        "description": "The Duke and Duchess of Sussex are continuing their visit in Canada and the couple are expected to meet more competitors and coaches on day two. The three-day trip comes amid a busy week for Prince Harry and Meghan. On Monday, they launched their new Sussex.com website, a &quot;one stop shop&quot; for all their activities."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markle-went-32134702?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "Prince Harry and <b>Meghan Markle</b> &#39;went against everything they promised&#39; in latest decision",
        "description": "Prince Harry and Meghan Markle have launched a new website boasting their links to the Royal family - four years after quitting their roles to seek &#39;financial freedom&#39;"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-goes-high-low-162246050.html",
        "title": "<b>Meghan Markle</b> Goes High-low in Calvin Klein Maxi Puffer Jacket and Cashmere in Vancouver With Prince Harry on Valentine’s Day",
        "description": "Markle has adopted quiet luxury as her personal style, often wearing minimalist and monochromatic pieces for her public appearances. On Jan. 24, she wore an all-black Carolina Herrera look at the premiere of “ Bob Marley: One Love ” in Kingston, Jamaica. For Variety Power of Women 2023 in November, she donned a beige Proenza Schouler dress."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/513579/michael-j-fox-tracy-pollan-twin-daughters-grown-up-unseen-birthday-photos/",
        "title": "The Family Ties co-stars are the doting parents of four adults",
        "description": "Happy birthday Aquinnah and Schuyler Fox! The twin daughters of Michael J. Fox and Tracy Pollan mark another year round the sun on February 15, turning 29. In honor of their special day, their famous parents each shared sweet tributes on social media. Tracy, 63, was first to post a sweet compilation of photos with her grown-up daughters."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-borrows-phone-snap-155139278.html",
        "title": "<b>Meghan Markle</b> Borrows Phone to Snap a Photo of Prince Harry Sit-Skiing to &#39;Show the Kids&#39;",
        "description": "When Prince Harry tried adaptive skiing at the Invictus Games Winter Training Camp in Canada, his wife made sure to capture the moment"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13087273/Harry-Meghan-Markle-Valentines-Day-dinner-Whistle-Invictus-Games.html",
        "title": "Prince Harry and <b>Meghan Markle</b> share romantic Valentine&#39;s Day dinner at upscale Italian restaurant Il Caminetto after a day on the slopes in Whistler, Canada",
        "description": "A beaming Meghan Markle was a lady in red for a romantic Valentine&#39;s Day dinner with Prince Harry as they took a break from Invictus Games duties in Whistler, British Columbia Wednesday night."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-issues-firm-instruction-32134460",
        "title": "<b>Meghan Markle</b> issues firm instruction to Invictus Games officials to call her &#39;Ma&#39;am&#39;",
        "description": "The Duke and Duchess of Sussex are currently in Canada to prepare for the one year countdown event for the Invictus Games 2025 with the new CEO confirming how he was told to address the couple."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/harry-meghan-try-out-new-28640183",
        "title": "Harry and <b>Meghan</b> try out new sport ahead of Invictus Games in Canada next year",
        "description": "The Duke and Duchess of Sussex have been pictured trying out a new sport as they visited Canada to mark a year until the Invictus Games"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867105/meghan-markle-wears-missing-engagement-ring",
        "title": "<b>Meghan Markle</b> solves mystery of missing £140k engagement ring on Canada trip",
        "description": "Meghan Markle has been spotted wearing her sparkling engagement ring for the first time in nine months in Whistler, Canada."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meghan-markle-prince-harry-reveal-162424628.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Reveal a Historic First During Their Visit to Canada",
        "description": "The couple toured the Squamish Lil&#39;wat Cultural Centre, a First Nations museum and art gallery Jeremy Allen for Invictus Games <b>Meghan Markle</b> and Prince Harry - Invictus Games 2024 <b>Meghan Markle</b> and Prince Harry helped unveil a historic first in debuting ..."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/meghan-markles-cheeky-nod-canada-9100839",
        "title": "<b>Meghan Markle</b>&#39;s cheeky nod to Canada and her &#39;special&#39; web designers in statement",
        "description": "The Duke and Duchess of Sussex have rebranded their website - and it seems Meghan Markle knew who should design it."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/uk/meghan-markle-responds-to-sussex-website-backlash-as-harry-tries-sit-skiing-in-canada/a1595173403.html",
        "title": "<b>Meghan Markle</b> responds to Sussex website backlash as Harry tries sit-skiing in Canada",
        "description": "Meghan Markle praised the “attention to detail” and “creativity and care” of the designers, after critics pointed out the couple were told to drop use of HRH when they quit as working royals. Even their use of the title Sussex was debated at Buckingham Palace."
    },
    {
        "url": "https://inews.co.uk/culture/radio/meghan-markle-lemonada-podcast-2906178?ico=related_article_inline",
        "title": "<b>Meghan Markle</b> is perfect for Lemonada’s glossy, girlboss-feminist podcast empire",
        "description": "The Duchess of Sussex&#39;s mic-friendly valley girl tones and generic empowerment language are ideal for a podcast network aiming to &#39;make life suck less&#39;"
    },
    {
        "url": "https://pagesix.com/2024/02/15/royal-family/prince-harry-meghan-markle-fire-back-at-critics-we-will-not-be-broken/",
        "title": "Prince Harry, <b>Meghan Markle</b> fire back at critics: We ‘will not be broken’",
        "description": "The statement came in response to claims that the Duke and Duchess of Sussex needed to be on their best behavior in Canada if they hope to reconcile with the royal family."
    },
    {
        "url": "https://www.usmagazine.com/shop-with-us/news/meghan-markle-maxi-puffer-coat/",
        "title": "Brave the Cold <b>Meghan Markle</b>-Style in This Chic Hooded Winter Puffer Coat",
        "description": "Meghan Markle’s chic puffer coat just sold out, but we found a similar style you can still shop from Walmart — details here!"
    },
    {
        "url": "https://www.eastbaytimes.com/2024/02/15/sussex-residents-irked-by-harry-and-meghans-sussex-com-rebrand-while-archie-and-lilibet-get-sussex-surnames/",
        "title": "Sussex residents irked by Harry and <b>Meghan</b>’s Sussex.com rebrand, while Archie and Lilibet get Sussex surnames",
        "description": "Why would they want to be called the Duke and Duchess of Sussex when they are in America?’ one West Sussex resident asked, while another wonders whether Meghan even knows ‘where"
    },
    {
        "url": "https://nypost.com/2024/02/15/entertainment/meghan-markles-suits-co-star-recalls-foul-smell-at-prince-harry-wedding/",
        "title": "<b>Meghan Markle</b>’s ‘Suits’ co-star recalls ‘foul’ smell at Prince Harry royal wedding",
        "description": "As time goes on, I’m starting to smell something really terrible and foul, and I’m very sensitive when it comes to that.” — Rick Hoffman"
    },
    {
        "url": "https://keyt.com/news/national-world/cnn-world/2024/02/15/meghan-duchess-of-sussex-fast-facts-4/",
        "title": "<b>Meghan</b>, Duchess of Sussex Fast Facts",
        "description": "Here is a look at the life of the Duchess of Sussex, the former actress Meghan Markle. PersonalBirth date: August 4,"
    },
    {
        "url": "https://www.btimesonline.com/articles/164035/20240216/prince-harry-and-meghan-markle-strike-back-at-critics-affirm-they-will-not-be-broken.htm",
        "title": "Prince Harry and <b>Meghan Markle</b> Strike Back at Critics, Affirm They &#39;Will Not Be Broken&#39;",
        "description": "Prince Harry and Meghan Markle have issued a forthright response to their detractors, affirming their steadfastness amidst a flurry of recent critiques. The Duke and Duchess of Sussex, through a spokesperson,"
    },
    {
        "url": "https://www.livemint.com/news/trends/meghan-markle-speaks-about-new-website-after-royalists-slam-controversial-change-it-is-illegal-11707984436946.html",
        "title": "<b>Meghan Markle</b> speaks about new website after Royalists slam controversial change: ‘It is illegal…’",
        "description": "Critics argue that Meghan Markle using the Sussex title is an insult to Prince Philip and Harry&#39;s family name of Mountbatten-Windsor."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-harry-meghan-markle-issue-furious-statement-amid-backlash-cannot-be-broken/news-story/f10cc53fbbe075373660d95a20250a66",
        "title": "Prince Harry, <b>Meghan Markle</b> issue furious statement amid backlash: ‘Cannot be broken’",
        "description": "Prince Harry and Meghan Markle have sensationally hit back following claims their Invictus Games trip to Canada is make or break for their future with the monarchy."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/15/harry-meghan-coat-of-arms-mistakes-sussex/",
        "title": "There are three mistakes on Harry and <b>Meghan</b>’s new coat of arms – can you spot them?",
        "description": "Perhaps significantly, the arms they display are actually Meghan’s, which were granted to her when she was still an HRH. These were designed by Thomas Woodcock, when he was Garter King of Arms, and were announced to the world on May 25 2018, a few days after the wedding."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/us/heres-how-meghan-markle-reacted-to-king-charles-cancer-diagnosis/articleshow/107732716.cms",
        "title": "Here’s how <b>Meghan Markle</b> reacted to King Charles Cancer diagnosis",
        "description": "Despite recent health concerns surrounding King Charles, the Duchess of Sussex, Meghan Markle, is reluctant to return to the UK. Markle, whose time in the country has been marked by turbulence, reportedly harbors aversion to revisiting what she views as distressing memories."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-wears-decade-old-161352242.html",
        "title": "<b>Meghan Markle</b> Wears Decade-Old Boots Just Like Kate Middleton!",
        "description": "The Duchess of Sussex also recycled another piece of winter gear that has been in her closet for many years in Canada"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/meghan-harry-surnames-rebrand-sussex-b2496690.html",
        "title": "<b>Meghan</b> and Harry ‘give children new surnames’ as rebrand continues",
        "description": "The Duke and Duchess of Sussex have given their children new names in the latest instalment of their shock rebrand. Prince Archie Mountbatten-Windsor and Princess Lilibet Mountbatten-Windsor are now known as Archie and Lilibet Sussex, a source told the Times."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/513572/meghan-markle-valentines-day-outfit-prince-harry-dinner-whistler/",
        "title": "<b>Meghan Markle</b> stuns in romantic red outfit for secret Valentine&#39;s Day date with Prince Harry",
        "description": "The Duchess of Sussex wore fashion&#39;s most romantic colour for an intimate dinner date with Prince Harry on Valentine&#39;s Day, stepping out in Whistler in a beautiful berry-hued coat."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25954775/meghan-markle-wearing-engagement-ring-disappearance/",
        "title": "<b>Meghan Markle</b> seen wearing £140k engagement ring for first time in 9 months as reason behind its disappearance revealed",
        "description": "MEGHAN Markle has been spotted wearing her £140k engagement ring for the first time in nine months. The Duchess of Sussex was seen wearing the wedding band on a trip with Prince Harry to promote"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-error-140k-ring-32132809",
        "title": "<b>Meghan Markle</b> in error as £140k ring returns after Diana&#39;s diamonds &#39;missing&#39; for months",
        "description": "Meghan Markle showed off her bling as she hit the slopes with her husband Prince Harry on Valentine&#39;s Day, with the former actress putting her engagement ring back on"
    },
    {
        "url": "https://www.thesun.ie/royals/12212684/subtle-signs-meghan-prince-harry-lost-power-couple-status/",
        "title": "<b>Meghan Markle</b>’s secret power play, as body language reveals she is ‘no longer the Invictus plus one’ but a ‘lead’",
        "description": "MEGHAN Markle gave signs to show she is “no longer just an Invictus plus one” next to Prince Harry as they promoted the 2025 games, according to a body language expert. The Duke and"
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46788055/prince-harry-meghan-markle-launch-2025-invictus-games-vancouver/",
        "title": "Prince Harry and Duchess <b>Meghan</b> Touch Down in Vancouver to Launch the 2025 Invictus Games",
        "description": "Prince Harry and Meghan Markle have made it to Canada. The Duke and Duchess of Sussex were in Vancouver on Wednesday to launch the Vancouver Whistler 2025 Invictus Games at the international sporting event’s One Year to Go celebration."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/tonya-mosley-launch-she-name-134500941.html",
        "title": "Tonya Mosley to Launch ‘She Has a Name’ Family Mystery Podcast With APM Studios",
        "description": "Fresh Air radio co-host Tonya Mosley is set to launch the She Has a Name podcast next month, about a young Detroit mother lost amid that city’s economic collapse and crack cocaine epidemic. The 10-part documentary podcast from APM Studios will kick off March 28."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13087521/Meghan-Markle-unfurled-confidently-spotlight-film-crew-followed-Sussexes-trip-Canada-Prince-Harry-looks-like-slightly-troubled-camera-performer-claims-body-language-expert.html",
        "title": "<b>Meghan Markle</b> &#39;unfurled confidently in the spotlight&#39; as film crew followed Sussexes&#39; trip to Canada - but Prince Harry &#39;still looks like a slightly troubled camera performer ...",
        "description": "The Duke and Duchess of Sussex spent Valentine&#39;s Day in Whistler, Canada, promoting the next Invictus Games while being followed by a film crew."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/fashion/meghan-markle-cream-puffer-coat-32133179",
        "title": "<b>Meghan Markle</b>’s £235 Calvin Klein puffer coat has already sold out– but we’ve found a £38 alternative",
        "description": "Meghan Markle embraced snow bunny chic during her trip to Canada in a £235 Calvin Klein puffer coat which immediately sold out, but we’ve found a £38 version in the John Lewis sale"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867089/meghan-markle-princess-diana-cartier-watch",
        "title": "Confusion mounts over whether <b>Meghan Markle</b> is wearing Princess Diana’s £18,000 watch",
        "description": "In a newly released promotional image of Meghan Markle, royal enthusiasts are unsure if the Duchess is actually wearing Princess Diana&#39;s original timepiece or her own."
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-meghan-markle-mistakes-2907121",
        "title": "<b>Meghan</b> and Harry aren’t stupid, so why do they keep making the same mistakes?",
        "description": "The Sussexes are a bright couple. They quit royal life to become financially independent. And yet they don’t seem brave enough to quit the vestiges of that royal life. The coat of arms and the titles are, they have surely come to realise, their unique selling point. Thus they are caught in something of a cleft stick."
    },
    {
        "url": "https://www.classicfm.com/composers/jenkins/karl-best-pieces-music/",
        "title": "Karl Jenkins’ best works: the Welsh composer’s most beautiful pieces of music",
        "description": "The Welsh composer’s musical output has been extraordinarily wide-ranging. While he is now best-known for his choral music, with his works like Adiemus and The Armed Man entering the repertoire of choirs worldwide, Sir Karl had his beginnings in jazz, prog rock and advertising music."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/fashion-trends/513534/meghan-markle-doen-kensington-coat/",
        "title": "<b>Meghan Markle</b>&#39;s ultra-chic coat is from a label that cool-girls can&#39;t get enough of",
        "description": "The Duchess of Sussex wore a brand loved by Selena Gomez, Taylor Swift and Kylie Jenner, to a pre-Invictus Games 2025 event"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-news-harry-meghan-markle-kate-b2496527.html",
        "title": "Royal news – live: Harry and <b>Meghan</b> hit ski slopes at Invictus Games as Charles returns from cancer treatment",
        "description": "Harry founded the Paralympic-style sporting competition in 2014 for injured and sick veterans to aid their recovery. It comes as King Charles returned from the capital to Sandringham after having his latest bout of cancer treatment and was pictured smiling with the Queen arriving at Clarence House."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/showbiz-news/prince-harry-meghan-markle-break-28636291",
        "title": "Prince Harry and <b>Meghan Markle</b> break 64-year royal tradition with children&#39;s new names",
        "description": "Meghan Markle and Prince Harry were all smiles as they held hands while launching the Invictus Games in Vancouver - as it was revealed their children have been given a new surname, ending a 64-year tr"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-harrys-simple-reason-changing-28636292",
        "title": "<b>Meghan</b> and Harry&#39;s &#39;simple&#39; reason for changing kids&#39; surnames",
        "description": "The Duke and Duchess of Sussex have rebranded their website to &quot;unify&quot; their family. The move coincides with the children starting to use the Sussex title."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-beams-pride-takes-32129371",
        "title": "<b>Meghan Markle</b> beams with pride as she takes snap of Prince Harry on slopes &#39;to show the kids&#39;",
        "description": "Meghan Markle and Prince Harry are getting ready for next year&#39;s Invictus Games with a trip to Vancouver and the Sussexes have been busy spending time on the slopes"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-goes-high-low-162246050.html",
        "title": "<b>Meghan Markle</b> Goes High-low in Calvin Klein Maxi Puffer Jacket and Cashmere in Vancouver With Prince Harry on Valentine’s Day",
        "description": "Markle has adopted quiet luxury as her personal style, often wearing minimalist and monochromatic pieces for her public appearances. On Jan. 24, she wore an all-black Carolina Herrera look at the premiere of “ Bob Marley: One Love ” in Kingston, Jamaica. For Variety Power of Women 2023 in November, she donned a beige Proenza Schouler dress."
    },
    {
        "url": "https://metro.co.uk/2024/02/15/harry-meghan-have-changed-childrens-surnames-sussex-rebrand-20284398/",
        "title": "Harry and <b>Meghan</b> have changed their children’s surnames in Sussex rebrand",
        "description": "Prince Archie, four, and Princess Lilibet, two, have been known as Archie Sussex and Lilibet Sussex since the King&#39;s coronation."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/harry-meghan-put-defiant-display-32128779",
        "title": "Harry and <b>Meghan</b> put on defiant display to hit ski slopes after website row",
        "description": "Prince Harry and Meghan Markle hold hands as they reunite in public to promote the Invictus Games in Vancouver, Canada after the Duke of Sussex&#39;s solo visit to the UK"
    },
    {
        "url": "https://www.ibtimes.co.uk/shock-royal-author-claims-prince-harry-was-love-kate-middleton-1723443",
        "title": "Shock As Royal Author Claims Prince Harry Was &#39;In Love&#39; With Kate Middleton",
        "description": "Ingrid Seward suggested that the Duke of Sussex was always there at Kensington Palace because he harboured feelings for his sister-in-law."
    },
    {
        "url": "https://www.thesun.ie/royals/12209484/prince-harry-meghan-markle-special-canada-trip/",
        "title": "<b>Meghan Markle</b> gets camera-shy for once as she moves crew aside on loved-up Invictus trip with Prince Harry",
        "description": "MEGHAN Markle appeared uncharacteristically camera-shy as she budged crew aside on her loved-up trip with Prince Harry to promote the Invictus Games. Camera crew were seen getting a little too"
    },
    {
        "url": "https://metro.co.uk/video/meghan-markle-cheers-prince-harry-tries-sit-skiing-3124857/",
        "title": "Video: <b>Meghan Markle</b> cheers on as Prince Harry tries sit-skiing",
        "description": "At an Invictus Games training camp in Whistler - in freezing temperatures around minus four degrees - Harry took a spin on a sit-ski (a seat with a single ski underneath). Sit-skis are used in para alpine skiing at the Paralympics,"
    },
    {
        "url": "https://inews.co.uk/culture/radio/meghan-markle-lemonada-podcast-2906178?ITO=msn",
        "title": "<b>Meghan Markle</b> is perfect for Lemonada’s glossy, girlboss-feminist podcast empire",
        "description": "The Duchess of Sussex&#39;s mic-friendly valley girl tones and generic empowerment language are ideal for a podcast network aiming to &#39;make life suck less&#39;"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-prince-harry-cozy-230317415.html",
        "title": "<b>Meghan Markle</b> and Prince Harry Cozy Up in Canada on Valentine&#39;s Day for Invictus Games Countdown",
        "description": "The Duke and Duchess of Sussex have arrived at the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations"
    }
]