[
    {
        "url": "https://uk.news.yahoo.com/crown-princess-victoria-sweden-dusts-215341381.html",
        "title": "Crown Princess Victoria of Sweden Dusts Off Historic Tiara for France State Visit: See the Bling!",
        "description": "Crown Princess Victoria of Sweden chose a tiara of unusual provenance for the state dinner with France. On Tuesday night, the Crown Princess, 46, slipped on the Napoleonic Cut-Ste"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512481/mike-tindall-surprise-confession-first-time-zara-tindall-didnt-talk/",
        "title": "Mike Tindall makes surprise confession about first time he met wife Zara: &#39;I didn&#39;t really talk to her&#39;",
        "description": "Mike and Zara first met in a Sydney bar during the 2003 Rugby World Cup, with Zara&#39;s cousin, Prince Harry, introducing the pair. But reflecting on their first meeting when speaking with Manish Bhasin for The Gambling Zone, Mike revealed that his emotions from being dropped from the squad clouded the day for him."
    },
    {
        "url": "https://uk.style.yahoo.com/kate-middleton-prince-williams-profiles-172333003.html",
        "title": "Kate Middleton and <b>Prince</b> William&#39;s Profiles Get a Surprise Update on the Royal Family&#39;s Website",
        "description": "The Prince and Princess of Wales aren’t the only royal family members whose profiles have been changed — so have their kids&#39; pages! Prince George, 10, Princess Charlotte, 8, and Prince Louis, 5, also received updates, and the bio photos are now the pictures released for each of their birthdays in 2023."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harrys-fresh-32012452",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s fresh &#39;slap in the face&#39; for royals as comeback fails",
        "description": "The Duke and Duchess of Sussex have made a few public appearances since King Charles and Kate Middleton&#39;s health scares this month but have failed to comment on their family members&#39; wellbeing."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861453/royal-family-live-meghan-markle-prince-harry-latest-news",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan Markle &#39;spiralling&#39; as Netflix deal in jeopardy",
        "description": "Prince Harry and Meghan Markle&#39;s future with Netflix is in jeopardy as the couple&#39;s prospects are &quot;spiralling&quot;, according to one royal expert."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fergie-sarah-ferguson-cancer-royal-family-reunited-b1135999.html",
        "title": "The royal rehabilitation of Fergie: is she finally back in from the cold?",
        "description": "After decades in exile, and despite her ongoing friendship with pariah Prince Andrew, has Sarah Ferguson has been welcomed back into the royal fold. Luciana Bellini reports"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-left-sick-due-28544912",
        "title": "Kate Middleton left &#39;sick&#39; due to little-known illness and &#39;the truth is&#39;",
        "description": "Kate joined the now-Queen Camilla, <b>Prince Harry</b> and Meghan Markle in a royal carriage on the way to the annual Trooping The Colour event. Princess Kate was reportedly &quot;feeling sick&quot; during the less-than-smooth ride, though. A source at the time said ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harrys-touching-four-word-32010863.amp",
        "title": "<b>Prince Harry</b>&#39;s touching four-word comment about George and Charlotte",
        "description": "Prince Harry - now himself a father-of-two - said the sweetest thing when he was asked about being bumped down the line of succession by William and Kate&#39;s children"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13021205/EPHRAIM-HARDCASTLE-jeopardy-childhood-run-royalty.html",
        "title": "EPHRAIM HARDCASTLE: Jeopardy! contestant recalls childhood run-in with royalty",
        "description": "It appears Prince Harry&#39;s royal hauteur is something he&#39;s nurtured since childhood. Hosting ITV&#39;s game show Jeopardy!, Stephen Fry invited contestant Archi Campbell to recall his juvenile encounter with Harry and William in a west London playground near their Kensington Palace home."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-new-32010721",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s new &#39;slap in the face&#39; for Royals as comeback misfires",
        "description": "A string of public events should have left Prince Harry and Meghan Markle with a lot to smile about but a source claims they are instead &#39;stinging from the criticism&#39;"
    },
    {
        "url": "https://uk.style.yahoo.com/martin-bashir-blamed-racism-princess-123107682.html",
        "title": "Martin Bashir Blamed Racism for Princess Diana Interview Criticism",
        "description": "Fred Prouser/ReutersMartin Bashir said in a 2020 email that he had been the subject of racist prejudice at the time of his blockbuster Panorama interview with Princess Diana by critics who were “irritated” that a “non-white” person “should have the temerity to enter a royal palace and conduct an interview."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861614/prince-harry-meghan-markle-netflix-royal-family-latest",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;making their own rules&#39; as Hollywood failure explained",
        "description": "Prince Harry and Meghan Markle&#39;s reason for &#39;failing&#39; in Hollywood have been explained by an American royal expert. Times are undoubtedly tumultuous for the Duke and Duchess of Sussex, with the pair having big-name commercial deals cancelled left and right."
    },
    {
        "url": "https://www.hellomagazine.com/homes/512430/princess-kate-fortress-style-security-features-private-home-with-three-kids/",
        "title": "Princess Kate&#39;s fortress-style security features at private family home with three kids",
        "description": "The Prince and Princess of Wales reportedly wanted to leave the &#39;goldfish bowl&#39; of London in favour of the private countryside when they moved to Adelaide Cottage in September 2022, but it also has the added advantage of allowing Kate the space to recover from her abdominal surgery away from the watchful eyes of the world."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markle-prince-harry-dealt-huge-new-blow-archewell-productions-boss-quits-1723114",
        "title": "Meghan Markle, <b>Prince Harry</b> Dealt Huge New Blow As Archewell Productions Boss Quits",
        "description": "News about his departure comes at the heels of two resignations last year. Ben Browning, an Oscar-nominated producer who led content at Archewell Productions, also left his post after his contract expired. Likewise, the company&#39;s head of marketing, Fara Taylor, left the company amid the Sussexes&#39; plans to &quot;streamline the company&#39;s marketing arm&quot;."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/features/pop-star-actors-musicians-worst-best-b2487909.html",
        "title": "The 16 best and worst pop stars turned actors",
        "description": "Victoria Beckham, to the lows of Ed Sheeran, Adam White has curated 16 music icons that have tried their hand at acting to various degrees of success"
    },
    {
        "url": "https://uk.news.yahoo.com/james-norton-bizarre-see-duke-090000634.html",
        "title": "James Norton: &#39;Bizarre&#39; to see Duke and Duchess of Sussex at Bob Marley: One Love premiere",
        "description": "James Norton found it &quot;bizarre&quot; to see the Duke and Duchess of Sussex at the Jamaican premiere of &#39;Bob Marley: One Love&#39; but thinks their presence is a sign of just how significant the movie is."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dominic-west-the-crown-season-5-reviews-b2487798.html",
        "title": "Dominic West says he ‘spent two days in bed’ after reading The Crown’s poor reviews",
        "description": "Dominic West has said he “spent two days in bed” after reading the reviews for the final season of The Crown. The 54-year-old actor played Prince Charles in the fifth and sixth seasons of Peter Morgan’s royal drama."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-suffer-32014568",
        "title": "<b>Prince Harry</b> and Meghan Markle suffer &#39;chaos&#39; behind closed doors as more staff quit",
        "description": "<b>Prince Harry</b> and Meghan Markle are facing more issues after a TV executive within their production company quits. Archewell - which the Duke and Duchess of Sussex set up in 2020 - has worked with some huge companies throughout the years, including Netflix ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022509/Archewell-exodus-staff-Harry-Meghan-production-company-Netflix-documentary.html",
        "title": "Just what IS going on behind the scenes at Archewell? Inside mass exodus from <b>Harry</b> and Meghan&#39;s production company as yet another exec leaves couple&#39;s employ",
        "description": "A lynchpin of <b>Prince Harry</b> and Meghan Markle&#39;s bombshell Netflix series has left the couple&#39;s California production company - bringing the total number of staff the Sussexes have lost since they married to at least 17. Archewell TV executive Bennett ..."
    },
    {
        "url": "https://www.hometownsource.com/forest_lake_times/spare-and-an-unusual-nonfiction-pick-top-library-s-2023-checkouts/article_2d8ffafe-c089-11ee-94ef-57379a82c545.html",
        "title": "‘Spare’ and an unusual nonfiction pick top library’s 2023 checkouts",
        "description": "When the Hardwood Creek Library team began reviewing 2023 top checkouts of inventory, many of the librarians speculated that “Spare,” Prince Harry’s memoir, would be at the top of the"
    },
    {
        "url": "https://www.btimesonline.com/articles/163676/20240201/prince-harrys-ex-pal-criticizes-dukes-victim-mentality-in-unpublished-letter.htm",
        "title": "<b>Prince Harry</b>&#39;s Ex-Pal Criticizes Duke&#39;s &#39;Victim Mentality&#39; in Unpublished Letter",
        "description": "A former friend of Prince Harry, writing under the pseudonym Edward Charles Featherstone, has voiced strong disapproval of the Duke of Sussex&#39;s portrayal of himself as a victim in his contentious memoir,"
    },
    {
        "url": "https://uk.style.yahoo.com/another-royal-taking-short-break-203225685.html",
        "title": "Another Royal Is Taking a Short Break from Duties as King Charles, Kate and William Are Sidelined",
        "description": "While King Charles and Princess Kate recover from surgery, Prince William is taking time off to support his wife — but who is left to represent the royals?"
    },
    {
        "url": "https://nypost.com/2024/01/31/entertainment/prince-harry-warned-to-lay-off-kate-middleton-as-meghan-markle-prepares-for-explosive-memoir/",
        "title": "<b>Prince Harry</b> warned to ‘lay off’ Kate Middleton as Meghan Markle prepares for ‘explosive’, ‘inevitable’ memoir: ex-butler",
        "description": "Former royal butler Paul Burrell claims it’s “inevitable” for the Duchess of Sussex to “tell her side of the story” in a similar way her husband did with his memoir"
    },
    {
        "url": "https://www.mansionglobal.com/articles/mansion-global-daily-anna-paquin-stephen-moyer-list-their-custom-built-los-angeles-home-90b77ce2",
        "title": "Mansion Global Daily",
        "description": "But now the affluent Santa Maria-Santa Barbara metropolitan area on the Central Coast of California nestled between the Santa Ynez Mountains and the Pacific Ocean has ranked as the top housing market in the latest Wall Street Journal/Realtor.com Emerging Housing Markets Index, released Wednesday."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/sources-theres-reason-why-prince-174635984.html",
        "title": "Sources Say There&#39;s a Reason Why <b>Prince</b> William Is Easily Able to Care For His Kids During Kate Middleton&#39;s Health Scare",
        "description": "That is foremost in his mind.” Whether he’s motivated by his own personal experience with his father or <b>Prince Harry</b>’s well-documented struggles with King Charles, we love William’s commitment to raising his kids in a more nurturing way than the ..."
    },
    {
        "url": "https://interaksyon.philstar.com/trends-spotlights/2024/01/31/269430/prince-harry-wants-case-against-mirror-resolved-as-soon-as-possible-lawyers/",
        "title": "<b>Prince Harry</b> wants case against Mirror resolved as soon as possible — lawyers",
        "description": "LONDON — Prince Harry wants London&#39;s High Court to resolve the remainder of his lawsuit against Britain&#39;s Mirror Group Newspapers as soon as possible"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-edwards-short-break-from-royal-duties-leaves-many-people-worried-heres-why_art20985.html",
        "title": "<b>Prince</b> Edward’s short break from Royal duties leaves many people worried, here’s why",
        "description": "The Royal Family is facing another challenge as Prince Edward is taking a short break from his Royal duties. Here’s what’s"
    },
    {
        "url": "https://people.com/why-kate-middleton-children-did-not-visit-hospital-following-surgery-prince-george-princess-charlotte-prince-louis-8553593",
        "title": "Why Kate Middleton Didn&#39;t Have <b>Prince</b> George, Princess Charlotte and <b>Prince</b> Louis Visit Her in the Hospital",
        "description": "Ingrid Seward tells PEOPLE why Kate Middleton, the Princess of Wales, chose not to have her children, Prince George, Princess Charlotte and Prince Louis, visit her at the hospital following her abdominal surgery."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25609192/harry-meghan-netflix-archwell-paramount-royal-family/",
        "title": "<b>Harry</b> and Meghan ‘blatantly’ pushing Paramount deal, says expert as Archewell suffers blow &amp; Netflix collab to end soon",
        "description": "HARRY and Meghan are “blatantly” after a deal with media giant Paramount just as a key Archewell Productions member has quit. With their reported £80million Netflix deal drawing to a"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153289-prince-harry-anticipates-another-big-blow-amid-financial-woes",
        "title": "<b>Prince Harry</b> anticipates another big blow amid financial woes",
        "description": "Prince Harry has been called out for portraying himself as a &#39;victim&#39; in his explosive tell-all memoir, Spare.Edward Charles Featherstone, a pseudonym chosen by the Duke of Sussex&#39;s former"
    },
    {
        "url": "https://www.mansionglobal.com/articles/its-one-of-americas-most-expensive-cities-and-home-buyers-cant-get-enough-31bad79f",
        "title": "It’s One of America’s Most Expensive Cities, and Home Buyers Can’t Get Enough",
        "description": "A metro area on California’s central coast ranked No. 1 in the latest WSJ/Realtor.com Emerging Housing Markets Index"
    },
    {
        "url": "https://www.professionaljeweller.com/meghan-markle-dragons-den-kimai/",
        "title": "Kimaï reveals that Meghan Markle was not gifted the earrings that shot the brand to success",
        "description": "Meghan Markle has recently come under fire for accepting a free gift from Kimaï, so its founders have confirmed that she purchased the earrings"
    },
    {
        "url": "https://ca.news.yahoo.com/martin-bashir-blamed-racism-princess-123107682.html",
        "title": "Martin Bashir Blamed Racism for Princess Diana Interview Criticism",
        "description": "Fred Prouser/ReutersMartin Bashir said in a 2020 email that he had been the subject of racist prejudice at the time of his blockbuster Panorama interview with Princess Diana by critics who were “irritated” that a “non-white” person “should have the temerity to enter a royal palace and conduct an interview."
    },
    {
        "url": "https://uk.news.yahoo.com/unpacking-very-emotional-ending-us-121000857.html",
        "title": "Unpacking that very emotional ending of All Of Us Strangers",
        "description": "If you&#39;ve just finished All Of Us Strangers and need to unpack the ending of the film, then this is the full ending explained."
    },
    {
        "url": "https://www.heraldsun.com.au/entertainment/celebrity-life/royals/prince-harrys-former-polo-playing-friend-threatens-to-publish-damaging-letter/news-story/6b0120919095c66ede8874731d241f74",
        "title": "<b>Prince Harry</b>’s former polo playing friend threatens to publish damaging letter",
        "description": "A former polo mate of Prince Harry has threatened to publish a damaging letter about the royal that could include shock revelations."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/royal-family-dianas-ex-butler-paul-burrell-makes-new-wild-claims-about-the-future-of-the-monarchy_art20967.html",
        "title": "Royal Family: Diana’s ex-butler Paul Burrell makes new wild claims about the future of the monarchy",
        "description": "Paul Burrell is known for his closeness with Princess Diana and since her death the former butler has been making headlines with his wide claims. Here are his new"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25622609/pippa-middletons-unusual-7k-gift-prince-george/",
        "title": "Pippa Middleton’s unusual £7k gift to <b>Prince</b> George – but some think it’s plain creepy",
        "description": "PIPPA Middleton has divided opinion after reportedly gifting her nephew Prince George a “creepy” Christening gift – and it set her back a whopping £7,000. From toys and blankets,"
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-infamous-gesture-king-charles-coronation-1865252",
        "title": "Meghan Markle&#39;s &#39;Infamous&#39; Gesture Compared to Royal Pageantry",
        "description": "Meghan Markle performing her famous mock curtsy during her Netflix show has been compared to King Charles&#39; coronation."
    },
    {
        "url": "https://uk.yahoo.com/news/martin-bashir-diana-interview-timeline-095647005.html",
        "title": "Martin Bashir’s Diana interview: A timeline of the scandal",
        "description": "Nearly 30 years later, it has only served as a royal headache for the BBC, as a 2021 report found that Mr Bashir had obtained the interview through deceit, after forging bank statements that implied Diana was being spied on by members of her household staff."
    },
    {
        "url": "https://www.radiotimes.com/technology/gaming/suicide-squad-kill-the-justice-league-cast/",
        "title": "Suicide Squad game cast: Kill the Justice League voice actors",
        "description": "Jason Isaacs is a multimedia industry veteran. Isaacs is best known for playing Lucius Malfoy in the Harry Potter film series. He also played Lord Enver Gortash in Baldur’s Gate 3 and Reza Zaydan in the rebooted Hitman Trilogy."
    },
    {
        "url": "https://www.newsweek.com/prince-william-prince-harry-moment-unity-viral-video-tiktok-1865495",
        "title": "<b>Prince</b> William and <b>Prince Harry</b>&#39;s Moment of Unity Goes Viral",
        "description": "Prince William and Prince Harry &#39;s moment of fraternal unity following the death of their grandmother, Queen Elizabeth II, has featured in a new viral video, as footage from the late monarch&#39;s lying-in-state period has resurfaced on social media site TikTok."
    },
    {
        "url": "https://metro.co.uk/2024/01/31/martin-bashir-blamed-irritation-around-diana-interview-racism-20199769/?ico=related-posts",
        "title": "Martin Bashir blamed ‘irritation’ around Diana interview scandal on racism",
        "description": "Martin Bashir claimed that there was ‘jealousy’ following his scandalous Panorama interview with Princess Diana, and blamed ‘irritation’ around the conversation on racism. In 1995, the Princess of Wales sat down for an interview with the journalist about her life,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153306-prince-harry-meghan-markles-tone-deaf-move-fuels-rift-with-royal-family",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s &#39;tone-deaf&#39; move fuels rift with royal family",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s recent &#39;insensitive&#39; trip to Jamaica reportedly fueled their woes with the royal family. For the unversed, the Duke and Duchess of Sussex made a surprising appearance at the premiere of &quot;Bob Marley: One Love&quot; on January 23."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-demanded-prince-harry-put-her-ahead-royal-family-insider.html/",
        "title": "Meghan Markle ‘Demanded’ <b>Prince Harry</b> Put Her Ahead of Royal Family: Insider",
        "description": "<b>Prince Harry</b> had to make some hard choices regarding his marriage to Meghan Markle. A royal insider claims that the Duchess of Sussex “demanded” her husband put her ahead of the royal family. Here’s why. Royal insider Angela Levin believes <b>Prince</b> ..."
    }
]