[
    {
        "url": "https://uk.news.yahoo.com/prince-william-personally-arranged-windsor-230756030.html",
        "title": "<b>Prince</b> William personally arranged Windsor walkabout with <b>Prince Harry</b> after late Queen’s death",
        "description": "The Prince of Wales personally arranged a Windsor walkabout with his wife, brother and sister-in-law after the death of Queen Elizabeth II, calling it “awkward” but the right thing to do for his beloved grandmother,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1855449/prince-harry-meghan-Ellen-DeGeneres",
        "title": "<b>Prince Harry</b> and Meghan Markle welcome new family member after rescuing them from bullies",
        "description": "The new addition will live on the grounds of the pair&#39;s Montecito mansion after being saved from celeb pal Ellen DeGeneres."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/denmarks-prince-harry-arrive-alone-31875657.amp",
        "title": "Denmark&#39;s own <b>Prince Harry</b> to arrive alone without family to watch brother become king",
        "description": "If you think it&#39;s complicated between Prince William and his brother Harry, Prince Frederik and his younger sibling Joachim&#39;s relationship is said to be even more toxic"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511190/prince-harry-meghan-markle-adopt-pet-chicken-ellen-degeneres-reveals/",
        "title": "<b>Prince Harry</b> and Meghan Markle welcome new family member at Montecito home",
        "description": "Prince Harry and Meghan Markle have welcomed a new family member! Adding to the flock at their Montecito home, the royal couple has adopted Sinkie – an ailing chicken previously owned by their good friend and neighbor, Ellen DeGeneres ."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25351840/king-frederik-of-denmark-young-wife-children/",
        "title": "Crown <b>Prince</b> Frederik of Denmark: A look at his journey from young ‘party <b>prince</b>’ to becoming King",
        "description": "CROWN Prince Frederik of Denmark is taking over from his mother as head of the Danish Royal Family. Queen Margrethe II announced on December 31, 2023, that she was abdicating the throne –"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12959691/prince-harry-meghan-markle-adopt-ellen-degeneres-chicken-montecito.html",
        "title": "<b>Prince Harry</b> and Meghan Markle adopt Ellen DeGeneres&#39; chicken named &#39;Sinkie&#39; after being bullied by her flock - and will now live out her days at the couple&#39;s $14.5million ...",
        "description": "<b>Prince Harry</b> and Meghan Markle have adopted one of Ellen DeGeneres&#39; ailing chickens which was being bullied. The former talk show host, whose sprawling $25 million Montecito compound is just a five minute drive from the Duke and Duchess of Sussex&#39;s $14.5 ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25336768/meghan-markle-prince-harry-ticking-timebomb-netflix/",
        "title": "Meghan Markle and <b>Harry</b> ‘face ticking timebomb’ after cutting royal purse strings as £78m Netflix deal to end in months",
        "description": "MEGHAN Markle and Prince Harry face a “ticking timebomb” as their “Hollywood dreams are falling apart”, a royal expert has claimed. The Duke and Duchess of Sussex have just a year left"
    },
    {
        "url": "https://www.ok.co.uk/royal/william-kate-george-charlotte-louis-31833672",
        "title": "Kate and William&#39;s genius plan to ensure <b>Prince</b> Louis&#39; life is different from <b>Harry</b> and Andrew&#39;s",
        "description": "The Prince and Princess of Wales are devoted parents to their three young children with one royal expert explaining what the couple&#39;s plan will be for the future to avoid problems of the past"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-terrified-williams-screaming-shouting-31874172",
        "title": "<b>Harry</b> &#39;terrified&#39; at William&#39;s &#39;screaming and shouting&#39; at emergency meeting",
        "description": "Prince Harry has shared how his brother William &quot;screamed and shouted at him&quot; in the infamous Sandringham Summit."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511175/why-princess-kate-didnt-fly-balmoral/",
        "title": "Why Princess Kate didn&#39;t fly to Balmoral to be with Queen Elizabeth II revealed",
        "description": "It&#39;s no secret that Princess Kate didn&#39;t fly to Balmoral to be with Queen Elizabeth II upon news she had taken a turn for the worse on 7 September 2022, but the reason may not be what you expect."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1855343/prince-harry-prince-william-summit-terrified-screaming",
        "title": "<b>Prince Harry</b> left &#39;terrified&#39; by &#39;screaming and shouting&#39; <b>Prince</b> William at intense summit",
        "description": "Despite Prince Harry&#39;s claims in the bombshell Netflix series, Harry &amp; Meghan, that William &quot;screamed&quot; at him, there was no mention of it in his book, Spare."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12952097/Solo-family-occasion-critical-royals-remind.html",
        "title": "A brief, lonely presence at a major family occasion...A &#39;spare&#39; who&#39;s been openly critical of his family...Does <b>Prince</b> Joachim&#39;s solo trip to see his brother made King of ...",
        "description": "We can expect to see the Danish royal family out in force, along with leading lights of Danish society. Not quite everyone will be there,"
    },
    {
        "url": "https://uk.news.yahoo.com/princess-wales-reason-not-seeing-160504151.html",
        "title": "Princess of Wales&#39; reason for not seeing Queen at Balmoral revealed in new book",
        "description": "The Princess of Wales did not go to Balmoral with Prince William for the Queen’s death because she wanted to look after their children, a book has claimed. Royal biography Charles III: New King, New Court. The Inside Story is published next week and early excerpts have also said the new monarch was out picking mushrooms when the Queen died."
    },
    {
        "url": "https://www.itv.com/news/2024-01-13/what-queens-peaceful-final-hours-looked-like-according-to-new-memo",
        "title": "What the Queen&#39;s &#39;peaceful&#39; final hours looked like, according to her private secretary",
        "description": "The Queen &quot;slipped away in her sleep&quot; in &quot;very peaceful&quot; death, a new memo by her private secretary revealed. | ITV National News"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/uk/queen-elizabeth-left-sealed-deathbed-letter-for-king-charles-who-was-caught-out-by-her-deterioration-says-new-book/a47326422.html",
        "title": "Queen Elizabeth ‘left sealed deathbed letter’ for King Charles who was ‘caught out’ by her deterioration, says new book",
        "description": "King Charles learned about the Queen’s death when leaving her side at Balmoral to go and pick mushrooms, a new book has revealed."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/this-is-what-king-charles-was-allegedly-doing-when-queen-elizabeth-died-new-book-claims_art20753.html",
        "title": "This is what King Charles was allegedly doing when Queen Elizabeth died, new book claims",
        "description": "It has been over a year since Queen Elizabeth passed away. A new book has revealed what King Charles was doing in her final"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-meghan-firmly-denied-request-31873283",
        "title": "<b>Harry</b> and Meghan &#39;firmly denied&#39; request for &#39;inappropriate&#39; home by Queen Elizabeth",
        "description": "Prince Harry and Meghan Markle were reportedly interested in another home on the Windsor estate. Get the latest entertainment news sent straight to your inbox with our weekly Showbiz newsletter Before Harry and Meghan found their £11million California dream home, the couple lived as newlyweds in Frogmore Cottage."
    },
    {
        "url": "https://www.independent.co.uk/asia/east-asia/brunei-prince-abdul-mateen-marriage-b2478100.html",
        "title": "Brunei’s polo-playing <b>Prince</b> Abdul Mateen marries entrepreneur fiancée in lavish 10-day celebration",
        "description": "This picture taken by Brunei&#39;s Information Department on 10 January 2024 shows Brunei&#39;s Sultan Hassanal Bolkiah, centre right, greeting Brunei&#39;s Prince Abdul Mateen&#39;s, center, during the royal powdering ceremony at Istana Nurul Iman, ahead of his wedding to Anisha Rosnah, in Bandar Seri Begawan, Brunei"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/inside-george-clooneys-friendship-prince-28441745",
        "title": "Inside George Clooney&#39;s friendship with <b>Prince Harry</b> and Meghan before &#39;ditching&#39;",
        "description": "They were just two of a string of celebrities invited to celebrate <b>Prince Harry</b> and Meghan Markle&#39;s wedding in 2018. But just a few years later, the 62-year-old&#39;s blossoming friendship with the pair seemed to have fizzled out. The Ocean’s Eleven star ..."
    },
    {
        "url": "https://www.cinemablend.com/superheroes/batman/every-major-movie-portrayal-of-the-joker-ranked",
        "title": "Every Major Movie Portrayal Of The Joker, Ranked",
        "description": "Like another version of The Joker on this list, Cesar Romero primarily portrayed the character on television, namely the live-action Batman TV series that ran from 1966 to 1968. But shortly after Season 1 aired, Batman: The Movie hit theaters, and as such Romero qualifies for the rankings."
    },
    {
        "url": "https://www.thedailybeast.com/ellen-degeneres-bullied-chicken-gets-royal-treatment-at-meghan-and-harrys-coop",
        "title": "Ellen Degeneres’ Bullied Chicken Gets Royal Treatment From <b>Harry</b> and Meghan",
        "description": "Instead of walking on eggshells around her poultry pals, the bullied bird will now get the royal treatment after Harry and Meghan, who live just five minutes away from DeGeneres and de Rossi, agreed to take the bird in."
    },
    {
        "url": "https://www.dw.com/en/something-common-in-the-state-of-denmark-a-world-of-royals/a-67972921",
        "title": "Across the world, monarchs continue to reign",
        "description": "Denmark is getting a new king. Despite transitions toward democracy, royalty abounds worldwide, and some monarchs enjoy absolute rule."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/13/65a2f8ac268e3ef45e8b45c0.html",
        "title": "Britain&#39;s richest woman, Denise Coates, raises her salary to $280 million a year",
        "description": "They say that talking about money in certain environments is not very polite, but there comes a point at which talking about money in terms of billions of dollars becomes ridiculou"
    },
    {
        "url": "https://www.stuff.co.nz/life-style/royals/301039454/no-phones-at-the-table-the-private-life-of-crown-princess-mary",
        "title": "No phones at the table: The private life of Crown Princess Mary",
        "description": "Several Danish royal commentators have this week described Mary&#39;s role in the transformation of her husband&#39;s public profile as vital."
    },
    {
        "url": "https://nypost.com/2024/01/13/entertainment/revealed-why-kate-middleton-wasnt-at-balmoral-when-queen-elizabeth-died/",
        "title": "Revealed: Why Kate Middleton wasn’t at Balmoral when Queen Elizabeth died",
        "description": "As Queen Elizabeth lay dying in September 2022, royals raced to be by her side at Balmoral Castle. Prince William quickly jetted from England to the Scottish estate, alongside Prince Andrew and Prince Edward. However, Princess Kate did not join them, sparking speculation that she was not extended an invitation by the family."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/princess-marys-astounding-payday-as-she-becomes-queen/news-story/0eba8461e4e8e4601e33e806b69f1ef2",
        "title": "Princess Mary’s astounding payday as she becomes Queen",
        "description": "<b>Prince</b> Joachim of Denmark (right), &quot;chucked a <b>Harry</b>&quot; and went straight to the media when his mother announced that his children would lose their royal titles. Picture: Chris Jackson – WPA Pool/Getty Images This significant disparity between Mary’s ..."
    },
    {
        "url": "https://www.samaa.tv/208737993-prince-harry-and-meghan-markle-struggle-to-maintain-influence-in-us",
        "title": "<b>Prince Harry</b> and Meghan Markle struggle to maintain influence in US",
        "description": "Schofield revealed to The Express that the couple&#39;s influence has become &quot;fragile,&quot; with the duo striving to be recognized as authoritative figures in their new home. Notably, American publications have reportedly started referring to them by their names rather than their royal titles,"
    },
    {
        "url": "https://www.smh.com.au/world/europe/seven-kingdoms-what-to-know-about-the-queens-and-kings-of-europe-and-our-mary-20240110-p5ewd4.html",
        "title": "Seven Kingdoms: What to know about the queens and kings of Europe (and our Mary)",
        "description": "The Danish monarchy has existed for more than 1000 years. Each of the royal families is vast and diverse. But they all have one thing in common: a shared ancestor."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1147598-meghan-markle-prince-harrys-tactic-of-being-silent-damaged-their-image",
        "title": "Meghan Markle, <b>Prince Harry</b>&#39;s tactic of being &#39;silent&#39; damaged their image",
        "description": "Meghan Markle and Prince Harry have been accused of being &#39;guilty&#39; due to their deafening silence over the royal race row.In conversation with Express.co.uk, PR strategist Laura Perkes claimed"
    },
    {
        "url": "https://www.samaa.tv/208737992-how-duchess-kate-emerges-victorious-amid-royal-controversy",
        "title": "How Duchess Kate emerges victorious amid royal controversy",
        "description": "Former adviser on Great Britain to the US House of Representatives, Lee Cohen, spoke exclusively to GB News, praising Duchess Kate for her unwavering composure in the face of what he termed as &quot;appalling conduct&quot; from across the pond."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middletons-reaction-disgust-sees-meghan-markle-first-time-oprah-interview-caught-camera.html/",
        "title": "Kate Middleton’s Reaction of Disgust When She Sees Meghan Markle for the First Time After Oprah Interview Caught on Camera",
        "description": "See video of Kate Middleton looking disgusted just before she had to do a walkabout with Meghan Markle for the first after the Sussexes&#39; Oprah interview."
    },
    {
        "url": "https://nypost.com/2024/01/13/entertainment/meghan-markle-smart-to-join-suits-reboot-but-shouldnt-be-greedy-with-salary-pr-guru/",
        "title": "Meghan Markle ‘smart’ to join ‘Suits’ reboot — but shouldn’t be ‘greedy’ with salary: PR guru",
        "description": "PR guru Ryan McCormick says it would be a “smart career move” for the Duchess of Sussex, 42, to return to the screen four years after fleeing the British royal family."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/prince-harry-meghan-markle-reportedly-170000350.html",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle Are Reportedly Close Pals With an A-Lister Who Knew Princess Diana",
        "description": "No matter what different outlets report, it’s pretty clear that Prince Harry and Meghan Markle do have quite a few A-list buddies. Not only are they best buddies with power couple Katy Perry and Orlando Bloom,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163259/20240114/kate-middleton-focuses-on-future-shrugs-off-prince-harry-and-meghan-drama.htm",
        "title": "Kate Middleton Focuses on Future, Shrugs Off <b>Prince Harry</b> and Meghan Drama",
        "description": "Kate Middleton, the Princess of Wales, is charting a course toward a future unburdened by the past feuds that have embroiled the Royal Family. As she celebrated her 42nd birthday on January 9, sources close to the princess indicate a determined effort to leave behind the drama stirred by Prince Harry and Meghan Markle&#39;s public disclosures."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/napoleon-coronation-scene-inspired-jacques-211000100.html",
        "title": "How ‘Napoleon’ Coronation Scene Was Inspired By Jacques-Louis David’s 1807 Painting",
        "description": "Napoleon” costume designers divvied up their tasks, with Janty Yates concentrating on French civilian wear and David Crossman on evolving military outfits. The Ridley Scott epic follows Napoleon Bonaparte’s (Joaquin Phoenix) rise from general to emperor."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1147590-prince-harry-meghan-markle-warned-of-real-problem-ahead",
        "title": "<b>Prince Harry</b>, Meghan Markle warned of &#39;real problem&#39; ahead",
        "description": "Prince Harry and Meghan Markle could face a real problem if they don&#39;t move away from attacking the royal family, an expert has warned.Royal author Tom Bower has claimed the Duke and Duchess"
    },
    {
        "url": "https://evoke.ie/2024/01/13/entertainment/mike-tindall-polo-zara",
        "title": "Mike Tindall keeps up tradition at the polo as he and Zara mingle with <b>Prince Harry</b>&#39;s pals",
        "description": "What would a day out be without trying on your wife&#39;s fascinator? Well, not complete if you&#39;re Mike and Zara Tindall who have made it a tradition."
    },
    {
        "url": "https://www.livemint.com/news/world/prince-harry-reveals-secret-code-with-prince-william-in-tell-all-memoir-spare-report-11705110037494.html",
        "title": "<b>Prince Harry</b> reveals secret code with <b>Prince</b> William in tell-all memoir Spare: Report",
        "description": "Prince Harry reveals secret code with brother Prince William in memoir &#39;Spare&#39; connected to late mother Princess Diana."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/page-281/",
        "title": "Royal family",
        "description": "Duke’s spokesperson declined to comment on the verdict but several sources in his camp have acknowledged that it can only help their case"
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-5-glamorous-red-carpet-moments-fashion-1859066",
        "title": "Meghan Markle&#39;s 5 Most Glamorous Red Carpet Moments",
        "description": "Since marrying Prince Harry in 2018, Meghan has walked the red carpet at a number of high profile public events."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-plan-enroll-son-archie-kindergarten-class-filled-celebrity-kids-author.html/",
        "title": "<b>Prince Harry</b> and Meghan Markle’s Kindergarten Plans for Archie Will Likely Be Star-Studded, Author Says",
        "description": "According to a royal author, Prince Archie, the 4-year-old son of Prince Harry and Meghan Markle will be at an &#39;exclusive&#39; kindergarten."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/prince-harry-to-be-named-living-legend-of-aviation/",
        "title": "<b>Prince Harry</b> to be named ‘Living Legend of Aviation’",
        "description": "Prince Harry is to set be inducted into the Living Legends of Aviation Hall of Fame in the USA, later this month."
    },
    {
        "url": "https://www.lbc.co.uk/news/real-reason-kate-middleton-not-travel-balmoral-day-queen-died/",
        "title": "The real reason Kate Middleton did not travel to Balmoral on day Queen Elizabeth died",
        "description": "The real reason Kate Middleton did not travel with Prince William on the day Queen Elizabeth died has been revealed."
    },
    {
        "url": "https://www.ok.co.uk/royal/inside-harry-meghans-sprawling-garden-31866399",
        "title": "Inside <b>Harry</b> and Meghan&#39;s sprawling garden with pool at £23.6m California mansion",
        "description": "Prince Harry and Meghan Markle have given fans a glimpse of their incredible garden at their £23.6 million mansion in Montecito, California, which is perfect for their kids"
    },
    {
        "url": "https://hollywoodlife.com/2024/01/12/queen-elizabeths-final-moments-revealed-in-newly-released-memo/",
        "title": "Queen Elizabeth II’s Final ‘Peaceful’ Moments Revealed in Newly Released Memo by Her Secretary",
        "description": "A new memo reveals that the last moments of life for Queen Elizabeth II were &#39;very peaceful.&#39;"
    },
    {
        "url": "https://uk.news.yahoo.com/why-kate-middleton-didn-t-013305521.html",
        "title": "Why Kate Middleton Didn’t Go to Balmoral with <b>Prince</b> William as Queen Elizabeth Lay Dying",
        "description": "As William, 41, and other members of the royal family rushed to be by the Queen&#39;s side in Balmoral after doctors announced they were &quot;concerned&quot; for her health, the soon-to-be Princess of Wales, 42, chose to stay home in Windsor with the couple’s children, Prince George , Princess Charlotte, and Prince Louis."
    },
    {
        "url": "http://tsss.ca/uncategorized/queen-charles-iii-grandchildren-reach-westminster",
        "title": "Queen Charles III, Grandchildren Reach Westminster Hall",
        "description": "Meghan Markle finds Westminster Abbey on the State Funeral off King E II toward . Brand new Duchess off Sussex arrived in a motor vehicle with <b>Prince Harry</b>, which upcoming entered a parade at the rear of brand new coffin. Christopher Furlong/Getty Pictures ..."
    }
]