[
    {
        "url": "https://www.dailymail.co.uk/debate/article-12971211/EPHRAIM-HARDCASTLE-Prince-Harrys-Living-Legends-Aviation-award-Prince-Philip-rotating-grave.html",
        "title": "EPHRAIM HARDCASTLE: <b>Prince Harry</b>&#39;s Living Legends of Aviation award would have <b>Prince</b> Philip rotating in his grave",
        "description": "Harry&#39;s Living Legends of Aviation awards on Friday would have his grandfather Philip rotating in his grave. He gained his RAF wings in 1953 and flew for 44 years."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/hurt-meghan-harry-ditch-emmys-31898472",
        "title": "Hurt Meghan and <b>Harry</b> ditch Emmys after Netflix show snubbed last year",
        "description": "Meghan and Harry fans across the world were &quot;100% certain&quot; they would after debuting one of the most talked-about shows of the year."
    },
    {
        "url": "https://www.hellomagazine.com/tags/prince-harry/6/",
        "title": "<b>Prince Harry</b> - Page 7",
        "description": "Get the latest news, pictures &amp; interview features with The Invictus Games founder Prince Henry of Wales today at HELLO! Magazine"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25386946/lilibet-name-queen-harry-relationship/",
        "title": "Palace’s ‘Lilibet’ revenge on <b>Harry</b> was ‘served cold’ &amp; gives fascinating insight into his relationship with Queen",
        "description": "WHEN Palace aides came for Prince Harry, their revenge was served cold – and with clinical brutality. Some two years after the wayward Duke made wild claims about what his grandmother may or may"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/16/harry-meghan-lilibet-row-queen-elizabeth-nickname/",
        "title": "How using ‘Lilibet’ became <b>Harry</b> and Meghan’s final insult to Queen Elizabeth",
        "description": "In recycling the affectionate moniker, the Duke and Duchess of Sussex may have broken royal protocol and widened a family rift"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-dianas-will-was-changed-after-her-death-heres-why_art20793.html",
        "title": "Princess Diana’s will was changed after her death, here’s why",
        "description": "Princess Diana died in 1997 and left her children, Prince William and Prince Harry a sizable inheritance, however, Diana’s will was changed after her"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/16/harrison-ford-john-travolta-living-legends-of-aviation-prince-harry",
        "title": "If Harrison Ford and John Travolta can be crowned living legends of aviation, why not <b>Prince Harry</b>?",
        "description": "In dark times, these are the heroes we need: one crash-landed, the other has a Boeing 707 in his driveway. The prince is in good company, says Guardian columnist Marina Hyde"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-royal-family-could-face-another-blow-from-him-royal-expert-claims_art20791.html",
        "title": "<b>Prince Harry</b>: Royal Family could face another blow from him, royal expert claims",
        "description": "Amidst this, a royal expert has claimed that the book has backfired. This comes as Prince Harry’s reputation lies in tatters and his relationship with his family is left irreparable, claims The Sun. Royal expert Jennie Bond shared:"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511395/princess-anne-breaks-silence-over-coronation-hat-prince-harry/",
        "title": "Princess Anne breaks silence over &#39;decent-sized hat&#39; blocking <b>Prince Harry</b>&#39;s view at coronation",
        "description": "The Princess Royal reportedly raised concerns about her &quot;decent-sized hat&quot; which ended up blocking Prince Harry &#39;s view at King Charles&#39; coronation last May. Princess Anne&#39;s towering, feathered hat which appeared to block her nephew Harry&#39;s view during the service sparked various memes on social media at the time."
    },
    {
        "url": "https://uk.news.yahoo.com/princess-anne-questioned-wearing-hat-162521775.html",
        "title": "Princess Anne Questioned Wearing Hat That Blocked <b>Prince Harry</b> at Coronation: &#39;Not My Choice&#39;",
        "description": "Princess Anne raised concerns about wearing a hat that blocked <b>Prince Harry</b>, who sat behind her at the coronation, according to a new book. The plume of the hat covered the Duke of Sussex&#39;s face from certain angles, making headlines. Royal author Robert ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12968971/Princess-Anne-raised-concerns-decent-sized-hat-blocked-Prince-Harrys-view-Kings-Coronation-told-wear-organisers-new-book-reveals.html",
        "title": "Princess Anne raised concerns over &#39;decent-sized hat&#39; that blocked <b>Prince Harry</b>&#39;s view at King&#39;s Coronation but was told to wear it by organisers, new book reveals",
        "description": "In Robert Hardman&#39;s new book, Princess Anne defends herself, explaining she had changed seats at the last minute in the hopes of a &#39;speedy exit&#39;."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/16/royal-nicknames-why-camilla-is-called-lorraine-and-charles-isnt-happy",
        "title": "Royal nicknames: why Camilla is called ‘Lorraine’ - and Charles isn’t happy",
        "description": "What’s in a nickname? A right royal ruckus, when it comes to the affectionate monikers used for both our current and former queens"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/meghan-markle-not-earnt-right-9038266",
        "title": "Meghan Markle had not &#39;earnt the right&#39; to name daughter Lilibet claims expert",
        "description": "Meghan Markle and Prince Harry reportedly left the Queen &#39;furious&#39; when they named their daughter Lilibet, with one expert saying the Duchess &#39;stamped&#39; her personality on the moniker"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-baby-name-drama-31893693",
        "title": "<b>Prince Harry</b>’s baby name drama ‘deepens rift’ between him and Royal Family, expert says",
        "description": "The row began when it was claimed in a new book the Queen was ‘angry’ when she told Harry and Meghan had named their daughter Lilibet, after the late monarch’s childhood nickname"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-branded-not-legend-9038132",
        "title": "<b>Prince Harry</b> branded &#39;not a legend&#39; as furious backlash erupts over Hollywood honour",
        "description": "Prince Harry is set to be honoured at a star-studded ceremony in Los Angeles later this month, but many have questioned how the Duke of Sussex has qualified for the prestigious award"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856091/royal-family-live-meghan-markle-prince-harry-lilibet-name",
        "title": "Royal Family LIVE: Meghan Markle and <b>Prince Harry</b> ‘rebuffed’ by palace after bombshell",
        "description": "One royal historian claimed the late Queen Elizabeth II was incredibly angry about how Harry and Meghan had handled the situation around their daughter&#39;s name."
    },
    {
        "url": "https://www.ok.co.uk/royal/queen-lilbert-name-harry-meghan-31892980",
        "title": "Queen&#39;s furious exact words over naming of Lilibet by <b>Prince Harry</b> and Meghan Markle",
        "description": "The Queen was allegedly unhappy over Prince Harry and Meghan Markle using her nickname, Lilibet, as their daughter&#39;s name – despite the pair claiming to have asked for permission"
    },
    {
        "url": "https://www.itv.com/news/2024-01-15/late-queens-anger-over-claim-by-harry-and-meghan-about-naming-lilibet",
        "title": "Late Queen’s ‘anger’ over claim by <b>Harry</b> and Meghan about naming Lilibet",
        "description": "The late Queen was furious after the Duke and Duchess of Sussex claimed they had her blessing to call their daughter Lilibet, a royal aide has said. In his new biography of the King Charles III, royal author Robert Hardman, tells how a member of staff said Elizabeth II was “as angry as I’d ever seen her&quot; after the announcement."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-spare-sequel/",
        "title": "Buckingham Palace fears <b>Prince Harry</b> will release sequel to bombshell memoir Spare after he &#39;leaves out key events&#39;",
        "description": "Buckingham Palace fears Harry could release a sequel to Spare because &quot;large chunks&quot; from recent events were left out."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856301/prince-harry-book-royal-family-meghan-markle",
        "title": "<b>Prince Harry</b> warned against following &#39;poisonous path&#39; with second bombshell book",
        "description": "Prince Harry had said in an interview following the release of his memoir in January 2023 that he had enough material to write &quot;two books&quot;."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/emmys-2024-watch-awards-succession-the-bear-b2479214.html?page=9",
        "title": "Emmys 2024 live: Succession and The Bear sweep awards as night ends with huge on-stage snog",
        "description": "The show with the most nominations was Succession, the fourth and final season of which aired on HBO last year. The drama took home six awards. Fellow HBO dramas The Last of Us and The White Lotus were also heavily nominated, but failed to compete in terms of wins on the night."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25375802/palace-fears-prince-harry-spare-sequel/",
        "title": "Palace ‘fears <b>Harry</b> will write damaging sequel to Spare’ after spotting 3 major questions he hasn’t answered",
        "description": "PRINCE Harry may release a sequel to Spare after leaving out “large chucks” of three key events, Buckingham Palace fears. The bombshell memoir hit shelves just over a year ago, and"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-archie-lilibet-expected-excellent-103903745.html",
        "title": "<b>Prince</b> Archie and Lilibet expected to take “excellent care” of the ‘beautiful’ new addition to their family (royal title TBC)",
        "description": "Prince Archie has welcomed a new addition to the family as celebrity neighbour Ellen DeGeneres gives up one of her beloved chickens, revealing it has joined the Sussexes&#39; flock."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-slammed-furious-pilots-31890356",
        "title": "<b>Prince Harry</b> slammed by furious pilots calling for his Flying Legend award to be scrapped",
        "description": "Prince Harry served in the military for 10 years, and was a helicopter co-pilot and gunner during his time in the British Army for two tours of Afghanistan in 2008 and 2012 but"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markle-welcome-new-member-family-1722760",
        "title": "<b>Prince Harry</b>, Meghan Markle Welcome New Member To Family",
        "description": "Prince Harry and Meghan Markle have welcomed a new member to their family of chickens at their mansion in Montecito, Santa Barbara, California."
    },
    {
        "url": "https://www.thesun.ie/royals/12008152/palace-fears-prince-harry-spare-sequel/",
        "title": "Palace ‘fears <b>Harry</b> will write damaging sequel to Spare’ after after spotting 3 major questions he hasn’t answered",
        "description": "PRINCE Harry may release a sequel to Spare after leaving out “large chucks” of three key events, Buckingham Palace fears. The bombshell memoir hit shelves just over a year ago, and"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-suffer-31892890",
        "title": "Meghan Markle and <b>Prince Harry</b> suffer &#39;devastating&#39; snub at Emmy Awards",
        "description": "<b>Prince Harry</b> and Meghan Markle are moving onto bigger and better things after their brutal Emmy Award snub. The Duke and Duchess of Sussex made a comeback to Hollywood in 2022 with their bombshell Netflix documentary series, <b>Harry</b> &amp; Meghan. The shocking ..."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/meghan-and-harry-reportedly-wounded-by-awards-show-snub-235939654.html",
        "title": "Meghan and <b>Harry</b> reportedly &#39;wounded&#39; by awards show snub",
        "description": "Prince Harry and Meghan Markle reportedly feel &#39;wounded&#39; after being snubbed for an award at the Emmys this year. Read more."
    },
    {
        "url": "https://radaronline.com/p/harry-meghan-need-original-ideas-make-break-year-hollywood-executive/",
        "title": "<b>Prince Harry</b>, Meghan Markle in Dire Need of &#39;Original Ideas&#39; for &#39;Make or Break&#39; Year, Hollywood Exec Says",
        "description": "Prince Harry and Meghan Markle need to find their niche and come up with &quot;original ideas,&quot; said a Hollywood exec."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/princess-anne-told-staffer-it-would-be-the-last-time-they-embraced-after-employee-asked-for-hug-after-queen-elizabeths-death-report/news-story/b6c562d0d2fe876a9c9484ab26f0c6c6",
        "title": "Princess Anne told staffer it would be the ‘last time’ they embraced after employee asked for hug, after Queen Elizabeth’s death: report",
        "description": "Princess Anne shrugged off a small moment of affection from a staff member after her mother, Queen Elizabeth II, died in September 2022."
    },
    {
        "url": "https://www.aol.com/harry-meghan-insist-queen-signed-202840279.html",
        "title": "<b>Harry</b> and Meghan Insist Queen Signed Off on Lilibet&#39;s Name: Source",
        "description": "Despite recent claims to the contrary, the late Queen Elizabeth II did approve of Prince Harry and Meghan Markle naming their daughter Lilibet. “Meghan and Harry 100 percent got permission from the queen to use the name Lilibet,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163320/20240117/emmy-awards-overlook-prince-harry-and-meghan-s-netflix-documentary-in-shocking-snub.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s Emmy Hopes Dashed in &#39;Devastated&#39; Snub, Here&#39;s Why",
        "description": "Despite high viewership and significant public interest, Prince Harry and Meghan Markle&#39;s Netflix docuseries, &quot;Harry &amp; Meghan,&quot; failed to receive a nomination at the 2024 Emmy Awards."
    },
    {
        "url": "https://www.aol.com/entertainment/princess-anne-didn-t-mean-202327813.html",
        "title": "Princess Anne Didn’t Mean to Block <b>Prince Harry</b> With Hat at Coronation",
        "description": "Princess Anne is setting the record straight about her hat. When Anne, 73, took her seat in Westminster Abbey to watch her brother King Charles III be crowned King in May 2023, her oversized feather hat blocked Prince Harry’s face from cameras — and,"
    },
    {
        "url": "https://people.com/prince-william-may-break-royal-tradition-henry-viii-king-8426986",
        "title": "<b>Prince</b> William Could Break Royal Tradition Dating Back to Henry VIII When He Becomes King",
        "description": "Prince William, the Prince of Wales, might pivot from a religious tradition when he succeeds his father King Charles one day, royal biographer Robert Hardman writes in his new book &#39;The Making of a King: King Charles III and the Modern Monarchy."
    },
    {
        "url": "https://home.nzcity.co.nz/news/article.aspx?id=391297&tst",
        "title": "<b>Prince Harry</b> has adopted one of Ellen DeGeneres&#39; pet chickens",
        "description": "The 65-year-old former talk show host and her wife Portia de Rossi had been giving extra care to one of their birds, who they dubbed Sinkie because of her temporary home in an outdoor sink, after she hurt her leg,"
    },
    {
        "url": "https://www.usmagazine.com/celebrity-news/news/harry-and-meghan-insist-queen-signed-off-on-lilibets-name-source/",
        "title": "<b>Prince Harry</b> and Meghan Markle ‘100 Percent’ Had Queen Elizabeth II’s Blessing for Lilibet’s Name (Exclusive)",
        "description": "Prince Harry and Meghan Markle ‘100 percent got permission’ from the late Queen Elizabeth II to name their daughter Liilibet, a source tells Us"
    },
    {
        "url": "https://www.usmagazine.com/stylish/news/princess-anne-didnt-mean-to-block-prince-harry-with-hat-at-coronation/",
        "title": "Princess Anne Denies Blocking <b>Prince Harry</b> With Coronation Hat on Purpose: ‘Not My Choice’",
        "description": "Princess Anne questioned wearing the huge feather hat that blocked Prince Harry’s view at King Charles’ coronation on May 6, 2023"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/king-charles-exasperated-over-prince-harrys-actions-according-to-new-book/news-story/2dc4eab183fb79d35a1060f2e8fdec93",
        "title": "King Charles ‘exasperated’ over <b>Prince Harry</b>’s actions, according to new book",
        "description": "King Charles feels “exasperated” by Prince Harry’s behaviour in recent years, but is “too busy to dwell” on the family drama, according to a bombshell new book."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1148468-queen-elizabeth-disowned-prince-harry-meghan-markle-after-lilibet-name-row",
        "title": "Queen Elizabeth &#39;disowned&#39; <b>Prince Harry</b>, Meghan Markle after Lilibet name row",
        "description": "Queen Elizabeth reportedly &#39;disowned&#39; Prince Harry and Meghan Markle after the couple named their daughter Lilibet without the late Monarch&#39;s permission.For the unversed, Lilibet was the"
    },
    {
        "url": "https://nypost.com/2024/01/16/entertainment/princess-anne-told-staffer-it-would-be-the-last-time-they-hugged-after-queen-elizabeths-death-report/",
        "title": "Princess Anne told staffer it would be the ‘last time’ they hugged after Queen Elizabeth’s death: report",
        "description": "Princess Anne shrugged off a small moment of affection from a staff member after her mother, Queen Elizabeth, died in September 2022."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1148460-meghan-markle-prince-harrys-netflix-deal-may-not-be-renewed",
        "title": "Meghan Markle, <b>Prince Harry</b>&#39;s Netflix deal may not be &#39;renewed&#39;",
        "description": "Meghan Markle and Prince Harry&#39;s lucrative Netflix partnership may not be &#39;renewed&#39; as the couple seemingly left with no creative projects to produce.The Duke and Duchess of Sussex signed"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-the-new-claims-saying-harry-and-meghan-didnt-have-the-queen-authorisation-dont-add-up_art20792.html",
        "title": "Princess Lilibet: The new claims saying <b>Harry</b> and Meghan didn’t have the Queen authorisation don’t add up",
        "description": "Royal author Robert Hardman is coming out with a new unauthorised biography called Charles III: New King. New Court. The Inside Story. Before the official release, Daily Mail is"
    },
    {
        "url": "https://people.com/princess-anne-raised-concerns-hat-blocked-prince-harry-coronation-report-8426703",
        "title": "Princess Anne Questioned Wearing Hat That Blocked <b>Prince Harry</b> at Coronation: &#39;Not My Choice&#39;",
        "description": "Princess Anne raised concerns about wearing a large hat during King Charles and Queen Camilla&#39;s coronation, but it was not meant to slight Prince Harry, royal biographer Robert Hardman writes in his new book."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/jung-hae-in-sends-coffee-truck-for-kim-soo-hyun-on-latters-upcoming-rom-com-queen-of-tears-set-1271934",
        "title": "Jung Hae In sends coffee truck for Kim Soo Hyun on latter’s upcoming rom-com Queen of Tears’ set",
        "description": "Korean celebs Jung Hae In and Kim Soo Hyun are serving major friendship goals as the former sent a coffee truck to the set of the latter&#39;s new drama Queen of Tears. Read on to know how fans reacted!"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/sport/football/napoli-have-made-an-offer-for-sheffield-uniteds-ex-nottingham-forest-and-bordeaux-man-4480691",
        "title": "Napoli &#39;have made an offer&#39; for Sheffield United&#39;s ex-Nottingham Forest and Bordeaux man",
        "description": "Sheffield United&#39;s Anel Ahmedhodzic has reportedly attracted interest. Image: George Wood/Getty Images Speaking before the opening of the window, Blades owner <b>Prince</b> Abdullah admitted a big offer would lead to a tough decision depending on the player in ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163314/20240117/financial-challenges-loom-for-meghan-markle-and-prince-harry-amid-content-creation-struggles.htm",
        "title": "Financial Challenges Loom for Meghan Markle and <b>Prince Harry</b> Amid Content Creation Struggles",
        "description": "The Sussexes, once seen as a promising addition to the entertainment industry, are now reportedly struggling to develop original content, walking what an industry insider describes as a &quot;financial tightrope."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/real-reason-king-charles-wants-fix-things-prince-harry-meghan-markle.html/",
        "title": "Royal Expert Explains the Real Reason King Charles Wants to Fix Things With <b>Prince Harry</b> and Meghan Markle",
        "description": "King Charles and Prince Harry have not been on good terms in years, but there might be a reason Charles wants that to change."
    },
    {
        "url": "https://pagesix.com/2024/01/16/royal-family/royal-biographer-slams-claim-queen-didnt-approve-lilibets-name/",
        "title": "Royal biographer Omid Scobie slams claim Queen Elizabeth II didn’t approve Princess Lilibet’s name",
        "description": "A royal aide claimed in a forthcoming book that the late monarch was “angry” when the couple publicly said she had approved the use of her childhood nickname."
    },
    {
        "url": "https://bestlifeonline.com/queen-elizabeth-lilibet-news/",
        "title": "Queen Elizabeth Was Furious About <b>Harry</b> and Meghan&#39;s Daughter&#39;s Name, Insider Says",
        "description": "A new book claims that Harry and Meghan didn&#39;t actually consult Queen Elizabeth about naming their daughter Lilibet, which angered her."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middleton-queen-mary-royal-31882972",
        "title": "Kate Middleton is like a younger sister to Queen Mary - they text each other all the time",
        "description": "EXCLUSIVE: The Princess of Wales and Queen Mary of Denmark are incredibly close and are said to regularly text one another - with Mary being credited as the muse behind Kate&#39;s royal magic"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/queen-elizabeth-lilibet-prince-harry-meghan-name-row-b1132565.html?itm_source=Internal&itm_channel=section_trending_article_component&itm_campaign=trending_section&itm_content=4",
        "title": "Queen Elizabeth told aides <b>Harry</b> and Meghan naming child Lilibet &#39;took only thing she owned&#39;, book claims",
        "description": "The late Queen was so upset at Prince Harry and Meghan naming their daughter Lilibet that she told aides they had taken the only thing she owned, it has been claimed. The Duke and Duchess of Sussex’s spokesperson said the couple chose the name after seeking permission from the late monarch, and would not have done so if she had objected."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/harry-meghan-lilibet-robert-hardman-king-biography-b2478702.html",
        "title": "Late Queen ‘infuriated’ by <b>Harry</b> and Meghan’s claim over naming of daughter Lilibet",
        "description": "A new autobiography has claimed the late Queen was ‘as angry as I’d ever seen her’ following the couple’s claim"
    },
    {
        "url": "https://www.ibtimes.co.uk/suits-co-star-says-hate-against-meghan-markle-means-nothing-1722757",
        "title": "&#39;Suits&#39; Co-star Says Hate Against Meghan Markle &#39;Means Nothing&#39;",
        "description": "Pierce echoed the same reminders he gave Meghan Markle during her last day on the set of &quot;Suits&quot; in 2017. He revealed during an interview on Harry Connick Jr&#39;s chat show in 2018 that it was just him and her in the room and he was compelled to share some parting words."
    },
    {
        "url": "https://uk.news.yahoo.com/princess-anne-didnt-purposely-block-110000527.html",
        "title": "Princess Anne didn&#39;t purposely block <b>Prince Harry</b>&#39;s view at King&#39;s Coronation",
        "description": "Princess Anne has addressed speculation she was seated in front of Prince Harry to block his view with her tall hat."
    },
    {
        "url": "https://www.thesun.ie/royals/12006274/fuming-queen-meghan-harry-named-daughter-lilibet/",
        "title": "Fuming Queen ‘cried “the only thing I own is my name &amp; they’ve taken it” after Meghan &amp; <b>Harry</b> named daughter Lilibet’",
        "description": "QUEEN Elizabeth was reportedly furious after Harry and Meghan said she had given her blessing to their daughter being called Lilibet, insiders have claimed. The fuming monarch is said to have told"
    },
    {
        "url": "https://www.thechronicle.com.au/entertainment/celebrity-life/royals/nine-biggest-bombshells-from-robert-hardmans-new-book-on-the-royals/news-story/cf4f83bd78cd0fe8603be7354b195c04",
        "title": "Nine biggest bombshells from Robert Hardman’s new book on the royals",
        "description": "From further humiliation for <b>Prince Harry</b> and Meghan Markle to behind-the-scenes sniping, these are the biggest revelations from a new tell-all royal book. Royal author Robert Hardman’s latest book Charles III: New King. New Court. The Inside Story has ..."
    }
]