[
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dominic-west-the-crown-reviews-b2487699.html",
        "title": "Dominic West says he ‘spent two days in bed’ after reading The Crown’s poor reviews",
        "description": "It’s an absolutely wonderful feeling. I miss it.” Last month, West revealed that <b>Prince Harry</b> no longer talks to him. The pair became friendly during a charity trek in 2013. Nine years before West accepted the role of <b>Prince</b> Charles, <b>Harry</b>’s father ..."
    },
    {
        "url": "https://www.allvipp.com/royals/whoa!-harry-and-meghan-s-production-manager-jumps-ship",
        "title": "WHOA! <b>Harry</b> and Meghan&#39;s Production Manager Jumps Ship",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s Archewell Productions hit with a surprise as manager Bennett Levine departs for Cinetic Media amid Netflix and Spotify deal developments. Shocking shake-up at Sussex HQ <b>Harry</b> and Meghan&#39;s TV boss quits Archewell Productions ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861445/Meghan-Markle-Prince-Harry-netflix-deal-deadline",
        "title": "<b>Prince Harry</b> and Meghan Markle have &#39;one year left&#39; to get cash as their expenses spiral",
        "description": "Meghan Markle and Prince Harry have just one year left to make their Netflix deal work or go bust, amid their growing &quot;money worries&quot;."
    },
    {
        "url": "https://uk.movies.yahoo.com/daily-mirror-facing-2m-legal-192214147.html",
        "title": "Daily Mirror Facing $2M Legal Fee Bill After <b>Prince Harry</b> Phone Hack Case",
        "description": "The company that owns U.K. tabloid The Daily Mirror is reportedly facing a $2 million-plus payment of 100 claimants’ legal fees in the latest turn over a phone hacking case involving Prince Harry and others over five years ending in 2011."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markles-earring-designers-got-191638447.html",
        "title": "Meghan Markle&#39;s Earring Designers Got Her Attention with This Old-School Approach When She Was a Working Royal",
        "description": "“We launched without any investment, and then two months after our investment, we got Meghan Markle to wear our pieces, which enabled us to grow the revenue significantly, and from there, we raised $1.2 million,” Warch explained of the brand’s history on the Shark Tank-style business pitch show."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-may-be-in-a-bigger-career-crisis-than-we-think-heres-whats-happening_art20963.html",
        "title": "<b>Prince Harry</b> and Meghan may be in a bigger career crisis than we think, here’s what’s happening",
        "description": "Discover our latest podcast <b>Prince Harry</b> and Meghan Markle are also dealing with the same issues as they try to rebuild their brand together away from the British Royal Family. But this is made of many ups and down... Already in 2023, the couple’s $ ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861417/prince-harry-victim-letter-friend",
        "title": "<b>Prince Harry</b> told to &#39;get over himself, you&#39;re not a victim&#39; in scathing note from friend",
        "description": "Prince Harry has been warned against portraying himself as a victim, with one former friend saying he is &quot;the furthest thing from a victim&quot; in a scathing letter."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-told-back-off-32005623",
        "title": "Meghan Markle told to &#39;back off&#39; from &#39;toxic&#39; friendship with Ellen DeGeneres",
        "description": "Meghan Markle and Prince Harry have developed a close bond with TV star Ellen DeGeneres and her wife Portia De Rossi - however, they&#39;ve been cautioned to steer clear of the &#39;toxic&#39; talk show host"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-making-prudent-move-32004445",
        "title": "<b>Prince Harry</b> making &#39;prudent move&#39; in his efforts to mend broken relationship with royals",
        "description": "Meghan Markle was rumoured to be working on her memoir, but Prince Harry is said to have put a stop to her plans as he works on fixing his relationship with the Royal Family"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/30/will-elizabeth-ii-aunt-kept-secret-prince-frank-of-teck/",
        "title": "Of course the will of Elizabeth II’s aunt was kept secret – blame the randy <b>Prince</b> Frank of Teck",
        "description": "The <b>Prince</b> of Teck had a somewhat wayward reputation Credit ... Her estate of £21,711,485 was largely divided between her sons, William and <b>Harry</b> with £50,000 given to her butler, Paul Burrell, and certain keepsakes to her 17 godchildren."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/512372/meet-prince-harry-and-meghan-markles-children-prince-archie-and-princess-lilibet/",
        "title": "Meet <b>Prince Harry</b> and Meghan Markle&#39;s children <b>Prince</b> Archie and Princess Lilibet",
        "description": "The Duke and Duchess of Sussex looked over the moon and totally in love with their new son as they greeted photographers at Windsor Castle. Just a few days later, the royal couple introduced their newborn to Their Late Majesties, Queen Elizabeth II and Prince Philip."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25602674/prince-louis-lavish-adida-trainers/",
        "title": "<b>Prince</b> Louis gifted ‘priceless’ pair of Adidas Stan Smith trainers – but ‘he’s unlikely to wear them’",
        "description": "<b>PRINCE</b> Louis may have an impressive collection of footwear ... including an £8k book from Uncle <b>Harry</b>, an adventure-themed birthday, as well as limited-edition Stan Smith trainers. Back in 2019, whilst mum Kate was watching a men&#39;s final at Wimbledon ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13022739/meghan-markle-freebies-diamond-earrings-dragons-den.html",
        "title": "Meghan Markle accepted pair of £1990 diamond earrings from Dragons&#39; Den hopefuls - after <b>Prince Harry</b> revealed she &#39;kept gifts but shared them out&#39; in Kensington Palace",
        "description": "The Duchess of Sussex, 42, was sent the jewellery by artificial diamond brand Kimai when she was still a working member of the Royal Family in 2019 and wore them during an engagement in London."
    },
    {
        "url": "https://uk.style.yahoo.com/execs-reportedly-prepared-pay-takes-135625242.html",
        "title": "Execs Are Reportedly “Prepared to Pay What It Takes” to Get Meghan Markle to Star in (and Direct!) Forthcoming ‘Suits’ Spinoff",
        "description": "Suits creator Aaron Korsch has already written some new episodes as NBC Universal gives it the go-ahead, and a senior production source claimed, per The Sun, that “there have been contract talks between the Duchess’ agent and the studio giant.” ( Suits originally aired on USA Network, which is a subsidiary of NBC Universal.)"
    },
    {
        "url": "https://bylinetimes.com/2024/01/30/time-for-truth-calls-grow-for-police-probe-into-piers-morgan-and-mirror-editors/",
        "title": "Time for Truth: Calls Grow for Police Probe into Piers Morgan and Mirror Editors",
        "description": "A prominent lawyer, hacking victim and an ex-police officer are joining Prince Harry in demanding police action into Mirror Group crimes and alleged lies to the Leveson Inquiry"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022509/Archewell-exodus-staff-Harry-Meghan-production-company-Netflix-documentary.html",
        "title": "Just what IS going on behind the scenes at Archewell? Inside mass exodus from <b>Harry</b> and Meghan&#39;s production company as yet another exec leaves couple&#39;s employ",
        "description": "A lynchpin of <b>Prince Harry</b> and Meghan Markle&#39;s bombshell Netflix series has left the couple&#39;s California production company - bringing the total number of staff the Sussexes have lost since they married to at least 17. Archewell TV executive Bennett ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/prince-harrys-dig-peter-crouch-31999265",
        "title": "<b>Prince Harry</b>&#39;s dig at Peter Crouch -and quip about Meghan Markle that striker wished he made",
        "description": "As football legend Peter Crouch celebrates his 43rd birthday, we take a look at the time he was allegedly questioned by Prince Harry on his marriage with model Abbey Clancy"
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/celebrity/lauren-sanchez-jeff-bezos-wedding-engagement-birthday-affair-relationship-timeline-b1135710.html",
        "title": "Under the skin of the glamazon Lauren Sánchez",
        "description": "She’s about to marry one of the richest and most powerful men in the world. So who is the former journalist turned aviation entrepreneur and pilot credited with turning Jeff Bezos from nerd to hunk? M"
    },
    {
        "url": "https://www.independent.co.uk/news/world/prince-harry-africa-charity-allegations-b2486504.html",
        "title": "<b>Prince Harry</b> urged to quit charity that is facing rape, abuse and torture accusations",
        "description": "Prince Harry has been urged to quit a charity that is facing allegations of rape and torture by its employees of local people in the Republic of the Congo. Guards managed and paid by Africa Parks have been accused of human rights abuse which includes the beating, rape and torture of indigenous Baka people in the rainforests."
    },
    {
        "url": "https://uk.news.yahoo.com/queen-camilla-takes-public-reins-155535990.html",
        "title": "Queen Camilla takes the public reins in King Charles&#39;s absence",
        "description": "Queen Camilla will be the most high-profile public face of the British monarchy as her husband King Charles III and his daughter-in-law recuperate from surgery.With Charles and Kate facing weeks of rest and recuperation,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512336/prince-harry-meghan-markle-new-change/",
        "title": "<b>Prince Harry</b> and Meghan Markle face new change with team",
        "description": "It&#39;s been revealed that Prince Harry and Meghan Markle said goodbye to Bennett Levine, the manager of Archewell Productions – the company which was set up in October 2020. Confirming his news on social media, Bennett announced: &quot;I&#39;m happy to share that I&#39;m starting a new position at Cinetic Media.&quot;"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-she-may-no-longer-be-a-working-royal-but-she-remains-a-princess-heres-why_art20949.html",
        "title": "Meghan Markle: She may no longer be a working royal but she remains a Princess, here’s why",
        "description": "Meghan Markle and <b>Prince Harry</b> are press favourites. They are so loved by the press that it led them to move to North America at the end of 2019 in an attempt to escape it. A few months later that move was followed by the announcement that they would step ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-hyper-concerned-money-31999585",
        "title": "Meghan Markle &#39;hyper-concerned&#39; about money amid fresh blow to couple&#39;s production company",
        "description": "The Duchess of Sussex is said to be concerned that she and Prince Harry could &quot;lose everything&quot; as they have &quot;blown through so much money&quot; and are not making much progress in their career."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-allegedly-put-end-130703380.html",
        "title": "<b>Prince Harry</b> Allegedly &quot;Put an End&quot; to Meghan Markle&#39;s Memoir Plans",
        "description": "<b>Prince Harry</b> releasing his memoir Spare almost completely squandered any hopes the Duke of Sussex had of reconciling with the Royal Family, and it sounds like he&#39;s determined not to let something like that happen again. Rumors that Meghan Markle wished to ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-harry-spending-desperate-32001285",
        "title": "Meghan Markle facing &#39;desperate times&#39; with <b>Prince Harry</b> as they&#39;re &#39;forced to cut spending that&#39;s out of control&#39;",
        "description": "<b>Prince Harry</b> and Meghan Markle are said to be facing &quot;desperate times&quot; as their &quot;spending is out of control&quot; following their numerous and expensive legal battles. Speaking to Closer Magazine, an insider revealed: &quot;Whether <b>Harry</b> was right or wrong ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-dealt-32000716",
        "title": "Meghan Markle and <b>Prince Harry</b> dealt huge blow as manager of Archewell Productions quits",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s Archewell Productions has suffered a setback as their TV boss, Bennett Levine, has decided to leave. The couple established Archewell Productions in 2020, the same year they stepped down as senior royals and relocated to ..."
    },
    {
        "url": "https://uk.yahoo.com/news/meghan-markle-set-swap-school-121914262.html",
        "title": "Meghan Markle set to swap the school run for learning scripts as she’s offered ‘dream role’ in new Suits spin-off show",
        "description": "It&#39;s no secret that <b>Prince Harry</b> and Meghan Markle are hands-on parents. After firing their nanny, they decided to step back as senior working members of the Royal Family and make LA their home, and while the couple have shared some joint work ventures ..."
    },
    {
        "url": "https://www.celebritynetworth.com/richest-celebrities/actors/freddie-stroma-net-worth/",
        "title": "What is Freddie Stroma&#39;s Net Worth?",
        "description": "Freddie Stroma is a British actor who has a net worth of $2 million. Freddie Stroma rose to stardom after appearing in the &quot;Harry Potter&quot; film series. He later had roles in &quot;Unreal,&quot; &quot;13 Hours: The Secret Soldiers of Benghazi,&quot; and &quot;Time After Time.&quot; He also appeared in the DC Extended Universe series &quot;Peacemaker.&quot;"
    },
    {
        "url": "https://www.spokesman.com/stories/2024/jan/30/lionel-richie-prince-and-a-grumpy-bob-dylan-the-un/",
        "title": "Lionel Richie, <b>Prince</b> and a grumpy Bob Dylan: The untold story behind ‘We Are the World’",
        "description": "As the documentary shows, “We Are the World” was conceived as a kind of American counterpart to “Do They Know It’s Christmas?,” the British charity single released in late 1984 by an all-star supergroup that included George Michael, Phil Collins, Sting and Boy George, among many others."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/prince-harry-and-meghans-archewell-production-company-suffers-new-blow-as-tv-boss-quits/P7APWBPOQJDMLEW7M3QRBPWFKA/",
        "title": "<b>Prince Harry</b> and Meghan’s Archewell production company suffers new blow as TV boss quits",
        "description": "It&#39;s a blow to the company. There&#39;s no doubt about that.&#39; Photo /  When Meghan Markle was interviewed on the red carpet at a Los Angeles event last year, she revealed that she and Prince Harry had “so many exciting things on the slate” to announce."
    },
    {
        "url": "https://www.vulture.com/article/best-audiobooks-2024.html",
        "title": "6 Great Audiobooks to Listen to This Month",
        "description": "Hopefully, you’ll start loving audiobooks almost as much as I do. Read by: Patti Murin Length: 14 hrs, 57 mins. Speed I listened: 2.3x I had a hard time finding audiobooks I liked this month. I loved spending time with Dan Stevens ( Downton Abbey) as he read a British shrink in Matthew Blake’s thriller Anna O."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-former-suits-costar-194228484.html",
        "title": "Meghan Markle&#39;s Former &#39;Suits&#39; Costar Believes Her Royal Influence Is Behind the Show&#39;s Popularity",
        "description": "Remember that “Markle Sparkle” everyone talked about when Meghan Markle joined the royal family? Well, it still exists in this world, just not at the palace. The Duchess of Sussex’s former Suits costar,"
    },
    {
        "url": "https://www.forbes.com/sites/zacharyfolk/2024/01/30/more-executives-leave-harry-and-meghans-production-company-what-we-know/",
        "title": "More Executives Leave <b>Harry</b> And Meghan’s Production Company: What We Know",
        "description": "Prince Harry and Meghan Markle’s production company Archewell lost three more executives over the weekend—the latest in a series of high-profile departures for the ex-royals’ brand. Ben Browning, an Oscar-nominated producer who was tapped to lead content at Archewell, will leave later this year after his contract expires, Variety reported Saturday."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152973-prince-harry-going-against-meghan-markle-to-settle-rift-with-royal-family",
        "title": "<b>Prince Harry</b> going against Meghan Markle to settle rift with royal family",
        "description": "Prince Harry has been lauded for his decision as he reportedly &#39;blocked&#39; Meghan Markle from writing an explosive tell-all memoir in order to settle their rift with the royal family.Earlier"
    },
    {
        "url": "https://bulawayo24.com/index-id-news-sc-national-byo-239707.html",
        "title": "Zimbabwean nanny was surprised by the way <b>Harry</b> and Meghan first greeted her",
        "description": "Prince Harry and Meghan Markle surprised Prince Archie&#39;s former nanny Lorren Khumalo, from Zimbabwe, when she was first introduced to the couple.Lorren, a"
    },
    {
        "url": "https://people.com/meghan-markle-earrning-designers-caught-attention-royal-life-8553125",
        "title": "Meghan Markle&#39;s Earring Designers Got Her Attention with This Old-School Approach When She Was a Working Royal",
        "description": "Female-founded jewelry brand Kimai reveals how they got the attention of Meghan Markle&#39;s office when the Duchess of Sussex was a working royal"
    },
    {
        "url": "https://www.livemint.com/news/world/king-charles-returns-home-after-prostate-treatment-urology-expert-details-what-lies-ahead-during-recovery-11706599999702.html",
        "title": "King Charles returns home after prostate treatment: Urology expert details what lies ahead during recovery",
        "description": "King Charles has been discharged from the London Clinic after prostate treatment. His recovery timeline is undisclosed, but no immediate changes to his constitutional duties are expected."
    },
    {
        "url": "https://sg.news.yahoo.com/dominic-west-says-spent-two-000753776.html",
        "title": "Dominic West says he ‘spent two days in bed’ after reading The Crown’s poor reviews",
        "description": "Dominic West has said he “spent two days in bed” after reading the reviews for the final season of The Crown. The 54-year-old actor played Prince Charles in the fifth and sixth seasons of Peter Morgan’s royal drama."
    },
    {
        "url": "https://finance.yahoo.com/news/dress-worn-princess-diana-surged-180015611.html",
        "title": "A Dress Worn By The Late Princess Diana Surged Past Expectations At Auction And Sold For Over $1 Million",
        "description": "A dress worn by Diana, Princess of Wales during her time as an English royal recently shattered expert predictions when it was sold for almost 12 times its estimated price in a late December auction."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-suffer-173116791.html",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle Suffer a Business Setback Just as They Were Getting Back on Track",
        "description": "Prince Harry and Meghan Markle have been looking forward to 2024 as a restart to their work in Hollywood, but they reportedly have hit a setback at Archewell Productions. Bennett Levine, who spent almost three years working with the royal couple,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152958-meghan-markle-receives-stern-warning-amid-hollywood-comeback",
        "title": "Meghan Markle receives stern warning amid Hollywood comeback",
        "description": "Meghan Markle has been warned to maintain distance from the renowned television host Ellen DeGeneres amid the Duchess of Sussex&#39;s comeback rumours in Hollywood.A few years ago, the TV"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-drugs-court-showdown-visa-biden-1865286",
        "title": "<b>Prince Harry</b> Drugs Case Heads for Court Showdown",
        "description": "DHS argued in a court filing seen by Newsweek that it &quot;cannot confirm or deny whether any other records that [Heritage] are seeking exist because the mere acknowledgment of these records would constitute an unwarranted invasion of Prince Harry&#39;s privacy."
    },
    {
        "url": "https://www.btimesonline.com/articles/163646/20240131/prince-harry-meghan-markles-final-bow-on-netflix-meet-me-at-the-lake-may-be-last-project.htm",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s Final Bow on Netflix? &#39;Meet Me at the Lake&#39; May Be Last Project",
        "description": "The partnership between Prince Harry, Meghan Markle, and streaming behemoth Netflix, once seen as a cornerstone of the Duke and Duchess of Sussex&#39;s post-royal career, is approaching a critical crossroad."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-george-perfected-signature-hair-173643719.html",
        "title": "<b>Prince</b> George Has Perfected This Signature Hair Move He Learned from Kate Middleton as a Toddler!",
        "description": "<b>Prince</b> George is seen copying the style trick he picked up from his mom in a now-viral TikTok Samir Hussein/WireImage <b>Prince</b> George and Kate Middleton at Trooping the Colour in June 2023. A reel of <b>Prince</b> George pushing back his bangs has gone viral on ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25591827/meghan-markle-prince-harry-archewell-productions-manager-quits/",
        "title": "Blow to Meghan Markle and <b>Prince Harry</b> as key member of Archewell staff quits after string of employees leave",
        "description": "HARRY and Meghan have been hit with a fresh blow after their Archewell Productions manager walked out. The company, which boasts a collaboration with Netflix, was launched in 2020 by the Sussexes"
    },
    {
        "url": "https://www.ibtimes.co.uk/andrew-holness-marlene-malahoo-forte-o-1723081",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s Jamaica Visit Sparks Claims Of &#39;<b>Harry</b> &amp; Meghan&#39; Sequel",
        "description": "The Sussexes shared a glimpse at their former royal life and their love story in the &quot;Harry &amp; Meghan&quot; Netflix docuseries."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-wants-second-trial-mirror-phone-hacking/",
        "title": "<b>Harry</b> wants second trial with Mirror publisher over phone-hacking claims despite winning £140k in December",
        "description": "Prince Harry wants a second phone-hacking trial against the Mirror, despite the newspaper group seeking to recoup £350,000 in legal costs from other complainants in his case."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-seeking-second-high-092208997.html",
        "title": "<b>Prince Harry</b> &#39;seeking second High Court phone hacking battle with Mirror newspapers&#39;",
        "description": "Lawyers for the group bringing claims, which include the Duke of Sussex, are making a bid for MGN to pay nearly £2million in costs"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-king-charles-surgery-hospital-royal-family-b2487051.html",
        "title": "Royal news – live: King Charles leaves hospital hours after Kate returns home from surgery",
        "description": "Before his treatment for his enlarged prostate, Charles took time to visit his daughter-in-law Kate, who was recovering at the hospital after undergoing successful abdominal surgery last week. The pair left the private hospital within hours of each other and are said to be recovering at home."
    },
    {
        "url": "https://www.couriermail.com.au/entertainment/celebrity-life/royals/major-blow-to-meghan-markle-and-prince-harrys-hollywood-dream/news-story/b8c1a3b3f59429a85009f73cec28388f",
        "title": "Major blow to Meghan Markle and <b>Prince Harry</b>’s Hollywood dream",
        "description": "Meghan Markle and <b>Prince Harry</b> suffered a new setback after a high-profile defection at their production company amid a push to sign lucrative content deals. Archewell Productions executive Bennett Levine became the latest in a string of senior staff ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markles-loveliness-inspired-suits-resurgence-says-co-star-1723051",
        "title": "Meghan Markle&#39;s &#39;Loveliness&#39; Inspired &#39;Suits&#39; Resurgence, Says Co-Star",
        "description": "She did 100 episodes on the show until season 7, but had to leave acting for good when she married <b>Prince Harry</b> in May 2018. Spencer, on the other hand, appeared throughout the entire run as Dana Scott, the longtime work rival/love interest to Harvey ..."
    }
]