[
    {
        "url": "https://www.vancouverislandfreedaily.com/local-news/prince-harry-to-matthew-perry-celebrity-memoirs-top-greater-victoria-reads-7290840",
        "title": "<b>Prince Harry</b> to Matthew Perry, celebrity memoirs top Greater Victoria reads",
        "description": "This was the year of the celebrity memoir, with Spare by Prince Harry, The Duke of Sussex, the most checked-out nonfiction book in all formats. Matthew Perry, Britney Spears, and Michelle Obama, also have titles in the most borrowed nonfiction category, according to Rachel Rogers, the GVPL collections and technical services coordinator."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142914-meghan-markle-issued-new-warning-for-2024",
        "title": "Meghan Markle issued new warning for 2024",
        "description": "Prince Harry&#39;s wife Meghan Markle, who&#39;s said to be planning to write her tell-all memoir, has been warned that 2024 is not the year for her new book.The Duchess of Sussex, who might have"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/30-top-news-stories-2023-9002690",
        "title": "30 top news stories of 2023 from Schofield and Boris to Twitter",
        "description": "The top 30 news moments of 2023 include Phillip Schofield&#39;s departure from This Morning, Prince Harry&#39;s memoir, and Big Brother&#39;s comeback. A poll, of 2,000 adults, identified the stories they&#39;ve most enjoyed reading - with King Charles&#39; coronation taking first place."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1844651/zara-tindall-prince-harry-princess-eugenie",
        "title": "Zara Tindall&#39;s ruthless comment to <b>Prince Harry</b> at Princess Eugenie&#39;s wedding",
        "description": "Zara Tindall, known for her straightforward nature, reportedly made a cutting comment to Prince Harry during Princess Eugenie &#39;s wedding. A lip-reader analyzed the moment when Zara turned to Harry and Meghan to compare their wedding with Eugenie&#39;s."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510256/royals-not-invited-sandringham-christmas/",
        "title": "How royals not invited to King Charles&#39; Sandringham gathering spent Christmas",
        "description": "Seven-year-old Christopher was absent from the royal celebrations in Norfolk this year, spending Christmas in the US with his mother, Dara Huang, even making time to visit Disneyland, with Dara sharing snaps from their trip on Instagram - what a dream come true for a little boy!"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12909349/Prince-Harrys-explosive-memoir-Spare-villain-brother-Prince-William-royal-experts-tell-PALACE-CONFIDENTIAL-review-2023-British-monarchy.html",
        "title": "<b>Prince Harry</b>&#39;s explosive memoir Spare made a &#39;villain&#39; of his brother <b>Prince</b> William, royal experts tell PALACE CONFIDENTIAL in a review of 2023 for the British monarchy",
        "description": "Speaking on the Mail+&#39;s weekly talk show, the London-based journalist said the Duke of Sussex , 39, surprised audiences by depicting the Prince of Wales, 41, as a &#39;villain of the piece&#39;."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24009801.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to <b>Prince Harry</b>",
        "description": "2023 was a big one! But how much do you actually remember happening? Take our epic end-of-the-year quiz to find out. Big Brother returned, Eurovision came to the UK, the Beatles released a new song and a new King was crowned. Did Billy Joel write 2023 ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-were-31766221.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle were tipped &#39;over the edge&#39; by tense moment at Christmas",
        "description": "Meghan Markle and Prince Harry last spent Christmas with the Royal Family in 2018 and it seems one thing left them &#39;furious&#39; after the final festive gettogether"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850042/meghan-markle-prince-harry-omid-scobie-endgame",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s biographer Omid Scobie &#39;threw spanner in Sussexes&#39; plans&#39;",
        "description": "Meghan Markle and Prince Harry&#39;s year appears to be ending on a low, after they were branded among the &quot;biggest losers in Hollywood&quot; by a prestigious publication."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25185585/meghan-markle-queen-kate-middleton-royal-author-tom-bower/",
        "title": "Meghan Markle ‘jealous of everything Kate Middleton has’ and ‘wants to be Queen’, claims royal author Tom Bower",
        "description": "MEGHAN Markle “wants to be the Queen” and “Kate Middleton has everything she wants”, according to a royal author. Tom Bower claimed that the Princess of Wales is proving highly successful in her"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25189982/meghan-markle-new-year-resolutions-redemption/",
        "title": "Meghan Markle’s New Year resolutions revealed as she plots to break bad habits in ‘year of redemption’",
        "description": "MEGHAN Markle&#39;s New Year&#39;s resolutions have resurfaced amid hopes for a &quot;year of redemption&quot;. On January 1, 2016 - just six months before meeting <b>Prince Harry</b> - Meghan took to her now-defunct blog The Tig to share her resolutions. Meghan wrote ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/author-calls-kate-middleton-strong-willed-despite-innocuous-public-image-1722442",
        "title": "Author Calls Kate Middleton &#39;Strong-Willed&#39; Despite &#39;Innocuous&#39; Public Image",
        "description": "Royal author Valentine Low says the Princess of Wales is &quot;prepared to fight for what she wants and what she thinks is right&quot;."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510149/royals-at-13-savannah-phillips-princess-eugenie-prince-william-on-milestone-birthdays/",
        "title": "Royals at 13: Savannah Phillips, Princess Eugenie, <b>Prince</b> William and more on their milestone birthdays",
        "description": "Prince William, 41, is first in line to the throne, a proud husband and a father of three. But back in mid-1995, a 13-year-old Prince William, who was born on 21st June 1982, was getting ready to head off to begin his education at Eton College."
    },
    {
        "url": "https://edition.cnn.com/2023/12/29/uk/royal-year-in-review-intl-gbr-scli-cmd/index.html?ref=upstract.com",
        "title": "Have King Charles and <b>Prince</b> William secured the monarchy?",
        "description": "The role of any monarchy is to represent continuity. Something both King Charles III and Prince William showed they understood this year. But if you look closely, they have also both spent the past 12 months developing their individual roles."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-were-31769044",
        "title": "<b>Prince Harry</b> and Meghan Markle were tipped &#39;over the edge&#39; by tense Christmas moment",
        "description": "In the book Finding Freedom, authors Omid Scobie and Carolyn Durand claimed the Sussexes believed the Royal Family were &quot;conspiring against them&quot; with the move. They said the couple felt they had &quot;long been sidelined by the institution and were not a fundamental part of its future&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/prince-harrys-weird-gift-royal-31764586?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b>&#39;s weird gift from the Royal Family that he dubbed &#39;cold-blooded&#39;",
        "description": "The Duke of Sussex discussed the bizarre gift he received from a member of the Royal Family before he stepped down from senior working royal duties."
    },
    {
        "url": "https://uk.yahoo.com/news/fact-check-shocking-meghan-markle-184400447.html",
        "title": "Fact Check: &#39;Shocking Meghan Markle Announcement&#39;: Online Ad Makes Evidence-Free Claims About Royal Couple",
        "description": "The online ad said that Prince Harry had been &quot;humiliated&quot; over Meghan&#39;s purportedly &quot;shocking&quot; announcement. Here&#39;s why these made-up claims exist."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markle-will-31763174",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;will reunite with King Charles next year&#39;",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, are supposed to reunite with King Charles next year"
    },
    {
        "url": "https://www.standard.co.uk/going-out/restaurants/chef-restaurateur-interviews-london-tom-sellers-sluttycheff-b1129358.html",
        "title": "Going Out&#39;s biggest interviews of the year, from Tom Sellers to SluttyCheff",
        "description": "Read the full interview. Posh boy clubbing is back. The nightclub once famous for its Crack Baby cocktails, its celebrity clientele — <b>Prince Harry</b>, Cameron Diaz, Hugh Grant and the like — reopened in 2023 after a seven-year hiatus. Read the full interview."
    },
    {
        "url": "https://news.sky.com/story/amp/sophie-winkleman-big-suze-actress-says-she-didnt-know-anyone-at-her-royal-wedding-13038685",
        "title": "Sophie Winkleman: &#39;Big Suze&#39; actress says she &#39;didn&#39;t know anyone&#39; at her royal wedding",
        "description": "She was one of the first to defend them publicly in the wake of <b>Harry</b> and Meghan&#39;s Netflix documentary. When she broke several bones in her foot and back following a devastating car accident in 2017, the royals rallied around to help - the then <b>Prince</b> ..."
    },
    {
        "url": "https://uk.style.yahoo.com/crown-star-dominic-west-prince-163700355.html",
        "title": "‘The Crown’ star Dominic West, <b>Prince Harry</b> had falling out over an interview",
        "description": "“The Crown” star Dominic West says he fell out of favor with former pal <b>Prince Harry</b> after sharing “too much” in an interview. The 59-year-old actor — who in the last two seasons of the Netflix hit plays <b>Harry</b>’s father, King Charles — shared ..."
    },
    {
        "url": "https://www.dailysabah.com/arts/dominic-west-earns-prince-harrys-distain-after-revealing-interview/news",
        "title": "Dominic West earns <b>Prince Harry</b>&#39;s distain after revealing interview",
        "description": "Dominic West, known for his role in &quot;The Crown,&quot; revealed that his friendship with <b>Prince Harry</b> soured after he divulged excessive information during an interview. The 59-year-old actor, portraying King Charles in the recent seasons of the Netflix series ..."
    },
    {
        "url": "https://www.dailysabah.com/arts/interview-disagreement-led-to-tensions-between-dominic-west-prince-harry/news",
        "title": "Interview disagreement led to tensions between Dominic West, <b>Prince Harry</b>",
        "description": "Dominic West, known for his role in &quot;The Crown,&quot; revealed that his friendship with <b>Prince Harry</b> soured after he divulged excessive information during an interview. The 59-year-old actor, portraying King Charles in the recent seasons of the Netflix series ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/the-sign-that-forgiving-monarch-king-charles-could-welcome-harry-and-meghan-back-under-one-condition/",
        "title": "The sign that ‘forgiving monarch’ King Charles could welcome <b>Harry</b> and Meghan back – under one condition",
        "description": "King Charles is determined to be a ‘forgiving monarch’ and could welcome back Harry and Meghan, a royal expert has claimed"
    },
    {
        "url": "https://www.btimesonline.com/articles/162945/20231229/royal-snubs-meghan-markles-struggle-to-enter-amal-clooney-and-michelle-obama-circle.htm",
        "title": "Royal Snubs: Meghan Markle&#39;s Struggle to Enter Amal Clooney and Michelle Obama Circle",
        "description": "Meghan Markle, the Duchess of Sussex, is reportedly grappling with feelings of exclusion from the elite circles of Amal Clooney and Michelle Obama. Sources close to the Duchess reveal a tale of unreciprocated attempts at friendship and a perceived cold shoulder from some of the most influential women in the global spotlight."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-trashing-reputations-absolute-bonfire-says-expert.html/",
        "title": "Meghan Markle and <b>Prince Harry</b> ‘Trashing’ Their Reputations: 2023 Was an ‘Absolute Bonfire’ Says Expert",
        "description": "Meghan Markle and Prince Harry were &#39;trashing&#39; their reputations in 2023 says a royal expert. What will 2024 bring for the royal couple?"
    },
    {
        "url": "https://www.oakbaynews.com/local-news/prince-harry-to-matthew-perry-celebrity-memoirs-top-greater-victoria-reads-7290840",
        "title": "<b>Prince Harry</b> to Matthew Perry, celebrity memoirs top Greater Victoria reads",
        "description": "This was the year of the celebrity memoir, with Spare by Prince Harry, The Duke of Sussex, the most checked-out nonfiction book in all formats. Matthew Perry, Britney Spears, and Michelle Obama, also have titles in the most borrowed nonfiction category, according to Rachel Rogers, the GVPL collections and technical services coordinator."
    },
    {
        "url": "https://www.telegraphindia.com/entertainment/gary-oldman-says-he-was-mediocre-in-harry-potter-movies/cid/1990158",
        "title": "Gary Oldman says he was &#39;mediocre&#39; in <b>Harry</b> Potter movies",
        "description": "The &quot;<b>Harry</b> Potter&quot; movies were adapted from author JK Rowling&#39;s ... of Azkaban”, “The Goblet of Fire”, “The Order of the Phoenix”, “The Half-Blood <b>Prince</b>” and “The Deathly Hallows – Part 1 &amp; 2”. Oldman had starred as Sirius Black ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142863-prince-harrys-words-on-taking-the-throne",
        "title": "<b>Prince Harry</b>&#39;s words on taking the throne",
        "description": "Prince Harry, who&#39;s making headlines for likely reconciliation with the royal family, insists &#39;no one wants to be King&#39; in an unearthed interview.The Duke of Sussex, who stepped down as"
    },
    {
        "url": "https://gamerant.com/harry-potter-most-dangerous-spells/",
        "title": "<b>Harry</b> Potter: 6 Most Dangerous Spells",
        "description": "Sectumsempra is a curse that was created by Severus Snape when he attended Hogwarts and is one of the most dangerous spells in the wizarding world. The curse lacerates a target, and depending on where it hits it could cause them to bleed to death, especially if there is no one to heal the wounds."
    },
    {
        "url": "https://eng.obozrevatel.com/section-entertainment/news-a-rare-photo-of-meghan-markle-posing-in-a-santa-mini-dress-was-found-online-29-12-2023.html",
        "title": "A rare photo of Meghan Markle posing in a Santa mini-dress was found online",
        "description": "Meghan Markle, the wife of <b>Prince Harry</b> of Sussex, the biggest &quot;loser of the royal family,&quot; was photographed back in 2006 wearing a glamorous Miss Santa costume. It is quite difficult to recognize her. The look of the Duchess of Sussex in the photo is ..."
    },
    {
        "url": "https://ijr.com/prince-harry-meghan-receive-major-snub-royal-family-christmas/",
        "title": "<b>Prince Harry</b> and Meghan Receive Major Snub From Royal Family for Christmas",
        "description": "After years of badmouthing the royal family, Harry and Meghan&#39;s relationship with King Charles may finally be over."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12907185/Here-come-society-brides-grooms-Norways-Princess-M-rtha-Louise-Duke-Westminster-granddaughter-Shah-Iran-tie-knot-year-wedding-come-top.html",
        "title": "Here come the society brides (and grooms)! Norway&#39;s Princess Märtha Louise, the Duke of Westminster and the granddaughter of the last Shah of Iran will all tie the knot this ...",
        "description": "From Prince George&#39;s godfather to the King of Norway&#39;s daughter, a host of royals, well-connected socialites and aristocrats are tying the knot in 2024."
    },
    {
        "url": "https://www.thestar.com.my/lifestyle/entertainment/2023/12/29/the-crown-star-dominic-west-prince-harry-had-falling-out-over-an-interview",
        "title": "‘The Crown’ star Dominic West, <b>Prince Harry</b> had falling out over an interview",
        "description": "The Crown star Dominic West says he fell out of favour with former pal Prince Harry after sharing “too much” in an interview."
    },
    {
        "url": "https://www.timescolonist.com/local-news/prince-harry-memoir-most-borrowed-library-book-of-2023-in-greater-victoria-8037261",
        "title": "<b>Prince Harry</b> memoir most borrowed library book of 2023 in Greater Victoria",
        "description": "Though unusual for a non-fiction book to emerge as the most popular book across all genres, Spare garnered a lot of attention even before it was released."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/prince-william-kate-middleton-have-learnt-this-from-prince-harrys-memoir-101703770391975.html",
        "title": "<b>Prince</b> William-Kate Middleton have learnt this from <b>Prince Harry</b>&#39;s memoir",
        "description": "Royal commentator Gareth Russell said that Prince Harry&#39;s emotions came across strongly in the book. “It&#39;s very clear from his memoir, whether rightly or wrongly, that he felt shunted to one side and that even was with a mother as loving as Diana,"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-cute-moment-young-fan-viral-video-tiktok-1856375",
        "title": "<b>Prince Harry</b>&#39;s &#39;Cute&#39; Moment With Young Fan Caught on Camera",
        "description": "Harry&#39;s interaction with a young fan holding a &quot;Gingers Unite&quot; sign at a royal event has gone viral on TikTok."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-william-kate-middletons-college-110000259.html",
        "title": "<b>Prince</b> William And Kate Middleton&#39;s College Apartment Is Still Available To Rent",
        "description": "Take a look inside 13A Hope Street, where the Prince and Princess of Wales lived during their second year at university."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/king-charless-night-time-routine-revealed-why-is-he-awake-until-4am/",
        "title": "King Charles&#39;s night-time routine revealed - why is he awake until 4am?",
        "description": "Released ahead of His Majesty&#39;s coronation, royal author Robert Jobson reflects upon King Charles as both a man and as Britain&#39;s monarch. He considers his motivations, driving passions and how his values will go on to influence his approach to his reign."
    },
    {
        "url": "https://indianexpress.com/article/entertainment/hollywood/gary-oldman-says-he-was-mediocre-in-the-harry-potter-movies-if-i-had-read-the-books-9087507/",
        "title": "Gary Oldman says he was ‘mediocre’ in the <b>Harry</b> Potter movies: ‘If I had read the books…’",
        "description": "Oldman had starred as Sirius Black in The Prisoner of Azkaban, The Goblet of Fire, The Order of the Phoenix and The Deathly Hallows Part 2."
    },
    {
        "url": "https://triblive.com/aande/more-a-and-e/2023-taylors-version-the-year-in-pop-culture/",
        "title": "2023 (Taylor&#39;s Version): The year in pop culture",
        "description": "Speaking of scandal, nobody does it better than the royals: <b>PRINCE HARRY</b>’S “Spare” sells more than 3.2 million copies in one week. Also breaking records: SHAKIRA’S “BZRP Music Session #53,” in which she bitingly sings of her ex, former soccer ..."
    },
    {
        "url": "https://www.newsweek.com/kate-middleton-meghan-markle-matching-curtsies-1856346",
        "title": "Kate Middleton and Meghan&#39;s Historic Matching Curtsies Go Viral",
        "description": "The Princess of Wales and Duchess of Sussex&#39;s curtsies during the funeral of Queen Elizabeth II have gone viral online."
    },
    {
        "url": "https://economictimes.indiatimes.com/magazines/panache/harry-potter-star-gary-oldman-says-he-was-mediocre-as-sirius-black/articleshow/106373716.cms",
        "title": "&#39;<b>Harry</b> Potter&#39; star Gary Oldman says he was &#39;mediocre&#39; as Sirius Black",
        "description": "Oldman had revealed that being part of popular franchises &#39;Harry Potter&#39; and Christopher Nolan&#39;s &#39;The Dark Knight&#39; trilogy &quot;saved&quot; him as a single father."
    },
    {
        "url": "https://www.independent.ie/regionals/kerry/news/find-out-what-kerry-readers-enjoyed-in-2023-as-library-reveals-its-most-borrowed-books/a909352612.html",
        "title": "Find out what Kerry readers enjoyed in 2023 as library reveals its most borrowed books",
        "description": "There is nothing like curling up with a good book and there are plenty to choose from on the shelves of Kerry Library, some new, some old but whatever takes your reading taste is available for you."
    },
    {
        "url": "https://www.thehindu.com/entertainment/movies/gary-oldman-says-he-was-mediocre-in-the-harry-potter-movies/article67686227.ece",
        "title": "Gary Oldman says he was ‘mediocre’ in the ‘<b>Harry</b> Potter’ movies",
        "description": "Gary Oldman had starred as Sirius Black in ‘The Prisoner of Azkaban, ‘The Goblet of Fire,’ ‘The Order of the Phoenix’ and ‘The Deathly Hallows Part 2’"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142842-prince-harry-meghan-markles-careers-in-king-charles-hands",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s careers in King Charles&#39; hands",
        "description": "Prince Harry and Meghan Markle&#39;s careers reportedly hang in the balance after it emerged that the couple needed King Charles in order to rebuild their professional lives."
    },
    {
        "url": "https://www.thesarniajournal.ca/news/prince-harry-dog-man-and-a-world-of-curiosities-heres-lambton-county-librarys-top-books-of-2023-8037586",
        "title": "<b>Prince Harry</b>, Dog Man, and A World of Curiosities: Here&#39;s Lambton County Library’s top books of 2023",
        "description": "Lambton County Libraries announced some Year in Review rankings this week, including the most-borrowed book titles of 2023."
    },
    {
        "url": "https://www.vogue.in/content/the-biggest-bombshell-royal-moments-of-2023",
        "title": "The biggest bombshell royal moments of 2023",
        "description": "Need a recap of all the royal moments that happened in 2023? Most people probably do—the past 12 months have been some of the most dramatic on record for the royal family. (Which is saying a lot: since the abdication of King Edward VIII in 1936, the Windsors have regularly made headlines for their sensational behaviour.)"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/the-crown-actor-explains-prince-harry-gave-cold-shoulder-doesnt-speak-anymore.html/",
        "title": "‘The Crown’ Actor Explains Why <b>Prince Harry</b> Gave Him the Cold Shoulder and Doesn’t Speak to Him Anymore",
        "description": "Prince Harry stopped talking to one of &#39;The Crown&#39; actors for doing something the duke and his wife have been doing for years."
    },
    {
        "url": "https://www.aol.com/biggest-celeb-memoir-bombshells-2023-230215740.html",
        "title": "The Biggest Celeb Memoir Bombshells of 2023: <b>Prince Harry</b>&#39;s Todger and More",
        "description": "Celebrity memoir fans received an enormous bounty in 2023, with stars including Britney Spears, Prince Harry and Barbra Streisand dropping books packed with juicy recollections. Harry kicked off the year with his much-discussed memoir,"
    },
    {
        "url": "https://uinterview.com/news/dominic-west-reveals-he-fell-out-with-prince-harry-for-saying-too-much/",
        "title": "Dominic West Reveals He Fell Out With <b>Prince Harry</b> for Saying Too Much",
        "description": "Dominic West has revealed that he had a falling out with <b>Prince Harry</b> in real life. West, who played <b>Prince Harry</b>’s father in the final few seasons of The Crown, said that he isn’t on speaking terms with him anymore. “I said too much in a press ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/gary-oldman-isn-t-love-232900511.html",
        "title": "Gary Oldman Isn’t In Love With His Work In The ‘<b>Harry</b> Potter’ Franchise",
        "description": "Gary Oldman isn’t a big fan of his portrayal of magician Sirius Black in the Harry Potter franchise. Speaking to Josh Horowitz on the latest edition of the Happy Sad Confused podcast, Oldman claims his work in the role was meh in the three films he did in the series."
    },
    {
        "url": "https://nypost.com/2023/12/28/entertainment/lazy-kate-middleton-prince-william-bashed-for-lack-of-2023-engagements-he-is-dianas-son/",
        "title": "‘Lazy’ Kate Middleton, <b>Prince</b> William bashed for lack of 2023 engagements: He is ‘Diana’s son’",
        "description": "Prince William and Kate Middleton are facing scathing criticism for what’s being labeled as their “lazy” approach to Royal Family engagements."
    },
    {
        "url": "https://www.couriermail.com.au/news/national/prince-harrys-absence-in-royal-documentary-is-not-a-surprise/video/9639f6cef14cbf453295a98387bfe48e",
        "title": "<b>Prince Harry</b>’s absence in royal documentary is ‘not a surprise’",
        "description": "Prince Harry being absent from the coronation documentary is “not a surprise” as the prince did not have much engagement in the ceremony at all, Writer and Broadcaster Esther Krakue says. “It’s not a surprise,"
    },
    {
        "url": "https://www.usmagazine.com/entertainment/news/biggest-celeb-memoir-bombshells-of-2023-spare-and-more/",
        "title": "The Biggest Celeb Memoir Bombshells of 2023: <b>Prince Harry</b>’s Todger, Will and Jada’s Split and More",
        "description": "Jada Pinkett Smith, Britney Spears, Prince Harry and more celebrities dropped some major bombshells in the memoirs they released in 2023"
    },
    {
        "url": "https://www.aol.com/lifestyle/king-william-ii-assassinated-brother-210000326.html",
        "title": "Was King William II Assassinated by His Brother <b>Prince Harry</b>?",
        "description": "King William II, the third son of William the Conqueror, was known as William Rufus. He reigned as King of England from 1087 until his death in 1100, at which point his younger brother, Prince Henry, succeeded him as King Henry I. But did Henry have William assassinated?"
    },
    {
        "url": "https://news.sky.com/story/sophie-winkleman-big-suze-actress-says-she-didnt-know-anyone-at-her-royal-wedding-13038685",
        "title": "Sophie Winkleman: &#39;Big Suze&#39; actress says she &#39;didn&#39;t know anyone&#39; at her royal wedding",
        "description": "Best known for her role on cult classic Peep Show - which helped launch the careers of Olivia Colman, David Mitchell, and Robert Webb - Sophie Winkleman is now a regular in royal circles due to her relationship with Frederick Windsor,"
    }
]