[
    {
        "url": "https://www.skynews.com.au/opinion/people-are-sick-of-prince-harry-and-meghan-markles-narcissism-and-selfpity/video/5026bc2dec3c2f5748a613cd55c18b5f",
        "title": "People are sick of <b>Prince Harry</b> and Meghan Markle’s ‘narcissism’ and ‘self-pity’",
        "description": "Spiked Online Chief Political Reporter Brendan O’Neill says people are sick of <b>Prince Harry</b> and Meghan Markle’s “narcissism” and “self-pity”. “Lots of people are saying 2023 seemed to be their annus horribilis to use a phrase that the Queen ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851732/prince-harry-and-meghan-markle-advised-to-come-out-of-a-new-box",
        "title": "<b>Prince Harry</b> and Meghan Markle advised to ‘come out of a new box’",
        "description": "Prince Harry and Meghan Markle are getting a lot of advice, and this time it&#39;s coming from royal commentator Michael Cole who says they need to “come out of a new box” because last year was filled with “criticism, relentlessly, repetitively, of their own family.”"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-smiles-photo-rob-210100860.html",
        "title": "<b>Prince Harry</b> Smiles in New Photo with Rob McElhenney and Glenn Howerton at Soccer Game",
        "description": "Rob McElhenney is giving a glimpse of his hangout with Prince Harry."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851705/prince-harry-draw-a-line-and-move-on-no-more-royal-stories",
        "title": "<b>Prince Harry</b> advised to ‘draw a line and move on’ -- no more royal stories",
        "description": "Royal expert Joe Little is hoping Harry has gotten it out of his system and we won&#39;t be seeing a Spare, Part 2."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-flashes-huge-grin-31801024",
        "title": "<b>Prince Harry</b> flashes huge grin as he poses with Hollywood star at football game without Meghan",
        "description": "Prince Harry was all smiles as he joined American actors Rob McElhenney and Glenn Howerton for a sport outing in Los Angeles, and Meghan Markle was noticeably absent"
    },
    {
        "url": "https://uk.style.yahoo.com/zara-tindalls-3-children-mia-200147627.html",
        "title": "Zara Tindall&#39;s 3 Children: All About Mia, Lena and Lucas",
        "description": "Zara Tindall &#39;s daughters, Mia Grace and Lena Elizabeth, and son, Lucas Philip, are some of the British royal family&#39;s cutest members."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-sad-state-king-31800930",
        "title": "<b>Prince Harry</b> in &#39;sad state&#39; as King Charles missing grandchildren Archie and Lillibet growing up",
        "description": "King Charles has met Prince Archie only a handful of times and Princess Lilibet once since they were born despite the Duke of Sussex making a desperate plea to him."
    },
    {
        "url": "https://www.hellomagazine.com/film/510504/meghan-markle-suits-co-stars-patrick-j-adams-gabriel-macht-golden-globes-reunion/",
        "title": "Meghan Markle&#39;s former Suits co-stars to reunite at Golden Globes after spin-off approved",
        "description": "The show famously featured Meghan Markle ahead of her meeting Prince Harry and becoming the Duchess of Sussex, with the royal retiring from the show in 2018. However, it still holds a firm place in her heart."
    },
    {
        "url": "https://www.ok.co.uk/royal/heartbreaking-reason-queen-refused-take-31799311",
        "title": "Heartbreaking reason Queen refused to take Christmas decorations down before February",
        "description": "The late Queen always went to Sandringham for the Christmas holidays and used to keep her decorations up until February - after the anniversary of her father&#39;s death"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12922667/Rob-McElhenney-shares-selfie-Prince-Harry-star-Duke-attended-football-match-David-Beckhams-Inter-Miami-CF-Los-Angeles-without-Meghan-Markle.html",
        "title": "Rob McElhenney shares selfie with <b>Prince Harry</b> and his co-star after the Duke attended football match between David Beckham&#39;s Inter Miami CF and Los Angeles without Meghan Markle",
        "description": "The beaming Wrexham co-owner poses for the selfie in a bar alongside his It&#39;s Always Sunny in Philadelphia co-star Glenn Howerton, 47, and a grinning Duke of Sussex."
    },
    {
        "url": "https://uk.news.yahoo.com/even-though-archewell-foundation-named-145115419.html",
        "title": "Even though the Archewell Foundation was named after him, here&#39;s the real reason <b>Prince Harry</b> and Megan won&#39;t let Archie near it",
        "description": "Meghan Markle and Prince Harry are set to continue keeping Archie and Lilibet away from their Archewell Foundation, a royal expert has claimed - despite it being named after their son."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25237293/omid-scobie-spotted-la-meghan-markle-royal-racist-names/",
        "title": "Omid Scobie spotted in LA after author claims there’s ‘no doubt’ Meghan Markle ‘fed’ him ‘royal racist’ names",
        "description": "OMID Scobie has been spotted in LA following the release of his bombshell Endgame book which caused a royal racism storm. The royal author, who has been dubbed by some as the Sussexes’"
    },
    {
        "url": "https://uk.news.yahoo.com/turns-prince-harry-hung-always-131727279.html",
        "title": "It Turns Out <b>Prince Harry</b> Hung Out With &#39;It&#39;s Always Sunny in Philadelphia&#39; Stars in 2023",
        "description": "Taking to Instagram, actor Rob McElhenney shared a previously unseen selfie of him with It&#39;s Always Sunny in Philadelphia costar Glenn Howerton and Prince Harry hanging out in a sports bar and looking like they were having the time of their lives. &quot;That picture with Prince Harry is iconic,&quot; commented one person."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-mingles-new-hollywood-31797163.amp",
        "title": "<b>Prince Harry</b> mingles with new Hollywood pals as he&#39;s pictured without wife Meghan Markle",
        "description": "Prince Harry posed for a picture with It’s Always Sunny in Philadelphia&#39;s Rob McElhenney and Glenn Howerton, posing without wife Meghan Markle"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25231681/prince-harry-bar-tv-cast-meghan-markle-new-photo/",
        "title": "<b>Prince Harry</b> hangs at a bar with Rob McElhenney and TV cast without Meghan Markle in new pic",
        "description": "A NEW photo of Prince Harry hanging out with a famous TV cast without Meghan Markle is circulating on Instagram. Actor Rob McElhenney, who stars in It’s Always Sunny in Philadelphia, posted a"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-not-31795811",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;not welcome&#39; with royals as &#39;redemption plan&#39; in ruins",
        "description": "Prince Harry and Meghan Markle stepped down from the Royal Family in 2020 and have had a tense relationship with The Firm ever since, with their &#39;redemption&#39; said to be ruined"
    },
    {
        "url": "https://www.hellomagazine.com/brides/510468/prince-harry-meghan-markle-no-longer-openly-passionate-after-relationship-evolved/",
        "title": "<b>Prince Harry</b> and Meghan Markle no longer &#39;openly passionate&#39; after relationship &#39;evolved&#39;",
        "description": "While the likes of King Charles and Queen Camilla and Prince William and Princess Kate have very rarely held hands or shared a kiss in public, Prince Harry and Meghan Markle regularly broke the status quo and couldn&#39;t hide how in love they were feeling."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/frederik-party-prince-down-earth-122218686.html",
        "title": "Frederik, the &#39;party <b>prince</b>&#39;: the down-to-earth next king of Denmark who met his wife in a pub",
        "description": "He loves Burning Man, used a fake name at Havard and met his Australian-Scottish wife in a Sydney bar. As Crown Prince Frederik prepares to ascend the throne, Katie Strick and Emma Loffhagen report on"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12922373/The-great-escape-Omid-Scobie-spotted-LA-book-Endgame-reignited-race-row-launched-vicious-attacks-Kate-King-Charles-Prince-William.html",
        "title": "The great escape! Omid Scobie is spotted in LA after his book Endgame reignited a race row and launched &#39;vicious&#39; attacks on Kate, King Charles and <b>Prince</b> William",
        "description": "The royal author, who is typically based in East London, cut an unassuming figure as he strolled the streets of LA following the fallout from the royal book."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-frustrated-harry-becomes-31796814",
        "title": "Meghan Markle is &#39;frustrated&#39; with <b>Harry</b> as he becomes more &#39;willing to speak his mind&#39;",
        "description": "The Duchess of Sussex often appears &quot;unhappy&quot; with her husband in public through her body language, according to expert Darren Stanton."
    },
    {
        "url": "https://bylinetimes.com/2024/01/03/from-gb-news-to-prince-harry-and-brexit-byline-times-biggest-stories-from-2023/",
        "title": "From GB News to <b>Prince Harry</b> and Brexit: Byline Times’ Biggest Stories from 2023",
        "description": "Richard Sharp – who has donated more than £400,000 to the Conservatives – gave the money to the Institute for Policy Research (IPR) think tank, Byline Times reported. He was forced to resign not long after, amid this and other outlets’ reporting on his controversial ties to the Tories."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-demands-answers-king-charles-follow-different-rules-comes-using-title.html/",
        "title": "Meghan Markle Demands Answers From King Charles Over Why She Has to Follow Different Rules When it Comes to Using Her Title",
        "description": "Meghan Markle is reportedly unhappy about the rules regarding the use of her title and wants answers from King Charles."
    },
    {
        "url": "https://popculture.com/lifestyle/news/king-charles-might-abdicate-throne-prince-william-royal-expert-says/",
        "title": "King Charles Might Abdicate His Throne for <b>Prince</b> William, Royal Expert Says",
        "description": "King Charles III only made his ascension to the throne in 2022, one Royal expert says he might abdicate at some point for his eldest son, Prince William. Speaking to the Daily Mail, Royal biographer Phil Dampier commented on the recent news out of Denmark,"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12923785/Harry-Styles-ditches-buzz-cut-grows-locks.html",
        "title": "<b>Harry</b> Styles&#39; fans in relief as singer ditches short-lived buzz cut and grows back much-loved locks: &#39;Hide the scissors!&#39;",
        "description": "Harry Styles, 29, has now seemingly ditched his short-lived trim and started growing back his precious long locks."
    },
    {
        "url": "https://www.kmuw.org/2024-01-03/check-it-out-wichitas-most-popular-library-books-for-2023",
        "title": "Check it out: Wichita&#39;s most popular library books for 2023",
        "description": "The most borrowed nonfiction book from the Wichita Public Library in 2023 was Prince Harry’s memoir, “Spare.” The most popular fiction book was &quot;Desert Star&quot; by Michael Connelly. The most popular e- or audiobook was &quot;Fourth Wing&quot; by Rebecca Yarros."
    },
    {
        "url": "https://people.com/prince-harry-smiles-new-photo-rob-mcelhenney-glenn-howerton-8421961",
        "title": "<b>Prince Harry</b> Smiles in New Photo with Rob McElhenney and Glenn Howerton at Soccer Game",
        "description": "Prince Harry, the Duke of Sussex, posed for a previously unseen picure with Rob McElhenney and Glenn Howerton — all about the shot and their hangout at a soccer game in L.A."
    },
    {
        "url": "https://nypost.com/2024/01/03/entertainment/prince-william-kate-middleton-have-heated-fights-expert/",
        "title": "<b>Prince</b> William and Kate Middleton have ‘heated’ fights due to his ‘short fuse’: royal author",
        "description": "The Duke of Cambridge, 41, allegedly has a “notably short fuse,” according to royal author Robert Jobson. The writer penned in his book The Making of a Modern Monarch that the future king and his wife, Kate Middleton, have often had “heated” fights and he “can be a bit of a shouter when he loses it.”"
    },
    {
        "url": "https://www.sarniathisweek.com/news/local-news/prince-harry-tops-lambton-county-librarys-most-read-list-of-2023-2",
        "title": "<b>Prince Harry</b> tops Lambton County Library&#39;s most-read list of 2023",
        "description": "A British royal family tell-all by a prince who decamped for California topped the list of the most borrowed books of 2023 at the Lambton County Library. Spare, by Prince Harry, was crowned the most-read book in 2023 among more than 551,"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-stance-letting-king-202200743.html",
        "title": "<b>Prince Harry</b>’s Stance on Letting King Charles See Kids Archie &amp; Lilibet Has Reportedly Taken a 180",
        "description": "Things may not be what they seem. Ever since Prince Harry and Meghan Markle left the UK, many royal fans wondered if the British royal family would ever see the Duke and Duchess of Sussex’s children,"
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-wants-to-be-the-queen-says-a-royal-author/",
        "title": "Meghan Markle ‘wants to be the Queen,’ says a Royal author",
        "description": "Prince Harry&#39;s famous wife, Meghan Markle is not happy with her Duchess title as a royal author says she wants to &#39;be the queen.&#39;"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144459-meghan-markle-prince-harrys-tough-time-begins",
        "title": "Meghan Markle, <b>Prince Harry</b>&#39;s tough time begins?",
        "description": "Prince Harry and Meghan Markle have received the first major snub of 2024 from the royal family.The royal family&#39;s official social media accounts have shared sweet pictures of King Charles,"
    },
    {
        "url": "https://www.btimesonline.com/articles/163037/20240104/prince-harry-speaks-out-meghan-markle-shows-strain-the-sussexes-struggle-for-individuality.htm",
        "title": "<b>Prince Harry</b> Speaks Out, Meghan Markle Shows Strain: The Sussexes&#39; Struggle for Individuality",
        "description": "Prince Harry and Meghan Markle have entered a phase where the dynamics of their relationship and individual paths are under intense scrutiny. 2023 saw them branded as the &quot;biggest losers,&quot; but they&#39;re eyeing 2024 as a year of redemption and rebranding."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-george-had-sweetest-big-191200078.html",
        "title": "<b>Prince</b> George Had the Sweetest Big Brother Moment With <b>Prince</b> Louis",
        "description": "During this year’s walk, 10-year-old George received a large brown teddy bear dressed in a striped sweater. In a video captured by a fan and posted to TikTok, George brought his gift straight to five-year-old Louis, who was shyly waving to the crowd, to show off the stuffed animal."
    },
    {
        "url": "https://vancouversun.com/news/local-news/surrey-and-vancouver-libraries-share-top-books-2023",
        "title": "What were people reading in 2023? Surrey and Vancouver libraries share top picks",
        "description": "The highest-circulating title Surrey Libraries readers borrowed in 2023 was Spare by Prince Harry, which was the second-most borrowed on the Vancouver Public Library list. It Starts with Us by Colleen Hoover also made both lists."
    },
    {
        "url": "https://www.samaa.tv/208737349-meghan-markle-set-to-embark-on-a-transformative-journey-in-2024",
        "title": "Meghan Markle set to embark on a transformative journey in 2024",
        "description": "In an exclusive conversation with Hello! Magazine, Frank shared her insights into Meghan&#39;s astrological profile, emphasizing her perpetual drive to &#39;be someone&#39; and the continuous pursuit of fame, fortune,"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-finds-irritating-prince-183415374.html",
        "title": "<b>Prince Harry</b> Finds It ‘Irritating’ That <b>Prince</b> Andrew Was Welcomed to the Royal Christmas Broadcast",
        "description": "In his second annual Christmas broadcast, recorded at Buckingham Palace and aired December 25, King Charles III emphasized tolerance and togetherness in the face of a world divided. “I pray that we can also do all in our power to protect each other,"
    },
    {
        "url": "https://wealthofgeeks.com/historic-moments-covered-on-tv/",
        "title": "From Volcanic Eruptions to Royal Weddings: 50 Historic Moments Covered on TV",
        "description": "There are events that have transpired throughout history, some of which we weren’t able to witness. Over time, with the advent of the"
    },
    {
        "url": "https://uk.movies.yahoo.com/princess-charlotte-shares-flowers-cousin-181228423.html",
        "title": "Princess Charlotte Shares Flowers with Cousin Mia Tindall in Sweet Moment Captured by Fans",
        "description": "At one point that was captured on camera by a well-wisher and shared on TikTok, where it has amassed over 5 million views, 9-year-old Mia noticed a member of the crowd was trying to give Princess Charlotte, 8, flowers. When she got Princess Charlotte&#39;s attention, they exchanged a few words, then Mia came over to accept the flowers with a smile."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/suggestions-king-charles-abdicate-denmarks-173912558.html",
        "title": "Suggestions that King Charles should abdicate like Denmark&#39;s Queen Margrethe are &#39;unwarranted,&#39; royal commentators say",
        "description": "Royal commentators told BI that it&#39;s unlikely King Charles would hand the throne to Prince William and Kate Middleton anytime soon."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markles-2024-31794960",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;2024 redemption plan&#39; in ruins after Christmas snub",
        "description": "Prince Harry and Meghan Markle&#39;s hope for &#39;redemption&#39; in 2024 is thought to have been &#39;ruined&#39; following their decision to not join the Royal Family for Christmas"
    },
    {
        "url": "https://www.telegraph.co.uk/fashion/royals/zara-tindall-winning-style-makeover/?n=@",
        "title": "How Zara Tindall got her winning style makeover",
        "description": "In the late summer of 2022, as nostalgia for all things Y2K (aka 2000) reached its bewildering zenith, Tatler anointed Zara Tindall its high priestess of Y2K style."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-william-frustrated-harry-able-31794823.amp",
        "title": "<b>Prince</b> William &#39;frustrated&#39; <b>Harry</b> was able to do the one thing he wasn&#39;t",
        "description": "Prince Harry says that there was one thing that he was allowed to do, that Prince William never was because he is heir to the throne, which created a huge amount of &#39;frustration&#39; for him"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510453/prince-harry-partying-rob-mcelhenney-unseen-photo/",
        "title": "<b>Prince Harry</b> seen partying with TV star Rob McElhenney in new unseen photo",
        "description": "The It&#39;s Always Sunny in Philadelphia actor is the co-owner of football club Wrexham A.F.C. with Ryan Reynolds"
    },
    {
        "url": "https://www.ibtimes.co.uk/comedian-mocks-prince-harry-meghan-markle-compares-sussexes-prince-andrew-1722512",
        "title": "Comedian Mocks <b>Prince Harry</b>, Meghan Markle, Compares Sussexes To <b>Prince</b> Andrew",
        "description": "Prince Harry and Meghan Markle became the brunt of the joke in a stand-up sketch by Simon Brodkin, who mocked how the couple celebrated their Halloween together in 2016."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markle-will-take-world-storm-search-fame-2024-says-astrologer-1722505",
        "title": "Meghan Markle Will &#39;Take World By Storm&#39; In Search For Fame In 2024, Says Astrologer",
        "description": "&quot;She is always looking for the next step towards fame, fortune and expansion in her message and reach,&quot; Debbie Frank said."
    },
    {
        "url": "https://voiceonline.com/surrey-libraries-reaches-record-breaking-1-1-million-digital-book-checkouts-in-2023/",
        "title": "Surrey Libraries reaches record-breaking 1.1 million digital book checkouts in 2023",
        "description": "The highest-circulating title Surrey Libraries readers borrowed in 2023 was Spare by <b>Prince Harry</b>, the Duke of Sussex. The top-circulating genre was romance, in a vast catalogue that also includes the most popular fiction, mystery, biographies, self-help ..."
    }
]