[
    {
        "url": "https://www.hellomagazine.com/tags/meghan-markle/132/",
        "title": "Meghan Markle, the Duchess of Sussex, News - Page 133",
        "description": "Discover all of the latest news and updates, including exclusive interviews from the UK, US and rest of the world - HELLO!"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12920361/prince-andrew-sarah-ferguson-marry-rumours.html",
        "title": "EPHRAIM HARDCASTLE: Rumours swirl that <b>Prince</b> Andrew and Sarah Ferguson are thinking about marrying again... But were they pushed by the Palace to divorce in the first place?",
        "description": "Should the Duke and Duchess of York have divorced in the first place? Sarah&#39;s father, Major Ronald Ferguson, blamed the Palace for pushing them into it."
    },
    {
        "url": "https://uk.movies.yahoo.com/crown-luther-ford-shares-text-204512266.html",
        "title": "“The Crown”&#39;s Luther Ford Shares Text Conversation That Inspired Him to Audition for <b>Prince Harry</b> Role",
        "description": "Luther Ford is looking back on a memorable 2023. In an Instagram post on New Year&#39;s Eve, the actor shared a carousel of images from throughout the year, including a screenshot of a text conversation that seems to have been the inspiration behind his audition to play teenage Prince Harry on The Crown."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25228145/princess-kate-mary-of-denmark-bond-similarities/",
        "title": "How Princess Kate and lookalike Danish royal pal Mary bonded over bitter sister-in-law feuds and shared glam style",
        "description": "SHE is often compared to royal lookalike the Princess of Wales – but Princess Mary of Denmark shares more with pal Kate than her graceful style and glossy brunette locks. The friends and future"
    },
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-2023-wrap-up-royal-kids-8421434",
        "title": "Kate Middleton and <b>Prince</b> William&#39;s 2023 Wrap-Up Included Never-Before-Seen Clips of the Royal Kids",
        "description": "With 2023 in the rear-view mirror, Kate Middleton and her husband, Prince William, gave royal fans a quick recap of the year with a year-end roundup. And while even the most devoted royal followers will recognize many of the big moments from 2023,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-no-31792398.amp",
        "title": "Meghan Markle and <b>Prince Harry</b> have &#39;no chance of reconciling with the Royal Family&#39;",
        "description": "Prince Harry and Meghan Markle will not be able to mend their relationship with the Royal Family as an expert says 2024 will see &quot;the continuation of the huge void between them.&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harry-facing-31790880",
        "title": "Meghan Markle and <b>Prince Harry</b> are facing a &#39;make or break&#39; year as they look to &#39;step up&#39;",
        "description": "Prince Harry and Meghan Markle are reportedly planning to buckle down on their brand for the next twelve months, with the couple planning to &#39;get their game face on&#39; in 2024"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1851158/meghan-markle-prince-harry-savaged-latest-joke",
        "title": "How Meghan Markle and <b>Prince Harry</b> were spoofed in 2023 as couple roasted once again",
        "description": "Meghan Markle and Prince Harry were the butt of many jokes in 2023 - a trend that may continue into the New Year. Here&#39;s a rundown of the highlights so far."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/prince-william-loathed-princess-diana-28378254",
        "title": "<b>Prince</b> William &#39;loathed&#39; when Princess Diana dressed him the same as <b>Harry</b>",
        "description": "In his memoir, Spare, Prince Harry claims that his older brother Prince William &quot;didn&#39;t want to know him&quot; at Eton and hated the two of them being thought of as a &#39;package deal.&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850892/royal-family-live-prince-harry-apologise-King-Charles",
        "title": "Royal Family LIVE: <b>Prince Harry</b> urged to ‘apologise’ over remark to be ‘accepted’ by King",
        "description": "There is a way for Prince Harry to reenter the Royal Family, a royal expert has claimed - but it will take a good deal of humility from the Duke."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25223592/meghan-harry-wont-get-redemption-kate-william-christmas/",
        "title": "Meghan &amp; <b>Harry</b> ‘WON’T get redemption in 2024’ after Kate &amp; Wills’ Christmas power move, claims royal author",
        "description": "MEGHAN Markle and Prince Harry won’t get the “year of redemption” they are hoping for in 2024, according to a royal author. The Duke and Duchess of Sussex are said to be planning to have a fresh"
    },
    {
        "url": "https://uk.movies.yahoo.com/32-interesting-facts-duchess-sophie-125159127.html",
        "title": "32 interesting facts about Duchess Sophie, including her close relationship with Queen Elizabeth and her normal upbringing",
        "description": "Duchess Sophie lived a relatively normal life before marrying into the royal family - so what do you need to know about Prince Edward’s wife?"
    },
    {
        "url": "https://uk.news.yahoo.com/real-reason-why-queen-margrethe-123000504.html",
        "title": "The real reason why Queen Margrethe II has turned her back on the throne",
        "description": "Count Nikolai of Monpezat returned to social media, a day after his grandmother, Queen Margrethe II of Denmark, confirmed her abdication from the Danish throne. The Prince and Princess of Wales have revealed their garden at their new home, Adelaide Cottage, where they live with Prince George, Princess Charlotte and Prince Louis."
    },
    {
        "url": "https://www.irishmirror.ie/news/world-news/meghan-markles-bridesmaid-dress-tailor-31785299",
        "title": "Meghan Markle&#39;s bridesmaid dress tailor lifts lid on row that made Charlotte cry",
        "description": "Meghan Markle, who married Prince Harry in May 2018, a ceremony for which bridesmaid dresses were tailored by Ajay Mirpuri, who has spoken out about Meghan&#39;s row with Kate Middleton at the time"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-harry-behind-wanted-31788268",
        "title": "Meghan Markle and <b>Harry</b> are &#39;behind where they wanted to be&#39; and hope for a &#39;much better&#39; 2024",
        "description": "Sources say Meghan Markle is &#39;frustrated at the lack of progress&#39; she&#39;s made in her career alongside her husband Prince Harry and fears &#39;disaster&#39; in the year ahead"
    },
    {
        "url": "https://uk.news.yahoo.com/harry-potter-jessie-cave-daniel-radcliffe-encounter-120646779.html",
        "title": "<b>Harry</b> Potter&#39;s Jessie Cave recalls &#39;excruciating&#39; Daniel Radcliffe encounter",
        "description": "Harry Potter actress Jessie Cave has recounted an embarrassing time she approached Daniel Radcliffe out in public."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-prince-william-left-31787928",
        "title": "King Charles and <b>Prince</b> William left &#39;hurt&#39; over Meghan and <b>Harry</b>&#39;s silence after Endgame attacks",
        "description": "The Sussexes have remained noticeably quiet after Omid Scobie released his bombshell Endgame biography in November which featured a number of shocking allegations against the senior members of the Royal Family."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-william-loathed-princess-diana-31786983",
        "title": "<b>Prince</b> William &#39;loathed&#39; Princess Diana for her very public act involving him and <b>Harry</b>",
        "description": "The Prince of Wales has many fond memories with his mother Princess Diana but there was one thing that the late royal had him and Prince Harry do which he couldn&#39;t stand."
    },
    {
        "url": "https://www.harpersbazaar.com/uk/celebrities/news/a46263418/prince-william-kate-middleton-2023-montage-wales-kids/",
        "title": "The <b>Prince</b> and Princess of Wales reflect on 2023 with a montage of sweet family-filled moments",
        "description": "The reel opens with a behind-the-scenes look at the Wales Family from King Charles’ coronation, as they descend a staircase in their ceremonial clothes with the text “This was 2023” layered over the top."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-leave-montecito-will-do-what-royals-least-expect-2024-says-astrologer-1722489",
        "title": "<b>Prince Harry</b> To Leave Montecito, Will Do What Royals &#39;Least Expect&#39; in 2024, Says Astrologer",
        "description": "Frank, a former confidante and close friend of Princess Diana, said the 39-year-old &quot;feels restless and longing for a fresh start&quot;. This could mean &quot;upping sticks again with his family and doing what the royal family least expects&quot;."
    },
    {
        "url": "https://www.ibtimes.co.uk/kate-middleton-will-shine-king-charles-iii-face-challenges-2024-predicts-astrologer-1722486",
        "title": "Kate Middleton &#39;Will Shine&#39; And King Charles III To Face Challenges In 2024, Predicts Astrologer",
        "description": "&quot;This year is pushing her to new heights of visibility and achievement,&quot; astrologer Debbie Frank said of the Princess of Wales."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/02/65947a5d22601d56348b4586.html",
        "title": "&#39;Meghan Markle wants to be Queen&#39;",
        "description": "Meghan Markle&#39;s aspirations for a royal role reminiscent of a queen may not align with reality, according to insights from royal author Tom Bower. The 42-year-old former &quot;Suits&quot; ac"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-louis-reportedly-given-special-201227105.html",
        "title": "<b>Prince</b> Louis Was Reportedly Given a Special Tradition-Breaking Wardrobe ‘Privilege’ &amp; We’re Reassessing Our Closet",
        "description": "Hear ye! Hear ye! Gather round, mere peasants. It’s time to turn to the royals for some fashion advice. And no, this time we’re not talking about Kate Middleton’s exquisite style. We’re talking about Prince Louis’ surprising outfits that — much like the hilarious prince — buck tradition."
    },
    {
        "url": "https://www.samaa.tv/208737261-meghan-markle-s-struggle-for-lucrative-deals-continues-amidst-royal-fallout",
        "title": "Meghan Markle&#39;s struggle for lucrative deals continues amidst royal fallout",
        "description": "Borkowski suggested that such public appearances indicate a strategic move to put herself on display for potential casting opportunities and bookings. &quot;That’s what Meghan’s been about,&quot; he remarked."
    },
    {
        "url": "https://www.samaa.tv/208737266-prince-harry-navigates-sensitivity-amid-allegations-of-intellectual-capability",
        "title": "<b>Prince Harry</b> navigates sensitivity amid allegations of intellectual capability",
        "description": "The challenges of parenthood add another layer to the couple&#39;s dynamic, with young children Archie and Lilibet demanding their attention. The Telegraph reported tensions in the marriage, citing a close friend who acknowledged,"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-abdul-mateen-brunei-shares-175927707.html",
        "title": "<b>Prince</b> Abdul Mateen of Brunei Shares First Photo of New Fiancée and Her Huge Engagement Ring!",
        "description": "Prince Abdul Mateen of Brunei and his fiancée Anisha Isa Kalebic are all smiles as they prepare to tie the knot in a lavish royal wedding next week. On New Year&#39;s Eve, the 32-year-old son of Sultan Hassanal Bolkiah shared the first portrait of the couple, just days before their 10-day wedding event."
    },
    {
        "url": "https://nypost.com/2024/01/02/entertainment/prince-harry-hangs-at-bar-with-its-always-sunny-in-philadelphia-cast-photo/",
        "title": "<b>Prince Harry</b> pops up at bar with TV cast in new photo",
        "description": "The redheaded royal made a surprise appearance on Instagram Monday after Rob McElhenney posted a photo of himself and his “It’s Always Sunny in Philadelphia” co-star Glenn Howerton hanging out with Harry. In the photo, Harry, 39, sports a black shirt and matching blazer while taking the pic with McElhenney, 46, and Howerton, 47."
    },
    {
        "url": "https://regina.ctvnews.ca/this-was-regina-s-most-borrowed-book-of-2023-1.6707719",
        "title": "This was Regina&#39;s most borrowed book of 2023",
        "description": "According to Regina Public Library (RPL) Prince Harry’s Spare was the most borrowed book in 2023. “The controversial memoir by Prince Harry topped the most borrowed list for nonfiction and overall titles at Regina Public Library in 2023,” a release from RPL said."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12919853/Harry-Pitman-mother-joins-mourners-vigil-son-stabbed-death-Primrose-Hill-New-Years-Eve-fireworks.html",
        "title": "Heartbroken mother of murdered <b>Harry</b> Pitman joins 100 mourners at vigil for her son after he was stabbed to death at Primrose Hill New Year&#39;s Eve fireworks",
        "description": "Amanda Woolveridge was supported by eldest daughter Tayla, 19 and 18-year-old son Patrick as well as her brother Terry Woolveridge, Harry&#39;s uncle at Downhills Park this evening."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144125-prince-harry-meghan-markle-blasted-for-pulling-pin-on-fun-grenade",
        "title": "<b>Prince Harry</b>, Meghan Markle blasted for pulling &#39;pin on fun grenade&#39;",
        "description": "UK comedian Simon Brodkin, who used to perform as Lee Nelson, has ridiculed Prince Harry and Meghan Markle during a live stand-up show.The Duke of Sussex was brutally mocked by the stand-up"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144119-prince-harrys-one-move-can-melt-king-charles-heart",
        "title": "<b>Prince Harry</b>&#39;s one move can melt King Charles&#39; heart",
        "description": "Prince Harry, wo&#39;s said to be desperate to return to the royal family fold, has been given a crucial advice to melt his father King Charles&#39;s heart.There is a way for the Duke to reunite with"
    },
    {
        "url": "https://nypost.com/2024/01/02/entertainment/meghan-markle-wants-to-be-queen-kate-middleton-has-everything-she-wants/",
        "title": "Meghan Markle wants to be queen: Kate Middleton ‘has everything she wants’",
        "description": "Royal author Tom Bower gave his take on the Duchess of Sussex’s longing to be back within the Firm — years after she left with husband Prince Harry."
    },
    {
        "url": "https://www.newsweek.com/why-kate-middleton-watch-new-royal-drama-denmark-princess-mary-closely-1857081",
        "title": "Why Kate Middleton Must Watch New Royal Drama Closely",
        "description": "Kate has &quot;a long while to wait until she is queen,&quot; but will watch Europe&#39;s newest consort &quot;closely,&quot; Newsweek has heard."
    },
    {
        "url": "https://www.vanityfair.com/hollywood/mickey-mouse-has-entered-the-public-domain-and-can-kill-you-now",
        "title": "Mickey Mouse Has Entered the Public Domain, and Can Kill You Now",
        "description": "Multiple horror projects starring the earliest version of Disney&#39;s signature mouse, Steamboat Willie, are in the works now that the original Mickey Mouse has entered the public domain."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-upcoming-career-plans-153239580.html",
        "title": "Meghan Markle&#39;s Upcoming Career Plans Reportedly Avoid &#39;Anything Royal&#39; After Tough 2023",
        "description": "Meghan Markle finally has 2023 behind after a year of challenges with the royal fallout from Prince Harry’s memoir, Spare, and the cancellation of the couple’s Spotify deal. In the year ahead, the Duchess of Sussex is looking to make her mark on Hollywood in a new way,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-rocky-relationship-netflix-2024-begins.html/",
        "title": "<b>Prince Harry</b> and Meghan Markle Have a ‘Rocky’ Relationship With Netflix as 2024 Begins",
        "description": "Is Prince Harry and Meghan Markle&#39;s relationship with Netflix rocky? A royal commentator weighs in on the their professional goals for 2024."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/inside-the-scandals-of-the-danish-royals-as-frederik-and-mary-prepare-to-become-king-and-queen/news-story/419d507a3bc6ef2f726567356cd06b1c",
        "title": "Inside the scandals of the Danish royals as Frederik and Mary prepare to become king and queen",
        "description": "Europe’s oldest ruling monarchy is set for a dramatic and unexpected shake-up, with the exit of a beloved ruler and the instalment of a new one who’s recently been engulfed in scandal – and not for the first time."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeths-very-different-reactions-kate-middleton-meghan-markles-wedding-dresses-caught-camera.html/",
        "title": "Queen Elizabeth’s Very Different Reactions to Kate Middleton’s and Meghan Markle’s Wedding Dresses Caught on Camera",
        "description": "A video is circulating on TikTok of the Queen Elizabeth seeing her granddaughters-in-law in their dresses the day of their royal weddings."
    },
    {
        "url": "https://www.itv.com/watch/news/harry-pitmans-grandfather-speaks-of-heartbreak-following-fatal-stabbing/h5bp8ps",
        "title": "<b>Harry</b> Pitman&#39;s grandfather speaks of heartbreak following fatal stabbing",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://www.thesun.ie/royals/11938263/meghan-markle-couldnt-land-big-fish-career-makeover-kate/",
        "title": "Meghan Markle ‘couldn’t land the big fish’, author claims she’s failed at a career makeover as Kate’s popularity soars",
        "description": "MEGHAN Markle’s attempt at a career makeover failed in 2023, according to a royal author, and she “couldn’t land the big fish.” The Duchess of Sussex, 42, is said to have been"
    },
    {
        "url": "https://www.cjme.com/2024/01/02/regina-public-library-releases-list-of-most-borrowed-books-in-2023/",
        "title": "Regina Public Library releases list of most-borrowed books in 2023",
        "description": "A controversial memoir by a member of the Royal Family was the most-borrowed book at the Regina Public Library in 2023. <b>Prince Harry</b>’s Spare was the most popular book on the library’s non-fiction and overall lists last year. “Popular culture has a ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/162994/20240102/prince-harrys-2024-astrological-forecast-points-to-major-life-changes.htm",
        "title": "<b>Prince Harry</b>&#39;s 2024 Astrological Forecast Points to Major Life Changes",
        "description": "As 2024 dawns, it&#39;s not just the stars that are aligning in an intriguing pattern for Prince Harry - it&#39;s his entire life. Astrologer Debbie Frank, once a confidante of Princess Diana, foresees a year of profound reflection and potential upheaval for the Duke of Sussex."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/02/denmark-abdication-king-charles-prince-william-monarchy",
        "title": "King Charles should follow Denmark’s example – and tell us when he’ll abdicate",
        "description": "Queen Margrethe is the latest European monarch to make way for new blood. It puts our archaic system to shame, says Guardian columnist Simon Jenkins"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/did-king-charles-meet-prince-harry-meghans-children-archie-and-lilibet-101704194690443.html",
        "title": "Did King Charles meet <b>Prince Harry</b>-Meghan&#39;s children Archie and Lilibet?",
        "description": "Prince Harry and Meghan Markle were evicted them from Frogmore Cottage last year as they were asked to vacate the property by King Charles."
    },
    {
        "url": "https://www.hindustantimes.com/author/ismat-tahseen-101704092907621",
        "title": "Ismat Tahseen",
        "description": "Read the latest articles by Ismat Tahseen on the trending topics, breaking news and top headlines at Hindustan Times."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/queen-margrethes-abdication-could-king-charles-follow-in-her-footsteps_art20612.html",
        "title": "Queen Margrethe’s abdication: Could King Charles follow in her footsteps?",
        "description": "In her New Year speech on 31 December 2023, Queen Margrethe of Denmark announced her abdication. Her stepping down will take place on 14 January, exactly 52 years after her"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-william-got-water-fight-during-royal-family-christmas-party-1722484",
        "title": "<b>Prince</b> William Got Into &#39;Water Fight&#39; During Royal Family Christmas Party",
        "description": "Prince William once let loose during a Christmas party with the royal family, and he ended up getting involved in a hilarious water fight."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/510413/crown-princess-mary-of-denmark-looks-like-kate-middleton/",
        "title": "Crown Princess Mary of Denmark looks like a young Kate Middleton rocking low-rise jeans in rare noughties photo",
        "description": "Stepping out at Christian VII&#39;s Palace, Amalienborg on 1 January alongside her husband Crown <b>Prince</b> Frederik for the New Year’s levee and banquet, the royal looked breathtaking in a velvet scarlet gown and the Danish Ruby Parure Tiara. As the ..."
    }
]