[
    {
        "url": "https://www.thetimes.co.uk/article/stop-conservation-groups-persecuting-indigenous-people-rsfv36n3k",
        "title": "Stop conservation groups persecuting indigenous people",
        "description": "The calls for <b>Prince Harry</b> to resign from the board of the charity African Parks, after revelations that its rangers have been brutally persecuting the indigenous Baka people in Congo, do not come out of the blue. Survival International has long been ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-hacking-trial-legal-bill-vm790zwgs",
        "title": "<b>Prince Harry</b> demands second hacking trial against Mirror Group",
        "description": "The Duke of Sussex wants a second tabloid hacking trial “as soon as possible” despite the publisher of the Daily Mirror seeking legal costs totalling £350,000 from other celebrity complainants. In December the duke won £140,600 in compensation after ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25586537/prince-harry-royalty-loyalty-charles-hospital/",
        "title": "<b>Harry</b>’s silence over King &amp; Kate’s health must be final nail in coffin of public opinion – we like loyalty from royalty",
        "description": "LITTLE makes <b>Prince Harry</b> happier than a snazzy private jet. Other things that make our Eton-educated duke happy, in no particular order, are money, PR opportunities and slagging off the monarchy (for the aforementioned money and PR). So the very fact ..."
    },
    {
        "url": "https://www.bournemouthecho.co.uk/news/national/24082915.documentary-world-goes-inside-recording-1985-charity-single/",
        "title": "Documentary on We Are The World goes inside recording of 1985 charity single",
        "description": "Netflix documentary The Greatest Night In Pop is a behind-the-scenes look at the creation of We Are The World."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861010/king-charles-princess-kate-hospital-visit",
        "title": "King Charles showcases one &#39;very sweet&#39; quality after double royal health scare",
        "description": "The king is believed to admire how Kate is raising her children. Ms Levin, who has written a number of books about the royals, including a profile of <b>Prince Harry</b>, also paid tribute to Queen Camilla for ignoring royal protocol by visiting the King during ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-urged-step-down-172940807.html",
        "title": "<b>Prince Harry</b> Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "African Parks issued a statement saying that an &quot;active, ongoing investigation&quot; into the claims was its &quot;highest priority&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860984/meghan-markle-windsor-suite-princess-kate",
        "title": "Meghan Markle&#39;s &#39;Windsor suite demand&#39; in bid to compete with Princess Kate",
        "description": "Meghan Markle has been accused of making &quot;demands&quot; to get better accommodation when living in the UK with <b>Prince Harry</b>. The Duchess of Sussex moved to the UK in November, 2017 after the Duke of Sussex proposed at their first home Nottingham Cottage."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-losing-31994145.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;losing support&#39; and desperate for deal amid latest row",
        "description": "<b>Prince Harry</b> and Meghan Markle are reportedly desperate for new deals as the couple continues to lose public support amid the latest royal row. The Duke and Duchess of Sussex stepped down as senior working royals in January 2020 and relocated to the US in ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-lawyers-seek-2-154300654.html",
        "title": "<b>Prince Harry</b>’s Lawyers Seek $2.5 Million In Fees After Win In Tabloid Phone Hacking Case",
        "description": "LONDON (AP) — A lawyer for Prince Harry asked a judge Monday to order the publisher of the Daily Mirror tabloid to pay nearly 2 million pounds ($2.5 million) for a portion of the legal fees spent to prove that Mirror Group Newspapers invaded his privacy by hacking his phone and using unlawful means to dig up scoops on him."
    },
    {
        "url": "https://news.sky.com/story/prince-harrys-lawyers-want-2m-in-costs-from-daily-mirror-publisher-13059447",
        "title": "<b>Prince Harry</b>&#39;s lawyers want £2m in costs from Daily Mirror publisher",
        "description": "Lawyers representing <b>Prince Harry</b> and other high profile figures involved in a legal battle with the publisher of the Daily Mirror over phone hacking are seeking £2m in costs, a court has heard. Last month, a judge ruled that phone hacking became ..."
    },
    {
        "url": "https://uk.news.yahoo.com/revelations-world-doc-waylon-jennings-202000300.html",
        "title": "All the Revelations in the New “We Are the World” Doc, from Waylon Jennings&#39; Exit to the <b>Prince</b> Solo That Never Was",
        "description": "“<b>Harry</b> Belafonte was the most inspirational person for all of ... The event organizers felt strongly about getting <b>Prince</b> involved, as he was a superstar who was commanding the charts at the time. To help sweeten the deal, they got his collaborator ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/29/prince-harry-further-legal-action-mirror-after-court-win/",
        "title": "<b>Prince Harry</b> considers further legal action against Mirror newspapers after court victory",
        "description": "<b>Prince Harry</b> hailed himself a &#39;dragon slayer&#39; after his victory in court over Mirror Group Newspapers Credit: Adrian DENNIS / AFP/Adrian DENNIS / AFP The Duke of Sussex is considering further legal action against Mirror Group Newspapers (MGN) if he is not ..."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-mirror-hacking-trial-2878307?ico=related_article_inline",
        "title": "Mirror publisher faces £2m legal costs after <b>Prince Harry</b> hacking trial",
        "description": "On Monday, during the latest hearing on the case, the High Court heard the group, whose claims were brought alongside <b>Prince Harry</b>’s, are seeking payment of £1,976,660 from MGN towards legal costs. David Sherborne, barrister for the claimants ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/kate-middletons-health-scare-could-31991342.amp",
        "title": "Kate Middleton&#39;s health scare could spark <b>Prince Harry</b> and Meghan Markle reconciliation, says pal",
        "description": "The Princess of Wales&#39; health scare and surgery could lead to bridges being built between the Waleses and <b>Prince Harry</b> and Meghan Markle, according to a pal. Kate, 42, was in hospital for almost two weeks following abdominal surgery and she is not expected ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-phone-hacking-mirror-group-b2486499.html",
        "title": "<b>Prince Harry</b> pursues 115 further phone hacking claims after Mirror victory",
        "description": "<b>Prince Harry</b>’s case against MGN remains ongoing as he presses ahead with a further 115 articles that he claims were sourced unlawfully, with decisions on costs reserved until this is determined. Last month, a judge ruled that hacking became widespread ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-plan-build-bridges-31972393",
        "title": "<b>Prince Harry</b>&#39;s plan to &#39;build bridges&#39; with The Firm after dad&#39;s surgery",
        "description": "After OK! exclusively revealed that <b>Prince Harry</b> has &quot;shut down&quot; Meghan Markle&#39;s plans to write a tell-all book following his own bombshell memoir Spare, sources tell us <b>Harry</b> is on a mission to &quot;build bridges&quot;. After years of apparent discord between ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/prince-harry-charity-investigated-rape-torture-allegations/?n=@",
        "title": "Charity linked to <b>Prince Harry</b> investigated over allegations of rape and torture",
        "description": "Duke of Sussex was president of non-profit African Parks from 2017 until last year, when he was appointed to the organisation’s board of directors Credit: Pool/wireimage A charity linked to <b>Prince Harry</b> is investigating allegations of rape and torture ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24082915.documentary-world-goes-inside-recording-1985-charity-single/",
        "title": "Documentary on We Are The World goes inside recording of 1985 charity single",
        "description": "Netflix documentary The Greatest Night In Pop is a behind-the-scenes look at the creation of We Are The World."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861013/prince-harry-meghan-markle-netflix-paramount-deal",
        "title": "<b>Prince Harry</b> and Meghan eyeing up new deal for &#39;juicy&#39; Netflix sequel with competitor",
        "description": "A PR expert suggested Prince Harry and Meghan Markle could be hoping to snatch another &quot;multi-million-pound deal&quot; with a Netflix competitor to house their new project."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-wants-case-against-165856538.html",
        "title": "<b>Prince Harry</b> wants case against Mirror resolved as soon as possible - lawyers",
        "description": "Prince Harry wants London&#39;s High Court to resolve the remainder of his lawsuit against Britain&#39;s Mirror Group Newspapers as soon as possible following the ruling in his favour at the end of last year,"
    },
    {
        "url": "https://www.theguardian.com/media/2024/jan/29/daily-mirror-faces-2m-in-legal-costs-over-prince-harry-phone-hacking?ref=upstract.com",
        "title": "Daily Mirror faces £2m in legal costs over <b>Prince Harry</b> phone hacking",
        "description": "Judge ruled that Mirror Group Newspapers’ titles all used ‘extensive’ unlawful information gathering"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/revelations-world-doc-waylon-jennings-202000300.html",
        "title": "All the Revelations in the New “We Are the World” Doc, from Waylon Jennings&#39; Exit to the <b>Prince</b> Solo That Never Was",
        "description": "The new Netflix documentary The Greatest Night in Pop, featuring interviews with Lionel Richie, Bruce Springsteen and more, is streaming now"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-warned-31992931",
        "title": "Meghan Markle and <b>Prince Harry</b> warned by police as £11.8 million mansion is targeted by thieves",
        "description": "Meghan Markle and Prince Harry have received a warning from local police after a home nearby was broken into, with a string of similar incidents in the area"
    },
    {
        "url": "https://pressgazette.co.uk/media_law/harry-hacking-mirror-costs/",
        "title": "<b>Harry</b> hacking lawyer labels case against Mirror publisher ‘overwhelmingly successful’",
        "description": "A phone hacking claim against the publisher of the Daily Mirror brought by figures including Prince Harry was “overwhelmingly successful”."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/know-princess-waless-surgery-113721155.html",
        "title": "What we know about the Princess of Wales&#39;s surgery",
        "description": "The double health scare is, however, an indication of how fragile Charles&#39;s approach to the monarchy is - particularly as two royals, <b>Prince Harry</b> and the Duke of York, do not carry out official duties. Beyond describing the surgery as &quot;successful&quot;, the ..."
    },
    {
        "url": "https://uk.style.yahoo.com/laurence-fox-loses-libel-case-180211631.html",
        "title": "Laurence Fox Loses Libel Case After Calling Former ‘RuPaul’s Drag Race UK’ Star A Paedophile",
        "description": "Laurence Fox&#39;s Misogynistic Rant On &#39;Dan Wootton Tonight&#39; Tops Ofcom Complaints List 2023 <b>Prince Harry</b> Ordered To Pay $62,000 Legal Costs To Mail On Sunday Publisher Fox was sued by former RuPaul’s Drag Race UK contestant Crystal and Simon Blake ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middleton-health-update-shes-31992210",
        "title": "Kate Middleton discharged from hospital following surgery in new health update",
        "description": "The Princess of Wales has left hospital and made her way to Adelaide Cottage in Windsor tollowing her abdominal surgery which saw her hospitalised for 13 days."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860869/prince-harry-meghan-desperate-to-be-seen-appearances",
        "title": "<b>Prince Harry</b> and Meghan Markle are ‘desperate to be seen’ as deadline approaches",
        "description": "Ms Schofield, claimed that the couple may have attended the event to court rival streaming service Paramount as Meghan and Harry continue to try to make it in Hollywood. The Sussexes are reportedly working on several projects for the platform but none have been given a release date or promoted publicly."
    },
    {
        "url": "https://www.hellomagazine.com/homes/512262/king-charles-bizarre-living-conditions-cold-rooms/",
        "title": "King Charles&#39; very particular living conditions that lead to a &#39;constant battle&#39; with Queen Camilla",
        "description": "King Charles&#39; penchant for frost in his palatial suites is arguably one of his more peculiar habits, which leads to &quot;battles&quot; with his wife who prefers her living spaces to be &quot;warm and cosy&quot;."
    },
    {
        "url": "https://news.sky.com/story/african-wildlife-charity-with-prince-harry-as-board-member-investigating-rape-and-torture-claims-against-eco-guards-13059259",
        "title": "African wildlife charity with <b>Prince Harry</b> as board member investigating rape and torture claims against eco-guards",
        "description": "African Parks, which manages national parks and protected areas across 12 countries, says it is encouraging people with knowledge of any abuse to come forward."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25568700/prince-george-10k-bracelet-kate-middleton-auction-special-cause/",
        "title": "<b>Prince</b> George ‘gifted £10k 18ct white gold charm bracelet’ – but he wasn’t allowed to keep it",
        "description": "The car-mad tot also has an impressive classic car collection, including an electric SUV he received in 2017 from his uncle, <b>Prince Harry</b>, as well as a super fancy dark green model Aston Martin, that was reportedly inherited from his dad. But before he ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/journalist-claims-king-charles-iiis-health-issue-scares-prince-harry-1723055",
        "title": "Journalist Claims King Charles III&#39;s Health Issue &#39;Scares&#39; <b>Prince Harry</b>",
        "description": "It is understood that Prince Harry and Meghan Markle have already sent their respective well-wishes to both King Charles III and the Princess of Wales, privately. But as two of the working royals recover from their surgeries, the public waits to see if the Sussexes will return to the U.K. to personally pay them a visit."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-urged-quit-africa-133418579.html",
        "title": "<b>Prince Harry</b> urged to quit Africa conservation charity over guards ‘raping and abusing locals’",
        "description": "<b>Prince Harry</b> has been urged to step down from the board of a charity facing allegations of rape and abuse. Baka people living in Odzala-Kokoua National Park, in the Congo, say they are not being allowed to enter the forests where they have always foraged ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13006221/Millie-Mackintosh-slammed-flight-skincare.html",
        "title": "Millie Mackintosh is slammed for promoting her £2,400 in-flight skincare routine during luxury trip to Cape Town - including a £95 face mask",
        "description": "The former Made In Chelsea star turned influencer, 34, was flying from London to Cape Town on Wednesday afternoon for a &#39;very exciting photoshoot&#39;."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-fears-over-meghans-31968913",
        "title": "<b>Prince Harry</b>&#39;s fears over Meghan&#39;s tell-all threat as she wants to &#39;set the record straight&#39;",
        "description": "After Spare revealed intimate details about the breakdown of the relationship between <b>Harry</b> and his brother <b>Prince</b> William, and the tension between Meghan and her sister-in-law Kate, it prompted more questions about the closely guarded inner chamber of the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-blocks-meghan-markles-31993669",
        "title": "<b>Prince Harry</b> &#39;blocks&#39; Meghan Markle&#39;s memoir as it would &#39;cause more angst with family&#39;",
        "description": "<b>Prince Harry</b> has seemingly warned his wife, Meghan Markle, against writing a tell-all memoir, according to sources. The Duchess of Sussex was ready to &#39;set the record straight&#39; about her time as part of the Firm, but <b>Harry</b> has &#39;put an end to her plans&#39; as he was worried about the repercussions, reports the Mirror."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/511964/alex-jones-cotton-traders-winter-fashion-edit/",
        "title": "Exclusive: Alex Jones shares her favourite fashion tips – and reveals the £36 knit she loves",
        "description": "The Welsh presenter has been at the helm of some major TV moments, including the wedding of <b>Prince Harry</b> and Meghan Markle, Eurovision, and Comic Relief. A semi-finalist on Strictly Come Dancing in 2011 and a busy mum-of-three, Alex has unveiled her latest ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/man-stole-30k-cartier-breitling-28528805",
        "title": "Man stole £30k of Cartier and Breitling watches from home he was decorating",
        "description": "The burglary was only revealed when <b>Harry</b> Fane, who had sold the Cartier watch to the ... The Duke of Westminster, one of the UK&#39;s richest men, is godfather to <b>Prince</b> George. The 32-year-old took over his family&#39;s billion-pound fortune and estate when ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/28/charity-with-prince-harry-as-director-investigated-over-and-torture-claims?ref=upstract.com",
        "title": "Charity with <b>Prince Harry</b> as director investigating rape and torture claims",
        "description": "The Duke of Sussex, <b>Prince Harry</b>, is listed as a board member of the non-profit organisation after serving as the organisation’s president for six years. Guards managed and paid by the charity had engaged in the beating, rape and torture of Indigenous ..."
    },
    {
        "url": "https://www.scmp.com/news/world/europe/article/3250224/britains-king-charles-and-kate-middleton-leave-hospital-after-planned-treatments",
        "title": "Britain’s King Charles and Kate Middleton leave hospital after planned treatments",
        "description": "Charles spent 3 nights in hospital after a procedure for an enlarged prostate while Kate spent 2 weeks at the same London hospital following abdominal surgery."
    },
    {
        "url": "https://www.theguardian.com/media/2024/jan/29/daily-mirror-faces-2m-in-legal-costs-over-prince-harry-phone-hacking?ref=biztoc.com",
        "title": "Daily Mirror faces £2m in legal costs over <b>Prince Harry</b> phone hacking",
        "description": "Judge ruled that Mirror Group Newspapers’ titles all used ‘extensive’ unlawful information gathering The Daily Mirror is facing a claim for almost £2m in legal costs after <b>Prince Harry</b> won substantial damages in his phone-hacking case against the ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-blocks-meghan-markles-31990681.amp",
        "title": "<b>Prince Harry</b> &#39;blocks&#39; Meghan Markle&#39;s book as it would &#39;cause more angst&#39; with family",
        "description": "Meghan Markle was rumoured to be working on a tell-all memoir, but it&#39;s now been reported that <b>Prince Harry</b> has put a stop to her plans following the fallout from his own book Meghan Markle has been warned by <b>Prince Harry</b> <b>Prince Harry</b> has reportedly put ..."
    },
    {
        "url": "https://news.sky.com/story/african-wildlife-charity-with-prince-harry-as-board-member-investigating-rape-and-torture-claims-against-eco-guards-13059259?dcmp=snt-sf-twitter",
        "title": "African wildlife charity with <b>Prince Harry</b> as board member investigating rape and torture claims against eco-guards",
        "description": "A wildlife charity which has <b>Prince Harry</b> as a board member is investigating allegations of human rights abuses by its guards in the Republic of the Congo. African Parks said it was &quot;encouraging anyone with knowledge&quot; of any abuse to come forward and said ..."
    }
]