[
    {
        "url": "https://www.dailymail.co.uk/news/article-12980855/Did-Harry-hear-Kings-illness-media-Reports-suggest-Palace-message-beaten-newsflashes-Sussexes-remain-silent-Charles-Kates-medical-dramas.html",
        "title": "Did <b>Prince Harry</b> hear about King&#39;s illness from the media? Reports suggest Palace message about his father may have been beaten by newsflashes... as Sussexes maintain public ...",
        "description": "The Duke of Sussex was reportedly informed about his father&#39;s prostate diagnosis in a message from the Palace but is thought to have seen it reported in the media beforehand"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857369/Prince-Harry-king-charles-health-counsellor-of-state",
        "title": "<b>Prince Harry</b> &#39;excluded&#39; from stepping in for King Charles as he&#39;s &#39;ruled out&#39; of role",
        "description": "Prince Harry has been ruled out of stepping in for King Charles as a constitutional expert weighs in on who could be called upon to act as counsellors of state."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/18/duke-of-sussex-prince-harry-king-prostate-diagnosis-news/?n=@",
        "title": "Duke of Sussex may have been unaware of King’s prostate diagnosis before news made public",
        "description": "Announcement made at 3.25pm in UK, which is 7.25am in California, and so Prince Harry may have seen news reports before any private message"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/music/news/kelly-osbourne-nepo-baby-ozzy-sharon-b2481186.html",
        "title": "Kelly Osbourne says she’s ‘proud to be a nepo baby’",
        "description": "Kelly Osbourne has hit back at critics who have called her a “nepo baby” by saying she’s “proud” of that status. Osbourne, 39, is the daughter of Black Sabbath frontman Ozzy Osbourne and his manager Sharon Osbourne. She first shot to fame in 2002 when the family appeared together on the groundbreaking MTV reality show The Osbournes."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-andrew-harry-princess-beatrice-counsellors-of-state-nxfhxw8ls",
        "title": "Andrew, <b>Harry</b> and Beatrice will not serve as counsellors of state",
        "description": "The princes and princess have been discreetly sidelined from acting as substitutes for the King while Anne and Edward were added to those who can serve"
    },
    {
        "url": "https://metro.co.uk/2024/01/18/piers-morgan-still-talking-meghan-markle-2024-20138782/?ico=trending-post-strip_item_4",
        "title": "It’s 2024 and Piers Morgan is still talking about Meghan Markle",
        "description": "A leopard never changes its spots and that’s certainly true of Piers Morgan, who can’t seem to let go of his obsession with Meghan Markle. It is now 2024 yet the TalkTV host, 58, apparently had nothing better to discuss than a two-year-old feud with the Duchess of Sussex, 42, and her husband Prince Harry, 39."
    },
    {
        "url": "https://www.hellomagazine.com/film/511621/meghan-markle-set-for-return-to-acting-in-suits-creators-new-spin-off/",
        "title": "Meghan Markle ‘set for return’ to acting in Suits creator&#39;s new spin-off",
        "description": "The recent reunion of the Suits cast at the Golden Globes has sparked renewed interest in the hit series, especially in light of rumors about a new LA-based spin-off show that intriguingly includes a character seemingly crafted for Meghan Markle ."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/kate-middleton-still-prioritising-royal-31915977",
        "title": "Kate Middleton is still prioritising royal children despite surgery recovery",
        "description": "As the Princess of Wales continues to recover from her abdominal surgery in hospital, she is still focused fully on her children - and it isn&#39;t the first time she has prioritised them."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857325/prince-harry-king-charles-counsellors-of-state",
        "title": "<b>Prince Harry</b> must be &#39;kicked&#39; from Counsellors of State as King can manage without him",
        "description": "EXCLUSIVE: King Charles will carry out his royal engagements just fine as he prepares for an enlarged prostate operation next week, a royal biographer has said as they demanded Prince Harry be removed from the Counsellors of State."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-william-visited-kate-middleton-173451359.html",
        "title": "<b>Prince</b> William Visited Kate Middleton in the Hospital After Her Surprise Surgery",
        "description": "Prince William is stepping up to the plate as a supportive husband after it was announced that Kate Middleton was hospitalized following an abdominal surgery. The royal was spotted leaving the private hospital on Thursday — in an Audi e-Tron GT Carbon Vorsprung, to be exact — after a &quot;low-key visit,&quot; according to The Independent."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-kate-king-hospital/",
        "title": "<b>Prince Harry</b> urged to call royals as King Charles and Kate Middleton face hospital spells",
        "description": "Prince Harry has been told to call King Charles and Princess Kate as both face spells in hospital. Kate has undergone abdominal surgery and is recovering at the London Clinic, where she is expected to spend up to two weeks. She has cleared her engagements calendar until after Easter."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25408525/prince-harry-flying-award-hollywood-john-travolta-royal/",
        "title": "Hollywood A-lister with ‘strong emotional link’ to <b>Prince Harry</b> was behind duke receiving ‘Legend of Aviation’ award",
        "description": "PULP Fiction actor John Travolta was the driving force behind Prince Harry being inducted into an aviation hall of fame, it’s been claimed. Harry, 39, is set to be inducted tomorrow in"
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middleton-king-charles-candid-212953951.html",
        "title": "Kate Middleton and King Charles&#39; candid hospital announcements reveal how much the royal family has changed",
        "description": "Kate Middleton and King Charles&#39; health announcements allow the royals to control the news cycle rather than be at its mercy, according to PR experts."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12977963/zara-mike-tindall-royal-family-monarchy-princess-anne.html",
        "title": "Is it time for Mike and Zara Tindall to replace <b>Prince Harry</b> and Meghan Markle? Popular couple are already comfortable in the limelight - and swapping their money-making deals ...",
        "description": "The couple, who live together on Princess Anne &#39;s Gatecombe Estate in Gloucestershire, already have a closeness with the Wales family, are very popular with the public."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25406689/prince-harry-needs-call-dad-king-charles-kate/",
        "title": "<b>Prince Harry</b> NEEDS to call his dad King Charles and sister-in-law Kate over ops to bridge ‘very deep rift’, expert says",
        "description": "PRINCE Harry needs to call his dad and sister-in-law over their operations to bridge the “very deep rift”, a royal expert has said. The 42-year-old Princess of Wales is recovering in a"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/heartbroken-prince-harry-comforted-princess-31912632",
        "title": "Heartbroken <b>Prince Harry</b> &#39;comforted by Princess Anne&#39; after being told of Queen’s death",
        "description": "Queen Elizabeth II passed away in September 2022 at Balmoral Castle in Scotland, and Prince Harry recalled he arrived too late to see his dying grandmother after flying in from the US"
    },
    {
        "url": "https://edition.cnn.com/2024/01/18/uk/charles-kate-health-royals-newsletter-intl/index.html",
        "title": "With Kate, Charles and William out of action, Queen Camilla left to front the family",
        "description": "There has been concern in Britain over the past 24 hours after it was revealed that health issues are forcing three of the most senior royals out of the public eye."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-could-inherit-980000-worth-of-jewellery-from-meghan-and-princess-diana_art20822.html",
        "title": "Princess Lilibet could inherit £980,000 worth of jewellery from Meghan and Princess Diana",
        "description": "Princess Lilibet is expected to be the owner of some of history’s most impressive jewellery pieces. From Meghan Markle’s collection to Princess Diana’s, here’s what she could"
    },
    {
        "url": "https://uk.movies.yahoo.com/13-little-known-facts-severus-145124109.html",
        "title": "13 little-known facts about Severus Snape that &#39;<b>Harry</b> Potter&#39; fans probably don&#39;t remember",
        "description": "Snape, the Hogwarts Potions professor was a mysterious double agent, so even the biggest &quot;Harry Potter&quot; fans may not have heard all of these secrets."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/queen-camilla-confirms-king-charles-31911823.amp",
        "title": "Queen Camilla confirms King Charles is &#39;looking forward to getting back to work&#39; after hospital visit",
        "description": "The 75-year-old monarch, who acceded to the throne 16 months ago, will be admitted to hospital next week. <b>Prince Harry</b>&#39;s claim about Queen&#39;s death &#39;isn&#39;t exactly true&#39;, says royal author In a statement, Buckingham Palace said: “In common with thousands ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-looks-downcast-goes-31907676",
        "title": "<b>Prince Harry</b> looks downcast as he goes jogging amid reports daughter&#39;s name angered late Queen",
        "description": "Prince Harry was seen jogging in Santa Barbara, California and bracing the chilly weather amid claims that he and Meghan Markle &#39;angered&#39; the late Queen Elizabeth"
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to <b>Prince</b> Andrew",
        "description": "Despite suggestions from the King for him to shift into <b>Prince Harry</b> and Meghan Markle &#39;s more modest four-bedroom Frogmore Cottage on the Windsor estate, Andrew&#39;s friends affirm that the Royal is not intending to consider alternate accommodation options."
    },
    {
        "url": "https://www.thesun.ie/royals/12016486/royal-family-king-charles-kate-middleton-hospital-updates/page/3/",
        "title": "Kate Middleton news — Princess of Wales ‘doing well’ in hospital after surgery as King set to have prostate procedure",
        "description": "She may miss <b>Prince</b> Edward&#39;s 60th birthday celebrations on March 10. Taking to social media, royal fans have shared their best wishes for The Princess of Wales. &quot;Praying for a speedy recovery for Catherine. Absolutely respect her need for privacy ..."
    },
    {
        "url": "https://www.timesnownews.com/world/did-harry-find-out-about-his-father-king-charles-prostate-diagnosis-through-the-media-first-reports-suggest-so-article-106970772",
        "title": "Did <b>Harry</b> Find Out About His Father King Charles&#39; Prostate Diagnosis Through The Media First? Reports Suggest So",
        "description": "Prince Harry may have learned about King Charles&#39;s health condition through media reports rather than receiving official communication from the Palace. According to The Telegraph, the Duke of Sussex is said to have received a message from Buckingham Palace informing him of his father&#39;s prostate diagnosis,"
    },
    {
        "url": "http://tsss.ca/uncategorized/king-charles-iii-grandkids-arrived-at-westminster",
        "title": "King Charles III, Grandkids Arrived at Westminster Hall",
        "description": "King Charles III, Grandkids Arrived at Westminster Hall Meghan Markle gets to Westminster Abbey toward Condition Funeral service of Queen Age II toward . The latest Duchess off Sussex found its way to an auto having Prince Harry,"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-living-legend-award-002420817.html",
        "title": "<b>Prince Harry</b>’s ‘Living Legend’ Award Was Allegedly Influenced By A Hollywood Star",
        "description": "Hollywood star John Travolta reportedly played a pivotal role in securing Prince Harry a Living Legend of Aviation honor due to his connection with Princess Diana. Travolta allegedly sees Harry continuing his late mother’s charitable legacy."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harrys-blatant-attack-kate-middleton-lowest-of-the-low-prince-william-biography.html/",
        "title": "<b>Prince Harry</b>’s ‘Blatant Attack’ on Kate Middleton Was the ‘Lowest of the Low’ for <b>Prince</b> William — Biography",
        "description": "A new biography claims Prince William took a comment Prince Harry made in &#39;Harry &amp; Meghan&#39; as a &#39;blatant attack&#39; on his wife, Kate Middleton."
    },
    {
        "url": "https://www.hollywoodreporter.com/movies/movie-features/lionel-richie-interview-we-are-the-world-greatest-night-in-pop-documentary-1235790801/",
        "title": "Lionel Richie: Writing “We Are the World” Was a “Train Wreck in My Head”",
        "description": "Ahead of the premiere of the Sundance doc &#39;The Greatest Night in Pop,&#39; the pop legend dishes on the race to finish his 1985 hit single with Michael Jackson, why Prince was a no-show and what he thinks of all those memes."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/prince-harrys-coded-message-on-williams-choice-of-wife-wounded-the-prince-of-wales-royal-author/news-story/34ddd11ac23300867b1b86e11ab16b6c",
        "title": "<b>Prince Harry</b>&#39;s coded message on William&#39;s choice of wife &#39;wounded&#39; the <b>Prince</b> of Wales: royal author",
        "description": "Royal author Robert Hardman, whose new book is “The Making of a King: King Charles III and the Modern Monarchy,” told The Post that he believes <b>Harry</b> criticized William’s choice to marry Kate Middleton. “<b>Harry</b> talks about marrying someone for love ..."
    },
    {
        "url": "https://www.cinemablend.com/streaming-news/royal-expert-prince-harry-dissing-prince-william-netflix-docuseries-harry-and-meghan",
        "title": "Royal Expert Reveals Why He Thinks <b>Prince Harry</b> Was &#39;Dissing&#39; <b>Prince</b> William In His Netflix Docuseries <b>Harry</b> &amp; Meghan",
        "description": "This time, the claims about the brothers’ turbulent relationship stem from Robert Hardman’s thoughts on comments Prince Harry made in Harry &amp; Meghan. The author of The Making of a King: King Charles III and the Modern Monarchy told Page Six he thought the Duke of Sussex was &quot;dissing&quot; his older brother in it when he spoke about marriage, saying:"
    },
    {
        "url": "https://www.kvue.com/article/news/nation-world/prince-william-visits-kate-in-hospital/507-0e00066b-2b7d-47a7-ac4b-4b22818a8f6a",
        "title": "<b>Prince</b> William visits Kate in hospital while she recovers from surgery",
        "description": "British media reported that the 42-year-old Princess of Wales was “doing well” after the operation, details of which have not been disclosed."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-reportedly-wounded-prince-221559358.html",
        "title": "<b>Prince Harry</b> Reportedly ‘Wounded’ <b>Prince</b> William By Saying He ‘Married For Love’",
        "description": "Prince Harry, reportedly hurt his brother Prince William by claiming he is the only one in the family who “married for love.” The stunning claim comes from Royal author Robert Hardman who has dived into the strained relationship between the two Princes."
    },
    {
        "url": "https://uk.style.yahoo.com/mo-henry-negative-cutter-jaws-205921938.html",
        "title": "Mo Henry, Negative Cutter on ‘Jaws,’ ‘The Matrix’ and Hundreds of Other Films, Dies at 67",
        "description": "Bassett &amp; Associates, then bought her business in 1995. She noted her “most rewarding” project was <b>Harry</b> Potter and the Chamber of Secrets (2002). “I got to move to London and work there, which was fantastic!” she said. “It was so exciting ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/kate-princess-of-wales-health-latest-hospital-surgery-london-clinic-william-b1133233.html",
        "title": "<b>Prince</b> William visits wife Kate in London hospital as she recovers from abdominal surgery",
        "description": "Thursday&#39;s visit came as the Princess of Wales was said to be &#39;doing well&#39; after a comfortable night at the private London Clinic"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/pulitzer-winning-playwright-actor-tracy-185648397.html",
        "title": "Pulitzer-Winning Playwright &amp; Actor Tracy Letts Signs With UTA",
        "description": "Osage County playwright Tracy Letts has signed with UTA for representation in all areas, the agency said today. A prolific playwright and actor, Letts’s career in theater has spanned decades, including the Tony- and Pulitzer-nominated The Minutes,"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/princess-wales-surgery-what-we-know-093425412.html",
        "title": "What we know about the Princess of Wales&#39;s surgery",
        "description": "The Princess of Wales abdominal surgery means she is expected to refrain from public engagements until at least April."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-claim-queens-death-31909499",
        "title": "<b>Prince Harry</b>&#39;s claim about Queen&#39;s death &#39;isn&#39;t exactly true&#39;, says royal author",
        "description": "The Duke of Sussex says in Spare that he found out about his late grandmother&#39;s death via the BBC website and not through his family but a royal expert has claimed this is not entirely true in a new bombshell book."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-and-kate-middleton-both-in-hospital-who-could-take-over-for-the-monarch-if-hes-incapacitated_art20815.html",
        "title": "King Charles and Kate Middleton both in hospital: Who could take over for the monarch if he’s incapacitated?",
        "description": "On Wednesday 17 January, it was announced that both the Princess of Wales and King Charles are having health issues requiring surgeries. While the Princess of Wales can be taken"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-copyright-lilbet-name-31909336",
        "title": "Meghan Markle &#39;copyrighted the name of daughter Lilibet before birth&#39; says royal expert",
        "description": "Meghan Markle allegedly copyrighted the name Lilibet before she and Prince Harry welcomed their daughter in 2021, claims royal expert Angela Levin, who branded it &#39;disrespectful&#39;"
    },
    {
        "url": "https://www.newstatesman.com/culture/books/book-of-the-day/2024/01/charles-iii-biography-king-robert-hardman",
        "title": "50 years of Manon",
        "description": "Robert Hardman’s obsequious biography pays court to a monarch who is enjoying his power over a deferential nation."
    },
    {
        "url": "https://uk.style.yahoo.com/princess-wales-hospital-having-abdominal-141523288.html",
        "title": "Princess of Wales &#39;doing well&#39; in hospital after abdominal surgery as William postpones duties",
        "description": "The Princess of Wales has undergone planned abdominal surgery, Kensington Palace has said. Kate, 42, was admitted to The London Clinic on Tuesday for the planned procedure."
    },
    {
        "url": "https://www.thesun.ie/royals/12020158/princess-lilibet-inherit-gift-meghan-markle-princess-diana/",
        "title": "Princess Lilibet, two, set to inherit £980,000 gift from Meghan Markle &amp; there’s a nod to Princess Diana",
        "description": "SHE’S only two, but Princess Lilibet is set to receive a staggering £980,000 worth of jewellery from mum Meghan Markle in years to come. The Duchess of Sussex, 42, has an impressive collection of"
    },
    {
        "url": "https://www.ibtimes.co.uk/blatant-attack-kate-middleton-royal-left-prince-william-furious-says-new-book-1722830",
        "title": "&#39;Blatant Attack&#39; On Kate Middleton By Royal Left <b>Prince</b> William Furious, Says New Book",
        "description": "Royal author Robert Hardman claimed that the Prince of Wales was furious over an assumption that he did not marry Kate Middleton for love."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/take-kate-princes-wales-three-28466185",
        "title": "It will take Kate, Princess of Wales, three months to recover after surgery",
        "description": "The Princess remains in hospital and is expected to stay for up to 14 days but will be unwell for months to come"
    },
    {
        "url": "https://uk.news.yahoo.com/health-scares-king-kate-leave-134737361.html",
        "title": "Health scares for king and Kate leave UK royals short-staffed",
        "description": "Catherine, Princess of Wales, spent her third day in hospital on Thursday following surgery, as King Charles III was poised for an operation on an enlarged prostate, creating a royal frontline staffing shortage."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-looks-downcast-goes-31907676.amp",
        "title": "<b>Prince Harry</b> looks downcast as he goes jogging amid reports daughter&#39;s name angered late Queen",
        "description": "Prince Harry was seen jogging in Santa Barbara, California and bracing the chilly weather amid claims that he and Meghan Markle &#39;angered&#39; the late Queen Elizabeth"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511491/prince-william-and-kates-unknown-kind-gesture-to-prince-harry-and-meghan-markle-after-queens-death-revealed/",
        "title": "<b>Prince</b> William and Kate&#39;s unknown kind gesture to <b>Prince Harry</b> and Meghan after Queen&#39;s death revealed",
        "description": "Over the past couple of years, there has been much attention on Prince William and Prince Harry &#39;s strained relationship. The fractured ties were closely monitored during the period of mourning after Queen Elizabeth&#39;s death in September 2022 when the Waleses and Sussexes came together."
    }
]