[
    {
        "url": "https://news.yahoo.com/prince-philip-nicknamed-meghan-dow-201437438.html",
        "title": "<b>Prince</b> Philip nicknamed Meghan ‘DoW’ because she reminded him of Wallis Simpson, Duchess of Windsor",
        "description": "“One of the few wary of succumbing to her charm offensive, however, was <b>Prince</b> Philip. “While the Queen continued to champion <b>Harry</b>’s new love, he warned his wife to be cautious. “It was uncanny, he told her, how much Meghan reminded him of the ..."
    },
    {
        "url": "https://www.ctvnews.ca/mobile/world/who-are-the-younger-royal-family-members-we-could-see-take-on-more-duties-1.6752241?clipId=64268",
        "title": "Who are the younger Royal Family members we could see take on more duties?",
        "description": "thanks to not only the twin health scare but the stepping back of other working royals such as <b>Prince</b> Andrew and <b>Prince Harry</b>. But who in the younger branch of the Royal Family could, in an ideal world, step up and act as stand-in working Windsors ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-show-32034172",
        "title": "<b>Prince Harry</b> and Meghan Markle show off unseen underground lair in their Montecito home",
        "description": "Prince Harry and Meghan Markle gave fans a sneak peek at their impressive cellar room in their £14million Montecito property after filming in acceptance speech in the lair"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/harry-meghans-new-netflix-project-32034728",
        "title": "<b>Harry</b> and Meghan&#39;s new Netflix project confirmed following eye-watering deal",
        "description": "The Duke and Duchess of Sussex are working on a &#39;couple of unscripted&#39; projects which has been confirmed by a Netflix executive."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13023469/prince-harry-warned-africa-rapes-human-rights-board-directors.html",
        "title": "<b>Prince Harry</b> &#39;was warned about rapes and human rights atrocities in Africa carried out by rangers at charity months before he was promoted to its board of directors&#39;",
        "description": "The royal was asked by charity Survival International to use his &#39;influence and position to stop these abuses being committed&#39; in a letter sent to both him and Meghan Markle in May last year."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862317/royal-family-live-harry-meghan-gossip-dilemma",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan face ‘gossip’ dilemma in launching new TV deal",
        "description": "A royal expert has said he&#39;s &quot;dubious&quot; about Prince Harry and Meghan&#39;s Netflix deal and that they face a predicament about their next big move."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46625418/prince-harry-meghan-markle-canada-invictus-games-vancouver-whistlers/",
        "title": "<b>Prince Harry</b> and Duchess Meghan Will Travel to Canada for a Cause Close to Their Hearts",
        "description": "The Sussexes will be spending Valentine’s Day supporting a cause that is very close to their hearts."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862514/prince-harry-meghan-markle-low-priority",
        "title": "<b>Prince Harry</b> and Meghan Markle are clearly a low-priority for the Royal Family",
        "description": "COMMENT: Prince Harry and Meghan Markle&#39;s official pages on the Royal Family website have several inaccuracies that have been left untouched for years. Emily Ferguson writes that this clearly shows they&#39;re a low-priority within Palace circles."
    },
    {
        "url": "https://inews.co.uk/culture/television/url-harry-meghan-movie-2886406?ITO=msn",
        "title": "So <b>Prince Harry</b> and Meghan Markle are making a movie. Does anyone care?",
        "description": "Their transition from royals to celebrity-seeking &#39;multi-hyphenates&#39; is like something from &#39;Black Mirror&#39; - and won&#39;t help them stay relevant"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markles-20m-32030076",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;$20m a year lifestyle&#39; causing palace worry, says experts",
        "description": "According to several royal experts, Prince Harry and Meghan Markle have huge outgoings to pay for their security and house - and there are worries within Buckingham Palace about what will happen if th"
    },
    {
        "url": "https://www.ok.co.uk/royal/paul-burrell-harry-meghan-family-32028895",
        "title": "&#39;Royal Family has shut the door on Meghan and <b>Harry</b> in tight-lipped tactic&#39;",
        "description": "Princess Diana&#39;s former butler, Paul Burrell, has shed light on the alleged state of the relationship between Prince Harry and Meghan Markle, and the rest of the Royal Family"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/512614/prince-harry-duchess-meghan-talk-children-online-safety-our-view/",
        "title": "I fear for my kids online – and thank <b>Prince Harry</b> and Meghan Markle for speaking up",
        "description": "This week, Prince Harry and his wife Meghan Markle have brought the issue of children&#39;s online safety to the world stage once again, releasing a statement in response to a landmark U.S. Senate Judiciary Committee hearing."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25670557/harry-meghan-obsessing-security-montecito/",
        "title": "‘Security obsessed’ <b>Harry</b> &amp; Meghan ‘don’t want smaller mansion despite Montecito life costing $20m a year’, experts say",
        "description": "The Duke and Duchess of Sussex are still “obsessed with security and they don’t want to live in a smaller house,” despite living in pricey Montecito, experts have claimed. Prince"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-door-firmly-32027649",
        "title": "<b>Prince Harry</b> and Meghan have had &#39;door firmly shut&#39; in their face as royals employ new tactic",
        "description": "The Duke and Duchess of Sussex were said to be hoping to make amends with Harry&#39;s relatives in the near future but it seems the royals have other plans as they have shut them out with a new tactic."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13034641/QUENTIN-LETTS-florid-banal-psycho-babble-reeking-opportunism-Harry-Meghan-riding-peoples-grief-trams.html",
        "title": "QUENTIN LETTS: Florid, banal psycho-babble reeking of opportunism - <b>Harry</b> and Meghan are riding other people&#39;s grief like trams",
        "description": "Veteran Sussex watchers were ­yesterday in their power-showers, trying to scrub clean after the latest hosing of treacle from Meghan and Harry."
    },
    {
        "url": "https://www.ibtimes.co.uk/netflix-teases-whats-next-prince-harry-meghan-markle-their-multi-million-contract-1723171",
        "title": "Netflix Teases What&#39;s Next For <b>Prince Harry</b>, Meghan Markle On Their Multi-Million Contract",
        "description": "The Duke and Duchess of Sussex are working on several new projects, says Netflix&#39;s chief content officer Bela Bajaria."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512572/meghan-markle-extra-long-hair-home-video-acceptance-speech/",
        "title": "Meghan Markle shows off extra long hair in new home video filmed in unseen room",
        "description": "Meghan Markle and Prince Harry have created their new life in Montecito, California and while fans have been offered several glimpses inside their £14 million mansion, the royal couple have now shown off a never-before-seen corner."
    },
    {
        "url": "https://www.livemint.com/special-report/help-wanted-with-ribbon-cutting-medal-pinning-must-be-british-royalty-11706858959200.html",
        "title": "Help Wanted With Ribbon Cutting, Medal Pinning. Must Be British Royalty.",
        "description": "Health trouble, defection and disgrace have reduced the number of princes, princesses and dukes available to spread royal stardust."
    },
    {
        "url": "https://www.aol.com/lifestyle/inside-prince-harry-duchess-meghans-154300069.html",
        "title": "Inside <b>Prince Harry</b> and Duchess Meghan&#39;s Special Valentine&#39;s Day Plans",
        "description": "&quot;Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.&quot; The Sussexes will be spending Valentine&#39;s Day supporting a cause that&#39;s very close to their hearts. The Vancouver Whistler,"
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/meghan-markle-and-prince-harrys-last-chance-at-fixing-their-netflix-deal/",
        "title": "Meghan Markle and <b>Prince Harry</b>’s last chance at fixing their Netflix deal",
        "description": "Meghan Markle and Prince Harry&#39;s deal with Netflix is expiring soon and they may have one last chance at proving their worth."
    },
    {
        "url": "https://www.ilmessaggero.it/en/possible_remarriage_of_prince_andrew_and_sarah_ferguson-7910780.html",
        "title": "Possible Remarriage of <b>Prince</b> Andrew and Sarah Ferguson",
        "description": "Sarah Ferguson, banned by <b>Prince</b> Philip after the separation, was forgiven by the royal family only in 2018, the year in which she participated in the wedding of the Dukes of Sussex, <b>Harry</b> and Meghan. She was not invited to the wedding of William and Kate."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-markle-and-prince-harry-invictus-games-2025-netflix-deal",
        "title": "Meghan Markle and <b>Prince Harry</b> Have Plans for Valentine’s Day—And Their Netflix Deal",
        "description": "The royals will be in Vancouver on February 14 for a One Year to Go event for the 2025 Invictus Games. Meanwhile, Netflix made an announcement about their future forays into unscripted television."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/us/netflix-teases-prince-harry-meghan-markles-upcoming-projects-know-their-movie-tv-and-unscripted-shows/articleshow/107369607.cms",
        "title": "Netflix teases <b>Prince Harry</b>, Meghan Markle&#39;s upcoming projects. Know their movie, TV, and unscripted shows",
        "description": "After signing the deal with Netflix in 2020, Prince Harry and Meghan Markle said their Archewell Productions would create documentaries, docuseries, feature films, scripted shows and childrens shows for the streaming platform."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/kate-middleton-coma-palace-gave-155757668.html",
        "title": "Was Kate Middleton In A Coma? The Palace Gave A Rare Response To The Rumor",
        "description": "She Just Spoke Out Kate Middleton&#39;s Surgery Could &#39;Build Bridges&#39; With <b>Harry</b> &amp; Meghan Amid Their Feud What Kind of Surgery Did King Charles Have? It&#39;s Having A &#39;Positive Impact&#39; Royal expert Jennie Bond told the outlet that <b>Prince</b> William is planning to ..."
    },
    {
        "url": "https://www.yahoo.com/entertainment/read-suits-secrets-while-binge-152309721.html",
        "title": "Read Up on These Suits Secrets While You Binge-Watch",
        "description": "All rise, Suits fans, because E! News&#39; breakdown of the USA legal dramedy is in session and we&#39;re testifying about all the series&#39; secrets, including how Meghan Markle influenced her character."
    },
    {
        "url": "https://www.princegeorgecitizen.com/national-sports/taylor-swift-could-make-it-to-the-super-bowl-from-tokyo-finding-private-jet-parking-thats-tricky-8200007",
        "title": "Taylor Swift could make it to the Super Bowl from Tokyo. Finding private jet parking, that&#39;s tricky.",
        "description": "If Taylor Swift is jetting from her upcoming Tokyo concert to Las Vegas to see boyfriend Travis Kelce play in the Super Bowl the next day, she&#39;d better already have a place to park her plane."
    },
    {
        "url": "https://www.usmagazine.com/entertainment/news/netflix-cco-teases-prince-harry-and-meghan-markles-upcoming-projects/",
        "title": "Netflix CCO Hints <b>Prince Harry</b> and Meghan Markle Have ‘A Bunch’ of Projects in Development",
        "description": "Prince Harry and Meghan Markle are currently producing ‘a bunch’ of TV and film projects, according to Netflix chief content officer Bela Bajaria"
    },
    {
        "url": "https://www.thesun.ie/royals/12118106/prince-william-help-princess-kate-recover-abdominal-surgery/",
        "title": "Devoted William ‘will remain at Kate’s side as long as she needs him to be there’ as she recovers from abdominal surgery",
        "description": "PRINCE William will step back from his royal duties to look after Kate as she recovers from abdominal surgery. Kate, 42, underwent the planned operation on January 16 and stayed in a"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-symbolic-visit-canada-invictus-games-1866241",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s Symbolic Visit",
        "description": "Harry and Meghan are set to make a working visit to Canada where they will mark the one-year waypoint to the 2025 Invictus Games."
    },
    {
        "url": "https://www.allvipp.com/royals/the-9-times-princess-diana-was-honoured-at-harry-meghan-s-wedding",
        "title": "The 9 Times Princess Diana Was Honoured At <b>Harry</b> &amp; Meghan&#39;s Wedding",
        "description": "Lady Diana died in a tragic car accident in Paris in 1997 some twenty years before Prince Harry and Meghan Markle&#39;s wedding in 2018. This is how she was remembered there!"
    },
    {
        "url": "https://www.aol.com/entertainment/prince-harry-meghan-markle-bunch-145234611.html",
        "title": "<b>Prince Harry</b>, Meghan Markle Have &#39;A Bunch&#39; of Netflix Projects in the Works",
        "description": "Prince Harry and Meghan Markle will soon take over Netflix with several upcoming projects already in the works. “They have a couple of unscripted things they’re working on with Brandon [Reigg, Netflix’s VP of Unscripted and Documentary],"
    },
    {
        "url": "https://www.samaa.tv/208739132-meghan-markle-contemplates-explosive-memoir-amidst-royal-rift",
        "title": "Meghan Markle contemplates explosive memoir amidst royal rift",
        "description": "&quot;I am waiting for Meghan to release her own memoir. It is inevitable for her to write her side of the story because of how absent she was from &#39;Spare,&#39; and that is because she is penning her memoir and telling it from a woman&#39;s perspective,"
    },
    {
        "url": "https://www.graphic.com.gh/entertainment/showbiz-news/prince-harry-and-meghan-to-release-new-netflix-projects.html",
        "title": "<b>Prince Harry</b> and Meghan to release new Netflix projects",
        "description": "Prince Harry and Meghan Markle are working on a new Netflix film and TV series, according to a company executive."
    },
    {
        "url": "https://www.skynews.com.au/world-news/united-kingdom/netflix-reveals-several-projects-lined-up-for-harry-and-meghan/video/8df6302d2e343276afc7f0a3a47fae78",
        "title": "Netflix reveals several projects lined up for <b>Harry</b> and Meghan",
        "description": "Prince Harry and Meghan Markle have &quot;a bunch&quot; of projects in development, according to Netflix. Chief content officer Bela Bajaria told Hollywood insiders the couple has multiple projects – including unscripted and early works. One film project is thought to be an adaptation of the novel &#39;Meet Me at the Lake&#39;."
    },
    {
        "url": "https://www.tatler.com/article/harry-meghan-tv-series-film-netflix-archewell",
        "title": "Tales from Montecito: hints of new Meghan and <b>Harry</b> film and TV series",
        "description": "If you are craving more stories from the California-based Sussexes, there&#39;s more to come as Harry and Meghan are said to be developing new projects for the big and small screens. The news comes amid a spate of rocky departures for their production company,"
    },
    {
        "url": "https://thenews-chronicle.com/see-prince-harry-and-meghan-markles-new-netflix-projects/",
        "title": "See <b>Prince Harry</b> and Meghan Markle’s New Netflix projects",
        "description": "Since sealing a five-year partnership with Netflix in 2020, estimated at $100 million, the Duke and Duchess of Sussex have been actively developing content through their Archewell Productions"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153900-meghan-markle-prince-harrys-valentines-day-plan-revealed",
        "title": "Meghan Markle, <b>Prince Harry</b>&#39;s Valentine&#39;s Day plans revealed",
        "description": "Prince Harry and Meghan Markle will celebrate Valentine&#39;s Day in Canada to recall sweet memories of their early relationship.The Duke and Duchess of Sussex are heading to Canada this month for"
    },
    {
        "url": "https://www.newsweek.com/prince-william-intense-looks-kate-middleton-caught-camera-1866272",
        "title": "<b>Prince</b> William&#39;s &#39;Intense&#39; Looks at Kate Middleton Caught on Camera",
        "description": "William&#39;s glances towards his wife at public events have become the focus of a new viral post on social media."
    },
    {
        "url": "https://www.ctvnews.ca/world/who-are-the-younger-royal-family-members-we-could-see-take-on-more-duties-1.6752241",
        "title": "Who are the younger Royal Family members we could see take on more duties?",
        "description": "With some very senior Royal Family members out of action for health reasons, who will be out on duty for the Firm? Royal commentator Afua Hagan writes about some younger members of the family who she would like to see step in,"
    },
    {
        "url": "https://www.firstpost.com/entertainment/end-of-netflix-contract-harry-meghan-still-cashing-in-on-royal-connections-13682142.html",
        "title": "End of Netflix contract, <b>Harry</b>, Meghan still cashing in on royal connections?",
        "description": "Netflix contract nearing an end for Harry and Meghan. So as they try proving themselves as independent filmmakers, will they continue to exploit their royal connections?"
    },
    {
        "url": "https://uk.news.yahoo.com/traitors-star-mollie-turns-down-160052625.html",
        "title": "The Traitors star Mollie turns down <b>Harry</b>’s holiday offer after betrayal",
        "description": "The Traitors star Mollie Pearce has refused Harry’s offer to pay for a holiday after he stole the £95,000. &#39;Hello Lewis&#39;: Charles Leclerc discusses his &#39;ideal&#39; teammate in resurfaced footageSky Sports"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25661652/inside-harry-meghans-bid-rescue-netflix-deal/",
        "title": "Inside <b>Harry</b> &amp; Meghan’s last ditch bid to rescue ‘ticking time bomb’ £80m Netflix deal with ‘unscripted’ shows &amp; film",
        "description": "PRINCE Harry and Meghan Markle are said to be making a last-ditch bid to rescue their £80million Netflix deal. The Duke and Duchess of Sussex are planning “unscripted” shows and a film"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1153908-prince-harry-meghan-markle-receive-shock-news-from-royal-family",
        "title": "<b>Prince Harry</b>, Meghan Markle receive shock news from royal family",
        "description": "Meghan Markle and <b>Prince Harry</b> will reportedly never be welcomed back into the Firm as the royal family have adopted a new strategy to fight off their spate of attacks, according to a former royal butler. The Duke and Duchess of Sussex, who were said to be ..."
    },
    {
        "url": "https://www.2oceansvibe.com/2024/02/02/former-friend-says-prince-harry-is-nothing-like-the-man-i-met/",
        "title": "Former Friend Says <b>Prince Harry</b> Is “Nothing Like The Man I Met”",
        "description": "Friends of <b>Prince Harry</b> say they do not recognise him since he left the royal family in 2020 and embraced a new life across the pond in the US. Since letting go of his royal role, <b>Harry</b> has spoken out about how his family treated him and matters close to ..."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/suits-la-spin-off-nbc-b2489203.html",
        "title": "Suits LA spin-off gets significant production update",
        "description": "In an interview with the LA Times, Suits creator Aaron Korsch credited the show’s renewed success in part to Markle’s role in the royal family. “ [The show] has an inherent optimism to it, and I think that’s a real part of what people respond to,” Korsh said."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-duchess-sussex-040000396.html",
        "title": "<b>Prince Harry</b> and Meghan, Duchess of Sussex are said to be working on a &#39;bunch&#39; of fresh projects for Netflix",
        "description": "After the couple were dealt a massive blow by the streaming giant Spotify when their £15 million contract with the firm ended early in June 2023, Prince Harry and Meghan, Duchess of Sussex are said to be working on a “bunch” of fresh projects for Netflix."
    }
]