[
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-williams-brutal-insult-harry-31813886",
        "title": "<b>Prince</b> William&#39;s brutal insult about <b>Harry</b> in rare joint interview between the brothers",
        "description": "When Prince William and Prince Harry undertook a rare joint interview together with the press, William dished out a savage insult to his younger brother - and it stayed with him"
    },
    {
        "url": "https://www.thedailybeast.com/neo-nazi-podcasters-who-targeted-prince-harry-jailed-on-terror-charges",
        "title": "Neo-Nazi Podcasters Who Targeted <b>Prince Harry</b> Jailed on Terror Charges",
        "description": "The hosts of a British neo-Nazi podcast who called for the deaths of both Prince Harry and his 4-year-old son, Archie, were sentenced to a combined total of 15 years in prison on Thursday following their conviction on terror charges."
    },
    {
        "url": "https://www.nme.com/features/music-interviews/does-rock-n-roll-kill-braincells-chumbawambas-dunstan-bruce-3564483",
        "title": "Does Rock ‘N’ Roll Kill Braincells?! – Chumbawamba’s Dunstan Bruce",
        "description": "In Does Rock ‘N’ Roll Kill Braincells?!, we quiz an artist on their own career to see how much they can remember"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/meghan-markle-warned-over-talking-9015950",
        "title": "Meghan Markle &#39;warned&#39; over talking about the Royal Family in debut memoir",
        "description": "It is thought Meghan is going to follow in the footsteps of her husband, who released his bombshell autobiography Spare last year"
    },
    {
        "url": "https://www.lawgazette.co.uk/news/ex-mirror-group-lawyer-probed-over-phone-hacking-knowledge/5118326.article",
        "title": "Ex-Mirror Group lawyer probed over phone hacking knowledge",
        "description": "Marcus Partington was referred to repeatedly in the ruling handed down by Mr Justice Fancourt last month. The judgment stated that Partington ‘would have been aware’ of unlawful information-gathering from 1999 onwards and was aware of phone hacking activities from no later than the end of 2003."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852318/prince-harry-meghan-markle-2024-career-plan",
        "title": "<b>Prince Harry</b> and Meghan Markle accused of &#39;all talk and no action&#39; after catastrophic 2023",
        "description": "Prince Harry and Meghan Markle experienced a bumpy 2023, with a royal expert warning they can&#39;t afford to make the same mistakes this year."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/harry-dunn-congress-bid-capitol-police-b2473748.html",
        "title": "Ex-Capitol Police officer <b>Harry</b> Dunn announces run for Congress",
        "description": "Harry Dunn, a former US Capitol Police officer who testified about the January 6 attack before a House of Representatives panel in 2022 and recently retired from the department, is now running to join the ranks of those elected officials who he protected from a riotous mob of former president Donald Trump’s supporters."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-final-straw-firm-31812093",
        "title": "<b>Prince Harry</b>&#39;s &#39;final straw&#39; in Firm was royal Christmas video that didn&#39;t include him",
        "description": "The Duke and Duchess of Sussex stepped down from their royal duties in 2020 but it seems their decision was cemented by a telling Christmas video released by his family just weeks before their exit."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-irritated-prince-andrew-31811240.amp",
        "title": "<b>Prince Harry</b> &#39;irritated&#39; that <b>Prince</b> Andrew was welcomed at royal Christmas but he wasn&#39;t",
        "description": "Prince Harry is alleged to find it ‘irritating’ that Prince Andrew was welcomed at royal Christmas celebrations in Sandringham last month, but he and his wife Meghan Markle were not"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12929367/prince-harry-son-archie-neo-nazi-podcasters-abomination-jailed.html",
        "title": "Neo-Nazi podcasters who called for the execution of <b>Prince Harry</b> and said his son Archie is an &#39;abomination&#39; who should be &#39;put down&#39; are jailed",
        "description": "Christopher Gibbons and Tyrone Patten-Walsh were white supremacists who came up with a radio-show format which included chats about violent acts of misogyny, Kingston Crown Court was told."
    },
    {
        "url": "https://www.ibtimes.co.uk/what-prince-harry-has-said-about-jeffrey-epstein-scandal-prince-andrew-faces-fresh-torment-1722555",
        "title": "What <b>Prince Harry</b> Has Said About Jeffrey Epstein Scandal As <b>Prince</b> Andrew Faces Fresh Torment",
        "description": "Documents unsealed by a New York judge claimed that the Duke of York had sexual relations with a minor who was trafficked by Epstein."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852236/prince-harry-relationship-meghan-mum-doria-ragland",
        "title": "<b>Prince Harry</b>&#39;s relationship with Doria Ragland as she moves in to mansion: &#39;Needs space&#39;",
        "description": "It has been revealed that Doria Ragland has moved into Prince Harry and Meghan Markle&#39;s lavish Montecito mansion."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-andrew-reported-police-epstein-documents/",
        "title": "<b>Prince</b> Andrew reported to police after being named 69 times in Epstein files, with calls for Charles to comment",
        "description": "Prince Andrew has been reported to the police after being named dozens of times in documents related to paedophile Jeffrey Epstein."
    },
    {
        "url": "https://uk.news.yahoo.com/neo-nazi-podcasters-jailed-terror-083201030.html",
        "title": "Neo-Nazi podcasters jailed on terror charges for targeting <b>Prince Harry</b> and his family",
        "description": "Two neo-Nazi podcasters who called for the deaths of <b>Prince Harry</b> and his young son Archie have received prison sentences. The sentencing judge in London called the duo “dedicated and unapologetic white supremacists&quot; who encouraged terrorism. Christopher ..."
    },
    {
        "url": "https://uk.news.yahoo.com/watch-were-culture-news-watch-063000796.html",
        "title": "What to Watch: They Were, They Are – Culture News to Watch in 2024",
        "description": "More in What to Watch: Media and Home 2024 Could Be Another Darwinian Year for Legacy Media They Were, They Are – Culture News to Watch in 2024 French Luxury Brands Worry Paris Olympics Will Be Bad for Business The Home Market, Macro Themes for 2024"
    },
    {
        "url": "https://uk.style.yahoo.com/queen-elizabeths-childhood-drawing-her-204021932.html",
        "title": "Queen Elizabeth&#39;s Childhood Drawing, Which Her Mom Brutally Dubbed &#39;Very Poor,&#39; Goes Up for Auction",
        "description": "Before she was monarch, Queen Elizabeth was an expressive little girl, and now a piece of her artwork is up for sale. The Boston-based RR Auction is currently selling a drawing be"
    },
    {
        "url": "https://news.sky.com/story/neo-nazi-podcast-hosts-who-targeted-prince-harry-and-his-son-archie-jailed-for-terror-offences-13042320",
        "title": "Neo-Nazi podcast hosts who targeted <b>Prince Harry</b> and his son Archie jailed for terror offences",
        "description": "Christopher Gibbons and Tyrone Patten-Walsh used the Black Wolf Radio podcast to air racist views and encourage listeners to commit acts of violence."
    },
    {
        "url": "https://www.independent.co.uk/news/ap-archie-london-meghan-islamophobic-b2473504.html",
        "title": "Neo-Nazi podcasters sent to prison on terror charges for targeting <b>Prince Harry</b> and his young son",
        "description": "A neo-Nazi podcaster who called for the deaths of Prince Harry and his young son has been sentenced to prison with his co-host for encouraging terrorism"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12926209/Prince-Harrys-explosive-memoir-Spare-UKs-best-selling-book-year-700-000-copies-sold-beating-Richard-Osman-Guinness-Book-World-Records.html",
        "title": "<b>Prince Harry</b>&#39;s explosive memoir Spare was the UK&#39;s best-selling book last year with more than 700,000 copies sold - beating Richard Osman and the Guinness Book of World Records",
        "description": "Figures obtained by The Bookseller have revealed the top 20 bestselling books, both hardback and paperback, in the UK in 2023 - and the Duke&#39;s memoir tops the list."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145009-bored-prince-harry-craves-excitement-of-royal-life",
        "title": "&#39;Bored&#39; <b>Prince Harry</b> craves excitement of royal life",
        "description": "Prince Harry reportedly regrets his decision to move to the US for the sake of normalcy after calling time on his royal life with wife Meghan Markle. Royal author Tom Bower revealed to the"
    },
    {
        "url": "https://www.coventrytelegraph.net/news/uk-world-news/neo-nazi-podcasters-who-called-28392782",
        "title": "Neo-Nazi podcasters who called for <b>Harry</b> and Meghan’s son &#39;to be put down&#39; jailed for terror crimes",
        "description": "Two “dedicated white supremacists” who targeted the Duke and Duchess of Sussex’s son in a neo-Nazi podcast have been jailed for terrorism offences. Christopher Gibbons described Harry and Meghan’s son Archie as a “creature [that] should be put down”."
    },
    {
        "url": "https://evoke.ie/2024/01/05/royal/the-fairytale-story-of-how-princess-mary-of-denmark-met-her-prince-during-the-olympics",
        "title": "The fairytale story of how Princess Mary of Denmark met her <b>prince</b> at a bar",
        "description": "When Mary Donaldson met with pals at a bar during the Sydney Olympics little did she know she was about to be thrust into a royal fairytale."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/case-wanted-feel-old-today-121603718.html",
        "title": "In Case You Wanted To Feel Old Today, Here Are 27 Famous People Who Turn 40 Years Old In 2024",
        "description": "Where you know him from: He&#39;s an actor best known for his roles in The Batman, There Will Be Blood, Little Miss Sunshine, The Fabelmans, 12 Years a Slave, and more."
    },
    {
        "url": "https://www.scmp.com/news/world/europe/article/3247359/neo-nazi-podcasters-who-targeted-prince-harry-young-son-archie-jailed-terror-offences",
        "title": "Neo-Nazi podcasters who targeted <b>Prince Harry</b>, young son Archie, jailed for terror offences",
        "description": "Christopher Gibbons and Tyrone Patten-Walsh espoused racist, antisemitic, Islamophobic, homophobic and misogynistic views and encouraged listeners of their ‘Lone Wolf Radio’ podcast."
    },
    {
        "url": "https://www.thesun.co.uk/news/25259674/family-rallies-prince-andrew-named-epstein-docs/",
        "title": "Family rallies around <b>Prince</b> Andrew after he is named 69 times in damning Epstein docs",
        "description": "MEMBERS of the royal family have rallied around Prince Andrew after he was named 69 times in damning Epstein docs. Andrew has been mentioned numerous times in new US court papers naming"
    },
    {
        "url": "https://www.newsweek.com/king-charles-pr-project-undermines-prince-harry-spare-1858037",
        "title": "King Charles&#39; Latest PR Project Undermines <b>Prince Harry</b>",
        "description": "Charles&#39; documentary showed an image of the royals that is &quot;very interesting to anyone who read &#39;Spare&#39;&quot; a talk show has heard."
    },
    {
        "url": "https://www.latimes.com/world-nation/story/2024-01-05/neo-nazi-podcasters-prison-targeting-prince-harry-son",
        "title": "2 Neo-Nazi podcasters sentenced to prison for targeting <b>Prince Harry</b> and his son",
        "description": "Two neo-Nazi podcasters who called for the deaths of Britain&#39;s Prince Harry and his young son have been sentenced to prison for encouraging terrorism."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1144988-meghan-markle-prince-harrys-professional-struggles-affect-their-relationship",
        "title": "Meghan Markle, <b>Prince Harry</b>’s professional struggles affect their relationship",
        "description": "Meghan Markle and Prince Harry, who stepped down from their senior royal positions in 2020, reportedly facing relationship issues amid career setbacks.In conversation with GB News, royal"
    },
    {
        "url": "https://nypost.com/2024/01/05/entertainment/meghan-markle-prince-harry-were-alienated-at-last-gathering-with-king-charles-expert/",
        "title": "Meghan Markle, <b>Prince Harry</b> were ‘alienated’ at last gathering with King Charles: expert",
        "description": "The Duke and Duchess of Sussex joined the royal family at Westminster Abbey in Sept. 2022 for the late Queen Elizabeth II’s funeral."
    },
    {
        "url": "https://www.nytimes.com/2024/01/05/us/politics/harry-dunn-congress-jan-6.html",
        "title": "Officer Who Defended Capitol on Jan. 6 to Run for Congress in Maryland",
        "description": "Harry Dunn, who endured racist slurs as he fought off a pro-Trump mob and gained fame with his emotional testimony before the Jan. 6 committee, is joining a crowded Democratic primary."
    },
    {
        "url": "https://www.skynews.com.au/opinion/fergie-and-harrys-situations-very-different-because-harry-has-been-terrible-to-his-family/video/700d84f3b30dea886bdf4604dc1f6088",
        "title": "Fergie and <b>Harry</b>’s situations ‘very different’ because <b>Harry</b> has been ‘terrible’ to his family",
        "description": "Royal expert Angela Levin says the situation between Fergie and Harry is “very different” because Harry has been “terrible” to his family, whereas Fergie has done what she has been told to do. Sarah Ferguson spent her first Christmas Day church service with the Royal family in more than 30 years this Christmas."
    },
    {
        "url": "https://www.lifestyleasia.com/bk/entertainment/celebrities/prince-abdul-mateen-of-brunei-net-worth-career-expensive-things-he-owns/",
        "title": "What we know about <b>Prince</b> Abdul Mateen’s net worth",
        "description": "One of the richest royals in Asia, know all about Prince Abdul Mateen of Brunei, his high net worth and the luxurious lifestyle he leads."
    },
    {
        "url": "https://extra.ie/2024/01/05/news/prince-archie-podcast-hosts",
        "title": "Podcast hosts jailed for targeting <b>Prince Harry</b> and his son Archie",
        "description": "Two white supremacists who said Prince Archie should be &#39;put down&#39; have been jailed for a total of 15 years for terrorism offences."
    },
    {
        "url": "https://www.newsweek.com/neo-nazis-targeted-prince-archie-prince-harry-meghan-markle-jailed-1858005",
        "title": "Neo-Nazis Who Targeted <b>Prince</b> Archie Jailed For 15 Years",
        "description": "Podcasters Christopher Gibbons and Tyrone Patten-Walsh referred to Archie as an &quot;abomination&quot; and called for Prince Harry to be killed."
    },
    {
        "url": "https://www.itv.com/watch/news/two-teens-arrested-on-suspicion-of-murder-over-harry-pitman-new-years-eve-death/wg86j5b",
        "title": "Two teens arrested on suspicion of murder over <b>Harry</b> Pitman New Year&#39;s Eve death",
        "description": "Fri 5 Jan 9am • The Metropolitan Police said a 16-year-old and a 17-year-old remain in custody after attending a west London police station on Thursday."
    },
    {
        "url": "https://www.itv.com/watch/news/two-teenagers-arrested-on-suspicion-of-murder-after-harry-pitman-death-on-new-years-eve/wg86j5b",
        "title": "Two teenagers arrested on suspicion of murder after <b>Harry</b> Pitman death on New Year&#39;s Eve",
        "description": "Watch the latest from ITV News -"
    },
    {
        "url": "https://ca.news.yahoo.com/prince-harrys-spare-most-popular-090000768.html",
        "title": "<b>Prince Harry</b>&#39;s Spare was the most popular book at Windsor Public Library in 2023",
        "description": "A memoir by former Windsor, England, resident Prince Harry tops Windsor Public Library&#39;s (WPL) list of its most popular titles of 2023. The list includes the circulation numbers for ebooks and print books during the whole of last year."
    },
    {
        "url": "https://www.cbc.ca/news/canada/windsor/library-book-list-shows-people-in-windsor-ont-care-about-prince-harry-too-1.7073890",
        "title": "Library book list shows people in Windsor, Ont., care about <b>Prince Harry</b> too",
        "description": "But, what were your fellow Windsorites interested to read last year? The Windsor Public Library&#39;s list of most popular titles has finally been released."
    },
    {
        "url": "https://www.indiatoday.in/world/story/neo-nazi-podcasters-get-jail-term-threats-prince-harry-lone-wolf-radio-london-uk-2484687-2024-01-05",
        "title": "Neo-nazi podcasters get jail term for death threats to <b>Prince Harry</b> and his son",
        "description": "Christopher Gibbons and Tyrone Patten-Walsh espoused racist, antisemitic, Islamophobic, homophobic and misogynistic views and encouraged listeners of their “Lone Wolf Radio” podcast to commit violent acts against ethnic minorities,"
    },
    {
        "url": "https://metro.co.uk/2024/01/05/whoopi-goldberg-responds-insane-rumours-epsteins-list-20067374/",
        "title": "Whoopi Goldberg responds to ‘insane’ rumours she’s on Epstein’s list",
        "description": "Whoopi Goldberg has hit back at conspiracy theories she is among the names on Jeffrey Epstein’s list. Unsealed documents named high-profile figures, including Prince Andrew, Michael Jackson, Bill Clinton, and Stephen Hawking, as associates of the late billionaire, who ran a sex trafficking ring with Ghislaine Maxwell."
    },
    {
        "url": "https://www.lifestyleasia.com/kl/culture/people/prince-abdul-mateen-of-brunei-net-worth-career-expensive-things-he-owns/",
        "title": "<b>Prince</b> Abdul Mateen of Brunei: Net worth, luxurious lifestyle and his role as a royal",
        "description": "One of the richest royals in Asia, know all about Prince Abdul Mateen of Brunei, his high net worth and the luxurious lifestyle he leads."
    },
    {
        "url": "https://gamerant.com/harry-potter-best-magical-stores/",
        "title": "<b>Harry</b> Potter: 7 Most Magical Stores In The Wizarding World",
        "description": "The Wizarding World of Harry Potter has all sorts of magical shops and stores, from mischievous to professional magic."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/firing-the-slow-motion-starting-gun/",
        "title": "Firing the slow-motion starting gun",
        "description": "THE SLOWEST STARTING GUN: Westminster is bracing for a grueling 10-month-long campaign after Prime Minister Rishi Sunak said his “working assumption” was an election in the second half of the year — an intervention designed to calm speculation about a snap poll this spring."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/breaking-meghan-markle-furious-royal-family-different-rules-prince-harry-sarah-ferguson-5-january-2024/",
        "title": "Meghan Markle ‘furious’ over royal family’s ‘different rules’ for her?",
        "description": "Meghan Markle reportedly &#39;furious&#39; that the royal family has &#39;different rules&#39; for her after Sarah Ferguson was &#39;welcomed back.&#39;"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/watch-were-culture-news-watch-063000796.html",
        "title": "What to Watch: They Were, They Are – Culture News to Watch in 2024",
        "description": "They revealed their divorces, they went on strike, they made pink the most popular color on the movie premiere circuit (and almost everywhere else), they stood trial for a ski accident and so much more."
    },
    {
        "url": "https://uk.news.yahoo.com/why-king-charles-cant-remove-194408945.html",
        "title": "Why King Charles Can&#39;t Remove <b>Prince</b> Andrew&#39;s Royal Titles amid Epstein Files Reveal",
        "description": "Prince Andrew was named in the court filings that were unsealed on Wednesday, but his royal status likely won&#39;t change"
    },
    {
        "url": "https://www.thesun.co.uk/news/25253413/prince-andrew-sleepless-nights-over-epstein-bombshells/",
        "title": "<b>Prince</b> Andrew will have ‘a few sleepless nights with his teddy bears’ over new Epstein bombshells blasts his cousin",
        "description": "PRINCE Andrew’s cousin believes he’ll have “a few sleepless nights with his teddy bears” but be back to living “The Life of Riley” after the bombshell Jeffrey Epstein"
    },
    {
        "url": "https://metro.co.uk/2024/01/04/neo-nazis-said-harry-meghans-son-should-put-down-jailed-20066335/",
        "title": "Neo-Nazis who said <b>Harry</b> and Meghan’s son Archie ‘should be put down’ jailed",
        "description": "Two ‘dedicated and unapologetic white supremacists’ who targeted Prince Archie in a neo-Nazi podcast have been jailed for terrorism offences. Christopher Gibbons described Harry and Meghan’s son as a ‘creature [that] should be put down’ and called for Harry to be ‘prosecuted and judicially killed for treason’."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-desperate-say-over-31808508",
        "title": "Meghan Markle &#39;desperate to have her say&#39; over Kate Middleton backlash, author claims",
        "description": "Prince Harry&#39;s wife Meghan Markle could be eager for a fresh start and ready to &#39;have her say&#39; after being &#39;bruised&#39; by the backlash caused by Omid Scobie&#39;s bombshell book Endgame"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-doesnt-put-enough-31807376",
        "title": "King Charles doesn&#39;t put in enough &#39;effort&#39; to see his grandkids Archie and Lilibet, expert claims",
        "description": "The King has only met Prince Harry and Meghan Markle&#39;s two children Archie and Lilibet on a handful of occasions due to his estranged relationship with the Sussexes."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510573/meghan-markle-celebrates-major-business-never-clevr-blends/",
        "title": "Meghan Markle celebrates major business news - details",
        "description": "Meghan Markle started 2024 off with business celebratations as Clevr Blends, in which the Duchess is a stakeholder, began stacking products in US-based shopping brand Target, with three of their super lattes hitting the shelves."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/fashion-news/river-islands-satin-slip-skirt-28388958",
        "title": "River Island&#39;s satin slip skirt with a stretchy waistband that hides unwanted bloating now £17",
        "description": "The khaki skirt has been made from a soft, satin fabric cut to a maxi length. It features a stretchy elasticated waist that makes the skirt is comfortable to wear all day, especially if you are prone to bloating after the lunch."
    }
]