[
    {
        "url": "https://nypost.com/2024/02/11/entertainment/king-charles-thanks-public-for-support-makes-first-appearance-since-cancer-diagnosis/",
        "title": "King Charles thanks public for support, makes first appearance since cancer diagnosis",
        "description": "I would like to express my most heartfelt thanks for the many messages of support and good wishes I have received in recent days,” Charles said in a statement."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/king-charles-only-saw-prince-32102186",
        "title": "King Charles only saw <b>Prince Harry</b> for 30 minutes &#39;to keep stress down&#39;, expert claims",
        "description": "Prince Harry flew from California to London to see his father in person following his cancer news but was only granted a mere 30 minutes to see the King in a bid to keep the Monarch&#39;s &#39;blood pressure"
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1865587/Prince-Harry-Meghan-Markle-ditch-Super-Bowl",
        "title": "<b>Prince Harry</b> and Meghan Markle ditch Super Bowl and NFL pal chats to Taylor Swift instead",
        "description": "Prince Harry made a surprise appearance at NFL Honors in Vegas, but he didn&#39;t stay long and Meghan Markle did not arrive."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-will-return-uk-32101601",
        "title": "<b>Prince Harry</b> &#39;will return to the UK&#39; again in coming weeks after King Charles reunion",
        "description": "Prince Harry is tipped to return to the UK in May to celebrate the 10th anniversary of the Invictus Games, which he founded in 2014, after a quick visit to see King Charles"
    },
    {
        "url": "https://www.lbc.co.uk/news/details-king-charles-cancer-treatment-prince-harry/",
        "title": "First details of King&#39;s cancer treatment plan sheds light on why he only met <b>Harry</b> for 30 mins",
        "description": "Details of The King&#39;s treatment plan to battle his cancer have been revealed for the first time - as royal experts shed light on why Charles only met Harry for 30 minutes in their recent reunion."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865572/prince-harry-dangerous-king-charles-reason-provided",
        "title": "<b>Prince Harry</b> ‘spells danger for the King’ and the reason is made simple",
        "description": "Prince Harry made a mad dash to the UK last week to see King Charles, which has been deemed troubling by a royal insider. Ingrid Seward spoke to The Telegraph, saying, “I think Harry spells danger for the King,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-returning-uk-again-32100878?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> is returning to the UK again in a matter of weeks after King Charles reunion",
        "description": "Prince Harry will travel back to the UK mere weeks after his rushing visit to King Charles. The Duke of Sussex will return in the Spring to celebrate the Invictus Games"
    },
    {
        "url": "https://www.hellomagazine.com/homes/513226/charles-spencer-wife-karen-shares-rare-glimpse-princess-diana-resting-place-tranquil/",
        "title": "Charles Spencer&#39;s wife Karen shares rare glimpse of Princess Diana&#39;s resting place – and it&#39;s so tranquil",
        "description": "Charles Spencer&#39;s wife Karen regularly posts stunning glimpses of the family home where she lives with her husband and their daughter, Charlotte Diana . The spacious estate, Althorp House, which has been in the Spencer family for more than 500 years, is also where Charles&#39; sister Princess Diana was laid to rest."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25863499/king-charles-cancer-care-plan-revealed/",
        "title": "Inside King Charles’ cancer care plan as royal expert explains why he couldn’t see <b>Harry</b> for longer than 30 minutes",
        "description": "KING Charles only saw Prince Harry for 30 minutes to keep his stress levels down, a royal expert has revealed. Writer and broadcaster Robert Jobson exclusively told The Sun’s Royal Editor"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071477/king-charles-cancer-son-prince-harry-meeting-royal-expert.html",
        "title": "Cancer-stricken King Charles only saw his son <b>Prince Harry</b> for 30 minutes &#39;to keep his stress levels down&#39;, royal expert claims",
        "description": "I would like to express my most heartfelt thanks for the many messages of support and good wishes I have received in recent days. &#39;As all those who have been affected by cancer will know, such kind thoughts are the greatest comfort and encouragement."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-sandringham-camilla-b2494314.html",
        "title": "King Charles makes first public outing at Sandringham since cancer diagnosis",
        "description": "It comes after Buckingham Palace said the King, who acceded to the throne 17 months ago, has a ‘form of cancer’"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25854743/meghan-jealous-harrys-brotherly-love-kate/",
        "title": "Meghan is jealous of <b>Harry</b>’s brotherly ‘love’ for Kate – after the <b>prince</b> always longed for a sister, says royal expert",
        "description": "MEGHAN Markle is “jealous” of Prince Harry’s brotherly “love” for Kate, a royal expert has claimed.  Ingrid Seward believes that the Duchess of Sussex is “incredibly envious” of the"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13070841/Meghan-Markle-incredibly-envious-Kate-Middleton-Duchess-thought-going-princess-live-Windsor-Castle-says-royal-expert.html",
        "title": "Meghan Markle &#39;must have been incredibly envious&#39; of Kate Middleton because of Princess&#39; sisterly relationship with <b>Prince Harry</b>, says royal expert",
        "description": "Editor of Majesty magazine Ingrid Stewart told The Telegraph how the Duchess of Sussex , 42, &#39;thought she was going to be a princess and live in Windsor Castle&#39;."
    },
    {
        "url": "https://www.gg2.net/king-charles-thanks-supporters-in-first-statement-after-cancer-news/",
        "title": "King Charles thanks supporters in first statement after cancer news",
        "description": "King Charles III expressed his “heartfelt thanks” to well-wishers on Saturday (10), in his first statement following his shock announcement that he had been"
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/10/",
        "title": "<b>Prince Harry</b> updates — Duke and Meghan ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE Harry and Meghan Markle will attend this weekend’s Super Bowl just days after the Duke’s whirlwind visit to the UK, sources say. Harry met with King Charles in a short 30-minute"
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-attends-church-alongside-150819683.html",
        "title": "King Charles Attends Church Alongside Queen Camilla for the 1st Time Since Beginning Cancer Treatment",
        "description": "King Charles has made his first public outing since beginning cancer treatment earlier this week. The 75-year-old monarch appeared alongside Queen Camilla on Sunday as they attended a church service at St Mary Magdalene Church in Sandringham, Norfolk, and gave a wave to photographers as he made his way to church with Camilla, 76."
    },
    {
        "url": "https://uk.news.yahoo.com/why-prince-harry-meghan-markle-222000139.html",
        "title": "Why <b>Prince Harry</b> and Meghan Markle Will Not Attend the Super Bowl",
        "description": "Prince Harry attended the NFL Honors in Las Vegas, but that doesn&#39;t mean he will be at the Super Bowl on Sunday."
    },
    {
        "url": "https://edition.cnn.com/2024/02/11/europe/king-charles-public-cancer-diagnosis-intl-gbr/index.html",
        "title": "King Charles makes first public outing since cancer diagnosis",
        "description": "King Charles III has appeared in public for the first time since his cancer diagnosis, attending church alongside Queen Camilla."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-health-cancer-update-william-kate-b2493972.html?ref=mc.news",
        "title": "King Charles cancer – latest: Monarch smiles and waves at Sandringham as William ‘upset’ with <b>Harry</b>",
        "description": "The departure came after he reunited with son Prince Harry, marking the pair’s first reunion since the monarch announced his cancer diagnosis. Harry is understood to have spent around 45 minutes with the King, having arrived at Clarence House just hours after touching down at Heathrow Airport."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/world-news/super-bowl-2024-prince-harry-28611618",
        "title": "Super Bowl 2024 - <b>Prince Harry</b> and Meghan Markle &#39;set to miss the big game&#39; despite invite",
        "description": "The Duke and Duchess of Sussex were asked to attend tonight&#39;s big game that will see the San Francisco 49ers take on the Kansas City Chiefs."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/prince-harrys-hand-gesture-shows-32099340.amp",
        "title": "<b>Prince Harry</b>&#39;s hand gesture shows &#39;true feelings&#39; after King Charles visit, expert says",
        "description": "A body language expert has broken down Prince Harry&#39;s mannerisms after he returned from his trip to the UK to see his father, who has been diagnosed with cancer."
    },
    {
        "url": "https://inews.co.uk/opinion/camilla-king-charles-secret-weapon-2898574",
        "title": "How Camilla became King Charles’s secret weapon",
        "description": "It portends a more high-profile role for Camilla – and surfaces testing questions about how the royal pecking order will work during the King’s illness and beyond. One one score, the Queen has scotched doubts about her commitment to duties by performing several public events in the last year (including the draining preparation for the coronation) and energetically working the crowds on visits to Berlin,"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/prince-harry-has-jolly-good-time-roasting-american-football-at-nfl-honors_uk_65c88427e4b093b2e783f03c?d_id=7290193&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Prince Harry</b> Has Jolly Good Time Roasting American Football At NFL Honors",
        "description": "<b>Prince Harry</b> shouldn’t quit his day job (well, he did that already.) But the Duke of Sussex ably riffed on American football at the NFL Honors Thursday in Las Vegas, just days ahead of Sunday’s Super Bowl there. In presenting the Walter Payton NFL Man ..."
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/tv-host-called-vile-over-claim-prince-harry-drama-contributed-to-king-charles-cancer/",
        "title": "TV Host Called &#39;Vile&#39; Over Claim <b>Prince Harry</b> Drama &#39;Contributed&#39; to King Charles&#39; Cancer",
        "description": "A guest on the U.K.&#39;s right-wing news network GB News created controversy recently by floating the idea that the ongoing drama with Prince Harry and Meghan Markle &quot;contributed&quot; to King Charles III&#39;s cancer diagnosis."
    },
    {
        "url": "https://www.newshub.co.nz/home/entertainment/2024/02/harry-only-saw-cancer-stricken-father-king-charles-for-30-mins-to-keep-stress-levels-down-report.html",
        "title": "<b>Harry</b> only saw cancer-stricken father King Charles for 30 mins &#39;to keep stress levels down&#39; - report",
        "description": "Prince Harry only spent 30 minutes with his cancer-stricken father King Charles in an effort &quot;to keep stress levels down&quot;, a royal expert has claimed. On February 7, Harry flew from California to London and back again on the same day following the news on Tuesday (UK time) Charles had been diagnosed with cancer."
    },
    {
        "url": "https://www.cleveland.com/browns/2024/02/travis-kelce-on-how-cleveland-shaped-him-how-much-he-has-left-in-tank-and-if-hell-bring-taylor-swifts-eras-tour-to-his-hometown.html",
        "title": "Travis Kelce on how Cleveland shaped him, how much he has left in the tank, and if he’ll bring Taylor Swift’s Eras Tour to his hometown",
        "description": "LAS VEGAS — No matter how big Travis Kelce gets — and he and his new love Taylor Swift are approaching Prince Harry and Meghan Markle status — he’ll always be a kid from Cleveland Heights who appreciates his roots."
    },
    {
        "url": "https://pagesix.com/2024/02/11/royal-family/king-charles-goes-to-church-for-the-first-time-since-starting-cancer-treatment/",
        "title": "King Charles spotted going to church for the first time since starting cancer treatment",
        "description": "The outing comes a day after the monarch released a statement thanking well-wishers for their support following his cancer diagnosis."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156695-meghan-markle-prince-harry-skipping-super-bowl-because-of-taylor-swift",
        "title": "Meghan Markle, <b>Prince Harry</b> skipping Super Bowl because of Taylor Swift?",
        "description": "Meghan Markle and Prince Harry decided to skip the much-awaited 2024 Super Bowl Championship because of Taylor Swift&#39;s expected appearance in the big game, claim fans.Several fans believe that"
    },
    {
        "url": "https://www.news.com.au/sport/nfl/super-bowl-2024-all-the-latest-news-and-highlights-from-las-vegas/news-story/a58f5d6a8e3131ba9625dc0ae5db3d5d",
        "title": "Super Bowl 2024: All the latest news and highlights from Las Vegas",
        "description": "Taylor Swift will be there, Prince Harry won’t, the San Francisco 49ers are complaining of a hijacked preparation, while the Kansas City Chiefs are ruing a major injury blow in a dramatic build-up to Super Bowl LVIII."
    },
    {
        "url": "https://www.whas11.com/article/entertainment/entertainment-tonight/king-charles-iii-steps-out-for-the-first-time-since-cancer-diagnosis/603-41bbaf2d-f223-4255-8013-8b6fc273ff0b",
        "title": "King Charles III Steps Out for the First Time Since Cancer Diagnosis",
        "description": "On Sunday, Charles was spotted publicly for the first time since he announced he is battling cancer. Prince Harry and Prince William&#39;s father was seen arriving at St. Mary Magdalene Church at the Sandringham Estate with his wife, Queen Camilla."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1156690-meghan-markle-accused-of-using-prince-harry-for-personal-gains",
        "title": "Meghan Markle accused of &#39;using&#39; <b>Prince Harry</b> for &#39;personal gains&#39;",
        "description": "Meghan Markle has been accused of using Prince Harry for her personal gains by a royal expert. In conversation with GB News, royal commentator Candace Owens claimed that the former Suits"
    },
    {
        "url": "https://www.scmp.com/news/world/europe/article/3251702/king-charles-attends-church-first-public-appearance-revealing-he-has-cancer",
        "title": "King Charles attends church in first public appearance since revealing he has cancer",
        "description": "King was joined by Queen Camilla at St Mary Magdalene Church near Sandringham House where Charles is recuperating after first treatment for an unspecified form of cancer."
    },
    {
        "url": "https://omaha.com/life-entertainment/nation-world/here-is-the-order-of-succession-to-the-british-throne/collection_a55f6396-bd50-5ee5-bdf3-a41141333b39.html",
        "title": "Here is the order of succession to the British throne",
        "description": "Who will take the throne after King Charles III? Here&#39;s a look at the current order of succession in the British monarchy."
    },
    {
        "url": "https://deadline.com/2024/02/king-charles-speaks-public-cancer-diagnosis-1235822040/",
        "title": "King Charles Speaks For First Time Since Cancer Diagnosis",
        "description": "King Charles has spoken publicly for the first time since his cancer diagnosis was revealed. The British monarch released a statement Saturday to share his “heartfelt thanks” for all the messages of support he has received in the past week, while he undergoes treatment for the unspecified condition."
    },
    {
        "url": "https://uk.style.yahoo.com/king-charles-diagnosed-cancer-receiving-180515612.html",
        "title": "King Charles cancer – latest: Monarch smiles and waves at Sandringham as William ‘upset’ with <b>Harry</b>",
        "description": "Following the news, Harry dashed to the UK to reunite with the King – but he reportedly spent less than an hour with the him before returning home to California the next day, having had no contact with his estranged brother Prince William."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/prince-harry-meghan-fix-image-32098970",
        "title": "<b>Prince Harry</b> and Meghan may &#39;fix image&#39; by picking up royal duties in the UK",
        "description": "The Duke and Duchess of Sussex could fix up their images by returning to the UK and picking up their royal duties again, according to an expert."
    },
    {
        "url": "https://www.scotsman.com/news/people/king-charles-attends-church-for-first-time-since-cancer-diagnosis-4513706",
        "title": "King Charles attends church for first time since cancer diagnosis",
        "description": "He attended a service at St Mary Magdalene Church in Sandringham with Queen Camilla this morning. Did you know with a Digital Subscription to The Scotsman, you can get unlimited access to the website including our premium content,"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-king-charles-reunion-32098376",
        "title": "&#39;<b>Prince Harry</b> was happy with his visit to King Charles - there was no anxiety&#39;",
        "description": "A body language expert has shed light on Prince Harry&#39;s relationship with King Charles, after he flew to the UK to visit his dad, following a shocking cancer diagnosis"
    },
    {
        "url": "https://www.thesun.ie/royals/12182205/king-charles-cancer-care-plan-revealed/",
        "title": "King Charles’ cancer care plan revealed as royal expert explains why he couldn’t see <b>Harry</b> for longer than 30 minutes",
        "description": "KING CHARLES could soon leave Sandringham as part of his cancer care plan, a royal expert has revealed.  The monarch, 75, left the London Clinic with the Queen at his side last week after"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25852757/prince-harry-must-apologise-king-charles-william/",
        "title": "<b>Prince Harry</b> must realise he has to apologise to William and King Charles… but I doubt he will, says Royal expert",
        "description": "A ROYAL expert has told how Prince Harry must realise he has to apologise to both King Charles and Prince William. But writer and broadcaster Robert Jobson told The Sun he doubts the embattled"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513207/king-charles-attends-church-sandringham-first-time-since-cancer-diagnosis-announcement/",
        "title": "King Charles attends church for first time since cancer diagnosis announcement",
        "description": "King Charles stepped out in Sandringham on Sunday to attend church for the first time since the announcement of his cancer diagnosis."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/prince-harrys-hand-thrust-reveals-28610407",
        "title": "<b>Prince Harry</b>&#39;s &#39;hand thrust&#39; reveals true feelings claims body language expert",
        "description": "A relaxed and smiling Harry was seen at Heathrow ready to fly back to Los Angeles after a quick trip to see his father following his cancer diagnosis."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/nine-words-king-charles-new-28610364",
        "title": "The nine words in King Charles&#39; new cancer statement that will worry royal fans",
        "description": "King Charles shared a moving statement on Saturday night, six days after the Royal Family confirmed the monarch&#39;s shock health news. In it, the 75-year-old monarch says he has received messages from the public in the days since news emerged."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/11/pity-suv-drivers-fast-being-priced-out-of-their-badges-of-contempt-for-the-planet",
        "title": "Pity SUV drivers, fast being priced out of their badges of contempt for the planet",
        "description": "With the royals as ambassadors for these luxury cars, there’s little hope for the rest of us"
    },
    {
        "url": "https://www.bbc.com/news/uk-68265751",
        "title": "King Charles thanks public for support after cancer diagnosis",
        "description": "King Charles has given his &quot;heartfelt thanks&quot; for messages of support from the public, in his first statement since being diagnosed with cancer. The 75-year-old monarch said: &quot;As all those who have been affected by cancer will know, such kind thoughts are the greatest comfort and encouragement.&quot;"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-line-of-succession-charles-william-b2494295.html",
        "title": "British line of succession: Who is next heir to the throne as Charles diagnosed with cancer",
        "description": "As the second child of King Charles III and the late Princess Diana, Prince Harry is fifth in line for the throne after his brother, nephews and niece. His wife, Meghan Markle, is not in line for the throne - much like the Duchess of Cambridge - but their two children are."
    },
    {
        "url": "https://www.cornwalllive.com/news/uk-world-news/king-charles-sends-heartfelt-message-9092279",
        "title": "King Charles sends heartfelt message to nation as he battles cancer",
        "description": "King Charles has shared a heartfelt update on his cancer battle, expressing gratitude for the nation&#39;s support. In a statement, he said it was the &quot;greatest comfort&quot; and that sharing his diagnosis has helped highlight organisations aiding patients, which has also touched the Queen."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/11/king-charles-cancer-illness-parent-harry-william?ref=upstract.com",
        "title": "Will the king’s cancer heal his feuding sons – or create a new schism?",
        "description": "When a parent is unwell, family rivalries from a tangled past may resurface – as appears to be happening with Harry and William"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/my-grandad-founded-kelloggs-uk-28604248",
        "title": "&#39;My grandad founded Kellogg&#39;s in the UK and set up the Trafford factory... he&#39;d be turning in his grave&#39;",
        "description": "John Healy, grandson of Harry McEvoy, spoke to the M.E.N. following the news the company&#39;s Trafford Park site - opened in 1938 - could shut, with the loss of 360 jobs"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/prince-harry-has-jolly-good-time-roasting-american-football-at-nfl-honors_uk_65c88427e4b093b2e783f03c",
        "title": "<b>Prince Harry</b> Has Jolly Good Time Roasting American Football At NFL Honors",
        "description": "Prince Harry shouldn’t quit his day job (well, he did that already .) But the Duke of Sussex ably riffed on American football at the NFL Honors Thursday in Las Vegas, just days ahead of Sunday’s Super Bowl there. In presenting the Walter Payton NFL Man of the Year, the royal told the crowd:"
    },
    {
        "url": "https://www.leeds-live.co.uk/news/uk-world-news/king-charles-heartening-message-nation-28610110",
        "title": "King Charles&#39; heartening message to nation as he issues cancer update",
        "description": "King Charles has shared a heartfelt update on his cancer battle, expressing gratitude for the nation&#39;s support. In a statement, he said it was the &quot;greatest comfort&quot; and that his diagnosis has helped highlight the work of organisations aiding patients."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/11/meghan-jealous-envious-kate-ingrid-steward-royal/",
        "title": "Ingrid Seward: ‘I think Meghan must have been incredibly envious and then jealous of Kate’",
        "description": "The 76-year-old editor of Majesty magazine is a seasoned royal commentator – but Buckingham Palace never ceases to surprise her"
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/line-of-succession",
        "title": "What is the official line of succession to the British throne?",
        "description": "Read on to find out the official line of succession, from Prince William to Lucas Tindall... 3. Princess Charlotte (daughter of Prince William, granddaughter of King Charles) 15. James, Earl of Wessex (son of Prince Edward, grandson of late Queen Elizabeth II)"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/city-centre-wetherspoons-everyone-knows-28584246",
        "title": "The city centre Wetherspoons everyone knows that hides a sordid history",
        "description": "Built in 1838, The Prince of Wales first opened its doors as the New Theatre Royal after the original theatre in Park Place burned down in a fire. Attracting audiences of up to 2,000 people, opening night reviews described the venue as “a picture of beauty never yet equalled in Cardiff ”."
    },
    {
        "url": "https://www.sundaytimes.lk/240211/columns/rambukwellas-arrest-disgrace-as-alleged-sins-come-home-to-roost-548428.html",
        "title": "Rambukwella’s arrest disgrace as alleged sins come home to roost",
        "description": "On New Year’s Day, a wreath of flowers was laid outside Rambukwella’s residence by civil activists to express the nation’s outrage over his non-arrest. Following a complaint made by Rambukwella’s daughter, they were arrested but later released."
    },
    {
        "url": "https://uk.style.yahoo.com/king-charles-speaks-first-time-015950549.html",
        "title": "King Charles Speaks Out for First Time Following Cancer Diagnosis",
        "description": "King Charles III is speaking out for the first time publicly after being diagnosed with cancer. On Saturday, Buckingham Palace released a statement on the 75-year-old monarch’s behalf, where he shared his appreciation for the support he has received amid his recent health news."
    },
    {
        "url": "https://english.elpais.com/people/2024-02-09/who-is-mark-dyer-and-why-does-the-british-media-think-he-can-bring-princes-harry-and-william-back-together-again.html",
        "title": "Who is Mark Dyer, and why does the British media think he can bring Princes <b>Harry</b> and William back together again?",
        "description": "The next day, <b>Harry</b> returned to the United States. The Duke of Sussex did not see his busy brother, <b>Prince</b> William, who has taken center stage in the royal family’s public activities now that his father is out of the spotlight. The two brothers are ..."
    },
    {
        "url": "https://inews.co.uk/news/sandringham-estate-norfolk-2894623?ico=in-line_link",
        "title": "Inside Sandringham – the King’s 20,000-acre Norfolk base during cancer treatment",
        "description": "The monarch travelled to the private estate in Norfolk by helicopter from Buckingham Palace on Tuesday afternoon shortly after meeting with his estranged son <b>Prince Harry</b>, the Duke of Sussex. Charles and Queen Camilla reportedly landed at Sandringham just ..."
    }
]