[
    {
        "url": "https://au.lifestyle.yahoo.com/prince-harry-meghan-markle-hit-back-at-critics-will-not-be-broken-213300340.html",
        "title": "<b>Prince Harry</b>, Meghan Markle hit back at critics: &#39;Will not be broken&#39;",
        "description": "The couple stand united amid backlash over their trip to Canada in the wake of King Charles&#39; health. Read more."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/15/prince-harry-meghan-serenaded-god-save-the-king-whistler/",
        "title": "<b>Prince Harry</b> and Meghan serenaded with God Save The King by skiers",
        "description": "Sussexes waved to crowds as they left Whistler Mountain after an event to mark one-year countdown to next Invictus Games"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-hit-back-32137441",
        "title": "<b>Prince Harry</b> and Meghan hit back at &#39;make or break&#39; claims during Invictus Games appearance",
        "description": "The Duke and Duchess of Sussex are in the middle of a three-day in Canada for the Invictus Games although have been warned to &#39;behave&#39; after believed attempts to build bridges."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/15/harry-meghan-coat-of-arms-mistakes-sussex/",
        "title": "There are three mistakes on <b>Harry</b> and Meghan’s new coat of arms – can you spot them?",
        "description": "Perhaps significantly, the arms they display are actually Meghan’s, which were granted to her when she was still an HRH. These were designed by Thomas Woodcock, when he was Garter King of Arms, and were announced to the world on May 25 2018, a few days after the wedding."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-meghan-defiant-statement-32137061",
        "title": "Meghan Markle and <b>Prince Harry</b> hit back over criticism with defiant statement",
        "description": "Prince Harry and Meghan Markle have hit back at claims that their Invictus Games trip is &quot;make or break&quot;, if they want to salvage a relationship with the Royal Family"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088871/Prince-Harry-hits-criticism-Sussex-com-Royal-rebrand-defiantly-insisting-Meghan-not-broken.html",
        "title": "<b>Prince Harry</b> hits back after criticism of Sussex.com and Royal rebrand, defiantly insisting he and Meghan &#39;Will not be broken&#39;",
        "description": "<b>Harry</b> and Meghan are currently in an ongoing row over the Duke ... Furthermore, a royal source told the Times that <b>Prince</b> Archie, four, and Princess Lilibet, two, have been known as Archie Sussex and Lilibet Sussex, rather than Mountbatten-Windsor ..."
    },
    {
        "url": "https://uk.style.yahoo.com/why-meghan-markle-prince-harry-182139610.html",
        "title": "Why Meghan Markle and <b>Prince Harry</b> Broke Royal Tradition With Their Kids’ New Last Name",
        "description": "According to changes made back in the &#39;60s, “The King’s descendants, other than those with the style of Royal Highness and the title of Prince/Princess, or female descendants who marry, would carry the name of Mountbatten-Windsor.”"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-face-make-32130656",
        "title": "<b>Prince Harry</b> and Meghan face &#39;make or break&#39; three days to fix feud with Royal Family",
        "description": "The Duke and Duchess of Sussex have had a strained relationship with the Royal Family in recent years but a chance to &#39;salvage a relationship&#39; could be possible if they show &#39;discretion&#39;"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-celebrate-175959309.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Celebrate Valentine&#39;s Day with Romantic Dinner in Canada: See the Menu!",
        "description": "Meghan Markle and Prince Harry capped off their Valentine&#39;s Day in Canada with an intimate dinner for two."
    },
    {
        "url": "https://www.ok.co.uk/celebrity-pictures/meghan-markle-letting-harry-take-32134380",
        "title": "Meghan Markle letting <b>Harry</b> &#39;take the lead&#39; as she takes &#39;significant&#39; step back",
        "description": "Meghan Markle and Prince Harry put on a loved-up display as they arrived in Whistler, Canada, to promote the Invictus Games – with both dressed for the wintery weather"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25969514/prince-harry-meghan-markle-issue-defiant-statement/",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle blast ‘we cannot be broken’ in defiant statement after fierce criticism of Sussex rebrand",
        "description": "PRINCE Harry and Meghan Markle have issued a defiant “we cannot be broken” statement amid fierce criticism of their rebrand. The week has seen a flurry of announcements from the"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867220/royal-family-prince-harry-meghan-markle-new-statement-make-or-break",
        "title": "&#39;We won&#39;t be broken&#39;: <b>Prince Harry</b> and Meghan Markle hit back at &#39;make or break&#39; claims",
        "description": "Prince Harry and Meghan will continue to &#39;work and pursue what they believe in&#39; despite the challenges and the critics."
    },
    {
        "url": "https://uk.news.yahoo.com/best-photos-meghan-markle-prince-171849947.html",
        "title": "All the Best Photos from Meghan Markle and <b>Prince Harry</b>&#39;s Trip to Canada for the Invictus Games Countdown",
        "description": "The Duke and Duchess of Sussex are in Vancouver and Whistler for the Invictus Games 2025&#39;s One Year to Go celebrations"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-embarrassed-couldnt-stop-32136396",
        "title": "King Charles &#39;embarrassed&#39; that he couldn&#39;t stop &#39;<b>Prince Harry</b> upsetting late Queen&#39;",
        "description": "Royal author Ingrid Seward claims Harry&#39;s relationship with his dad King Charles began to sour following the Duke of Sussex&#39;s digs towards the late Queen Elizabeth."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13086433/EDEN-Harry-Meghans-shameless-new-website.html",
        "title": "RICHARD EDEN: <b>Harry</b> and Meghan&#39;s shameless new website only serves to undermine King Charles. They are determined to become a rival Royal Family...",
        "description": "Richard Eden believes that the new-look website, Sussex.com, is an &#39;audacious&#39; move which will undermine King Charles and his heir, Harry&#39;s brother, the Prince of Wales."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513547/meghan-markle-prince-harry-canada-day-two/",
        "title": "<b>Prince Harry</b> and Meghan Markle step out for second day of Canada trip - live updates",
        "description": "The Duke and Duchess of Sussex are continuing their visit in Canada and the couple are expected to meet more competitors and coaches on day two. The three-day trip comes amid a busy week for Prince Harry and Meghan. On Monday, they launched their new Sussex.com website, a &quot;one stop shop&quot; for all their activities."
    },
    {
        "url": "https://www.harpersbazaar.com/uk/celebrities/news/a46802642/prince-harry-meghan-markle-invictus-games-vancouver/",
        "title": "The Sussexes arrive in Vancouver to launch the 2025 Invictus Games",
        "description": "Harry wore a coordinating winter look composed of a black jacket, grey jumper, classic blue jeans, black and tan snow shoes, and a grey beanie. The Sussexes held hands as they walked through the snow and joined participants to learn more about the new winter sports that are coming to Invictus Games Vancouver Whistler 2025 for the first time."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markle-went-32134702?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;went against everything they promised&#39; in latest decision",
        "description": "Prince Harry and Meghan Markle have launched a new website boasting their links to the Royal family - four years after quitting their roles to seek &#39;financial freedom&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867198/prince-harry-queen-elizabeth-royal-rift-latest",
        "title": "<b>Prince Harry</b> put late Queen Elizabeth in &#39;impossible position&#39; with scathing attacks",
        "description": "A royal biographer alleges that Prince Harry&#39;s attitude towards the British monarchy put his late grandmother, Queen Elizabeth in a very difficult spot."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meghan-markle-wears-decade-old-161352242.html",
        "title": "Meghan Markle Wears Decade-Old Boots Just Like Kate Middleton!",
        "description": "The Duchess of Sussex also recycled another piece of winter gear that has been in her closet for many years in Canada"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-moves-out-windsor-28641166",
        "title": "Kate Middleton moves out of Windsor to &#39;continue&#39; recovery in health battle",
        "description": "William travelled to Anmel Hall this week for the half-term break with their children, Prince George, Princess Charlotte and Prince Louis."
    },
    {
        "url": "https://uk.news.yahoo.com/defiant-duke-duchess-sussex-insist-201500439.html",
        "title": "Defiant Duke and Duchess of Sussex insist they will ‘not be broken’ by critics",
        "description": "The Duke and Duchess of Sussex have defiantly said they will “not be broken” by criticism of their latest rebrand. <b>Prince Harry</b>, 39, and his wife Meghan, 42, were this week slammed by critics who said they were trying to “cash in” on their former ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-reportedly-avoided-queen-164702056.html",
        "title": "<b>Prince Harry</b> Reportedly Avoided Queen Camilla During His Visit With King Charles",
        "description": "He didn&#39;t even want to &quot;be in the same room&quot; as her. Getty Images After King Charles&#39;s cancer diagnosis, <b>Prince Harry</b> rushed to the U.K. to be by his father&#39;s side. During the quick trip, however, <b>Harry</b> avoided run-ins with any other royals, including his ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meghan-markle-prince-harry-reveal-162424628.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Reveal a Historic First During Their Visit to Canada",
        "description": "The couple toured the Squamish Lil&#39;wat Cultural Centre, a First Nations museum and art gallery Jeremy Allen for Invictus Games Meghan Markle and <b>Prince Harry</b> - Invictus Games 2024 Meghan Markle and <b>Prince Harry</b> helped unveil a historic first in debuting ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-gets-recharged-invictus-190018438.html",
        "title": "<b>Prince Harry</b> &#39;Gets Recharged&#39; at the Invictus Games: &#39;He&#39;s with His People Now,’ Athlete Says",
        "description": "&quot;His focus is on understanding the athletes,&quot; Invictus Games alumnus Mike Bourgeois tells PEOPLE Andrew Chin/Getty <b>Prince Harry</b>, Duke of Sussex and Meghan, Duchess of Sussex attend Invictus Games Vancouver Whistlers 2025&#39;s One Year To Go Winter Training ..."
    },
    {
        "url": "https://www.peacefmonline.com/pages/foreign/news/202402/499386.php",
        "title": "<b>Prince Harry</b> Hits Back After Criticism Of Sussex.Com And Royal Rebrand",
        "description": "Prince Harry and Meghan have hit back at criticism of their sussex.com website and royal rebrand by saying &#39;will not be broken&#39;. The couple are embroiled in a series of controversies this week, including their new Sussex."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867173/prince-harry-latest-news-anne-widdecombe",
        "title": "Ann Widdecombe takes aim at <b>Prince Harry</b> after Jeremy Vine viewer defends him",
        "description": "Prince Harry was savaged for &#39;making money out of bashing his own family&#39; by a royal commentator who dismissed his pleas for privacy."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13087273/Harry-Meghan-Markle-Valentines-Day-dinner-Whistle-Invictus-Games.html",
        "title": "<b>Prince Harry</b> and Meghan Markle share romantic Valentine&#39;s Day dinner at upscale Italian restaurant Il Caminetto after a day on the slopes in Whistler, Canada",
        "description": "A beaming Meghan Markle was a lady in red for a romantic Valentine&#39;s Day dinner with Prince Harry as they took a break from Invictus Games duties in Whistler, British Columbia Wednesday night."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/harry-meghan-try-out-new-28640183",
        "title": "<b>Harry</b> and Meghan try out new sport ahead of Invictus Games in Canada next year",
        "description": "The Duke and Duchess of Sussex have been pictured trying out a new sport as they visited Canada to mark a year until the Invictus Games"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/breaking-prince-harry-meghan-markles-32129157.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s intimate Valentine&#39;s Day dinner at Italian restaurant",
        "description": "Prince Harry and Meghan Markle are in Canada for the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations, but they made sure to have a Valentine&#39;s Day dinner"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/meghan-harry-surnames-rebrand-sussex-b2496690.html",
        "title": "Meghan and <b>Harry</b> ‘give children new surnames’ as rebrand continues",
        "description": "The Duke and Duchess of Sussex have given their children new names in the latest instalment of their shock rebrand. Prince Archie Mountbatten-Windsor and Princess Lilibet Mountbatten-Windsor are now known as Archie and Lilibet Sussex, a source told the Times."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/513572/meghan-markle-valentines-day-outfit-prince-harry-dinner-whistler/",
        "title": "Meghan Markle stuns in romantic red outfit for secret Valentine&#39;s Day date with <b>Prince Harry</b>",
        "description": "The Duchess of Sussex wore fashion&#39;s most romantic colour for an intimate dinner date with Prince Harry on Valentine&#39;s Day, stepping out in Whistler in a beautiful berry-hued coat."
    },
    {
        "url": "https://www.thesun.ie/royals/12212684/subtle-signs-meghan-prince-harry-lost-power-couple-status/",
        "title": "Meghan Markle’s secret power play, as body language reveals she is ‘no longer the Invictus plus one’ but a ‘lead’",
        "description": "MEGHAN Markle gave signs to show she is “no longer just an Invictus plus one” next to Prince Harry as they promoted the 2025 games, according to a body language expert. The Duke and"
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46788055/prince-harry-meghan-markle-launch-2025-invictus-games-vancouver/",
        "title": "<b>Prince Harry</b> and Duchess Meghan Touch Down in Vancouver to Launch the 2025 Invictus Games",
        "description": "Prince Harry and Meghan Markle have made it to Canada. The Duke and Duchess of Sussex were in Vancouver on Wednesday to launch the Vancouver Whistler 2025 Invictus Games at the international sporting event’s One Year to Go celebration."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-harry-put-late-queen-32133402.amp",
        "title": "<b>Prince Harry</b> put late Queen in &#39;impossible position&#39; as she &#39;couldn&#39;t condone&#39; his &#39;bitter&#39; behaviour",
        "description": "Prince Harry had enjoyed a once close relationship with his late grandmother but she was forced into an &#39;impossible situation&#39; by his &#39;cruel&#39; act."
    },
    {
        "url": "https://www.instyle.com/meghan-markle-prince-harry-valentines-day-invictus-games-2025-8582123",
        "title": "Meghan Markle Embraced Snow Bunny Style in Winter Whites and Fuzzy Boots",
        "description": "She and Prince Harry spent Valentine&#39;s Day in Vancouver."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-meghan-markle-sussex-surname-2907145?ico=related_stories",
        "title": "<b>Harry</b> and Meghan’s rebrand aims to ‘unify’ family with Sussex surname",
        "description": "The Duke and Duchess of Sussex have rebranded their website in order to “unify” their family, sources have claimed. Earlier this week Harry and Meghan launched their new website Sussex.com. The aim of the rebrand, according to reports in The Times, is to bring the couple’s projects and their family under the same umbrella website and identity."
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-meghan-markle-mistakes-2907121",
        "title": "Meghan and <b>Harry</b> aren’t stupid, so why do they keep making the same mistakes?",
        "description": "The Sussexes are a bright couple. They quit royal life to become financially independent. And yet they don’t seem brave enough to quit the vestiges of that royal life. The coat of arms and the titles are, they have surely come to realise, their unique selling point. Thus they are caught in something of a cleft stick."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/celebs-tv/harry-meghan-changed-childrens-names-9101130",
        "title": "<b>Harry</b> and Meghan have changed their children&#39;s names",
        "description": "Prince Harry and Meghan, the Duke and Duchess of Sussex, have changed the names of their children. Archie and Lillibet have been given the new surname Sussex according to the new sussex.com website recently launched by Harry and Meghan."
    },
    {
        "url": "https://news.sky.com/story/prince-harry-and-meghan-seen-for-first-time-since-divisive-website-rebrand-13072054",
        "title": "<b>Prince Harry</b> and Meghan seen for first time since divisive website rebrand",
        "description": "The Duke and Duchess of Sussex earlier this week rebranded their Archewell Foundation website - which now redirects to Sussex.com."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-reveal-162424628.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Reveal a Historic First During Their Visit to Canada",
        "description": "Meghan Markle and Prince Harry helped unveil a historic first in debuting the Invictus Games Vancouver Whistler 2025 logo — a collaboration between the Squamish, Tsleil-Waututh, Musqueam and Lil’wat Nations that marked the first time all four First Nations have worked together to create a piece of art."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25952336/subtle-signs-meghan-prince-harry-lost-power-couple-status/",
        "title": "Subtle signs that show Meghan Markle and <b>Prince Harry</b> ‘have lost their power couple status’, body language expert claims",
        "description": "MEGHAN Markle and Prince Harry stepped out to promote the Invictus Games but gave signs they have “lost their power couple status”, according to a body language expert. The Duke and Duchess of"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/meghan-markles-cheeky-nod-canada-9100839",
        "title": "Meghan Markle&#39;s cheeky nod to Canada and her &#39;special&#39; web designers in statement",
        "description": "The Duke and Duchess of Sussex have rebranded their website - and it seems Meghan Markle knew who should design it."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-duchess-sussex-150416485.html",
        "title": "<b>Prince Harry</b> and Meghan, Duchess of Sussex adopt Sussex title as children&#39;s surname - report",
        "description": "Prince Harry and Meghan, Duchess of Sussex have reportedly adopted their Sussex title as the last name for their two children. The Duke and Duchess of Sussex, who relaunched their rebranded website, sussex."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/harry-meghan-sussex-archie-lilbet-title-children-b1139285.html",
        "title": "<b>Harry</b> and Meghan adopt Sussex title for their children amid family rebrand",
        "description": "<b>Prince Harry</b> and Meghan have given their children the Sussex surname to “unify” their family, according to a report. <b>Prince</b> Archie, four, and Princess Lilibet, two, have been known as Archie Sussex and Lilibet Sussex, rather than Mountbatten-Windsor ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/prince-harry-meghan-markle-sussex-new-name-website-b2496661.html",
        "title": "Who cares what <b>Harry</b> and Meghan want to call their children?",
        "description": "So the formerly royal couple have given themselves, Archie and Lilibet a new surname. Why are we so outraged, wonders Sean O’Grady"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/showbiz-news/prince-harry-meghan-markle-break-28636291",
        "title": "<b>Prince Harry</b> and Meghan Markle break 64-year royal tradition with children&#39;s new names",
        "description": "Meghan Markle and Prince Harry were all smiles as they held hands while launching the Invictus Games in Vancouver - as it was revealed their children have been given a new surname, ending a 64-year tr"
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24120936.duke-sussex-tries-sit-skiing-joins-invictus-games-competitors-canada/",
        "title": "Duke of Sussex tries sit-skiing as he joins Invictus Games competitors in Canada",
        "description": "Harry and the Duchess of Sussex met athletes at the Whistler Blackcomb ski resort in British Columbia on Wednesday."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-harrys-simple-reason-changing-28636292",
        "title": "Meghan and <b>Harry</b>&#39;s &#39;simple&#39; reason for changing kids&#39; surnames",
        "description": "The Duke and Duchess of Sussex have rebranded their website to &quot;unify&quot; their family. The move coincides with the children starting to use the Sussex title."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/uk/meghan-markle-responds-to-sussex-website-backlash-as-harry-tries-sit-skiing-in-canada/a1595173403.html",
        "title": "Meghan Markle responds to Sussex website backlash as <b>Harry</b> tries sit-skiing in Canada",
        "description": "Meghan Markle praised the “attention to detail” and “creativity and care” of the designers, after critics pointed out the couple were told to drop use of HRH when they quit as working royals. Even their use of the title Sussex was debated at Buckingham Palace."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/world-us-canada-68303597",
        "title": "<b>Prince Harry</b> tries a sit-ski on the slopes in Canada",
        "description": "The Duke and Duchess of Sussex visited the training camp for the 2025 Invictus Games in Whistler, British Columbia on Wednesday. Prince Harry tried his hand at a sit-ski, an event featured in the Paralympics that will be seen in next year&#39;s Invictus Games for the first time."
    },
    {
        "url": "https://metro.co.uk/2024/02/15/harry-meghan-have-changed-childrens-surnames-sussex-rebrand-20284398/?ico=trending-module_category_uk_item-2",
        "title": "<b>Harry</b> and Meghan have changed their children’s surnames in Sussex rebrand",
        "description": "Prince Archie, four, and Princess Lilibet, two, have been known as Archie Sussex and Lilibet Sussex since the King&#39;s coronation."
    },
    {
        "url": "https://www.ok.co.uk/royal/gallery/inside-prince-harry-meghan-markles-32130379",
        "title": "Inside <b>Prince Harry</b> and Meghan Markle&#39;s three-day Canada trip from kids&#39; new names to skiing",
        "description": "The Duke and Duchess of Sussex have jetted off to Canada for a three-day visit linked to the upcoming Invictus Games - it follows the couple&#39;s recent revamp of their website"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-beams-pride-takes-32129371",
        "title": "Meghan Markle beams with pride as she takes snap of <b>Prince Harry</b> on slopes &#39;to show the kids&#39;",
        "description": "Meghan Markle and Prince Harry are getting ready for next year&#39;s Invictus Games with a trip to Vancouver and the Sussexes have been busy spending time on the slopes"
    },
    {
        "url": "https://metro.co.uk/2024/02/15/harry-meghan-have-changed-childrens-surnames-sussex-rebrand-20284398/?ico=mosaic_news",
        "title": "<b>Harry</b> and Meghan have changed their children’s surnames in Sussex rebrand",
        "description": "Prince Archie, four, and Princess Lilibet, two, have been known as Archie Sussex and Lilibet Sussex since the King&#39;s coronation."
    }
]