[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-path-royal-reconciliation-32183115?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b>&#39;s path to royal reconciliation could take years as &#39;trust&#39; must be gained",
        "description": "Prince Harry&#39;s Path to Royal Reconciliation Could Take Years as &#39;trust&#39; must be gained. Newsweek&#39;s royal correspondent Jack Royston, has mapped out Harry&#39;s possible route back."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-hold-32182975",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;hold talks&#39; over what to do if bid to fix royal feud fails",
        "description": "<b>Prince Harry</b> and Meghan Markle are said to have &#39;held talks&#39; over what to do if their efforts to fix their royal feud fails. It comes as <b>Harry</b> has let it be known he is on standby to return to England should his family need him amid their health woes."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869361/prince-harry-meghan-skipped-a-step",
        "title": "<b>Prince Harry</b> and Meghan missed the first step in making amends, says royal expert",
        "description": "<b>Prince Harry</b> recently appeared on American TV, saying, “I love my family,” which is all well and good, but he’s getting ahead of himself, said one royal expert. Since the interview with Good Morning America’s Will Reeve, there have been reports of ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/21/prince-william-royal-gaza-war-palestine-antisemitism/",
        "title": "<b>Prince</b> William knows the risks of getting political – and he’s not the first royal to do so",
        "description": "Less controversially perhaps, he and Kate spearheaded the Heads Together mental health campaign in 2016, along with <b>Prince Harry</b>. While none of these issues are directly party political, they are not entirely devoid of political context. The <b>Prince</b> of ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-just-debuted-subtle-192424262.html",
        "title": "Meghan Markle Just Debuted a Subtle Twist to Her Signature Eyebrow Style",
        "description": "Like most people, Meghan has switched up her eyebrow style through the years. She had slimmer brows while starring on Suits, which originally aired on USA Network from 2011 to 2019, and didn’t deviate much during her royal wedding to Prince Harry in May 2018."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513945/queen-elizabeth-children-king-charles-princess-anne-prince-andrew-prince-edward/",
        "title": "Who are Queen Elizabeth&#39;s children? All about King Charles, Princess Anne, <b>Prince</b> Andrew &amp; <b>Prince</b> Edward",
        "description": "Although the late Queen was a woman of duty, she was still a mum at heart, and the late monarch welcomed four children with her late husband, Prince Philip. Together, the pair had King Charles, Princess Anne, Prince Andrew and Prince Edward."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-strays-royal-protocol-183300139.html",
        "title": "King Charles strays from royal protocol and says he&#39;s been &quot;reduced to tears&quot; by kindness",
        "description": "King Charles has been seen back at work for the first time since his cancer diagnosis whilst meeting Rishi Sunak, the royal said the messages of kindness that"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/21/king-charles-cancer-return-to-duties-rishi-sunak-meeting/?n=@",
        "title": "King ‘reduced to tears’ by public support as he returns to work",
        "description": "Two weeks ago, he is known to have met with his son <b>Prince Harry</b> for around 30 minutes in the capital, before departing for Sandringham. The King’s last ordinary public engagement was on Dec 14, when he attended the Royal Courts of Justice to thank those ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/michael-jacksons-son-prince-jackson-232000980.html",
        "title": "Michael Jackson&#39;s Son <b>Prince</b> Jackson Wishes Brother Bigi a Happy Birthday: &#39;Bro Is Killing It&#39;",
        "description": "The late music legend&#39;s youngest son Bigi Jackson celebrated his 22nd birthday on Wednesday Getty (2) Bigi Jackson; <b>Prince</b> Jackson <b>Prince</b> Jackson is wishing his younger brother Bigi a happy birthday. As Michael Jackson’s youngest son Bigi (formerly ..."
    },
    {
        "url": "https://www.racingpost.com/news/reports/harry-cobden-goes-four-clear-in-jockeys-championship-after-victory-on-terresita-aJBoC3v4IkBr/",
        "title": "<b>Harry</b> Cobden goes four clear in jockeys&#39; championship after victory on Terresita",
        "description": "Harry Cobden pulled four clear of his title rival Sean Bowen in the jockeys&#39; championship, when digging deep on Terresita to land the 2m4f mares&#39; novice handicap chase. Cobden was having a second spin on the 3-1 chance, who shared most of the 2m4f trip with favourite Malaita before going clear from the second-last to score by 12 lengths."
    },
    {
        "url": "https://www.thesun.co.uk/topic/live-blog/page/160/",
        "title": "Live Blogs",
        "description": "The Sun’s blog team brings you live coverage on a range of trending topics. Get the latest updates on a variety of subjects from <b>Prince Harry</b>, King Charles and Vladimir Putin to Britain’s Got Talent, I’m A Celebrity and MasterChef. Sport live blogs ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13109091/King-Charles-meeting-Prime-Minister-Rishi-Sunak-Buckingham-Palace-cancer.html",
        "title": "Smiling Charles holds first face-to-face meeting with Prime Minister Rishi Sunak at Buckingham Palace since cancer diagnosis",
        "description": "The King met face-to-face with Prime Minister Rishi Sunak today, having previously spoken to him remotely from his Norfolk retreat at Sandringham, after his latest cancer treatment."
    },
    {
        "url": "https://inews.co.uk/news/world/prince-william-gaza-ceasefire-israel-response-2918336?ico=most_popular",
        "title": "‘Make peace with your brother’: Israelis shrug off <b>Prince</b> William ceasefire plea",
        "description": "One Israeli political aide compared the intervention to the Pope&#39;s calls for a ceasefire, saying the royals have little power"
    },
    {
        "url": "https://uk.style.yahoo.com/see-prince-edward-sophies-joint-162340198.html",
        "title": "See <b>Prince</b> Edward and Sophie&#39;s Joint Coat of Arms After Meghan Markle and <b>Prince Harry</b>&#39;s Crest Caused a Stir",
        "description": "The Duke and Duchess of Edinburgh&#39;s impaled design was spotted online one week after the launch of Sussex.com made waves for its royal branding"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869280/prince-harry-meghan-markle-new-photo-signals",
        "title": "<b>Prince Harry</b> and Meghan Markle issue three clear signals about their future with new photo",
        "description": "A never-before-seen photo from an event in Canada reveals a lot about Prince Harry and Meghan Markle, claims a body language expert."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-royal-titles-become-153711987.html",
        "title": "Would <b>Prince Harry</b> Have to Give Up His Royal Titles to Become a U.S. Citizen? (Yes, But It&#39;s Complicated)",
        "description": "The Duke of Sussex, who resides in California, said he has &quot;considered&quot; becoming a U.S. citizen in a recent interview with &#39;Good Morning America&#39;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13109393/King-Charles-seen-leaving-Clarence-House-amid-cancer-battle-Palace-aides-said-theres-zero-chance-Prince-Harry-return-working-royal-despite-olive-branch.html",
        "title": "King Charles is seen leaving Clarence House amid cancer battle - after Palace aides said there&#39;s &#39;zero chance&#39; <b>Prince Harry</b> can return as a working royal despite olive branch",
        "description": "King Charles has been pictured leaving Clarence House as he continues his treatment for cancer - after Palace aides said there was &#39;zero chance&#39; <b>Prince Harry</b> can return as a working royal. The 75-year-old monarch has been staying at his Sandringham Estate ..."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46882987/meghan-markle-hair-transformation-invictus-games-training-camp/",
        "title": "Duchess Meghan’s Hair Colorist Reveals How She Transformed the Royal’s Hair",
        "description": "The Duchess of Sussex wanted something rich and warm for her recent trip to Canada with husband <b>Prince Harry</b>. So she went for a chocolate chestnut brunette color, courtesy of Highbrow Hippie in California (run by Lee and Myka Harris). Previously ..."
    },
    {
        "url": "https://uk.style.yahoo.com/king-charles-reduced-tears-over-183435898.html",
        "title": "King Charles &#39;Reduced to Tears&#39; Over Response to His Cancer News as He Holds First Meeting with Prime Minister",
        "description": "The fact that I was able to get on a plane and go and see him and spend any time with him, I’m grateful for that,&quot; <b>Prince Harry</b> added. When asked about his outlook on the state of his father&#39;s health, he said, &quot;That stays between me and him.&quot;"
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-tells-british-pm-195301340.html",
        "title": "King Charles Tells British PM He Has Been ‘in Tears’",
        "description": "<b>Prince Harry</b> made a whirlwind trip back to the U.K. to see his father after discovering he had cancer. The younger royal told Good Morning America that he was hopeful his father’s health battle could have a “reunifying” effect on the family."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/royal-expert-claims-prince-harrys-28679884",
        "title": "Royal expert claims <b>Prince Harry</b>&#39;s offer to help King Charles was &#39;not serious&#39; for this reason",
        "description": "<b>Prince Harry</b> was &#39;visibly shocked and upset&#39; when he found out his father had cancer and immediately offered to help, but he knew his offer would be turned down, a Royal expert claims A Royal expert has claimed that <b>Prince Harry</b>&#39;s offer to temporarily step ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/prince-harry-realises-no-choice-28673683",
        "title": "<b>Prince Harry</b> &#39;realises he has no choice&#39; in relationship with Royal Family",
        "description": "<b>Prince Harry</b> has reportedly realised that his father&#39;s illness could be an important moment for him. The <b>Prince</b> hurried back to the UK to see his father, King Charles III, after he was told about his cancer diagnosis. Before making the journey from ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/royal-outrage-would-worse-harry-32182092",
        "title": "Royal outrage &#39;would be worse&#39; if <b>Harry</b> and Meghan&#39;s titles were revoked",
        "description": "<b>Prince Harry</b> and Meghan Markle faced calls to be stripped of their royal titles following the launch of their new website, Sussex.com. However, one royal expert believes if their titles were revoked it would be &#39;counterproductive.&#39; The Duke and Duchess of ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-makes-final-decision-32179154",
        "title": "King Charles makes &#39;final decision&#39; on <b>Prince Harry</b>&#39;s return to Royal Family",
        "description": "King Charles has a big choice to make about his son <b>Prince Harry</b> after they saw each other for a short time following the monarch&#39;s cancer diagnosis. The King and <b>Prince Harry</b> met up quickly when the Duke of Sussex rushed from LA to be with his dad. Now, with <b>Prince Harry</b> looking like he wants to come back to the Royal Family, it&#39;s up to the King whether or not he can."
    },
    {
        "url": "https://www.hellomagazine.com/brides/513932/princess-kate-surprising-influence-bridal-trends/",
        "title": "Princess Kate&#39;s everlasting influence on bridal trends",
        "description": "Alison Hargreaves, founder of Guides For Brides adds Meghan Markle into the mix. The Duchess of Sussex, 42, married <b>Prince Harry</b> in the same year as Princess Eugenie said &#39;I do&#39; in a majestic ceremony at St George&#39;s Chapel at Windsor Castle. Meghan and ..."
    },
    {
        "url": "https://www.tag24.com/entertainment/royals/meghan-markle/is-meghan-markle-trying-to-befriend-taylor-swift-3105517",
        "title": "Is Meghan Markle trying to befriend Taylor Swift?",
        "description": "Meghan Markle has reportedly set her sights on a friendship with Taylor Swift, whose mega influence just might help rehab the former actor&#39;s image. | TAG24"
    },
    {
        "url": "https://en.as.com/soccer/inter-miami-real-salt-lake-live-online-score-stats-and-updates-mls-n/",
        "title": "Inter Miami - Real Salt Lake live online: score, stats and updates | MLS",
        "description": "The Argentine marvel had fired the team to a Leagues Cup triumph and everyone from <b>Prince Harry</b> to Selena Gomez was packing into stadiums to see him play. Things may be a little different this year, but the price of Inter Miami tickets remains pretty ..."
    },
    {
        "url": "https://www.foxnews.com/entertainment/king-charles-reduced-tears-cancer-support-messages",
        "title": "King Charles reduced &#39;to tears&#39; by cancer support messages",
        "description": "It&#39;s unclear what cancer diagnosis Charles received. In addition to <b>Prince Harry</b> and <b>Prince</b> William, the king reportedly advised his siblings — <b>Prince</b> Andrew, Princess Anne and <b>Prince</b> Edward — about his diagnosis prior to the public revelation ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/michael-jacksons-son-prince-jackson-232000980.html",
        "title": "Michael Jackson&#39;s Son <b>Prince</b> Jackson Wishes Brother Bigi a Happy Birthday: &#39;Bro Is Killing It&#39;",
        "description": "Prince Jackson is wishing his younger brother Bigi a happy birthday. As Michael Jackson ’s youngest son Bigi (formerly Blanket) turned 22 on Wednesday, his older bro, 27, took a moment to give him a b-day shout-out and pay tribute to him. Prince celebrated the occasion with a thoughtful post on his Instagram Story."
    },
    {
        "url": "https://www.yahoo.com/entertainment/experts-claim-prince-william-hesitancy-212200775.html",
        "title": "Experts Claim <b>Prince</b> William’s Hesitancy About <b>Prince Harry</b>’s Return Has Everything to Do With Kate Middleton",
        "description": "Amid Kate and King Charles III’s Health issues, there have been musings that <b>Prince Harry</b> could return to help out with some Royal duties, but one Royal expert claims that William will bar <b>Harry</b> from doing so, all because of Kate. While speaking with Fox ..."
    },
    {
        "url": "https://www.eonline.com/news/1395615/king-charles-iii-shares-tearful-reaction-to-supporters-amid-cancer-battle",
        "title": "King Charles III Shares Tearful Reaction to Supporters Amid Cancer Battle",
        "description": "While meeting with U.K. Prime Minister Rishi Sunak, King Charles III expressed how the messages and cards he&#39;s received has &quot;reduced me to tears most of the time.&quot;"
    },
    {
        "url": "https://pagesix.com/2024/02/21/royal-family/king-charles-iii-resumes-conducting-in-person-royal-duties-after-cancer-diagnosis/",
        "title": "King Charles III resumes in-person royal duties after cancer diagnosis",
        "description": "His estranged son, <b>Prince Harry</b>, hopped on a jet from California and flew to Clarence House to visit his dad for just an hour after learning of the diagnosis straight from the monarch. The Duke of Sussex, 39, said earlier this week that he believes his ..."
    },
    {
        "url": "https://nypost.com/2024/02/21/entertainment/prince-harry-may-have-to-renounce-royal-titles-to-be-u-s-citizen/",
        "title": "Would <b>Prince Harry</b> have to give up his royal titles to become a US citizen?",
        "description": "<b>Prince Harry</b> might have to learn the “Star-Spangled Banner” real quick if he wants to become an American citizen. According to the U.S. Citizen and Immigration Services policy, the <b>prince</b> would not be able to keep his status as a royal. “Any ..."
    },
    {
        "url": "https://news.yahoo.com/british-line-succession-192900741.html",
        "title": "Who’s Who in the British Line of Succession",
        "description": "Earlier this month, Buckingham Palace shared that King Charles III has been diagnosed with cancer, news that placed the royal line of succession in the spotlight once more. Less than a year and a half earlier, Charles succeeded his mother, Queen Elizabeth ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/king-charles-had-rare-vulnerable-212446703.html",
        "title": "King Charles Had a Rare Vulnerable Moment When Speaking About the Response to His Cancer Diagnosis",
        "description": "During an appearance on BBC Radio Five Live on Feb. 6, Sunak revealed that Charles&#39;s cancer had been &quot;caught early.&quot; Charles&#39;s son, <b>Prince</b> William, and sister, Princess Anne, stepped in for Charles during investiture ceremonies earlier this month."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-just-debuted-subtle-192424262.html",
        "title": "Meghan Markle Just Debuted a Subtle Twist to Her Signature Eyebrow Style",
        "description": "Like most people, Meghan has switched up her eyebrow style through the years. She had slimmer brows while starring on Suits, which originally aired on USA Network from 2011 to 2019, and didn’t deviate much during her royal wedding to Prince Harry in May 2018."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/meghan-markle-prince-harry-share-32178620",
        "title": "Meghan Markle and <b>Prince Harry</b> share defiant new photo as expert says &#39;message is clear&#39;",
        "description": "Meghan Markle and <b>Prince Harry</b> have shared a new photo from their Canada trip, which an expert believes squashes any split rumours. The Duke and Duchess of Sussex were seen beaming at the Invictus Vancouver Whistler 2025 One Year To Go gala.Meghan looked stunning in an off-the-shoulder olive dress, while <b>Harry</b> was dapper in a suit and tie."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/513914/meghan-markle-identical-son-prince-archie-baby-photo/",
        "title": "Meghan Markle is identical to son <b>Prince</b> Archie as a baby in unseen photo",
        "description": "Embroiderer and graphic designer Shawn lives in California, just as his cousin Meghan does, but he told the paper that he has not seen her in almost two decades. Shawn is the son of Meghan&#39;s uncle on her mother&#39;s side, Joseph Johnson."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-william-source-says-theres-130200843.html",
        "title": "A <b>Prince</b> William Source Says There&#39;s &quot;No Chance&quot; He&#39;ll Let <b>Prince Harry</b> to Return to Royal Duties",
        "description": "Sources weigh in on whether or not Prince Harry will return to royal duties to help King Charles, and how Prince William feels about the idea."
    },
    {
        "url": "https://www.thesun.ie/royals/12254880/waleses-considering-teddies-school-george-kate-middleton/",
        "title": "Why the Waleses are considering £47k-a-year ‘down-to-earth’ school ‘Teddies’ for George – as Kate shuns ‘flashy’ option",
        "description": "Both <b>Prince</b> William and his brother <b>Prince Harry</b> attended Eton College, which costs £15,432 a term, breaking royal tradition because senior royals had previously attended Gordonstoun in north-east Scotland. Teddies is said to channel values that are at th ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26079949/meghan-markle-prince-harry-secret-work-divorce-royal/",
        "title": "Meghan Markle &amp; <b>Prince Harry</b>’s secret ‘work divorce’ &amp; 5 signs that show they’re on ‘different paths’, says royal pro",
        "description": "WHILE the Duke and Duchess of Sussex have done numerous joint work ventures since stepping back as senior royals, is a “secret work divorce” currently taking place? According to a royal"
    },
    {
        "url": "https://www.theargus.co.uk/news/24131074.prince-harry-speaks-family-life-meghan-markle/",
        "title": "<b>Prince Harry</b> speaks about family life with Meghan Markle",
        "description": "Prince Harry has spoken about his life with Meghan Markle in America. The Duke of Sussex spoke to Will Reeve, host of Good Morning America, and gave an insight into his life in Montecito, California."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/21/",
        "title": "<b>Prince Harry</b> updates — Duke &amp; Meghan reflect on Canada trip after bombshell interview as William speaks on Gaza conflict",
        "description": "PRINCE Harry is not planning to return to his royal duties, a source has insisted. The speculation came as the Times reported the Duke had said he was ready to help the royals as the King"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markles-cousin-shares-new-pictures-of-the-duchess-in-an-exclusive-interview_art21222.html",
        "title": "Meghan Markle’s cousin shares new pictures of the Duchess in an exclusive interview",
        "description": "Meghan Markle’s cousin Shawn Johnson has given an exclusive interview to the Daily Mail. He has also shared some unseen childhood pictures of the"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-speaks-family-life-110000890.html",
        "title": "<b>Prince Harry</b> speaks about family life with Meghan Markle in America",
        "description": "Prince Harry has spoken about his life with Meghan Markle in America. The Duke of Sussex spoke to Will Reeve, host of Good Morning America, and gave an insight into his life in Montecito, California. The interview came about when Harry was in Canada for the 2025 Invictus Games Vancouver Whistler One Year to Go celebrations earlier this month."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-william-harry-king-charles-cancer-news-b2499639.html",
        "title": "Royal news - live: <b>Prince</b> William makes emotional plea about Gaza as Sarah Ferguson gives health update",
        "description": "The Duchess of York was diagnosed with an agressive form of skin cancer less than a year after battling breast cancer"
    },
    {
        "url": "https://www.btimesonline.com/articles/164202/20240222/prince-harry-and-meghan-markle-quash-split-rumors-with-glamorous-gala-snapshot.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle Quash Split Rumors with Glamorous Gala Snapshot",
        "description": "<b>Prince Harry</b> and Meghan Markle recently shared a glamorous photo from their visit to Canada, effectively quelling the swirling rumors of a potential split. The image, capturing the couple at the Invictus Vancouver Whistler 2025 One Year To Go gala ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-harry-realises-no-choice-32175806",
        "title": "<b>Prince Harry</b> &#39;realises he has no choice but to repair damage to Royal Family&#39;",
        "description": "It&#39;s been reported that <b>Prince Harry</b> has come to realise he must make amends with the Royal Family after his father, King Charles III, was diagnosed with cancer. The Duke of Sussex hurried back to the UK from California after news of the monarch&#39;s health battle was made public, but before he flew over, <b>Harry</b> and Charles had some conversations over the phone."
    },
    {
        "url": "https://www.btimesonline.com/articles/164201/20240222/prince-williams-simmering-rage-clouds-prince-harrys-return-to-royal-duties.htm",
        "title": "<b>Prince</b> William&#39;s &#39;Simmering Rage&#39; Clouds <b>Prince Harry</b>&#39;s Return to Royal Duties",
        "description": "<b>Prince Harry</b>&#39;s aspirations for a familial reunion and potential return to royal duties amid King Charles III&#39;s cancer diagnosis are facing significant resistance from his brother, <b>Prince</b> William. Despite <b>Harry</b>&#39;s willingness to step back into the royal fold ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-acting-career-every-role-where-watch.html/",
        "title": "Meghan Markle’s Acting Career: Every Role (and Where to Watch)",
        "description": "Meghan Markle’s acting career didn’t make her a household name. But Meghan’s movies and TV shows did raise her profile enough to where she met <b>Prince Harry</b> and became one of the most famous people in the world. Meghan hasn’t acted since marrying ..."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/prince-philip-would-sad-see-32172512.amp",
        "title": "<b>Prince</b> Philip &#39;would be sad&#39; to see <b>Prince Harry</b> abandon 64-year-old royal tradition",
        "description": "<b>Prince Harry</b> and Meghan Markle shocked Royal fans last week when they moved on from a 64 year old Royal tradition and gave their children, Archie and Lilibet, a brand new surname This surname was given to male-line descendants of Queen Elizabeth II and ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/prince-william-stuns-fans-by-admitting-he-hasnt-seen-this-1-movie_uk_65d4c92ce4b0f7fbe7b4233d?d_id=7324123&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Prince</b> William Stuns Fans By Admitting He Hasn&#39;t Seen This 1 Movie",
        "description": "“He’s going to name this ‘<b>Harry</b>,’” Robbie said, holding the BAFTA in the air. “He is really excited about bringing it back to the States with him,” she continued ― a reference to <b>Prince Harry</b> and Meghan Markle, who’d announced their move ..."
    },
    {
        "url": "https://uk.style.yahoo.com/32-times-royals-showed-off-203025205.html",
        "title": "32 times the royals showed off their sporting prowess",
        "description": "The Duchess of Sussex joined <b>Prince Harry</b> for the Coach Core Awards where they took part in a netball shootout, and Meghan took to it with ease. Even more props for the fact she showed off some quality hand-eye coordination while wearing a pair of heels ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-meghan-markle-pay-32156789?int_source=nba",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;pay the price&#39; for new website in bid for brand overhaul",
        "description": "<b>Prince Harry</b> and Meghan Markle are said to have forked out a sum of money to a British businessman in order to get the Sussex domain for their new brand overhaul Want all the latest Showbiz news direct to your inbox? Share your email for news, gossip and ..."
    },
    {
        "url": "https://www.ilmessaggero.it/en/no_return_for_prince_harry_to_royal_duties_buckingham_palace_sources_say-7949690.html",
        "title": "No Return for <b>Prince Harry</b> to Royal Duties, Buckingham Palace Sources Say",
        "description": "&quot;Zero possibility&quot;. This is how sources from Buckingham Palace dismissed the possibility that <b>Prince Harry</b> could reclaim his role and royal duties in the Royal Family. According to the Times, the Duke of Sussex had offered to support his father King ..."
    }
]