[
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-us-visa-application-court-hearing-royal-news-fz9zzdd3p",
        "title": "<b>Prince Harry</b>’s drug admission isn’t proof, US visa case told",
        "description": "The Duke of Sussex’s admission in his memoir that he took drugs is not “proof” and could have been embellished to “sell books”, a lawyer for the US government has argued in court. The Biden administration is resisting demands for Prince Harry’s US visa application to be made public to see if he lied about his drug use when he moved to America in 2020."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119383/princy-harry-lied-cocaine-use-books-government-claims.html",
        "title": "<b>Prince Harry</b> could have exaggerated stories about his cocaine use to &#39;sell books&#39;, U.S. government lawyers claim in court as they argue his immigration records should be kept ...",
        "description": "The claim by the Biden administration came as a think tank in Washington DC sought access to Harry&#39;s visa application to see if he lied about drug taking."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1870282/prince-harry-memoir-court-case",
        "title": "<b>Prince Harry</b> memoir &#39;is not proof he took drugs&#39;, court told",
        "description": "Harry included personal anecdotes in his memoir, which may -- or may not -- play a role in a federal court case, revolving around his US visa application."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-drug-confession-been-32200117",
        "title": "<b>Prince Harry</b>&#39;s drug confession may have been exaggerated to sell books, lawyer says",
        "description": "Prince Harry revealed in his memoir that he had previously taken drugs such as cocaine and psychedelic mushrooms, but a lawyer has reportedly said he may have embellished in order to sell more books"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/celebs-tv/kate-middleton-beaten-rarely-mentioned-9121993",
        "title": "Kate Middleton beaten by rarely-mentioned duke who does more royal visits",
        "description": "Prince William and Princess Kate are often praised for their work ethic, but according to the Court Circular, they are not the hardest-working members of the Royal Family."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/king-charles-cancer-treatment-cards-b2501407.html",
        "title": "King Charles overwhelmed by public support as 7,000 messages sent after cancer diagnosis",
        "description": "The King has been overwhelmed by messages of support from around 7,000 well-wishers worldwide since his cancer diagnosis, Buckingham Palace says."
    },
    {
        "url": "https://www.thesun.ie/royals/12273590/prince-harry-drugs-court-case-spare/",
        "title": "<b>Prince Harry</b> faces battle over US visa after admitting taking cocaine, marijuana &amp; psychedelic mushrooms in memoir Spare",
        "description": "PRINCE Harry will fight for his visa application tonight after admitting he took coke, weed and magic mushrooms. Lawyers from conservative think tank the Heritage Foundation are suing the"
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-royal-pack-family-uk-camilla-long-698fkdzbs?ilc=timesradio:morefromthetimes&region=global",
        "title": "There’s a gap in the royal pack and, oh look, here’s <b>Prince Harry</b>",
        "description": "Oh, it’s <b>Prince Harry</b> again, hanging on to our legs, begging to get our attention. Just look what he did last week: flew to Whistler and flung himself down a bobsleigh ride at 99mph. He also tirelessly tried “wheelchair curling”, while Meghan looked ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1870244/prince-harry-court-case-live-spare-bombshells",
        "title": "<b>Prince Harry</b> US visa court case live: Hearing set to hear evidence on Spare bombshells",
        "description": "The Department of Homeland Security is being asked by The Heritage Foundation to reveal Harry’s immigration records and what his answers were to the drug use questions listed in the application form. Harry himself is not on trial, but his words are."
    },
    {
        "url": "https://www.tatler.com/article/who-are-the-gallery-girls-from-mayfair-to-bethnal-green-nepo-babies-to-new-kids-on-the-block",
        "title": "The Gallery Girls: from Mayfair to Bethnal Green, nepo-babies to new kids on the block. Who are the ‘gallerinas’ of today?",
        "description": "Gallery Girls have come a long way since the Sloane Rangers of Sotheby&#39;s in the ‘80s. Tatler catches up with Tamsin Golding Yee, Sarah Green, Ell Pennick, India Bhattacharjee and Lovisa Berntson on th"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-beams-leaves-dinner-32198426",
        "title": "Meghan Markle beams as she leaves dinner with Oprah exec as she &#39;sets sights on Hollywood&#39;",
        "description": "Meghan Markle was pictured without her husband, Prince Harry, as she dined out at a swanky sushi restaurant in Los Angeles on Thursday night with a TV exec friend"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-losing-32195164.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;losing sleep&#39; over complicated US visa court case",
        "description": "Prince Harry and Meghan Markle relocated to the US in January 2020, after stepping down as senior working members of the Royal Family, but their future in America could be at risk"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/23/prince-harry-us-visa-application-public-hearing-latest/?utmsource=email",
        "title": "<b>Prince Harry</b>’s US visa at centre of court case after Spare drug revelations",
        "description": "The DHS argued in a court filing that it “cannot confirm or deny whether any other records that [Heritage] are seeking exist because the mere acknowledgement of these records would constitute an unwarranted invasion of Prince Harry’s privacy”, according to Newsweek."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/expert-warns-prince-harry-role-32198235",
        "title": "Expert warns <b>Prince Harry</b> his role of family peacemaker &#39;won&#39;t wash&#39; with William",
        "description": "Prince Harry is said to be hopeful about making a temporary return to the Royal Family, with one expert suggesting the Duke is keen to be seen as &#39;good in a crisis&#39;"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/king-charles-succession-plan-motion-32196810.amp",
        "title": "King Charles&#39; succession plan in motion but &#39;kept secret&#39; from <b>Prince Harry</b> due to &#39;lack of trust&#39;",
        "description": "King Charles is believed to be working on his succession planning, but it&#39;s being kept &quot;highly secret&quot; from his son <b>Prince Harry</b>, according to an expert. Quinn suggests that <b>Prince</b> William is central to these plans as he&#39;s &quot;at the heart&quot; of them due to his ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26137842/internet-wild-kate-middleton-roger-federer-lookalike-private-secretary/",
        "title": "Internet goes wild for Kate Middleton’s new ‘Roger Federer lookalike’ private secretary as she rests after surgery",
        "description": "KATE Middleton’s inner circle is set to gain a new member as the royal has hired a new private secretary. The Princess of Wales has appointed Lieutenant Colonel Tom White to the role, as she"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/514066/meghan-markle-rare-photo-baby-with-grandmother/",
        "title": "Baby Meghan Markle pictured with maternal grandmother Jeanette in ultra-rare photo",
        "description": "<b>Prince Harry</b> and Meghan announcing their engagement Meghan and Jeanette reportedly had a close bond until she passed away in 2000 at the age of 71, and, writes the paper, <b>Prince Harry</b>&#39;s wife would sit by her grandmother&#39;s bedside at the end of her life as ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13117013/meghans-personal-girlfriend-relationship-clare-waight-Keller-Meghans-lunch-pal-designed-Givenchy-wedding-gown-appeared-sussexes-netflix-series-accepted-fashion-award-royal.html",
        "title": "Inside Meghan Markle&#39;s &#39;personal relationship&#39; with the woman who made her wedding dress: Clare Waight Keller bonded with the Duchess during the design process and appeared in ...",
        "description": "Meghan, 42, and Clare, 53, developed an unbreakable bond during the extensive 3,900 hours spent perfecting the Duchess&#39;s wedding dress for her Windsor wedding in 2018."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26129281/prince-archie-princess-lilibet-fairytale-cottage-harry-meghan-mansion/",
        "title": "Inside <b>Prince</b> Archie and Princess Lilibet’s fairy tale cottage at <b>Harry</b> and Meghan’s £11m mansion",
        "description": "MEGHAN Markle and Prince Harry now live in a £11million mansion in Montecito, California, and have given fans a sneak peek inside during their Netflix documentary. While the nine-bedroom pad has"
    },
    {
        "url": "https://www.tatler.com/article/emperor-naruhito-birthday",
        "title": "Emperor Naruhito turns 64! Scholar, mountain climber, viola-player…Tatler looks back on the life of a true Renaissance man",
        "description": "Emperor Naruhito succeeded his father in 2019 but immediately had to face the Covid pandemic as Emperor. His first trip abroad as monarch was Queen Elizabeth II&#39;s funeral – now he is settling into lif"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/king-charles-succession-plans-motion-32195277",
        "title": "King Charles&#39; succession plans in motion and <b>Prince Harry</b> won&#39;t be trusted, says expert",
        "description": "Prince William is said to be &#39;at the heart&#39; of King Charles&#39; succession planning, but Prince Harry is &#39;not trusted&#39; after issuing several attacks against the Royal Family"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-spare-royal-family-32192699",
        "title": "<b>Prince Harry</b>&#39;s US visa in jeopardy after bombshell drug-taking revelations",
        "description": "Prince Harry is facing a court showdown as his name is at the centre of a battle over &#39;attempts to keep his immigration records secret&#39;, after revelations about his drug use"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-kind-smiling-during-164118277.html",
        "title": "Meghan Markle Was &#39;Kind&#39; and Smiling During Dinner in L.A. with Friend (Source)",
        "description": "She and husband <b>Prince Harry</b> parted ways with Spotify last year. Andrew Chin/Getty Meghan Markle attends Invictus Games Vancouver Whistlers 2025&#39;s One Year To Go Winter Training Camp Related: Meghan Markle and <b>Prince Harry</b> Share Unseen Photo from Canada ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-william-appalled-prince-harrys-32195881",
        "title": "<b>Prince</b> William &#39;appalled&#39; by <b>Prince Harry</b>&#39;s offer to return to Royal Family",
        "description": "<b>Prince</b> William is reportedly &#39;appalled&#39; at the idea of <b>Prince Harry</b> returning to royal duties, as tensions between the brothers remain high. It&#39;s been reported that <b>Harry</b> is open to a temporary return to the Royal Family while his father, King Charles, undergoes cancer treatment."
    },
    {
        "url": "https://www.thesun.ie/royals/12272321/meghan-markle-tv-meeting-oprah-executive/",
        "title": "Meghan Markle beams as she has TV meeting with Oprah executive as she fuels rumours of major role",
        "description": "The 42-year-old was all smiles as she stepped out without her husband <b>Prince Harry</b>. Meghan dined with Terry Woods, the executive producer of Oprah&#39;s Harpo Productions company, according to The Express. The executive producer is reportedly working with ..."
    },
    {
        "url": "https://www.allvipp.com/royals/for-princess-estelle-s-birthday-swedish-palace-unveils-rare-photos",
        "title": "For Princess Estelle&#39;s Birthday: Swedish Palace Unveils Rare Photos",
        "description": "They capture her and the royal family on a skiing trip, featuring various pictures and clips of Princess Estelle and her brother, <b>Prince</b> Oscar (7), enjoying the snow. This breaks tradition for the Swedish royals, who typically share portrait photos for ..."
    },
    {
        "url": "https://startsat60.com/media/news/princess-anne-the-royal-familys-secret-weapon-in-resolving-issues-with-harry-and-meghan",
        "title": "Princess Anne: The Royal Family’s secret weapon in resolving issues with <b>Harry</b> and Meghan",
        "description": "In the midst of ongoing tensions within the Royal Family, a surprising solution has emerged from an unexpected source."
    },
    {
        "url": "https://www.firstpost.com/tag/prince-harry-to-attend-coronation-prince-harry-news/",
        "title": "<b>Prince Harry</b> To Attend Coronation <b>Prince Harry</b> News",
        "description": "Many believed <b>Prince Harry</b>’s presence at King Charles’ coronation would be a reconciliation. But it was not meant to be. After being seated in the thi..."
    },
    {
        "url": "https://www.firstpost.com/tag/prince-william-prince-harry-coronation/",
        "title": "<b>Prince</b> William <b>Prince Harry</b> Coronation",
        "description": "Many believed <b>Prince Harry</b>’s presence at King Charles’ coronation would be a reconciliation. But it was not meant to be. After being seated in the thi..."
    },
    {
        "url": "https://popculture.com/lifestyle/news/prince-harry-king-charles-reported-truce-suddenly-ends/",
        "title": "<b>Prince Harry</b>&#39;s Reported &#39;Truce&#39; With King Charles Suddenly Ends",
        "description": "Prince Harry and King Charles III reportedly had a &quot;truce&quot; in the wake of Harry&#39;s Royal exit and Charles&#39; cancer diagnosis, but that has suddenly ended. According to In Touch, a source with knowledge of the situation states that Harry&#39;s visit seemed like &quot;a PR stunt,&quot; which soured his father on their reconciliation."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/heres-why-meghan-markle-toned-down-her-normal-glam-for-this-work-dinner/",
        "title": "Here’s why Meghan Markle toned down her normal glam for this work dinner",
        "description": "Meghan and her husband, <b>Prince Harry</b>, just finished a trip to Canada for their Invictus Games Foundation, which included plenty of trendy fashions, many of which were seen on television in interviews. Now that she is back in California, Meghan was spotted ..."
    },
    {
        "url": "https://www.allvipp.com/royals/prince-harry-s-royal-blues-is-the-duke-of-sussex-pining-for-the-uk",
        "title": "<b>Prince Harry</b>&#39;s Royal Blues: Is the Duke of Sussex Pining For The UK?",
        "description": "Amidst the palm trees and star-studded streets of Montecito, in sunny California, whispers of <b>Prince Harry</b>&#39;s restlessness echo through the corridors of celebrity gossip. <b>Prince Harry</b> is thinking of family more these days King Charles&#39; cancer saw him make ..."
    },
    {
        "url": "https://www.ign.com/videos/everything-you-need-to-know-about-the-new-harry-potter-max-series-ign-the-fix-entertainment",
        "title": "Everything You Need To Know About The New <b>Harry</b> Potter Max Series - IGN The Fix: Entertainment",
        "description": "We’ve got so many updates on the upcoming Harry Potter series, coming to Max in 2026. WB Discovery CEO David Zaslav promises the new series will dive deep into the series of books, meaning we’ll see the iconic stories retold for the small screen."
    },
    {
        "url": "https://www.btimesonline.com/articles/164273/20240224/meghan-markle-explores-creative-ventures-with-oprahs-production-chief-and-esteemed-fashion-designer.htm",
        "title": "Meghan Markle Explores Creative Ventures with Oprah&#39;s Production Chief and Esteemed Fashion Designer",
        "description": "Meghan Markle, the Duchess of Sussex, is making strategic moves in the media and fashion worlds, signaling a robust expansion of her creative portfolio. The Duchess was recently spotted dining with Terry Wood,"
    },
    {
        "url": "https://www.btimesonline.com/articles/164272/20240224/prince-harry-faces-intense-scrutiny-over-us-visa-application-amid-allegations-of-special-treatment.htm",
        "title": "<b>Prince Harry</b> Faces Intense Scrutiny Over US Visa Application Amid Allegations of Special Treatment",
        "description": "Prince Harry, the Duke of Sussex, finds himself at the center of a legal battle that has reportedly left him and his wife, Meghan Markle, anxious about the potential ramifications for their residency in the United States."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-harry-and-meghan-markles-129-million-netflix-pay-cut/news-story/44be44d0dc55571f450f37c4672da640",
        "title": "<b>Prince Harry</b> and Meghan Markle’s $129 million Netflix pay cut",
        "description": "Now this week, the Daily Mail ’s Alison Boshoff has reported that in reality the Sussexes have only banked $22.9 million from the streamer for their six-hour docuseries Harry &amp; Meghan, an endurance exercise in how much self-pity and how many taupe linen sofas one can stomach in a sitting."
    },
    {
        "url": "https://uk.news.yahoo.com/last-airbenders-ken-leung-responds-232500137.html",
        "title": "Last Airbender&#39;s Ken Leung responds to the show&#39;s &quot;intense&quot; finale",
        "description": "Avatar: The Last Airbender star Ken Leung has opened up on the show&#39;s intense season finale, saying that moment had been built up to across the whole season."
    },
    {
        "url": "https://www.vanityfair.com/style/meghan-markle-sports-prince-harry-signature-accessory-at-lunch",
        "title": "Meghan Markle Sports <b>Prince Harry</b>’s Signature Accessory at Lunch",
        "description": "Later in 2018, the newlywed Markle wore another Waight Keller creation for a notable occasion, donning a cream-colored sheath dress with a caped neckline for her first official joint engagement with Queen Elizabeth II. Markle presented Waight Keller with the British Designer of the Year Award in December 2018."
    },
    {
        "url": "https://time.com/6800736/prince-harry-immigration-drug-lawsuit-heritage-foundation/",
        "title": "A Conservative Group Is Trying to Get <b>Prince Harry</b>’s Drug-Related Immigration Records Released",
        "description": "A federal court will hear a lawsuit Friday against the Department of Homeland Security to obtain the immigration records of Prince Harry."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markles-latest-move-hints-174336687.html",
        "title": "Meghan Markle&#39;s Latest Move Hints at How She Loved This Aspect of Royal Life",
        "description": "In 2019, when Megan Markle selected four charity organizations that she wanted to be a royal patron of, and the animal welfare society, Mayhew Animal Home, was at the top of her list. As a beloved dog mom herself,"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-meghan-markle-backing-173226386.html",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle Are Backing A New App That Could Have Major Implications For <b>Prince</b> Archie &amp; Princess Lilibet",
        "description": "Prince Harry and Meghan Markle are basically the poster children for cyberbullying. Not the bullies, but the bullied. Practically since he was born, Prince Harry has been under constant scrutiny — and as soon as Markle entered his life,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1160762-prince-harry-faces-legal-fight-over-us-visa-following-drug-use-confession",
        "title": "<b>Prince Harry</b> faces legal fight over US visa following drug use confession",
        "description": "Prince Harry finds himself in a legal dispute regarding his US visa following his admission of drug use in his memoir, Spare.Today, the Duke of Sussex&#39;s visa is the focal point of a court"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/royal-insiders-talk-bad-blood-among-royals-despite-prince-harry-words-loving-family.html/",
        "title": "Royal Insiders Continue to Talk ‘Bad Blood’ Among Royals Despite <b>Prince Harry</b>’s Own Words About Loving His Family",
        "description": "Prince Harry said he loves his family, yet experts and insiders keep mentioning &#39;bad blood.&#39; What&#39;s the truth?"
    },
    {
        "url": "https://www.themercury.com.au/entertainment/celebrity-life/royals/meghan-markle-wasted-great-potential-after-amazing-start-with-royal-family/news-story/d1f1ac5518d76c44ff491b7dc726c923",
        "title": "Meghan Markle wasted ‘great potential’ after ‘amazing’ start with Royal Family",
        "description": "Low added that he thought the Duchess of Sussex put on a “brilliant Hollywood performance” while on overseas tours – including Australia – with <b>Prince Harry</b>. “There are two things I remember, one from the Australian tour to Australia, New Zealand ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1160754-prince-harry-meghan-markle-make-final-decision-on-royal-titles",
        "title": "<b>Prince Harry</b>, Meghan Markle make final decision on royal titles",
        "description": "Meghan Markle, who&#39;s said to be planning to return to the UK, is reportedly not receptive to the idea of Prince Harry dropping his royal title amid mounting pressure from royal fans.The Duke"
    },
    {
        "url": "https://toofab.com/2024/02/23/meghan-markles-suits-castmate-rick-hoffman-foul-smell-at-her-wedding-to-prince-harry/",
        "title": "Meghan Markle&#39;s Suits Costar Rick Hoffman Recalls &#39;Foul’ Smell at <b>Prince Harry</b> Wedding",
        "description": "In the 2020 book Finding Freedom, coauthors Omid Scobie and Carolyn Durand claimed that scent diffusers were used to mask the &quot;musty&quot; smell of the church on the day <b>Harry</b> and Markle said &quot;I do.&quot; InStyle, meanwhile, confirmed that the royal couple used ..."
    },
    {
        "url": "https://www.oneindia.com/international/uks-prince-harry-drug-confession-case-how-it-may-impact-his-us-visa-3758443.html",
        "title": "UK&#39;s <b>Prince Harry</b>&#39;s Drug Confession Case: How It May Impact His US Visa?",
        "description": "The court hearing today will see <b>Prince Harry</b>&#39;s open drug use confession in his memoir &quot;Spare&quot; being addressed. Following this revelation, the Duke of Sussex finds himself in a precarious situation, posing a potential threat to his immigration status."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-embraces-ladies-lunch-112430403.html",
        "title": "Meghan Markle Embraces the &quot;Ladies Who Lunch&quot; Life in an A-Lister-Worthy Outfit",
        "description": "Meghan Markle just stepped out in Beverly Hills in one of her most beautiful outfits yet. The Duchess of Sussex was photographed going for lunch at Cipriani, an upscale Italian restaurant, with friends on Thursday—including fashion designer Clare Waight Keller, as reported by the Daily Mail."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/23/prince-harry-meghan-markle-sussex-rebrand-still-royals/",
        "title": "Watch: Are <b>Prince Harry</b> and Meghan considered royals or celebrities? | Royal Insight",
        "description": "In this episode of Royal Insight, India McTaggart analyses Prince Harry and Meghan&#39;s crossover between the two worlds"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-wants-part-time-royal-role-help-out-king-charles-iii-says-author-1723615",
        "title": "<b>Prince Harry</b> Wants Part-Time Royal Role To Help Out King Charles III, Says Author",
        "description": "&quot;Hearing that his father was ill, I&#39;m told that he immediately wanted to do something practical to help,&quot; Tom Quinn said."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-william-working-royals-meghan-b2500053.html",
        "title": "Could Hybrid <b>Harry</b> – the half-in, half-out royal – ever work?",
        "description": "From his 24-hour dash to see his father to his controversial ‘rebrand’, the idea of Prince Harry coming back into the family fold has been much discussed – and dismissed. But, says Anna Tyzak, there is precedent for such a"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/23/65d8cf93ca474116658b45a3.html",
        "title": "How <b>Prince Harry</b> earned his new moniker amidst family struggles",
        "description": "UK News. The condition <b>Prince</b> William imposes on his brother <b>Harry</b> to resume his royal duties UK News. Kate Middleton&#39;s medical restrictions one month after mysterious abdominal surgery In the intricate tapestry of the British Royal Family, even amidst the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-prince-william-closer-093437330.html",
        "title": "King Charles and <b>Prince</b> William Are ‘Closer Than Ever,’ Friends Say",
        "description": "Photo Illustration by Luis G. Rendon/The Daily Beast/GettyKing Charles and Prince William are “closer now than they have ever been” after a roller-coaster few months for the royal family, friends of the royals have told The Daily Beast."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/514026/meghan-markle-looks-ultra-stylish-as-she-steps-out-for-lunch-date-with-friends-at-cipriani-in-beverly-hills/",
        "title": "Meghan Markle looks ultra stylish as she steps out for lunch date with friends at Cipriani in Beverly Hills",
        "description": "Meghan&#39;s appearance was notably solo, as <b>Prince Harry</b> was absent from the luncheon, underscoring the couple&#39;s current phase of increasing their public engagements independently. She elevated her simple yet elegant attire with a luxurious Max Mara brown ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-too-harsh-prince-harry-decision-ban-royal-duties-expert-says.html/",
        "title": "Queen Elizabeth II Was ‘Too Harsh’ on <b>Prince Harry</b> in Decision to Ban Him From Royal Duties, Expert Says",
        "description": "Queen Elizabeth II and <b>Prince Harry</b> had always had a good relationship. But when it came to running the monarchy, the queen took her royal duties seriously — and expected that everyone else would, too. While the queen was always supportive of <b>Harry</b>’s ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-not-seeing-old-32195376",
        "title": "<b>Prince Harry</b> &#39;not seeing old friends&#39; on his UK visits for sad reason, says royal butler",
        "description": "<b>Prince Harry</b> made an unexpected visit to the UK earlier this month to see his father King Charles after news of his cancer diagnosis was announced, but his trip was over in less than 24 hours Want all the latest Showbiz news direct to your inbox?"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13115929/meghan-london-charity-royal-expert-harry-return-uk-charles.html",
        "title": "Was Meghan&#39;s surprise engagement at London charity a sign of more to come? Royal expert says <b>Harry</b> WILL return to the UK to see King Charles - but suggests it would be &#39;best ...",
        "description": "Her surfacing at the event via video message came weeks after King Charles III revealed he had been diagnosed with cancer - prompting a rapid trip to the UK by <b>Prince Harry</b> amid claims he may seek a temporary return to frontline royal duties. But royal ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/times-royal-children-struggled-to-behave-at-official-events/",
        "title": "32 times the royal children struggled to behave at official events, from the Queen&#39;s Jubilee to the King&#39;s Coronation",
        "description": "Because while all of the little royals have had their moments over the years, a young <b>Prince Harry</b> and <b>Prince</b> Louis stand out for their unpredictable reactions when faced with a camera. Be prepared to smile... It seemed to be a little too noisy for <b>Prince</b> ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/royal-family-hobbies/",
        "title": "32 hobbies the royals can&#39;t get enough of - from tennis with the pros to family rivalry on the polo field",
        "description": "There&#39;s the late Queen Elizabeth&#39;s dedication to walking her beloved Corgi dogs, <b>Prince Harry</b>&#39;s Transatlantic enthusiasm for polo and Kate Middleton&#39;s penchant for tennis. However, there is also much we don&#39;t know about their private interests - from King ..."
    }
]