[
    {
        "url": "https://westernpeople.ie/harry-awarded-164000-in-phone-hacking-claim-against-mirror-group_arid-5653.html",
        "title": "<b>Harry</b> awarded €164,000 in phone hacking claim against Mirror Group",
        "description": "Harry sued the tabloid newspaper publisher at the High Court claiming it was involved in unlawfully gathering his personal information"
    },
    {
        "url": "https://www.channelnewsasia.com/world/london-police-carefully-consider-prince-harry-phone-hacking-ruling-3993646",
        "title": "London police to &#39;carefully consider&#39; <b>Prince Harry</b> phone hacking ruling",
        "description": "LONDON: London&#39;s police said they will &quot;carefully consider&quot; the findings of a court ruling that found Prince Harry had been a victim of phone hacking and other unlawful acts by Mirror"
    },
    {
        "url": "https://www.thesun.ie/royals/11869073/meghan-markle-archie-devastated-camera/",
        "title": "Meghan Markle reveals <b>Prince</b> Archie, four, was devastated when she didn’t buy him an £8,000 camera",
        "description": "MEGHAN Markle has revealed that little Archie has developed a new hobby – but he wasn’t very impressed when she bought him a present to encourage him. The Duchess of Sussex, 42, shared how"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872049/meghan-markle-netflix-questions-director-misan-harriman.html",
        "title": "Meghan Markle hosts Netflix Q&amp;A with friend and director Misan Harriman one year after the Duke and Duchess of Sussex&#39;s bombshell documentary premiered on the streaming service",
        "description": "Meghan joined new film director and friend Misan Harriman, who had just released the live-action short film hopeful The After at an exclusive premiere in a private Californian residence."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-christmas-charles-william-endgame-others-given-first-time-invite/",
        "title": "<b>Prince Harry</b> to spend Christmas away from &#39;Charles or William&#39; after Endgame drama as others given first time invite",
        "description": "Prince Harry will not be spending Christmas with King Charles nor Prince William after claims about the Royal Family were revealed in Omid Scobie’s Endgame."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12871647/Jerry-OConnell-say-Rebecca-Romjin-bummed-betrayal-ex-John-Stamos-memoir.html",
        "title": "Jerry O&#39;Connell says his wife Rebecca Romjin was &#39;bummed&#39; by &#39;betrayal&#39; in ex John Stamos&#39; memoir... but admits dishing the dirt &#39;sells books&#39; and &#39;we&#39;re all in a business&#39;",
        "description": "Jerry O&#39;Connell has revealed how his wife Rebecca Romjin felt about her &#39;betrayal&#39; in her ex-husband John Stamos &#39; juicy new memoir."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-didnt-understand-williams-31689577",
        "title": "<b>Prince Harry</b> didn&#39;t understand William&#39;s &#39;obsession&#39; with &#39;boring&#39; Middletons after marrying Kate",
        "description": "The Duke of Sussexes&#39; relationship with his brother was never the same after the Prince of Wales married Kate Middleton in 2011 according to a royal author."
    },
    {
        "url": "https://www.theguardian.com/media/2023/dec/16/labour-backs-away-press-reforms-after-prince-harry-phone-hacking-victory?ref=biztoc.com",
        "title": "Labour backs away from press reforms after <b>Prince Harry</b>’s phone-hacking court victory",
        "description": "The party has made it clear that Keir Starmer had no intention of reviving the second stage of the Leveson inquiry"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-no-fun-marrying-31689003",
        "title": "<b>Prince Harry</b> is &#39;no fun&#39; since marrying Meghan Markle, jokes pal James Haskell",
        "description": "Former England rugby player James Haskell has spoken out about how Prince Harry has reportedly changed since meeting his wife Meghan Markle, claiming the Duke is &quot;no fun&quot;"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/16/press-faces-peril-cant-just-shrug-move-on-prince-harry",
        "title": "The press faces a moment of peril. It can’t just shrug and move on",
        "description": "Early responses to the Prince Harry verdict suggest that lessons have not been learned"
    },
    {
        "url": "https://news.sky.com/video/phone-hacking-claimants-furious-as-they-wait-for-judgments-following-prince-harry-case-13032180",
        "title": "Phone hacking: Claimants &#39;furious&#39; as they wait for judgments following <b>Prince Harry</b> case",
        "description": "Prince Harry has secured a victory in court after a judge ruled that phone hacking and unlawful information gathering took place at Mirror Group Newspapers (MGN) from the mid-1990s until 2011 however many other claimants are still waiting for a judgement."
    },
    {
        "url": "https://metro.co.uk/2023/12/16/harry-will-avoid-christmas-william-charles-19983837/?ico=trending-module_category_tech_item-2",
        "title": "<b>Harry</b> ‘will avoid Christmas with William and Charles’ over Endgame drama",
        "description": "Prince Harry is set to miss Christmas with both King Charles and Prince William because of the explosive revelations in Omid Scobie’s book Endgame. While Charles has extended the invitation for Christmas at Sandringham to Queen Camilla’s wider family – Harry and Meghan are staying stateside."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073941/prince-harry-christmas-charles-william-endgame/",
        "title": "<b>Prince Harry</b> ‘won’t spend Christmas with Charles or William’ after Endgame drama – while others given first time invite",
        "description": "PRINCE Harry won’t be spending Christmas with Charles or William in the UK after explosive claims were revealed in Omid Scobie’s Endgame, it’s believed. Instead, Charles will"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846369/prince-harry-meghan-markle-royal-family-reunion",
        "title": "Meghan Markle &#39;a thorn in <b>Harry</b>&#39;s side&#39; as <b>prince</b> &#39;won&#39;t be welcome back to UK with her&#39;",
        "description": "A royal commentator branded Meghan Markle a &#39;thorn&#39; and claimed Prince Harry would have to come back to the UK &#39;divorced&#39; to win back the public&#39;s trust."
    },
    {
        "url": "https://uk.movies.yahoo.com/mental-health-female-empowerment-two-151042704.html",
        "title": "Mental Health and Female Empowerment: Two Oscar-Qualified Shorts Pushing the Boundaries of African Cinema",
        "description": "In Her Perfect Life, Onajite Johnson-Ibrahim (played by Pearl Thusi) appears to have it all. She’s a 39-year-old entrepreneur with the perfect Instagram profile — a fantastic career, a loving husband (played by Ahmed Ibrahim),"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/whats-on/whats-on-news/gallery/cotswold-castle-hosts-elle-macpherson-8976714",
        "title": "Cotswold castle hosts Elle Macpherson and Jeremy Irons in support of charity with <b>Prince Harry</b> as patron",
        "description": "Other guests at WellChild&#39;s Christmas at Sudeley Castle event included SuperDry Founder Julian Dunkerton, fashion designer Jade Holland-Cooper, actor Sinead Cusack and Xerjoff’s Sergio Momo"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-meghans-christmas-card-shows-31687954",
        "title": "<b>Harry</b> and Meghan&#39;s Christmas card shows &#39;united display&#39; but &#39;something missing&#39;",
        "description": "Harry and Meghan&#39;s green-hued festive card shows both happy and clapping side by side at the Invictus Games earlier this year. Now, PR guru Lynn Carratt of Press Box analysed the snap and has given her professional insight as to how viewers may interpret it."
    },
    {
        "url": "https://uk.movies.yahoo.com/crown-prince-harry-differ-nazi-140833045.html",
        "title": "The Crown and <b>Prince Harry</b> Differ on the Nazi Costume Controversy",
        "description": "The scene of Prince Harry wearing a Nazi costume in The Crown differs from Prince Harry&#39;s memory of that controversy."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509617/meghan-markle-reveals-gifts-she-and-prince-harry-gave-prince-archie/",
        "title": "<b>Prince</b> Archie left confused by Meghan Markle&#39;s latest gift to him",
        "description": "Now four-and-a-half, Prince Archie&#39;s personality is shining through. Opening up about her son&#39;s latest hobby, Meghan Markle, 42, revealed that her close friend and filmmaker, Misan Harriman has been teaching him all about photography."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67736528?at_medium=RSS&at_campaign=KARANGA",
        "title": "Steve Coogan: <b>Prince Harry</b>&#39;s hacking case is &#39;start of something&#39;",
        "description": "A High Court ruling that Prince Harry&#39;s phone had been hacked by Mirror Group Newspapers (MGN) is the &quot;start of something&quot;, actor Steve Coogan said. Coogan said the ruling exposed &quot;widespread contempt&quot; by newspaper editors for the Leveson Inquiry, which looked at the ethics of the press."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846325/king-charles-prince-harry-meghan-markle-christmas",
        "title": "King Charles &#39;deeply nervous&#39; about talking to <b>Prince Harry</b> and Meghan Markle due to leaks",
        "description": "A royal insider claimed King Charles would love nothing more than to have all his family with him on Christmas but is worried about the hostility towards Prince Harry and Meghan Markle."
    },
    {
        "url": "https://uk.style.yahoo.com/people-picks-top-10-books-130000464.html",
        "title": "PEOPLE Picks the Top 10 Books of 2023 — from <b>Prince Harry</b>&#39;s “Spare” to Barbra Streisand&#39;s Memoir",
        "description": "Queer icons including Drag Race UK alum Ella Vaday (Nick Colier), former England rugby star and LGBTQ+ ally Ben Cohen, and Princess Diana’s former gay butler Paul Burrell, joined the cast of ITV’s The Real Full Monty: Jingle Balls this week to raise money and awareness for UK cancer charities. The festively-themed event, which has…"
    },
    {
        "url": "https://uk.style.yahoo.com/harry-meghan-believe-royal-family-124841557.html",
        "title": "<b>Harry</b> And Meghan “Believe Royal Family Behind Vendetta Blocking Big Brand Deals”",
        "description": "During yet another dramatic week for the British royal family, UK media reports that WME has been holding crisis talks with its high-profile clients Prince Harry and Meghan Markle. Despite Harry’s victory in the UK’s High Court on Friday – where he won a $180,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/reports-harry-meghan-strapped-cash-31686985.amp",
        "title": "Reports <b>Harry</b> and Meghan are &#39;strapped for cash&#39; are &#39;getting under their skin&#39;",
        "description": "According to a royal expert, the Duke and Duchess of Sussex, Prince Harry and Meghan Markle, are a little annoyed with recent reports regarding Archewell&#39;s finances"
    },
    {
        "url": "https://uk.news.yahoo.com/top-judge-says-anyone-lied-103822132.html",
        "title": "Top judge says anyone who lied to phone hacking inquiry should be prosecuted for perjury",
        "description": "A top judge has said anyone who lied to the phone hacking inquiry should be prosecuted for perjury after a court found there could be “no doubt” editors at Mirror Group Newspapers (MGN) knew about intercepted voicemails."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghans-christmas-card-missing-31686802.amp",
        "title": "EXCLUSIVE: <b>Harry</b> and Meghan&#39;s Christmas card was missing something important amid &#39;united display&#39;",
        "description": "<b>Prince Harry</b> and Meghan Markle could be seen on the front of their green-hued festive offering, with the duo smiling and clapping in a snap beside one another at the Invictus Games earlier this year. The Sussexes have featured their children on their ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25068217/piers-morgan-prince-harry-ruthless-phone-hacking/",
        "title": "<b>Prince Harry</b> wouldn’t know truth if it slapped him around his California-tanned face, says Piers Morgan after ruling",
        "description": "PIERS Morgan today slammed “ruthless and greedy” Prince Harry after he was dragged into the royal’s phone hacking battle. The TalkTV host spoke out after the Duke of Sussex was"
    },
    {
        "url": "https://www.bbc.com/news/uk-67732229",
        "title": "Mirror hacking case: <b>Prince Harry</b> has last laugh but &#39;mission&#39; goes on",
        "description": "There is little doubt the High Court ruling that Prince Harry was a victim of phone hacking by Mirror Group Newspapers on multiple occasions has huge implications."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/are-prince-harry-and-meghan-markle-trying-to-reconcile-with-royal-family-exploring-their-turbulent-relationship-amid-racism-scandal-1265769",
        "title": "Are <b>Prince Harry</b> and Meghan Markle trying to reconcile with royal family? Exploring their turbulent relationship amid racism scandal",
        "description": "Prince Harry and Meghan Markle are reportedly having a change of heart. As Christmas approaches, is a reunion around the corner for the British royal family?"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/breaking-prince-harry-meghan-markle-2023-christmas-card-16-december-2023/",
        "title": "<b>Prince Harry</b> and Meghan Markle reveal their 2023 Christmas card",
        "description": "The Duke and Duchess of Sussex, Prine Harry and Meghan Markle have finally revealed their 2023 Christmas cards."
    },
    {
        "url": "https://www.kiro7.com/news/trending/prince-harry-meghan-markle-release-holiday-card-2023/I4LZVQ3YABAWNC5SGBGETJ3YZM/",
        "title": "<b>Prince Harry</b>, Meghan Markle release holiday card for 2023",
        "description": "The Duke and Duchess of Sussex on Friday released their 2023 holiday card. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads, according to People Magazine. The card was sent in an email on behalf of their Archwell organization."
    },
    {
        "url": "https://deadline.com/2023/12/harry-meghan-believe-royal-family-behind-vendetta-blocking-big-brand-deals-1235670200/",
        "title": "<b>Harry</b> And Meghan “Believe Royal Family Behind Vendetta Blocking Big Brand Deals”",
        "description": "During yet another dramatic week for the British royal family, UK media reports that WME has been holding crisis talks with its high-profile clients Prince Harry and Meghan Markle. Despite Harry’s"
    },
    {
        "url": "https://www.thedailybeast.com/harry-and-meghan-release-2023-christmas-card",
        "title": "<b>Harry</b> and Meghan Release 2023 Holiday Card",
        "description": "Harry and Meghan wish you happy holidays! The Duke and Duchess sent out their yearly Christmas card featuring a picture of them clapping at the Invictus Games and the message “On behalf of the office of Prince Harry &amp; Meghan,"
    },
    {
        "url": "https://www.skynews.com.au/world-news/united-kingdom/prince-harry-calls-for-police-investigation-of-mirror-newspapers/video/59e35a90de8d94fa35c0a742c0bb528b",
        "title": "<b>Prince Harry</b> calls for police investigation of Mirror newspapers",
        "description": "Prince Harry has called on police to investigate a tabloid newspaper after he was awarded more than $280,000 in damages in a court ruling this week. A high court judge ruled there had been &quot;widespread and habitual&quot; phone hacking at Mirror Group Newspapers."
    },
    {
        "url": "https://www.nzherald.co.nz/nz/man-critically-injured-in-assault-outside-auckland-pub/6PSRQDMH54WTMN5VU5NYFY4VVI/",
        "title": "Man critically injured in assault outside Auckland pub",
        "description": "A man was in critical condition after a serious assault outside Auckland&#39;s Shakespeare Tavern. Video / Supplied"
    },
    {
        "url": "https://www.aol.com/black-style-meghan-markle-prince-172140257.html",
        "title": "Black in Style: Meghan Markle and <b>Prince Harry</b>’s holiday card debuts as <b>Harry</b> wins phone-hacking lawsuit",
        "description": "In Black style this week, your house can smell like Prince, Fashion Fair takes on breast cancer, Ambi skincare offers […] The post Black in Style: Meghan Markle and Prince Harry’s holiday card debuts as Harry wins phone-hacking lawsuit appeared first on TheGrio."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/kate-middleton-earns-coveted-new-title-as-popularity-soars/news-story/57de350d83750caa76922f258196640b",
        "title": "Kate Middleton earns coveted new title as popularity soars",
        "description": "The Princess of Wales’ soaring popularity has earned her a new title – but the rest of royals may not be happy about it. Americans might have proudly thrown off the yoke of monarchy in 1796, showing the redcoats what for and really poking a sharp stick in the eye of the colonial project, but there was once a Queen in the US. Really."
    },
    {
        "url": "https://www.gwinnettdailypost.com/christmas-train-min-town-at-bufords-tannery-row-ale-house-raising-money-for-local-nonprofit/article_dbd9508c-9c31-11ee-aacc-f3c4a37eb7eb.html",
        "title": "Christmas train min-town at Buford&#39;s Tannery Row Ale House raising money for local nonprofit",
        "description": "John Gibb has been fascinated with model trains since his youth, primarily due to the joy it brings out in others."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1138943-king-charles-invites-queen-camilla-s-children-to-royal-christmas-snubs-prince-harry",
        "title": "King Charles invites Queen Camilla’s children to Royal Christmas, snubs <b>Prince Harry</b>?",
        "description": "King Charles III has reportedly invited the children and grandchildren of his wife Queen Camilla to the royal family&#39;s annual holiday gathering at Sandringham. Meanwhile, Prince Harry and his children won&#39;t be celebrating Christmas at Sandringham, according to a new report."
    },
    {
        "url": "https://www.samaa.tv/208736384-king-charles-sets-strict-conditions-for-potential-reunion-with-prince-harry",
        "title": "King Charles sets strict conditions for potential reunion with <b>Prince Harry</b>",
        "description": "&quot;If there will be a meeting, it will have to be done properly with aides and officials present, and everything documented with minutes taken,&quot; revealed an insider to Express UK, emphasizing the King&#39;s stance on establishing a framework for trust."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1138936-why-is-kate-middletons-popularity-game-stronger-than-meghan-markle",
        "title": "Why is Kate Middleton&#39;s popularity game stronger than Meghan Markle?",
        "description": "Kate Middleton emerged victorious in the popularity contest by avoiding the issues that beset other members of the royal family, such as Meghan Markle. PR guru Eddie Coram James told The Express that Kate, the Princess of Wales, has more flexibility and public trust because of her spotless record since marrying Prince William."
    },
    {
        "url": "https://nypost.com/2023/12/16/news/bestselling-celeb-memoirs-by-britney-spears-prince-harry-and-others-may-have-failed-to-earn-back-advances-report/",
        "title": "Bestselling celeb memoirs by Britney Spears, <b>Prince Harry</b> and others may have failed to earn back advances: report",
        "description": "NewsNation’s “The Scoop” from Paula Froelich crunched the numbers to see if a book earned back its advance based on how much the celebs were paid — numbera that are rarely"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-2023-182758284.html",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle’s 2023 Holiday Card Might Hint at Their Main Focus Heading Into 2024",
        "description": "It’s an unofficial tradition at this point that members of the royal family share their annual holiday cards with the public or significant recipients. Since their move to the United States, Prince Harry and Meghan Markle have kept up with the practice."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghans-christmas-card-missing-31686802",
        "title": "<b>Harry</b> and Meghan&#39;s Christmas card was missing something important amid &#39;united display&#39;",
        "description": "Prince Harry and Meghan Markle&#39;s Christmas card was missing something important amid their &#39;united display&#39;, an expert has analysed following the 2023 festive offering being released"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073801/prince-harry-no-fun-since-marrying-meghan-james-haskell/",
        "title": "<b>Prince Harry</b> is no fun since marrying Meghan Markle, pal James Haskell reveals",
        "description": "PRINCE Harry is “no fun” since marrying Meghan Markle, according to friend James Haskell. The former England rugby star hinted at how much the Duke of Sussex had changed since tying"
    },
    {
        "url": "https://www.hellomagazine.com/celebrities/509611/christine-lampard-attends-piers-morgan-christmas-party-hours-after-court-case/",
        "title": "Christine Lampard wows in sequins as she parties with Piers Morgan hours after phone hacking court case",
        "description": "The Loose Women panellist posed alongside Good Morning Britain stars Laura Tobin and Charlotte Hawkins, who dazzled in a gold sequin dress. Other famous faces that attended the festive get-together included Richard Madeley and Bruno Tonioli."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/prince-harry-no-fun-marrying-28302125",
        "title": "<b>Prince Harry</b> is &#39;no fun&#39; since marrying Meghan Markle, James Haskell says",
        "description": "I&#39;m A Celebrity star, who split from Chloe Madeley last month, has claimed the Duke of Sussex lacks the fun and good humour of old since he married the former Suits actress."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-wont-spend-christmas-28302108",
        "title": "<b>Prince Harry</b> won&#39;t spend Christmas with King Charles as others get first-time invite",
        "description": "Scobie&#39;s book has proven to be the latest obstacle in mending the rift between him and the Duke of Cambridge."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846294/meghan-markle-christmas-card-success-politics-move",
        "title": "<b>Prince Harry</b> and Meghan&#39;s Christmas card &#39;reeks of success&#39; and &#39;hints at political move&#39;",
        "description": "Meghan Markle&#39;s pose in her and Prince Harry&#39;s Christmas card &#39;reeks of success, celebration and glory&#39;, a body language expert has claimed."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/as-king-charles-expands-his-guest-list-for-christmas-heres-who-he-could-be-inviting_art20471.html",
        "title": "As King Charles expands his guest list for Christmas, here’s who he could be inviting",
        "description": "This year, she does not have to make that decision. Finally, it is rumoured that <b>Prince Harry</b> and Meghan have been invited but it isn’t clear whether they will come as the couple has missed the last 4 Christmasses with the Royal Family. The King&#39;s ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/north-wales-pub-has-licence-suspended-over-concerns-about-excessively-drunk-children-using-ketamine-and-cocaine/",
        "title": "North Wales pub has licence suspended over concerns about &#39;excessively drunk&#39; children using ketamine and cocaine",
        "description": "A pub and nightclub has had its licence suspended for three months after police found children in an excessively drunk state and concerns were raised they may have taken cocaine and ketamine."
    },
    {
        "url": "https://www.harpersbazaar.com/uk/culture/culture-news/a46152262/prince-harry-meghan-markle-christmas-card-2023/",
        "title": "The Duke and Duchess of Sussex release their 2023 Christmas card",
        "description": "Prince Harry and Meghan have released their 2023 Christmas card, which features a photo of the couple laughing and clapping at the closing ceremony of the 2023 Invictus Games."
    },
    {
        "url": "https://uk.news.yahoo.com/london-police-carefully-consider-prince-095302878.html",
        "title": "London police to &quot;carefully consider&quot; <b>Prince Harry</b> phone hacking ruling",
        "description": "London&#39;s police said they will &quot;carefully consider&quot; the findings of a court ruling that found Prince Harry had been a victim of phone hacking and other unlawful acts by Mirror Group journalists with the knowledge of their editors."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-meghan-markle-christmas-card-children-b1127373.html",
        "title": "<b>Harry</b> and Meghan choose Christmas card without picture of children",
        "description": "Harry and Meghan have chosen not to include a picture with their children on their annual Christmas card, according to reports."
    },
    {
        "url": "https://goss.ie/uk-showbiz/longtime-friend-brands-prince-harry-no-fun-since-he-married-meghan-markle-362807",
        "title": "Longtime friend brands <b>Prince Harry</b> ‘no fun’ since he married Meghan Markle",
        "description": "James Haskell, a longtime friend of Prince Harry, has claimed he’s been “no fun” since he married Meghan Markle. While the former rugby union player has jumped to their defence in the past, the 38-year-old made a sly dig towards the couple on stage during a live version of his podcast in Bath this week."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-piers-morgan-phone-hacking-court-2810735?ico=above_article_ticker",
        "title": "<b>Prince Harry</b> says Piers Morgan ‘clearly knew’ about phone hacking after court win",
        "description": "Prince Harry has claimed Piers Morgan “clearly knew about phone hacking” after a High Court judge ruled the Duke of Sussex had been the victim of phone hacking by Mirror Group Newspapers."
    },
    {
        "url": "https://www.telegraph.co.uk/betting/racing/itv-racing-tips-cheltenham-doncaster-16-december/",
        "title": "Horse racing tips: Cheltenham and Doncaster – ITV Racing Saturday picks",
        "description": "Predictions and analysis for Saturday’s ITV Racing from Cheltenham and Doncaster, plus a free bets offer to back our selections"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/prince-harry-piers-morgan-phone-hack-perjury-b2465201.html",
        "title": "Top judge says anyone who lied to phone hacking inquiry should be prosecuted for perjury",
        "description": "A top judge has said anyone who lied to the phone hacking inquiry should be prosecuted for perjury after a court found there could be “no doubt&quot; editors at Mirror Group Newspapers knew about intercepted voicemails."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghan-given-netflix-gold-31686066",
        "title": "<b>Harry</b> and Meghan have given Netflix &#39;gold dust&#39; for future dramatisations like The Crown",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, have given Netflix &#39;gold dust&#39; for future dramatisations, it has been claimed by an expert amid the new series of The Crown"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/16/the-crown-monarchy-series-showdown-changed-royal-family/",
        "title": "How The Crown altered the public perception of The Firm",
        "description": "Again, as with credence in the truth of the series, that support varied dramatically with age. While 80 per cent of the over-65s support the monarchy, barely a third of 18 to 24-year-olds do. The survival and success of the real royal institution, then, is by no means guaranteed."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23993710.policing-cant-done-cheap-get-bobbies-back-beat/",
        "title": "Policing can&#39;t be done on the cheap. Get bobbies back on the beat",
        "description": "I WAS not surprised to learn that Police Scotland proposes to close 29 police stations in an effort to save money. Since Police Scotland"
    },
    {
        "url": "https://www.modernghana.com/videonews/0/1/386909/",
        "title": "<b>Prince Harry</b>: Piers Morgan denies Daily Mirror phone hacking involvement - BBC News",
        "description": "ABC ALJazeera BBC CitiTV CNN DW France24 NBC Net2TV Others RT TV3 UTV DelayTV KofiTV MagrahebTV ModernGhana \\| Movies Documentaries. State secrets lost: Swalwell blasts Trump over"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/23987218.william-kate-to-send-children-marlborough-college/",
        "title": "William and Kate &#39;to send children to Marlborough College’",
        "description": "The royal family have decided on the future of Prince George’s education after months of toying between two prestigious colleges, an inside"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/question-of-sport-axed-by-bbc-over-inflation-and-funding-challenges/",
        "title": "Question Of Sport axed by BBC over &#39;inflation and funding challenges&#39;",
        "description": "A Question Of Sport has been axed by the BBC, ending a more than 50-year run on the national broadcaster. A BBC spokesman said: &quot;Due to inflation and funding challenges, difficult decisions have to be made, therefore Question Of Sport is currently not in production at the moment.&quot;"
    },
    {
        "url": "https://bylinetimes.com/2023/12/15/getting-away-with-murder-what-harrys-win-against-the-mirror-means-for-murdoch-and-the-mail/",
        "title": "Getting Away with Murder? What <b>Harry</b>’s Win Against the Mirror Means for Murdoch and the Mail",
        "description": "The judgment of Justice Fancourt establishes a clear link between the ‘criminal media nexus’ of corrupt cops, journalists and the murders of Stephen Lawrence and Daniel Morgan to feature in trials nex"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12870267/PLATELLS-PEOPLE-Sussexes-felt-world-Spare-fastest-selling-non-fiction-book-88million-Netflix-deal-bag-year-sanctimonious-bubble-burst.html",
        "title": "PLATELL&#39;S PEOPLE: The Sussexes must have felt on top of the world with Spare the fastest-selling non-fiction book ever and a &#39;£88million Netflix deal&#39; in the bag... So why was ...",
        "description": "Spare became the fastest-selling non-fiction book ever, with more than 3.2 million copies shifted in the first week. At the time, the Sussexes, must have felt on top of the world."
    },
    {
        "url": "https://goss.ie/uk-showbiz/piers-morgan-claims-prince-harry-and-meghan-markle-are-on-a-mission-to-destroy-the-british-monarchy-362800",
        "title": "Piers Morgan claims <b>Prince Harry</b> and Meghan Markle are on a mission to ‘destroy the British monarchy’",
        "description": "Piers Morgan has claimed <b>Prince Harry</b> and Meghan Markle are on a mission to “destroy the British monarchy”. His latest war of words against the Duke and Duchess of Sussex has come after <b>Harry</b> was awarded damages in his phone hacking trial against ..."
    },
    {
        "url": "https://news.sky.com/story/piers-morgan-defends-mirror-and-launches-scathing-attack-against-prince-harry-13031082",
        "title": "&#39;I&#39;ve never hacked a phone&#39;: Piers Morgan&#39;s defence as he launches rant against <b>Prince Harry</b>",
        "description": "Piers Morgan, who was editor of The Mirror from 1995 to 2004, also accused Prince Harry of a &quot;hypocritical&quot; approach to privacy. It came after the royal hailed a judge&#39;s ruling that hacking had been &quot;widespread&quot; at the newspaper."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67732229?at_medium=RSS",
        "title": "Mirror hacking case: <b>Prince Harry</b> has last laugh but &#39;mission&#39; goes on",
        "description": "There is little doubt the High Court ruling that Prince Harry was a victim of phone hacking by Mirror Group Newspapers on multiple occasions has huge implications."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-meghan-markle-christmas-31685669",
        "title": "Meghan and <b>Harry</b> release their official 2023 Christmas card and thank fans for support",
        "description": "Prince Harry and Meghan Markle have released their official Christmas card just over a week before the big day, and have treated some lucky recipients to the virtual greeting"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-daily-mirror-lawsuit_n_657c9d15e4b036ecab44eb11",
        "title": "<b>Prince Harry</b> Gets Historic Victory As Judge Finds British Tabloid Hacked His Phone",
        "description": "LONDON (AP) — Prince Harry’s phone was hacked by journalists and private investigators working for the Daily Mirror who invaded his privacy by snooping on him unlawfully, a judge ruled Friday, delivering an historic victory for the estranged royal who broke from family tradition to take on the British press."
    },
    {
        "url": "https://www.itv.com/news/2023-12-15/prince-harry-judge-finds-extensive-phone-hacking-by-mirror-group-newspapers",
        "title": "<b>Harry</b> claims vindication after court rules Mirror did hack his phone - but Piers Morgan hits back",
        "description": "The Duke of Sussex had claimed journalists at titles such as the Mirror were linked to methods including phone hacking. | ITV National News"
    },
    {
        "url": "https://www.vogue.co.uk/article/harry-meghan-christmas-card-2023",
        "title": "The Deeper Meaning Behind The Duke &amp; Duchess Of Sussex’s 2023 Christmas Card",
        "description": "Prince Harry and Meghan Markle sent a virtual holiday card on behalf of their foundation, Archewell. It showed a picture of them smiling and clapping at the 2023 Invictus Games in Düsseldorf – the multi-sport tournament for wounded and injured veterans that Prince Harry founded in 2014."
    }
]