[
    {
        "url": "https://www.outlookindia.com/international/us/british-royal-christmas-2023-unwrapping-traditions-and-turmoil-news-338317",
        "title": "British Royal Christmas 2023: Unwrapping Traditions and Turmoil",
        "description": "This Christmas emerges as a chapter of transformation in the British Royal family. Amidst tensions and transitions, the Windsors prepare to navigate the festive season, crafting a narrative that intertwines the old and the new."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/real-reason-crown-didnt-use-31742167",
        "title": "The real reason The Crown didn&#39;t use <b>Prince Harry</b>&#39;s recollections of key events for show",
        "description": "One of the researchers from Netflix hit The Crown has said that the Duke of Sussex&#39;s bombshell tome, Spare, could have been used to shape and inspire storylines"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/seven-signs-prince-harry-meghan-31741800.amp",
        "title": "Seven signs <b>Prince Harry</b> and Meghan Markle&#39;s new life in America is in trouble",
        "description": "In the case of <b>Prince Harry</b>, 39, and Meghan Markle, 42, it&#39;s safe to say that 2023 hasn&#39;t been the easiest of years. As they continue to try and put down roots in the US and establish themselves as money-making entities outside of the British establishment ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/signs-prince-harry-meghan-markles-31742086",
        "title": "Signs <b>Prince Harry</b> and Meghan Markle&#39;s new life in America is in trouble after difficult year",
        "description": "The Duke and Duchess of Sussex&#39;s 2023 has been plagued with drama, accusations and public mockery - but these seven incidents have been the most memorable low points for the former working Royals"
    },
    {
        "url": "https://www.thesun.co.uk/news/25152396/tony-parsons-world-tear-apart/",
        "title": "As war tears the world apart, we should count our blessings to live in Britain this Christmas",
        "description": "THIS year has been one when we have seen history unfold before our eyes. The crowning of King Charles III — the first coronation for 70 years, the first that almost all of our people had seen —"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25152079/royal-racism-row-meghan-quizz-oath-archie/",
        "title": "Twist in ‘royal racism’ row as Meghan Markle could be quizzed under oath about ‘Archie’s skin colour’ claim",
        "description": "THE Duchess of Sussex could be questioned under oath about the identity of the so-called “royal racists”. Lawyers want to quiz Meghan over “family matters” as part of sister Samantha Markle’s"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markles-christmas-present-made-31740735",
        "title": "Meghan Markle&#39;s Christmas present made the Queen &#39;burst out laughing&#39;",
        "description": "The late Queen Elizabeth II would head the huge gatherings at the Royal Family’s lavish estate in Sandringham over Christmas, and in 2017, Prince Harry broke royal protocol by inviting his then-fiance"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12896585/Kate-Middleton-surprises-adults-working-childcare.html",
        "title": "Kate Middleton surprises adults working in childcare - and the kids they inspired - with a festive tea party in special for her &#39;Together at Christmas&#39; Carol Service",
        "description": "The Princess of Wales, 41, heard how they are helping to inspire young people, accompanied by five children who had their lives shaped by positive mentors."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848714/prince-harry-meghan-markle-royal-family-christmas",
        "title": "<b>Prince Harry</b> and Meghan Markle warned &#39;it&#39;s huge&#39; if they dodge Sandringham Christmas",
        "description": "It&#39;s not known if King Charles extended an invite to the pair - but their response will be very important, an insider has said."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510021/meghan-markle-generous-gift-dusseldorf-following-christmas-holiday/",
        "title": "Meghan Markle&#39;s generous pre-Christmas gift revealed following secret holiday",
        "description": "Meghan Markle has honoured a pledge she made during the Invitus Games as the Duchess of Sussex made a generous donation of €4,600 to the TrebeCafé, also known as the Diakonie Düsseldorf, alongside a donation of severla boxes of cosmetic products."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/23/harry-meghan-the-crown-spare-memoir-tv-sussex-william/",
        "title": "We would have used more of <b>Harry</b>’s memoir if he had released it earlier, says Crown researcher",
        "description": "TV team admit they would have raided details for their final series but are wary of taking Duke&#39;s account as fact"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847611/prince-harry-stormed-off-christmas-photo-request",
        "title": "<b>Prince Harry</b> stormed off &#39;in a huff&#39; after fan&#39;s Christmas request in pub",
        "description": "Prince Harry was spotted many years ago turning down a man’s request for a photo in a pub on Christmas Day, as one new book claimed he “stormed off in a huff”. The incident is said to have been one of the key things which led to his breakup with Cressida Bonas - who is the granddaughter of Edward Curzon,"
    },
    {
        "url": "https://uk.style.yahoo.com/these-celeb-audiobooks-make-the-best-last-minute-gifts-from-audible-britney-spears-prince-harry-pamela-anderson-and-more-132000809.html",
        "title": "These celeb audiobooks make the best last-minute gifts from Audible: Britney Spears, <b>Prince Harry</b>, Pamela Anderson and more",
        "description": "Pam, Britney, Harry and John — who wouldn&#39;t love to receive a great memoir? Audible Premium Plus is on sale for 60% off!"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-meghan-markle-seen-130000705.html",
        "title": "<b>Prince Harry</b> And Meghan Markle Seen On A Pre-Christmas Vacation With Their Kids",
        "description": "Prince Harry and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet, visiting Zapotal, Nandayure and Guanacaste."
    },
    {
        "url": "https://uk.style.yahoo.com/amazon-audible-celebrity-memoirs-115001559.html",
        "title": "These celeb audiobooks make the best last-minute gifts: Britney Spears, <b>Prince Harry</b>, Pamela Anderson and more",
        "description": "Pam, Britney, Harry and John — who wouldn&#39;t love to receive a great memoir? Audible Premium Plus is on sale for 60% off!"
    },
    {
        "url": "https://uk.news.yahoo.com/harry-meghan-spend-christmas-102253743.html",
        "title": "How <b>Harry</b> and Meghan will spend Christmas this year",
        "description": "It is unlikely the Sussexes will fly back to the UK to spend Christmas at Sandringham this year, delaying any chance of a royal reconciliation"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12895249/Meghan-Markle-Prince-Harry-say-rosy-critics-beg-differ.html",
        "title": "Four years after Megxit, the Sussexes say everything is rosy across the pond - but as figures show their Archewell Foundation is low on donations, critics beg to differ",
        "description": "Judging by the slick, minute-long video released this month by the Duke and Duchess of Sussex &#39;s Archewell Foundation, the past year has been nothing short of a triumph."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/prince-harry-meghan-markle-face-31739274.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle face lonely Christmas with &#39;plans to win Charles over&#39;",
        "description": "As the rest of the Royal Family begin to get together for their Christmas celebrations, two people will be noticeably absent from the festivities."
    },
    {
        "url": "https://uk.news.yahoo.com/reason-archie-lilibet-wont-opening-095140060.html",
        "title": "The reason Archie and Lilibet won&#39;t be opening their presents on Christmas Day",
        "description": "Meanwhile, in 2021, <b>Harry</b> told James Corden that the Queen sent Archie a waffle-maker for Christmas. But before they could even think about presents this year, <b>Prince Harry</b> and Meghan Markle took Archie and Lilibet on a secret pre-Christmas getaway with ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-meghan-markle-missed-31742164",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;missed off&#39; King Charles&#39; Christmas tradition",
        "description": "<b>Prince Harry</b> and Meghan Markle &quot;might not be included&quot; in King Charles III&#39;s Christmas tradition, according to reports. The Duke and Duchess of Sussex, who stepped down as senior royals in 2020 and moved to the States, have rarely returned to the UK since ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/harry-meghan-biographer-omid-scobie-31741639",
        "title": "<b>Harry</b> and Meghan biographer Omid Scobie branded &#39;toxic&#39; by reality star",
        "description": "His book also controversially claimed there is “still a war” ongoing between <b>Prince Harry</b> and his father King Charles, while also insisting that <b>Harry</b> was usually the one to reach out and try and mend the relationship. According to Omid he &quot;always just ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/uk-today/23997886.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to <b>Prince Harry</b>",
        "description": "2023 was a big one! But how much do you actually remember happening? Take our epic end-of-the-year quiz to find out. Big Brother returned, Eurovision came to the UK, the Beatles released a new song and a new King was crowned. Did Billy Joel write 2023 ..."
    },
    {
        "url": "https://www.livemint.com/news/world/brand-deals-dry-up-for-meghan-markle-prince-harry-s-wife-blames-royal-family-s-vendetta-reports-11703317045650.html",
        "title": "Brand deals dry up for Meghan Markle; <b>Prince Harry</b>’s wife blames Royal Family’s ‘vendetta’: Reports",
        "description": "Meghan Markle faces career hurdles as major brands express reluctance to associate with her and Prince Harry due to potential risk to their ties with the Royal Family."
    },
    {
        "url": "https://torontosun.com/news/world/sussex-to-be-them-was-2023-worst-year-yet-for-harry-meghan",
        "title": "SUSSEX TO BE THEM: Was 2023 worst year yet for <b>Harry</b>, Meghan?",
        "description": "From poorly received projects and axed entertainment deals to an eviction and a high-profile court case against a British tabloid, 2023 has not been kind to Prince Harry and Meghan Markle. It wasn’t all bad, but if 2020 was a roller-coaster ride for the couple, 2023 saw the royals fall pretty far."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2923272/prince-harry-meghan-markles-family-traditions-christmas/",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle’s Low-Key Christmas Shows How Important Their Family Traditions Are",
        "description": "<b>Prince Harry</b> and Meghan Markle are setting new Christmas traditions for the family now that they are firmly embedded in their Montecito, California community. While there was some unconfirmed chatter about a possible Sandringham invitation from King ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141162-prince-harry-receives-fresh-blow-in-netflix-hit-show",
        "title": "<b>Prince Harry</b> receives fresh blow in Netflix hit show",
        "description": "Prince Harry, who&#39;s still enjoying multi-million dollar deal with Netflix, has been brutally mocked in final season of the video streaming network&#39;s hit series &#39;The Crown&#39;. The Duke of Sussex is portrayed as &#39;jealous&#39; of his elder brother Prince William on the hit royal drama."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/prince-harry-feels-lonely-after-relocating-to-us-claims-royal-expert/articleshow/106239119.cms",
        "title": "<b>Prince Harry</b> feels &#39;lonely&#39; after relocating to US, claims royal expert",
        "description": "Prince Harry is missing the royal family after moving to Montecito, California in 2020 but his wife Meghan Markle is unwilling to make amen."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-death-stare-forgot-camera-event-mother-prince-harry-goes-viral.html/",
        "title": "Meghan Markle’s Death Stare When She Forgot She Was on Camera at an Event With Her Mother and <b>Prince Harry</b> Goes Viral",
        "description": "That video of the &quot;death stare&quot; Meghan Markle gave her mother is going viral again, and some can&#39;t stop talking about the resurfaced clip."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-royal-family-news-prince-harry-news-101703341326982.html",
        "title": "‘Found herself in a complicated situation when…’: Royal expert on Meghan Markle",
        "description": "Meghan Markle and Prince Harry stepped back from their royal roles in 2020, choosing to live a more private life in the United States. A royal expert said that Meghan Markle&#39;s departure from the royal family proved to be a “loss” for the monarchy."
    },
    {
        "url": "https://www.btimesonline.com/articles/162832/20231223/royal-concerns-rise-over-prince-williams-alleged-battle-with-the-bottle.htm",
        "title": "Royal Concerns Rise Over <b>Prince</b> William&#39;s Alleged Battle with the Bottle",
        "description": "In the grand corridors of Buckingham Palace, a troubling narrative is emerging about Prince William&#39;s alleged battle with alcohol, which insiders claim is being fueled by his ongoing feud with Prince Harry and Meghan Markle."
    },
    {
        "url": "https://www.aol.com/lifestyle/look-back-queen-elizabeths-golden-130000102.html",
        "title": "A Look Back at Queen Elizabeth&#39;s Golden Jubilee",
        "description": "In 2002, the late queen celebrated 50 years on the throne. Here&#39;s a look back at some of the most memorable photos from the day."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/2023-royal-christmas-cards-kate-143700774.html",
        "title": "2023 Royal Christmas Cards from Will + Kate, <b>Harry</b> + Meghan and More",
        "description": "King Charles&#39; sister Princess Anne and her husband Vice Admiral Timothy Laurence&#39;s 2023 holiday card was shared by the Reliant Motor Club, which the Princess Royal is an honorary member of. Anne signed the card containing the message: &quot;With Best Wishes for a Happy and Peaceful Christmas and New Year.&quot;"
    },
    {
        "url": "https://www.btimesonline.com/articles/162829/20231223/king-charles-stands-firm-against-prince-harrys-holiday-plea-amid-ongoing-royal-rift.htm",
        "title": "King Charles Stands Firm Against <b>Prince Harry</b>&#39;s Holiday Plea Amid Ongoing Royal Rift",
        "description": "King Charles has reportedly rebuffed an attempt by Prince Harry to secure a holiday invite to Sandringham Castle, amidst escalating tensions and accusations."
    },
    {
        "url": "https://nypost.com/2023/12/23/entertainment/prince-harry-is-very-lonely-living-in-california-with-meghan-markle-truly-misses-his-family-expert/",
        "title": "<b>Prince Harry</b> is ‘very lonely’ living in California with Meghan Markle, ‘truly misses his family’: expert",
        "description": "Prince Harry is reportedly missing his family since making the move to Montecito, Calif. in 2020 — but wife Meghan Markle doesn’t want to make amends with the Royals. Royal expert Kinsey Schofield made the claim in an interview with GB News, saying she believes The Duke of Sussex, 39, is “lonely” living so far from home."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/queen-elizabeth-really-thought-kate-130000547.html",
        "title": "What Queen Elizabeth Really Thought of Kate Middleton’s Hair",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.swlondoner.co.uk/news/23122023-the-biggest-news-stories-of-january",
        "title": "The biggest news stories of January",
        "description": "Prince Harry&#39;s Interview and the release of his memoir, Spare, kicked off the new year and the disappearance of Nicola Bulley sparked nation-wide interest."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-seen-130000705.html",
        "title": "<b>Prince Harry</b> And Meghan Markle Seen On A Pre-Christmas Vacation With Their Kids",
        "description": "Prince Harry and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet, visiting Zapotal, Nandayure and Guanacaste."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/royals-in-2023-kings-coronation-year-marred-by-endgame-race-row/a644692322.html",
        "title": "Royals in 2023: King&#39;s Coronation year marred by Endgame race row",
        "description": "A coronation, a reignited race row and a controversial memoir by the Duke of Sussex shaped the royal family&#39;s 2023."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-christmas-card-best-worst-b2468727.html",
        "title": "The best and worst royal Christmas cards over the years",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-reveals-one-christmas-31718791",
        "title": "Meghan Markle reveals one Christmas present Archie wants that she refuses to buy",
        "description": "The Duchess of Sussex recently revealed that her four-year-old son has taken an interest in a new hobby and has asked for some very expensive equipment to pursue it."
    },
    {
        "url": "https://www.mancunianmatters.co.uk/news/23122023-mm-year-in-review-april-2023/",
        "title": "MM’s Year in Review: April 2023",
        "description": "Manchester’s Tourist Tax introduced. Manchester became the first UK city to launch the tourist tax. The introduction of the City"
    },
    {
        "url": "https://www.thetimes.co.uk/article/2023-peter-brookes-trump-sunak-johnson-biden-braverman-royal-family-xqq0762ts",
        "title": "The year in cartoons — from <b>Prince Harry</b>’s Spare to Trump’s cases",
        "description": "Royal revelations, the coronation, government sackings, bloodshed in the Middle East … Here’s Times cartoonist Peter Brookes’s round-up of 2023"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141138-prince-harry-meghan-markle-royal-christmas-possible-on-one-condition",
        "title": "<b>Prince Harry</b>, Meghan Markle royal Christmas possible on &#39;one condition&#39;",
        "description": "It’s never too late for <b>Prince Harry</b> and Meghan Markle to make amends with the royal family and fulfil their desire to spend Christmas with them. According to reports, the Duke and Duchess of Sussex have been eager to spend the holiday season with the ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-have-had-the-worst-year-of-their-lives.html/",
        "title": "Meghan Markle and <b>Prince Harry</b> Have ‘Stamp of Losers on Their Forehead’ After ‘Worst Year’ Says Royal Commentator: ‘They Failed Hard’",
        "description": "Throughout 2023, <b>Prince Harry</b> and Meghan Markle have tried to pick up the pieces of their shattered reputation. As the months passed, they fell over and over with one professional misstep after another. This led a royal commentator to claim this was the ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509932/real-reason-king-charles-prince-william-kate-middleton-gift-novelty-presents/",
        "title": "The real reason reason the royals gift each other novelty presents",
        "description": "She also reportedly once presented <b>Prince Harry</b> with a &#39;Grow Your Own Girlfriend&#39; kit before he started dating Meghan. Known for his humour, it&#39;s not surprising <b>Prince Harry</b> has pulled out some corkers for his family. &quot;One year, <b>Harry</b> reportedly gave the ..."
    },
    {
        "url": "https://www.dispatch.com/story/entertainment/celebrities/2023/12/11/prince-harry-ordered-to-pay-daily-mail-legal-fees-before-trial/71881087007/",
        "title": "<b>Prince Harry</b> ordered to pay Daily Mail over $60K in legal fees following failed court challenge",
        "description": "LONDON — A judge ordered <b>Prince Harry</b> on Monday to pay more than $60,000 in legal fees to the publisher of the Daily Mail tabloid for his failed court challenge in a libel lawsuit. The Duke of Sussex is suing Associated Newspapers Ltd. over an article ..."
    }
]