[
    {
        "url": "https://www.dailymail.co.uk/news/article-12895249/Meghan-Markle-Prince-Harry-say-rosy-critics-beg-differ.html",
        "title": "Four years after Megxit, the Sussexes say everything is rosy across the pond - but as figures show their Archewell Foundation is low on donations, critics beg to differ",
        "description": "Judging by the slick, minute-long video released this month by the Duke and Duchess of Sussex &#39;s Archewell Foundation, the past year has been nothing short of a triumph."
    },
    {
        "url": "https://www.thescottishsun.co.uk/tvandshowbiz/11694703/prince-harry-member-of-my-bald-ginger-club/",
        "title": "<b>Prince Harry</b> will soon be a member of my bald, ginger club says Scots comic",
        "description": "COMIC Ray Bradshaw may be signing  ginger footie idols John Hartson and Liam Boyce as  lookalikes ahead of his new  shows – but he has his eyes set firmly on Prince Harry. The"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848521/prince-harry-apology-hurtful-behavior-king-charles",
        "title": "<b>Prince Harry</b> urged to apologise to &#39;hurt&#39; King Charles ahead of Christmas",
        "description": "Prince Harry is being criticized for keeping his children from King Charles. He’s being advised to apologize by royal reporter Michael Cole."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/22/prince-princess-wales-italy-official-trip-2024/",
        "title": "<b>Prince</b> and Princess of Wales to make first official Italy trip but unlikely to meet the Pope",
        "description": "It will be the first time they have been hosted there as senior royals and their first joint official visit since Elizabeth II died"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-jet-173917109.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Jet to Tropical Holiday Vacation with <b>Prince</b> Archie and Princess Lilibet",
        "description": "Meghan, 42, and Harry, 39, have squeezed in a few private vacations this year. In September, the couple reportedly stopped in Portugal (where Harry’s cousin Princess Eugenie and her family live part-time) after the 2023 Invictus Games in Germany and quietly visited the Caribbean in October after marking World Mental Health Day in New York City."
    },
    {
        "url": "https://uk.movies.yahoo.com/32-interesting-facts-prince-harry-173045625.html",
        "title": "32 interesting facts about <b>Prince Harry</b>",
        "description": "Prince Harry may no longer be an official member of the royal family, but there&#39;s still lots to know about the fifth-in-line to the throne... For decades, Prince Harry – formerly the Duke of Sussex – was one of the most popular members of the British royal family."
    },
    {
        "url": "https://www.thetimes.co.uk/article/take-the-literary-quiz-of-2023-from-prince-harry-to-zadie-smith-35jz9bl88",
        "title": "Take the literary quiz of 2023 — from <b>Prince Harry</b> to Zadie Smith",
        "description": "Oh yes, it’s that time of year. Trivia! And what better way to prove your book learning than by answering questions about, err, books. It’s been an interesting year in Literatshire … we’ve had mega-selling cosy crime, one record-busting royal ..."
    },
    {
        "url": "https://www.thesun.ie/royals/11896416/princess-diana-left-out-family-christmas-present-tradition/",
        "title": "Diana ‘left out in the cold’ after buying expensive Xmas gifts for Royals when Charles didn’t tell her about tradition",
        "description": "PRINCESS Diana was “left out in the cold” when Charles didn’t tell her about one major Christmas royal present tradition.  Typically, the royals exchange “gag gifts” on Christmas Eve –"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/who-will-attend-royal-christmas-day-church-service-sandringham-b1048823.html",
        "title": "Who will attend the royal Christmas Day church service at Sandringham this year?",
        "description": "The King and Queen will attend the Christmas Day morning service at Sandringham Church, Buckingham Palace said this week. The pair will on Monday (December 25) march together with other royal family members."
    },
    {
        "url": "https://www.dailyrecord.co.uk/newsletter/newsletter-entertainment/meghan-markle-deliberately-distancing-prince-31736440",
        "title": "Meghan Markle &#39;deliberately distancing&#39; from <b>Prince Harry</b> may bring &#39;big change&#39;",
        "description": "A royal expert has weighed in on the Duchess of Sussex supposed strategy for her &#39;own brand&#39;. An expert has weighed in on Meghan Markle&#39;s apparent ploy to distance herself from husband Harry - and it may be about to pay off."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848467/prince-harry-meghan-markle-brand-failure",
        "title": "<b>Prince Harry</b> and Meghan branded &#39;Harvard case study&#39; on &#39;ultimate brand buzz failure&#39;",
        "description": "Prince Harry and Meghan Markle have been torn apart in a recent US editorial as their successes - or lack of - are ridiculed."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-had-202715593.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Had a Very Tropical Holiday",
        "description": "They were spotted with Lili and Archie in Zapotal, Nandayure, and Guanacaste."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-might-need-to-promote-these-two-unsung-heroes-of-the-royal-family-according-to-expert_art20550.html",
        "title": "King Charles might need to promote these two &#39;unsung heroes&#39; of the Royal Family, according to expert",
        "description": "As 2023 ends and King Charles’ first year as monarch is over, a royal expert believes some changes need to be made. Do you agree with Richard"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-roared-meghan-markles-31735235.amp",
        "title": "<b>Prince Harry</b> &#39;roared&#39; at Meghan Markle&#39;s unique royal-inspired Christmas present",
        "description": "Prince Harry recalled how he &#39;roared&#39; at Meghan Markle&#39;s unique royal-inspired Christmas present back in 2020, which is when they spent the holidays in California"
    },
    {
        "url": "https://goss.ie/la-showbiz/prince-harry-and-meghan-markle-set-for-a-year-of-redemption-as-they-consider-relocating-363422",
        "title": "<b>Prince Harry</b> and Meghan Markle set for a ‘year of redemption’ as they consider relocating",
        "description": "Prince Harry and Meghan Markle are reportedly hoping 2024 will be their “year of redemption”, as they’re considering a big move to Los Angeles."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/509992/royals-chic-skiwear-diana-kate-eugenie/",
        "title": "Royals in chic skiwear: Princess Diana, Princess Kate, Princess Eugenie &amp; more",
        "description": "If there&#39;s anyone that truly gets the meaning of &#39;alpine chic&#39;, it&#39;s the royals. Every year, the world&#39;s most famous families pack their finest salopettes and head to the likes of Klosters, Lech, and Verbier to hit the slopes in style on their skiing holidays."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-harrys-new-strategy-blown-31734822",
        "title": "Meghan and <b>Harry</b>&#39;s new strategy &#39;blown out of water&#39; by explosive Endgame aftermath",
        "description": "The Duke and Duchess of Sussex had been trying to keep their heads down and focus on rebranding their image when Omid Scobie released Endgame and opened a fresh new royal feud."
    },
    {
        "url": "https://www.ok.co.uk/royal/booze-rule-royal-family-always-31733730",
        "title": "The booze rule that the Royal Family always follow even at Christmas",
        "description": "Tis&#39; the season to be jolly, but members of the Royal Family will have a booze rule to follow, despite their love of a pint and several wines on offer during Christmas Day"
    },
    {
        "url": "https://www.thesun.ie/sport/11893536/prince-william-aston-villa-training-emery/",
        "title": "Inside <b>Prince</b> William’s love of Aston Villa, from calling aces by nicknames to watching training and ‘going crazy’ at TV",
        "description": "PRINCE WILLIAM is an avid Aston Villa fan who goes crazy watching matches and regularly speaks to players. The Prince of Wales revealed he chose to support the club when he was younger as they"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-has-failed-making-31732708",
        "title": "Meghan Markle &#39;has failed at making money and finding role despite <b>Prince Harry</b> finding his&#39;",
        "description": "The past 12 months have been filled with many ups and downs for Prince Harry and Meghan Markle, and one royal expert believes one half of the par has fared better than the other"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25139120/prince-harry-and-meghan-hoping-year-of-redemption/",
        "title": "Meghan Markle and <b>Harry</b> plotting ‘year of redemption’ after tough 2023 – and may even move as duchess eyes ‘big deal’",
        "description": "<b>PRINCE Harry</b> and Meghan Markle are hoping for a “year of redemption” after a tough 2023, sources have claimed. The Duke and Duchess of Sussex were crowned the “biggest losers” of Hollywood earlier this month - but are looking to turn it all around ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-meghan-markle-seen-161800909.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Seen on Vacation With Kids in Costa Rica",
        "description": "This past week, <b>Prince Harry</b> and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet. The family stopped by Zapotal, Nandayure, and Guanacaste, CRHoy.com reports, staying from December 14 to December 20."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/logan-paul-responds-south-park-utterly-savage-prime-spoof-20013817/?ico=trending-post-strip_item_3",
        "title": "Logan Paul has very extra response to South Park’s savage Prime spoof",
        "description": "Some fans predicted he might want to take action against the likeness. <b>Prince Harry</b> and Meghan Markle have also been roasted by the show this year (Picture: Comedy Central) However, despite being the subject of ridicule, both Logan and KSI – who launched ..."
    },
    {
        "url": "https://uk.style.yahoo.com/just-got-first-look-prime-120500974.html",
        "title": "We just got our first look at Prime Video&#39;s The Idea of You, and we&#39;re obsessed",
        "description": "And so, this is everything you need to know about The Idea of You, including its rumoured <b>Harry</b> Styles inspiration ... You&#39;ll most likely recognise Nicholas from his role as <b>Prince</b> Henry in Prime Video&#39;s Red, White and Royal Blue. Ella Rubin will be ..."
    },
    {
        "url": "https://www.hellomagazine.com/homes/510003/charles-spencer-ethereal-glimpse-princess-diana-resting-place/",
        "title": "Charles Spencer shares &#39;ethereal&#39; glimpse at Princess Diana&#39;s resting place ahead of Christmas",
        "description": "The 59-year-old also captured the poignant shrine which has been erected as a tribute to <b>Prince Harry</b> and <b>Prince</b> William&#39;s mother. The beautiful temple, which is located just opposite Oval Lake, is accessible to the public where visitors typically leave ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/whats-on/food-drink-news/went-christmas-dinner-hogwarts-great-28318450",
        "title": "I went for Christmas dinner in Hogwarts&#39; Great Hall and it was the most magical experience",
        "description": "And as we arrived, I couldn&#39;t believe my eyes. In the first room it had been decorated exactly like the Slug Club in <b>Harry</b> Potter and the Half Blood <b>Prince</b>. Green drapes, red lanterns hanging from trees. But the magic didn&#39;t stop there. As we walked ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-meghan-markles-new-31732478",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s new strategy &#39;blown out of water&#39; by explosive book, expert claims",
        "description": "Prince Harry and Meghan Markle&#39;s attempts to reshape the narrative around them had been working but were derailed by the publication of bombshell book, Endgame, according to a royal expert"
    },
    {
        "url": "https://www.heart.co.uk/news/royals/king-charles-gives-bizarre-christmas-gift-to-staff/",
        "title": "King Charles gives &#39;bizarre&#39; Christmas gift to staff which he slips into their lockers",
        "description": "According to one of King Charles III&#39;s former employees, the monarch likes to give his staff quirky presents during the festive season. Grant Harrold, who worked as a butler at Highgrove for seven years, told The Mirror about the interesting gifts he had received from the King."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509903/king-charles-thoughts-not-spending-christmas-grandchildren-prince-archie-princess-lilibet/",
        "title": "King Charles&#39; thoughts on not spending &#39;hectic&#39; Christmas with grandchildren <b>Prince</b> Archie and Princess Lilibet",
        "description": "During a chat with HELLO!, Ingrid Seward, royal author and editor-in-chief of Majesty Magazine, confessed that the King may be &quot;relieved&quot; not to spend Christmas with Prince Harry and his family as the day tends to be pretty &quot;hectic&quot; and he won&#39;t be able to give his full attention to them."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/logan-paul-responds-south-park-utterly-savage-prime-spoof-20013817/?ico=mosaic_tag",
        "title": "Logan Paul has very extra response to South Park’s savage Prime spoof",
        "description": "Logan Paul has tried to get his own back on South Park after the show utterly destroyed him with their Prime energy drink spoof. In the latest episode of the long running show, the controversial YouTuber and current WWE United States Champion became their latest target in an absolutely savage parody."
    },
    {
        "url": "https://www.ibtimes.co.uk/mike-tindall-reveals-his-cheeky-nickname-prince-william-1722343",
        "title": "Mike Tindall Reveals His Cheeky Nickname For <b>Prince</b> William",
        "description": "Mike Tindall shares a close bond with his cousin-in-law Prince William, so much so that he is not afraid to call him with a rather cheeky nickname and reveal it to the public."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67763074.amp",
        "title": "King Charles jokes about &#39;sausage fingers&#39; with <b>Prince</b> William in Coronation film",
        "description": "King Charles III joked about having &quot;sausage fingers&quot; with his son Prince William during rehearsals for the Coronation, a behind-the-scenes BBC documentary has captured. The affectionate television portrait of the King reveals a playful and warm relationship with his son."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/westminster-abbey-king-archbishop-prince-pep-b1128640.html",
        "title": "PA photographers choose their top pictures of 2023",
        "description": "A new King was crowned in a year of huge events captured by photographers at the PA news agency. Here they choose their favourite images of 2023 and the stories behind them: Victoria Jones captured the moment King Charles was crowned by the Archbishop of Canterbury Justin Welby in Westminster Abbey. The images were shared around the world."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-meghan-markle-seen-161800909.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Seen on Vacation With Kids in Costa Rica",
        "description": "Prince Harry and Meghan Markle enjoyed some time vacationing in Costa Rica with their children, Archie and Lilibet, visiting Zapotal, Nandayure and Guanacaste."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royals-christmas-traditions-charles-camilla-b2468315.html",
        "title": "What traditions does the royal family have for Christmas?",
        "description": "The traditions begin the week before Christmas, when the family holds an annual luncheon. The affair is for extended members of the family and it’s held at Buckingham Palace. The same luncheon was held last year by Charles and Camilla, only it was at Windsor Castle."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-christmas-card-2023-b2468302.html",
        "title": "The best and worst royal Christmas cards over the years",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12891163/meghan-markle-prince-harry-winter-trip-costa-rica.html",
        "title": "Life&#39;s a beach for <b>Prince Harry</b> and Meghan Markle as they catch some winter sun jetting to Costa Rica on family break to enjoy paradise sands and rainforests",
        "description": "Harry and Meghan were seemingly spotted walking through the trees and riding in a golf buggy having reportedly arrived at the popular holiday destination on December 14."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/best-memes-moments-2023-104531400.html",
        "title": "The Best Memes And Moments Of 2023",
        "description": "From Rihanna’s Super Bowl performance to girl dinner and girl math, the year brought us dozens of hilarious, fun and relatable things to obsess over on the internet."
    },
    {
        "url": "https://www.nwemail.co.uk/news/national/uk-today/23997886.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to <b>Prince Harry</b>",
        "description": "2023 was a big one! But how much do you actually remember happening? Take our epic end-of-the-year quiz to find out. Big Brother returned, Eurovision came to the UK, the Beatles released a new song and a new King was crowned. Did Billy Joel write 2023 ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/21/south-park-eviscerates-logan-paul-prime-energy-drinks-20010249/?ico=trending-module_author_sabrina-barr_item-5",
        "title": "South Park eviscerates Logan Paul and his Prime energy drinks in savage takedown",
        "description": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video South Park has never been a show to shy away from ..."
    }
]