[
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/17/double-whammy-health-problems-blow-to-royal-hopes/",
        "title": "Double whammy of King and Princess’s health problems hits hopes of royal ‘annus mirabilis’",
        "description": "Prince of Wales will also be sidelined as he helps his wife convalesce and looks after children, leaving slimmed-down ‘Firm’ badly stretched"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856775/prince-harry-aviation-prince-philip-grave",
        "title": "<b>Prince Harry</b>&#39;s &#39;Legend of Aviation&#39; award slammed as an &#39;insult&#39; to <b>Prince</b> Philip&#39;s legacy",
        "description": "Prince Philip would be &quot;rotating in his grave&quot; over his grandson, Prince Harry&#39;s new award, a columnist writes."
    },
    {
        "url": "https://pressgazette.co.uk/news/reach-ceo-jim-mullen-2024/",
        "title": "Reach boosted by <b>Prince Harry</b> trial result and end of pension deficit says CEO",
        "description": "Reach chief executive Jim Mullen has told staff cuts are over Prince Harry trial result plus pension deficit cuts deliver certainty."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-looks-angry-hes-31899344",
        "title": "<b>Prince Harry</b> looks &#39;angry&#39; as he&#39;s spotted running to let off steam amid baby name drama",
        "description": "Prince Harry and Meghan Markle are involved in more Royal Family drama, with reports suggesting Queen Elizabeth was &#39;furious&#39; when they named their daughter after her"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-william-kate-middletons-olive-31896393",
        "title": "<b>Prince</b> William and Kate Middleton&#39;s &#39;olive branch to <b>Harry</b> and Meghan&#39; after emotional night",
        "description": "According to a new biography of King Charles, in the days after the late Queen&#39;s death, the Prince and Princess of Wales were forced to come together for an emotional night at Buckingham Palace where"
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-queen-was-upset-with-harry-and-meghan-over-lilibet-i-dont-believe-it-9kcrs9735",
        "title": "The Queen was upset with <b>Harry</b> and Meghan over Lilibet? I don’t believe it",
        "description": "Another week and <b>Harry</b> and Meghan, the Duke and Duchess of Sussex ... (And, as a “royal source” has confirmed, “If it’ll distract from <b>Prince</b> Andrew, go for it.”) They’re in hot water this week for naming their daughter Lilibet, as a tribute ..."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12976113/RICHARD-KAY-double-blow-King-Charles-Princess-Kates-medical-treatment-send-collective-shiver-spines.html",
        "title": "RICHARD KAY: The double blow of King Charles and our future Queen Kate&#39;s medical treatment leaves the nation reeling... it sends a shiver down our spines and shows how ...",
        "description": "Perhaps her greatest quality is a steadfast stability. Never has that been more important than at the start of a reign bedevilled by the twin threats posed by a bitter <b>Prince Harry</b> and scandalous <b>Prince</b> Andrew. And it is because so much seems to ride on ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/the-king-kensington-palace-louis-princess-of-wales-prince-of-wales-b2480527.html",
        "title": "Kate ‘doing well’ in hospital as she begins recovery after abdominal surgery",
        "description": "The Princess of Wales remains in hospital after abdominal surgery, with sources saying she is “doing well” but will spend up to three months recovering. Kate was admitted on Tuesday for the successful, planned procedure but is expected to stay in the private London Clinic for 10-14 days before returning to her Adelaide Cottage home in Windsor."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/john-travolta-pushed-prince-harrys-31906401",
        "title": "John Travolta pushed for <b>Prince Harry</b>&#39;s &#39;living legend&#39; award and Hall of Fame induction",
        "description": "The Hollywood icon, 69, was one of the &quot;biggest supporters&quot; for the Duke Of Sussex being honoured at Friday&#39;s event during the selection process among existing honourees and committee members"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/princess-anne-denies-claims-tried-31906404",
        "title": "Princess Anne denies claims she tried to block <b>Prince Harry</b> at royal coronation",
        "description": "Princess Anne held the role of Gold-Stick-In-Waiting at her brother King Charles&#39; coronation last year, with her tall feathered hat inadvertently blocking Prince Harry&#39;s view at the event"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12975285/Why-Prince-Harry-jogging-beanie-puffer-coat-Duke-following-wife-Meghans-footsteps-wrapping-mild-LA-winter-weather.html",
        "title": "Why is <b>Prince Harry</b> jogging in a beanie and puffer coat? How the Duke be following in his wife Meghan&#39;s footsteps by wrapping up in mild LA winter weather",
        "description": "<b>Prince Harry</b> wrapped up warm as he stepped out for a run in Santa Barbara, California on Tuesday morning - despite the temperature reaching highs of 15C (59F) in the region, from as early as 6am. By noon, it had thawed to 17C (62.6F) in the west coast ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1856887/prince-william-princess-kate-very-important-to-monarchy",
        "title": "<b>Prince</b> William and Princess Kate ‘are the monarchy’s big hope&#39;",
        "description": "Prince William and Kate, the Princess of Wales have taken on a leading role in supporting the King and Queen to preserve the Royal Family."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/seven-royals-who-might-stand-28465345",
        "title": "Seven royals who might stand in for King Charles during hospital treatment for enlarged prostate",
        "description": "King Charles could call on fellow members of the Royal Family to step in as he plans to have hospital treatment for an enlarged prostate. The 75-year-old will go into hospital next week for a &#39;corrective procedure&#39;, Buckingham Palace confirmed."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/palace-counsellors-of-state-not-required-while-king-is-in-hospital-108294/",
        "title": "Palace: Counsellors of State not required while King is in hospital",
        "description": "Buckingham Palace has said, however, that it did not anticipate Counsellors of State being necessary when the King is treated in hospital for an enlarged, benign prostate next week."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/from-polo-injuries-to-puffy-digits-the-king-s-health-over-the-years-108293/",
        "title": "From polo injuries to puffy digits: The King’s health over the years",
        "description": "Buckingham Palace said in common with thousands of men each year, the King has sought treatment for an enlarged prostate and his condition is benign."
    },
    {
        "url": "https://uk.style.yahoo.com/heres-prince-william-really-feels-180935396.html",
        "title": "Here&#39;s How <b>Prince</b> William Really Feels About &#39;The Crown,&#39; Claims Royal Biographer&#39;s Book",
        "description": "In excerpts published Tuesday, an anonymous source claimed William favors action movies over prestige TV. Unlike his younger brother <b>Prince Harry</b>, who signed a massive deal with Netflix in 2022, William has actively decided not even to mention “The Crown.”"
    },
    {
        "url": "https://metro.co.uk/2024/01/17/queen-mary-king-frederik-mexican-actress-sparked-a-royal-scandal-20118178/?ico=mosaic_tag",
        "title": "How an afternoon in a humble pub sparked a royal romance – now rocked by scandal",
        "description": "<b>Prince</b> Joachim – dubbed by some as ‘Denmark’s <b>Prince Harry</b>’ – is fifth in line to the throne. The <b>prince</b> relocated to the US in 2023 along with his second wife, Princess Marie, their two children – Count Henrik and Countess Athena – and ..."
    },
    {
        "url": "https://www.plymouthherald.co.uk/news/uk-world-news/seven-royals-approved-stand-king-9041565",
        "title": "The seven royals approved to stand in for King Charles while he&#39;s in hospital",
        "description": "The royals who can stand in for the King are the Queen and the four most senior adults in the line of succession – <b>Prince</b> of Wales, <b>Harry</b>, Andrew and Princess Beatrice. However, only &quot;working members&quot; of the royal family will be called upon to act as ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/kate-princess-of-wales-hospital-abdominal-surgery-william-kensington-palace-b1132967.html?itm_source=Internal&itm_channel=section_trending_article_component&itm_campaign=trending_section&itm_content=5",
        "title": "Princess of Wales &#39;doing well&#39; in hospital after having abdominal surgery, says Palace sources",
        "description": "with <b>Harry</b> making controversial claims about Charles, Camilla, William and Kate in his Netflix documentary and memoir Spare. The princess has thrown herself into charity work since her marriage to <b>Prince</b> William in 2011, focusing on mental health and early ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/kate-charles-kensington-palace-london-william-and-kate-b1133032.html",
        "title": "Royals hit by double health scare as King and Kate need hospital treatment",
        "description": "with <b>Harry</b> making controversial claims about Charles, Camilla, William and Kate in his Netflix documentary and memoir Spare. William’s former university flatmate has carefully carved out her charity work since marrying the <b>prince</b> in 2011 and becoming an ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-suffer-31892890",
        "title": "Meghan Markle and <b>Prince Harry</b> suffer &#39;devastating&#39; snub at Emmy Awards",
        "description": "<b>Prince Harry</b> and Meghan Markle are moving onto bigger and better things after their brutal Emmy Award snub. The Duke and Duchess of Sussex made a comeback to Hollywood in 2022 with their bombshell Netflix documentary series, <b>Harry</b> &amp; Meghan. The shocking ..."
    }
]