[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-popularity-31987422",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s popularity soars in US as fans &#39;forget&#39; about past",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s popularity in the US is on the rise, despite family fallouts and controversy. After their move to America, their popularity has been a bit of a rollercoaster, but it&#39;s currently on the up. Their popularity soared after ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghans-jealousy-king-31986936",
        "title": "<b>Prince Harry</b> and Meghan&#39;s &#39;jealousy&#39; if King Charles decides to abdicate to <b>Prince</b> William",
        "description": "As the monarch recovers from his surgery in hospital, commentator Peter Lloyd called on King Charles to abdicate and leave the throne to his eldest son Prince William"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860645/prince-harry-meghan-markle-gangs-us-town",
        "title": "<b>Prince Harry</b> and Meghan Markle warned criminal gangs targeting their US town",
        "description": "The warning came after a burglary took place just five minutes away from the Duke and Duchess of Sussex&#39;s home in Montecito, California."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1860533/royal-family-live-prince-harry-meghan-markle-montecito-burglary",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan Markle&#39;s Montecito home targeted by thieves",
        "description": "Houses just down the road from Prince Harry and Meghan Markle&#39;s home have been hit by a gang of safe-cracking burglars in the area."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12942743/Disaster-Harry-Britain-Afghan-tour-leaked.html",
        "title": "It was a disaster for <b>Harry</b> when he was rushed back to Britain after his Afghan tour of duty was leaked. But why was his first press conference suddenly cut short with a ...",
        "description": "Prince Harry has never shied away from saying how disappointed he was at having to leave front line military duties in Afghanistan and return to Britain."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/28/a-day-in-the-life-of-workaholic-king-charles/",
        "title": "What does a typical day in the life of ‘workaholic’ King Charles look like?",
        "description": "The King was once described by Princes William and <b>Harry</b> as so obsessed with paperwork that he would ... The Queen also told the BBC programme <b>Prince</b>, Son and Heir that she had tried to encourage her husband to “pace himself” but conceded he is too ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25553684/prince-harry-and-meghan-resort-jamaica-kate-charles-hospital/",
        "title": "Inside the £3,300-a-night resort where ‘<b>Prince Harry</b> and Meghan stayed in Jamaica’ as Kate &amp; Charles recover in hospital",
        "description": "<b>PRINCE Harry</b> and Megan relaxed in a £3,300-a-night luxury resort to attend the Bob Marley premier as Kate and Charles recover in hospital. The Sussexes raised eyebrows after posing with Jamaican leaders on the red carpet of the glitzy One Love event on ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-roared-laughter-meghan-31943406",
        "title": "<b>Prince Harry</b> &#39;roared&#39; with laughter as Meghan gifted him ornament of late Queen before it was binned",
        "description": "Meghan Markle once gave her husband a festive present with a touching nod to his close relationship with his late grandmother which left him in stitches."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13014937/Prince-Harry-Meghan-Markles-security-scare-Sussexes-issued-warning-Montecito-home-amid-spate-burglaries-couple-Jamaica.html",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s security scare: Sussexes are issued warning for Montecito home amid spate of burglaries while couple were in Jamaica",
        "description": "Prince Harry and Meghan Markle have been issued a chilling security warning after a spate of burglaries rocked their ritzy Montecito community."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-demands-action-over-abuse-allegations-at-his-african-charity-d8ks630zw",
        "title": "<b>Prince Harry</b> demands action over abuse claims at his African charity",
        "description": "<b>Prince Harry</b> has “escalated” the “serious allegations” of abuses by guards who work for African Parks, a conservation NGO on whose board of directors the duke serves, after they were made to him in May by Survival International, a human rights ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512219/zara-tindall-prince-harry-sweetest-cousin-moments-revealed/",
        "title": "8 of Zara Tindall and <b>Prince Harry</b>&#39;s sweetest cousin moments",
        "description": "It is no hidden secret that Zara Tindall and her cousin <b>Prince Harry</b> share a very special bond. Having grown up just a stone&#39;s throw away from each other, the royals have since forged a lasting friendship. From a shared interest in rugby to family ski ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghans-lavish-jamaica-31987590",
        "title": "<b>Prince Harry</b> and Meghan&#39;s lavish Jamaica trip costing £3k a night and they flew by private jet",
        "description": "<b>Prince Harry</b> and his wife Meghan Markle have been enjoying a luxury trip to Jamaica this week, following an appearance at the glitzy film premiere of Bob Marley: One Love in Kingston on Tuesday night. The couple walked down the red carpet event together in ..."
    },
    {
        "url": "https://www.nottinghampost.com/news/celebs-tv/harry-meghan-left-visibly-confused-9062412",
        "title": "<b>Harry</b> and Meghan left visibly confused at film premiere",
        "description": "Meghan Markle and <b>Prince Harry</b> attended a glamourous film premiere this week. The pair were caught enduring an awkward moment which left them visibly confused, with the details now being revealed. The Duke and Duchess of Sussex were seen chatting with ..."
    },
    {
        "url": "https://www.comedy.co.uk/features/comedy_chronicles/harry-green/",
        "title": "The Trouble With <b>Harry</b>: The premature exit of <b>Harry</b> Green",
        "description": "<b>Harry</b> Green Says You Are A Magician ... including the British Royal Family and many other VIPs in various locations abroad (<b>Prince</b> Philip would make a point, every time that they met, to ask Green to teach him a new illusion: &#39;One that will really baffle ..."
    },
    {
        "url": "https://www.thesun.co.uk/who/kate-middleton/page/144/?authId=1*9fm0on*_a*WDJ1ZDJaZ3hIT2JSUXBpcWQxM3JXd21pZU9rbFFwR0QyNnUzT1dLYzBRRkJYbW9fM3ZaQ2E1VUltU0lMX29iVg",
        "title": "Kate Middleton",
        "description": "The royal pair now have three children, <b>Prince</b> George, Princess Charlotte, and <b>Prince</b> Louis. <b>Harry</b> &amp; Meghan&#39;s TV interviews overshadow Kate &amp; Wills&#39; tour, say &#39;baffled&#39; aides ©News Group Newspapers Limited in England No. 679215 Registered office ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/27/celebrity-big-brother-signs-kate-middletons-uncle-2024-series-20181836/?ico=more_text_links",
        "title": "Kate, Princess of Wales’s uncle Gary Goldsmith ‘signed up for Celebrity Big Brother’",
        "description": "Gary has reportedly ‘made it clear he will talk about everything and anything’ and is ‘pretty outspoken’ when it comes to <b>Prince Harry</b> and Meghan Markle. The source said: ‘Gary also holds a deep affection for Kate and Wills and will be able to ..."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-andrew-never-counsellors-state-experts-2864094?ITO=newsnow",
        "title": "Why <b>Prince Harry</b> and Andrew won’t be counsellors of state, explained by experts",
        "description": "and <b>Prince Harry</b> quitting his royal role to move to America in 2020. Singling out only working royals excludes the dukes without having to explicitly name them. Dr Craig Prescott, a constitutional law lecturer at Royal Holloway, University of London told i ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/harry-seen-first-time-after-31925875?int_source=nba",
        "title": "<b>Harry</b> seen for first time after royal health announcements as he hits red carpet without Meghan",
        "description": "<b>Prince Harry</b> was seen for the first time since King Charles and Princess of Wales&#39; health announcements were released as he attended the Living Legends of Aviation Awards in Los Angeles solo. There was already speculation that his wife Meghan Markle would be absent from the event which seemed to be confirmed, however, <b>Harry</b> was not alone as he was pictured with <b>Prince</b> Mario Max Schaumburg ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/harrys-swipe-kate-middleton-lowest-31901962?int_source=nba",
        "title": "<b>Harry</b>&#39;s &#39;swipe&#39; at Kate Middleton was &#39;lowest of the low&#39; for <b>Prince</b> William",
        "description": "<b>Prince Harry</b>&#39;s Netflix series, which he released with wife Meghan Markle, caused a huge rift between the brothers - and it wasn&#39;t just because of the criticisms levelled at William and King Charles The Duke and Duchess of Sussex released a six-part ..."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-meghan-markle-warned-164030028.html",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle Warned About Crime Spree In their Montecito Community",
        "description": "The Duke and Duchess of Sussex, <b>Prince Harry</b> and Meghan Markle, were faced with a major security scare following their trip to Jamaica. The couple was reportedly issued a warning about an increase in burglaries in the area where their Montecito home is ..."
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-prince-harry-reportedly-152000299.html",
        "title": "Meghan Markle &amp; <b>Prince Harry</b> Reportedly Hired Barack Obama’s Former Guard to Tackle This Disturbing Occurrence",
        "description": "Meghan Markle and Prince Harry have had quite a few disturbing instances happen to their family, such as many threatening their children, Meghan, and more. Ever since they moved to Montecito, they’ve amped up security,"
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-iii-spends-third-173407185.html",
        "title": "King Charles III spends third day in London hospital after prostate surgery",
        "description": "The king&#39;s daughter-in-law is also currently at the clinic following abdominal surgery. Catherine, Princess of Wales, 42, who is the wife of heir to the throne <b>Prince</b> William is on her 13th day of an expected two-week stay. The king&#39;s announcement has ..."
    },
    {
        "url": "https://www.hellomagazine.com/brides/512220/calista-flockhart-devastating-confession-harrison-ford-plane-accident-aftermath/",
        "title": "Harrison Ford&#39;s wife Calista Flockhart makes devastating confession about aftermath of star&#39;s plane accident",
        "description": "The 59-year-old actress sat down with The New York Times to talk all things life and career, with a large part of that revolving around her marriage to Harrison Ford, which received renewed attention thanks to Ford&#39;s emotional speech at the Critics Choice Awards, where he thanked his wife for her support."
    },
    {
        "url": "https://www.thedailybeast.com/prince-harry-and-meghan-markles-jamaica-trip-misguided-royal-source-says",
        "title": "<b>Harry</b> and Meghan’s Jamaica Trip ‘Misguided,’ Royal Source Says",
        "description": "<b>Prince Harry</b> and Meghan Markle’s photocall with Andrew Holness, the prime minister of Jamaica, was “not what you would call ideal”, according to one royal source speaking to the Times of London. The timing of the Sussexes’ visit as the guests of ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/prince-harry-charity-investigated-rape-torture-allegations/",
        "title": "Charity linked to <b>Prince Harry</b> investigated over allegations of rape and torture",
        "description": "A charity linked to Prince Harry is investigating allegations of rape and torture committed by its park rangers. The Duke of Sussex was president of non-profit African Parks from 2017 until last year, when he was appointed to the organisation’s board of directors."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-king-charles-camilla-royal-family-news-b2486134.html?page=3",
        "title": "Royal news - live: King Charles visited by Queen Camilla after second night in hospital following surgery",
        "description": "Camilla did not answer questions as she left the London Clinic on Friday afternoon."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/rape-torture-beatings-horror-claims-of-abuse-by-rangers-with-prince-harrys-africa-charity/news-story/e4e005260c5a53b536952e78746e446a",
        "title": "‘Rape, torture, beatings’: Horror claims of abuse by rangers with <b>Prince Harry</b>’s Africa charity",
        "description": "An African conservation charity that <b>Prince Harry</b> helps run is facing shocking allegations of beatings, rape and torture of indigenous tribespeople at the hands of its rangers. A charity that <b>Prince Harry</b> helps run is facing shocking allegations of ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/queen-camilla-smiles-king-charles-operation-enlarged-prostate-surgery/",
        "title": "Camilla smiles as she visits King on third day in hospital following successful prostate surgery",
        "description": "<b>Prince</b> William has visited Kate at the London Clinic every day since the surgery on January 16. It is understood that their three children have not joined him at her bedside."
    },
    {
        "url": "https://eng.obozrevatel.com/section-entertainment/news-whats-hard-to-hide-what-the-hands-of-kate-middleton-charles-iii-and-other-royals-say-28-01-2024.html",
        "title": "What&#39;s hard to hide: what the hands of Kate Middleton, Charles III and other royals &quot;say&quot;",
        "description": "She often puts her hand on her husband <b>Prince Harry</b>&#39;s back or just above his wrist to calm him down. With these gestures, Meghan does not dominate her lover, but supports him and hints that he is &quot;her comfort zone.&quot; Since childhood, <b>Prince Harry</b> ..."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-oscars-high-stakes-gamble-1863562",
        "title": "<b>Prince Harry</b> and Meghan Markle Must Take High-Stakes Gamble",
        "description": "<b>Prince Harry</b> and Meghan Markle should take a high-stakes gamble and attend the 96th Academy Awards ceremony in Hollywood this year, presenting them with a &quot;make or break&quot; opportunity, an entertainment expert has told Newsweek. Since sensationally splitting ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152215-prince-harry-promised-positive-response-after-royal-family-had-enough-of-feuding",
        "title": "<b>Prince Harry</b> promised positive response after royal family &#39;had enough&#39; of feuding",
        "description": "Prince Harry was advised to take the leap and contact the royal family despite a fresh claim stating that Prince William will reportedly be &#39;happy&#39; if he went on his life without speaking to"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/international-celebs/harry-and-meghans-jamaican-visit-a-hollywood-affair/",
        "title": "<b>Harry</b> and Meghan’s Jamaican visit: A Hollywood affair",
        "description": "In a whirlwind trip that combined regal charm with Hollywood glamour, <b>Prince Harry</b> and Meghan Markle made headlines during their exclusive visit to Jamaica. The Sussexes, on a mission to court Hollywood power brokers, embarked on a luxurious journey."
    },
    {
        "url": "https://uk.news.yahoo.com/camilla-visits-king-third-time-121734900.html",
        "title": "Camilla visits the King for third time following his enlarged prostate procedure",
        "description": "The Queen has visited the King as he remains in hospital for a third day after undergoing a procedure for an enlarged prostate. Camilla smiled as she arrived at The London Clinic in central London by car just before midday on Sunday."
    },
    {
        "url": "https://www.ibtimes.sg/prince-harry-meghan-unhappy-cheap-seats-bob-marley-movie-premiere-new-video-shows-watch-73257",
        "title": "<b>Prince Harry</b>, Meghan Unhappy With &#39;Cheap Seats&#39; at Bob Marley Movie Premiere, New Video Shows [WATCH]",
        "description": "After the video was shared on X, the Sussexes were mocked for their seating arrangements, with some referring to the seats as the &quot;cheap seats.&quot;"
    },
    {
        "url": "https://www.purewow.com/news/prince-harry-cameron-diaz-rumors",
        "title": "<b>Prince Harry</b> Responds to Old Rumors About Cameron Diaz: &#39;Pure Bollocks&#39;",
        "description": "You can learn more about the affiliate process here. You may have come across a few reports claiming that <b>Prince Harry</b> once flirted with actress Cameron Diaz, but according to the 39-year-old royal, this couldn&#39;t be further from the truth. In his memoir ..."
    },
    {
        "url": "https://www.weeklytimesnow.com.au/news/princess-catherine-has-unwavering-commitment-to-return-to-royal-duties/news-story/89c10adb7e4e9f0ec702a27b330226d3",
        "title": "King Charles’ move to protect Princess Catherine in double health battle",
        "description": "Dr Dunlop told The Mirror “there was something else at play” and it indicated the royals wanted to set boundaries. <b>Prince Harry</b> and Meghan Markle have called King Charles and Catherine, Princess of Wales as they undergo hospital procedures to pass on ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163590/20240128/speculation-over-prince-williams-kingship-and-potential-prince-harry-and-meghan-markles-outrage.htm",
        "title": "Speculation Over <b>Prince</b> William&#39;s Kingship and Potential <b>Prince Harry</b> and Meghan Markle&#39;s Outrage",
        "description": "The British Royal Family, perennial subjects of global fascination, have found themselves at the heart of a renewed debate, this time centered around the potential implications of Prince William&#39;s future ascension to the throne."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-blunt-reply-prince-harry-meghan-requested-staged-photo-with-daughter-lilibet.html/",
        "title": "Queen Elizabeth Had a Blunt Reply for <b>Prince Harry</b> and Meghan When They Requested a Staged Photo With Her and Their Daughter Lilibet",
        "description": "Find out how Queen Elizabeth responded when Prince Harry and Meghan tried to get her to do a photo op with their daughter Lilibet."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1152245-prince-harry-avoids-visiting-ailing-king-charles-in-hospital-for-this-reason",
        "title": "<b>Prince Harry</b> avoids visiting ailing King Charles in hospital for This reason",
        "description": "<b>Prince Harry</b> seemingly avoids visiting his ailing father, King Charles, as royals &quot;typically don&#39;t visit each other in the hospital,&quot; claims a PR expert. As per The Mirror, PR expert Lynn Carratt claimed that the Duke of Sussex may visit his father once he ..."
    },
    {
        "url": "https://www.skynews.com.au/opinion/prince-harry-and-meghan-markle-are-damned-if-they-do-and-damned-if-they-dont/video/14409d7f104990c96ddd689c2a7e8fb5",
        "title": "<b>Prince Harry</b> and Meghan Markle ‘are damned if they do and damned if they don’t’",
        "description": "Daily Mirror Royal Editor Russell Myers says <b>Prince Harry</b> and Meghan Markle “are damned if they do and damned if they don&#39;t” after taking a picture with the Prime Minister of Jamaica during the premiere of ‘Bob Marley: One Love’. The pair made a ..."
    },
    {
        "url": "https://www.skynews.com.au/opinion/prince-harry-and-meghan-set-tongues-wagging-in-surprise-visit-to-jamaica/video/b8b2deee9cebe90046c3338e65836297",
        "title": "<b>Prince Harry</b> and Meghan ‘set tongues wagging’ in surprise visit to Jamaica",
        "description": "Daily Mirror Royal Editor Russell Myers says <b>Prince Harry</b> and Meghan Markle &quot;set tongues wagging&quot; during their surprise visit to Jamaica. The pair made a surprise appearance in Jamaica on Tuesday evening attending the premiere of ‘Bob Marley: One Love’."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-william-prince-harrys-tougher-obstacle-reconciliation-involves-kate-middleton-biographer.html/",
        "title": "<b>Prince</b> William and <b>Prince Harry</b>’s ‘Tougher Obstacle’ to Reconciliation Involves Kate Middleton — Biographer",
        "description": "A big &#39;obstacle&#39; in Prince Harry and Prince William&#39;s reconciliation goes back to what the former said about Kate Middleton in 2023, a biographer says."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-william-uses-seemingly-innocuous-130000733.html",
        "title": "When <b>Prince</b> William Uses This Seemingly Innocuous Word, Princess Kate Knows He’s Angry with Her",
        "description": "The <b>Prince</b> and Princess of Wales have enjoyed a loving relationship for over two decades—but, like any couple, they have their rows from time to time. A royal author claimed, per The Mirror, that William employs a seemingly innocuous word in conversation ..."
    },
    {
        "url": "https://uk.style.yahoo.com/most-glamorous-gorgeous-royal-weddings-135900186.html",
        "title": "The Most Glamorous and Gorgeous Royal Weddings Around the Globe",
        "description": "Then <b>Prince</b> Abdullah bin Al-Hussein met Rania Al-Yassin at a dinner party in January 1993; that June 10, they were married at Zahran Palace. Their wedding ceremony was considered a national holiday and just short of six years later, the couple ascended the ..."
    },
    {
        "url": "https://www.standard.co.uk/culture/tvfilm/gary-goldsmith-celebrity-big-brother-cbb-itv-b1135209.html",
        "title": "Princess of Wales&#39; uncle Gary Goldsmith &#39;signs up for Celebrity Big Brother 2024&#39;",
        "description": "The Duchess of Cambridge&#39;s uncle, Gary Goldsmith, arrives at Westminster Magistrates&#39; Court, London, where he is accused of assault by beating of Julie-Ann Goldsmit It is thought Mr Goldsmith has strong opinions about <b>Prince Harry</b> and Meghan Markle’s US ..."
    },
    {
        "url": "https://collider.com/warner-bros-highest-grossing-movies/",
        "title": "The 10 Highest-Grossing Warner Bros. Movies",
        "description": "The movie earned a total of 24 million during its midnight showing in North America, breaking its own midnight showing record, which was previously held by <b>Harry</b> Potter and the Half-Blood <b>Prince</b>. Part I was praised by critics for its overall performances ..."
    },
    {
        "url": "https://ca.yahoo.com/news/matt-damon-jeff-bezos-prince-070000456.html",
        "title": "Matt Damon, Jeff Bezos, <b>Prince Harry</b> and more... These celebrities all had secret cameos in movies",
        "description": "In these blink-and-you’ll-miss-it cameos, these celebrities have pulled back from their usual place in the limelight to try and go under the radar, but you can’t pull the wool over eagle-eyed viewers’ eyes! Learn which stars have had hidden roles..."
    }
]