[
    {
        "url": "https://uk.news.yahoo.com/king-charles-spotted-smiling-amid-200000189.html",
        "title": "King Charles spotted smiling amid cancer battle after meeting with <b>Prince Harry</b>",
        "description": "After it was revealed the monarch is battling an undisclosed form of cancer, King Charles was spotted smiling amid his health woes after a short meeting with his son Prince Harry."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/06/king-charles-cancer-treatment-prince-william-harry-edward/",
        "title": "As the King begins treatment for cancer he has left <b>Prince</b> William free to put family before Firm",
        "description": "Although they would not use the same phrase as <b>Prince Harry</b>’s “generational pain”, this is a King and <b>Prince</b> mindful that the next generation can do better. When Charles’ own mother became Queen aged 25, when he was three, theirs was a life devoted ..."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-arrives-in-london-after-father-king-charles-iiis-cancer-diagnosis_n_65c250bde4b069b665dceecd",
        "title": "<b>Prince Harry</b> Arrives In London After Father King Charles&#39; Cancer Diagnosis",
        "description": "Buckingham Palace announced Monday evening that the king has begun outpatient treatment for an undisclosed form of cancer."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13052725/Prince-Albert-Monaco-says-Kings-determination-courage-openness-inspirational-sends-warmest-thoughts-prayers-Charles-amid-cancer-diagnosis.html",
        "title": "<b>Prince</b> Albert of Monaco says the King&#39;s &#39;determination, courage and openness&#39; have always been inspirational as he sends his &#39;warmest thoughts and prayers&#39; to Charles amid ...",
        "description": "A smiling King Charles today arrived back at Sandringham after meeting his son <b>Prince Harry</b> for less than an hour in their first face-to-face encounter for nine months. Charles and Queen Camilla were seen waving to crowds as they left Clarence House ..."
    },
    {
        "url": "https://edition.cnn.com/2024/02/06/opinions/king-charles-cancer-diagnosis-royal-family-filipovic/index.html",
        "title": "Opinion: Could King Charles’ cancer diagnosis mend the fissures in the royal family?",
        "description": "The news of of King Charles’ cancer diagnosis should merit all of our sympathy. It could also be a prime moment for the British monarch to reconcile with Prince Harry and his family, writes journalist Jill Filipovic."
    },
    {
        "url": "https://www.itv.com/watch/itv-evening-news/2a4545/2a4545a2109",
        "title": "ITV Evening News",
        "description": "41 mins ago • The latest ITV News headlines - as King Charles meets with <b>Prince Harry</b> 41 mins ago • The latest ITV News headlines - as King Charles meets with <b>Prince Harry</b> 36 mins ago • King Charles pictured following cancer diagnosis after meeting ..."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46662515/king-charles-iii-camilla-london-cancer-treatment/",
        "title": "King Charles III and Queen Camilla Smile As They Head Back Home for His Cancer Treatment",
        "description": "HENRY NICHOLLS//Getty Images The monarch&#39;s youngest son, <b>Prince Harry</b> flew into London yesterday to spend time with him amid his health crisis. <b>Prince</b> William, meanwhile, has taken on further engagements to support his father as he steps back from some of ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/king-charles-cancer-diagnosis-a-look-at-the-top-medical-team-of-a-monarch-who-supports-complementary-medicine/",
        "title": "King Charles cancer diagnosis: A look at the top medical team of a monarch who &#39;supports complementary medicine&#39;",
        "description": "Prof Baum accused the King of &quot;promoting unproven cures for cancer&quot; after he became the British Medical Association&#39;s president in 1982."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-arrives-london-see-190200633.html",
        "title": "<b>Prince Harry</b> Arrives in London to See King Charles",
        "description": "Prince Harry is back in the United Kingdom to see his father, King Charles, following the British monarch&#39;s cancer diagnosis."
    },
    {
        "url": "https://inews.co.uk/news/william-take-on-foreign-visits-king-cancer-2893566?ico=most_popular",
        "title": "William could take on key foreign visits as King receives cancer treatment",
        "description": "King Charles returns to Sandringham on Tuesday after a &#39;brief&#39; meeting with Prince Harry after his 11-hour transatlantic dash"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/live-wales-breaking-news-plus-28576786",
        "title": "Live: Wales breaking news plus weather and traffic updates (Tuesday, February 6)",
        "description": "Hello, and welcome to Wales Online&#39;s live blog for Tuesday, February 6 We will be bringing you all of the latest news from across Wales - whether you&#39;re on the move, at home or at work - as well as the latest traffic and travel."
    },
    {
        "url": "https://www.newsletter.co.uk/news/people/king-charles-seen-in-public-for-first-time-since-cancer-diagnosis-harry-reunited-with-his-father-after-making-transatlantic-dash-4508041",
        "title": "King Charles seen in public for first time since cancer diagnosis; <b>Harry</b> reunited with his father after making transatlantic dash",
        "description": "The King has been seen in public for the first time since his cancer diagnosis as he left Clarence House the day after starting his treatment."
    },
    {
        "url": "https://www.telegraph.co.uk/health-fitness/conditions/cancer/kings-charles-cancer-diagnosis-healthy-lifestyle-homeopathy/",
        "title": "What the King’s healthy lifestyle and love of homeopathy means for his cancer diagnosis",
        "description": "Doctors believe that there are many aspects of the King Charles’s approach to life which will serve him well in his upcoming health battle"
    },
    {
        "url": "https://www.bbc.com/news/uk-68214982",
        "title": "King Charles seen for first time since diagnosis as <b>Prince Harry</b> arrives in the UK",
        "description": "King Charles has been pictured for the first time since his cancer diagnosis was made public as the Duke of Sussex arrived in the UK to visit his father. The King and Queen Camilla were pictured in a car and are now at the royal estate in Sandringham. Prince Harry arrived in London on Tuesday from the US."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13052059/king-charles-leaves-clarence-house-queen-camilla-return-sandringham.html",
        "title": "Charles arrives at Sandringham after meeting <b>Harry</b> for less than an hour: Smiling King and Camilla leave London for Norfolk by helicopter after monarch spoke to son for 45 ...",
        "description": "Charles and Queen Camilla were seen waving to crowds as they left the royal residence in London in the back of an official car."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-hidden-message-last-32062705",
        "title": "King Charles&#39; &#39;hidden message&#39; in last photos before cancer diagnosis was announced",
        "description": "King Charles has been diagnosed with cancer, with the news being announced on Monday evening alongside a new photo of the monarch - and there was a reason behind the choice of image"
    },
    {
        "url": "https://www.heraldscotland.com/news/12010131.princes-leap-into-action-in-bid-to-keep-press-at-bay/",
        "title": "Princes leap into action in bid to keep press at bay",
        "description": "The Princess Royal&#39;s 17-year-old daughter, Zara Phillips, hopes to shake off the flu in time to join the Royal party. Later, Prince Harry went tobogganing while the Prince of Wales, who has to be mindful of previous back injuries, preferred to ski."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/06/king-charless-cancer-diagnosis-sets-buckingham-palace-machinery-into-motion?ref=mc.news",
        "title": "King Charles’s cancer diagnosis sets Buckingham Palace machinery into motion",
        "description": "The legislation added Anne and Edward to the list but stopped short of removing Andrew and <b>Harry</b>. However, the latter two would ... in the absence of the monarch – by Charles, then <b>Prince</b> of Wales, and William, then Duke of Cambridge, acting in their ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863818/prince-harry-king-charles-meeting-clarence-house-cancer-diagnosis",
        "title": "<b>Prince Harry</b>&#39;s &#39;brief 45-minute meeting&#39; with King Charles after racing to Clarence House",
        "description": "Prince Harry met King Charles III at Clarence House for a &quot;short 45-minute meeting&quot; earlier today. Buckingham Palace confirmed that the King had been diagnosed with &quot;a form of cancer&quot; on February 5."
    },
    {
        "url": "https://www.bbc.com/news/uk-68219415",
        "title": "<b>Prince</b> William can show his own version of royalty",
        "description": "Prince William seems to promise a modern, relaxed version of royalty. He&#39;s as comfortable with a tie-less monarchy as with ceremonial outfits. Perhaps more so. On visits he can look like a dad at a private-school charity event - wealthy but progressive, driven by a social conscience, with good jeans as well as good genes."
    },
    {
        "url": "https://news.sky.com/story/king-charles-cancer-latest-king-and-queen-spotted-as-they-leave-buckingham-palace-by-helicopter-for-sandringham-13064923",
        "title": "King Charles cancer latest: King and Queen leave Buckingham Palace by helicopter; brothers have no plan to meet while <b>Harry</b> in UK",
        "description": "King Charles and Queen Camilla have been spotted for the first time since his cancer diagnosis was disclosed. They have now left London - after a visit from Prince Harry - by helicopter for Sandringham."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863832/meghan-markle-prince-harry-king-charles-latest",
        "title": "Expert claims <b>Prince Harry</b> and King Charles&#39;s relationship &#39;depends on Meghan Markle&#39;",
        "description": "Angela Levin warned that it could be Meghan Markle that has an impact on whether Prince Harry makes an effort to re-enter the royal fold in the future."
    },
    {
        "url": "https://graziadaily.co.uk/celebrity/news/what-was-nostradamus-prediction-about-king-charles/",
        "title": "What Was Nostradamus’ Prediction About King Charles?",
        "description": "In fact, others are turning their heads to the possibility of <b>Prince Harry</b>. Author Mario Reading, a leading expert on Nostradamus, reinterpreted the Frenchman’s cryptic poems – laying down his interpretation of the prophecy. He wrote, ‘<b>Prince</b> Charles ..."
    },
    {
        "url": "https://news.sky.com/story/harry-visits-clarence-house-to-see-father-day-after-kings-cancer-diagnosis-revealed-13065249",
        "title": "<b>Harry</b> visits Clarence House to see father - day after King&#39;s cancer diagnosis revealed",
        "description": "The King&#39;s younger son flew in from Los Angeles, where he lives with his wife Meghan and two children. He moved to the US in 2020 after quitting royal duties and falling out with his family."
    },
    {
        "url": "https://inews.co.uk/news/royal-family-tree-king-charles-2893211?ico=related_article_inline",
        "title": "Royal family tree: King Charles’s children, siblings and grandchildren explained",
        "description": "<b>Prince Harry</b> has reportedly arrived back in the UK to be with his father, following the King’s recent cancer diagnosis. Charles III is already receiving treatment for the illness, the specific details of which have not been disclosed. It has been ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/prince-harrys-flight-kings-side-28582306",
        "title": "<b>Prince Harry</b>&#39;s flight to King&#39;s side sparks reconciliation hopes",
        "description": "He was left barely on speaking terms with his two closest relatives – Charles and the Prince of Wales. Harry’s controversial memoir Spare further damaged his ties with his father and brother, making claims William physically attacked him,"
    },
    {
        "url": "https://metro.co.uk/2024/02/06/bbc-reveals-presenters-wore-black-reporting-king-charles-cancer-20231339/?ico=trending-post-strip_item_2",
        "title": "BBC clears up why presenter appeared to wear black reporting on King Charles’ cancer",
        "description": "while <b>Prince Harry</b> is travelling back to the UK to visit his father. But as we find more about royal protocol in this situation as the King undergoes treatment, some were also left wondering if Hill was wearing black as part of the BBC’s protocol."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-dorset-68216463.amp",
        "title": "Cancer centre King helped establish now at forefront of research",
        "description": "Live: King spends night at home after starting cancer treatment What does it mean for William, <b>Harry</b> and the other royals? <b>Prince Harry</b> to visit King Charles in coming days What do we know about the King&#39;s cancer diagnosis? Residents in Poundbury have been ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/prince-harry-pictured-first-time-28581618",
        "title": "<b>Prince Harry</b> pictured for first time since King Charles&#39; cancer diagnosis",
        "description": "King Charles and Prince Harry have been seen for the first time since the monarch&#39;s cancer diagnosis was made public . The monarch was spotted arriving at Buckingham Palace to catch the royal helicopter to Sandringham."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-no-plans-reunite-162141093.html",
        "title": "<b>Prince Harry</b> Has &#39;No Plans&#39; to Reunite with Brother <b>Prince</b> William During U.K. Visit, Says Source",
        "description": "The Duke of Sussex met with King Charles amid his cancer news, and the Prince of Wales has been helping Princess Kate recover from recent surgery"
    },
    {
        "url": "https://www.thetimes.co.uk/article/18a235f0-f34d-43ae-9490-27098414b0be",
        "title": "<b>Prince Harry</b> visits King Charles with no plan to see William",
        "description": "The Prince of Wales has not met his brother the Duke of Sussex since he arrived in the UK and has no intention of doing so. Palace aides have made it clear that there is “nothing in the diary” scheduled between Prince William and his younger brother."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25762984/prince-william-harry-visit-uk-king-charles/",
        "title": "<b>Prince</b> William has ‘NO plans’ to see <b>Harry</b> during his UK trip and has ‘other priorities’ while caring for Princess Kate",
        "description": "PRINCE William has “no plans” to see Harry during his trip to the UK, it is alleged. The Duke of Sussex landed from Los Angeles this morning and paid a 45 minute visit to"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68214982?at_campaign=KARANGA&at_medium=RSS",
        "title": "<b>Prince Harry</b> lands back in the UK to visit King Charles after cancer news",
        "description": "Prince Harry arrived in London on Tuesday after an overnight flight from Los Angeles. The King, 75, informed both of his sons about his diagnosis before Buckingham Palace announced he would step back from public duties for treatment."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-prince-harry-visit-charles-32061087",
        "title": "Downcast <b>Prince Harry</b> pictured for first time as he dashes to King Charles&#39; side",
        "description": "Prince Harry has been pictured in the UK after flying back to visit his father, King Charles, following his shock cancer diagnosis, whilst it&#39;s believed that Meghan Markle has remained in the US"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-visit-holds-importance-32059346?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b>&#39;s visit holds &#39;importance&#39; for King Charles as he starts cancer treatment",
        "description": "King Charles will soon be reunited with his son <b>Prince Harry</b> and it&#39;s thought the reunion is &quot;important&quot; to the dad of two. Buckingham Palace announced that King Charles has cancer on Monday, saying in a statement that through tests, it was identified that ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-wont-seeing-brother-180601659.html",
        "title": "<b>Prince Harry</b> Won&#39;t Be Seeing His Brother William During His Trip Home",
        "description": "Sources close to the royal family say that there are &quot;no plans&quot; for the brothers to reunite. Shaun Botterill/Getty Images <b>Prince Harry</b> is already in London to spend some time with his father, King Charles, after he shared that he had been diagnosed with ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/will-camilla-king-charles-passes-20232809/?ico=trending-module_tag_prince-charles_item-3",
        "title": "What will be Queen Camilla’s title when William becomes King?",
        "description": "which would be his younger brother <b>Prince Harry</b>. Until 2013, when the Act of Succession was changed, males were higher up the line of succession than females, even if they were younger than them. This is why Princess Anne is lower in the line of succession ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-concerns-over-stay-32057389.amp",
        "title": "<b>Prince Harry</b> concerns over where to stay after King Charles denied use of Windsor Castle",
        "description": "<b>Prince Harry</b> is flying to London after his father King Charles told him in a private phone call he had been diagnosed with cancer, but wife Meghan Markle will be staying in California <b>Harry</b> had to stay in a hotel last year after being snubbed by his family ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-arrives-clarence-house-150836749.html",
        "title": "<b>Prince Harry</b> arrives at Clarence House to see King",
        "description": "Barry John, who has died aged 79, is regarded as one of the finest fly-halfs ever to play rugby. The elusiveness of his running and the pinpoint accuracy of his kicking have persuaded many judges that among the rich pantheon of great Welsh No 10s of the past century – Cliff Jones, Cliff Morgan, David Watkins, Phil Bennett and Jonathan Davies – the thin man from Cefneithin deserves the crown."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/king-charles-cancer-prince-william-prince-harry-prince-of-wales-duke-of-sussex-b1137523.html",
        "title": "William and <b>Harry</b> have &#39;no plans&#39; to see each other during Duke of Sussex&#39;s visit to UK to see King",
        "description": "<b>Prince Harry</b> landed at Heathrow Airport at lunchtime on Tuesday on a flight from Los Angeles before travelling in a convoy of SUVs to central London. He was pictured arriving at the gates of the royal residence at around 2.42pm. Sources close to <b>Harry</b> ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/first-pictures-show-prince-harry-28580929",
        "title": "First pictures show <b>Prince Harry</b> as he arrives in UK after King Charles cancer diagnosis",
        "description": "The duke cleared his diary and made the journey alone, with the Duchess of Sussex and their children <b>Prince</b> Archie and Princess Lilibet remaining at home in California. Royal watchers have expressed hopes that <b>Harry</b> and Charles will be reconciled in the ..."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/poll-should-prince-harry-return-9082073",
        "title": "Poll: Should <b>Prince Harry</b> return to Britain and Royal life?",
        "description": "<b>Harry</b>’s last appeared alongside the Windsors at the King’s coronation, but hurried home immediately afterward to mark his son <b>Prince</b> Archie’s fourth birthday. The duke’s allegations against his family appeared unrelenting with his Oprah interview ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/clarence-house-charles-rishi-sunak-buckingham-palace-norfolk-b2491562.html",
        "title": "King seen in public for first time since cancer diagnosis after <b>Harry</b> reunion",
        "description": "It is understood the <b>Prince</b> of Wales has no plans to meet with <b>Harry</b>. William is juggling looking after his wife, the Princess of Wales, with caring for their children after Kate’s abdominal surgery. Dressed in a suit and tie and smart overcoat ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/minister-church-near-balmoral-estate-32063030",
        "title": "Minister of church near Balmoral estate sends best wishes to King after cancer diagnosis",
        "description": "Join the Daily Record&#39;s WhatsApp community here and get the latest news sent straight to your messages. <b>Prince Harry</b> was also pictured arriving back in the UK at London Heathrow earlier today after receiving the news of his fathers diagnosis. It is ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12150144/how-is-king-charles-latest-health-updates/",
        "title": "How is King Charles? Latest health updates",
        "description": "The King&#39;s family have rallied around him, with his youngest son <b>Prince Harry</b> flying in from America to be by his father&#39;s side. It was announced that the King was to have treatment for a benign enlarged prostate. A statement read: &quot;In common with ..."
    },
    {
        "url": "https://www.yahoo.com/news/prince-harry-arrives-uk-king-195300929.html",
        "title": "<b>Prince Harry</b> arrives in UK after King Charles’ cancer diagnosis",
        "description": "<b>Prince Harry</b> has returned to the United Kingdom, racing from the California home he shares with his wife, Meghan, The Duchess of Sussex, to be with his father, King Charles III, who was recently diagnosed with cancer. The Duke of Sussex reportedly touched ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-wont-seeing-brother-180601659.html",
        "title": "<b>Prince Harry</b> Won&#39;t Be Seeing His Brother William During His Trip Home",
        "description": "Sources close to the royal family say that there are &quot;no plans&quot; for the brothers to reunite."
    },
    {
        "url": "https://inews.co.uk/news/royal-family-tree-king-charles-2893211?ITO=msn",
        "title": "Royal family tree: King Charles’s children, siblings and grandchildren explained",
        "description": "The King has two children, both by his first wife, Lady Diana Spencer. He married Diana in St Paul’s Cathedral in 1981, and the pair divorced in 1996. She died in a car crash in Paris a year later."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-bobby-robsons-wife-joins-28579061",
        "title": "Sir Bobby Robson&#39;s wife joins cancer charities in wishing King Charles well after diagnosis",
        "description": "North East cancer charities advised anyone with concerns about changes to their body to seek medical advice immediately"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/06/king-charles-cancer-brave-what-comes-next",
        "title": "The king is brave to be open about his cancer, but talk about what comes next will now begin",
        "description": "We have crossed a line: from this day on, the scrutiny and speculation will be intense, says author and former Guardian royal correspondent Stephen Bates"
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/harrys-flight-kings-side-sparks-9082511",
        "title": "<b>Harry</b>&#39;s flight to King&#39;s side sparks hopes of reconciliation",
        "description": "There are hopes that Harry may make peace with both his father and his brother"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-william-no-plans-28582270",
        "title": "<b>Prince Harry</b> and William have &#39;no plans&#39; to see each other after King Charles cancer diagnosis",
        "description": "Prince William and Prince Harry have &quot;no plans&quot; to see other while the Duke of Sussex is back in the UK to visit his father King Charles amid his cancer battle."
    },
    {
        "url": "https://www.lbc.co.uk/news/no-plans-reconciliation-princes-william-harry-charles-cancer/",
        "title": "&#39;No plans for reconciliation&#39; between William and <b>Harry</b> as brothers &#39;won&#39;t meet&#39; after King Charles&#39; cancer diagnosis",
        "description": "There are no plans for Princes William and <b>Harry</b> to meet after the Duke of Sussex flew back to the UK to see his father following the news of his cancer diagnosis. <b>Prince Harry</b> cleared his schedule to fly back to the UK today after learning about his ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863830/prince-william-prince-harry-piers-morgan-king-charles-cancer",
        "title": "<b>Prince</b> William would &#39;rather shoot himself in the foot&#39; than see <b>Harry</b> blasts Piers Morgan",
        "description": "Piers Morgan&#39;s comments come after Prince Harry landed in the UK following King Charles&#39;s announcement that he had been diagnosed with cancer."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/06/king-charless-cancer-diagnosis-sets-buckingham-palace-machinery-into-motion?ref=upstract.com",
        "title": "King Charles’s cancer diagnosis sets Buckingham Palace machinery into motion",
        "description": "Procedures and protocol will ensure the business of ruling goes on as king has treatment for disease"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512883/king-charles-siblings-everything-to-know/",
        "title": "Meet King Charles&#39; siblings - inside relationship with brothers and sister",
        "description": "On Monday, it was confirmed that King Charles had been diagnosed with cancer. The monarch will have plenty of support from his family, including his wife, Queen Camilla, his sons, Prince William and Prince Harry, and his siblings, Princess Anne, Prince Andrew and Prince Edward."
    },
    {
        "url": "https://www.cornwalllive.com/news/uk-world-news/what-happens-king-dies-operation-9082407",
        "title": "What happens if King dies - Operation Menai Bridge is the plan in case King Charles passes away",
        "description": "The same protocol is now in place for King Charles III, who was the oldest British monarch at a coronation. Codenamed Operation Menai Bridge, the protocol for when Charles dies outlines the steps to be taken during the official period of mourning, the way his death will be announced publicly and the details of his funeral."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-no-plans-see-165800825.html",
        "title": "<b>Prince Harry</b> Has &quot;No Plans&quot; to See <b>Prince</b> William While He&#39;s in the U.K. Visiting King Charles",
        "description": "Prince Harry has no plans to see Prince William while in the UK visiting King Charles amid his cancer diagnosis."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/king-charles-health-updates-cancer-news/",
        "title": "<b>Prince Harry</b> updates — Duke meets King Charles without Meghan as Buckingham Palace announces monarch’s cancer diagnosis",
        "description": "KING Charles has been diagnosed with cancer, Buckingham Palace announced in a statement. The King, 75, has started treatment and was advised by doctors to cancel front line duties. In its"
    },
    {
        "url": "https://www.instyle.com/king-charles-cancer-palace-insiders-shocked-8559467",
        "title": "The Palace Was Reportedly &quot;Shocked&quot; By King Charles&#39;s Cancer Diagnosis",
        "description": "One day after Buckingham Palace revealed King Charles&#39;s cancer diagnosis, royal insiders are sharing their reactions. On Monday, the firm announced that in the process of treating an enlarged prostate, Charles&#39;s team of doctors uncovered the cancer, though the BBC reported that it is not prostate cancer."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/dads-shock-diagnosis-mended-relationship-hope-happens-harry-charles-20234556/?ico=mosaic_health",
        "title": "My dad’s shock diagnosis mended our relationship. I hope the same happens for <b>Harry</b> and Charles",
        "description": "I’m sure there is nobody who doesn’t feel for <b>Prince Harry</b> as he made that long flight back from California to the UK, reeling from the terrible news of his father’s cancer diagnosis. And although I don’t know him, I can well imagine some of the ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/24101697.prince-harry-visits-king-charles-iii-cancer-diagnosis/",
        "title": "<b>Prince Harry</b> visits King Charles III after cancer diagnosis",
        "description": "The Duke of Sussex has rushed back to the UK after King Charles III&#39;s cancer diagnosis. Prince Harry landed in the UK alone on Tuesday afternoon and was seen turning up at Clarence House. According to Sky News, The Duchess of Sussex, Meghan Markle, and their children are still in California."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/uk-world-news/king-flies-sandringham-after-meeting-9082139",
        "title": "King makes first public appearance since diagnosis after <b>Harry</b> meet",
        "description": "The King has left Clarence House and is believed to be preparing to travel by helicopter to Sandringham in Norfolk, the day after he began his treatment for cancer. The King waved from his car as he was driven out of Clarence House on Tuesday afternoon."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-royal-insider-claims-queen-camilla-knew-about-his-diagnosis-when-she-opened-a-cancer-centre_art21041.html",
        "title": "King Charles: Royal insider claims Queen Camilla knew about his diagnosis when she opened a cancer centre",
        "description": "King Charles’ recent cancer diagnosis has shaken up the country. Amidst this, a source has hinted that Queen Consort knew about the diagnosis as she ‘put on a brave"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/harry-and-charles-meeting-prompts-speculation-of-a-reconciliation-109936/",
        "title": "<b>Harry</b> and Charles’ meeting prompts speculation of a reconciliation",
        "description": "In a series of interviews to promote his book, Harry attacked the reputation of Charles’ wife Queen Camilla, saying her willingness to forge relationships with the British press made her “dangerous” and criticised her attempts to rehabilitate her “image” at his cost."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-harry-prince-andrew-cant-32058660",
        "title": "<b>Prince Harry</b> and <b>Prince</b> Andrew can’t stand in for King Charles despite still holding important role",
        "description": "Harry and Andrew are still among the four most senior adults in the line of succession despite not being working royals."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-no-plans-reunite-162141093.html",
        "title": "<b>Prince Harry</b> Has &#39;No Plans&#39; to Reunite with Brother <b>Prince</b> William During U.K. Visit, Says Source",
        "description": "The Duke of Sussex met with King Charles amid his cancer news, and the Prince of Wales has been helping Princess Kate recover from recent surgery"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-family-live-prince-harry-32056746",
        "title": "Royal Family LIVE: <b>Prince Harry</b> travelling home to UK to see King Charles amid cancer news",
        "description": "The Duke of Sussex is travelling back to the UK from California to see his father after Buckingham Palace confirmed that the King has been diagnosed with a form of cancer"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13048685/Prince-Harry-Meghan-Markle-King-Charles-rift.html",
        "title": "<b>Prince Harry</b> is &#39;wise&#39; to travel back to London without Meghan Markle to see King Charles after &#39;serious rift&#39; - but a &#39;positive future&#39; could be on the cards, royal expert claims",
        "description": "Prince Harry, 39, will be flying from California to London to reunite with his father following the news - but his wife and their two children will not be joining him, a source revealed."
    },
    {
        "url": "https://www.itv.com/watch/news/prince-harry-to-return-to-the-uk-to-visit-king-charles/pls1jzk",
        "title": "<b>Prince Harry</b> to return to the UK to visit King Charles",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/prince-william-tricky-choice-prince-harry-king-cancer",
        "title": "William faces a &#39;tricky choice&#39; as <b>Harry</b> lands in the UK to visit Charles",
        "description": "<b>Prince Harry</b> has returned to the UK following the announcement that his father, King Charles, has been diagnosed with cancer. The monarch underwent a procedure last month to treat a benign enlarged prostate, and this week the Palace confirmed that &#39;a ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68209692",
        "title": "<b>Prince Harry</b> to visit King Charles in coming days",
        "description": "The Duke of Sussex will travel to the UK to visit King Charles &quot;in the coming days&quot; after Buckingham Palace announced the monarch had been diagnosed with cancer, the BBC understands. A spokesperson for Prince Harry said he had spoken to his father about the diagnosis."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/celebs-tv/king-charles-final-years-plea-28576376",
        "title": "King Charles&#39; &#39;final years&#39; plea and the bitter feud as <b>Prince Harry</b> flies to UK after cancer diagnosis",
        "description": "Prince Harry is flying back to the UK urgently to see his father King Charles after it was made public that the monarch has been diagnosed with cancer. The Duke of Sussex, who lives in the States with wife Meghan Markle, has been locked in a feud with the Royal Family but is &#39;clearing his diary&#39; to fly back from his California home to see his dad."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24099615.harry-fly-uk-king-cancer-news/",
        "title": "<b>Harry</b> to fly to UK to be with the King after cancer news",
        "description": "The Duke of Sussex is to fly to London in the coming days to be with his father after the King’s shock cancer diagnosis. A source close to Harry said the duke had spoken with Charles, who personally called both his sons to share news of the development."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-diagnosed-with-cancer-there-could-be-a-hidden-meaning-behind-the-picture-of-the-announcement_art21046.html",
        "title": "King Charles diagnosed with cancer: There could be a hidden meaning behind the picture of the announcement",
        "description": "King Charles’ cancer announcement was made in the evening of 5 February 2024. To accompany it The Palace released a brand new picture of the monarch. There could be more to it"
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24101950.harry-charles-meeting-prompts-speculation-reconciliation/",
        "title": "<b>Harry</b> and Charles’ meeting prompts speculation of a reconciliation",
        "description": "He was left barely on speaking terms with his two closest relatives – Charles and the <b>Prince</b> of Wales. <b>Harry</b>’s controversial memoir Spare further damaged his ties with his father and brother, making claims William physically attacked him, the King put ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/king-charles-spotted-leaving-clarence-house-prince-harry-meeting-20234462/?ico=trending-post-strip_item_1",
        "title": "King Charles escapes London minutes after <b>Harry</b> arrives to see how he is",
        "description": "The 75-year-old monarch took off from Clarence House after a brief meeting with his son <b>Prince Harry</b>, which reportedly lasted around 45 minutes. He was taken from the residence, located on the Mall in London, to a helicopter waiting a short distance away ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/06/princess-anne-king-charles-support-cancer-diagnosis/?utmsource=email",
        "title": "Why Princess Anne will be the King’s bedrock of support",
        "description": "On paper, the Princess Royal may not be the most prominent royal, lagging well behind her nephew <b>Prince Harry</b> and her brother the Duke of York – even though they are no longer “working” royals. But when it comes to putting in the hours on behalf of ..."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/prince-harry-return-to-england-prince-charles-cancer-diagnosis-royal-future-b1137428.html",
        "title": "Return of the prodigal son: can <b>Prince Harry</b>&#39;s homecoming change everything after King Charles&#39; diagnosis?",
        "description": "With accusations, recriminations and no doubt regrets on both sides, Prince Harry’s relationship with his family is at a nadir — but the King’s illness could signal a new era, says Melanie McDonagh"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-returns-uk-king-163235241.html",
        "title": "<b>Prince Harry</b> returns to UK to be at King Charles’ side, in rare moment of unity amid family rift",
        "description": "<b>Prince Harry</b> has flown back to the United Kingdom to see his father, according to media reports, after the shock announcement on Monday from Buckingham Palace that King Charles III has cancer. <b>Harry</b>, who arrived in London Tuesday from California ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-no-plans-see-165800825.html",
        "title": "<b>Prince Harry</b> Has &quot;No Plans&quot; to See <b>Prince</b> William While He&#39;s in the U.K. Visiting King Charles",
        "description": "<b>Prince Harry</b> is currently in the United Kingdom visiting his father King Charles, arriving just one day after His Majesty&#39;s cancer diagnosis was made public. <b>Harry</b> traveled alone on this trip, but a source tells People that “Hopefully [<b>Harry</b>] will bring ..."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/uk-world-news/prince-harry-travel-uk-see-28576053",
        "title": "<b>Prince Harry</b> to travel to UK to see King Charles after monarch&#39;s cancer diagnosis",
        "description": "Prince Harry is expected to travel to the UK to see his father King Charles after the announcement that he has cancer. A source close to the Duke of Sussex said he would fly to the UK &quot;in the coming days&quot;."
    },
    {
        "url": "https://www.lbc.co.uk/news/king-charles-cancer-harry-meghan-california-flooding-uk-return/",
        "title": "<b>Prince Harry</b> to return to UK alone, as Meghan remains in California home with children despite &#39;life-threatening&#39; floods",
        "description": "Prince Harry will travel to the UK alone after King Charles&#39; cancer diagnosis, it is understood, as his wife, Meghan Markle, remains at the family&#39;s California home despite the ongoing threat of &#39;life-threatening&#39; flooding."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739492/prince-harry-is-flying-to-uk-to-support-king-charles-after-dads-cancer-diagnosis/",
        "title": "<b>Prince Harry</b> ‘will fly to the UK today’ to support King Charles after speaking to him about cancer diagnosis",
        "description": "PRINCE Harry will fly to the UK to be with the King after he was diagnosed with cancer. The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him"
    },
    {
        "url": "https://www.itv.com/watch/news/king-charles-pictured-following-cancer-diagnosis-after-meeting-prince-harry/lmbvnq6",
        "title": "King Charles pictured following cancer diagnosis after meeting <b>Prince Harry</b>",
        "description": "Tue 6 Feb 2pm • King Charles has been pictured for the first time since Buckingham Palace announced that he had started treatment for a &#39;form of cancer&#39;."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-fly-uk-king-28576282",
        "title": "<b>Prince Harry</b> to fly to UK to be with the King after cancer diagnosis",
        "description": "The Duke of Sussex will clear his diary and travel from his home in California to be with his father in the coming days after the royal&#39;s shock cancer diagnosis"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-head-u-k-202117633.html",
        "title": "<b>Prince Harry</b> Will Head to the U.K. to Visit King Charles After His Cancer Diagnosis",
        "description": "Sources say Charles called his sons to tell them the news."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/details-prince-harrys-last-minute-28576542",
        "title": "Details of <b>Prince Harry</b>&#39;s last minute flight home after King Charles&#39; cancer diagnosis revealed by source",
        "description": "<b>Prince Harry</b> is said to be flying home alone from his home in California in the coming days, after personally receiving the information from the King in a phone call. Now, <b>Harry</b> is clearing his diary and travelling home, with the move likely to raise ..."
    }
]