[
    {
        "url": "https://www.dailymail.co.uk/news/article-12987269/prince-harry-sympathy-caroline-graham.html",
        "title": "This vainglorious gala felt like the popping of <b>Harry</b>&#39;s bubble... but it was hard not to feel just a smidgen of sympathy for him - Caroline Graham recalls her night at the ...",
        "description": "But he didn&#39;t say a word about them, which was weird.&#39; Before dinner, <b>Harry</b> posed for a selfie with <b>Prince</b> Mario-Max, whose website boasts connections stretching back to William of Orange, which would make him a very, very distant cousin of the British Royals."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-meghan-support-message-31930105",
        "title": "<b>Prince Harry</b> and Meghan Markle send message of support to Kate Middleton and King Charles amid health battles",
        "description": "Three days on since the Palace announced that King Charles and Kate Middleton would both experiencing health woes, Prince Harry and his wife Meghan have sent them a message of support"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markle-send-31928866",
        "title": "<b>Prince Harry</b> and Meghan Markle send get well message to Kate Middleton and King Charles",
        "description": "A source said: “The King and the Princess of Wales have received support from <b>Prince Harry</b> and Meghan regarding their health. The Duke and Duchess contacted both parties in different ways to pass on their concern and best wishes.” It comes after months ..."
    },
    {
        "url": "https://www.thesun.ie/royals/12034009/prince-harry-jokes-wishing-king-kate-well/",
        "title": "‘Horrible &amp; disrespectful’ <b>Prince Harry</b> was ‘cracking jokes’ instead of wishing King and Kate well in ‘deliberate snub’",
        "description": "PRINCE Harry was last night accused of showing disrespect to King Charles and Princess Kate by failing to mention the poorly pair in an awards speech. The Duke of Sussex, 39, spoke for four"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511739/lauren-sanchez-54-rare-picture-prince-harry-john-travolta-jeff-bezos/",
        "title": "Lauren Sanchez, 54, shares rare picture with <b>Prince Harry</b>, John Travolta and Jeff Bezos",
        "description": "The 54-year-old took to social media on Saturday morning, and shared a picture taken backstage of Prince Harry, John Travolta – who hosted the evening – Lauren, and fiance Jeff Bezos."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-bulging-awards-cabinet-31920762",
        "title": "<b>Prince Harry</b>&#39;s bulging awards cabinet explained awards after &#39;Living Legend&#39; nod",
        "description": "As Prince Harry prepares to receive a Living Legends of Aviation Award tonight, The Mirror takes a look at the awards he has won in the past"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857985/prince-harry-news-princess-kate-king-charles-hospital",
        "title": "<b>Prince Harry</b> axing from major role &#39;brought upon himself&#39; as Kate and Charles in hospital",
        "description": "The news comes as Prince Harry keeps calm and carries on in California, after he was named &#39;A Living Legend of Aviation&#39; at a glitzy ceremony. Grease and Pulp Fiction superstar John Travolta presented the royal father-of-two with his medal in Beverly Hills, California, on Friday (January 19)."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12986865/prince-harry-john-travolta-princess-diana-joke-aviation-awards.html",
        "title": "<b>Prince Harry</b> jokingly accuses John Travolta of &#39;dining out&#39; on star&#39;s dance with Princess Diana and calls him &#39;Captain John&#39; as he receives &#39;Living Legend&#39; award at glitzy ...",
        "description": "<b>Prince Harry</b> jokingly accused John Travolta of &#39;dining out&#39; on the story of his dance with Princess Diana as he stepped out in Los Angeles to be honoured as a &#39;Living Legend of Aviation&#39;. The Duke of Sussex was presented with the prestigious award by ..."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-misses-prince-harrys-214636859.html",
        "title": "Meghan Markle Misses <b>Prince Harry</b>&#39;s Awards Ceremony After One of Their Kids Became Ill",
        "description": "The Duke of Sussex was seen solo at the Living Legends of Aviation Awards on Friday night Getty <b>Prince Harry</b> and Meghan Markle Meghan Markle did not attend <b>Prince Harry</b>&#39;s induction into the Living Legends of Aviation on Friday after one of their kids ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-living-legends-of-aviation-award-john-travolta-6wf693nqj?ilc=timesradio:morefromthetimes",
        "title": "<b>Prince Harry</b> flies solo as he is honoured for work as army co-pilot",
        "description": "Organisers praised the duke for making “significant contributions to aviation/aerospace” though, before the event, some critics had questioned whether the <b>prince</b> deserved the award. <b>Harry</b> arrived at the Beverly Hilton hotel without the Duchess of ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857943/prince-harry-princess-kate-king-charles-health",
        "title": "<b>Prince Harry</b> &#39;worried&#39; about Princess Kate and King Charles but remains silent",
        "description": "Prince Harry was inducted into the Legends of Aviation Awards last night, with the Duke of Sussex looking &#39;anxious&#39; and &#39;wary&#39; as he arrived at the event without Meghan Markle"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/queen-camilla-doesnt-king-charles-185644662.html",
        "title": "Queen Camilla Doesn&#39;t Get Into King Charles&#39; &#39;Space with His Grandchildren&#39;: &#39;She Knows the Boundaries&#39;",
        "description": "Samir Hussein/WireImage The royal family at Trooping the Colour 2023 Related: Queen Camilla Reveals She Loves Reading <b>Harry</b> Potter with Grandchildren — But Is &#39;Hopeless&#39; at Doing Voices! King Charles&#39; bond with <b>Prince</b> Louis was displayed at the Platinum ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/prince-harry-pays-tribute-princess-31927138",
        "title": "<b>Prince Harry</b> pays tribute to Princess Diana as duke honoured at Aviation Awards",
        "description": "The prince reportedly spoke of his late mother while being named a Living Legend for his work as a military pilot."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-jokingly-calls-john-162820819.html",
        "title": "<b>Prince Harry</b> Jokingly Calls Out John Travolta for ‘Dining Out’ on 1985 Dance with Princess Diana",
        "description": "Rodriguez/Getty <b>Prince Harry</b>, John Travolta. <b>Prince Harry</b> is poking fun at John Travolta. While giving a speech at the 21st Annual Living Legends of Aviation Awards in Beverly Hills on Friday night, the Duke of Sussex, 39, made light of some of Travolta&#39;s ..."
    },
    {
        "url": "https://www.standard.co.uk/news/world/living-legends-of-aviation-prince-harry-mother-beverley-hills-b1133641.html",
        "title": "<b>Prince Harry</b> pays tribute to Princess Diana as he accepts &#39;Living Legend of Aviation&#39; award",
        "description": "Prince Harry paid tribute to Princess Diana at the Living Legends of Aviation awards by shouting out host John Travolta - who danced with the late Royal in 1985. The Duke of Sussex was only one when the actor danced with his late mother in the White House but was keen to share the memory at the event in Beverly Hills on Friday."
    },
    {
        "url": "https://news.sky.com/story/prince-harry-to-be-recognised-as-living-legend-of-aviation-for-services-to-british-army-13052045",
        "title": "<b>Prince Harry</b> recognised as Living Legend of Aviation for services to British Army",
        "description": "The duke&#39;s appearance at the award ceremony in Beverly Hills comes on the same day he dropped a libel claim against Associated Newspapers Limited."
    },
    {
        "url": "https://www.telegraph.co.uk/us/news/2024/01/20/prince-harry-living-legends-aviation-award-john-travolta/",
        "title": "<b>Prince Harry</b> accuses John Travolta of &#39;dining out&#39; on dance with Princess Diana",
        "description": "The Duke of Sussex made his first public appearance since news of King Charles’s upcoming prostate treatment on Friday night, as he was recognised for his contribution to aviation. Prince Harry appeared for an awards ceremony at the Beverly Hilton hotel in Los Angeles, California, to be classified as a “Living Legend of Aviation”."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-living-legends-of-aviation-award-john-travolta-6wf693nqj",
        "title": "<b>Prince Harry</b> avoids the red carpet at Beverly Hills awards",
        "description": "Organisers praised the duke for making “significant contributions to aviation/aerospace” though, before the event, critics questioned whether the <b>prince</b> deserved the award. <b>Harry</b> arrived at the Beverly Hilton Hotel without the Duchess of Sussex ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-remembers-diana-white-120226372.html",
        "title": "<b>Prince Harry</b> Remembers Diana’s White House Dance As He Accepts ‘Living Legend’ Award From John Travolta",
        "description": "<b>Prince Harry</b> paid tribute to his mother Princess Diana on Friday night as he collected his ‘living legend of aviation’ award from John Travolta. The Daily Mail reports that <b>Harry</b>, being recognised for his work as a helicopter pilot and gunner in the ..."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-andrew-never-counsellors-state-experts-2864094",
        "title": "Why <b>Prince Harry</b> and Andrew won’t be counsellors of state, explained by experts",
        "description": "“When King Charles ascended to the throne the counsellors of state were Queen Camilla, who may not be able to act because she would be with the King [on a royal trip or in the hospital], Prince William, Princess Beatrice, Prince Harry and Prince Andrew.”"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/prince-harry-to-be-recognised-as-living-legend-of-aviation-for-services-to-british-army/",
        "title": "<b>Prince Harry</b> to be recognised as Living Legend of Aviation for services to British Army",
        "description": "Prince Harry has arrived at an awards ceremony in Los Angeles where he will be recognised as a Living Legend of Aviation."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511690/prince-harry-honoured-living-legends-of-aviation-awards/",
        "title": "<b>Prince Harry</b> looks dapper in a tuxedo as he charms audience with &#39;lovely speech&#39; at star-studded awards show",
        "description": "Prince Harry, 39, made a solo appearance - despite rumours his wife Meghan, the Duchess of Sussex would be joining him - as he was inducted into the &quot;Living Legends of Aviation&quot; for his work as a British Army veteran, skipping the red carpet and sneaking in to the Beverly Hilton hotel, in Beverly Hills, California, via the back doors."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-worried-king-charles-31930026",
        "title": "<b>Prince Harry</b> was &#39;worried about King Charles&#39; health&#39; at Aviation Awards",
        "description": "<b>Prince Harry</b> attended the Aviation Awards last night alone and was supposedly &quot;worrying&quot; about his father The King who will go into hospital next week for a procedure. One body language expert has commented on the Duke&#39;s &quot;anxiousness&quot; which came shortly ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25432526/prince-harry-not-living-legend-royal-family/",
        "title": "It’s a shame <b>Harry</b>’s not a ‘living legend’ to Royal Family – Kate &amp; Charles’ woes show how streamlined it’s become",
        "description": "AS <b>Prince Harry</b> was picking up the ridiculous bauble of “living legend of aviation” on Friday night, his father was planning how he could swiftly get back to work after his prostate operation. And one of the reasons the 75-year-old King needs to do ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13154059.prince-harry-make-two-overseas-trips/",
        "title": "<b>Prince Harry</b> to make two overseas trips",
        "description": "<b>Prince Harry</b> is to undertake two official overseas visits this summer. He will go to Estonia and Italy in May, then Brazil and Chile the following month in a trip likely to coincide with the football World Cup. Both visits are being organised by the ..."
    },
    {
        "url": "https://www.timesnownews.com/world/prince-harry-and-meghan-markle-reach-out-to-king-charles-and-kate-middleton-after-health-scares-report-claims-article-107019005",
        "title": "<b>Prince Harry</b> and Meghan Reach Out To King Charles and Kate After Health Scares, Report Claims",
        "description": "<b>Prince Harry</b> and Meghan Markle have offered their support to King Charles and Princess Kate as they navigate respective health challenges, in a move interpreted as a potential olive branch amidst ongoing tensions within the Royal Family. This gesture comes ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-accuses-john-travolta-31927880?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> accuses John Travolta of &#39;dining out&#39; on dance with Princess Diana",
        "description": "At the 21st annual Living Legends of Aviation ceremony, Prince Harry joked with John Travolta saying the actor &#39;dines out&#39; on the story that he danced with Princess Diana"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857938/prince-harry-meghan-markle-lilibet-row",
        "title": "<b>Prince Harry</b> and Meghan Markle blasted over Lilibet row despite &#39;good intentions&#39;",
        "description": "A PR expert criticised how Prince Harry and Meghan Markle handled naming their daughter Lilibet after the late Queen Elizabeth."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25427499/prince-harry-king-charles-kate-middleton-speech/",
        "title": "<b>Prince Harry</b> makes NO reference to dad King Charles or Kate Middleton’s health shock in aviation hall of fame speech",
        "description": "PRINCE Harry made no reference to dad King Charles or Kate Middleton’s health shock in his aviation hall of fame speech. The Duke of Sussex accepted the “Living Legend of"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-king-surgery-princess-of-wales-harry-b2481936.html",
        "title": "Royal news - live: <b>Harry</b> seen without Meghan after Charles prostate news as Kate recovers in hospital",
        "description": "Prince Harry may not have learned of King Charles’s health condition before it went public as Kate Middleton enters recovery after successful abdominal surgery. Prince Harry may have been informed of the King’s enlarged prostate via a news alert as it was 7.25am in California, the Telegraph understands."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/20/monarchy-royal-family-king-charles-kate-middleton-hospital/",
        "title": "How the Sussexes’ vanishing act exposed the weakness of the slimmed-down monarchy",
        "description": "With Kate and the King in hospital the Royal family could do with a helping hand and some stardust — but it won&#39;t be coming from California The fragile Firm: With no <b>Prince Harry</b> or Meghan to step in, the Royal family looks thinner than ever On Friday ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/meghan-markle-harry-living-legends-of-aviation-award-children-unwell/",
        "title": "Meghan forced to miss <b>Harry</b> receiving Living Legends of Aviation award after one of their children &#39;became unwell&#39;",
        "description": "<b>Prince Harry</b> during a photocall at military helicopter training course base at RAF Shawbury. Picture: Alamy <b>Harry</b> was inducted alongside US navy pilot Fred George and former world speed record holder Steve Hinton, as well as Lauren Sanchez - who is engaged ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12985883/prince-harry-living-legends-aviation-gala-lauren-sanchez.html",
        "title": "<b>Prince Harry</b> pays tribute to his mother Diana as he receives &#39;Living Legend&#39; award at glitzy John Travolta-hosted Beverley Hills bash - but makes no mention of Kate or Charles ...",
        "description": "A beaming Prince Harry was honored on Friday night for his work as a military pilot at a lavish gala in Los Angeles."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-remembers-diana-white-120226372.html",
        "title": "<b>Prince Harry</b> Remembers Diana’s White House Dance As He Accepts ‘Living Legend’ Award From John Travolta",
        "description": "Prince Harry paid tribute to his mother Princess Diana on Friday night as he collected his ‘living legend of aviation’ award from John Travolta. The Daily Mail reports that Harry, being recognised for his work as a helicopter pilot and gunner in the British Army,"
    },
    {
        "url": "https://www.ok.co.uk/royal/harry-meghan-zara-mike-royal-31885851",
        "title": "<b>Harry</b> and Meghan &#39;could earn a great deal of money&#39; by copying beloved royal couple",
        "description": "EXCLUSIVE: A top royal expert tells OK! why Prince Harry and Meghan Markle should look to Zara and Mike Tindall for inspiration as they are branded the &quot;premier royal couple&quot;"
    },
    {
        "url": "https://www.thesun.ie/royals/12031975/prince-harry-living-legend-aviation-award-colonel-richard-kemp/",
        "title": "Army pilots risk lives on feats <b>Harry</b> didn’t do, naming him ‘Living Legend’ is snub to heroes, says Colonel Richard Kemp",
        "description": "COLONEL Richard Kemp has said naming Prince Harry a “Living Legend of Aviation” undermines the whole award. The aviation award sparked fury among military experts who believe Harry"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25428944/prince-harry-more-relaxed-confident-without-meghan-body-language/",
        "title": "<b>Prince Harry</b> is ‘more relaxed &amp; confident WITHOUT Meghan’ as duke beams at aviation awards, body language expert claims",
        "description": "PRINCE Harry looked more ‘relaxed and confident than he tends to be with Meghan’, during his recent Aviation Awards appearance, according to a body language expert. The Prince made no reference to"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/will-prince-harry-reach-out-to-king-charles-over-his-upcoming-surgery-royal-experts-answer_art20847.html",
        "title": "Will <b>Prince Harry</b> reach out to King Charles over his upcoming surgery? Royal experts answer",
        "description": "As King Charles preps for surgery and while Princess Kate recovers from her surgery, it is expected that Prince Harry will call them both, will"
    },
    {
        "url": "https://inews.co.uk/news/harry-tribute-diana-aviation-award-2865132?ico=above_article_ticker",
        "title": "<b>Harry</b> pays tribute to his mother Diana as he receives aviation award at ceremony",
        "description": "The Duke of Sussex received his &#39;legends of aviation&#39; award from John Travolta in LA hours after dropping a libel claim over a Mail On Sunday article"
    },
    {
        "url": "https://www.itv.com/news/2024-01-20/duke-of-sussex-arrives-at-awards-ceremony-after-dropping-libel-claim",
        "title": "Duke of Sussex arrives at awards ceremony after dropping libel claim",
        "description": "A statement on it’s website said: “<b>Prince Harry</b> is a humanitarian, military veteran, mental wellness advocate and environmentalist. “He has dedicated his life to advancing causes that he is passionate about and that bring about permanent change for ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harrys-tribute-princess-diana-090000441.html",
        "title": "<b>Prince Harry</b>&#39;s tribute to Princess Diana at awards ceremony",
        "description": "<b>Prince Harry</b> paid tribute to his mother Princess Diana at a glitzy awards ceremony in Beverly Hills on Friday (19.01.24). The Duke of Sussex was celebrated as a Living Legend of Aviation at the event for his work as a helicopter co-pilot and gunner in the ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163424/20240121/critics-question-meghan-markles-commitment-during-royal-health-crisis.htm",
        "title": "Critics Question Meghan Markle&#39;s Commitment During Royal Health Crisis",
        "description": "The Duchess of Sussex, along with her husband <b>Prince Harry</b>, relocated to the US, stepping back from their roles as senior members of the royal family. This decision has been scrutinized, especially as the royal family faces significant health challenges."
    }
]