[
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-makes-clear-not-unleashing-royal-secrets-6-word-statement.html/",
        "title": "<b>Prince Harry</b> Makes It Clear He’s Not Unleashing Any More Royal Secrets With Quick 6-Word Statement",
        "description": "Prince Harry&#39;s recent response during an interview suggests he&#39;s not willing to unveil any more information about the royal family."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13101981/EPHRAIM-HARDCASTLE-Prince-William-forgive-Harry-Meghans-antics-leaving-Royal-Family.html",
        "title": "EPHRAIM HARDCASTLE: Will <b>Prince</b> William forgive <b>Harry</b> and Meghan&#39;s antics since leaving the Royal Family?",
        "description": "If Prince Harry is genuine and the King is receptive to reconciliation, will Prince William forgive Harry and Meghan&#39;s antics since leaving the family?"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-harry-william-royal-news-b2498562.html",
        "title": "Royal family news - live: King in first outing since <b>Harry</b> interview as ‘zero chance’ of <b>prince</b>’s return",
        "description": "The King smiled and waved at wellwishers in his first public appearance since meeting with Prince Harry who hinted he was hoping the royal family could reunify in the wake of his shock cancer diagnosis."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26030636/kate-middleton-william-oxford-school-george-eton/",
        "title": "<b>Prince</b> William and Kate look round £47k-a-year Oxford school for George, 10, after Eton ‘argument’",
        "description": "THE Prince and Princess of Wales are said to be considering a £47,000-a-year Oxford school for son Prince George, 10 – after ‘disagreeing’ over sending him to Eton. The royal couple are said"
    },
    {
        "url": "https://metro.co.uk/2024/02/19/david-tennants-wife-georgia-sends-trans-rights-message-baftas-20309459/?ico=trending-post-strip_item_4",
        "title": "David Tennant’s wife Georgia showcased powerful trans rights message at Baftas",
        "description": "David Tennant’s wife Georgia displayed her solidarity with the transgender community by showing off her powerful new wrist tattoo at the Baftas. Actress Georgia, 39, watched on as husband David, 52, presented the prestigious awards show that saw Oppenheimer walk away with seven wins on the night,"
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-attends-church-prince-181730461.html",
        "title": "King Charles Attends Church After <b>Prince Harry</b> Said He Was &#39;Grateful&#39; to See His Dad amid Cancer News",
        "description": "King Charles stepped out in Sandringham with Queen Camilla for their weekly church outing just days after Prince Harry spoke about his father&#39;s cancer diagnosis for the first time."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868412/meghan-markle-prince-harry-kids-fairytale-cottage",
        "title": "Meghan and <b>Prince Harry</b>’s children&#39;s &#39;magical&#39; fairytale cottage in family’s £11m home",
        "description": "While filming their Netflix docuseries, Prince Harry and Meghan Markle, Duke and Duchess of Sussex, opened the doors to their £11m Montecito, California family home for the first time in 2022. This gave fans of the royal couple a unique look inside the magnificent property the duo bought to start over after leaving the royal family."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/prince-harry-good-morning-america-interview-king-charles-cancer-latest/",
        "title": "<b>Prince Harry</b> updates — Duke not seeking a return to duty despite rumours as King Charles battles cancer",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview with Good Morning America. The Duke and Duchess of Sussex are in Canada, marking one year to go"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868426/prince-harry-meghan-strengthening-royal-connection",
        "title": "<b>Prince Harry</b> and Meghan Markle are &#39;strengthening royal connection&#39; with one decisive move",
        "description": "The Duke and Duchess of Sussex are trying something new, and it appears to be working, depending on who you ask."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-wants-world-know-32162028.amp",
        "title": "EXCLUSIVE: <b>Prince Harry</b> &#39;wants the world to know if Royal reunion doesn&#39;t happen it&#39;s not his fault&#39;",
        "description": "Prince Harry &#39;wants the world to know if Royal reunion doesn&#39;t happen it&#39;s not his fault&#39;, a body language expert has revealed after his unexpected GMA interview"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/remarkable-sussex-childrens-nurse-joins-the-call-for-2024-wellchild-awards-nominations-4524797",
        "title": "Remarkable Sussex children&#39;s nurse joins the call for 2024 WellChild Awards nominations",
        "description": "Last year’s WellChild Award winner Hannah Lines from Lancing has joined national children’s charity, WellChild, in the call for nominations for the 2024 WellChild Awards, in association with GSK."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/fact-checking-lady-louise-is-not-the-new-duchess-of-sussex-where-are-these-rumours-coming-from_art21198.html",
        "title": "Fact checking: Lady Louise is not the new Duchess of Sussex, where are these rumours coming from?",
        "description": "As the rumours went around TikTok during the weekend of 17 February 2024, let’s have a look at who started them and if they could be"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/19/the-baftas-show-us-that-celebs-know-how-to-pose-for-photos-then-there-is-prince-william?ref=upstract.com",
        "title": "<b>Prince</b> William is very rarely relatable – except when he’s at the Baftas",
        "description": "His awkwardness is on another level, and the beauty and professionalism of the actors doesn’t help, writes Zoe Williams"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-williams-strange-allergy-completely-32140320",
        "title": "<b>Prince</b> William&#39;s strange &#39;allergy&#39; has completely changed Royals",
        "description": "Prince William, who is spearheading the modern revolution of the monarchy alongside his wife, Kate Middleton, previously joked that he was &quot;allergic to selfies&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-return-royal-duties-32160409",
        "title": "<b>Prince Harry</b>&#39;s return to Royal duties with &#39;half job&#39; would not have pleased the Queen",
        "description": "The late Queen would have reportedly been far from impressed with her grandson Prince Harry&#39;s alleged offering to help King Charles in royal duties on a temporary basis"
    },
    {
        "url": "https://www.devonlive.com/news/uk-world-news/prince-william-says-theres-no-9109972",
        "title": "<b>Prince</b> William says there&#39;s &#39;no chance&#39; <b>Harry</b> will be allowed back into royal fold",
        "description": "Prince William has reportedly told pals there is &#39;no chance&#39; his brother Prince Harry will be allowed back into the Royal fold after the Duke of Sussex offered to return to a temporary Royal role to s"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-emotional-32161703",
        "title": "<b>Prince Harry</b> and Meghan Markle have &#39;emotional heart to heart&#39; over King&#39;s cancer",
        "description": "The Duke and Duchess of Sussex are not entirely on the same page when it comes to their future within the Royal Family as Harry is keen to step in to help his family."
    },
    {
        "url": "https://www.lbc.co.uk/news/william-and-kate-considering-47k-a-year-school-for-prince-george/",
        "title": "William and Kate considering £47k-a-year school for <b>Prince</b> George after &#39;years&#39; of disagreeing about boarding",
        "description": "The Prince and Princess of Wales are said to be considering a £47,000 a year school in Oxford for Prince George - after years of disagreements about boarding school."
    },
    {
        "url": "https://www.gg2.net/prince-harry-and-meghan-dine-at-vikram-vijs-iconic-vancouver-restaurant/",
        "title": "<b>Prince Harry</b> and Meghan dine at Vikram Vij’s iconic Vancouver restaurant",
        "description": "During their recent visit to Vancouver, Prince Harry and Meghan Markle experienced a fusion of British and Canadian cultures by dining at the esteemed Vij’s"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-raised-brow-glance-32161021",
        "title": "Meghan Markle&#39;s &#39;raised-brow glance of approval&#39; to <b>Prince Harry</b> after lavish dinner",
        "description": "Prince Harry and Meghan Markle have been in Canada for three days as they mark a year to go until the 2025 Invictus Games, with the trip culminating in a lavish banquet dinner."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-reveals-trips-planned-142900140.html",
        "title": "<b>Prince Harry</b> Reveals He Has &quot;Trips Planned&quot; to See His Family in the UK",
        "description": "Prince Harry opened up about when he next plans to visit the royal family, telling Good Morning America “I’ve got other trips planned that would take me through the UK or back to the UK so I’ll stop and see my family as much as I can."
    },
    {
        "url": "https://www.thebookseller.com/spotlight/bookstat-2023-e-book-ranking-self-published-authors-teach-us-a-lesson",
        "title": "Bookstat 2023 E-book Ranking: self-published authors teach us a lesson",
        "description": "Bonnie Garmus took the top spot, but self-published and hybrid authors weren’t far behind. According to Bookstat’s records, last year’s e-book sales were influenced by celebrity authors and BookTok hashtags."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13100213/meghan-markle-suits-wedding-prince-harry-smell.html",
        "title": "Meghan Markle&#39;s Suits costar Rick Hoffman claims there was a &#39;foul SMELL&#39; in the air during her wedding to <b>Prince Harry</b> - as he blames &#39;terrible&#39; odor for THAT viral photo of ...",
        "description": "Meghan Markle&#39;s former Suits costar has claimed that there was a &#39;really terrible and foul&#39; smell in the air during her 2018 wedding to <b>Prince Harry</b>. Rick Hoffman, who starred as Louis Marlowe Litt in the USA legal drama, went viral back in May 2018 ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/harry-king-charles-cancer-royal-family-news-b2498363.html?page=2",
        "title": "Royal family news - live: King in first public outing since <b>Harry</b> visit as return given ‘zero per cent chance’",
        "description": "The King smiled and waved at wellwishers in his first public appearance since meeting with Prince Harry who hinted he was hoping the royal family could reunify in the wake of his shock cancer diagnosis."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-reveals-further-plans-32146051?int_source=nba",
        "title": "<b>Prince Harry</b> reveals further plans to return to UK and visit King and Royal Family",
        "description": "<b>Harry</b> recently paid a much-talked about visit to the UK to visit the King, and now he&#39;s shared plans to come back again, after the last meeting lasted a reported 30 minutes. During the interview with Will Reeve, <b>Harry</b> explained he was &quot;grateful&quot; he could ..."
    },
    {
        "url": "https://radaronline.com/p/prince-william-gaffe-baftas-movie-fun-mia-mckenna-bruce/",
        "title": "Royal Gaffe: <b>Prince</b> William Mocked Over Awkward Remarks to Actress Mia McKenna-Bruce",
        "description": "Royal experts have speculated it will be the catalyst to the family reconciling with William&#39;s estranged brother, <b>Prince Harry</b>, but there may be a long road ahead. Never miss a story — sign up for the RadarOnline.com newsletter to get your daily dose of ..."
    },
    {
        "url": "https://www.allvipp.com/royals/prince-harry-teases-potential-return-to-the-uk-once-more",
        "title": "<b>Prince Harry</b> Teases Potential Return To The UK Once More!",
        "description": "This article delves into <b>Prince Harry</b>&#39;s complex relationship with the royal family, his recent visits, and the underlying love that may pave the way for healing. <b>Prince Harry</b> hints a heartfelt return to his British roots He flew to London last week to see ..."
    },
    {
        "url": "https://www.marieclaire.com.au/news/prince-harry-arrives-uk-king-charles-cancer/",
        "title": "Four Little Words: <b>Prince Harry</b> Defends His Dash To See <b>Prince</b> Charles",
        "description": "Prince Harry met with his father King Charles in London for just 45 minutes. The King helicoptered to Sandringham immediately after."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-just-fired-back-critics-3-words-sussex-website-rebrand-canada-trip.html/",
        "title": "Meghan Markle and <b>Prince Harry</b> Just Fired Back at Critics With 3 Words After Sussex Website Rebrand, Canada Trip",
        "description": "A spokesperson for Prince Harry and Meghan Markle commented on the pair&#39;s so-called &#39;make or break&#39; moments during their Canada trip."
    },
    {
        "url": "https://interaksyon.philstar.com/trends-spotlights/2024/02/19/270671/prince-harry-hopeful-king-cancer-royal-family-closer/",
        "title": "<b>Prince Harry</b> hopeful King’s cancer could bring royal family closer",
        "description": "LONDON — King Charles&#39;s cancer diagnosis could bring the British royal family closer, his estranged son Prince Harry said in an interview on Friday,"
    },
    {
        "url": "https://www.mcall.com/2024/02/18/prince-william-will-block-harrys-royal-return-he-and-meghan-cannot-be-trusted-report/",
        "title": "<b>Prince</b> William will block <b>Harry</b>’s royal return; he and Meghan ‘cannot be trusted’: report",
        "description": "Whatever Harry has discussed with King Charles about a reconciliation and resumption of royal duties, it is ‘absolutely and categorically clear’ that William would not allow his"
    },
    {
        "url": "https://www.nowtolove.com.au/tag/cressida-bonas/page/5/",
        "title": "Cressida Bonas",
        "description": "Prince Harry and his girlfriend Cressida Bonas were spotted attending a musical in London’s West End last night. Harry and Cressida were photographed leaving The Prince of Wales Theatre after attending a performance of hit show Book of Mormon. It was a rare snap of the besotted pair, who usually go to great lengths to […]"
    },
    {
        "url": "https://www.nowtolove.com.au/tag/diana-princess-of-wales/page/41/",
        "title": "Diana Princess of Wales",
        "description": "<b>Prince Harry</b> is presented with a photo of late mother Diana as he says he’s “very happy” being single <b>Prince Harry</b> recently revealed his desire to have kids, but the broody royal is in no rush to fulfill that wish and has since admitted he is “very ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159372-meghan-markles-childhood-photos-spark-intrigue-as-resemblance-to-son-archie-draws-spotlight",
        "title": "Meghan Markle&#39;s childhood photos spark intrigue as resemblance to son Archie draws spotlight",
        "description": "New photos have unveiled Meghan Markle&#39;s enchanting childhood, capturing the young Duchess looking exceptionally adorable and content alongside her parents.One of the snapshots reveals a"
    },
    {
        "url": "https://metro.co.uk/2024/02/19/prince-william-awkwardly-tells-actress-harrowing-film-looked-like-fun-20309781/?ico=trending-post-strip_item_4",
        "title": "<b>Prince</b> William makes very awkward comment about actress’ harrowing film",
        "description": "<b>Prince</b> William chatted to the rising star nominees at the Baftas (Picture: Jordan Pettitt/Pool/AFP) <b>Prince</b> William was caught in an incredibly uncomfortable encounter with the rising star nominees at the 2024 Bafta Awards. After walking the star-studded ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868463/prince-harry-prince-william-fashion-united",
        "title": "<b>Prince Harry</b> and <b>Prince</b> William united over fashion statement they are both obsessed with",
        "description": "When it comes to relaxed royal engagements Prince William prefers to wear casual chinos, and Prince Harry has a similar taste, often sporting a more chilled-out dress code."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159367-princess-kate-wants-to-heal-rift-with-prince-harry-meghan-markle",
        "title": "Princess Kate wants to heal rift with <b>Prince Harry</b>, Meghan Markle",
        "description": "Princess Kate seemingly wants to mend the broken relationship with <b>Prince Harry</b> and Meghan Markle. However, Catherine still &#39;feels hurt&#39; with their behaviours. As per US Magazine, an insider shared that the Princess of Wales &quot;is open to reconciling ..."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/king-charles-tough-prince-harry-decision-after-brief-reunion-amid-cancer-battle/KPSFS7U5BJBB3ESDHVFNBYO544/",
        "title": "King Charles’ tough <b>Prince Harry</b> decision after brief reunion amid cancer battle",
        "description": "King Charles and his estranged son Prince Harry reunited for a brief 30 minute meeting hours after the 75-year-old monarch’s cancer diagnosis was made public. Yet despite Harry’s willingness to return to the royal fold,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-wants-world-know-32162028",
        "title": "<b>Prince Harry</b> &#39;wants the world to know if Royal reunion doesn&#39;t happen it&#39;s not his fault&#39;",
        "description": "Prince Harry &#39;wants the world to know if Royal reunion doesn&#39;t happen it&#39;s not his fault&#39;, a body language expert has revealed after his unexpected GMA interview"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/19/the-baftas-show-us-that-celebs-know-how-to-pose-for-photos-then-there-is-prince-william",
        "title": "<b>Prince</b> William is very rarely relatable – except when he’s at the Baftas",
        "description": "His awkwardness is on another level, and the beauty and professionalism of the actors doesn’t help, writes Zoe Williams"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/how-prince-harrys-temporary-return-32159369.amp",
        "title": "How <b>Prince Harry</b>&#39;s temporary return to Royal duties unfolded before Palace &#39;ruled it out&#39;",
        "description": "Prince Harry is said to be willing to help the Royal Family while his father is unwell, but some sources have said there is &#39;no way&#39; back for the Duke of Sussex"
    },
    {
        "url": "https://www.ttgmedia.com/features/inside-the-hotel-thats-brought-the-magic-back-to-disneyland-paris-44773",
        "title": "Inside the hotel that&#39;s brought the magic back to Disneyland Paris",
        "description": "The reimagined Disneyland Hotel, in the heart of the French theme park, opened its doors at the end of January."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-firmly-opinion-harry-not-32159476",
        "title": "King is &#39;firmly of the opinion&#39; that <b>Harry</b> is not allowed to return to Firm despite his &#39;willingness&#39;",
        "description": "Prince Harry is said to be open to helping the Royal Family amid his father&#39;s cancer diagnosis but the King has made it clear he does not want the duke to return to the Firm on a temporary basis, sources claim."
    },
    {
        "url": "https://www.thesun.ie/royals/12237298/meghan-markle-star-foul-smell-royal-wedding-harry-diffuser/",
        "title": "Meghan Markle’s former co-star recalls ‘foul’ smell at wedding to <b>Prince Harry</b> – after Duchess’ £130 scent diffuser row",
        "description": "MEGHAN Markle’s former co-star has revealed there was a “foul” smell at her wedding to Prince Harry. Suits star Rick Hoffman, who played Louis Litt on the show, opened up about attending the"
    },
    {
        "url": "https://uk.news.yahoo.com/insiders-no-way-king-royal-112438575.html",
        "title": "Insiders Say There’s ‘No Way’ King Will ‘Re-Royal’ <b>Prince Harry</b>",
        "description": "Karwai Tang / Getty ImagesRumors of Prince Harry’s potential return to royal duties were unequivocally crushed Monday morning, with sources telling The Daily Beast that the king and his older son, Prince William were “totally united” on the issue and there was “no way” they would “re-royal” Harry."
    },
    {
        "url": "https://www.thesun.ie/royals/12238146/the-crown-matt-smith-nickname-harry-philip-netflix/",
        "title": "The Crown’s Matt Smith reveals surprising nickname <b>Prince Harry</b> called him after he played Philip on the Netflix show",
        "description": "And it turns out that when he bumped into <b>Prince Harry</b> at a polo match, the Duke of Sussex didn’t hold back. Speaking to BBC, Matt said: “He was like ‘alright grandad? I was like ‘alright mate?’” He also gushed about getting the chance to play ..."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-george-insider-suggests-oundle-school-has-joined-the-list-of-places-the-royal-could-study_art21189.html",
        "title": "<b>Prince</b> George: Insider suggests Oundle School has joined the list of places the royal could study",
        "description": "Prince George turned 10 in July 2023 which means he will soon be attending secondary school. As he is the heir to the throne, his parents are under pressure to find the right"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-zero-percent-chance-110222719.html",
        "title": "<b>Prince Harry</b> Has a &quot;Zero Percent Chance&quot; of Returning to an Official Royal Role, Source Claims",
        "description": "Royal expert Ingrid Seward agreed, telling the Telegraph, &quot;Harry is out. There’s no going back to a public role. What would he do? He has got no patronages to exercise as a public figure and for him to come back would just be a parade for Harry. It would not be a serious, proper role like the working royals have.&quot;"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/susanna-reid-halts-itv-good-28659448",
        "title": "Susanna Reid halts ITV Good Morning Britain amid backlash and fans say &#39;it&#39;s frankly pathetic&#39;",
        "description": "Good Morning Britain debated whether or not it&#39;s time for Prince William to forgive his brother Prince Harry during their father&#39;s current health condition."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/celebs-tv/princess-kate-enjoy-family-trip-9106518",
        "title": "Princess Kate to enjoy family trip away as she makes &#39;steady recovery&#39; after surgery",
        "description": "After undergoing &#39;planned&#39; abdominal surgery, the mum-of-three spent two weeks recovering in a London hospital before returning home to Adelaide Cottage, in Windsor, in January. According to her office at the palace, she will not return to official duties until after Easter, which falls on March 31 this year."
    },
    {
        "url": "https://www.ibtimes.co.uk/suits-co-star-says-meghan-markles-royal-wedding-plagued-foul-smell-1723504",
        "title": "&#39;Suits&#39; Co-Star Says Meghan Markle&#39;s Royal Wedding Plagued By A &#39;Foul Smell&#39;",
        "description": "Rick Hoffman said he smelled somebody with halitosis from where he sat during the couple&#39;s royal wedding in May 2018."
    },
    {
        "url": "https://inews.co.uk/news/i-morning-briefing-the-key-questions-over-navalnys-death-2912868?ico=related_stories",
        "title": "i morning briefing: The key questions over Navalny’s death",
        "description": "But while the cause of his death is not yet known, his supporters and Western leaders know who to blame. “Make no mistake: Putin is responsible for Navalny’s death. Putin is responsible,” Joe Biden said."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-talks-about-king-charles-iiis-cancer-future-return-uk-1723492",
        "title": "<b>Prince Harry</b> Talks About King Charles III&#39;s Cancer, Future Return To UK",
        "description": "He was pictured arriving in London and being driven to Clarence House, where King Charles III and his wife, Queen Camilla, waited. Speaking about the time he got to see his father, the Duke of Sussex added: &quot;Look, I love my family. The fact that I was able to get on a plane and go and see him and spend any time with him, I&#39;m grateful for that.&quot;"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513648/prince-harry-reveals-plans-uk-return/",
        "title": "<b>Prince Harry</b> reveals he has plans to return to UK and see royal family",
        "description": "Prince Harry has resided in Montecito, California since he and wife, Meghan, stepped back as senior royals in 2020. Since then, he has made a handful of visits to his home country, including for the funerals of his late grandparents, Queen Elizabeth II and Prince Philip, and for his father King Charles&#39; coronation."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513637/king-charles-prince-william-permission-family-time/",
        "title": "King Charles &#39;gave <b>Prince</b> William permission&#39; to spend time with family away from royal duties",
        "description": "It has been a rollercoaster few weeks for the Prince of Wales who just last week, returned to his royal duties following his wife, Princess Kate&#39;s abdominal surgery and his father, King Charles&#39; cancer diagnosis."
    },
    {
        "url": "https://www.thetimes.co.uk/article/fragile-royal-family-requires-reinforcements-0sl9l99tj",
        "title": "Fragile royal family requires reinforcements",
        "description": "Five years ago I believed that the royal family should shrink. The monarchy was popular and required its heirs but it was anachronistic to have tiers of dusty dukes and princesses on the royal payroll too."
    },
    {
        "url": "https://www.btimesonline.com/articles/164126/20240220/harry-and-meghans-alliance-with-michael-bubl%C3%A9-seen-as-strategic-public-relations-effort.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s Alliance with Michael Bublé Seen as &#39;A Good PR Move&#39;",
        "description": "In the picturesque backdrop of Vancouver, Canada, the Duke and Duchess of Sussex, <b>Prince Harry</b> and Meghan Markle, recently showcased a vivid display of camaraderie with Canadian singer Michael Bublé and his wife, Luisana Lopilato. The occasion was marked ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/king-charles-thinks-no-way-28659289",
        "title": "King Charles thinks &#39;no way back&#39; for <b>Prince Harry</b> amid return to royal duties",
        "description": "<b>Prince Harry</b> is reportedly open to a temporary return to life as a working Royal following his dad King Charles&#39; cancer diagnosis, but sources say the monarch is having none of it King Charles is reportedly convinced that his youngest son, <b>Prince Harry</b> ..."
    },
    {
        "url": "https://www.vogue.co.uk/article/moments-you-missed-baftas-2024",
        "title": "All The Moments You Might Have Missed From The BAFTAs 2024",
        "description": "Below, a rundown of all the moments you might have missed from the 2024 ceremony at the Southbank Centre’s Royal Festival Hall, from David Tennant’s stint as host to Sophie Ellis-Bextor’s rendition of “Murder on the Dancefloor”."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/prince-harry-blocked-heart-heart-king-charles-20300503/?ico=trending-module_author_sarah-hooper_item-4",
        "title": "<b>Prince Harry</b> ‘blocked’ from having heart to heart with King Charles",
        "description": "<b>Prince Harry</b> was ‘blocked’ from seeing his father King Charles one-on-one after he flew back to the UK after the King’s cancer diagnosis. The <b>prince</b> had allegedly wanted to join his father for ‘a few days’ at Sandringham – but was restricted ..."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/zero-chance-prince-william-let-145406911.html",
        "title": "‘Zero Chance’ <b>Prince</b> William Would Let <b>Prince Harry</b> Return to Royal Duties",
        "description": "<b>Prince</b> William is reportedly determined to prevent <b>Prince Harry</b>’s attempts to return to the royal fold. The Mirror reports that sources close to William say he would step up to the plate if needed in the wake of King Charles’ cancer diagnosis ..."
    }
]