[
    {
        "url": "https://www.businessghana.com/site/news/entertainment/299128/Prince-Harry-Wins-Phone-Hacking-Lawsuit-Against-Mirror-Group-Newspapers:-&",
        "title": "<b>Prince Harry</b> Wins Phone Hacking Lawsuit Against Mirror Group Newspapers: &#39;A Great Day for Truth&#39;",
        "description": "The Duke of Sussex made history when he took the stand to testify against the publisher over the summer Prince Harry has won his phone"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/as-king-charles-expands-his-guest-list-for-christmas-heres-who-he-could-be-inviting_art20471.html",
        "title": "As King Charles expands his guest list for Christmas, here’s who he could be inviting",
        "description": "This year, she does not have to make that decision. Finally, it is rumoured that <b>Prince Harry</b> and Meghan have been invited but it isn’t clear whether they will come as the couple has missed the last 4 Christmasses with the Royal Family. The King&#39;s ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/north-wales-pub-has-licence-suspended-over-concerns-about-excessively-drunk-children-using-ketamine-and-cocaine/",
        "title": "North Wales pub has licence suspended over concerns about &#39;excessively drunk&#39; children using ketamine and cocaine",
        "description": "A pub and nightclub has had its licence suspended for three months after police found children in an excessively drunk state and concerns were raised they may have taken cocaine and ketamine."
    },
    {
        "url": "https://www.theguardian.com/culture/2023/dec/16/steve-coogan-phone-hacking-ruling-reveals-systemic-concealment?ref=biztoc.com",
        "title": "Steve Coogan: phone-hacking ruling reveals ‘systemic concealment’",
        "description": "Actor and comedian says Prince Harry’s partial high court win shows need for tighter press regulation"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/harry-couldnt-understand-williams-obsession-31686334",
        "title": "<b>Harry</b> &#39;couldn&#39;t understand William&#39;s obsession&#39; with Middletons after marrying Kate",
        "description": "Royal author Tina Brown claims Prince Harry felt &#39;displaced&#39; by Prince William&#39;s family unit and did not understand his relationship with the Middleton family after he married Kate"
    },
    {
        "url": "https://uk.news.yahoo.com/london-police-carefully-consider-prince-095302878.html",
        "title": "London police to &quot;carefully consider&quot; <b>Prince Harry</b> phone hacking ruling",
        "description": "London&#39;s police said they will &quot;carefully consider&quot; the findings of a court ruling that found Prince Harry had been a victim of phone hacking and other unlawful acts by Mirror Group journalists with the knowledge of their editors."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-meghan-markle-christmas-card-children-b1127373.html",
        "title": "<b>Harry</b> and Meghan choose Christmas card without picture of children",
        "description": "Harry and Meghan have chosen not to include a picture with their children on their annual Christmas card, according to reports."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073801/prince-harry-no-fun-since-marrying-meghan-james-haskell/",
        "title": "<b>Prince Harry</b> is no fun since marrying Meghan Markle, pal James Haskell reveals",
        "description": "PRINCE Harry is ‘no fun’ since marrying Meghan Markle, according to friend James Haskell. The former England rugby star revealed his thoughts about the Duke of Sussex since he tied the"
    },
    {
        "url": "https://goss.ie/uk-showbiz/longtime-friend-brands-prince-harry-no-fun-since-he-married-meghan-markle-362807",
        "title": "Longtime friend brands <b>Prince Harry</b> ‘no fun’ since he married Meghan Markle",
        "description": "James Haskell, a longtime friend of Prince Harry, has claimed he’s been “no fun” since he married Meghan Markle. While the former rugby union player has jumped to their defence in the past, the 38-year-old made a sly dig towards the couple on stage during a live version of his podcast in Bath this week."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25073941/prince-harry-christmas-charles-william-endgame/",
        "title": "<b>Prince Harry</b> ‘won’t spend Christmas with Charles or William’ after Endgame drama – while others given first time invite",
        "description": "PRINCE Harry won’t be spending Christmas with Charles or William in the UK after explosive claims were revealed in Omid Scobie’s Endgame, it’s believed. Instead, Charles will"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846266/prince-harry-meghan-markle-christmas-card-fans",
        "title": "<b>Prince Harry</b> and Meghan Markle leave fans baffled with bizarre Christmas card detail",
        "description": "Prince Harry and Meghan Markle&#39;s Christmas card for 2023 featured one big omission and a baffling addition and royal fans took notice."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846263/prince-harry-christmas-present-meghan-markle-prince-archie",
        "title": "<b>Prince Harry</b> &#39;roared&#39; after opening Xmas present from Meghan Markle that Archie &#39;smashed&#39;",
        "description": "Prince Harry and Meghan Markle will once again reportedly spend Christmas in the US due to the &quot;hostility&quot; with the Royal Family."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/prince-harry-piers-morgan-phone-hack-perjury-b2465201.html",
        "title": "Top judge says anyone who lied to phone hacking inquiry should be prosecuted for perjury",
        "description": "A top judge has said anyone who lied to the phone hacking inquiry should be prosecuted for perjury after a court found there could be “no doubt&quot; editors at Mirror Group Newspapers knew about intercepted voicemails."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghan-given-netflix-gold-31686066",
        "title": "<b>Harry</b> and Meghan have given Netflix &#39;gold dust&#39; for future dramatisations like The Crown",
        "description": "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, have given Netflix &#39;gold dust&#39; for future dramatisations, it has been claimed by an expert amid the new series of The Crown"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23993710.policing-cant-done-cheap-get-bobbies-back-beat/",
        "title": "Policing can&#39;t be done on the cheap. Get bobbies back on the beat",
        "description": "I WAS not surprised to learn that Police Scotland proposes to close 29 police stations in an effort to save money. Since Police Scotland"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/16/the-crown-monarchy-series-showdown-changed-royal-family/",
        "title": "The Crown vs The Monarchy: inside the six-series showdown that changed the Royal family forever",
        "description": "Again, as with credence in the truth of the series, that support varied dramatically with age. While 80 per cent of the over-65s support the monarchy, barely a third of 18 to 24-year-olds do. The survival and success of the real royal institution, then, is by no means guaranteed."
    },
    {
        "url": "https://www.modernghana.com/videonews/0/1/386909/",
        "title": "<b>Prince Harry</b>: Piers Morgan denies Daily Mirror phone hacking involvement - BBC News",
        "description": "ABC ALJazeera BBC CitiTV CNN DW France24 NBC Net2TV Others RT TV3 UTV DelayTV KofiTV MagrahebTV ModernGhana \\| Movies Documentaries. State secrets lost: Swalwell blasts Trump over"
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/23987218.william-kate-to-send-children-marlborough-college/",
        "title": "William and Kate &#39;to send children to Marlborough College’",
        "description": "The royal family have decided on the future of Prince George’s education after months of toying between two prestigious colleges, an inside"
    },
    {
        "url": "https://www.ok.co.uk/royal/princess-diana-william-harry-christmas-31465366",
        "title": "Diana always took away some of William and <b>Harry</b>&#39;s Christmas gifts for crucial reason",
        "description": "According to her former bodyguard, Diana, Princess of Wales would often give away some of Prince William and Prince Harry&#39;s Christmas presents away to keep their feet on the ground"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-67734386",
        "title": "Newspaper headlines: &#39;Question of Sport axed&#39; and &#39;half-price Christmas&#39;",
        "description": "In its headline, it includes a quote from <b>Prince Harry</b> calling it a &quot;great day for truth&quot;. It notes a remark from the judge that &quot;extensive&quot; phone hacking had taken place at the newspaper group during the period concerned. Image caption, &quot;RIP Zak&quot; says the ..."
    },
    {
        "url": "https://news.sky.com/story/seasons-greetings-from-harry-and-meghan-as-couple-release-christmas-message-13031466",
        "title": "Season&#39;s greetings from <b>Harry</b> and Meghan as couple release Christmas message",
        "description": "Meghan and Harry used a photo from the closing ceremony of the 2023 Invictus Games, which took place in September in Dusseldorf, Germany."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12870377/Zoe-Saldana-holding-hands-husband-Marco-Perego-Montecito.html",
        "title": "Zoe Saldana spotted holding hands with husband Marco Perego at Montecito farmer&#39;s market... after spending $17.5M on a new house in the chic beachside enclave",
        "description": "The Avatar star, 45, and her family bought a $17.5 million mansion this fall in the city that is home to Meghan Markle and Prince Harry , Oprah Winfrey, and Ellen DeGeneres and Portia de Rossi."
    },
    {
        "url": "https://bylinetimes.com/2023/12/15/getting-away-with-murder-what-harrys-win-against-the-mirror-means-for-murdoch-and-the-mail/",
        "title": "Getting Away with Murder? What <b>Harry</b>’s Win Against the Mirror Means for Murdoch and the Mail",
        "description": "The judgment of Justice Fancourt establishes a clear link between the ‘criminal media nexus’ of corrupt cops, journalists and the murders of Stephen Lawrence and Daniel Morgan to feature in trials nex"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12870267/PLATELLS-PEOPLE-Sussexes-felt-world-Spare-fastest-selling-non-fiction-book-88million-Netflix-deal-bag-year-sanctimonious-bubble-burst.html",
        "title": "PLATELL&#39;S PEOPLE: The Sussexes must have felt on top of the world with Spare the fastest-selling non-fiction book ever and a &#39;£88million Netflix deal&#39; in the bag... So why was ...",
        "description": "Spare became the fastest-selling non-fiction book ever, with more than 3.2 million copies shifted in the first week. At the time, the Sussexes, must have felt on top of the world."
    },
    {
        "url": "https://www.harpersbazaar.com/uk/culture/culture-news/a46152262/prince-harry-meghan-markle-christmas-card-2023/",
        "title": "The Duke and Duchess of Sussex release their 2023 Christmas card",
        "description": "The Sussexes are getting into the festive spirit. <b>Prince Harry</b> and Meghan have released their 2023 Christmas card, which features a photo of the couple laughing and clapping at the closing ceremony of the 2023 Invictus Games. For the event, the duchess ..."
    },
    {
        "url": "https://goss.ie/uk-showbiz/piers-morgan-claims-prince-harry-and-meghan-markle-are-on-a-mission-to-destroy-the-british-monarchy-362800",
        "title": "Piers Morgan claims <b>Prince Harry</b> and Meghan Markle are on a mission to ‘destroy the British monarchy’",
        "description": "Piers Morgan has claimed <b>Prince Harry</b> and Meghan Markle are on a mission to “destroy the British monarchy”. His latest war of words against the Duke and Duchess of Sussex has come after <b>Harry</b> was awarded damages in his phone hacking trial against ..."
    },
    {
        "url": "https://uk.news.yahoo.com/crown-star-imelda-staunton-found-014937093.html",
        "title": "‘The Crown’ Star Imelda Staunton Found Filming Final Episodes After Queen Elizabeth II’s Death ‘Very Odd’",
        "description": "“It’s that and glimpses of whatever [<b>Prince] Harry</b> says in his book. You devour it, like a truffle.” Through it all, Staunton is ultimately appreciative of getting to play this historical figure. “There’s a lot that she has to carry and absor"
    },
    {
        "url": "https://www.bbc.com/news/uk-67732229",
        "title": "Mirror hacking case: <b>Prince Harry</b> has last laugh but &#39;mission&#39; goes on",
        "description": "There is little doubt the High Court ruling that Prince Harry was a victim of phone hacking by Mirror Group Newspapers on multiple occasions has huge implications."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-claims-phone-hacking-case-mirror-newspapers-0fk20lpvm?ilc=timesradio:morefromthetimes",
        "title": "The 33 claims <b>Prince Harry</b> made in the Mirror phone hacking case",
        "description": "The Duke of Sussex alleged that 148 stories published by Mirror Group Newspapers between 1996 and 2010 were obtained through unlawful means, such as hacking"
    },
    {
        "url": "https://www.bbc.com/news/uk-67732436",
        "title": "Piers Morgan and hacking: What the <b>Prince Harry</b> case heard",
        "description": "Prince Harry has hailed the phone hacking ruling as a &quot;great day for truth&quot;. And the truth is, according to the judgement, that editors and powerful executives at the Mirror Group Newspapers knew of phone hacking - and the judge accepted evidence that it included former Daily Mirror editor Piers Morgan."
    },
    {
        "url": "https://inews.co.uk/news/police-consider-prince-harry-phone-hacking-2812360?ico=most_popular",
        "title": "Police to ‘carefully consider’ <b>Prince Harry</b> phone hacking ruling",
        "description": "The Duke of Sussex has called for a fresh police investigation into phone hacking after the High Court ruled that 15 articles published by the Daily Mirror and two sister titles were linked to illegal"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/15/prince-harry-wins-partial-victory-phone-hacking-case-daily-mirror?ref=biztoc.com",
        "title": "<b>Prince Harry</b> hails phone-hacking case win as ‘great day for truth’",
        "description": "Duke awarded £140,600 in damages after judge rules articles were product of hacking or unlawful information gathering"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0gzs598",
        "title": "The <b>Prince</b> and the Papers",
        "description": "The High Court rules Prince Harry was a victim of phone hacking by Mirror Group papers."
    },
    {
        "url": "https://uk.style.yahoo.com/british-tabloids-hacked-prince-harrys-172747566.html",
        "title": "British tabloids hacked <b>Prince Harry</b>&#39;s phone for years, a judge rules — and it started when he was 19",
        "description": "In his complaint, Prince Harry alleged Mirror Group outlets illegally gathered information on him from 1991 to 2011."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/15/extensive-hacking-mirror-newspapers-prince-harry/",
        "title": "<b>Prince Harry</b> was victim of phone hacking by Mirror newspapers, judge rules",
        "description": "Duke of Sussex awarded £140,600 in damages as court finds some articles about him were result of unlawful information-gathering"
    },
    {
        "url": "https://news.sky.com/story/prince-harry-phone-hacking-and-the-executives-who-knew-13031014",
        "title": "<b>Prince Harry</b>, phone hacking and the executives who knew",
        "description": "Prince Harry has claimed victory in a landmark court case against one of Britain&#39;s biggest news publishers - the Mirror Group - with a High Court judge finding the company&#39;s practice of phone hacking was &quot;extensive&quot; as well as its use of private investigators to illegally gather information to write stories for its newspapers."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-archie-lilibet-royal-31653962?int_source=nba",
        "title": "<b>Prince Harry</b> &#39;has not turned his back on UK&#39; and California life is &#39;not permanent&#39;",
        "description": "Rumours persist that <b>Prince Harry</b> is keen to reunite with his family this Christmas, as well as start to introduce his two young children - <b>Prince</b> Archie and Princess Lilibet - to the royal traditions he grew up with. Despite now living full-time in the US, the couple confirmed they wished for their children - who are sixth and seventh in line to the throne - to be styled as a <b>Prince</b> and a ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-kate-middleton-meeting-31598735",
        "title": "King Charles and Kate Middleton meeting &#39;confirmed&#39; after Omid Scobie&#39;s revelations",
        "description": "King Charles and Kate Middleton will meet for the first time on Tuesday since being named in Omid Scobie&#39;s book Endgame as the senior royals who allegedly spoke of “concerns” about the skin colour of <b>Prince Harry</b> and his wife Meghan’s son Archie ..."
    },
    {
        "url": "https://www.irishtimes.com/video/video/2023/12/16/she-gave-me-hope-thai-hostages-friendship-with-israeli-child/",
        "title": "‘She Gave Me Hope’: Thai hostage’s friendship with Israeli child",
        "description": "Thai hostage Nutthawaree Munkan was held by Hamas for 50 days. Trapped underground, a 5-year-old Israeli child gave her hope that she’d make it. Video: NYT"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-royal-family-news-meghan-markle-could-return-to-the-royal-family-under-this-condition-101702723407487.html",
        "title": "Meghan Markle &#39;could return&#39; to the royal family under this condition",
        "description": "Meghan Markle could return to the royal family under an unlikely condition, a royal expert said. Tom Quinn, author of Scandals of the ‘Royal Palaces: An Intimate Memoir of Royals Behaving Badly’ claimed that the Duchess of Sussex could return."
    },
    {
        "url": "https://news.sky.com/story/ive-never-hacked-a-phone-piers-morgans-defence-as-he-launches-rant-against-prince-harry-13031082",
        "title": "&#39;I&#39;ve never hacked a phone&#39;: Piers Morgan&#39;s defence as he launches rant against <b>Prince Harry</b>",
        "description": "Piers Morgan, who was editor of The Mirror from 1995 to 2004, also accused Prince Harry of a &quot;hypocritical&quot; approach to privacy. It came after the royal hailed a judge&#39;s ruling that hacking had been &quot;widespread&quot; at the newspaper."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67732229?at_medium=RSS",
        "title": "Mirror hacking case: <b>Prince Harry</b> has last laugh but &#39;mission&#39; goes on",
        "description": "There is little doubt the High Court ruling that Prince Harry was a victim of phone hacking by Mirror Group Newspapers on multiple occasions has huge implications."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-meghan-markle-christmas-31685669",
        "title": "Meghan and <b>Harry</b> release their official 2023 Christmas card and thank fans for support",
        "description": "Prince Harry and Meghan Markle have released their official Christmas card just over a week before the big day, and have treated some lucky recipients to the virtual greeting"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-daily-mirror-lawsuit_n_657c9d15e4b036ecab44eb11",
        "title": "<b>Prince Harry</b> Gets Historic Victory As Judge Finds British Tabloid Hacked His Phone",
        "description": "LONDON (AP) — Prince Harry’s phone was hacked by journalists and private investigators working for the Daily Mirror who invaded his privacy by snooping on him unlawfully, a judge ruled Friday, delivering an historic victory for the estranged royal who broke from family tradition to take on the British press."
    },
    {
        "url": "https://www.itv.com/news/2023-12-15/prince-harry-judge-finds-extensive-phone-hacking-by-mirror-group-newspapers",
        "title": "<b>Harry</b> claims vindication after court rules Mirror did hack his phone - but Piers Morgan hits back",
        "description": "The Duke of Sussex had claimed journalists at titles such as the Mirror were linked to methods including phone hacking. | ITV National News"
    },
    {
        "url": "https://www.vogue.co.uk/article/harry-meghan-christmas-card-2023",
        "title": "The Deeper Meaning Behind The Duke &amp; Duchess Of Sussex’s 2023 Christmas Card",
        "description": "Prince Harry and Meghan Markle sent a virtual holiday card on behalf of their foundation, Archewell. It showed a picture of them smiling and clapping at the 2023 Invictus Games in Düsseldorf – the multi-sport tournament for wounded and injured veterans that Prince Harry founded in 2014."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-prince-harry-shared-214900876.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Have Shared Their 2023 Holiday Card",
        "description": "Prince Harry and Meghan Markle have joined royals around the world in sharing their annual holiday card."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harrys-lawsuits-against-u-214124903.html",
        "title": "<b>Prince Harry</b>&#39;s Lawsuits Against U.K. Tabloids: Everything to Know About His 4 Court Cases",
        "description": "The Duke of Sussex has said the &quot;mission of changing the media landscape within the U.K.&quot; has become part of his life&#39;s work"
    },
    {
        "url": "https://www.itv.com/news/2023-12-15/the-15-prince-harry-articles-which-came-from-phone-hacking-or-unlawful-activity",
        "title": "MGN vs <b>Prince Harry</b>: The 15 articles which came from phone hacking or unlawful activity",
        "description": "Harry has alleged that 148 stories from 1996 to 2010 used information obtained through unlawful means, such as phone hacking. | ITV National News"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12869779/Harry-Meghans-Christmas-card-wishes-happy-holiday-season-Duke-Duchess-thanks-fans-support-2023-release-festive-greeting-card.html",
        "title": "Happy Holidays from <b>Harry</b> and Meghan! Sussexes thank fans for &#39;all the support in 2023&#39; as they release professional Christmas card without their kids using a photo from the ...",
        "description": "The Duke and Duchess used a photograph of them applauding, thanking their fans for &#39;all the support in 2023&#39;. The release of the swanky card comes just hours after the Prince won £140,000 from the Mirror&#39;s publisher after the High Court ruled he was a victim of phone hacking."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/15/mission-continues-prince-harry-legal-crusade-against-uk-media",
        "title": "‘Mission continues’ for <b>Prince Harry</b> in his legal crusade against UK media",
        "description": "Duke of Sussex has been burned by his battle with the press but will feel vindicated by phone-hacking verdict"
    },
    {
        "url": "https://www.channel4.com/news/prince-harry-was-victim-of-phone-hacking-by-mirror-newspapers-court-rules",
        "title": "<b>Prince Harry</b> was victim of phone-hacking by Mirror Newspapers, court rules",
        "description": "Mirror Group Newspapers have issued an “unreserved apology” for any historical wrongdoing – after the High Court ruled that Prince Harry had been the victim of phone hacking and awarded him £140,000 in damages."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/harry-phone-hacking-court-piers-morgan-high-court-metropolitan-police-duke-of-sussex-b1127346.html",
        "title": "Duke of Sussex demands police probe after High Court phone hacking ruling",
        "description": "The Duke of Sussex has called on the police to investigate a tabloid newspaper publisher after being awarded nearly £150,000 in damages in his High Court phone-hacking claim."
    },
    {
        "url": "https://www.instyle.com/meghan-markle-prince-harry-2023-holiday-card-8416947",
        "title": "Meghan Markle and <b>Prince Harry</b>’s 2023 Holiday Card Is Finally Here",
        "description": "Meghan Markle and Prince Harry&#39;s 2023 holiday card has finally been revealed — and it features a photo from the 2023 Invictus Games."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67732436",
        "title": "Piers Morgan and hacking: What the <b>Prince Harry</b> case heard",
        "description": "Prince Harry has hailed the phone hacking ruling as a &quot;great day for truth&quot;. And the truth is, according to the judgement, that editors and powerful executives at the Mirror Group Newspapers knew of phone hacking - and the judge accepted evidence that it included former Daily Mirror editor Piers Morgan."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12868243/Prince-Harry-Mirror-High-Court-phone-hacking.html",
        "title": "<b>Prince Harry</b> wins £140,000 from the Mirror&#39;s publisher after High Court rules he was the victim of phone hacking between 2003 and 2009",
        "description": "The Duke of Sussex &#39;s case was &#39;proved in part&#39;, said Mr Justice Fancourt. Journalists at the Sunday Mirror, the People and the Daily Mirror had unlawfully obtained Harry&#39;s private information for stories."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-hacked-court-judgement-2811864?ico=most_popular",
        "title": "The 15 times <b>Prince Harry</b> was hacked – court judgment explained",
        "description": "Duke declares High Court ruling a &#39;great day for truth&#39; - but it is not without nuance and has wider implications for the Prince and the media"
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46107520/prince-harry-meghan-markle-christmas-card-2023/",
        "title": "<b>Prince Harry</b> and Duchess Meghan Release Their Festive 2023 Christmas Card",
        "description": "Today, Prince Harry and Duchess Meghan released their 2023 Christmas card, which features a photo of the couple laughing and clapping at the closing ceremony of the 2023 Invictus Games."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/prince-harry-phone-hacking-trial-mirror-latest-b2464238.html?page=5",
        "title": "<b>Prince Harry</b> phone hacking – live: Piers Morgan denies wrongdoing as judge rules Duke was Mirror victim",
        "description": "Prince Harry has accused the Mirror publisher of “vendetta journalism” in a scathing attack following the High Court judgement that he was a victim of phone hacking. The Duke of Sussex has won damages of £140,600 against Mirror Group Newspapers (MGN) in a major boost to his campaign against Britain’s tabloid media."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-and-meghan-thank-fans-for-all-the-support-in-2023-as-they-release-christma/",
        "title": "<b>Harry</b> and Meghan thank fans for &#39;all the support in 2023&#39; as they release Christmas card",
        "description": "Prince Harry and Meghan Markle have released their official Christmas card for this year - thanking their fans for &#39;all the support in 2023&#39;."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/15/prince-harry-daily-mirror-hacking-claim-live/?n=@",
        "title": "<b>Prince Harry</b> ‘on mission to destroy monarchy’, says Piers Morgan",
        "description": "Prince Harry has urged the Metropolitan Police to investigate bringing charges against individuals at Mirror Group Newspapers as he accused senior editors - including Piers Morgan - of being involved in, or aware of, illegal activities."
    },
    {
        "url": "https://uk.yahoo.com/?_guc_consent_skip=1701873062",
        "title": "Yahoo UK | News, email and search",
        "description": "<b>Prince Harry</b> partially won a phone hacking claim against tabloid newspaper publisher Mirror Group Newspapers (MGN) on Friday - and immediately called out Piers Morgan. As Alex Batty prepares to reunite with his family after being &#39;abducted&#39; by his mother ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-prince-harry-christmas-b2465036.html",
        "title": "Meghan Markle and <b>Prince Harry</b> unveil 2023 Christmas card",
        "description": "Meghan Markle and Prince Harry are ringing in the holiday season with their 2023 Christmas cards. On Friday 15 December, the Duke and Duchess of Sussex sent out an email with their virtual Christmas cards on behalf of their Archewell organisation. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads."
    },
    {
        "url": "https://inews.co.uk/news/police-consider-prince-harry-phone-hacking-2812360?ico=above_article_ticker",
        "title": "Police to ‘carefully consider’ <b>Prince Harry</b> phone hacking ruling",
        "description": "The Duke of Sussex has called for a fresh police investigation into phone hacking after the High Court ruled that 15 articles published by the Daily Mirror and two sister titles were linked to illegal"
    },
    {
        "url": "https://www.bbc.com/news/live/uk-67707931?pinned_post_locator=urn:asset:beb8ceff-3cb4-4690-8376-1ac969c2dd66&pinned_post_asset_id=657c897787855b2dac7d4782&pinned_post_type=share",
        "title": "Piers Morgan denies hacking after judge rules <b>Harry</b> was Mirror victim",
        "description": "In a 386-page ruling, a judge found that Prince Harry had been a victim of phone hacking by Mirror Group Newspapers (MGN). The royal was awarded £140,600 in damages and called this &quot;a great day for truth as well as accountability&quot;."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/al-jazeera-cameraman-dies-after-missile-strike-in-gazas-khan-younis-channel-says/",
        "title": "Al Jazeera cameraman dies after missile strike in Gaza&#39;s Khan Younis, channel says",
        "description": "An Al Jazeera cameraman injured in a missile strike on Gaza has died, the broadcaster says. Two journalists working for the Qatari-based television network were hurt in the blast in southern Gaza, the channel reported earlier today. Cameraman Samer Abu Daqqa has now died from his injuries, Al Jazeera says."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/heres-crown-honors-queen-elizabeth-181212018.html",
        "title": "Here&#39;s How &#39;The Crown&#39; Honors Queen Elizabeth in Its Final Episode",
        "description": "The final moments of The Crown have a lot to accomplish. Creator Peter Morgan&#39;s decades-spanning love letter to Queen Elizabeth II has finally come to an end after six seasons, three casts, and dozens of iconic moments in the British royal family."
    },
    {
        "url": "https://news.sky.com/story/prince-harry-hacking-case-latest-prince-harry-says-he-has-slayed-dragon-as-judge-rules-he-was-hacked-mirror-publisher-reacts-13030737",
        "title": "<b>Prince Harry</b> hacking case - latest: Piers Morgan breaks silence after judge in <b>Harry</b> case said it was &#39;convincing&#39; he knew about phone hacking",
        "description": "The Duke of Sussex was hacked, the judge ruled in his privacy case against Mirror Group Newspapers as he awarded him more than £140,000 in damages. The duke&#39;s lawyer read a statement from him outside court,"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/15/prince-harry-daily-mirror-hacking-claim-live/",
        "title": "<b>Prince Harry</b> phone hacking: Duke &#39;on mission to destroy monarchy&#39;, says Piers Morgan in furious response",
        "description": "Prince Harry has urged the Metropolitan Police to investigate bringing criminal charges against individuals at Mirror Group Newspapers. Reading a statement on the Duke of Sussex’s behalf outside the High Court, his lawyer David Sherborne said: “Today is a great day for truth, as well as accountability."
    },
    {
        "url": "https://www.sharecast.com/news/news-and-announcements/uks-prince-harry-wins-damages-from-daily-mirror-over-phone-hacking--15619526.html",
        "title": "UK&#39;s <b>Prince Harry</b> wins damages from Daily Mirror over phone hacking",
        "description": "Britain&#39;s Prince Harry on Friday won a substantial part of his phone-hacking case against the Reach-owned Daily Mirror tabloid newspaper and other titles."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-victim-phone-hacking-122322927.html",
        "title": "<b>Prince Harry</b> Was a Victim of Phone Hacking by the &#39;Mirror&#39; Publishers, Court Rules",
        "description": "Prince Harry was the victim of phone hacking by Mirror Group Newspapers (MGN), a judge has ruled as part of the Duke of Sussex&#39; court case against the publisher. This ruling constitutes a partial victory for the royal, who is currently involved in several other court cases in which he alleges invasions of privacy on the part of British tabloids."
    },
    {
        "url": "https://www.vogue.co.uk/article/the-crown-should-have-ended-years-ago",
        "title": "The Crown Should Have Ended Years Ago. There, I Said It.",
        "description": "Rufus Kampa’s Princes William and Fflyn Edwards’s <b>Prince Harry</b> are walking solemnly behind her coffin. There are moments that inspire genuine emotion, including when the world hears of Diana’s passing, but this perhaps has more to do with our own ..."
    }
]