[
    {
        "url": "https://www.express.co.uk/news/royal/1859879/prince-harry-meghan-markle-shame",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s shame laid bare in key detail on website",
        "description": "Prince Harry and Meghan signed a Spotify deal which came to an abrupt end, saying the decision was &quot;mutual&quot; and they were &quot;proud&quot; of what they achieved."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25489540/meghan-markle-prince-harrys-biggest-gaffes-revealed/",
        "title": "Meghan Markle and <b>Prince Harry</b>’s biggest gaffes revealed – from Jamaica visit to Lilibet name",
        "description": "MEGHAN Markle and Prince Harry’s biggest gaffes have been revealed – from their Jamaica visit to naming their youngest Lilibet. The Duke and Duchess of Sussex have shown their"
    },
    {
        "url": "https://uk.style.yahoo.com/truman-capote-answered-prayers-real-203700179.html",
        "title": "Truman Capote on &#39;Answered Prayers&#39; and Real-Life Swans",
        "description": "Marilyn Monroe was very amusing when she felt sufficiently relaxed and had had enough to drink. The same might be said of the lamented screen scenarist <b>Harry</b> Kurnitz, an exceedingly homely gentleman who conquered men and women and children of all classes ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-relationship-dangerous-stepmother-31965230",
        "title": "<b>Prince Harry</b>&#39;s relationship with &#39;dangerous&#39; stepmother Camilla exposed in documentary",
        "description": "A new Channel 4 documentary about Queen Camilla is set to address her relationship with Prince Harry, who described his step-mother as &#39;dangerous&#39; in his autobiography Spare"
    },
    {
        "url": "https://www.heraldscotland.com/news/12123692.anger-at-royal-shotgun-antics/",
        "title": "Anger at royal shotgun antics",
        "description": "PRINCE Charles was criticised last night by safety experts for fooling around with his son Harry while the youngster was holding a 12-bore"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-chemistry-182818660.html",
        "title": "<b>Prince Harry</b> and Meghan Markle’s ‘chemistry’ caught on camera in Jamaica",
        "description": "The Duke and Duchess of Sussex recently attended a screening of the forthcoming Bob Marley biopic, which stars Kingsley Ben-Adir as the Jamaican singer-songwriter, at the Carib Theatre in Kingston on 23 January. In a video posted to TikTok, one fan captured the touching moment Meghan, 42, reached for Harry, 39, during the event."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-slammed-31965201",
        "title": "<b>Prince Harry</b> and Meghan Markle slammed for publicly ignoring Kate and Charles&#39; health issues",
        "description": "The Sussexes have chosen to remain silent while the Princess of Wales is recovering in hospital from abdominal surgery and the King is preparing for a corrective procedure on an enlarged prostate."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middletons-hot-cold-nature-31962551",
        "title": "<b>Prince Harry</b>&#39;s hot and cold nature as he&#39;s &#39;your best friend one minute&#39; and &#39;enemy the next&#39;, claims expert",
        "description": "A royal expert has compared Prince Harry&#39;s personality to Princess Diana, revealing he can be &#39;be your best friend one minute&#39; but &#39;your worst enemy&#39; the next."
    },
    {
        "url": "https://metro.co.uk/2024/01/25/paul-burrell-really-believes-princess-dianas-ghost-haunting-20171529/?ico=read_full_story_videotrendingbar",
        "title": "The moment Paul Burrell believes Princess Diana’s ghost sends apology from beyond the grave",
        "description": "Paul Burrell is convinced that he is being haunted by the ghost of Princess Diana and the moment he allegedly makes contact with her has been captured."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-exploiting-31963244.amp",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;exploiting every chance&#39; to avoid Kate Middleton",
        "description": "Meghan Markle and Prince Harry reportedly reached out to King Charles and the Princess of Wales in private, but have not made a public statement about their recent health scares"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13005185/anti-royal-jamaican-mp-harry-meghan-goodbye-monarchy-backlash-lgbt-flag-disrespectful.html",
        "title": "The anti-royal Jamaican MP who posed with <b>Harry</b> and Meghan: How republican supporting minister who wants to &#39;say goodbye&#39; to the monarchy was hit with furious backlash after ...",
        "description": "The Duke and Duchess of Sussex joined Marlene Malahoo Forte, minister for legal and constitutional affairs, in Kingston, Jamaica, on Tuesday night to promote new Bob Marley movie One Love."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13004597/Harry-Meghan-invited-Bob-Marley-premiere-Jamaica-Paramount-boss-Brian-Robbins.html",
        "title": "<b>Harry</b> and Meghan were invited to Bob Marley premiere in Jamaica by Paramount boss - after &#39;insensitive&#39; Duke and Duchess were slammed for posing with anti-royal Prime Minister ...",
        "description": "The Duke and Duchess of Sussex are friends with the family of Brian Robbins, a source told MailOnline. The father-of-three is the chief executive of both Paramount Pictures and Nickelodeon."
    },
    {
        "url": "https://uk.news.yahoo.com/body-language-expert-says-meghan-152900930.html",
        "title": "A Body Language Expert Says Meghan Markle And <b>Prince Harry</b> Showed &#39;Unity&#39; At Film Premiere",
        "description": "A body language expert weighed in on Meghan Markle and Prince Harry&#39;s body language during the premiere of &#39;Bob Marley: One Love&#39; in Kingston, Jamaica."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1859672/prince-harry-meghan-markle-paramount",
        "title": "<b>Prince Harry</b> and Meghan Markle eye up new Hollywood project as Netflix contract nears end",
        "description": "Prince Harry and Meghan Markle signed a deal with Netflix upon leaving the Royal Family, however their current contract is due to expire in 2025."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25467291/prince-harry-guilt-kate-charles-health-news/",
        "title": "<b>Prince Harry</b> ‘feels a huge amount of guilt’ as Kate &amp; Charles health news ‘shakes some sense’ into him, expert claims",
        "description": "<b>PRINCE Harry</b> will be feeling “a huge amount of guilt and be sick with worry” over his family’s recent health scares - and could even make a surprise trip back to the UK following the &quot;shock&quot; news. The Princess of Wales, 42, is still recovering at the ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/lionsgate-alternative-television-signs-uta-180000842.html",
        "title": "Lionsgate Alternative Television Signs With UTA",
        "description": "More from Deadline Pulitzer-Winning Playwright &amp; Actor Tracy Letts Signs With UTA UTA Signs &#39;The Crown&#39;s <b>Prince Harry</b>, Luther Ford Lionsgate Launches Alternative TV Division With eOne Assets, Hires Dirk Hoogstra Lionsgate launched the division earlier in ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-gap-yah-necklace-055000350.html",
        "title": "<b>Prince Harry</b>’s &#39;gap yah&#39; necklace is a sex-charged catwalk hit",
        "description": "Prince Harry&#39;s signature rope pendant necklace sees him join legions of fashion boys subverting the &#39;gap yah&#39; staple this season, says"
    },
    {
        "url": "https://www.hellomagazine.com/brides/512031/zara-tindall-figure-skimming-wedding-guest-dress-beehive-hair/",
        "title": "Zara Tindall amps up the glamour in figure-skimming wedding guest dress and beehive hair",
        "description": "Zara fastened her blonde locks in a French twist with the added volume of a beehive at the crown of her head. The Princess Royal has remained a loyal fan of the beehive through the decades, with Claudia Harrison (who plays Princess Anne in The Crown) telling Marie Claire: &quot;It&#39;s like armour.&quot;"
    },
    {
        "url": "https://www.hellomagazine.com/homes/512025/prince-harry-and-meghan-markles-grand-dining-room-at-montecito-mansion-fit-for-a-castle/",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s grand dining room at $30m Montecito mansion is fit for a castle",
        "description": "Prince Harry and Meghan Markle might have swapped the Crown Estate in Windsor for sunny California four years ago, but the interiors at their Montecito mansion remain fit for royalty."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/kate-middleton-health-very-worrying-28513512",
        "title": "Kate Middleton health &#39;very worrying&#39; and she&#39;ll be laid up &#39;longer than we think&#39;",
        "description": "Never before has a royal been so open. And you know, one in eight men get this prostate problem.&quot; Nana said she is &quot;not surprised&quot; <b>Prince Harry</b> and Meghan Markle have stayed silent. Nana told GB News: &quot;Meghan has not yet gone to visit her father as far as ..."
    },
    {
        "url": "https://madamenoire.com/1359646/meghan-markle-prince-harry-one-live-movie-premiere-jamaica/",
        "title": "Meghan Markle And <b>Prince Harry</b> Spend Date Night At ‘Bob Marley: One Love’ Movie Premiere",
        "description": "Meghan Markel and Prince Harry’s latest date night was at the Bob Marley: One Love movie premiere in Jamaica."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/royal-news-roundup-sarah-ferguson-194056202.html",
        "title": "Royal News Roundup: Sarah Ferguson’s Health Update, a Beautiful Photo of Queen Camilla &amp; More",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/princess-diana-tragic-death-reportedly-193650506.html",
        "title": "Princess Diana’s Tragic Death Reportedly Helped Prepare <b>Prince</b> William for His New Parenting Role",
        "description": "When Princess Diana’s young life tragically ended in a car crash in 1997, the whole world mourned. But nobody more than her two children, Prince William and Prince Harry, who were only 15 and 12 at the time."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/25/65b2c0e1e2704eedba8b459c.html",
        "title": "Why did the Royal Family differ in response to King Charles and Kate Middleton&#39;s surgeries?",
        "description": "King Charles and Kate Middleton recently disclosed their respective medical procedures, with the former opting for transparency and the latter choosing to keep the details of her s"
    },
    {
        "url": "https://uk.movies.yahoo.com/king-harald-norway-says-wont-185640810.html",
        "title": "King Harald of Norway Says He Won&#39;t Abdicate Like Queen Margrethe of Denmark: &#39;It Lasts for Life&#39;",
        "description": "“No, I don&#39;t really have it. I stand by what I have said all along. I have taken an oath to the Storting, and it lasts for life,” King Harald said, referring to the promise he made to the Norwegian Parliament when he acceded the throne in 1991."
    },
    {
        "url": "https://pagesix.com/2024/01/25/royal-family/why-king-charles-revealed-his-surgery-while-kate-middleton-hid-hers/",
        "title": "Why King Charles revealed his surgery while Kate Middleton hid hers",
        "description": "The Princess of Wales, 42, and the head of the British monarchy, 75, announced their respective surgeries on the same day."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151301-austin-butler-on-sharing-one-major-quality-with-bastions-of-mid-century",
        "title": "Austin Butler on sharing one major quality with bastions of mid-century: Deets inside",
        "description": "Austin Butler has weighed in on depicting mid-century men in most of his recent movies.Speaking to Entertainment Weekly, Butler said, “For whatever reason, I ended up playing in this space"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1151295-amanda-holden-spills-the-tea-about-simon-cowells-changing-look-on-bgt",
        "title": "Amanda Holden spills the tea about Simon Cowell’s changing look on BGT",
        "description": "Amanda Holden has recently opened up about her co-judge Simon Cowell’s ever-changing look on Britain’s Got Talent.Speaking to Sofia Vergara on Heart Breakfast on Thursday,"
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middletons-mum-steps-help-31969081",
        "title": "Kate Middleton&#39;s mum &#39;steps in to help with royal kids&#39; during daughter&#39;s hospital stay",
        "description": "The Princess of Wales is expected to remain in hospital for a while longer after undergoing surgery – so her mum is reportedly &#39;stepping in to help with her royal grandchildren&#39;"
    },
    {
        "url": "https://www.pinkvilla.com/tv/news/dance-deewane-promo-madhuri-dixit-and-suniel-shettys-jaws-drop-seeing-73-year-old-contestants-item-dance-1274051",
        "title": "Dance Deewane PROMO: Madhuri Dixit and Suniel Shetty&#39;s jaws drop seeing 73-year-old contestant&#39;s &#39;item&#39; dance",
        "description": "In Dance Deewane&#39;s new promo, we see a 73-year-old contestant receiving applause from judges Madhuri Dixit and Suniel Shetty after her performance. Read on!"
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2943573/prince-harry-meghan-markle-jamaica-prime-minister-exit-commonwealth/",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle’s Photo With Jamaican Prime Minister Might Not Please King Charles",
        "description": "Prince Harry and Meghan Markle ‘s appearance at the red-carpet premiere of Bob Marley: One Love on Tuesday night was a delightful surprise. With their low-key approach to media these days, the photos show the Montecito couple living their best lives."
    },
    {
        "url": "https://www.keysnews.com/news/national/harry-and-meghan-are-trashing-the-royal-family-to-raise-their-profile-says-commentator/video_adacc3b9-2672-5beb-8d57-a524365215dd.html",
        "title": "<b>Harry</b> and Meghan are &#39;trashing&#39; the Royal Family to raise their profile, says commentator",
        "description": "The Duke and Duchess of Sussex are “trashing” the Royal Family in an attempt to raise their public profile, according to commentator Richard Fitzwilliams.He was discussing the visit to Jamaica"
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/meghan-markle-and-prince-harry-make-surprise-entry-at-bob-marley-movie-premiere-deets-inside-1273993",
        "title": "Meghan Markle And <b>Prince Harry</b> Make Surprise Entry At Bob Marley Movie Premiere; DEETS Inside",
        "description": "Prince Harry and Meghan Markle made a surprise appearance at the premiere of Bob Marley: One Love in Jamaica, walking the red carpet hand-in-hand."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-hospital-visit-queen-camilla-king-charles-b2484472.html?page=3",
        "title": "Royal news – live: Kate’s surgery ‘surprised’ family friends as Sarah Ferguson gives health update",
        "description": "On Friday (19 January), the actor hosted the Living Legends of Aviation ceremony in Los Angeles, where <b>Prince Harry</b> was recognised for his work as a British Army veteran and pilot. <b>Prince Harry</b> has proven once again he’s Meghan Markle’s biggest fan."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markles-royal-exit-source-regret-monarchy-says-author-1722985",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s Royal Exit A &#39;Source Of Regret&#39; For Monarchy, Says Author",
        "description": "The Duke and Duchess of Sussex stepped back from their royal duties in 2020 and now run their own non-profit organisation in California."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-william-meghan-jamaica-b2484541.html",
        "title": "<b>Harry</b> and Meghan pose with PM who doesn’t want William as King",
        "description": "Meanwhile, Kate is not expected to return to work until after Easter. A source close to the Sussexes said: “The King and the Princess of Wales have received support from <b>Prince Harry</b> and Meghan regarding their health. ‌“The Duke and Duchess contacted ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-68086080",
        "title": "Bob Marley fans <b>Harry</b> and Meghan attend film premiere",
        "description": "The Duke and Duchess of Sussex were surprise guests at the Jamaican premiere of a film about reggae singer Bob Marley. Prince Harry and Meghan were photographed with the Jamaican Prime Minister Andrew Holness, at the screening of Bob Marley: One Love."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-answered-burning-ve-172503976.html",
        "title": "Meghan Markle Answered a Burning Question We’ve Had for Months When She Attended the ‘Bob Marley: One Love’ Premiere in Jamaica",
        "description": "<b>Prince Harry</b> and Meghan Markle are a bit like Where in the World is Carmen Sandiego (remember that show?)—you never really know where around the globe they’re going to pop up next. Last night it was in Jamaica, where they unexpectedly hit the red ..."
    },
    {
        "url": "https://uk.yahoo.com/style/meghan-markle-wore-thing-carolina-153536463.html",
        "title": "Meghan Markle Wore a Thing: Carolina Herrera in Jamaica for &#39;Bob Marley&#39; Premiere Edition",
        "description": "Meghan Markle stepped out for an evening at the movies this week. On Tuesday night in Kingston, Jamaica, she attended the premiere of &quot;Bob Marley: One Love&quot; with <b>Prince Harry</b>. For the occasion, she wore an all-black look, layering a floor-length ..."
    },
    {
        "url": "https://uk.yahoo.com/style/body-language-expert-says-meghan-143400881.html",
        "title": "A Body Language Expert Says Meghan Markle and <b>Prince Harry</b> Were All About &quot;Careful&quot; Unity Last Night",
        "description": "Meghan Markle and <b>Prince Harry</b> made a rare appearance at the premiere of Bob Marley: One Love in Kingston, Jamaica, and naturally body language experts are out here doing their thing. And turns out the Sussexes&#39; vibes were all about &quot;unity,&quot; which ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-meghan-markle-just-122045148.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Just Showed Up to the &#39;Bob Marley: One Love&#39; Premiere in Jamaica",
        "description": "<b>Prince Harry</b> and Meghan Markle just made a surprise red-carpet appearance, and they didn&#39;t content themselves with commuting to nearby Los Angeles for it. The Duke and Duchess of Sussex showed up to the premiere of musical biopic Bob Marley: One Love in ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511704/meghan-markle-forced-to-miss-prince-harry-award/",
        "title": "Meghan Markle forced to miss <b>Prince Harry</b>&#39;s award ceremony as one of their children &#39;became unwell&#39;",
        "description": "Meghan Markle was forced to miss her husband, <b>Prince Harry</b>&#39;s Living Legends of Aviation award ceremony after one of their children became unwell. The news was confirmed by PA, who revealed: &quot;The Duchess of Sussex, who had been expected to attend the event ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middletons-fingers-went-white-31859294?int_source=nba",
        "title": "Kate Middleton&#39;s fingers &#39;went white as she gripped chair in tense Meghan and <b>Harry</b> meeting&#39;",
        "description": "In this explosive memoir, <b>Harry</b> shared how Meghan often clashed with Kate in the early days of their romance (Image: REX/Shutterstock) In the book, released a year ago, <b>Harry</b> also opened up on <b>Prince</b> William&#39;s brutal 10-word reaction when he first shared the news about his new actor girlfriend Meghan Markle."
    },
    {
        "url": "https://www.heraldscotland.com/life_style/arts_ents/13180495.gavin-driving-force-ryder-cup-concert-aims-ace-night/",
        "title": "Gavin is the driving force as Ryder Cup concert aims for ace night",
        "description": "WHEN we speak it is the morning after the opening ceremony of <b>Prince Harry</b>&#39;s Invictus Games and Kim Gavin&#39;s voice has the distinct huskiness of a man who has spent the evening before at full throttle to ensure the precise, clockwork execution of his vision."
    }
]