[
    {
        "url": "https://www.yahoo.com/lifestyle/sussexes-beckhams-unlikely-reconcile-tense-170000844.html",
        "title": "The Sussexes and Beckhams &quot;Unlikely&quot; to Reconcile After Tense Convo That Left David &quot;Bloody Furious&quot;",
        "description": "The Sussexes and the Beckhams are apparently unlikely to reconcile after a super tense convo that left David Beckham &quot;bloody furious.&quot;"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145381-princess-kate-unnerves-williams-friend-with-witty-response-to-dating-comments",
        "title": "Princess Kate unnerves William&#39;s friend with witty response to &#39;dating&#39; comments",
        "description": "Prince Kate once left Prince William&#39;s friend stunned with her brilliant response to his comments about dating the royal.Kate and William began their romantic journey from St Andrews"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-george-to-follow-in-his-fathers-footsteps-and-kate-middleton-is-heartbroken-about-it_art20667.html",
        "title": "<b>Prince</b> George to follow in his father&#39;s footsteps and Kate Middleton is &#39;heartbroken&#39; about it",
        "description": "Reportedly, Prince William wants Prince George to follow in his footsteps and go to Eton College. However, Kate Middleton is said to be ‘heartbroken’ over it, let’s find out"
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/kate-middleton-heartbroken-williams-decision-9018302",
        "title": "Kate Middleton &#39;heartbroken&#39; by William&#39;s decision over George&#39;s future",
        "description": "The Princess of Wales was said to be &quot;heartbroken&quot; over a decision made by Prince William over the future of their son George as he approaches secondary school age. The young prince is currently 10 years old and the family has already visited William&#39;s former boarding school Eton College ahead of a plan for George to follow in his father&#39;s footsteps."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/williams-decision-over-georges-future-28402416",
        "title": "William&#39;s decision over George&#39;s future leaves Kate Middleton &#39;heartbroken&#39;",
        "description": "The Princess of Wales was said to be &quot;heartbroken&quot; over a decision made by Prince William over the future of their son George as he approaches secondary school age. The young prince is currently 10 years old and the family has already visited William&#39;s former boarding school Eton College ahead of a plan for George to follow in his father&#39;s footsteps."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25269975/heartbroken-princess-kate-argued-wills-george-eton/",
        "title": "‘Heartbroken’ Princess Kate ‘argued for years’ with Wills about sending son George to Eton at 13, claims royal insider",
        "description": "KATE MIDDLETON is “heartbroken” over Prince William’s decision to send Prince George to Eton College when he turns 13, a royal insider has claimed. The Prince and Princess of"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852719/prince-harry-hollywood-friend-loss",
        "title": "<b>Prince Harry</b>&#39;s loss of close Hollywood friend after he &#39;said too much&#39;",
        "description": "A former friend of the Duke of Sussex has revealed that he no longer speaks to the former royal after he &quot;said too much&quot; at a press conference."
    },
    {
        "url": "https://goss.ie/featured/kate-middleton-heartbroken-over-decision-to-send-prince-george-to-prestigious-boarding-school-364750",
        "title": "Kate Middleton ‘heartbroken’ over decision to send <b>Prince</b> George to prestigious boarding school",
        "description": "Kate Middleton is reportedly “heartbroken” over Prince William’s decision to send their eldest son Prince George to Eton College when he turns 13."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/harry-pitman-death-boy-16-charged-with-new-years-eve-murder-of-teenager/",
        "title": "<b>Harry</b> Pitman death: Boy, 16, charged with New Year&#39;s Eve murder of teenager",
        "description": "A 16-year-old boy has been charged with murder after Harry Pitman, also 16, was stabbed to death on New Year&#39;s Eve on London&#39;s Primrose Hill."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12933091/Kate-Middleton-heartbroken-Prince-Williams-decision-send-Prince-George-10-Eton-College-claims-royal-insider.html",
        "title": "Kate Middleton &#39;heartbroken over <b>Prince</b> William&#39;s decision to send <b>Prince</b> George, 10, to Eton College&#39;, claims royal insider",
        "description": "Speculation had grown in December that the Wales&#39;s may snub Eton College in favour of Malborough College in Wiltshire, which was attended by Kate Middleton."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/boy-16-charged-with-new-years-eve-murder-of-harry-pitman/",
        "title": "Boy, 16, charged with New Year&#39;s Eve murder of <b>Harry</b> Pitman",
        "description": "A 16-year-old boy has been charged with murder after Harry Pitman, also 16, was stabbed to death on New Year&#39;s Eve on London&#39;s Primrose Hill."
    },
    {
        "url": "https://www.mirror.co.uk/news/prince-harrys-pride-one-brief-31820146",
        "title": "<b>Prince Harry</b>&#39;s pride at one brief moment at outshining older brother William",
        "description": "Prince Harry felt incredibly proud when he found himself finally outshining his elder brother, Prince William, in one particular way - even if it was only for a brief moment"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25267490/moment-diana-competed-harrys-sports-day/",
        "title": "Astonishing moment Princess Diana threw royal protocol aside to compete in the mums’ race at <b>Prince Harry</b>’s sports day",
        "description": "PRINCESS Diana once shocked parents at Prince Harry’s sports day in 1991 when she chucked royal protocol aside to compete in the mums’ race. In recently resurfaced footage, the former"
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-william-harry-unwelcome-royals-31811743",
        "title": "Kate Middleton and <b>Prince</b> William&#39;s &#39;clever move that shows <b>Harry</b> isn&#39;t welcome&#39; in Royal Family",
        "description": "Kate Middleton and Prince William have made it &#39;clear&#39; that Prince Harry and Meghan Markle are not &#39;welcome&#39; in the Royal Family with a clever move, a royal author claims"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middleton-left-heartbroken-over-31819985.amp",
        "title": "Kate Middleton left &#39;heartbroken&#39; over <b>Prince</b> of Wales&#39; decision on George&#39;s future",
        "description": "The Princess of Wales is said to be heartbroken over the potential decision for Prince George to be sent off to Eton College in just a few years time - in order to follow in his father&#39;s footsteps."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-cant-afford-setbacks-31816623",
        "title": "<b>Prince Harry</b> &#39;can&#39;t afford&#39; setbacks in 2024 if he wants to restore &#39;popular royal status&#39;",
        "description": "<b>Prince Harry</b> can&#39;t afford any more setbacks this year if he&#39;s to bounce back from a rocky 2023 with wife Meghan Markle, according to an industry expert. The Duke of Sussex faced controversy following the release of his tell-all memoir, Spare. He was ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12922341/Two-Queens-Denmarks-Margrethe-inspired-Elizabeth.html",
        "title": "A tale of two Queens. In touching detail, historian IAN LLOYD reveals how Denmark&#39;s Margrethe has been inspired by her friend, cousin and mentor, our own Elizabeth II",
        "description": "Queen Elizabeth taught her friend &#39;that I must somehow understand that I must dedicate my life to my nation like she has done, and in that way she has been very important to me.&#39;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1852116/prince-harry-meghan-markle-royal-family",
        "title": "<b>Prince Harry</b> and Meghan Markle warned &#39;stop the victim card&#39; as couple plot 2024 comeback",
        "description": "EXCLUSIVE: Prince Harry and Meghan Markle have been slammed by PR expert Charlene Sweeney, but there might be a way to win back public opinion."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-prince-harry-relationship-31811542",
        "title": "King Charles&#39; brief four-word comment over <b>Prince Harry</b>&#39;s return to UK",
        "description": "Prince Harry and his wife Meghan Markle left the UK for America back in January 2020 after they made the decision to step down from their roles as senior royals"
    },
    {
        "url": "https://www.independent.co.uk/life-style/harry-and-meghan-what-next-for-hollywood-s-biggest-losers-b2473838.html",
        "title": "<b>Harry</b> and Meghan: A year of redemption for ‘Hollywood’s biggest losers’",
        "description": "It is four years since the drama of Megxit, but after ceaseless family turmoil and career false starts, the time has come to admit what they got wrong and rebuild bridges, say those closest to the couple."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/list-hollywood-stars-too-much-28401731",
        "title": "A-list Hollywood star&#39;s &#39;too much&#39; interview causes <b>Prince Harry</b> to cut ties",
        "description": "Dominic West and The Crown star revealed that his friendship with <b>Prince Harry</b> was &#39;broken&#39; after he once &quot;said too much&quot; during a press conference. The 54-year-old actor - who plays King Charles III on the hit Netflix series - said that he used to be real ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/heartbroken-kate-middleton-disagrees-prince-28401511",
        "title": "&#39;Heartbroken&#39; Kate Middleton &#39;disagrees&#39; with <b>Prince</b> William&#39;s decision about son George&#39;s future",
        "description": "Both William and younger brother <b>Prince Harry</b> were schooled there - but that only came about because their parents King Charles and Princess Diana wanted to break tradition. Before that, it had been a custom for royal children to attend Gordonstoun in ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/05/prince-andrew-royal-family-problem-jeffrey-epstein-papers/",
        "title": "‘A fatal mix of arrogance and stupidity’: How do you solve a problem like <b>Prince</b> Andrew?",
        "description": "At a time when the King needs stability, the latest Epstein papers have placed the Duke firmly back at the centre of scandal"
    },
    {
        "url": "https://www.btimesonline.com/articles/163094/20240106/prince-harry-irked-by-prince-andrews-presence-at-royal-christmas.htm",
        "title": "<b>Prince Harry</b> Irked by <b>Prince</b> Andrew&#39;s Presence at Royal Christmas",
        "description": "Prince Harry reportedly harbors frustrations over the visible inclusion of his uncle Prince Andrew and Sarah Ferguson in the royal family&#39;s Christmas church service, while he remains at a distance from key family members."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markles-mom-doria-basically-lives-sussex-montecito-home-report-claims-heres-what-happens-when-prince-harry-needs-space.html/",
        "title": "Meghan Markle’s Mom, Doria, Basically Lives at the Sussex Montecito Home, Report Claims: Here’s What Happens When <b>Prince Harry</b> ‘Needs Space’",
        "description": "Meghan Markle&#39;s mom, Doria Ragland, reportedly &#39;spends more time&#39; at her and Prince Harry&#39;s Montecito, California, home than her own."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/king-charles-news-prince-harry-news-king-charles-asked-to-bring-back-prince-harry-his-heartbreaking-4-word-reply-101704552848431.html",
        "title": "King Charles asked to bring back <b>Prince Harry</b>. His heartbreaking 4-word reply",
        "description": "<b>Prince Harry</b> and his wife Meghan Markle stepped down from their royal roles in 2020 after which their relationship with the royal family deteriorated. The father-son have not talked to each other since, it was reported as <b>Prince Harry</b> levelled charges ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/meghan-markle-wants-answers-from-king-charles-royal-expert/articleshow/106600588.cms",
        "title": "Meghan Markle &#39;wants answers from King Charles&#39;: Royal expert",
        "description": "Meghan Markle demands answers from King Charles regarding the different treatment she and Prince Harry are receiving compared to other members of the"
    },
    {
        "url": "https://www.eastbaytimes.com/2024/01/06/prince-harry-colleen-hoover-top-checkout-lists-for-san-jose-library/",
        "title": "<b>Prince Harry</b>, Colleen Hoover top checkout lists for San Jose library",
        "description": "If you’ve got kids, it may come as no surprise that Dav Pilkey and Jeff Kinney ruled the top 10 list for children’s books with their Cat Kid, Dog Man and Diary of a Wimpy Kid series. The library also crunched numbers for fiction, nonfiction, ebooks and audiobooks for adults and kids. You can check out those at www.sjpl.org/2023-top-10-lists."
    },
    {
        "url": "https://www.btimesonline.com/articles/163090/20240106/meghan-markles-image-overhaul-faces-royal-critique-and-public-skepticism.htm",
        "title": "Meghan Markle&#39;s Image Overhaul Faces Royal Critique and Public Skepticism",
        "description": "The 42-year-old Duchess, who has made headlines alongside her husband, <b>Prince Harry</b>, for their dramatic split from royal duties in 2020, has been accused of overplaying the victim card. A palace courtier told The National ENQUIRER, &quot;This is a desperate ..."
    },
    {
        "url": "https://www.itv.com/watch/news/king-preparing-to-withdraw-private-funding-for-security-at-prince-andrews-home/srdcmqh",
        "title": "King &#39;preparing to withdraw private funding&#39; for security at <b>Prince</b> Andrew&#39;s home",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://www.herfamily.ie/news/entertainment/kate-middleton-prince-george-eton-439314",
        "title": "Kate Middleton ‘heartbroken’ over plans to send <b>Prince</b> George to boarding school",
        "description": "The Princess of Wales, Kate Middleton is reportedly heartbroken over the royal family&#39;s decision to send George to boarding school."
    },
    {
        "url": "https://www.itv.com/watch/news/sixteen-year-old-boy-appears-in-court-charged-with-murder-of-harry-pitman/5tdfmtn",
        "title": "Sixteen-year-old boy appears in court charged with murder of <b>Harry</b> Pitman",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/how-kate-middleton-will-spend-her-birthday-and-why-this-year-might-be-extra-special/",
        "title": "How Kate Middleton will spend her birthday – and why this year might be extra special",
        "description": "Kate will turn 42 this year, and, after celebrating over 12 birthdays within the Royal Family since marrying William in 2011, it’s suggested the Princess could receive a rare privilege from King Charles this year. While that remains to be seen, fans are also curious as to how the mother of three likes to spend her birthdays."
    },
    {
        "url": "https://www.ghanaweb.com/GhanaHomePage/africa/Meghan-Markle-reportedly-tried-to-arrange-a-meeting-with-King-Charles-Wants-some-answers-1908344",
        "title": "Meghan Markle reportedly tried to arrange a meeting with King Charles: ‘Wants some answers’",
        "description": "Meghan Markle is said to be seeking explanations from King Charles regarding the perceived disparate treatment she and Prince Harry have faced compared to other royal family members."
    },
    {
        "url": "https://uk.news.yahoo.com/metropolitan-police-refuse-investigate-prince-120722013.html",
        "title": "Metropolitan Police refuse to investigate <b>Prince</b> Andrew after release of Epstein documents",
        "description": "The Metropolitan Police have declined calls to open an investigation into Prince Andrew after new documents related to the late child sex offender Jeffrey Epstein contained references to the former royal."
    },
    {
        "url": "https://www.three.fm/news/uk-news/boy-16-charged-with-new-years-eve-murder-of-teenager-harry-pitman/",
        "title": "Boy, 16, charged with New Year&#39;s Eve murder of teenager <b>Harry</b> Pitman",
        "description": "A 16-year-old boy has been charged with murder after Harry Pitman, also 16, was stabbed to death on New Year&#39;s Eve on London&#39;s Primrose Hill."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/podcasters-jailed-for-threats-to-prince-harry-kill-him-for-marrying-meghan-101704537151400.html",
        "title": "Podcasters jailed for threats to <b>Prince Harry</b>: ‘Kill him for marrying Meghan&#39;",
        "description": "Christopher Gibbons said Prince Harry should be “prosecuted and judicially killed for treason” as he called Archie a “creature” that “should be put down.” The 40-year-old was sentenced to eight years in prison while Patten-Walsh, 34, was given a 7-year term."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-is-making-major-decision-regarding-prince-andrew-amid-jeffrey-epstein-scandal_art20665.html",
        "title": "King Charles is making major decision regarding <b>Prince</b> Andrew amid Jeffrey Epstein scandal",
        "description": "Prince Andrew was forced to step down as a working royal in 2019 following the sexual abuse case against him. King Charles could now be making things harder for his"
    },
    {
        "url": "https://uk.news.yahoo.com/harry-pitman-16-old-boy-143026872.html",
        "title": "<b>Harry</b> Pitman: 16-year-old boy charged with New Year’s Eve murder",
        "description": "A 16-year-old boy appeared in court on Saturday 6 January, and has been charged with the murder of Harry Pitman in north London on New Year&#39;s Eve. Harry Pitman, also 16, joined friends to watch fireworks on 31 December 2023,"
    },
    {
        "url": "https://www.livemint.com/news/world/bystander-asks-king-charles-to-bring-prince-harry-back-check-the-monarch-s-emotional-reply-11704531808614.html",
        "title": "Bystander asks King Charles to bring <b>Prince Harry</b> back; check the monarch’s emotional reply",
        "description": "Prince Harry and Meghan Markle&#39;s departure from the Royal Family in 2020 caused controversy, with Harry accusing his father of lying and prioritising his own interests."
    },
    {
        "url": "https://www.ndtv.com/world-news/meghan-markle-has-been-trying-to-meet-king-charles-claims-royal-author-4810563",
        "title": "Meghan Markle Has Been Trying To Meet King Charles, Claims Royal Author",
        "description": "Prince Harry and Meghan Markle are being subjected to a &quot;different&quot; set of rules compared with the other members of the British royal family, forcing the Duchess of Sussex to demand certain &quot;answers&quot; from King Charles,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145277-prince-harry-meghan-markle-in-hot-water-after-oversharing-royal-secrets",
        "title": "<b>Prince Harry</b>, Meghan Markle in hot water after &#39;oversharing&#39; royal secrets",
        "description": "According to an analyst, Meghan Markle and Prince Harry will find it difficult to regain the public&#39;s trust after oversharing details about the Royal Family.A public relations specialist"
    },
    {
        "url": "https://www.ndtv.com/world-news/meghan-markle-wants-to-be-queen-claims-royal-author-tom-bower-4810362",
        "title": "Meghan Markle &quot;Wants To Be Queen&quot;, Claims Royal Author",
        "description": "Royal author Tom Bower has claimed that Meghan Markle “wants to be Queen”. The &#39;Rebel Prince&#39; writer shared his insights on the former &#39;Suits&#39; actress&#39; alleged aspirations, indicating that she longs to rejoin the royal fold despite her and Prince Harry&#39;s move to California years ago."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/expert-insists-prince-harry-meghan-markle-remain-strong-brand-duke-isnt-afraid-to-do.html/",
        "title": "Expert Insists <b>Prince Harry</b> and Meghan Markle Remain a ‘Strong Brand’ Because of What the Duke ‘Isn’t Afraid’ to Do Anymore",
        "description": "Find out why a body language expert says Prince Harry and Meghan still have a &quot;strong brand&quot; going forward despite setbacks last year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12932073/Prince-Andrew-daily-massages-visited-paedophile-financier-Jeffrey-Epstein-sarah-ferguson.html",
        "title": "Sarah Ferguson and <b>Prince</b> Andrew visited Epstein&#39;s Palm Beach lair where Duke had DAILY massages and stayed in &#39;blue room&#39;, ex-housekeeper claims in newly unsealed files ...",
        "description": "Juan Alessi, who worked at Epstein&#39;s Palm Beach residence, said both Prince Andrew and his then wife Sarah, Duchess of York, were friends with him and sex-trafficker Ghislaine Maxwell."
    },
    {
        "url": "https://www.washingtoninformer.com/capitol-police-officer-congress-run/",
        "title": "<b>Harry</b> Dunn, U.S. Capitol Police Hero at Jan. 6 Riot, Running for Congress",
        "description": "A Capitol Police officer who defended congressional members during the Jan. 6 attack is running for Congress in Maryland&#39;s 3rd District, aiming to protect democracy and prioritize the needs of Americans."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145295-king-charles-sends-prince-harry-significant-message-through-sarah-ferguson",
        "title": "King Charles sends <b>Prince Harry</b> ‘significant’ message through Sarah Ferguson",
        "description": "Despite <b>Prince Harry</b> and Meghan Markle’s strained ties with King Charles, there is still hope of a reconciliation amid the ongoing royal rift. Sarah Ferguson marked her return to the royal fold as she attended the Christmas festivities with her disgraced ..."
    },
    {
        "url": "https://www.arkansasonline.com/news/2024/jan/06/in-the-news/",
        "title": "In the news",
        "description": "Christopher Gibbons, 40, host of the &quot;Lone Wolf Radio&quot; podcast who called for the deaths of <b>Prince Harry</b> and his son, was sentenced to eight years in prison, and his co-host Tyrone Patten-Walsh, 34, was given a seven-year term, the Metropolitan Police said."
    },
    {
        "url": "https://www.themercury.com.au/entertainment/celebrity-life/royals/princess-marys-children-what-their-new-role-means-for-four-young-royals/news-story/44dd182b68dd597c45f094fe70cc7c2f",
        "title": "Princess Mary’s children: What their new role means for four young royals",
        "description": "For years they have lived under the gaze of an adoring public that has delighted in every childhood milestone and achievement."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/crown-princess-mary-denmark-historic-213810849.html",
        "title": "Crown Princess Mary of Denmark Will Have a Historic Royal First When She Becomes Queen This Month",
        "description": "Queen Margrethe of Denmark announced that she will abdicate the throne, making her son the new monarch and his wife, Mary, the new queen consort"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-abdul-mateen-brunei-anisha-202346204.html",
        "title": "All About <b>Prince</b> Abdul Mateen of Brunei and Anisha Isa Kalebic&#39;s Love Story Ahead of Their 10-Day Wedding",
        "description": "Prince Abdul Mateen of Brunei and Anisha Isa Kalebic’s wedding comes three months after news of their engagement was announced in October 2023"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/05/65986fcfca47419b5a8b456d.html",
        "title": "<b>Prince Harry</b> and Meghan Markle &quot;alienated&quot; by King Charles, body language expert reveals",
        "description": "James emphasized the &quot;sense of alienation&quot; between <b>Prince Harry</b> and King Charles, stating that it was &quot;obvious&quot; before the Queen&#39;s funeral. She pointed out that there was no sense of &quot;family huddling&quot; or communication, with Charles walking ahead with his ..."
    },
    {
        "url": "https://sg.news.yahoo.com/prince-harry-meghan-markle-displayed-125708316.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Displayed Their &quot;Alienation&quot; at the Queen&#39;s Funeral, Expert Claims",
        "description": "The last time both <b>Prince Harry</b> and Meghan Markle spent time with the Royal Family was for the late Queen&#39;s funeral in 2022 and the events surrounding it. While of course the Duke and Duchess of Sussex were welcomed for mourning <b>Harry</b>&#39;s grandmother ..."
    },
    {
        "url": "https://thegrio.com/2024/01/05/neo-nazi-podcasters-who-railed-against-black-people-and-other-minorities-sent-to-prison-on-terror-charges/",
        "title": "Neo-Nazi podcasters who railed against Black people and other minorities sent to prison on terror charges",
        "description": "They approved of a day when so-called race traitors would be hanged, particularly those in interracial relationships. <b>Prince Harry</b>&#39;s wife, Meghan, is biracial. LONDON (AP) — A neo-Nazi podcaster who called for the deaths of <b>Prince Harry</b> and his young ..."
    }
]