[
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-snubbed-army-book-31828530",
        "title": "<b>Prince Harry</b> snubbed by Army book on notable soldiers - as William writes foreword",
        "description": "Prince Harry, Duke of Sussex, was left out of Sandhurst’s guide to its most notable alumni, which means he joins outcasts such as fascist leader Sir Oswald Mosley and Waffen-SS Officer Benson Freeman"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12936397/harry-duke-sussex-army-book-prince-william-makes-cut.html",
        "title": "<b>Harry</b>&#39;s Sandhurst humiliation: Duke of Sussex is left out of prestigious Army book celebrating military college&#39;s top alumni (but his brother <b>Prince</b> William makes the cut - and ...",
        "description": "<b>Prince Harry</b> has been left humiliated after being excluded from a prestigious book celebrating the Sandhurst&#39;s top alumni in what has been branded a snub by a top army commander. The Duke of Sussex failed to make the military academy&#39;s top 200 people to ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853052/Prince-Harry-left-out-of-army-book",
        "title": "Fresh blow for <b>Prince Harry</b> as he&#39;s left out of Army book despite Afghanistan tours",
        "description": "Being missed from the book is the latest blow for Harry&#39;s military career. The prince is proud of his Army service, which saw two tours of Afghanistan."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-andrew-reportedly-vows-resist-213512081.html",
        "title": "<b>Prince</b> Andrew Reportedly ‘Vows’ To Resist Any Attempt To Kick Him Out Of His ‘Royal Mansion’",
        "description": "Despite King Charles allegedly seeking to relocate his younger brother from his ten-bedroom Windsor home to Frogmore Cotta,ge which formerly belonged to <b>Prince Harry</b> and Meghan Markle, The Duke of York is determined to stay, citing a robust lease agreement."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/kate-middleton-heartbroken-over-prince-william-decision-argued-for-years-212142082.html",
        "title": "Kate Middleton &#39;heartbroken&#39; over <b>Prince</b> William decision: &#39;Argued for years&#39;",
        "description": "Kate Middleton has reportedly been left &#39;heartbroken&#39; after Prince William made a huge decision about Prince George. Read more."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/kate-middleton-left-heartbroken-by-prince-william-standoff-over-george/news-story/7a2fbf27360fc45e49e971abba2a4c04",
        "title": "Kate Middleton left ‘heartbroken’ by <b>Prince</b> William standoff over George",
        "description": "Princess Kate is said to be “heartbroken” after an “argument” with Prince William over where to send their oldest son to high school."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-four-31828044",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s &#39;four options&#39; for new home after neighbours &#39;sick of them&#39;",
        "description": "Meghan Markle and Prince Harry are reportedly planning to sell their sprawling family home in Montecito, California, and have a few options for where they could move next"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25278155/prince-harry-prestigious-sandhurst-guide-army-afghanistan/",
        "title": "Fresh humiliation for <b>Prince Harry</b> as he’s left out of prestigious Army book after boasting about kills in Afghanistan",
        "description": "PRINCE Harry has been dealt a humiliating blow after being left out of Sandhurst’s guide to its most notable alumni. The Duke of Sussex failed to make the cut for the military ­academy’s"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853002/prince-harry-nacho-figueras-polo-accident",
        "title": "<b>Prince Harry</b>&#39;s close friend falls from horse during polo match as disaster strikes",
        "description": "A close friend of Prince Harry &#39;s slipped out of his saddle during a game of polo in Australia. The accident happened at the Pacific Fair Magic Millions Polo &amp; Showjumping Show, when Nacho Figueras, 46, reached down to hit a ball."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-snapped-hanging-out-31804642",
        "title": "<b>Prince Harry</b> snapped hanging out with new Hollywood pals without Meghan Markle",
        "description": "The Duke of Sussex was snapped alongside It&#39;s Always Sunny in Philadelphia stars Rob McElhenney and Glenn Howerton at a football match between Inter Miami CF and Los Angeles."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-markle-allegedly-looking-to-sell-their-11-million-california-home_art20673.html",
        "title": "<b>Prince Harry</b> and Meghan Markle allegedly looking to sell their £11 million California home",
        "description": "Prince Harry and Meghan Markel are allegedly planning to move their base again as they close to selling their £11 million California"
    },
    {
        "url": "https://www.hellomagazine.com/brides/510706/prince-william-kate-middleton-rare-sweetheart-moment-goes-viral/",
        "title": "<b>Prince</b> William and Princess Kate&#39;s rare sweetheart moment at picnic gets royal fans talking",
        "description": "A sweet moment from the couple&#39;s courting days in their early twenties has recirculated online, and in the rare PDA moment, a young Kate Middleton steals a kiss from Prince William as they enjoy a picnic in Beaufort Polo Club."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12935443/Disaster-strikes-Prince-Harrys-right-hand-man-Nacho-Figueras-slips-horse-polo-game-wife-Delfina-Blaquier-Magic-Millions.html",
        "title": "Disaster strikes <b>Prince Harry</b>&#39;s right hand man as Nacho Figueras slips from his horse during polo game with wife Delfina Blaquier at Magic Millions",
        "description": "<b>Prince Harry</b>&#39;s right hand man, 46, almost lost his balance completely as he reached down to strike the ball and took a tumble instead. In a shocking display at the Pacific Fair Magic Millions Polo &amp; Showjumping show, the Argentine model could be seen ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/prince-williams-four-word-answer-31825440",
        "title": "<b>Prince</b> William&#39;s four-word answer after Meghan&#39;s pregnancy announcement at royal wedding",
        "description": "The Sussexes welcomed their first child Archie in the summer of 2019, and broke the news to some members of the family at Princess Eugenie&#39;s wedding the year before."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/will-prince-harry-and-meghan-bring-archie-and-lilibet-to-the-uk-in-2024-expert-shares-thoughts_art20670.html",
        "title": "Will <b>Prince Harry</b> and Meghan bring Archie and Lilibet to the UK in 2024? Expert shares thoughts",
        "description": "Prince Harry and Meghan Markle rarely visit the UK anymore, even less so with their children, Archie and Lilibet. Will we be seeing the Sussex family in the UK in"
    },
    {
        "url": "https://uk.news.yahoo.com/why-prince-harrys-decision-over-103308360.html",
        "title": "Why <b>Prince Harry</b>&#39;s decision over <b>Prince</b> Archie and Princess Lilibet could upset King Charles",
        "description": "A royal commentator has claimed that Prince Harry’s children Prince Archie and Princess Lilibet won’t be returning to the UK for a long time."
    },
    {
        "url": "https://uk.style.yahoo.com/glenn-howerton-recalls-meeting-cool-152548948.html",
        "title": "Glenn Howerton Recalls Meeting &#39;Cool&#39; <b>Prince Harry</b> at L.A. Soccer Game: He&#39;s a &#39;Normal Dude&#39; (Exclusive)",
        "description": "“He&#39;s cool, man. A very nice, very down to earth, normal dude in a lot of ways,” the actor told PEOPLE exclusively of the royal Gregg DeGuire/Variety via Getty; P van Katwijk/Getty Glenn Howerton and <b>Prince Harry</b> Glenn Howerton is looking back at ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25269975/heartbroken-princess-kate-argued-wills-george-eton/",
        "title": "‘Heartbroken’ Princess Kate ‘argued for years’ with Wills about sending son George to Eton at 13, claims royal insider",
        "description": "KATE MIDDLETON is “heartbroken” over Prince William’s decision to send Prince George to Eton College when he turns 13, a royal insider has claimed. The Prince and Princess"
    },
    {
        "url": "https://www.ok.co.uk/royal/royals-welcoming-sarah-ferguson-suggests-31806339",
        "title": "Royals welcoming Sarah Ferguson suggests &#39;all is not lost with <b>Harry</b> and Meghan&#39;",
        "description": "EXCLUSIVE: Sarah Ferguson was welcomed back to Sandringham with the Royal Family, 32 years later - a royal expert said this gesture shows hope of &quot;reconciliation&quot; for Prince Harry"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/celebs-tv/kate-middleton-heartbroken-williams-decision-9018302",
        "title": "Kate Middleton &#39;heartbroken&#39; by William&#39;s decision over George&#39;s future",
        "description": "The Princess of Wales was said to be &quot;heartbroken&quot; over a decision made by Prince William over the future of their son George as he approaches secondary school age. The young prince is currently 10 years old and the family has already visited William&#39;s former boarding school Eton College ahead of a plan for George to follow in his father&#39;s footsteps."
    },
    {
        "url": "https://uk.news.yahoo.com/queen-camilla-loves-reading-classic-115408568.html",
        "title": "Queen Camilla loves reading this classic book to her grandchildren - but there’s just one problem…",
        "description": "Queen Camilla is a voracious reader, and likes to read Harry Potter to her grandchildren – but struggles to mimic the voices. It’s no secret that reading to your children or grandchildren is one of the most valuable things you can do, whether you go for a true classic bedtime story or one of the best personalised books for kids."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/meghan-harrys-neighbours-sick-them-28404803",
        "title": "Meghan and <b>Harry</b>&#39;s neighbours &#39;sick of them&#39; as couple &#39;close to selling £11million home&#39;",
        "description": "Meghan Markle and <b>Prince Harry</b> are &#39;never seen&#39; by neighbours at their £11million US mansion, with some locals said to be &#39;sick of hearing about them&#39;. The couple are rumoured to be close to selling their Montecito pad in favour of a cheaper home in Malibu."
    },
    {
        "url": "https://www.sbs.com.au/whats-on/article/love-war-and-unlikely-friendships-jonah-hauer-king-on-the-new-season-of-1940s-drama-world-on-fire/4p2jk3jbq",
        "title": "Love, war and unlikely friendships: Jonah Hauer-King on the new season of 1940s drama &#39;World on Fire&#39;",
        "description": "From Britain under the shadow of war to the harsh sands of the North African desert, &#39;World on Fire&#39; returns to to see Hauer-King&#39;s Harry and new characters dealing with the reality of World War Two."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/07/659b0e6446163f290c8b4579.html",
        "title": "<b>Prince</b> Andrew will stand firm over his tenancy agreement at royal mansion",
        "description": "In the aftermath of the Jeffrey Epstein document disclosure, Prince Andrew remains steadfast in resisting any attempts to evict him from his royal residence, the 30-room Royal Lodg"
    },
    {
        "url": "https://www.theaustralian.com.au/nation/magic-millions-royal-touch-to-polo-and-showjumping-spectacle/news-story/bfc52afd3510d1cebf64605af2de40f7",
        "title": "Royal touch to polo and showjumping spectacle",
        "description": "He’s accustomed to playing polo alongside royalty as a teammate of Prince Harry in California, but it was the Duke of Sussex’s cousin who threatened to rain on polo star Nacho Figueras’s parade at the Gold Coast on Sunday."
    },
    {
        "url": "https://www.pinkvilla.com/entertainment/hollywood/are-prince-harry-and-meghan-markle-expecting-their-third-child-exploring-the-truth-behind-latest-rumor-1269976",
        "title": "Are <b>Prince Harry</b> and Meghan Markle expecting their &#39;Third Child&#39;? Exploring the truth behind latest rumor",
        "description": "Harry and Meghan, the Duke and Duchess of Sussex, embrace parenthood with Archie and Lili, navigating privacy, philanthropy, and sparking speculation about a potential third child."
    },
    {
        "url": "https://nypost.com/2024/01/07/news/prince-andrew-vows-he-wont-be-forced-out-of-royal-mansion-after-new-epstein-claims/",
        "title": "<b>Prince</b> Andrew vows he won’t be forced out of royal mansion after new Epstein claims",
        "description": "Prince Andrew will reject any efforts to get him evicted from his royal mansion — which he signed a “cast iron lease” to secure — sources close to the duke said after his name appeared"
    },
    {
        "url": "https://www.thedailybeast.com/prince-andrew-devastated-by-release-of-epstein-documents-report",
        "title": "<b>Prince</b> Andrew ‘Devastated’ by Release of Epstein Documents: Report",
        "description": "Plus, King Charles will reportedly never let Andrew return to royal duties. Will he also finally force Andrew out of his home, Royal Lodge, and make him pay for his own security?"
    },
    {
        "url": "https://www.bollywoodshaadis.com/articles/princess-of-wales-dianas-fetish-over-blue-eyeliner-heres-why-she-dropped-her-signature-style-48088",
        "title": "Princess Of Wales, Diana&#39;s Fetish Over Blue Eyeliner, Here&#39;s Why She Dropped Her Signature Style",
        "description": "In the recordings, Princess Diana had made a shocking revelation about the current monarch and her ex-husband, and shared how he was disappointed after the birth of their secondborn, <b>Prince Harry</b>. In fact, during <b>Harry</b>’s christening, Charles chatted with ..."
    },
    {
        "url": "https://www.livemint.com/news/world/king-charles-to-solve-andrew-problem-likely-to-curtail-funds-as-his-brother-gets-included-in-jeffrey-epstein-s-list-11704601385706.html",
        "title": "King Charles to solve &#39;Andrew problem&#39;, likely to curtail funds as his brother gets included in Jeffrey Epstein’s ‘list&#39;",
        "description": "Prince Andrew&#39;s association with Jeffrey Epstein has led King Charles to determine that his brother will not participate in official public events or have a return to official duties."
    },
    {
        "url": "https://www.yahoo.com/entertainment/glenn-howerton-recalls-meeting-cool-152548948.html",
        "title": "Glenn Howerton Recalls Meeting &#39;Cool&#39; <b>Prince Harry</b> at L.A. Soccer Game: He&#39;s a &#39;Normal Dude&#39; (Exclusive)",
        "description": "He&#39;s cool, man. A very nice, very down to earth, normal dude in a lot of ways,” the actor told PEOPLE exclusively of the royal"
    },
    {
        "url": "https://www.btimesonline.com/articles/163109/20240107/prince-andrew-secludes-himself-following-epstein-documents-release.htm",
        "title": "<b>Prince</b> Andrew Secludes Himself Following Epstein Documents Release",
        "description": "Prince Andrew, Duke of York, has reportedly secluded himself following the release of court documents that have reignited the Jeffrey Epstein scandal."
    },
    {
        "url": "https://dailytimes.com.pk/1158713/prince-harry-says-he-and-meghan-markle-cant-keep-their-kids-safe-in-the-uk/",
        "title": "<b>Prince Harry</b> says he and Meghan Markle can’t keep their kids safe in the UK",
        "description": "Prince Harry’s top priority is his kids’ safety. That’s why the Duke of Sussex is pushing back against the Executive Committee for the Protection of Royalty and Public Figures’ (RAVEC) decision to revoke his automatic right to police protection when he and Meghan Markle visit the United Kingdom."
    },
    {
        "url": "https://www.btimesonline.com/articles/163105/20240107/prince-harry-meghan-markle-out-in-the-cold-sussexes-excluded-royal-reunions.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle Out in the Cold as the Sussexes Excluded from Royal Reunions",
        "description": "Despite King Charles III&#39;s Christmas broadcast emphasizing tolerance and unity, the Sussexes found themselves conspicuously absent from the celebrations, reinforcing their estrangement."
    },
    {
        "url": "https://bestlifeonline.com/daniel-radcliffe-hates-harry-potter-movie/",
        "title": "Why Daniel Radcliffe Says He&#39;ll Never Rewatch One Particular &quot;<b>Harry</b> Potter&quot; Movie",
        "description": "They turned him into a major star, but Daniel Radcliffe refuses to rewatch one of the eight &quot;Harry Potter&quot; movies. Here&#39;s why."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/jeffrey-epstein-files-king-charles-first-public-appearance-since-new-prince-andrew-revelations-101704632115755.html",
        "title": "King Charles&#39; first public appearance since new <b>Prince</b> Andrew revelations",
        "description": "King Charles was seen in Sandringham first time since Prince Andrew was named in legal documents relating to Jeffrey Epstein. The monarch was seen attending a Sunday service at St Mary Magdalene Church on the royal estate in Norfolk."
    },
    {
        "url": "https://www.newsweek.com/king-charles-popularity-worst-polling-prince-harry-meghan-markle-1857394",
        "title": "King Charles&#39; Popularity Crisis Is Monarchy&#39;s Worst in Decades",
        "description": "Main image, King Charles III is seen in Dubai on November 30, 2023. Inset, <b>Prince Harry</b> and Meghan Markle are pictured at the Invictus Games in Düsseldorf, Germany, in September 2023. <b>Harry</b> and Meghan&#39;s bombshell allegations against the royals in 2021 ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/uk/meghan-markles-mother-steps-in-to-support-her-and-prince-harry-during-tough-times/articleshow/106613932.cms",
        "title": "Meghan Markle&#39;s mother steps in to support her and <b>Prince Harry</b> during &#39;tough times&#39;",
        "description": "Meghan Markle&#39;s mother, Doria Ragland, has moved into the guesthouse on the grounds of Prince Harry and Meghan&#39;s Montecito mansion. The 67-year-old yo"
    },
    {
        "url": "https://www.lifestyleasia.com/hk/culture/people/prince-abdul-mateen-of-brunei-net-worth-career-expensive-things-he-owns/",
        "title": "<b>Prince</b> Abdul Mateen of Brunei: Net worth, luxurious lifestyle and his role as a royal",
        "description": "One of the richest royals in Asia, know all about Prince Abdul Mateen of Brunei, his high net worth and the luxurious lifestyle he leads."
    },
    {
        "url": "https://www.timesnownews.com/world/your-son-king-charles-nervously-responds-to-plea-to-bring-back-prince-harry-to-uk-article-106611970",
        "title": "&#39;Your Son!&#39;: King Charles Nervously Responds to Plea to Bring Back <b>Prince Harry</b> To UK",
        "description": "Despite the strained relationship, Prince Harry attended the coronation of his father, King Charles, at Westminster Abbey in June, joining other family members., World News, Times Now"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145585-meghan-markle-prince-harry-warned-of-severe-outcomes-if-royal-rift-grows",
        "title": "Meghan Markle, <b>Prince Harry</b> warned of severe outcomes if royal rift grows",
        "description": "Meghan Markle and Prince Harry have been warned of severe outcomes if their rift with the senior members of the royal family grows in 2024.As per The Express, PR expert Mark Borkowski said that"
    },
    {
        "url": "https://www.ndtv.com/world-news/king-charles-heartbreaking-reply-when-asked-about-prince-harrys-return-to-england-4816469",
        "title": "King Charles&#39; Heartbreaking Reply When Asked About <b>Prince Harry</b>&#39;s Return To England",
        "description": "King Charles gave an unexpected reply to a man when he was asked about bringing back Prince Harry to the United Kingdom."
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/is-a-person-speaking-their-truth-different-from-the-truth-it-s-complicated-20240104-p5ev73.html",
        "title": "Is a person speaking ‘their truth’ different from the truth? It’s complicated",
        "description": "The latest therapy-speak term to be endorsed by celebrities, speaking “your truth” may be true for you, but chances are it’s not for other people."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1145569-prince-harry-meghan-markle-one-move-away-to-making-2024-their-year",
        "title": "<b>Prince Harry</b>, Meghan Markle one move away to making 2024 ‘their year’",
        "description": "Prince Harry and Meghan Markle are seemingly tired of how the royal rift is impacting their public reputation.Moreover, it appears the Duke and Duchess of Sussex are staying away from the"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-and-harrys-big-move-as-third-child-is/news-story/53e081c509e147b5998bef1ba2a4f7d1",
        "title": "Meghan and <b>Harry</b>’s big move amid talk of a ‘third child’",
        "description": "Meghan Markle and Prince Harry are making secret moves as their family looks set to change in 2024."
    },
    {
        "url": "https://theblast.com/568821/duchess-of-sussex-meghan-markle-called-the-most-difficult-woman-to-satisfy-by-royal-expert/",
        "title": "Duchess of Sussex Meghan Markle Called The ‘Most Difficult Woman To Satisfy’ By Royal Expert",
        "description": "A royal expert has called out the Duchess of Sussex, Meghan Markle, tagging her the “most difficult woman to satisfy.”"
    },
    {
        "url": "https://www.fbcnews.com.fj/entertainment/no-way-back-after-prince-andrews-nightmare-new-year/",
        "title": "No way back after <b>Prince</b> Andrew&#39;s nightmare new year",
        "description": "It’s more than four years since Prince Andrew stepped down from royal duties. But if anything he now seems further away than ever from any prospect of rehabilitation and a return to public life."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/king-charles-spotted-for-first-time-since-prince-andrew-was-named-69-times-in-epstein-docs/news-story/1339c47bcb0f3d0ba1aeb7dcbd544371",
        "title": "King Charles spotted for first time since <b>Prince</b> Andrew was named 69 times in Epstein docs",
        "description": "King Charles has been spotted for the first time since further accusations were made of alleged sex abuse by Prince Andrew."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markles-mom-moves-in-with-her-and-prince-harry-amid-tough-times-101704554743982.html",
        "title": "Meghan Markle&#39;s mom moves in with her and <b>Prince Harry</b>: &#39;Amid tough times…&#39;",
        "description": "Meghan Markle&#39;s mother Doria Ragland has reportedly moved in with her daughter and son-in-law Prince Harry in Montecito, United States, it was reported. The Duchess of Sussex&#39; mother has shifted to the couple&#39;s California home to help them through “tough times”."
    },
    {
        "url": "https://popculture.com/celebrity/news/meghan-markle-reportedly-wants-answers-over-king-charles-rule-changes-toward-prince-harry/",
        "title": "Meghan Markle Reportedly &#39;Wants Answers&#39; Over King Charles&#39; Rule Changes Toward Her and <b>Prince Harry</b>",
        "description": "The former Suits star is reportedly not happy with the different &quot;rules&quot; that have been placed on her and husband <b>Prince Harry</b>. According to the New York Post, Royal expert Neil Sean says that Markle has been &quot;demanding&quot; answers from Charles and has even ..."
    },
    {
        "url": "https://www.thechronicle.com.au/entertainment/celebrity-life/royals/kate-middleton-prince-william-to-send-prince-george-to-eton-college/news-story/59c41b82f61263cf94b3e04219db3009",
        "title": "Kate Middleton: <b>Prince</b> William to send <b>Prince</b> George to Eton College",
        "description": "Princess Catherine is said to be distraught over <b>Prince</b> William’s decision to send <b>Prince</b> George to Eton for one very personal reason. It’s believed the mum-of-three isn’t keen on same-sex schools such as Eton because she “absolutely hated” her ..."
    },
    {
        "url": "https://www.sundaystar.co.uk/royal-family-news/sarah-ferguson-reaction-prince-andrew-epstein/1768/",
        "title": "Sarah Ferguson using ITV jobs to &#39;take her mind off&#39; headlines about ex <b>Prince</b> Andrew",
        "description": "ROYAL favourite turned TV presenter Sarah Ferguson is trying to keep her head down amid drama with her ex, Prince"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/video-prince-harry-looking-like-crying-middle-king-charles-coronation-going-viral.html/",
        "title": "Video of <b>Prince Harry</b> Looking Like He’s Crying in the Middle of King Charles’ Coronation Is Going Viral",
        "description": "A video is circulating on TikTok showing Prince Harry appearing as if he&#39;s crying during King Charles III&#39;s coronation ceremony."
    }
]