[
    {
        "url": "https://www.skynews.com.au/opinion/prince-harry-and-meghan-downgraded-to-a-footnote-on-royal-family-website/video/30414094bdb5005f32de92d627c047a4",
        "title": "<b>Prince Harry</b> and Meghan downgraded to a ‘footnote’ on Royal Family website",
        "description": "&quot;There was a stipulation underneath Prince Harry’s bit that said that him are Meghan are going to continue to work with the King to fulfil their various patronages and to uphold the interests of the King and the Royal Family,” Ms Krakue told Sky News host Caroline Di Russo."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/diana-queen-government-house-of-lords-cabinet-office-b1136983.html",
        "title": "Late Queen’s common sense will be used to guide permanent memorial in her honour",
        "description": "Baroness Amos and anti-bullying campaigner Alex Holmes have been appointed to the Queen Elizabeth Memorial Committee, alongside Lord Janvrin."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-told-family-friend-32045960.amp",
        "title": "<b>Prince Harry</b> told family friend he &#39;didn&#39;t want Archie&#39; to follow in Queen&#39;s footsteps",
        "description": "Prince Harry and Dr Jane Goodall have been friends for years, and even visited Harry and Meghan Markle shortly after they welcomed their first child, son Archie, in 2019"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862858/royal-family-live-prince-harry-meghan-markle-queen-elizabeth",
        "title": "Royal Family LIVE: &#39;Hypocrites&#39; <b>Prince Harry</b> and Meghan Markle &#39;bullied royals for money&#39;",
        "description": "Royal expert Angela Levin has called Prince Harry and Meghan Markle &quot;hypocrites&quot; after the couple voiced &quot;concerns&quot; over cyber-bullying."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/real-reason-prince-harry-meghan-32044754",
        "title": "Real reason <b>Prince Harry</b> and Meghan Markle will likely skip the Grammys",
        "description": "Prince Harry and Meghan Markle relocated to the US in January 20202 after stepping down as senior working royals, and the couple have since tried to launch Hollywood careers"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harrys-seven-word-response-32044702",
        "title": "<b>Prince Harry</b>&#39;s seven-word response to being pushed down Royal line of succession",
        "description": "Prince Harry was once asked how he felt about being pushed down the Royal line of succession following the birth of George and Charlotte, and his response was rather sweet"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13043769/Artist-created-sketch-Sussexes-2021-Christmas-card-says-shes-honoured-royal-fans-spot-work-framed-Prince-Harrys-shelf-reveals-Meghan-sent-beautiful-thank-card.html",
        "title": "Artist who created a sketch of the Sussexes&#39; 2021 Christmas card says she&#39;s &#39;honoured&#39; after royal fans spot the work framed on <b>Prince Harry</b>&#39;s shelf - and reveals Meghan sent a ...",
        "description": "Jennifer Vallez, a US-based artist who draws members of the royal family, revealed her shock in an Instagram post after a photo of Harry on a video call resurfaced on X/Twitter."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-two-word-response-32043528",
        "title": "<b>Prince Harry</b>&#39;s two-word response after &#39;snubbing <b>Prince</b> William&#39;s heart to heart&#39;",
        "description": "Prince William was said to have been keen to meet with brother Prince Harry to have a heart to heard but a book claims this never took place."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13043693/First-look-Netflixs-drama-Prince-Andrews-Newsnight-interview-Rufus-Sewell-Gillian-Anderson-bear-uncanny-likenesses-Duke-York-Emily-Maitlis-new-film-infamous-interview.html",
        "title": "First look at Netflix&#39;s drama about <b>Prince</b> Andrew&#39;s Newsnight interview: Rufus Sewell and Gillian Anderson bear uncanny likenesses to the Duke of York and Emily Maitlis in new ...",
        "description": "Netflix &#39;s upcoming drama about the now-infamous interview between The Duke of York and the BBCs Emily Maitlis strikes an uncanny likeness from the actors."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/prince-harry-meghan-markle-child-safety-statement",
        "title": "<b>Prince Harry</b> and Meghan Markle have issued an extremely important statement",
        "description": "Prince Harry and Meghan Markle are two of the most talked-about people in the world. This is particularly true when it comes to their charity work and activism, with the Duke and Duchess of Sussex never failing to stand up and speak out for what they believe in."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862930/prince-harry-meghan-markle-desperation-star-power",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;must not show signs of desperation&#39; to keep star power",
        "description": "EXCLUSIVE: Prince Harry and Meghan Markle &#39;must not show signs of desperation&#39; to hold onto their star power, an entertainment expert has claimed."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/grammy-biggest-upsets-beyonce-adele-u2-justin-bieber-drake-b1136494.html",
        "title": "Biggest Grammy upsets through the years: From Beyoncé&#39;s snub to Lionel Richie&#39;s shock win",
        "description": "While everyone anticipated a nail-biting battle between Prince&#39;s Purple Rain and Bruce Springsteen&#39;s Born in the U.S.A., Lionel Richie swooped in with Can’t Slow Down, clinching the Grammy&#39;s top trophy in 1985."
    },
    {
        "url": "https://uk.news.yahoo.com/queen-thought-princess-diana-better-165148400.html",
        "title": "Queen ‘thought Princess Diana was better match for <b>Prince</b> Andrew’, new book claims",
        "description": "The late Queen thought Princess Diana was better suited for Prince Andrew than her eldest son the Prince of Wales, a new book has claimed. Ingrid Seward, the former editor-in-chief of Majesty magazine, has shed light on the early days between the future King Charles and Diana in her new book My Mother and I."
    },
    {
        "url": "https://www.telegraph.co.uk/fashion/royals/the-crown-costumes-fashion-bonhams-auction-princess-diana/",
        "title": "This is the closest we’ll ever get to buying Princess Diana’s revenge dress",
        "description": "A stroll around Bonhams’ sale of The Crown’s costumes and props is like entering a surreal world where Madame Tussauds and Buckingham Palace have somehow converged, and where the lines between what’s real and what’s royal are bizarrely blurred."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/disgraced-royal-braces-third-feature-093534239.html",
        "title": "Disgraced Royal Braces For THIRD Feature-Length Film To Tell Story Of War Hero Turned Trafficker’s Friend",
        "description": "More from Deadline Princes <b>Harry</b> And William&#39;s Dispute &quot;Pre-dated Meghan&#39;s Arrival,&quot; With Real Reason Revealed Kate Middleton&#39;s Uncle Gary Signs Up For British Reality TV Show <b>Prince Harry</b> Remembers Diana&#39;s White House Dance As He Accepts &#39;Living Legend ..."
    },
    {
        "url": "https://uk.style.yahoo.com/snl-weekend-takes-suits-spinoff-055039361.html",
        "title": "‘SNL’s Weekend Update Takes On ‘Suits’ Spinoff, Donald Trump &amp; MAGA Conspiracies About Taylor Swift &amp; The Super Bowl",
        "description": "Colin Jost and Michael Che took shots at the Suits spinoff and Donald Trump during the Saturday Night Live Weekend Update segment. This week, it was announced that the Suits spinoff had received a pilot order from NBC and would be set in Los Angeles. More ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-door-firmly-32027649?int_source=nba",
        "title": "<b>Prince Harry</b> and Meghan have had &#39;door firmly shut&#39; in their face as royals employ new tactic",
        "description": "The Duke and Duchess of Sussex were said to be hoping to make amends with <b>Harry</b>&#39;s relatives in the near future but it seems the royals have other plans as they have shut them out with a new tactic. The Duke and Duchess of Sussex have been estranged from ..."
    },
    {
        "url": "https://uk.yahoo.com/style/prince-george-truly-mother-princess-165333937.html",
        "title": "<b>Prince</b> George Is Truly His Mother Princess Kate’s Son When It Comes to This Signature Hair Move",
        "description": "(Louis is half George’s age and will turn six in April.) Another user added that Princess Diana “used to do this” with both William and <b>Prince Harry</b>."
    },
    {
        "url": "https://startsat60.com/media/news/the-royal-family-member-queen-elizabeth-thought-princess-diana-was-a-far-better-match-for",
        "title": "The Royal Family member Queen Elizabeth thought Princess Diana was a ‘far better’ match for",
        "description": "In a surprising revelation from a new royal biography, it has been disclosed that Queen Elizabeth II once believed that Princess Diana was &quot;far better suited&quot; to Prince Andrew than to her eldest son,"
    },
    {
        "url": "https://www.skynews.com.au/world-news/hypocritical-meghan-markle-and-prince-harry-accused-of-bullying-late-queen-elizabeth-for-financial-gain/news-story/75d197d8c702b96671e67169346ad9ca",
        "title": "&#39;Hypocritical&#39;: Meghan Markle and <b>Prince Harry</b> accused of bullying late Queen Elizabeth for financial gain",
        "description": "Prince Harry and Meghan Markle have been accused of “bullying” frail Queen Elizabeth in the months before her death and slammed as “hypocritical” by Angela Levin."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-grandfather-allegedly-called-000026440.html",
        "title": "<b>Prince Harry</b>’s Grandfather Allegedly Called Meghan Markle This Spiteful Nickname",
        "description": "Amid the recent slew of criticisms plaguing the royal couple, <b>Prince Harry</b> and Meghan have several upcoming projects to look forward to, including a film with Netflix, and are anticipating a successful year. An excerpt from an upcoming book by Royal ..."
    },
    {
        "url": "https://home.nzcity.co.nz/news/article.aspx?id=392488",
        "title": "<b>Prince Harry</b> and Meghan, Duchess of Sussex are said to be working on a &quot;bunch&quot; of fresh projects for Netflix",
        "description": "But Netflix&#39;s chief content officer Bela Bajaria has now revealed the pair are working on new projects, including ones that are &quot;unscripted&quot;. She told a Netflix promotional event"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-told-family-friend-32045960",
        "title": "<b>Prince Harry</b> told family friend he &#39;didn&#39;t want Archie&#39; to follow in Queen&#39;s footsteps",
        "description": "Prince Harry and Dr Jane Goodall have been friends for years, and even visited Harry and Meghan Markle shortly after they welcomed their first child, son Archie, in 2019"
    },
    {
        "url": "https://www.babysavers.com/harry-potter-cake/",
        "title": "Magical <b>Harry</b> Potter Cake Ideas for Your Next Party",
        "description": "<b>Harry</b> Potter and the Half-Blood <b>Prince</b> has <b>Harry</b> uncovering Voldemort’s past and the secret to his destruction, learning about the existence of Horcruxes. <b>Harry</b> Potter and the Deathly Hallows follows <b>Harry</b>, Ron, and Hermione as they forego their final ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25715918/glamping-site-sandringham-estate-king-charles/",
        "title": "‘Ultra-luxurious’ woodland glamping site with safari tents ‘fit for a king’ to be built on Charles’ Sandringham Estate",
        "description": "A GLAMPING site fit for a king is set to be built on the royal Sandringham Estate. His Majesty has approved the plan to install 15 safari tents, each with its own veranda and built-in timber"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-meghan-markle-risk-lot-going-oscars-even-skip-awards-show-expert.html/",
        "title": "<b>Prince Harry</b> and Meghan Markle Would ‘Risk’ a Lot by Going to the Oscars, But Even More if They Skip the Awards Show — Expert",
        "description": "It&#39;s not confirmed whether or not Prince Harry and Meghan Markle are going to the Oscars, but an expert says it&#39;s be a big deal for the pair."
    },
    {
        "url": "https://www.sheknows.com/parenting/articles/2950064/prince-harry-meghan-markle-family-sketch/",
        "title": "Eagle-Eyed Fans Noticed the Incredibly Heartwarming Momento <b>Prince Harry</b> Has in Honor of His Two Kids",
        "description": "Eagle-eyed fans on X, the social media platform formerly known as Twitter, noticed something incredibly sweet when looking through old videos of the Duke and Duchess of Sussex. An account run by @Le__Katerina, which was then made viral by Hello! US, showed that Harry has a sweet illustration of his family of four in his office."
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/royals-spiteful-meghan-markle-nickname-revealed/",
        "title": "Royal&#39;s &#39;Spiteful&#39; Meghan Markle Nickname Revealed",
        "description": "Like Simpson, Markle was divorced once before marrying <b>Prince Harry</b>, although since <b>Harry</b> is not the monarch or the heir, it is only a symbolic issue for them. The comparison likely has more to do with Markle and <b>Prince Harry</b>&#39;s retreat from royal life in ..."
    },
    {
        "url": "https://www.sapeople.com/royals/harry-and-meghan-take-over-hollywood-with-new-netflix-projects/",
        "title": "<b>Harry</b> and Meghan take over Hollywood with new Netflix projects",
        "description": "A Netflix executive has shared that Prince Harry and Meghan Markle have several Netflix projects that are current in development."
    },
    {
        "url": "https://people.com/princess-diana-dad-changed-her-mind-about-canceling-wedding-book-claims-8558496",
        "title": "Princess Diana Almost Called Off Wedding to <b>Prince</b> Charles But Her Dad Changed Her Mind, New Book Claims",
        "description": "A new book by a royal biographer claims that Princess Diana had doubts ahead of her 1981 wedding to then-Prince Charles, as well as alleging that her father Earl Spencer convinced her she shouldn&#39;t call off the ceremony."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/daniel-radcliffes-parents-alan-radcliffe-210000479.html",
        "title": "All About Daniel Radcliffe&#39;s Parents, Alan Radcliffe and Marcia Gresham",
        "description": "The <b>Harry</b> Potter star grew up in London as an only child and quickly developed an interest in show business. “I was 5. I turned to my mom and said, ‘Mom, I want to be an actor,’ ” he told Parade in 2012. Initially, he explained, his parents weren ..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-always-thought-d-150000974.html",
        "title": "<b>Prince Harry</b> Always Thought He’d Get Married Before His Brother: “I Wanted It So Badly”",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://deadline.com/2024/02/snls-weekend-update-suits-spinoff-donald-trump-maga-conspiracies-taylor-swift-super-bowl-1235813716/",
        "title": "‘SNL’s Weekend Update Takes On ‘Suits’ Spinoff, Donald Trump &amp; MAGA Conspiracies About Taylor Swift &amp; The Super Bowl",
        "description": "Colin Jost and Michael Che took shots at the Suits spinoff and Donald Trump during the Saturday Night Live Weekend Update segment. This week, it was announced that the Suits spinoff had received a"
    },
    {
        "url": "https://www.allvipp.com/royals/all-about-meghan-markle-s-first-husband-trevor-engelson",
        "title": "All About Meghan Markle&#39;s First Husband Trevor Engelson",
        "description": "Meghan Markle has been one of the most talked about names within British royalty in recent years. But her current marriage to <b>Prince Harry</b> has not been her first time sharing wedding vows... Meghan Markle is a famous actress and Duchess She used to be ..."
    },
    {
        "url": "https://www.telegraph.co.uk/tv/2024/02/04/forget-james-bond-who-is-next-death-in-paradise-detective/",
        "title": "Forget James Bond – who will be the next Death in Paradise detective?",
        "description": "With Ralf Little facing an uncertain future on Saint Marie, we look at the contenders for the island&#39;s top job ahead of its 100th episode"
    },
    {
        "url": "https://uk.news.yahoo.com/disgraced-royal-braces-third-feature-093534239.html",
        "title": "Disgraced Royal Braces For THIRD Feature-Length Film To Tell Story Of War Hero Turned Trafficker’s Friend",
        "description": "There is a German saying which translates as, “All bad things come in threes.” It is one Prince Andrew may well be uttering under his breath this weekend, with reports that the disgraced British royal is to the be the subject of yet another feature-length profile piece."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154581-real-reason-behind-prince-harry-williams-growing-differences-revealed",
        "title": "Real reason behind <b>Prince Harry</b>, William&#39;s growing differences revealed",
        "description": "<b>Prince Harry</b> and <b>Prince</b> William had already grown apart before Meghan Markle entered into the royal family, a new report claimed. As per The Time, the rift between the late Princess Diana&#39;s sons first sparked after they came up with their different ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154588-ellen-pompeo-continues-to-hold-olive-branch-against-greys-anatomy-co-star-katherine-heigl",
        "title": "Ellen Pompeo continues to hold olive branch against Grey’s Anatomy co-star Katherine Heigl",
        "description": "The Masked Singer&#39;s episode on Saturday, February 3 featured double elimination Real reason behind <b>Prince Harry</b>, William&#39;s growing differences revealed Meghan Markle allegedly was not the reason behind <b>Prince Harry</b>&#39;s growing rift with his brother Carey ..."
    },
    {
        "url": "https://www.plymouthherald.co.uk/news/history/devonport-dockyard-workers-once-tried-9064713",
        "title": "Devonport Dockyard workers once tried to trick <b>Harry</b> Houdini but were left speechless",
        "description": "It transpires that <b>Harry</b>, born Erik Weisz in Hungary in 1874, but raised in Wisconsin, USA from the age of four, first appeared in public, as a trapeze artist (‘<b>Prince</b> of the Air’) in 1883, aged nine. A great admirer of the French magician, Jean Eugene ..."
    },
    {
        "url": "https://www.nowtolove.com.au/royals/british-royal-family/prince-william-princess-kate-not-talking-to-prince-harry-79989",
        "title": "With Princess Kate on bed rest, <b>Prince</b> William is determined to protect",
        "description": "Princess Kate Middleton’s departure from The London Clinic last week was shrouded in secrecy – a sign royal insiders say that the Princess"
    },
    {
        "url": "https://www.goldcoastbulletin.com.au/news/national/harry-and-meghan-to-hopefully-use-fame-to-advocate-for-worthy-causes/video/0920c388521481fb28be15c9e01fd3aa",
        "title": "<b>Harry</b> and Meghan to hopefully use fame to advocate for ‘worthy causes’",
        "description": "Sky News host Caroline Di Russo has expressed hope Prince Harry and Meghan Markle will use their “material influence” as celebrities to advocate for worthy causes. Ms Di Russo pointed to positive signs of growth for the couple after they contacted Buckingham Palace to check on the health of the King and Princess of Wales."
    }
]