[
    {
        "url": "https://newsinfo.inquirer.net/1887955/bruneis-polo-playing-prince-marries-commoner",
        "title": "Brunei’s polo-playing <b>prince</b> marries commoner",
        "description": "Brunei’s polo-playing Prince Abdul Mateen, one of Asia’s most eligible bachelors, married his commoner fiancée on Thursday as part of a lavish 10-day"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854774/prince-harry-legend-of-aviation-award-mocked",
        "title": "<b>Prince Harry</b> &#39;Legend of Aviation&#39; award brutally mocked by army personnel",
        "description": "Prince Harry is set to be honoured as a &#39;Living Legend of Aviation&#39; at a ceremony at Beverly Hills next week, however army experts have suggested he is less than deserving."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854759/meghan-markle-prince-harry-royal-peace-king-charles-olive-branch",
        "title": "Meghan Markle and <b>Prince Harry</b> can still secure royal peace after King&#39;s subtle &#39;move&#39;",
        "description": "King Charles&#39;s holiday guest list could prove to be a &quot;turning point&quot; for his relationship with Prince Harry and Meghan Markle, an expert has said"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-is-his-military-past-really-being-erased_art20733.html",
        "title": "<b>Prince Harry</b>: Is his military past really being erased?",
        "description": "It was recently announced that Prince Harry would not be mentioned in a British Army book even though he did two tours in Afghanistan. Though some think this means he is being"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-mocked-over-living-31861130",
        "title": "<b>Prince Harry</b> mocked over &#39;living legend&#39; award after it sparks fury among experts",
        "description": "It has been revealed that Prince Harry will be inducted into the &#39;Living Legends of Aviation&#39; for his work as a British Army veteran and pilot - but some former military personnel have questioned why"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12950903/King-promote-Beatrice-STRIP-Andrew-Harry.html",
        "title": "Why not promote Beatrice and Eugenie to front-line royals, asks RICHARD EDEN? They&#39;ve never put a foot wrong! But it&#39;s time to STRIP troubled <b>Prince</b> Andrew and <b>Prince Harry</b> ...",
        "description": "It&#39;s been a difficult week for the Royal Family, with allegations of Prince Andrew&#39;s seedy past casting a shadow over his brother&#39;s reign,&#39; writes Richard Eden."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12952169/lauren-sanchez-living-legends-aviation-honour-prince-harry-induction-glitzy-bash.html",
        "title": "Jeff Bezos&#39; fiancé Lauren Sanchez will be honoured with her own &#39;Living Legends of Aviation&#39; award at glitzy bash where <b>Prince Harry</b> is getting inducted - the latest famous ...",
        "description": "The Living Legends of Aviation is bestowing television anchor turned helicopter pilot Lauren Sanchez with its highest honor for vertical flight, the Elling Halvorson Vertical Flight Hall of Fame Award."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25319337/fury-prince-harry-legend-of-aviation/",
        "title": "<b>Prince Harry</b> was only number two in his own aircraft, ex-commander says as royal mocked over ‘Legend of Aviation’ award",
        "description": "PRINCE Harry is set to be named a ‘Living Legend of Aviation’ despite only being “number two” in his helicopter in Afghanistan. Harry will be inducted next Friday at an awards"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-william-the-secret-code-the-royal-brothers-use-in-extreme-crisis-revealed_art20728.html",
        "title": "<b>Prince Harry</b> and William: The &#39;secret code&#39; the royal brothers use in extreme crisis revealed",
        "description": "Prince Harry and Prince William have a ‘secret code’ that can only be used in times of extreme crisis. Let’s find out what that is and when was it last"
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middletons-fingers-went-white-31859294",
        "title": "Kate Middleton&#39;s fingers &#39;went white as she gripped chair in tense Meghan and <b>Harry</b> meeting&#39;",
        "description": "In his memoir Spare, Prince Harry laid bare the early tensions between his wife Meghan Markle and the Princess of Wales as he revealed a chat between them that ended badly"
    },
    {
        "url": "https://uk.news.yahoo.com/uta-signs-crown-prince-harry-164405503.html",
        "title": "UTA Signs ‘The Crown’s <b>Prince Harry</b>, Luther Ford",
        "description": "EXCLUSIVE: UTA has signed actor Luther Ford, who broke out with his turn as Prince Harry in The Crown‘s final season, for representation in all areas. A film student booked from an open casting call,"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/11/prince-harry-mark-ormrod-stolen-prosthetic-legs-returned/",
        "title": "<b>Prince Harry</b>’s triple amputee friend has stolen prosthetic legs returned",
        "description": "Social media appeal proves successful after woman finds Royal Marine veteran’s belongings in alley by her house"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25321134/prince-harry-louis-book-princess-diana-unlikely-read/",
        "title": "<b>Prince Harry</b> ‘gifted <b>Prince</b> Louis an £8k book inspired by Diana’ – but it’s ‘unlikely he’ll have read it yet’",
        "description": "PRINCE Harry took his uncle duties seriously when Prince Louis was born and gifted him a very lavish £8,000 christening gift – but it’s unlikely the royal prince has used it yet. The Duke of"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-blunt-one-word-31856491",
        "title": "Meghan Markle&#39;s blunt one-word remark about Trooping the Colour was met with &#39;yawning silence&#39;",
        "description": "The Duchess of Sussex attended her first Trooping the Colour in 2018 but it appears Kate Middleton was not impressed with Meghan when she gave a simple one word remark about the ceremony."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511035/prince-harry-and-meghan-markle-astrology-compatibility/",
        "title": "Virgo <b>Prince Harry</b> and Leo Meghan Markle are from &#39;different galaxies&#39; but &#39;can weather any storm&#39;, astrology says",
        "description": "It&#39;s safe to say that everyone has their own opinions about Prince Harry and Meghan Markle&#39;s relationship. But no matter how you feel about them, it&#39;s impossible not to appreciate and respect the pair&#39;s unwavering united front and their electric chemistry — they are a magnetic presence when together."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/mark-ormrod-prosthetic-legs-stolen-premier-inn-b2476906.html",
        "title": "<b>Prince Harry</b>’s war hero friend reunited with prosthetic legs stolen from car",
        "description": "Prince Harry’s war hero friend has spoken of his relief after being reunited with his prosthetic legs that were stolen from his car. Triple amputee and ex-Royal Marine Mark Ormrod MBE woke up on Wednesday morning to find his car had been broken into while parked in a disabled space at a west London Premier Inn overnight."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-named-legend-aviation-31855628",
        "title": "<b>Prince Harry</b> named &#39;Legend of Aviation&#39; after firing on the Taliban from a helicopter",
        "description": "Prince Harry has been recognised for his contribution to aviation and aerospace and will be honoured at the 21st annual Living Legends of Aviation Awards in Los Angeles"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-named-living-legend-aviation-beverly-hills-ceremony-1722668",
        "title": "<b>Prince Harry</b> To Be Named &#39;Living Legend of Aviation&#39; At Beverly Hills Ceremony",
        "description": "The royal will also be honoured for creating the Invictus Games, which benefits wounded service members and veterans globally. Prince Harry will be inducted as a &quot;Living Legend of Aviation&quot; alongside Marc Parent, Fred George and Steve Hinton."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-aviation-award-b2476875.html",
        "title": "<b>Prince Harry</b> to be named a ‘Legend of Aviation’ alongside space heroes Neil Armstrong and Buzz Aldrin",
        "description": "Prince Harry will be inducted to the charity-run Living Legends of Aviation ceremony in Beverly Hills, California"
    },
    {
        "url": "https://www.hellomagazine.com/brides/511023/prince-harry-reveals-real-thoughts-chelsy-davy-in-laws-rare-confession/",
        "title": "<b>Prince Harry</b> reveals real thoughts on Chelsy Davy &#39;in-laws&#39; in rare confession",
        "description": "Before marrying Meghan Markle and developing a close bond with his mother-in-law Doria Ragland, Prince Harry formed a close relationship with his ex Chelsy Davy&#39;s family. The Duke of Sussex, 39, dated the Aya jewellery designer,"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/11/prince-harry-aviation-award-ceremony-los-angeles/",
        "title": "<b>Prince Harry</b> to be named ‘Living Legend of Aviation’ at ceremony in Beverly Hills",
        "description": "The Duke will be recognised for being an Apache helicopter pilot in Afghanistan during 10 years in the military"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-named-living-legend-090000986.html",
        "title": "<b>Prince Harry</b> to be named Living Legend of Aviation",
        "description": "<b>Prince Harry</b> is to be named a Living Legend of Aviation for his work in the British Army. The 39-year-old royal - who is now married to Meghan, Duchess of Sussex, and relinquished royal duties in 2020 in favour of a life in LA - served in the army for 10 ..."
    },
    {
        "url": "https://www.standard.co.uk/news/world/duke-of-sussex-pilot-aviation-john-travolta-award-beverly-hills-b1131616.html",
        "title": "<b>Prince Harry</b> to be named &#39;Legend of Aviation&#39; alongside Neil Armstrong and Buzz Aldrin",
        "description": "<b>Prince Harry</b> is set to be crowned a “living legend” of aviation alongside past notable inductees such as astronauts Buzz Aldrin and James Lovell. The Duke of Sussex, 39, will be inducted into the Living Legends of Aviation at a ceremony hosted by ..."
    },
    {
        "url": "https://coveredgeekly.com/top-10-disliked-celebs-of-2023/",
        "title": "Top 10 Most Disliked Celebrities of 2023",
        "description": "<b>Prince Harry</b>, Duke of Sussex was listed as the 2nd most disliked celebrity of 2023. The royal family member’s controversial decision to leave the United Kingdom to live in the States sparked many online debates, reactions, and even a South Park parody ..."
    },
    {
        "url": "https://uk.yahoo.com/news/prince-harry-prince-william-secret-195806196.html",
        "title": "<b>Prince Harry</b> and <b>Prince</b> William Have &#39;Secret&#39; 3-Word Code Used &#39;Only in Times of Extreme Crisis&#39;",
        "description": "&quot;For nearly twenty-five years we’d reserved that soul-crushing vow for times when one of us needed to be heard, to be believed, quickly,&quot; the Duke of Sussex wrote in &#39;Spare&#39; <b>Prince Harry</b>’s memoir Spare was published one year ago today, inspiring a look ..."
    },
    {
        "url": "https://finance.yahoo.com/news/caes-ceo-marc-parent-inducted-213400007.html",
        "title": "CAE&#39;s CEO Marc Parent to be inducted as a Living Legend of Aviation",
        "description": "CAE President and Chief Executive Officer Marc Parent will be inducted as a Living Legend of Aviation during the organization&#39;s annual gala on9, 2024. The Living Legends of Aviation are individuals who are recognized for their exceptional contribution to the field."
    },
    {
        "url": "https://www.aol.com/entertainment/kate-middleton-uncle-slams-crown-185533376.html",
        "title": "Kate Middleton’s Uncle Slams &#39;The Crown&#39; as &#39;Ridiculous and Fantastical&#39;",
        "description": "The Crown season 6 highlighted Princess Kate Middleton and Prince William’s collegiate courtship, but at least one member of their family was displeased with the story line. “I really, really enjoyed the first couple of episodes and the first series of The Crown,"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/harry-styles-designer-daley-puts-203200114.html",
        "title": "<b>Harry</b> Styles’ go-to designer S.S Daley puts on a night of Eton-Oxbridge chic",
        "description": "Darling, where is Liverpool?”, asks Saltburn’s vacuous matriarch Lady Elspeth, portrayed by Rosamund Pike, in a scene from the Oscar-tipped movie where the blue-blood Catton family speculate in horror at what life must be like oop north."
    },
    {
        "url": "https://ca.news.yahoo.com/prince-harry-named-living-legend-060000234.html",
        "title": "Backlash after <b>Prince Harry</b> handed ‘living legend’ award",
        "description": "The Duke of Sussex has been engulfed in a row after the decision to recognise him as a “living legend of aviation” was branded “daft”."
    },
    {
        "url": "https://menafn.com/1107710547/Bruneis-Prince-Abdul-Mateen-Marries-Commoner-In-Lavish-Ceremony-Gun-Salutes-Fired-At-Royal-Wedding-WATCH",
        "title": "Brunei&#39;s <b>Prince</b> Abdul Mateen Marries Commoner In Lavish Ceremony; Gun Salutes Fired At Royal Wedding (WATCH)",
        "description": "Prince Abdul Mateen of Brunei, known for his prowess in polo and considered one of Asia&#39;s most eligible bachelors, exchanged vows with his commoner f"
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-slammed-royal-navy-201051848.html",
        "title": "<b>Prince Harry</b> Slammed By Royal Navy Veteran, He’s Undeserving Of ‘Living Legend’ Honor",
        "description": "Prince Harry‘s upcoming induction into the Living Legend of Aviation Hall of Fame hasn’t gone well with some British military veterans. According to a disgruntled vet, the Duke of Sussex is undeserving of the honor despite having done two tours in Afghanistan."
    },
    {
        "url": "https://www.btimesonline.com/articles/163214/20240112/prince-harry-and-meghan-markle-face-lowest-point-in-2024-after-tumultuous-2023-setbacks.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle Face &#39;Lowest Point&#39; in 2024 After Tumultuous 2023 Setbacks",
        "description": "Prince Harry and Meghan Markle enter 2024 at what royal commentators describe as their &quot;lowest point&quot; in over a decade, following a series of setbacks in 2023 that have left their public image and professional ventures in a precarious state."
    },
    {
        "url": "https://www.channelnewsasia.com/asia/brunei-prince-abdul-mateen-marriage-anisha-rosnah-commoner-celebration-4040241",
        "title": "Brunei&#39;s <b>Prince</b> Mateen marries commoner in lavish days-long celebration",
        "description": "Brunei&#39;s polo-playing Prince Abdul Mateen, one of Asia&#39;s most eligible bachelors, married his commoner fiancee on Thursday (Jan 11) as part of a lavish 10-day celebration in the oil-rich sultanate. An"
    },
    {
        "url": "https://www.samaa.tv/208737875-will-2024-be-their-comeback-harry-meghan-face-make-or-break-year",
        "title": "Will 2024 be their comeback? <b>Harry</b> &amp; Meghan face make-or-break year",
        "description": "While their participation in the 2023 Invictus Games provided a brief respite, the release of Omid Scobie&#39;s &quot;Endgame&quot; in late November reignited the spotlight on their personal and professional struggles."
    },
    {
        "url": "https://www.btimesonline.com/articles/163212/20240112/prince-harrys-aviation-award-sparks-controversy-among-military-experts.htm",
        "title": "<b>Prince Harry</b>&#39;s Aviation Award Sparks Controversy Among Military Experts",
        "description": "Prince Harry, the Duke of Sussex, is set to be recognized as a &#39;Living Legend of Aviation&#39; at the 21st Annual Living Legends of Aviation Awards in Beverly Hills, but the honor has sparked a wave of controversy and debate."
    },
    {
        "url": "https://www.samaa.tv/208737873-meghan-markle-and-prince-harry-find-themselves-unnoticed-amongst-us-neighbours",
        "title": "Meghan Markle and <b>Prince Harry</b> find themselves unnoticed amongst US neighbours",
        "description": "Renowned royal expert Barry Maher shed light on the situation, stating, &quot;Harry and Meghan live down the street but in a considerably pricier spot, though nobody around here is exactly living in cardboard boxes."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/why-meghan-markle-prince-harry-190058184.html",
        "title": "Why Meghan Markle and <b>Prince Harry</b> Had to Return $7 Million in Wedding Gifts",
        "description": "Related: Prince Harry Will Reportedly Give Meghan Markle a Sentimental Gift for Their 5th Wedding Anniversary"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/harry-meghan-risk-being-seen-31855726",
        "title": "<b>Harry</b> and Meghan are at risk of being seen as &#39;expendable&#39; in Hollywood after big fail",
        "description": "Prince Harry and Meghan Markle &quot;have fallen&quot; in Hollywood and are at risk of being seen as &quot;expendable&quot;, royal experts have claimed. The Sussexes stepped down from their royal duties in 2020 to relocate to California with their sights set on a career in Hollywood after becoming financially independent."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-forced-31855517",
        "title": "Meghan Markle and <b>Prince Harry</b> forced to send back £7m worth of gifts from fans",
        "description": "The former royal couple received an overwhelming amount of presents from well wishers on their lavish wedding day in May 2018 but were unfortunately not allowed to keep any of the gifts."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/life/time-is-free-to-give-yet-priceless-to-receive-volunteers-urge-public-to-donate-free-minutes-to-help-others/a1238889516.html",
        "title": "‘Time is free to give yet priceless to receive’: Volunteers urge public to donate free minutes to help others",
        "description": "Volunteering has not only changed my life, but it has also saved my life,” says Carrickfergus woman Karolyn Gaston (52)."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-honored-living-legend-035730924.html",
        "title": "<b>Prince Harry</b> to Be Honored as ‘Living Legend of Aviation’",
        "description": "John Stillwell/Pool/ReutersPrince Harry, who served as a helicopter pilot in the British Army—including flying combat missions in Afghanistan—will be one of the inductees at the 21st Annual Living Legends of Aviation Awards in Beverly Hills on Jan."
    },
    {
        "url": "https://www.ft.com/content/4631e9e7-55ea-4561-8ee3-329eb249cf6b",
        "title": "Eton College moves lessons online after rainfall hits sewer system",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Eton College, one of Britain’s most prestigious public schools, has told pupils to study from home after heavy rainfall caused sewage issues on its site. The 584 ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-golden-globes-royal-31829518?int_source=nba",
        "title": "Meghan Markle&#39;s former Suits co-stars joke about her popularity before brutal remark at Golden Globes",
        "description": "Before she left to marry <b>Prince Harry</b>, Meghan Markle was a star on the hit legal series Suits but her former co-stars joked about her popularity during the 81st Golden Globes"
    }
]