[
    {
        "url": "https://www.cheatsheet.com/entertainment/princess-eugenie-solidarity-prince-william-kate-middleton-christmas-expert-says.html/",
        "title": "Princess Eugenie Showed ‘Solidarity’ With <b>Prince</b> William and Kate Middleton on Christmas, Expert Says",
        "description": "Princess Eugenie has been one of the few royals who has managed to stay close with both Prince William and Prince Harry."
    },
    {
        "url": "https://www.ok.co.uk/royal/crowns-dominic-wests-rude-stories-31752866",
        "title": "The Crown&#39;s Dominic West&#39;s rude stories that meant <b>Prince Harry</b> cut ties with him",
        "description": "Dominic West has opened up about his fallout with Prince Harry after the pair went on a trip to the South Pole together and the actor spilled the beans on their antics"
    },
    {
        "url": "https://www.ok.co.uk/royal/adorable-moment-king-charles-rubbishes-31752750",
        "title": "Adorable moment King Charles kisses <b>Prince</b> Louis - rubbishing <b>Prince Harry</b>&#39;s claim",
        "description": "King Charles has been spotted hugging and kissing Prince Louis in footage shown in a new BBC documentary, after Prince Harry claimed his dad &quot;never gives hugs&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849316/meghan-markle-return-acting-test-relationship-prince-harry",
        "title": "Meghan Markle’s ‘want to go back to acting’ will test relationship with <b>Prince Harry</b>",
        "description": "Renowned astrologer Susan Miller has revealed her predictions for 2024, including what&#39;s in store for Prince Harry and Meghan Markle."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-huge-31752313",
        "title": "Meghan Markle and <b>Prince Harry</b>’s huge but minimalist Christmas tree at Montecito mansion",
        "description": "Prince Harry and Meghan Markle spent Christmas at their £11million nine-bedroom home in Montecito, California this year"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/king-charles-replaced-prince-harry-31751304",
        "title": "King Charles &#39;replaced <b>Prince Harry</b>&#39; in his key family role this at Christmas",
        "description": "Prince Harry&#39;s absence has reportedly given King Charles a chance to let his humour shine with a cheeky Christmas tradition that leaves the Royal Family in hysterics"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849309/prince-harry-king-charles-coronation-documentary",
        "title": "<b>Prince Harry</b> snubbed in BBC King Charles documentary as minor royals take centre stage",
        "description": "The Duke of Sussex did not appear in the BBC documentary which aired on Christmas Day, despite some of the more minor members of the Royal Family featuring heavily."
    },
    {
        "url": "https://uk.news.yahoo.com/everything-know-idea-starring-anne-193430289.html",
        "title": "Everything to Know About “The Idea of You ”Starring Anne Hathaway and Nicholas Galitzine",
        "description": "The film is based on Robinne Lee&#39;s novel of the same name and is rumored to be inspired by Harry Styles fan fiction"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12901119/Prince-Harry-threw-s-fit-accused-Dominic-West-invading-privacy-Crown-star-reveals-royal-stopped-speaking-revealed-duke-drank-champagne-false-leg-told-filthy-jokes-danced-naked-South-Pole.html",
        "title": "<b>Prince Harry</b> &#39;threw a fit&#39; and cut Dominic West out of his life: Friend reveals details of Crown star&#39;s fall-out with the royal after the actor said he stopped speaking to him ...",
        "description": "The Crown star Dominic West was such a firm friend of his fellow Old Etonian the Duke of Sussex that they trekked to the South Pole together in aid of the charity Walking for the Wounded."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/26/dominic-west-prince-harry-cut-ties-said-too-much-reporters/",
        "title": "Dominic West: <b>Prince Harry</b> stopped speaking to me after I said too much to journalists",
        "description": "The Crown star says Duke of Sussex stopped speaking to him after a press conference about their 2013 South Pole charity trek"
    },
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-moving-on-8420117",
        "title": "Kate Middleton and <b>Prince</b> William Have Reportedly“Moved on” From Rift With <b>Prince Harry</b> and Meghan Markle",
        "description": "After years of royal family drama, sources say Kate Middleton and Prince William, the Prince and Princess of Wales, are moving on. Get the details here."
    },
    {
        "url": "https://uk.style.yahoo.com/kate-middleton-king-charles-quite-170000522.html",
        "title": "Kate Middleton and King Charles &#39;Are Quite Close — Closer to Him Than William,&#39; Says Insider (Exclusive)",
        "description": "The Prince and Princess of Wales are an &quot;incredible enhancement&quot; to King Charles and Queen Camilla,&quot; royal biographer Sally Bedell Smith tells PEOPLE in this week&#39;s issue"
    },
    {
        "url": "https://www.thesun.co.uk/tv/25164976/christmas-guest-editors-the-today-programme-2023/",
        "title": "Who are the Christmas guest editors on the Today programme?",
        "description": "BBC Radio 4’s Today programme has invited high-profile guest editors onto the show between Christmas and New Year. Here we take a look at who will to take the reins on"
    },
    {
        "url": "https://uk.movies.yahoo.com/crown-star-dominic-west-said-162520705.html",
        "title": "&#39;The Crown&#39; star Dominic West said <b>Prince Harry</b> stopped speaking to him after he &#39;said too much&#39; about a trip they took together",
        "description": "Dominic West revealed he and Prince Harry drank champagne out of a wounded veteran&#39;s prosthetic leg on a 2013 South Pole charity expedition."
    },
    {
        "url": "https://uk.movies.yahoo.com/did-u-k-prime-minister-160023303.html",
        "title": "Did U.K. Prime Minister Rishi Sunak Snub <b>Prince Harry</b> in His Christmas Video?",
        "description": "U.K. Prime Minister Rishi Sunak&#39;s Christmas video may have been misinterpreted. On Monday, Sunak shared a joke video on social media showing him in the rare situation of being alo"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-prince-harry-dominic-west-b2469524.html",
        "title": "Dominic West says he no longer talks to <b>Prince Harry</b> after ‘saying too much’ in 2014",
        "description": "Dominic West has explained why he no longer speaks to Prince Harry despite the pair becoming friendly during a charity trek in 2013."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25165232/prince-harry-relationship-dominic-west/",
        "title": "<b>Prince Harry</b> ‘threw fit’ in fall-out with Dominic West after actor said duke drank champagne out of false leg, pal says",
        "description": "PRINCE Harry has reportedly cut ties with his actor pal Dominic West. The Duke is alleged to have “thrown a s*** fit” after West claimed the pair drunk champagne from a prosthetic leg."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/king-charles-breaks-tradition-prince-28350223",
        "title": "King Charles breaks tradition with <b>Prince</b> Louis to rubbish <b>Harry</b> claims",
        "description": "King Charles hugged and kissed Prince Louis in a new BBC documentary, after stepping out with his grandchildren and the Royal Family on Christmas Day."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/the-crown-dominic-west-prince-harry-friendship-b1129069.html",
        "title": "Dominic West says he lost touch with <b>Prince Harry</b> after &#39;saying too much&#39; at press conference",
        "description": "The Crown star Dominic West has revealed that Prince Harry ended their friendship following comments he made about the royal in a press conference."
    },
    {
        "url": "https://metro.co.uk/2023/12/26/king-charles-shows-affection-towards-grandchildren-new-documentary-20026257/?ico=trending-module_author_jlreporter_item-1",
        "title": "King Charles shows tender affection towards grandchildren in new royal documentary",
        "description": "The ‘extraordinarily affectionate’ side of King Charles III will be shown in a new BBC documentary marking the first year of his reign. In contrast to the cold picture of the king alluded to by Prince Harry, he enters a rehearsal for his Coronation at Westminster Abbey showing his fondness for Prince William and the heir’s young family."
    },
    {
        "url": "https://uk.style.yahoo.com/kate-middleton-secret-strength-she-130000646.html",
        "title": "Kate Middleton’s Secret Strength: &#39;She Is Prepared to Fight for What She Thinks Is Right&#39; (Exclusive)",
        "description": "“She has this public image of being nice and smiley and, dare I say, innocuous,” royal author Valentine Low tells PEOPLE in this week&#39;s issue. “But she is actually strong-minded, strong-willed and prepared to fight for what she wants and what she thinks is right.”"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12881761/susan-miller-predictions-2024-taylor-swift-travis-kelce.html",
        "title": "Celebrity astrologer Susan Miller lays bare her expert predictions for 2024 - revealing whether Taylor Swift and Travis Kelce will REALLY last... and why there&#39;s TROUBLE ahead ...",
        "description": "FEMAIL has asked renowned astrologist Susan Miller, founder of Astrology Zone, to share her predictions for the coming year, including what&#39;s in store for celebrity A-list couples Taylor Swift and Travis Kelce, and <b>Prince Harry</b> and Meghan Markle."
    },
    {
        "url": "https://www.smh.com.au/lifestyle/dominic-west-says-prince-harry-stopped-speaking-to-him-after-he-said-too-much-to-journalists-20231227-p5etsp.html",
        "title": "Dominic West says <b>Prince Harry</b> stopped speaking to him after he said too much to journalists",
        "description": "In an interview with Times Radio, Dominic West says that he&#39;s no longer friends with Prince Harry."
    },
    {
        "url": "https://www.econotimes.com/Phone-hacking-in-the-British-press-three-key-moments-in-the-scandal--and-what-happens-next-1668484",
        "title": "Phone hacking in the British press: three key moments in the scandal – and what happens next",
        "description": "Prince Harry has emerged as the victor in his civil case against Mirror Group Newspapers. The judge, Mr Justice Fanning, ruled that on the balance of probabilities a sample of 15 out of 33 articles examined by his"
    },
    {
        "url": "https://www.foxnews.com/entertainment/the-crown-actor-admits-prince-harry-no-longer-speaks-to-him-i-said-too-much",
        "title": "&#39;The Crown’ actor says <b>Prince Harry</b> no longer speaks to him: ‘I said too much’",
        "description": "&quot;The Crown&quot; actor Dominic West said that although he and Prince Harry were friendly 10 years ago, they no longer speak because he once &quot;said too much&quot; at a press conference."
    },
    {
        "url": "https://uproxx.com/tv/the-crown-dominic-west-prince-harry-not-friends-anymore/",
        "title": "It Sure Seems Like ‘The Crown’s Dominic West And <b>Prince Harry</b> Aren’t Friends Anymore Because Of A… Toilet?",
        "description": "For the final two seasons of The Crown, The Wire star Dominic West took over the role of Prince Charles as the Netflix series tackled his tumultuous, scandal-ridden divorce from Princess Diana and the infamous car crash that took her life in the 1990s."
    },
    {
        "url": "https://www.yahoo.com/entertainment/member-british-royal-family-reportedly-210342402.html",
        "title": "This Member of the British Royal Family Has Reportedly Grown ‘Quite Close’ To King Charles",
        "description": "The dynamics among senior members of the British royal family have shifted quite a bit in the last few years. Between <b>Prince Harry</b> and Meghan Markle’s departure from the United Kingdom, King Charles III’s ascension to the throne, and more, the monarchy ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/162886/20231227/prince-andrew-and-sarah-fergusons-rare-public-outing-sparks-speculation.htm",
        "title": "<b>Prince</b> Andrew and Sarah Ferguson&#39;s Rare Public Outing Sparks Speculation",
        "description": "In an unexpected turn of events that caught the attention of royal watchers worldwide, Prince Andrew and his ex-wife Sarah Ferguson, the Duke and Duchess of York, made a rare joint appearance during the traditional Christmas walk at Sandringham."
    },
    {
        "url": "https://www.eastbaytimes.com/2023/12/26/prince-harry-accused-dominic-west-of-invading-his-privacy-after-actor-revealed-drunken-antics-on-south-pole-trek-report/",
        "title": "<b>Prince Harry</b> accused Dominic West of ‘invading his privacy’ after actor revealed drunken antics on South Pole trek: report",
        "description": "Harry reportedly ‘threw a fit’ after West revealed they drank champagne from a colleague’s prosthetic leg after their team reached the South Pole during a 2013 expedition."
    },
    {
        "url": "https://www.newstalkzb.co.nz/news/world/threw-a-fit-harrys-fury-at-the-crown-star/",
        "title": "The Crown star Dominic West reveals huge falling out with <b>Prince Harry</b>",
        "description": "Actor Dominic West - who plays Charles in Netflix’s The Crown, was once a friend of Prince Harry. The two were so close, they trekked to the South Pole tog"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142013-prince-william-kate-middleton-react-to-harrys-claims-in-style",
        "title": "<b>Prince</b> William, Kate Middleton react to <b>Harry</b>&#39;s claims in style",
        "description": "Prince William and his wife Princess Kate have seemingly reacted to Prince Harr&#39;s shocking claims with their stunning Christmas post. The Prince and Princess of Wales have tried to remove Harry&#39;s fear as they released an adorable picture of their three children George, Charlotte and Louis on Christmas Day."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142010-king-charless-secret-strength-kate-middleton-or-prince-william",
        "title": "King Charles secret strength - Kate Middleton or <b>Prince</b> William?",
        "description": "King Charles III is said to be very much inspired of his beloved daughter-in-law Kate Middleton&#39;s steadfastness with the Firm and the royal family. Prince William and Princess Kate are an &quot;incredible enhancement&quot; to the King and Queen Camilla,&quot; according to royal biographer Sally Bedell Smith."
    },
    {
        "url": "https://people.com/the-idea-of-you-everything-to-know-8420168",
        "title": "Everything to Know About",
        "description": "Speaking with Vogue in December 2020, she said she made Hayes into her “dream guy” including a mix of “<b>Prince Harry</b>-meets-<b>Harry</b> [Styles]” and a little bit of Eddie Redmayne. However, she maintains The Idea of You was “never supposed to be a book ..."
    },
    {
        "url": "https://www.hellomagazine.com/film/510082/the-crown-dominic-west-prince-harry-fall-out/",
        "title": "The Crown star reveals <b>Prince Harry</b> no longer speaks to him after he &#39;said too much&#39;",
        "description": "Despite its popularity, the sixth and final series of The Crown has been met with mixed reviews, and accused of &#39;obviously mining tragedy for ratings&#39;. Set in the late 90s and early 00s, it depicts the death of Princess Diana as well as Prince William ’s university years, when he met Kate Middleton."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12900885/prince-harry-cut-crown-star-reveals-exposing-antics-south-pole-expedition.html",
        "title": "Crown star reveals <b>Prince Harry</b> cut him off after he exposed the Duke&#39;s racy antics during raunchy South Pole expedition",
        "description": "Dominic West joined the Duke of Sussex on an ambitious trip as they both took part in the charity event Walking With the Wounded in Antarctica in 2013."
    },
    {
        "url": "https://uk.news.yahoo.com/crown-star-dominic-west-said-162520705.html",
        "title": "&#39;The Crown&#39; star Dominic West said <b>Prince Harry</b> stopped speaking to him after he &#39;said too much&#39; about a trip they took together",
        "description": "Dominic West revealed he and Prince Harry drank champagne out of a wounded veteran&#39;s prosthetic leg on a 2013 South Pole charity expedition."
    },
    {
        "url": "https://uk.news.yahoo.com/crown-star-dominic-west-says-155017085.html",
        "title": "‘The Crown’ Star Dominic West Says <b>Prince Harry</b> Hasn’t Spoken to Him After He ‘Probably Said Too Much’ About Their Friendship",
        "description": "The actor says he and the royal had a falling out 10 years ago The post ‘The Crown’ Star Dominic West Says Prince Harry Hasn’t Spoken to Him After He ‘Probably Said Too Much’ About Their Friendship appeared first on TheWrap."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/royal-family-christmas-sandringham-kings-speech-b2469259.html",
        "title": "King’s Speech live – Charles gives Christmas message after joining Kate and William at Sandringham",
        "description": "Earlier, Charles and Camilla were joined by the Prince and Princess of Wales and their children Prince George, Princess Charlotte and Prince Louis for morning service at St Mary Magdalene Church. It comes after the King and Queen waved to well-wishers while attending a Christmas Eve service at the church on Sunday."
    },
    {
        "url": "https://goss.ie/featured/the-crown-actor-reveals-major-fallout-with-prince-harry-i-said-too-much-363628",
        "title": "The Crown actor reveals major fallout with <b>Prince Harry</b>: ‘I said too much’",
        "description": "Dominic West has revealed he had a major fallout with Prince Harry. The Crown actor, who plays King (then Prince) Charles in the Netflix series, has admitted they stopped speaking after he “said too much” during a press conference."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markles-christmas-31749939",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s Christmas reunion in UK &#39;ruined&#39; amid fresh drama",
        "description": "Before the release of bombshell book End Game, it was hooped by royal fans that t the Duke and Duchess of Sussex would able to make amends with the Royal family in time for Christmas"
    },
    {
        "url": "https://www.worcesternews.co.uk/news/24011397.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to <b>Prince Harry</b>",
        "description": "From Barbie to Prince Harry, test how much you remember about 2023 with our epic 23-question end-of-the-year quiz."
    },
    {
        "url": "https://www.thesun.ie/royals/11903816/kings-speech-christmas-2023-charles-william-kate-updates/page/3/",
        "title": "King’s Speech 2023 LIVE — Charles hails key workers as Kate &amp; <b>Prince</b> William join Monarch at Sandringham for Boxing Day",
        "description": "KING Charles delivered his second Christmas address as monarch to the nation yesterday and hailed essential workers. The King took to our screens to reflect on 2023 and look forward to the"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25163581/king-charles-louis-doc-harry/",
        "title": "Adorable moment ‘affectionate’ King Charles kisses Louis in new doc after bitter <b>Harry</b> claimed he ‘never gives hugs’",
        "description": "THIS is the adorable moment an “affectionate” King Charles kisses Prince Louis in a new documentary – after Prince Harry claimed he “never gives hugs”."
    },
    {
        "url": "https://metro.co.uk/2023/12/26/crowns-dominic-west-admits-fallout-prince-harry-20025395/?ico=trending-module_category_tv_item-1",
        "title": "<b>Prince Harry</b> ‘threw a fit’ and no longer speaks to The Crown star",
        "description": "The Crown star Dominic West has revealed he had a falling out with Prince Harry which resulted in them not speaking. The 54-year-old actor plays Charles, Prince of Wales, in the later seasons of the controversial Netflix series, which recently came to an end with season six."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510071/meghan-harry-christmas-tree/",
        "title": "Meghan Markle and <b>Prince Harry</b>’s huge minimalist deco Christmas tree at their Montecito mansion",
        "description": "The tree - which appears to be a real fir tree - is the focal point of the couple’s living room, reaching all the way up to the ceiling at their Montecito mansion in Los Angeles. It’s decorated simply, with twinkly fairy lights and only a sparse scattering of simple ornaments - including baubles and a toy Santa."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/king-charles-snubs-prince-harry-31749517.amp",
        "title": "King Charles snubs <b>Prince Harry</b> during Christmas Day speech",
        "description": "King Charles appeared to snub Prince Harry on Christmas Day as the monarch failed to mention his son during his second Christmas speech. Most of the members of the Firm were mentioned during the speech, however, Harry was noticeably snubbed as well as the Duke of York, Prince Andrew."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/king-charles-made-two-glaring-28347949",
        "title": "King Charles made two glaring omissions in Christmas Day speech",
        "description": "As he addressed the nation from 3pm on December 25, Charles failed to mention Andrew, the Duke of York, in his speech - and Harry was nowhere to be seen in clips of the Royal Family."
    },
    {
        "url": "https://www.huffpost.com/entry/dominic-west-prince-harry-friendship-ended-said-too-much_n_6589dccae4b03e698a14124b",
        "title": "&#39;The Crown&#39; Actor Explains Why Friendship With <b>Prince Harry</b> Ended: &#39;I Said Too Much&#39;",
        "description": "Earlier this year, the British royal family member admitted he’s not above watching “The Crown,” which is loosely based on the reign of his late grandmother, Queen Elizabeth II, despite living through the portrayed events in real-life."
    },
    {
        "url": "https://uk.style.yahoo.com/crown-actor-dominic-west-prince-022325125.html",
        "title": "‘The Crown’ Actor Dominic West On <b>Prince Harry</b> Fallout: “I Said Too Much In A Press Conference”",
        "description": "Dominic West took on the role of Prince Charles, Prince of Wales, in the final two seasons of The Crown. The actor was close to Prince Harry at one point but has recently revealed they had a fallout."
    }
]