[
    {
        "url": "https://uk.style.yahoo.com/oldest-royal-family-member-led-180502479.html",
        "title": "Oldest Royal Family Member (Who Led Hidden Double Life!) Turns 91 with Rare Statement",
        "description": "Katharine, the Duchess of Kent, is ringing in her royal birthday — as the oldest member of the British royal family."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-blocking-prince-harrys-32189317",
        "title": "Meghan Markle &#39;blocking&#39; <b>Prince Harry</b>&#39;s dream of six months in UK for royal role",
        "description": "Prince Harry wanted to return to the UK to help his father, King Charles, following his cancer diagnosis - but he will not move back without his wife, a Royal expert has said"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13113013/Prince-Harrys-offer-royal-duties-brutal.html",
        "title": "<b>Prince Harry</b>&#39;s recent offer to resume royal duties met a &#39;swift and brutal&#39; response, writes RICHARD EDEN. And no wonder. William is adamant that little brother <b>Harry</b> MUST ...",
        "description": "Writing in the latest edition of his Palace Confidential newsletter, Eden concludes that recent events provide a foretaste of life for Harry when William is on the throne."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869735/prince-harry-california-royal-family-uk",
        "title": "<b>Prince Harry</b> &#39;very bored&#39; in California and &#39;misses being a working royal&#39; in the UK",
        "description": "<b>Prince Harry</b> is reportedly feeling &quot;very bored&quot; in California and is considering a temporary move back to the UK, according to a royal expert. Author Tom Quinn told The Mirror that the Duke of Sussex misses his duties as a working Royal and believes he can ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13114077/meghan-markle-video-tribute-friend-oli-jute-opens-wing-animal-charity.html",
        "title": "Meghan back on duty in London (by video link): Duchess pops up for surprise engagement to open new wing of animal charity in honour of her late friend - just days after <b>Prince</b> ...",
        "description": "The remote charity appearance comes days after <b>Prince Harry</b> was reported to have expressed an interest in returning to the royal fold in order to help his father, King Charles III, while the monarch is treated for cancer. Buckingham Palace announced that ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-22/could-prince-harry-be-making-a-return-to-royal-duties",
        "title": "The Royal Rota: Could <b>Prince Harry</b> be making a return to royal duties?",
        "description": "This week, Chris and Lizzie discuss Prime Minister Rishi Sunak and King Charles&#39; first in person audience along with <b>Prince Harry</b>&#39;s response to his father&#39;s cancer diagnosis and whether he could be making a comeback to royal duties. New episodes of The ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-getting-very-bored-32188589",
        "title": "<b>Prince Harry</b> is getting &#39;very bored&#39; in California as he &#39;eyes temporary move to the UK&#39;",
        "description": "Prince Harry misses being a working royal as that&#39;s &#39;the only thing he is trained to do&#39; says royal expert and author Tom Quinn, adding the Duke of Sussex is &#39;bored&#39; in California"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/513599/prince-harry-meghan-markle-support-cyberbullying-detection-app-young-entrepreneur/",
        "title": "Exclusive: Young entrepreneur invents anti cyberbullying app backed by <b>Prince Harry</b> and Meghan",
        "description": "Innovator, social entrepreneur and global advocate Trisha is the creator of the award-winning Rethink technology, an app which detects and stops cyberbullying at its source, by suggesting a user pauses and rethinks their online language and behaviour. It’s now in use in 136 nations."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869577/prince-harry-meghan-markle-solo-projects",
        "title": "<b>Prince Harry</b> and Meghan are right to go it alone - they can&#39;t always be joined at the hip",
        "description": "The Duke and Duchess of Sussex have seemingly taken separate routes when it comes to their work, with Meghan Markle set to release a new podcast series with Lemonada Media and <b>Prince Harry</b> primarily focused on the Invictus Games. With Sussex fans ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/18-little-known-facts-voldemort-185030473.html",
        "title": "18 little-known facts about Voldemort even die-hard &#39;<b>Harry</b> Potter&#39; fans may have missed",
        "description": "Tom Riddle&#39;s evil nature was apparent from a young age. In &quot;<b>Harry</b> Potter and the Half-Blood <b>Prince</b>,&quot; we learn through Dumbledore&#39;s memory in the Pensieve that Tom was testing out spells on unsuspecting children at the orphanage where he was raised."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26111459/kate-middleton-old-friends-surgery-hamper-spa-royal/",
        "title": "Kate Middleton’s friends keeping her in good spirits after surgery with luxury spa products &amp; food hampers, says expert",
        "description": "KATE Middleton is recovering from her surgery, and has been treated to some “fabulous” gifts and “delicious” hampers from doting friends, according to a royal expert.  The Princess of Wales, 42,"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/oldest-royal-family-member-led-180502479.html",
        "title": "Oldest Royal Family Member (Who Led Hidden Double Life!) Turns 91 and Makes Rare Statement",
        "description": "Pool/Max Mumby/Getty Katharine, Duchess of Kent attends the wedding of <b>Prince Harry</b> and Meghan Markle at St George&#39;s Chapel, Windsor Castle on May 19, 2018. Related: King Charles Says He Has Been &#39;Reduced to Tears&#39; Over Response to His Cancer Diagnosis in ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513978/meghan-markle-ultra-rare-photo-when-princess-lilibet-age/",
        "title": "Meghan Markle pictured in ultra-rare photo from when she was Princess Lilibet&#39;s age",
        "description": "A new never-before-seen photograph of Meghan Markle has been released – and she looks very angelic. The precious childhood picture appears to have been taken when she was her daughter Princess Lilibet &#39;s age. In the image, the Duchess of Sussex is dressed in a pretty white outfit and matching sandals whilst posing in a garden next to a swing."
    },
    {
        "url": "https://uk.movies.yahoo.com/7-bedroom-barbados-vacation-villa-180000017.html",
        "title": "This 7-Bedroom Barbados Vacation Villa Comes With a Butler and Its Own Tennis Court",
        "description": "Bono, <b>Prince Harry</b> . . . and you. That’s the pitch from Sandy Lane Estate on Barbados’s west coast, where those boldface names have all checked-in. Now, the community is showing off a fresh piece of celeb candy: what’s likely the island’s most ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-eyeing-six-months-32184541",
        "title": "<b>Prince Harry</b> &#39;eyeing six months in UK for new Royal role - but Meghan won&#39;t allow it&#39;",
        "description": "<b>Prince Harry</b> considered spending time in the UK as a part-time royal to help his ailing father but he will not move back without his wife, Meghan Markle, a royal expert has said. ‌&quot;<b>Harry</b> knows he will never be allowed to be a permanent part-time working ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/defiant-prince-harry-meghan-markle-9117408",
        "title": "&#39;Defiant&#39; <b>Prince Harry</b> and Meghan Markle answer split rumours with three signals",
        "description": "Meghan Markle and Prince Harry have shared a never-before-seen photo from their trip to Canada, which one expert believes puts split rumours to bed"
    },
    {
        "url": "https://www.thesun.co.uk/royals/26105608/prince-william-blotted-harry-out-mind-royal-expert/",
        "title": "<b>Prince</b> William ‘has blotted <b>Harry</b> out of his mind’ &amp; ‘no longer regards him as a person in his life’, royal pro claims",
        "description": "<b>PRINCE</b> William has “blotted <b>Harry</b> out of his mind” and “no longer regards him as a person in his life”, claims former BBC’s royal correspondent Jennie Bond. The Duke of Sussex is reportedly ready to help the royals as the King battles cancer ..."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/why-king-charles-reduced-tears-175733245.html",
        "title": "Why King Charles has been &#39;reduced to tears&#39; following cancer diagnosis",
        "description": "&quot;Throughout this period, His Majesty will continue to undertake State business and official paperwork as usual.&quot; <b>Prince Harry</b> says he&#39;s &#39;grateful&#39; he visited King Charles III amid cancer diagnosis The British royal family released a statement earlier this ..."
    },
    {
        "url": "https://www.vogue.co.uk/article/prince-harry-meghan-markle-podcast-netflix-king-charles",
        "title": "Are We Entering A New Era Of <b>Prince Harry</b> And Meghan Markle?",
        "description": "Last week, <b>Prince Harry</b> and Meghan Markle went to Canada. Technically, you can’t describe it as a royal visit – after all, the couple sensationally quit the British monarchy in 2020 and burned their proverbial London bridge along with it. In March 2021 ..."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-outraged-queen-camilla-9117281",
        "title": "<b>Prince Harry</b> &#39;outraged&#39; Queen Camilla during visit to King Charles and was told &#39;he&#39;s not wanted back&#39;",
        "description": "<b>Prince Harry</b>&#39;s behaviour during a 30-minute visit to his father, King Charles, left Queen Camilla &quot;outraged&quot;, according to an insider. The Duke of Sussex flew from California to the UK the day after his father&#39;s cancer diagnosis was publicly confirmed."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-hold-32185918",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;hold talks&#39; over next steps if royal reconciliation fails",
        "description": "<b>Prince Harry</b> and Meghan Markle have reportedly been in &#39;talks&#39; to discuss an action plan moving forward if their efforts to fix the ongoing feud with the royals falls through. It comes following reports in the Mirror that the Duke of Sussex, who stepped down as a working royal with Meghan in 2020, has been left on standby to return to the UK and undertake duties if his family needs him amid ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/harry-outraged-camilla-during-visit-32188004",
        "title": "<b>Harry</b> &#39;outraged&#39; Camilla during visit to King Charles and told &#39;he&#39;s not wanted back&#39;",
        "description": "<b>Prince Harry</b> reportedly upset Queen Camilla during a 30-minute visit to his father, King Charles.A source claims that the Duke of Sussex&#39;s behaviour left Camilla &quot;outraged&quot;. <b>Harry</b> flew from California to the UK shortly after his father&#39;s cancer diagnosis was made public."
    },
    {
        "url": "https://www.thesun.ie/tvandshowbiz/12265414/mel-c-truth-spice-girls-reunion/",
        "title": "Mel C reveals the truth about Spice Girls reunion plans after Mel B teased ‘imminent announcement’",
        "description": "according to Sporty Spice Melanie CCredit: PA:Press Association I can’t say I’m completely surprised, especially after Scary insisted the band were all invited to <b>Prince Harry</b>’s wedding . . . which also never happened. Sporty said ..."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/michelin-star-chef-flies-australia-taylor-swift-clare-smyth-b1140831.html",
        "title": "Michelin star chef flies to Australia in case Taylor Swift eats at her restaurant",
        "description": "She was appointed Member of the Order of the British Empire (MBE) for services to the hospitality industry in 2013 and is a personal favourite of <b>Prince Harry</b> and Meghan Markle, having catered their wedding reception in 2018. Swift’s Australian ..."
    },
    {
        "url": "https://www.tatler.com/article/charles-iii-cancer-diagnosis",
        "title": "The King has been frequently ‘reduced to tears’ by the public messages of support he has received",
        "description": "Nonetheless, the royal family have shown a real aptitude for pulling together at such a trying time – with <b>Prince Harry</b> even returning to the fore to show his support – and have witnessed an outpouring of support from the public. The Princess of Wales ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/21/prince-william-royal-gaza-war-palestine-antisemitism/?utmsource=email",
        "title": "Terrible blunder or inspired intervention? How <b>Prince</b> William waded into politics",
        "description": "Less controversially perhaps, he and Kate spearheaded the Heads Together mental health campaign in 2016, along with <b>Prince Harry</b>. While none of these issues are directly party political, they are not entirely devoid of political context. The <b>Prince</b> of ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/royal-expert-claims-prince-harrys-28679884",
        "title": "Royal expert claims <b>Prince Harry</b>&#39;s offer to help King Charles was &#39;not serious&#39; for this reason",
        "description": "<b>Prince Harry</b> was &#39;visibly shocked and upset&#39; when he found out his father had cancer and immediately offered to help, but he knew his offer would be turned down, a Royal expert claims A Royal expert has claimed that <b>Prince Harry</b>&#39;s offer to temporarily step ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-william-says-too-many-have-been-killed-israel-gaza-conflict-1723566",
        "title": "<b>Prince</b> William Says &#39;Too Many Have Been Killed&#39; In Israel Gaza Conflict",
        "description": "<b>Prince</b> William said that the human cost of the conflict in Gaza has him &quot;deeply moved as a father&quot;. Photo: Reuters / PHIL NOBLE Reuters While delivering a statement at the British Red Cross in London, <b>Prince</b> William urged world leaders to recognise the ..."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-william-is-blocking-harrys-potential-return-to-royal-fold-to-protect-kate-middleton-expert/news-story/219498427ded9631035605683bcc6ae4",
        "title": "<b>Prince</b> William is blocking <b>Harry</b>’s potential return to royal fold ‘to protect’ Kate Middleton: expert",
        "description": "“There’s one huge obstacle in <b>Harry</b>’s way, and that’s <b>Prince</b> William,” royal expert Kinsey Schofield also told the outlet. “<b>Harry</b> will not be allowed to return in any capacity if <b>Prince</b> William has any influence over the situation.”"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/royal-news-roundup-prince-williamss-203239287.html",
        "title": "Royal News Roundup: <b>Prince</b> Williams&#39;s Viral Backstage Moment, <b>Prince Harry</b>&#39;s Surprise Interview &amp; More",
        "description": "Her Royal Highness met with volunteers and supporters during her visit. View this post on Instagram A post shared by Good Morning America (@goodmorningamerica) <b>Prince Harry</b> did an exclusive interview with Good Morning America and discussed his reaction to ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1160525-prince-harry-energised-after-reconnecting-with-his-people-super-genuine",
        "title": "<b>Prince Harry</b> energised after reconnecting with his people: &#39;super genuine’",
        "description": "<b>Prince Harry</b> experienced a sense of recharge at the Invictus Games after spending a week among his community, it has been claimed. Invictus Games participant Mike Bourgeois stated that the Duke of Sussex is dedicated to connecting with the athletes."
    },
    {
        "url": "https://nypost.com/2024/02/22/entertainment/very-bored-prince-harry-misses-being-a-working-royal-author/",
        "title": "‘Very bored’ <b>Prince Harry</b> ‘misses being a working royal’: author",
        "description": "Goodbye California — hello again, England? <b>Prince Harry</b> is reportedly getting restless over his life in Montecito, Calif., with his wife, Meghan Markle, and their two children, <b>Prince</b> Archie and Princess Lilibet. The Duke of Sussex, 39, and his family ..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meghan-markle-stunned-green-off-183100500.html",
        "title": "Meghan Markle Stunned In A Green Off-the-Shoulder Gown At The 2024 Invictus Gala",
        "description": "Last week, Meghan Markle bundled up during her visit to Vancouver with <b>Prince Harry</b> for the 2025 Invictus Games’ “One Year to Go” event. On the same trip, the Duchess of Sussex gave fans a closer look at her gala style. For the event, which she ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869711/prince-archie-princess-lilibet-keep-titles-removed-prince-harry",
        "title": "<b>Prince</b> Archie and Princess Lilibet &#39;could still retain titles&#39; if <b>Prince Harry</b> gave his up",
        "description": "EXCLUSIVE: Prince Archie Harrison and PrincessLilibet Diana became entitled to use the royal titles once their grandfather King Charles ascended to the throne in September 2022."
    },
    {
        "url": "https://www.owensoundsuntimes.com/news/harry-leslies-daring-goderich-tightrope-walk",
        "title": "<b>Harry</b> Leslie&#39;s daring Goderich tightrope walk",
        "description": "Harry Leslie’s death-defying tightrope walk across the Niagara’s Whirlpool Rapids on June 15, 1865 — and again on July 4 — made headlines around the world. Capitalizing on his newfound fame, Leslie, “the American Blondin,"
    },
    {
        "url": "https://pagesix.com/style/best-wedding-guest-dresses-inspired-by-celebrities/",
        "title": "The best wedding guest dresses, inspired by celebrities",
        "description": "“Although dresses with cutouts are fashionable and on-trend, guests attending white-tie, black-tie or formal weddings should skip this trend and save it for a more casual event,” she says, suggesting sporting the styles at a bachelorette trip or afterparty instead."
    },
    {
        "url": "https://www.usatoday.com/story/entertainment/celebrities/2024/02/22/king-charles-cancer-diagnosis-tears/72699060007/",
        "title": "Why King Charles has been &#39;reduced to tears&#39; following cancer diagnosis",
        "description": "King Charles has been overcome with emotion from the &quot;wonderful messages and cards&quot; after his cancer diagnosis."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-very-bored-california-32190122",
        "title": "<b>Prince Harry</b> &#39;very bored&#39; in California with Meghan as he &#39;eyes temporary move to the UK&#39;",
        "description": "The Duke of Sussex is said to have reached out to help his family after the King&#39;s cancer diagnosis but any possibility of him returning to the Firm has been ruled out according to sources."
    },
    {
        "url": "https://www.usatoday.com/story/entertainment/2024/02/22/taylor-swift-private-jet-celebs-sued-over-privacy/72684220007/",
        "title": "Amid Taylor Swift&#39;s jet-tracking legal drama, which other celebs have privacy lawsuits?",
        "description": "Here&#39;s a non-comprehensive list, from most to least recent cases. Last year, <b>Prince Harry</b> launched a series of lawsuits against British tabloid publishers for allegedly invading his privacy, including hacking his phone and accessing his voice mail messages."
    },
    {
        "url": "https://globalnews.ca/news/10310499/king-charles-reduced-to-tears-cancer-diagnosis/",
        "title": "King Charles ‘reduced to tears’ over well wishes following cancer diagnosis",
        "description": "2:36 <b>Prince Harry</b> breaks silence on visit with King Charles and Royal family reunion <b>Prince Harry</b> breaks silence on visit with King Charles and Royal family reunion While he’s appeared in public a few times since, attending church services at Sandringham ..."
    },
    {
        "url": "https://ca.finance.yahoo.com/news/prince-william-build-24-homes-163227649.html",
        "title": "<b>Prince</b> William to Build 24 Homes for the Unhoused on His Cornwall Estate",
        "description": "and unrepeated,” <b>Prince</b> William said back in June of 2023. See the video. The late Princess Diana, known for her empathy to the plight of the unhoused, took William and his brother <b>Harry</b>, Duke of Sussex, to visit homeless shelters when they were children ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/entertainment/news/michelin-star-ni-chef-clare-smyth-reportedly-flown-to-australia-to-cook-for-taylor-swift/a1876894854.html",
        "title": "Michelin-star NI chef Clare Smyth reportedly flown to Australia to cook for Taylor Swift",
        "description": "Michelin-star chef Clare Smyth has reportedly been flown 21 hours to Sydney, Australia, to cook for US pop sensation Taylor Swift."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/entertainment/news/michelin-star-ni-chef-clare-smyth-flown-to-australia-to-cook-for-taylor-swift/a1876894854.html",
        "title": "Michelin-star NI chef Clare Smyth ‘flown to Australia to cook for Taylor Swift’",
        "description": "Michelin-star chef Clare Smyth was flown to Sydney in case she was needed to cook for US pop sensation Taylor Swift, according to reports."
    },
    {
        "url": "https://www.glamourmagazine.co.uk/article/meghan-markle-low-effort-updo-canada-trip",
        "title": "Meghan Markle nailed the low-effort updo in a brand-new pic from her Canada trip",
        "description": "Prince Harry and Meghan Markle arrived in British Columbia for the start of Invictus Games season in the middle of February. The Duchess of Sussex wasted no time in showing off her impeccable cold-weather style, as well as her commitment to skinny jeans – no matter what the Zoomers on TikTok have to say. Queen behaviour, obviously."
    },
    {
        "url": "https://uk.news.yahoo.com/michelin-star-chef-flies-australia-110907959.html",
        "title": "Michelin star chef flies to Australia in case Taylor Swift eats at her restaurant",
        "description": "The chef who catered for <b>Prince Harry</b> and Meghan Markle’s wedding has reportedly flown to Australia in case Taylor Swift decides to eat at her restaurant. Clare Smyth, who lives in Wandsworth, has jetted to Sydney where the megastar is staying during her ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1160342-prince-harry-set-on-years-long-path-of-reconciliation-with-royal-family",
        "title": "<b>Prince Harry</b> set on ‘years-long’ path of reconciliation with royal family",
        "description": "<b>Prince Harry</b> proved with his actions in the past few weeks that he is open to reconciliation with the royal family. However, royal expert Jack Royston believes the path to achieving benevolence ought to long and difficult due to the years that followed ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/164238/20240223/queen-camilla-outraged-over-prince-harrys-unscheduled-visit.htm",
        "title": "Queen Camilla &#39;Outraged&#39; Over <b>Prince Harry</b>&#39;s Unscheduled Visit",
        "description": "<b>Prince Harry</b>&#39;s unexpected visit to Clarence House following King Charles&#39; cancer diagnosis has reportedly left Queen Camilla &quot;outraged.&quot; According to sources, the Duke of Sussex&#39;s unannounced arrival and demeanor during the visit did not sit well with his ..."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-shuts-down-rumors-of-royal-family-return-quick-sentence.html/",
        "title": "<b>Prince Harry</b> Shuts Down Rumors of a Royal Family Return in 1 Quick Sentence",
        "description": "<b>Prince Harry</b> has not been a working part of the royal family since early 2020, when he and Meghan Markle left their royal duties to live a more normal life in the United States. Since then, tensions have been high between <b>Harry</b> and his relatives ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/king-charles-makes-big-decision-28682342",
        "title": "King Charles &#39;makes big decision&#39; about <b>Prince Harry</b> after &#39;half-hour meeting&#39;",
        "description": "King Charles has reportedly made a decision about his son <b>Prince Harry</b> after the pair saw each other for a short time following the monarch&#39;s cancer diagnosis. King Charles has reportedly made a &#39;final decision&#39; on whether <b>Prince Harry</b> can return to the ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/king-charles-huge-change-for-prince-george-charlotte-and-louis/",
        "title": "King Charles&#39;s huge change for <b>Prince</b> George, Princess Charlotte and <b>Prince</b> Louis as he switches focus",
        "description": "King Charles&#39;s huge change for <b>Prince</b> George, Princess Charlotte and <b>Prince</b> Louis could be seen as a sign of his focus changing in recent years, a royal expert says. The start of 2024 has been a challenging time for the Royal Family as Buckingham Palace ..."
    },
    {
        "url": "https://twinfinite.net/features/all-mainline-harry-potter-games-ranked/",
        "title": "All Mainline <b>Harry</b> Potter Games, Ranked from Mudblood to the Chosen One",
        "description": "After the relative disappointment of the Order of the Phoenix game, <b>Harry</b> Potter and the Half-Blood <b>Prince</b> was a surprisingly good time. After a while of playing it, there came a point where it felt a bit repetitive, between the dueling and minigames ..."
    },
    {
        "url": "https://www.tatler.com/article/an-enemy-of-the-people-review-matt-smith-ibsen-classic",
        "title": "An Enemy of the People review: Matt Smith shines in timely retelling of Ibsen classic",
        "description": "But how is she passing her time? Return of the son? <b>Prince Harry</b> gives friendly signals as he suggests he is likely to be spending more time in UK In an interview with Good Morning America, <b>Prince Harry</b> expressed that he loved his family and said he was ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/michael-jacksons-son-prince-jackson-232000980.html",
        "title": "Michael Jackson&#39;s Son <b>Prince</b> Jackson Wishes Brother Bigi a Happy Birthday: &#39;Bro Is Killing It&#39;",
        "description": "The late music legend&#39;s youngest son Bigi Jackson celebrated his 22nd birthday on Wednesday Getty (2) Bigi Jackson; <b>Prince</b> Jackson <b>Prince</b> Jackson is wishing his younger brother Bigi a happy birthday. As Michael Jackson’s youngest son Bigi (formerly ..."
    },
    {
        "url": "https://uk.style.yahoo.com/her-podcasting-deal-meghan-markle-181914138.html",
        "title": "In Her New Podcasting Deal, Meghan Markle “Will Likely Get Way More Attention and Will Have More Control” Than She Ever Did at Spotify",
        "description": "Meghan Markle is primed for a busy 2024, and one project that has been confirmed is her new podcast deal—this time with Lemonada Media after Meghan and husband <b>Prince Harry</b>’s deal with Spotify fell through last summer. Spotify and the Sussexes severed ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/kate-middleton-inner-circle-royal-32145256?int_source=nba",
        "title": "Kate Middleton’s inner circle overseeing recovery - school friends, ski pals, trusted staff, ‘worried’ mum - OK! Magazine",
        "description": "including Pippa and James Matthews’ nuptials in 2017 and <b>Prince Harry</b> and Meghan‘s the following year. As well as joining the family on skiing holidays, Sophie has been amongst those to walk with the royal couple towards the Church of St Mary Magdalene ..."
    }
]