[
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-return-royal-role-support-king-charles/",
        "title": "<b>Prince Harry</b> &#39;willing to return to royal role&#39; to support King Charles and help heal family rift",
        "description": "<b>Harry</b> and Charles are said to have had several &quot;warm exchanges&quot; since the King announced his cancer diagnosis. And now the <b>prince</b> has told friends that he would step into a temporary royal role while his father receives treatment, according to the Times."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-return-royal-role-32147311",
        "title": "<b>Prince Harry</b> may &#39;return to royal role to help King&#39; and &#39;heal rift&#39;",
        "description": "Prince Harry could be temporarily stepping back into his royal duties within Buckingham Palace once again, while his father, King Charles, battles with cancer and focuses on health"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harrys-heartfelt-speech-full-gushes-32147238",
        "title": "<b>Harry</b>&#39;s heartfelt speech in full as he gushes &#39;this is why we do what we do&#39; after emotional trip",
        "description": "Prince Harry made a touching speech as he and Meghan Markle marked the end of their three day trip in Vancouver to celebrate the One Year to Go activities for the Invictus Games in 2025"
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/harry-charles-king-the-times-duke-of-sussex-b1139754.html",
        "title": "Duke of Sussex ‘willing to take temporary royal role’ while King is ill: report",
        "description": "The Duke of Sussex is willing to step into a temporary royal role while his father undergoes cancer treatment, it has been reported. The Times newspaper reports Harry has told friends he would step into such a role while Charles is unwell."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25999375/arthur-edwards-prince-harry-us-citizenship/",
        "title": "<b>Prince Harry</b> becoming US citizen would be final two-fingered gesture to the King and to country he professes to love",
        "description": "PRINCE Harry says, “I love my family” in yet another American TV interview. Pity he didn’t think like that when he trashed them during his chat with Oprah and in his book, Spare. Now Harry is"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-plans-come-together-32146917",
        "title": "<b>Prince Harry</b> plans to &#39;come together&#39; with Royal Family after hitting back at &#39;make or break&#39; claim",
        "description": "King Charles&#39; cancer diagnosis may just bring together the family as Harry considers fixing the rift between them. He may step up and take on royal duties to support his dad"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13093799/meghan-markle-canada-ice-rink-prince-harry-wheelchair-curling-game.html",
        "title": "Meghan Markle makes a very elegant appearance at Canada ice rink in $1,295 cape coat and $1,195 riding boots as she cheers on <b>Prince Harry</b> in wheelchair curling game",
        "description": "The 42-year-old Duchess of Sussex was the epitome of &#39;quiet luxury&#39; in her ensemble, which featured a $1,295 camel-colored cape coat from female-owned Canadian outerwear brand Sentaler."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25998510/prince-harry-working-royal-king-charles-cancer/",
        "title": "<b>Prince Harry</b> ‘is willing to be a working royal again’ to help support King Charles during cancer treatment, insiders say",
        "description": "PRINCE Harry is willing to be a working royal again to help support his father through his illness, insiders claim. The Duke of Sussex, 39, today opened up about King Charles’ cancer, and"
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-willing-to-return-to-a-temporary-royal-role-to-support-king-2911539",
        "title": "<b>Prince Harry</b> ‘willing to return to a temporary royal role to support King’",
        "description": "Prince Harry is understood to have told his friends that he would step into a royal role while his father is unwell"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-merrell-moab-boots_l_65cfbff0e4b04daca696ec4f",
        "title": "<b>Prince Harry</b>&#39;s Durable Winter Boots Are Beloved By HuffPost Readers",
        "description": "Prince Harry recently stepped out of hibernation alongside his wife Meghan Markle to attend training camp for the Invictus Games Vancouver Whistler 2025."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867735/meghan-markle-bobsledding-prince-harry",
        "title": "Meghan Markle&#39;s firm two-word reply when asked if she&#39;d join <b>Harry</b> skeleton bobsledding",
        "description": "Prince Harry took on the skeleton track to try bobsledding, but Meghan Markle had other thoughts when asked to participate."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13093613/King-Charles-sleeps-OXYGEN-TENT-combat-sinus-issues-struggles-short-term-memory-royal-biographer-claims.html",
        "title": "King Charles sleeps in an OXYGEN TENT to combat sinus issues and struggles with short-term memory, royal biographer claims",
        "description": "King Charles has an &#39;appalling memory&#39; and sleeps in an oxygen tent to combat sinus problems, new royal biography, My Mother and I, by Ingrid Seward claims."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/king-charles-prince-harry_uk_65cfd1c7e4b043f1c0ab3108",
        "title": "<b>Prince Harry</b> Says He Jumped On A Plane To London After Learning Of King Charles&#39;s Cancer",
        "description": "The Duke of Sussex says he immediately arranged to go to the UK after his father called to tell him he had cancer."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867726/prince-harry-wheelchair-curling-meghan-markle-michael-buble-canada",
        "title": "<b>Prince Harry</b> tries out wheelchair curling alongside Meghan Markle and Michael Buble",
        "description": "Prince Harry has been pictured trying wheelchair curling alongside Meghan Markle and Michael Buble at events tied to the 2025 Invictus Games."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/18/",
        "title": "<b>Prince Harry</b> breaks silence on King Charles’ cancer battle – latest news",
        "description": "PRINCE Harry has broken his silence on the King’s cancer diagnosis in a bombshell TV interview today. The Duke and Duchess of Sussex are in Canada, marking one year to go until the 2025"
    },
    {
        "url": "https://www.thetimes.co.uk/article/27b9f1d4-0d7f-48cc-bc43-a86a0cdc17e9?shareToken=55e1ac82ba3823de94710aa7d5171388",
        "title": "Revealed: <b>Prince Harry</b> ‘seeks royal return to heal rift with King Charles’",
        "description": "The Duke of Sussex is willing to return to a temporary royal role in support of his father during his illness, sources have revealed. In an attempt to help heal the rift in the family, the King and Prince Harry are said to have had several “warm ­exchanges” since Charles ­received his cancer diagnosis."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-spare-book-king-charles-royal-family-rift-jgrw0q3jk",
        "title": "<b>Prince Harry</b> faces his hardest battle yet — winning over William",
        "description": "Speaking about the wounded veterans taking part in the Invictus Games, Prince Harry said: “Everyone pays a lot of attention, rightly so, to the person who has been injured … but actually the whole family gets injured because their lives are changed and turned upside down for ever."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-reveals-further-plans-32146051",
        "title": "<b>Prince Harry</b> reveals further plans to return to UK and visit King and Royal Family",
        "description": "Prince Harry has spoken out about his father&#39;s cancer diagnosis for the first time in a rare televised interview, where he even spoke up over &quot;other trips&quot; to the UK in the future"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-speaks-publicly-king-221750726.html",
        "title": "<b>Prince Harry</b> Speaks Publicly About King Charles&#39; Cancer Diagnosis For The First Time",
        "description": "<b>Prince Harry</b> is sharing details about his reunion with his father, King Charles III, last week in the wake of the monarch’s recent cancer diagnosis. In a “Good Morning America” interview that aired Friday, the Duke of Sussex steered clear of any ..."
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-interview-royal-family-trust-2910440",
        "title": "<b>Prince Harry</b>’s awkward interview shows exactly why the Royal Family don’t trust him",
        "description": "Thus Harry’s awkward interview on ABC’s Good Morning America. You could see that Harry desperately wanted to talk about his genuine attachment to the Army and the “annual fix” he gets from the Invictus Games. But he knows he has to deliver raw meat to the media and so talk about his ill father, however awkward it might be."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-not-204426066.html",
        "title": "Meghan Markle and <b>Prince Harry</b> &quot;Will Not Be Broken&quot; Over Recent Backlash",
        "description": "<b>Prince Harry</b> and Meghan Markle are used to the haters, so a little criticism over their recent rebrand isn&#39;t going to tear them down. Earlier this week, the couple revealed their new website sussex.com, which was met with some backlash as naysayers accused ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/prince-harry-suggests-kings-illness-28648241",
        "title": "<b>Prince Harry</b> suggests King&#39;s illness could lead to reconciliation as he talks about US citizenship",
        "description": "The Duke of Sussex has spoken about his father&#39;s cancer diagnosis and his relationship with the Royal family in a new interview on US TV"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-tries-curling-invictus-201706561.html",
        "title": "<b>Prince Harry</b> Tries Curling at Invictus Games Countdown with a Special Guest...Michael Bublé!",
        "description": "Meghan Markle clapped from the sidelines as her husband got into the zone during wheelchair curling Shutterstock <b>Prince Harry</b>, Michael Buble and Meghan Markle in Canada on Feb. 16, 2024 Meghan Markle and <b>Prince Harry</b> are hitting the ice for a brand-new ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/major-incident-ferry-port-people-found-in-back-a-freezer-lorry-20294119/?ico=trending-module_author_tom-sanders_item-0",
        "title": "Major incident at ferry port after people found in the back of a freezer lorry",
        "description": "Police officer on way to fatal crash told his wife was one of the victims <b>Prince Harry</b> says Charles&#39;s diagnosis will help &#39;reunify&#39; the family Woman who erected 4ft greasy barricade to stop walkers loses legal fight Madeleine McCann prime suspect&#39;s trial ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-opens-home-life-133121441.html",
        "title": "<b>Prince Harry</b> Opens Up About Home Life with <b>Prince</b> Archie and Princess Lilibet: ‘They Make Us Laugh’",
        "description": "The Duke of Sussex, who is in Canada for the Invictus Games Vancouver Whistler 2025&#39;s One Year to Go celebrations alongside wife Meghan Markle, 42, opened up to Good Morning America on Friday about life in California with the couple&#39;s children, Prince Archie, 4, and Princess Lilibet, 2."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-tv-interview-good-morning-america-will-reeve-charles-meghan-b1139529.html?itm_source=Internal&itm_channel=section_trending_article_component&itm_campaign=trending_section&itm_content=4",
        "title": "<b>Prince Harry</b> admits he&#39;s considered seeking US citizenship but adds &#39;I love my family&#39;",
        "description": "Duke of Sussex is interviewed for the first time since Charles postponed all public-facing duties because of his cancer diagnosis"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-meghan-markle-children-b2497507.html",
        "title": "<b>Prince Harry</b> shares sweet update about his and Meghan’s children",
        "description": "Prince Harry has shared a sweet update about his and wife Meghan Markle ’s children, Archie, four, and Lilibet, two."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/will-prince-harrys-interview-tv-watch-uk-20292306/?ico=trending-module_tag_prince-charles_item-0",
        "title": "When will <b>Prince Harry</b>’s interview be on TV and how to watch in the UK?",
        "description": "<b>Prince Harry</b> is set to speak about his father King Charles’s cancer diagnosis in an interview with Good Morning America. The Duke of Sussex will open up to host Will Reeve about the King’s health due to air today. He will also discuss his life with ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/prince-harry-us-citizen-meghan-b2497468.html",
        "title": "<b>Prince Harry</b> says he is considering becoming an American citizen as life in US is ‘amazing’",
        "description": "Prince Harry has revealed that he has considered becoming a US citizen and that his life in America is “amazing”. The Duke of Sussex addressed the subject in an interview with Good Morning America released on Friday."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-speaks-king-charles-145449669.html",
        "title": "<b>Prince Harry</b> Speaks Out About King Charles&#39; Cancer Diagnosis: &quot;I Jumped On a Plane&quot;",
        "description": "After Buckingham Palace confirmed earlier this month that King Charles has a form of cancer, <b>Prince Harry</b> is speaking out about his father&#39;s diagnosis. <b>Harry</b>, who stepped down as a working member of the British royal family in 2020, told ABC News that he ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513656/i-joined-prince-harry-and-meghan-markle-for-day-three-in-vancouver-the-surprise-of-my-life/",
        "title": "I joined <b>Prince Harry</b> and Meghan Markle for day three in Vancouver - and got the surprise of my life",
        "description": "Day three of my time in Canada for the Invictus Games&#39; One Year to Go event – and are <b>Prince Harry</b> and I best friends now? Two days in a row now the Duke has been happy to answer questions I&#39;ve thrown his way, from the skeleton run experience to his ..."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/513629/meghan-markle-wears-sentaler-camel-coat-canada/",
        "title": "Meghan Markle adds stunning camel coat to her flawless It-girl winter wardrobe",
        "description": "Meghan Markle stepped out for the third day of engagements as she visited a local curling rink in Vancouver for the Invictus Games countdown alongside her husband <b>Prince Harry</b>. The Duchess of Sussex, 42, looked so stylish on Friday as she was spotted in a ..."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/us-news/prince-harry-finally-reveals-how-he-found-out-about-king-charles-cancer-any-sickness-brings-101708127872358.html",
        "title": "<b>Prince Harry</b> finally reveals how he found out about King Charles’ cancer: ‘Any sickness brings..’",
        "description": "Prince Harry on King Charles&#39; cancer in new interview: ‘Could help…’ &quot;During an interview on Friday at the Invictus Games One Year to Go event in Whistler, Canada, Good Morning America correspondent Will Reeve inquired of the Duke of Sussex,"
    },
    {
        "url": "https://www.spokesman.com/stories/2024/feb/16/prince-harry-says-yeah-he-has-considered-becoming-/",
        "title": "<b>Prince Harry</b> says, yeah, he has considered becoming a U.S. citizen, maybe",
        "description": "Prince Harry says, yeah, well, maybe he has considered becoming an American citizen someday. That would be big. He’s fifth in line to the throne in Britain. But hit pause."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513646/prince-harry-meghan-markle-canada-day-three-best-photos/",
        "title": "<b>Prince Harry</b> and Meghan Markle joined by Michael Buble on final day of Canada trip - best photos",
        "description": "And they weren&#39;t the only VIPs in attendance, as Canadian singer, Michael Buble, and his wife, Luisana Lopilato, joined them on the ice! Prince Harry and Meghan travelled north of Montecito to meet Invictus Games competitors at training camps in Whistler and Vancouver to mark the one-year countdown to the 2025 Winter Games."
    },
    {
        "url": "https://www.vogue.co.uk/article/why-prince-harry-and-meghan-markle-changed-their-childrens-last-names",
        "title": "Why <b>Prince Harry</b> And Meghan Markle Changed Their Children’s Last Names",
        "description": "When Prince Harry and Meghan Markle ’s first child, Archie, was born in May 2019, the couple announced their son’s full name was Archie Harrison Mountbatten-Windsor. However, in 2024, they’ve officially decided to use the last name of “Sussex” for both Archie and their daughter, Lilibet."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13093205/prince-harry-meghan-markle-king-charles-cancer-citizenship-interview.html",
        "title": "<b>Prince Harry</b>&#39;s most fashionable fan! Glamorous Meghan Markle cheers on her grinning husband as he competes against Michael Buble in wheelchair curling - hours after opening up ...",
        "description": "Prince Harry put the furor surrounding his latest television appearance on ice today - quite literally - when he tried his hand at yet another winter sport in Vancouver today: wheelchair curling."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/prince-harry-confirms-how-found-28650732",
        "title": "<b>Prince Harry</b> confirms how he found out about King Charles&#39; cancer",
        "description": "Prince Harry has today sat down with a Good Morning America presenter for a rare interview. Speaking in the televised chat, Prince Harry confirmed how he found out about Charles&#39; cancer"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867711/prince-harry-meghan-markle-royal-duties-King-Charles",
        "title": "<b>Prince Harry</b> and Meghan Markle ‘could return to royal duties’ as duke wants ‘to heal rift&#39;",
        "description": "A royal insider believes it &quot;makes perfect sense&quot; for the Royal Family to come together to support the King while he is sick."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/16/prince-harry-comments-scandalous-palace-whistler-invictus/",
        "title": "<b>Prince Harry</b>’s comments might not seem scandalous, but they are far from the party line",
        "description": "It could have been worse. Prince Harry “loves his family”, he told an American TV interviewer. He was “grateful” to see his unwell father, hopping on a plane to visit him after they spoke in person. He even, at the point of being asked about the King’s prognosis, declined to answer, saying: “That stays between me and him”."
    },
    {
        "url": "https://news.sky.com/story/prince-harrys-latest-interview-shows-he-may-be-seeking-reconciliation-with-royal-family-and-hints-at-more-uk-visits-13073231",
        "title": "<b>Prince Harry</b>&#39;s latest interview shows he may be seeking reconciliation with Royal Family and hints at more UK visits",
        "description": "The Duke of Sussex said he considered becoming a US citizen and that his father&#39;s cancer diagnosis could have a &quot;unifying effect&quot; on the family."
    },
    {
        "url": "https://www.racingpost.com/bloodstock/news/were-sending-the-best-to-the-best-and-hoping-for-the-best-chasemore-farm-coverings-revealed-a406L1d1ovsR/",
        "title": "&#39;We&#39;re sending the best to the best and hoping for the best&#39; - Chasemore Farm coverings revealed",
        "description": "<b>Harry</b> Angel appears to be a recurring theme in Chasemore matings and Darley&#39;s champion sprinter and Group 1 sire will receive several mares, headed by Matron Stakes winner and black-type producer Chachamaidee. The dam of Valiant <b>Prince</b> and Klassique joined ..."
    },
    {
        "url": "https://news.sky.com/video/prince-harry-breaks-silence-on-kings-cancer-diagnosis-13073279",
        "title": "<b>Prince Harry</b> breaks silence on King&#39;s cancer diagnosis",
        "description": "During the interview on US television, Harry said: &quot;Throughout all these families I see it on a day-to-day basis, the strength of the family unit coming together. I think any illness, any sickness brings families together."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-tries-wheelchair-curling-234400227.html",
        "title": "<b>Prince Harry</b> tries wheelchair curling ahead of Invictus Games&#39; first winter edition next year",
        "description": "Britain&#39;s Prince Harry tried wheelchair curling on Friday, one of the many winter adaptive sports that will be part of the 2025 Invictus Games, an international sporting event for wounded army veterans."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-interview-charles-meghan-b2497703.html",
        "title": "Five key talking points from <b>Prince Harry</b>’s Good Morning America interview",
        "description": "Here are some of the five biggest talking points from Harry’s interview. After the Duke and Duchess of Sussex stepped down from their responsibilities as senior royals in 2020, they officially relocated to the United States. Currently, they are living in Montecito, California, with their two children."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-king-charles-cancer-diagnosis-b2497594.html",
        "title": "<b>Prince Harry</b>: I love my family and my father’s cancer diagnosis could bring us together",
        "description": "King Charles’s cancer diagnosis could help to heal rifts and reunify the royal family, Prince Harry has said as he revealed that he was “grateful” to spend time with his father last week."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46818132/can-royal-family-members-have-dual-citizenship/",
        "title": "Can British Royal Family Members Have Dual Citizenship?",
        "description": "Now you’re probably curious about Meghan and Harry’s two children, who do possess both U.K. and U.S. citizenship. When Prince Archie and Princess Lilibet were born, they automatically became dual citizens, since both of their parents were citizens of their respective countries at the time of their birth."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/boy-16-stabbed-to-death-in-bristol-named-by-police/",
        "title": "Boy, 16, stabbed to death in Bristol named by police",
        "description": "A 16-year-old boy killed in a stabbing in Bristol has been named by police. Avon and Somerset Police say they believe the teenager who died on Wednesday was Darrien Williams. He was attacked in Rawnsley Park in the Easton area of the city by two people wearing masks who left the scene on bicycles."
    },
    {
        "url": "https://www.scotsman.com/news/world/king-charles-cancer-harry-duke-of-sussex-suggests-monarchs-illness-could-lead-to-reconciliation-4522241",
        "title": "King Charles cancer: <b>Harry</b>, Duke of Sussex, suggests monarch&#39;s illness could lead to reconciliation",
        "description": "The Duke of Sussex has suggested the King&#39;s illness could lead to a reconciliation with his father as he spoke about the monarch&#39;s cancer diagnosis. In an interview with a US breakfast show, Harry also said I &quot;love my family&quot; and that he was &quot;grateful&quot; to be able to spend time with his father last week."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-breaks-silence-king-221600073.html",
        "title": "<b>Prince Harry</b> breaks silence on King Charles’ cancer diagnosis during ‘GMA’ interview",
        "description": "Prince Harry and King Charles appear to have put some of their differences aside in the wake of the British monarch’s cancer diagnosis. The Duke of Sussex, 39, broke his silence on the matter for an interview with “Good Morning America” while he and wife Meghan Markle were attending a training camp for the 2025 Invictus Winter Games in Whistler,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markles-former-co-star-32145750",
        "title": "Meghan Markle&#39;s former co-star claimed there was a &#39;foul&#39; stench at Sussexes wedding",
        "description": "Rick Hoffman - who appeared alongside the Duchess of Sussex - said he smelled a foul odour whilst he was a guest at her and Prince Harry&#39;s wedding in May 2018."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-skeleton-sled_n_65cf55d3e4b0f7fbe7b258e5",
        "title": "<b>Prince Harry</b> Zooms Down Skeleton Sled Track: &#39;Everybody Should Do This&#39;",
        "description": "Harry hit high speeds as he and wife Meghan Markle visited the site of the 2025 Invictus Games in Whistler, British Columbia."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/16/prince-harry-hints-open-family-reconciliation-king-cancer-diagnosis?ref=upstract.com",
        "title": "<b>Prince Harry</b> hints he’s open to family reconciliation after king’s cancer diagnosis",
        "description": "Duke of Sussex, who flew to UK to see his father, says in US interview he was grateful for time with family"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/tiger-woods-brings-cashmere-golf-212121472.html",
        "title": "Tiger Woods Brings Cashmere to the Golf Course and New Looks From His Sun Day Red Clothing Brand at Genesis Invitational",
        "description": "Tiger Woods has transformed The Genesis Invitational tournament into a marketing moment for his new clothing and lifestyle brand, Sun Day Red. While playing the first rounds of the golf tournament at Riviera Country Club in Pacific Palisades, Calif., Woods was clad head-to-toe in pieces from his newest business venture."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13091725/Prince-Harry-interview-Good-Morning-America-King-Charles-Meghan-Markle.html",
        "title": "<b>Prince Harry</b> tells US TV show &#39;I love my family&#39; and he hopes King Charles&#39; cancer has a &#39;reunifying effect&#39; on them - as he reveals he is &#39;considering&#39; becoming an American ...",
        "description": "The Duke of Sussex discussed the King&#39;s health as he spoke publicly for the first time since Charles postponed all public-facing duties last week following the diagnosis."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/prince-harry-meghan-markle-surname-change",
        "title": "<b>Prince Harry</b> and Meghan Markle have changed their children&#39;s surnames",
        "description": "Yes, Prince Harry and Meghan Markle appear to have changed their children&#39;s surnames, with the miniature royals now listed on the site as &quot;Archie Sussex&quot; and &quot;Lilibet Sussex&quot;."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/amina-noor-woman-jailed-for-seven-years-for-handing-over-british-girl-in-kenya-for-female-genital-mutilation/",
        "title": "Amina Noor: Woman jailed for seven years for handing over British girl in Kenya for female genital mutilation",
        "description": "A woman has been jailed for seven years for helping a person to carry out female genital mutilation (FGM) on a three-year-old British girl during a trip to Kenya in 2006."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-archie-lilibet-humour-32143306",
        "title": "<b>Prince Harry</b> says Archie and Lilibet have &#39;incredible sense of humour&#39; in rare insight",
        "description": "Prince Harry has opened up about being a dad to his two children, Archie and Lilibet, and given a rare insight into his family life in California with wife Meghan Markle"
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-interview-royal-family-trust-2910440?ico=related_article_inline",
        "title": "<b>Prince Harry</b>’s awkward interview shows exactly why the Royal Family don’t trust him",
        "description": "Thus Harry’s awkward interview on ABC’s Good Morning America. You could see that Harry desperately wanted to talk about his genuine attachment to the Army and the “annual fix” he gets from the Invictus Games. But he knows he has to deliver raw meat to the media and so talk about his ill father, however awkward it might be."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/harrys-one-key-gesture-suggests-wants-unity-family-20295621/?ico=mosaic_tag",
        "title": "<b>Harry</b>’s one key gesture that suggests he wants ‘unity’ with his family",
        "description": "‘Harry’s one key gesture that he used emphatically here was a raising of both cupped hands to chest level and a “pushing” movement to suggest a strong desire for unity and the kind of protection a close family can provide,’ Judi said."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68314330",
        "title": "<b>Prince Harry</b>: King&#39;s cancer may bring family closer together",
        "description": "The Duke of Sussex is set to discuss his father the King&#39;s health in a television interview in the US. Prince Harry has been interviewed for the first time since Charles postponed all public-facing duties because of his cancer diagnosis. The interview is due to be broadcast on Good Morning America on Friday. It will air at noon GMT."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/16/prince-harry-malawi-elephant-relocation-project-dead-aoe?ref=upstract.com",
        "title": "Death toll rises to seven in Malawi elephant relocation project linked to <b>Prince Harry</b> NGO",
        "description": "The animal translocation scheme by wildlife NGOs including African Parks, once headed by the royal, has been dogged by controversy"
    },
    {
        "url": "https://www.tatler.com/article/prince-harry-gives-update-on-king-charles-iiis-heath-in-new-abc-interview",
        "title": "The Duke of Sussex gives update on King Charles III&#39;s heath in new ABC interview",
        "description": "The Duke of Sussex has given his first interview since the announcement of his father the King’s cancer diagnosis. Prince Harry went on ABC News’s Good Morning America to talk about his father’s health and the upcoming Invictus Games."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/g46804206/prince-harry-meghan-markle-photos-canada-invictus-countdown/",
        "title": "Every Photo From <b>Prince Harry</b> and Duchess Meghan’s Canada Trip",
        "description": "Harry and Meghan&#39;s Canada trip will last from February 14 to February 16, during which the couple will meet with various athletes, teams, and veterans. Bazaar rounded up all the best photos from their Canadian getaway. Scroll ahead to see every snap, and make sure to watch this space for updates."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-another-proud-wife-153938094.html",
        "title": "Meghan Markle Has Another Proud Wife Moment as She Films <b>Prince Harry</b>&#39;s Daredevil Skeleton Ride",
        "description": "In a video captured by Elizabeth Holmes and shared on Instagram, Meghan holds out her phone before covering her mouth, laughing and cheering as Harry approaches. The Duchess of Sussex, 42, flinches backward as her husband, 39, cruises by before making sure to film the end of his run."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/showbiz-news/prince-harry-says-loves-every-28647519",
        "title": "<b>Prince Harry</b> says he &#39;loves every single day&#39; in US and &#39;has considered citizenship&#39;",
        "description": "Prince Harry has confessed to &#39;loving every single day&#39; in the US as he opened up about his life with Meghan Markle, as well as his passion for supporting &#39;wounded warriors&#39;."
    },
    {
        "url": "https://www.dalesman.co.uk/incredible-things-yorkshire-has-given-the-world/",
        "title": "The Dalesman reveals 27 incredible things Yorkshire has given the world",
        "description": "‘The Rhubarb Triangle’ is a giant patch of Yorkshire land that has made West Yorkshire famous for its signifcant export of rhubarb. Once, it produced 90 per cent of the world’s forced rhubarb, and today it is home to some of the largest rhubarb producers in the UK."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/meghan-markle-prince-harry-break-9104356",
        "title": "Meghan Markle and <b>Prince Harry</b> break Royal tradition to give children new surname",
        "description": "Prince Harry and Meghan Markle have given their kids, Princess Lilibet and Prince Archie, a new surname as they break a 64-year-old Royal tradition"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-says-king-charles-153236867.html",
        "title": "<b>Prince Harry</b> says King Charles III&#39;s cancer diagnosis could bring the royal family closer together",
        "description": "<b>Prince Harry</b> opened up about King Charles III&#39;s cancer diagnosis publicly for the first time. He spoke about his father&#39;s diagnosis and his recent visit to see him on &quot;Good Morning America.&quot; <b>Harry</b> hinted at the diagnosis possibly having a &quot;reunifying ..."
    }
]