[
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-william-kate-middletons-former-staffer-reveals-princess-will-make-husband-better-king.html/",
        "title": "<b>Prince</b> William and Kate Middleton’s Former Staffer Reveals How the Princess Will Make Her Husband a ‘Better King’",
        "description": "According to a former palace staffer, Kate Middleton has helped transform Prince William and he will be a &quot;better king&quot; for it."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853883/prince-harry-meghan-markle-Sarah-Ferguson",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;followed Sarah Ferguson&#39;s lead&#39; and kept royal titles",
        "description": "Prince Harry and Meghan Markle are &quot;following Sarah Ferguson&quot; in keeping hold of their royal titles to make money in the US, according to a royal expert. US royal commentator Kinsey Schofield says the pair&#39;s titles have allowed them to “maintain the perception of royalty&quot;, giving them a status similar to reality stars."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25262418/kate-middleton-gifted-jewellery-birthday-prince-william-gift/",
        "title": "Kate Middleton ‘gifted £121k jewellery for her birthday by <b>Prince</b> William’ after previous present ‘didn’t go down well’",
        "description": "WHEN your husband is heir to the throne, you may expect something more than a bunch of service station flowers for your birthday. And Prince William certainly has delivered the goods to Kate"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853844/prince-harry-meghan-markle-hollywood",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;in trouble&#39; after becoming Hollywood &#39;figures of ridicule&#39;",
        "description": "<b>Prince Harry</b> and Meghan Markle are &quot;in trouble&quot; after becoming &quot;figures of ridicule&quot; in Hollywood, a commentator has claimed. The Duke and Duchess of Sussex were savaged at the Golden Globes by comedian Jo Koy who hosted the event. He took aim at Meghan ..."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-harry-and-meghan-markle-the-obscure-royal-rule-that-forced-them-to-return-their-wedding-gifts_art20706.html",
        "title": "<b>Prince Harry</b> and Meghan Markle: The obscure Royal rule that forced them to return their wedding gifts",
        "description": "A little-known rule made the Duke and Duchess of Sussex return their wedding gifts worth £7 million. Here’s the obscure reason"
    },
    {
        "url": "https://www.hellomagazine.com/brides/510851/king-charles-dependent-on-queen-camilla-in-intense-relationship/",
        "title": "King Charles &#39;dependent&#39; on Queen Camilla in &#39;intense&#39; relationship",
        "description": "They&#39;ve been in love a long time and it&#39;s been an intense relationship where they&#39;ve had to overcome a lot. Even looking at pictures of them when they were younger, whenever Camilla was photographed,"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12942959/Princess-Wales-set-spend-smoother-day-family-year-2023s-celebrations-overshadowed-Prince-Harry-royal-expert-claims.html",
        "title": "Princess of Wales is set to spend a &#39;smoother&#39; day with her family this year after 2023&#39;s celebrations were overshadowed by <b>Prince Harry</b>, royal expert claims",
        "description": "Last year, the Princess of Wales was shouldering the release of her brother-in-law Prince Harry&#39;s explosive book Spare. But speaking to Fabulous, a royal expert says this birthday will be &#39;smoother&#39;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/queen-camilla-plans-perfect-revenge-31841521",
        "title": "Queen Camilla plans &#39;perfect revenge&#39; on <b>Prince Harry</b> after his cruel attacks in Spare",
        "description": "The Duke of Sussex did not hold back when it came to his stepmother in his tell-all memoir as he branded her as a &quot;dangerous&quot; villain in the Royal Family."
    },
    {
        "url": "https://uk.news.yahoo.com/did-prince-william-really-missing-124816740.html",
        "title": "Did <b>Prince</b> William really go missing as a child? Everything we know",
        "description": "Royal fans are wondering if Prince William went missing as a child when he learnt his mother Princess Diana had died"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25295595/meghan-markle-prince-harry-failed-hollywood-desperate-royal/",
        "title": "‘Desperate’ Meghan Markle &amp; <b>Prince Harry</b> ‘have failed in Hollywood’ &amp; ‘have nothing of credibility there’, expert claims",
        "description": "MEGHAN Markle and Prince Harry have “failed in Hollywood” after failing to land new income streams, according to a royal author. This comes after the Duke and Duchess of Sussex’s £18million"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-william-banned-harry-key-31839512",
        "title": "<b>Prince</b> William banned <b>Harry</b> from key role at his wedding to Kate Middleton",
        "description": "Prince Harry wrote in detail about Prince William and Kate Middleton&#39;s wedding day in his book Spare, and revealed there was one big job he was banned from doing"
    },
    {
        "url": "https://www.ibtimes.co.uk/glenn-howerton-says-prince-harry-wants-normal-dude-1722607",
        "title": "Glenn Howerton Says <b>Prince Harry</b> &#39;Wants To Be A Normal Dude&#39;",
        "description": "&quot;He&#39;s cool, man. A very nice, very down to earth, normal dude in a lot of ways,&quot; Howerton said and explained: &quot;I mean, he&#39;s not a normal dude, but he comes, he presents as a normal dude.&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12941835/Zara-Tindall-Nacho-Figueras-Magic-Millions-Australias-Gold-Coast-Chris-Hemsworths-wife-Elsa-Pataky-Mike.html",
        "title": "Zara Tindall is joined by <b>Prince Harry</b>&#39;s best friend Nacho Figueras at Magic Millions on Australia&#39;s Gold Coast - as Chris Hemsworth&#39;s wife Elsa Pataky watches on with Mike",
        "description": "The King&#39;s niece, 42, and her former rugby pro husband, 45, put on a loved up display at Surfer&#39;s Paradise in Queensland as she appeared at the Magic Millions Barrier Draw."
    },
    {
        "url": "https://uk.style.yahoo.com/42-princess-wales-most-fabulous-002441790.html",
        "title": "The Princess of Wales’ 42 most fabulous looks on her 42nd birthday",
        "description": "While the Princess will likely spend the day with close friends, family and her husband, <b>Prince</b> William, she would have no problem amping up the glamour should she see fit. Over the past two decades she has stepped out in countless glamorous ball gowns ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/prince-harry-meghan-markle-failed-28418475",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;failed in Hollywood&#39; - royal expert",
        "description": "A royal commentator has claimed <b>Prince Harry</b> and Meghan Markle have &#39;failed in Hollywood&#39; and are &#39;scrambling for new deals&#39;. Their lucrative Spotify deal was axed last year after they only produced one series.. Royal author Tom Bower said: “They’ve ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/inside-kate-middletons-birthday-curse-31840820",
        "title": "Inside Kate Middleton&#39;s birthday curse: The 4 times her special day was ruined",
        "description": "In the past, events involving <b>Prince Harry</b> and Meghan Markle have often taken the spotlight away from Kate&#39;s special day. From controversial memoir revelations to Megxit and even a lockdown, the Princess&#39; birthday has rarely been plain sailing. Last year ..."
    },
    {
        "url": "https://uk.style.yahoo.com/giving-wife-awful-gifts-past-221941147.html",
        "title": "After Giving His Wife Some “Awful” Gifts in the Past, <b>Prince</b> William Made Up for It by Gifting Princess Kate £121K in Jewelry",
        "description": "One of the most memorable gag gifts, for example, was when <b>Prince Harry</b> gave his grandmother Queen Elizabeth a bath hat that read “Ain’t life a b—tch.”"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-way-31825266?int_source=nba",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;way back to royal life&#39; and reconciliation revealed",
        "description": "<b>Prince Harry</b>&#39;s &quot;way back to royal life&quot; has been revealed four years after he and Meghan Markle announced that they were stepping down as senior working members of the British Royal Family. The Duke and Duchess of Sussex stepped down from the Monarchy in ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-snapped-hanging-out-31804642?int_source=nba",
        "title": "<b>Prince Harry</b> snapped hanging out with new Hollywood pals without Meghan Markle",
        "description": "<b>Prince Harry</b> has been spotted rubbing shoulders with Hollywood TV stars in recently-shared snaps with wife Meghan Markle nowhere to be seen. The Duke and Duchess of Sussex have made friendships with many famous faces since leaving the Royal Family to ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wants-answers-king-31781478?int_source=nba",
        "title": "Meghan Markle &#39;wants answers&#39; from King Charles, says royal expert",
        "description": "Neil Sean, a royal commentator, has claimed that Meghan and <b>Prince Harry</b> are confused about why they&#39;re treated differently from other royals. Neil also revealed that Meghan has tried to set up a meeting with the King to discuss her concerns. On his ..."
    },
    {
        "url": "https://www.xfire.com/suits-reunion-fuels-hopes-of-the-return-of-familiar-faces-in-new-series/",
        "title": "New Suits Story Coming, But Will Markle &amp; Others Join New Characters After Ratings Surge?",
        "description": "Mike Ross is ready to return to action in the upcoming Suits series, with the hope that Rachel Zane will also be joining him."
    },
    {
        "url": "https://ca.news.yahoo.com/most-awkward-jokes-2024-golden-220500297.html",
        "title": "The Most Awkward Jokes at the 2024 Golden Globes Show",
        "description": "Adan Canto, best known to TV audiences for his roles on The Cleaning Lady and Designated Survivor, has died at the age of 42. “Actor Adan Canto died on Jan. 8, 2024, of appendiceal cancer,” Canto’s publicist, Jennifer Allen, confirmed in a statement to TVLine. “Adan had a depth of spirit that few truly knew. …"
    },
    {
        "url": "https://www.btimesonline.com/articles/163167/20240110/anticipated-bombshell-for-prince-harry-and-meghan-markle-lady-colin-campbell-predicts-2024-challenges.htm",
        "title": "Anticipated &#39;Bombshell&#39; for <b>Prince Harry</b> and Meghan Markle: Lady Colin Campbell Predicts 2024 Challenges",
        "description": "Prince Harry and Meghan Markle, already under the glare of public scrutiny, might face fresh challenges in 2024, according to Lady Colin Campbell, a noted British commentator."
    },
    {
        "url": "https://www.skynews.com.au/insights-and-analysis/nigel-jones-prince-andrew-is-king-charles-number-one-problem-after-jeffrey-epstein-document-dump-levelled-fresh-accusations/news-story/dbb2f016e44b64f0006203ceee5fefef",
        "title": "Nigel Jones: <b>Prince</b> Andrew is &#39;King Charles&#39; number one problem&#39; after Jeffrey Epstein document dump levelled fresh accusations",
        "description": "Prince Andrew&#39;s very existence has become a major problem for the British monarchy after a document dump relating to billionaire paedophile Jeffrey Epstein sparked calls for a police investigation into the disgraced royal, writes Nigel Jones. The new year has certainly not opened well for Britain’s second problem prince: Andrew, the Duke of York."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/if-prince-andrew-is-evicted-from-royal-lodge-where-would-he-live_art20705.html",
        "title": "If <b>Prince</b> Andrew is evicted from Royal Lodge, where would he live?",
        "description": "<b>Prince</b> Andrew could be facing eviction after King Charles reportedly decided to cut his brother’s security fund. But where would the disgraced Duke live if it comes to that? If <b>Prince</b> Andrew moved to Frogmore Cottage, it would be a considerable downsize ..."
    },
    {
        "url": "https://www.wmagazine.com/fashion/kate-middleton-best-style-moments-fashion-red-carpet",
        "title": "Kate Middleton Has Mastered the Art of Dressing Like a Modern-Day Princess",
        "description": "In honor of the Princess&#39; 42nd birthday, we&#39;re looking at how her style has evolved throughout her 13 years in the royal family."
    },
    {
        "url": "https://www.samaa.tv/208737719-meghan-markle-prince-harry-face-public-scrutiny-after-jo-koy-s-golden-globe-roast",
        "title": "Meghan Markle, <b>Prince Harry</b> face public scrutiny after Jo Koy&#39;s Golden Globe roast",
        "description": "The comedian didn&#39;t stop there, playfully referencing the acclaimed series &quot;Succession&quot; and drawing parallels with &quot;The Crown,&quot; teasing, &quot;Just a great series about a rich, white, dysfunctional family,"
    },
    {
        "url": "https://www.businessinsider.com/author/charlotte-walsh",
        "title": "Charlotte Walsh",
        "description": "Charlotte Walsh is a freelance writer who currently resides in Hoboken, New Jersey. She recently graduated from Northwestern University, where she studied journalism, political science, and film. Previously,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-prince-william-refuse-absentee-parents-prince-george-princess-charlotte-prince-louis.html/",
        "title": "Kate Middleton and <b>Prince</b> William Refuse to Be Absentee Parents for <b>Prince</b> George, Princess Charlotte and <b>Prince</b> Louis",
        "description": "Kate Middleton and Prince William refuse to be absentee parents for Prince George, Princess Charlotte, and Prince Louis. Here&#39;s why."
    },
    {
        "url": "https://www.foxnews.com/entertainment/king-charles-wishes-beloved-kate-middleton-happy-birthday-amid-prince-andrews-epstein-drama",
        "title": "King Charles wishes &#39;beloved&#39; Kate Middleton happy birthday amid <b>Prince</b> Andrew&#39;s Epstein drama",
        "description": "Kate Middleton, the Princess of Wales, is celebrating her 42nd birthday on Jan. 9. She is married to Prince William, heir to the British throne. They share three children."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/prince-william-kate-middleton-reportedly-173940287.html",
        "title": "<b>Prince</b> William &amp; Kate Middleton Reportedly Pulled Their Royal Ranking To Make This Real Estate Move",
        "description": "King Charles III is reportedly pulling away Prince Andrew’s security detail that he privately funds out of his own pocket after the recent Jeffrey Epstein document dump. Now, it seems that Prince William and Kate Middleton might be using their royal rank to get ahold of the Duke of York’s Royal Lodge residence."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146231-kate-middleton-exudes-all-signs-of-being-perfect-queen-consort",
        "title": "Kate Middleton exudes all signs of &#39;being perfect Queen Consort&#39;",
        "description": "Princess Kate, who is celebrating her 42nd birthday today on January 9, garnered praise for being a perfect future Queen Consort. The Princess of Wales lauded for being gracefully"
    },
    {
        "url": "https://inews.co.uk/opinion/prince-andrew-still-doesnt-get-it-2844988",
        "title": "<b>Prince</b> Andrew still doesn’t get it",
        "description": "The scene showed how Prince Andrew hasn’t changed his entitled buffoon character one bit. It shows too that he should never return to royal duties, which he stopped in 2019. In 2022, the Queen stripped him of his royal patronages and military titles – a loss he apparently found unbearable."
    },
    {
        "url": "https://www.mlive.com/news/ann-arbor/2024/01/from-taylor-swift-to-prince-harry-the-most-requested-items-at-the-ann-arbor-library-in-2023.html",
        "title": "From Taylor Swift to <b>Prince Harry</b>: The most requested items at the Ann Arbor library in 2023",
        "description": "The Ann Arbor District Library has compiled a list of the most popular items requested in 2023, including fiction, nonfiction, art prints, music and items in its Tools collection."
    },
    {
        "url": "https://uk.style.yahoo.com/look-tom-felton-reunites-harry-163252047.html",
        "title": "Look: Tom Felton reunites with &#39;<b>Harry</b> Potter&#39; dad Jason Isaacs",
        "description": "Jason Isaacs and Tom Felton recently had a Harry Potter reunion. Felton, 36, shared a photo with Isaacs, 60, Monday on Instagram that showed the pair posing outside of The Savoy hotel in London. Isaacs and Felton played father and son Lucius and Draco Malfoy in the Harry Potter movies."
    },
    {
        "url": "https://popculture.com/celebrity-parents/news/meghan-markle-mom-reportedly-moves-in-with-her-prince-harry/",
        "title": "Meghan Markle&#39;s Mom Reportedly Moves in With Her and <b>Prince Harry</b>",
        "description": "Meghan Markle&#39;s mother, Doria Ragland, has reportedly moved in with her and Prince Harry out of convenience and a desire to be close to her grandchildren. Last week, a source close to the family told Express that Ragland rarely goes back to her own home,"
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/kate-middleton-is-predicted-to-have-a-smoother-year-starting-with-her-birthday-says-a-royal-expert/",
        "title": "Kate Middleton is predicted to have a ‘smoother’ year starting with her birthday, says a Royal expert",
        "description": "It is a special day for Kate Middleton, the Princess of Wales. She is turning 42 years old and will be celebrated and pampered as a Queen to be only can, one would hope. Kate Middleton is the wife of Prince William,"
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middletons-pre-royal-life-160315257.html",
        "title": "Kate Middleton&#39;s Pre-Royal Life Unveiled on TikTok: Ugg Boots and Wild Nights with <b>Prince</b> William!",
        "description": "Kate hits the club with Prince William in resurfaced photos making the rounds on TikTok Max Mumby/Indigo/Getty Kate Middleton attends The Day-Glo Midnight Roller Disco in September 2008 in London. Before she was a royal,"
    },
    {
        "url": "https://www.aol.com/entertainment/gayle-king-marks-12-years-210059392.html",
        "title": "Gayle King Marks 12 Years at ‘CBS Mornings’ in Original First-Day Dress",
        "description": "12 years later, here we are! Still psyched to be sitting here.” Related: Every Time Gayle King Defended <b>Prince Harry</b> and Meghan Markle From Critics In their corner. Gayle King has stood by <b>Prince Harry</b> and Meghan Markle amid their many royal ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163158/20240109/prince-harry-and-meghan-face-backlash-as-golden-globes-jokes-highlight-falling-star.htm",
        "title": "<b>Prince Harry</b> and Meghan Face Backlash as Golden Globes Jokes Highlight Falling Star",
        "description": "<b>Prince Harry</b> and Meghan Markle, the Duke and Duchess of Sussex, are facing a decline in popularity, highlighted by jokes aimed at them during the 81st annual Golden Globes ceremony. Hosted by comedian Jo Koy in Beverly Hills, the event saw the royal couple ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146216-tom-felton-catches-up-with-harry-potter-father-jason-isaacs",
        "title": "Tom Felton catches up with ‘<b>Harry</b> Potter’ father Jason Isaacs",
        "description": "It’s a Harry Potter reunion. Tom Felton – who played the iconic protagonist Draco Malfoy on the hit franchise – met up with his on-screen father, Jason Isaacs for a sweet"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/sin-ad-o-connor-died-151432210.html",
        "title": "Sinéad O’Connor died of natural causes",
        "description": "Her rendition of the <b>Prince</b> song “Nothing Compares 2 U” shot to No. 1 in 1990, buoyed by a music video that featured O’Connor, with close-cropped hair and a dark turtleneck. Hundreds of people lined the streets to pay tribute to her during her ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/prince-harry-cops-further-humiliation-over-sandhurst-book/news-story/02d49314440329b026f12ea98f688f30",
        "title": "<b>Prince Harry</b> cops further humiliation over Sandhurst book",
        "description": "<b>Prince Harry</b> and <b>Prince</b> William attend the Sovereign&#39;s Parade at the Royal Military Academy in Sandhurst in 2006. Picture: AFP British singer James Blunt even made the guide for his service in Kosovo before he became a hugely becoming a hugely popular ..."
    },
    {
        "url": "https://www.newidea.com.au/who-does-prince-louis-look-like",
        "title": "Who does <b>Prince</b> Louis look like?",
        "description": "Whilst the young <b>prince</b> doesn&#39;t share too many physical similarities with his uncle <b>Harry</b>, he did don an almost identical outfit to Trooping the Colour in 2023 to one worn by a then four year old <b>Harry</b> to the Beating Retreat military ceremony held on June ..."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/king-charles-iii-reportedly-taking-180212747.html",
        "title": "King Charles III Is Reportedly Taking This Drastic Measure Against <b>Prince</b> Andrew Amid PR Crisis",
        "description": "Unlike <b>Prince Harry</b>, who funds his own security and has found a lucrative path in the U.S., Andrew “has no discernible income” after his Epstein scandal. It was Queen Elizabeth II who paid to settle his civil sexual abuse case for a reported $16 million."
    }
]