[
    {
        "url": "https://www.aol.com/lifestyle/prince-williams-rumored-ex-girlfriends-213000544.html",
        "title": "All of <b>Prince</b> William&#39;s Rumored Ex-Girlfriends",
        "description": "She&#39;s now married to Edward Milbank, and they have three children: Harry (b. 2009), Alexnader (b. 2011), and Arabella (b. 2013). Rose was also linked to Prince William in summer 2000, after he finished his A-levels at Eton. According to the Daily Mail, &quot;Rose is generally considered the Prince&#39;s first serious girlfriend.&quot;"
    },
    {
        "url": "https://news.sky.com/story/ex-mirror-journalist-says-he-was-asked-to-give-coronation-street-star-flowers-containing-listening-device-13033764",
        "title": "Ex-Mirror journalist says he was asked to give Coronation Street star flowers containing listening device",
        "description": "Dean Piper, a showbiz reporter at The Mirror in the early 2000s, was speaking to Sky News after a High Court judge ruled phone hacking was carried out at Mirror Group Newspapers from 1996 to 2011."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12878791/EDEN-CONFIDENTIAL-Duke-Duchess-Edinburgh-Prince-Edward-Sophie-salute-Ukraine-Christmas-card.html",
        "title": "EDEN CONFIDENTIAL: Duke and Duchess of Edinburgh <b>Prince</b> Edward and Sophie salute Ukraine in their Christmas card",
        "description": "Industry bible The Hollywood Reporter has named <b>Prince Harry</b> and Meghan among the biggest losers of the year. Mystery as movie star Morton ditches agent For the cream of British stars, including Helena Bonham Carter, Benedict Cumberbatch and Dame Joanna ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-reveals-one-christmas-31703088",
        "title": "Meghan Markle reveals the one Christmas present she won&#39;t be buying for <b>Prince</b> Archie",
        "description": "Meghan Markle has shared the one Christmas present that she won&#39;t be buying for her son <b>Prince</b> Archie this year, and by doing so she has revealed some sweet details about the tot. Taking part in a Q&amp;A last month, following a special screening of Netflix&#39;s ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847004/prince-harry-meghan-markle-christmas-card",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;rubbish&#39; Christmas card misses one important thing",
        "description": "Prince Harry and Meghan Markle’s official Christmas card has been slammed as “rubbish” by one critic who was left upset that the royal couple chose not to include their two year old baby, Lillibet, and four year old Archie."
    },
    {
        "url": "https://inews.co.uk/culture/where-princess-diana-buried-althorp-accessible-public-2815058?ico=related_article_inline",
        "title": "Where is Princess Diana buried? If Althorp resting place is accessible to public",
        "description": "Her final resting place is on an island in an ornamental pond, known as The Round Oval within Althorp Park’s gardens"
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-revealed-one-gift-182618024.html",
        "title": "Meghan Markle Revealed the One Gift She Won&#39;t Be Giving to Her Son Archie This Christmas",
        "description": "Steve Halliwell, the actor, who has died aged 77, stormed dramatically into the ITV soap Emmerdale in 1994 as Zak Dingle, bare-knuckle fighting with the farmworker Ned Glover in the sleepy Yorkshire village. After a bloody battle, the pair rolled down an embankment into a stream and Ned landed the final blow."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-archie-christmas-list-b2466120.html",
        "title": "Meghan Markle reveals surprising item on Archie’s Christmas list",
        "description": "Meghan Markle has revealed the unlikely item her son Prince Archie is asking Santa Claus for this Christmas - and why he won’t get it."
    },
    {
        "url": "https://www.ladbible.com/entertainment/film/harry-potter-new-film-trailer-cursed-child-093102-20231218?c=1702921322618",
        "title": "&#39;New <b>Harry</b> Potter trailer&#39; set in 2024 features Dumbledore and shows <b>Harry</b> all grown up",
        "description": "A new Harry Potter ‘trailer’ for 2024 not only shows the boy wizard all grown up, but also features Dumbledore. Sure, it might sound too good to be true, but Potterheads are pretty excited about it."
    },
    {
        "url": "https://www.hellomagazine.com/homes/509713/heartfelt-royal-christmas-decorations-princess-kates-family-tribute-meghan-markles-weird-queen-elizabeth-ornament-more/?n=%40",
        "title": "Heartfelt royal Christmas decorations: Princess Kate&#39;s family tribute, Meghan Markle&#39;s &#39;weird&#39; Queen Elizabeth ornament &amp; more",
        "description": "From Corgis to Paddington Bears, look back at the most heartfelt royal Christmas decorations."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/18/piers-morgan-phone-hacking-mirror-editor-judge-prince-harry?ref=upstract.com",
        "title": "Piers Morgan will find many ways to deny phone hacking – but how long before his number is up?",
        "description": "Following a judge’s ruling in favour of Prince Harry, his confected outrage is starting to look a little desperate, says Archie Bland, editor of the Guardian’s First Edition newsletter"
    },
    {
        "url": "https://uk.style.yahoo.com/princess-diana-jacques-azagury-evening-170000916.html",
        "title": "Princess Diana’s Jacques Azagury Evening Dress Just Sold for a Record $1.1 Million",
        "description": "Designed by Jacques Azagury, the ballerina-length gown sold for 11 times its original estimate of $100,000. It now holds the world record for the most expensive Lady Di-worn dress sold at auction. (The previous record holder was a velvet Victor Edelstein gown that sold for $604,800 at auction in January.)"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1846947/prince-harry-meghan-markle-royal-family-tradition",
        "title": "<b>Prince Harry</b> poised to &#39;miss key Royal Family tradition&#39; this Christmas",
        "description": "Prince Harry is expected to spend yet another year in California - and this will come at a particular cost, claims one royal expert."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12876339/The-Crown-Dominic-West-Charles-Diana.html",
        "title": "The Crown star Dominic West says Charles was judged too harshly in the aftermath of Diana&#39;s death: Actor says King was treated as the &#39;villain of the piece&#39; but he has &#39;real ...",
        "description": "The star, 54, who took the role of the Prince of Wales in the final two series of the Netflix show, believes that history should be kinder to the now King, who he says has &#39;made every mistake going&#39;."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-meghan-markle-using-sussex-royal-title-despite-pledge-to-stop/",
        "title": "<b>Harry</b> and Meghan still using &#39;Sussex Royal&#39; title online despite pledge to stop",
        "description": "Although the royal couple stepped down as senior Royals three years ago, the pair are still using their &#39;Sussex Royal&#39; title."
    },
    {
        "url": "https://fortune.com/europe/2023/12/18/prince-harry-victory-british-tabloid-phone-hacking-case/",
        "title": "<b>Prince Harry</b> only won $180,000 in court against a British tabloid but the phone-hacking case is an industry landmark",
        "description": "<b>Prince Harry</b> won his phone hacking lawsuit against the publisher of the Daily Mirror and was awarded over 140,000 pounds ($180,000) in the first of his several lawsuits against the tabloids to go to trial. Fancourt found on Friday that phone hacking was ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-lets-slip-what-31701182",
        "title": "Meghan Markle lets slip what <b>Prince</b> Archie wants for Christmas - and why he won&#39;t be getting it",
        "description": "During an appearance with her photographer friend Misan Harriman, Meghan Markle revealed a gift Prince Archie would want on his Christmas list - but she&#39;s not so sure if he will get one"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-duchess-sussex-reveals-extremely-201500990.html",
        "title": "Meghan, Duchess of Sussex, reveals the EXTREMELY expensive gift her son wants for Christmas",
        "description": "The 42-year-old, who has four-year-old Archie and daughter Lilibet, two, with her husband <b>Prince Harry</b>, 39, said the youngster included it in his Christmas wish-list during a question-and-answer session after a screening of Netflix’s short film ‘The ..."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-revealed-whats-likely-142359182.html",
        "title": "Meghan Markle Revealed What&#39;s Likely on Son <b>Prince</b> Archie&#39;s Christmas List — and Why He Won&#39;t Get It!",
        "description": "Both Meghan, 42, and Harry, 39, have also shared their view behind the lens. Prince Harry took over National Geographic’s Instagram in 2019, and both the Duke and Duchess of Sussex had their photos featured on Instagram during their royal tour of Australia, New Zealand, Fiji and Tonga in the fall of 2018."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-prince-harry-christmas-card-b2466035.html",
        "title": "<b>Prince Harry</b> and Meghan Markle share 2023 Christmas card",
        "description": "Meghan Markle and Prince Harry are ringing in the holiday season with their 2023 Christmas cards. On Friday 15 December, the Duke and Duchess of Sussex sent out an email with their virtual Christmas cards on behalf of their Archewell organisation. “We wish you a very happy holiday season. Thanks for all the support in 2023!” the card reads."
    },
    {
        "url": "https://www.telegraph.co.uk/music/artists/aled-jones-my-most-surreal-childhood-memory/",
        "title": "Aled Jones: ‘My most surreal memory is doing Welsh karaoke for <b>Prince</b> Charles and Lady Diana’",
        "description": "The singer and presenter on working with music legend Leonard Bernstein, going sober and why he learnt Japanese after his voice broke"
    },
    {
        "url": "https://www.hellomagazine.com/cuisine/509687/kate-middleton-royals-cant-get-drunk-christmas-booze-rules/",
        "title": "Princess Kate&#39;s royal booze rule she can&#39;t even break at Christmas",
        "description": "This year, King Charles and Queen Camilla will host the family for a festive feast, with Princess Kate, Prince William and their children Prince George, Princess Charlotte and Prince Louis being guests of honour, of course. While wine will be free-flowing on Christmas Day, there&#39;s one thing the royals definitely won&#39;t be doing – getting drunk."
    },
    {
        "url": "https://www.tatler.com/article/duke-and-duchess-of-sussex-send-out-their-annual-festive-christmas-card",
        "title": "The Duke and Duchess of Sussex wish loved ones a ‘happy holiday season’ as 2023’s Christmas card revealed",
        "description": "The Duke and Duchess of Sussex are the latest royals to mark Christmas with an annual card. The couple’s charity The Archewell Foundation and their media production company Archewell Productions sent round an email wishing everyone a ‘Happy Holiday Season."
    },
    {
        "url": "https://uk.movies.yahoo.com/princess-diana-jacques-azagury-evening-170000916.html",
        "title": "A Princess Diana Evening Dress Rocketed Past Estimates to Sell for $1.1 Million",
        "description": "More from Robb Report <b>Prince Harry</b> Says He&#39;s Worried for the Safety of Meghan Markle and Their Kids in the U.K. The Curtains at Buckingham Palace and Windsor Castle Have Been Turned Into Kimonos <b>Prince Harry</b> and Meghan Markle Aren&#39;t Being Invited to a ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-still-31702412",
        "title": "<b>Prince Harry</b> and Meghan Markle still using royal titles",
        "description": "<b>Prince Harry</b> and his wife Meghan Markle have held onto their &quot;Sussex Royal&quot; website, despite making a promise to stop using the term after they stepped back from the monarchy in 2020. The Duke and Duchess of Sussex agreed to stop using their Royal titles ..."
    },
    {
        "url": "https://www.romper.com/entertainment/the-crown-season-6-ski-trip-scene-real-photos",
        "title": "Here Are The Real Photos From 1998 That Inspired That Ski Trip Scene In The Crown",
        "description": "The Crown&#39;s ski trip scene sees Prince Charles taking his sons, Prince William and Prince Harry, on a working vacation after their mother Princess Diana&#39;s death."
    },
    {
        "url": "https://www.stuff.co.nz/life-style/royals/301028517/the-excuses-are-gone--can-the-sussexes-ever-make-a-comeback",
        "title": "The excuses are gone – can the Sussexes ever make a comeback?",
        "description": "The couple had, the magazine said, been the subject of “scorn and mockery”. It is an inauspicious end to a year in which <b>Prince Harry</b> and Meghan initially appeared to have the world at their feet. Off the back of their own six-part Netflix documentary ..."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/harry-and-meghan-will-be-relieved-kate-middletons-uncle-pulls-plug-on-tellall-book-on-sussex-feud-after-family-intervention/news-story/c6c5b4bb3d5c02eb90940821a472244e",
        "title": "&#39;<b>Harry</b> and Meghan will be relieved&#39;: Kate Middleton&#39;s uncle pulls plug on tell-all book on Sussex feud after family intervention",
        "description": "An uncle of Princess Catherine has reportedly changed his mind about writing a tell-all book that was supposed to defend his globally famous niece following repeated attacks by the Sussexes."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139690-jonathan-majors-convicted-of-assault-and-harassment-jury-acquits-additional-charges",
        "title": "Jonathan Majors convicted of assault and harassment, Jury acquits additional charges",
        "description": "Guilty of reckless harassment. The courtroom drama unfolded as the jury deliberated for five intense hours over three days, delivering a mixed verdict for the 34-year-old actor.  Majors, known for his Marvel role,"
    },
    {
        "url": "https://www.latimes.com/entertainment-arts/tv/story/2023-12-18/lesley-manville-princess-margaret-the-crown",
        "title": "With a drink and a smoke, playing ‘glorious’ Princess Margaret was thrilling, Lesley Manville says",
        "description": "English actor Lesley Manville spoke about portraying Princess Margaret in seasons 5 and 6 of &quot;The Crown,&quot; and what it was like to film when the news about Queen Elizabeth II&#39;s death emerged."
    },
    {
        "url": "https://www.who.com.au/the-crown-season-six-cast",
        "title": "EXCLUSIVE: Ed McVey, Meg Bellamy and Luther Ford discuss playing William, Kate and <b>Harry</b> in The Crown",
        "description": "Meg Bellamy, Ed McVey and Luther Ford discuss playing Kate Middleton, Prince William and Prince Harry in the final season of Netflix hit The Crown."
    },
    {
        "url": "https://people.com/where-is-princess-diana-buried-all-about-oval-lake-grave-8414067",
        "title": "Where Is Princess Diana Buried? All About Her Oval Lake Grave at Althorp",
        "description": "Princess Diana is buried on an island amid Oval Lake on the grounds of her childhood home at Althorp. Here’s everything to know about her gravesite."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/true-story-princess-margaret-death-213100241.html",
        "title": "The True Story of Princess Margaret’s Death",
        "description": "Lesley Manville as Princess Margaret in &#39;The Crown.&#39; Death looms large over the final episodes of The Crown, which involve Princes William and Harry continuing to grapple with the loss of their mother, Queen Elizabeth and Prince Philip planning their own funerals, and eventually the deaths of both Princess Margaret and the Queen Mother."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/king-charles-shows-funny-side-in-new-behindthescenes-documentary/news-story/f15547ba497494ed6017b08699a45e90",
        "title": "King Charles shows funny side in new behind-the-scenes documentary",
        "description": "In a historic year full of historic moments and the historic wearing of ermine-trimmed capes and posing for historic photos on thrones which were then slapped on historic commemorative biscuit tins, I have some history-making news."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139502-princess-kates-uncle-forced-to-shelve-his-plan-of-revealing-truth-about-harry-meghan",
        "title": "Princess Kate&#39;s uncle forced to shelve his plan of revealing truth about <b>Harry</b>, Meghan",
        "description": "<b>Prince Harry</b> and Meghan Markle won&#39;t be disgraced by Kate Middleton&#39;s uncle Kate Middleton&#39;s uncle Gary Goldsmith has reportedly pulled plug on tell-all book on <b>Prince Harry</b> and Meghan Markle&#39;s feud with royal family after key intervention, according to a ..."
    },
    {
        "url": "https://thekit.ca/culture/royals/meghan-and-harry-highs-lows-2023/",
        "title": "Meghan and <b>Harry</b>’s 2023 Was A Year of Intense Highs and Lows",
        "description": "In January, it will be four years since Meghan and Harry announced they were quitting their jobs as working royals. Since then, it’s been a whirlwind of bombshells, estrangements, lawsuits, deaths and births (hi Lilibet!) that seems to accelerate rather than calming down into some sort of sundazed Californian chill."
    },
    {
        "url": "https://nypost.com/2023/12/18/entertainment/former-chef-scoffs-at-royal-familys-boring-christmas-day-lunch/",
        "title": "Former royal chef scoffs at King Charles and family’s ‘boring’ Christmas Day lunch",
        "description": "The royal family’s big day actually kicks off with a personal breakfast before heading over to St Mary Magdalene Church for an 11 a.m. service. After lunch and a supper filled with roasted hams and boar’s head, they all gather to watch the monarch’s Christmas message on television."
    },
    {
        "url": "https://www.aol.com/lifestyle/did-prince-harry-really-treatment-180000394.html",
        "title": "Did <b>Prince Harry</b> Really Go to a &quot;Treatment Center&quot; for Weed?",
        "description": "In The Crown, Charles wants to send 17-year-old Harry to a treatment center after discovering he&#39;s smoked weed. In real life, it didn&#39;t quite happen like this."
    },
    {
        "url": "https://www.allvipp.com/royals/will-prince-george-break-with-this-tradition",
        "title": "Will <b>Prince</b> George Break With THIS Tradition?",
        "description": "Prince George can be very headstrong. Did he get that from his mother? It looks like the little royal is already pretty sure about what he wants when it comes to his life"
    },
    {
        "url": "https://uk.movies.yahoo.com/royal-baby-alert-princess-alexandra-195510994.html",
        "title": "Royal Baby Alert! Princess Alexandra of Luxembourg Is Pregnant with Her First Child",
        "description": "The Court of Luxembourg announced on Monday that Princess Alexandra and her husband, Nicolas Bagory, are expecting their first child this spring. &quot;The Grand Duke, the Grand Duchess as well as the members of the two families are united in great happiness,” the court announced."
    },
    {
        "url": "https://www.radiotimes.com/tv/drama/the-crown-finale-ending-explained/",
        "title": "The Crown season 6 episode 10 recap: Ending explained",
        "description": "The Crown season 6 is available to stream in full on Netflix now. Seasons 1-5 are also available now. Sign up for Netflix from £4.99 a month. Netflix is also available on Sky Glass and Virgin Media Stream. Check out more of our Drama coverage or visit our TV Guide and Streaming Guide to see what&#39;s on tonight."
    },
    {
        "url": "https://www.radiotimes.com/tv/drama/princess-margaret-happened-death-true-story-the-crown-explained/",
        "title": "What happened to Princess Margaret? True story of royal&#39;s final days",
        "description": "Princess Margaret, Countess of Snowdon died at the age of 71 following her fourth stroke and subsequent cardiac issues. The Princess died at King Edward VII&#39;s Hospital in London on 9th February 2002 at 6.30am GMT."
    },
    {
        "url": "https://www.capitalfm.com/news/tv-film/the-crown-awkward-scene-meg-bellamy-ed-mcvey-luther-ford/",
        "title": "The Crown&#39;s William, Kate And <b>Harry</b> Actors Share Their Most Awkward Scene To Film",
        "description": "The Crown series six part two had some uncomfortable scenes for Meg Bellamy, Ed McVey and Luther Ford, who play the young royals."
    },
    {
        "url": "https://metro.co.uk/2023/12/18/william-bauble-with-long-hair-back-branded-abomination-19990638/",
        "title": "Someone’s made a load of royal baubles and they’re utterly horrifying",
        "description": "These Christmas ornaments may have been a thoughtful tribute to members of the Royal Family – but they have been branded an ‘abomination’. King Charles, Queen Camilla, and the Prince and Princess of Wales were all turned into dangly decorations for the festive tree."
    },
    {
        "url": "https://metro.co.uk/2023/12/18/william-bauble-with-long-hair-back-branded-abomination-19990638/?ico=metro-posts_article_whats-trending-now",
        "title": "William bauble ‘with long hair at the back’ branded an ‘abomination’",
        "description": "King Charles, Queen Camilla, and the Prince and Princess of Wales were all turned into dangly decorations for the festive tree. Sold at Fenwick department store at £26 per piece, the baubles cost more than some in Liberty London and even Harrods."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harry-meghan-markle-still-31697795",
        "title": "<b>Prince Harry</b> and Meghan Markle still using royal titles online despite promise to stop",
        "description": "Meghan Markle and Prince Harry stepped down from the Royal Family three years ago, after which it was agreed that they would stop using their &#39;Sussex Royal&#39; title"
    },
    {
        "url": "https://www.thesun.ie/royals/11869073/meghan-markle-archie-devastated-camera/",
        "title": "Meghan Markle reveals <b>Prince</b> Archie, four, was devastated when she didn’t buy him an £8,000 camera",
        "description": "MEGHAN Markle has revealed that little Archie has developed a new hobby – but he wasn’t very impressed when she bought him a present to encourage him. The Duchess of Sussex, 42, shared how"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12876365/Christmas-tree-bauble-Prince-William-slammed-royal-fans-say-looks-like-him.html",
        "title": "Christmas tree bauble of <b>Prince</b> William is slammed by royal fans who say it looks nothing like him",
        "description": "The festive glass decoration, created by Nebraska vintage collectibles company Cody Foster and Co, is currently on sale for around $25 and features the Prince of Wales in full regalia"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25089313/prince-george-gifted-an-18k-victorian-style-playhouse-by-king-charles-it-includes-a-wood-burning-stove-and-day-bed/",
        "title": "<b>Prince</b> George ‘gifted an £18k Victorian-style playhouse’ by King Charles – it includes a wood-burning stove and day bed",
        "description": "WHAT do you buy the royal child who has everything? King Charles once gifted grandson Prince George a very luxurious pad for his birthday – a £18,000 swanky shepherd’s hut. When he’s not"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509684/meghan-markle-christmas-tradition-prince-archie-and-princess-lilibet/?campaign=hellous",
        "title": "Meghan Markle reveals sweet new Christmas tradition with <b>Prince</b> Archie and Princess Lilibet",
        "description": "The royal family tend to take part in a number of annual traditions, including their ritual visit to St Mary Magdalene Church in Sandringham, and a group viewing of the monarch&#39;s televised Christmas message. Furthermore, the royals exchange their gifts on Christmas Eve, in honour of their German heritage."
    },
    {
        "url": "https://www.lawgazette.co.uk/news/mirror-group-in-house-lawyer-knew-about-phone-hacking-court-finds/5118227.article",
        "title": "Mirror Group in-house lawyer knew about phone hacking, court finds",
        "description": "Judgment in Prince Harry case states that solicitor joked to reporters about how they could gain access to mobile phones."
    },
    {
        "url": "https://uk.investing.com/news/stock-market-news/london-police-to-carefully-consider-prince-harry-phone-hacking-ruling-3272515",
        "title": "London police to &quot;carefully consider&quot; <b>Prince Harry</b> phone hacking ruling",
        "description": "London&#39;s police said they will &quot;carefully consider&quot; the findings of a court ruling that found Prince Harry had been a victim of phone hacking and other unlawful"
    },
    {
        "url": "https://www.ok.co.uk/royal/lonely-harrys-new-year-wish-31683981",
        "title": "Lonely <b>Harry</b>’s New Year wish: Determined to rebuild bridges with or without Meghan",
        "description": "EXCLUSIVE: Prince Harry is said to be &quot;holding out hope for a family reunion over the holidays&quot; and is hoping he will be able to sit down with his father King Charles to talk"
    },
    {
        "url": "https://www.legalfutures.co.uk/latest-news/high-court-mirrors-legal-department-knew-about-hacking-for-years",
        "title": "High Court: Mirror’s legal department knew about hacking for years",
        "description": "The legal department at Mirror Group Newspapers was aware of phone hacking far earlier than it admitted, the High Court found last week in the claim brought by Prince Harry."
    },
    {
        "url": "https://theindependent.co/meghan-harry-christmas-card/",
        "title": "Meghan Markle and <b>Prince Harry</b> reveal Christmas Card and Seasons Greetings",
        "description": "The mission continues.” <b>Prince Harry</b> was awarded £140,600 in damages as the Mirror Group was found to be engaged in unlawful information gathering. “I found that 15 out of the 33 articles that were tried were the product of phone hacking of his ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-edward-rubbishes-omid-scobies-31654081",
        "title": "<b>Prince</b> Edward rubbishes Omid Scobie&#39;s Endgame claims in public with one subtle move",
        "description": "The explosive book has dominated headlines ever since a Dutch version of the biography seemed to name the two senior royals who were accused of voicing their concerns about the skin colour of <b>Prince Harry</b> and Meghan&#39;s Markle&#39;s first child, <b>Prince</b> Archie."
    }
]