[
    {
        "url": "https://www.irishnews.com/news/uk/harry-will-not-be-allowed-temporary-royal-role-while-king-is-ill-reports-2M7YPGH3E5NTVJXIVHODJRB7HI/",
        "title": "<b>Harry</b> ‘will not be allowed temporary royal role while King is ill’- reports",
        "description": "The Duke of Sussex will not be allowed a temporary royal role while his father undergoes cancer treatment, according to reports. It was alleged that Harry told friends he would step into such a role while Charles is unwell."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867900/prince-harry-big-ask-royal-family",
        "title": "<b>Prince Harry</b> is making &#39;big ask&#39; of Royal Family as Queen&#39;s aide blasts his latest move",
        "description": "According to reports, Prince Harry indicated to his friends that he plans to return to Britain to assist with royal duties while his father receives cancer treatment."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1867918/prince-harry-us-visa-battle",
        "title": "<b>Prince Harry</b> faces US visa court battle days after American citizenship admission",
        "description": "A United States think-tank is trying to force the Department of Homeland Security to release information about Prince Harry&#39;s visa application"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13096041/Prince-Harry-blocked-having-heart-heart-Charles-Palace-aides.html",
        "title": "<b>Prince Harry</b> &#39;blocked&#39; from having a heart-to-heart with Charles by Palace aides who feared they &#39;would never get rid of him&#39; during his whirlwind UK trip after King&#39;s cancer ...",
        "description": "Following the King&#39;s cancer diagnosis, the Duke of Sussex had hoped to join him for a few days at Sandringham when he touched down in London last week ."
    },
    {
        "url": "https://uk.style.yahoo.com/meghan-markle-wore-thing-sentaler-220650676.html",
        "title": "Meghan Markle Wore a Thing: Sentaler Cape Coat Edition",
        "description": "Meghan Markle is continuing her week of chic Canada-ready coats while she&#39;s in town for the Invictus Games One Year To Go Winter Training Camp in Vancouver with her husband, Prince Harry."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-looks-pensive-meghan-beaming-32151239.amp",
        "title": "<b>Harry</b> looks &#39;pensive&#39; while Meghan is &#39;beaming&#39; as they head to final banquet in Canada",
        "description": "The Duke and Duchess of Sussex have successfully completed their three day tour of Vancouver for the countdown to the 2025 Invictus Games, but Harry has been left looking &#39;pensive&#39; and &#39;overawed&#39; on t"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13095915/Prince-Harry-faces-court-showdown-secret-immigration-records-tries-block-call-troubled-royal-lied-visa-application-taking-drugs-admitted-memoir-Spare.html",
        "title": "<b>Prince Harry</b> faces court showdown over secret immigration records as US tries to block call to show whether the troubled royal lied on his visa application about taking drugs ...",
        "description": "The Duke of Sussex has considered becoming an American citizen, but those plans could be in jeopardy if a judge rules against him after Friday&#39;s case in Washington DC."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/513699/melissa-mccarthy-53-wows-fans-in-incredible-sequin-bodysuit-see-the-photo/",
        "title": "Melissa McCarthy, 53, wows fans in incredible sequin bodysuit - see the photo",
        "description": "Melissa McCarthy is the moment! The comedian made her debut on RuPaul&#39;s Drag Race on Friday February 16, and dressed for the occasion as she hosted a viewing party, wearing a stunning silver sequin bodysuit that highlighted her gorgeous curves. She accessorized with a silver chain belt and what appeared to be a hot pink sequin shawl."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-william-angered-harry-zero-32151271",
        "title": "<b>Prince</b> William angered by <b>Harry</b> as there is &#39;zero per cent chance&#39; he will return to royal fold",
        "description": "Prince William has made it clear that there is no longer a place for Prince Harry - with his main focus on his father’s health, his family and what is best for the monarchy"
    },
    {
        "url": "https://metro.co.uk/2024/02/17/prince-harrys-rumoured-royal-return-swiftly-ruled-out-palace-20299681/?ico=trending-module_category_uk_item-0",
        "title": "<b>Prince Harry</b>’s rumoured royal return swiftly ‘ruled out’ by the Palace",
        "description": "Reports on Saturday suggested the Duke of Sussex had told pals he would consider a temporary return to the firm (Picture: Reuters) <b>Prince Harry</b>’s rumoured willingness to step back into royal life with a working role while his father the King is ill has ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26011068/prince-harry-charles-sandringham-stay-blocked/",
        "title": "<b>Prince Harry</b> planned King heart-to-heart &amp; Sandringham stay but aides blocked it over fear ‘they’d never get rid of him’",
        "description": "PRINCE Harry was stopped from joining the King at Sandringham after flying to the UK because Palace aides feared “they’d never get rid of him”. The Duke of Sussex was told to get a hotel instead"
    },
    {
        "url": "https://www.thesun.co.uk/royals/26011738/prince-harry-hybrid-royal-support-king-charles/",
        "title": "<b>Prince Harry</b> has ‘no way back’ as hybrid royal to support King Charles as insiders blast ‘how could it even work?’",
        "description": "PRINCE Harry will not be allowed the “half in, half out” hybrid royal role he once sought amid claims he has offered to make a temporary royal return. Palace insiders insist the 2020 Megxit deal"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-shares-latest-thoughts-on-potentially-becoming-a-us-citizen_n_65d0cd81e4b0f7fbe7b2d093",
        "title": "<b>Prince Harry</b> Shares Latest Thoughts On Potentially Becoming A U.S. Citizen",
        "description": "The Duke of Sussex and wife Meghan Markle have been living stateside since their famous split with the British royal family in 2020."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-interview-king-charles-cancer-news-b2497962.html?page=11",
        "title": "<b>Prince Harry</b> interview - live: Palace ‘rules out’ return for duke as working royal while Charles is ill",
        "description": "Buckingham Palace has poured cold water on the suggestion that Prince Harry could return to a temporary role working for the royal family during his father’s illness."
    },
    {
        "url": "https://metro.co.uk/2024/02/17/prince-harrys-rumoured-royal-return-swiftly-ruled-out-palace-20299681/?ico=trending-post-strip_item_1",
        "title": "‘No way back’ for <b>Harry</b> as rumoured royal return swiftly ‘ruled out’",
        "description": "Reports on Saturday suggested the Duke of Sussex had told pals he would consider a temporary return to the firm (Picture: Reuters) Prince Harry’s rumoured willingness to step back into royal life with a working role while his father the King is ill has already been ruled out by Buckingham Palace,"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/17/no-working-royal-role-prince-harry-king-charles-cancer/",
        "title": "No working royal role for <b>Prince Harry</b> as palace stands firm",
        "description": "Palace sources say there is no way back for the Duke of Sussex to step in and help his family carry out duties while King receives treatment"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-had-160303789.html",
        "title": "Meghan Markle, <b>Prince Harry</b> Had ‘Magical’ Date with Michael Bublé and Wife at Canada Restaurant (Exclusive)",
        "description": "&quot;You could see the positivity in their relationship, the love,&quot; Chef Vikram Vij of Vij&#39;s restaurant in Vancouver tells PEOPLE of the Duke and Duchess of Sussex Karwai Tang/WireImage <b>Prince Harry</b>, Duke of Sussex, Luisana Lopilato, Michael Buble and Meghan ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markles-off-shoulder-gown-160230660.html",
        "title": "Meghan Markle&#39;s Off-the-Shoulder Gown Is a Sophisticated Alternative to the Cutout Trend",
        "description": "Don&#39;t underestimate the power of the collarbone. Getty The Invictus Games may be <b>Prince Harry</b>&#39;s thing, but during this week&#39;s countdown celebrations in Canada, Meghan Markle stole the show with her slew of amazing looks. First, she kicked off the couple&#39;s ..."
    },
    {
        "url": "https://uk.style.yahoo.com/michael-bubl-honors-prince-harry-184848152.html",
        "title": "Michael Bublé Honors <b>Prince Harry</b>, King Charles by Changing &#39;My Way&#39; Lyrics During Invictus Games Performance",
        "description": "The Canadian musician honored <b>Prince Harry</b> as a &quot;visionary&quot; and sent &quot;healing wishes&quot; to King Charles during the performance Ethan Cairns/The Canadian Press via AP Michael Bublé talks to <b>Prince Harry</b> after performing at the &quot;One Year to Go&quot; Invictus Games ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-comments-king-charles-32150970",
        "title": "<b>Prince Harry</b>&#39;s comments on King Charles&#39; cancer branded &#39;sickening&#39; by Royal associates",
        "description": "<b>Prince Harry</b>&#39;s recent interview with Good Morning America, where he spoke of King Charles&#39; recent cancer diagnosis, has left Royal friends furious. The Duke of Sussex sat down for the interview in Canada whilst there to promote the 2025 Invictus Games."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-william-wont-harry-back-28654449",
        "title": "<b>Prince</b> William won&#39;t let <b>Harry</b> back into royal fold due to three-word stance",
        "description": "Speaking to the Express, a source said on Saturday evening in the wake of <b>Harry</b>&#39;s CBS interview in America on Friday: &quot;There&#39;s no way that the <b>Prince</b> of Wales will wear it. <b>Harry</b> may well want to step back into a royal role but as far as his brother is ..."
    }
]