[
    {
        "url": "https://www.cinemablend.com/television/meghan-markle-says-archies-dream-christmas-gift-thousands-of-dollars",
        "title": "Meghan Markle Says Archie&#39;s Dream Christmas Gift Would Cost Thousands Of Dollars",
        "description": "The most expensive one in my search results, hold on to your undies, is $8,995…but only for the body, as there is no lens included. You can get a lens for around $400, or you can spend nearly as much as you did for the camera body. Yay! Hobbies!"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-reveals-one-gift-180000814.html",
        "title": "Meghan Markle Reveals The One Gift Archie Wants—But Isn’t Getting—For Christmas",
        "description": "This year, there’s one item on Meghan Markle and Prince Harry’s son Archie’s wish list that he won’t be getting this Christmas—and understandably so."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/royal-familys-christmas-guest-list-31711704",
        "title": "Royal Family&#39;s Christmas guest list confirmed but <b>Harry</b> and Meghan are missing",
        "description": "Edward is expected to be at Sandringham with his wife Sophie, the Duchess of Edinburgh, along with their two children James, the Earl of Wessex, who has just turned 16, and Lady Louise Windsor, who is on her Christmas break from St Andrews University in Scotland."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/royal-familys-christmas-guestlist-revealed-31710297",
        "title": "Royal Family&#39;s Christmas guestlist revealed - but there&#39;s no <b>Prince Harry</b> or Meghan Markle",
        "description": "Buckingham Palace confirmed that King Charles and Queen Camilla will be spending Christmas at Sandringham, where they will be joined by members of the Royal Family - and here we look at who will be jo"
    },
    {
        "url": "https://www.harpersbazaar.com/culture/film-tv/a46176433/the-crown-final-season-daddy-issues/",
        "title": "Even The Crown Has Daddy Issues",
        "description": "The pair eventually reconcile, after an intervention from Philip, but then <b>Harry</b> becomes The Problem. He and Charles clash, the youngest <b>prince</b> seemingly directionless and scandal-prone. “I know my job to be the fuckup in this family … So it’s Willy ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847046/royal-family-live-prince-harry-meghan-markle-worst-year-work",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan &#39;failed hard&#39; as they are given brutal nickname",
        "description": "The Duke and Duchess of Sussex thought 2023 promised so much, but almost all of their ventures have blown up in their face."
    },
    {
        "url": "https://www.independent.co.uk/news/long_reads/health-and-wellbeing/eton-prince-george-marlborough-college-b2466784.html",
        "title": "How did Eton become the ultimate four-letter word and not fit for a king?",
        "description": "As the Prince and Princess of Wales consider sending George to Marlborough, ex-Etonian Guy Walters considers the reputation of his (and William’s) old school and whether, for good or bad, it is really"
    },
    {
        "url": "https://www.ladbible.com/entertainment/film/harry-potter-philosopher-stone-christmas-752532-20231219",
        "title": "<b>Harry</b> Potter fans urged to watch Philosopher’s Stone from exactly 22:32 on Christmas Eve",
        "description": "Harry Potter fans are being urged to hit play on Harry Potter and the Philosopher&#39;s Stone at exactly 10.32pm on Christmas Eve. &quot;This is an extremely specific request,&quot; I hear you say."
    },
    {
        "url": "https://thetab.com/uk/2023/12/19/rip-the-crown-you-began-as-the-best-show-on-netflix-and-you-ended-as-the-worst-342733",
        "title": "RIP The Crown: You began as the best show on Netflix and you ended as the worst",
        "description": "RIP The Crown – you started with an opulent display of power and you’ve ended with a meek abdication. I’m overjoyed to see the back of this once outstanding feat of streaming telly. Say RIP to The Crown season six – available on Netflix now. For all the latest Netflix news, drops, quizzes and memes like The Holy Church of Netflix on Facebook."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-queen-camilla-lead-160249009.html",
        "title": "King Charles and Queen Camilla Will Lead the Royal Family in Christmas Tradition — All About Their Holiday",
        "description": "King Charles and Queen Camilla will lead the charge on Christmas again this year. On Tuesday, Buckingham Palace confirmed that the King, 75, and Queen, 76, will attend the morning service at Sandringham Church on Christmas Day. The couple will be joined by other members of the royal family and make the march together next Monday."
    },
    {
        "url": "https://uk.news.yahoo.com/deontay-wilder-claims-reborn-taking-115835847.html",
        "title": "Deontay Wilder claims he is ‘reborn’ after taking psychedelic South American drug",
        "description": "Deontay Wilder has said he is ‘reborn’ after going through a psychedelic drug programme in Costa Rica, as he prepares to box Joseph Parker this weekend."
    },
    {
        "url": "https://bylinetimes.com/2023/12/19/piers-morgans-statement-on-the-prince-harry-phone-hacking-case-annotated/",
        "title": "Piers Morgan’s Statement on the <b>Prince Harry</b> Phone Hacking Case – Annotated",
        "description": "Dr Evan Harris, former Director of Hacked Off and now a legal analyst to the successful claimants against Mirror Group Newspapers over phone hacking and other unlawful information gathering, deconstructs former Daily Mirror editor Piers Morgan’s statement on the damning judgement against the firm last week."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/meghan-markle-new-christmas-traditions",
        "title": "Meghan Markle opened up about new Christmas traditions away from royal life",
        "description": "Meghan Markle, Prince Harry and their children Prince Archie and Princess Lilibet will once again be spending the Christmas festivities away from the Royal Family."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/23998990.schoolgirl-plays-princess-eugenie-netflixs-crown/",
        "title": "Who is schoolgirl who plays Princess Eugenie in Netflix&#39;s The Crown?",
        "description": "Twelve-year-old Lily King, who goes to The Clarendon Academy in Trowbridge, features as Princess Eugenie in the final six episodes in part two -"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-named-31708690",
        "title": "Meghan Markle and <b>Prince Harry</b> named &#39;biggest losers&#39; of Hollywood in 2023",
        "description": "The Duke and Duchess of Sussex&#39;s Hollywood dreams have been &quot;shattered&quot; as they have failed to grasp what makes the other Royal Family members stay popular according to a expert."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12881429/Harry-Enfield-cosies-long-term-pal-Kate-St-John-Christmas-shopping.html",
        "title": "<b>Harry</b> Enfield cosies up to long-term pal Kate St John as they enjoy Christmas shopping trip together",
        "description": "<b>Harry</b>, who plays <b>Prince</b> Charles in hilarious Channel 4 sitcom The Windsors, was at the height of his fame when he met Lucy, but she was oblivious. &#39;I didn&#39;t have much of a take on who he was,&#39; she once said. <b>Harry</b> played a hilarious version of <b>Prince</b> ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12881069/William-Kate-youthful-future-royal-family-Christmas-cards-Charles-Camilla-used-coronation-snap-crowning-moment-lives-Harry-Meghan-look-like-philanthropists.html",
        "title": "William and Kate show they are the &#39;youthful future of the royal family&#39; in Christmas cards while Charles and Camilla have used the coronation snap to show the &#39;crowning moment ...",
        "description": "Speaking exclusively to FEMAIL, royal expert Richard Fitzwilliam said the images represented show which each individual royal &#39;wants to be associated with&#39;."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67727174",
        "title": "Mirror hacking victims demand criminal investigation",
        "description": "Phone hacking victims, including Prince Harry, could launch a legal challenge if police do not reopen a criminal investigation into Mirror newspapers. Their legal team have told the BBC they could attempt a private prosecution themselves,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847160/prince-harry-meghan-markle-prince-archie-princess-lilibet-heritage",
        "title": "<b>Prince Harry</b> and Meghan Markle urged to &#39;change narrative&#39; as kids risk &#39;losing heritage&#39;",
        "description": "The Duke and Duchess of Sussex have been urged to mend bridges with the Royal Family for the sake of their children, Prince Archie and Princess Lilibet, who face another Christmas separated from the rest of their royal relations."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25103091/victoria-david-beckham-revenge-meghan-harry-humiliated/",
        "title": "Victoria and David Beckham’s ultimate revenge on Meghan Markle &amp; <b>Prince Harry</b> – and it’s left the Sussexes ‘humiliated’",
        "description": "THERE has been rumours of a rift between the Beckhams and Meghan Markle and Prince Harry – and a recent move could have soured relations further. The footballing legend and his glamorous"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghans-son-prince-archie-31707302",
        "title": "<b>Harry</b> and Meghan&#39;s son <b>Prince</b> Archie in adorable mishap with &#39;magnificent&#39; Christmas tree",
        "description": "Prince Harry and Meghan Markle&#39;s son Prince Archie once had an adorable mishap with their magnificent tree during their first Christmas away from the Royal Family back in 2020"
    },
    {
        "url": "https://metro.co.uk/2023/12/19/warning-flavoured-condoms-scene-crown-19996315/?ico=trending-post-strip_item_3",
        "title": "Warning over flavoured condoms after THAT scene in The Crown",
        "description": "Speaking to hypebae, a spokesperson for Condoms.uk said: ‘Although flavoured condoms can add a fun twist to your sex life, the majority of condoms should only ever be used for oral sex and are not recommended for vaginal sex due to the potential risks that they pose."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25102035/meghan-harry-pulled-christmas-card-kate-william/",
        "title": "How Meghan and <b>Harry</b> pulled their Xmas card at the last minute and replaced it to look just like Kate and Wills’",
        "description": "MEGHAN Markle and Prince Harry released their glossy Christmas card last week – but a new version has appeared on their website. The Duke and Duchess of Sussex initially released a colourful"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/hair/509761/famous-children-red-hair-princess-lilibet-baby-minnie/",
        "title": "Celebrity children with beautiful vibrant red hair - from <b>Prince</b> Archie to baby Minnie and more",
        "description": "Having beautiful red hair has been bestowed on a number of celebrities from Prince Harry to Stacey Dooley and their"
    },
    {
        "url": "https://uk.movies.yahoo.com/queen-camilla-launching-podcast-book-120000347.html",
        "title": "Queen Camilla Is Launching a New Podcast for Book Lovers in January",
        "description": "Move over, Joe Rogan. Queen Camilla is taking to the airwaves. The royal is launching a new podcast for book lovers this January. Fittingly titled The Queen’s Reading Room, the new series will spotlight renowned authors, delving into their earliest reading memories, most treasured tomes, and favorite writers."
    },
    {
        "url": "https://www.hellomagazine.com/homes/509696/meghan-markles-son-prince-archie-mishap-magnificent-christmas-tree/?campaign=hellous",
        "title": "Meghan Markle&#39;s son <b>Prince</b> Archie&#39;s mishap with &#39;magnificent&#39; Christmas tree",
        "description": "For their first Christmas in America after stepping back as senior royals in 2020, <b>Prince Harry</b> and Meghan Markle bought a &quot;magnificent&quot; tree for their Montecito home. The Duke of Sussex recalled they bought &quot;one of the biggest spruces&quot; from a pop-up in ..."
    },
    {
        "url": "https://instafamosos.com.br/meghan-markle-reveals-what-is-at-the-top-of-prince-archies-christmas-wish-list/",
        "title": "Meghan Markle reveals what is at the top of <b>Prince</b> Archie’s Christmas wish list",
        "description": "Meghan Markle shares how the main wish on Prince Archie&#39;s Christmas wish list was inspired by some very specific experiences."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139878-king-charles-reveals-heirs-to-the-throne-in-iconic-photo",
        "title": "King Charles reveals &#39;heirs to the throne&#39; in iconic photo",
        "description": "King Charles III, who waited decades to reach the throne and was officially crowned on May 6 along side his wife Queen Camilla, has revealed the next two people in line to the throne."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1139876-buckingham-palace-reveals-royal-familys-christmas-plans",
        "title": "Buckingham Palace reveals royal family&#39;s Christmas plans",
        "description": "Buckingham Palace has revealed the King Charles and Queen Camilla and the royal family&#39;s Christmas plans. The palace on Tuesday confirmed that the King and the Queen will attend the morning service at Sandringham Church on Christmas Day. The couple will be joined by other members of the royal family and make the march together next Monday."
    },
    {
        "url": "https://www.aol.com/meghan-markle-reveals-son-archie-161137180.html",
        "title": "Meghan Markle Reveals Son Archie Is Taking After Aunt Kate Middleton with New Hobby",
        "description": "Looks like Prince Harry and Meghan Markle’s son, Prince Archie, might be following in his aunt Kate Middleton’s footsteps when it comes to their shared love for photography. On November 15, the Duchess of Sussex attended a private screening of Netflix’s short film,"
    },
    {
        "url": "https://www.aol.com/princess-diana-1985-dress-sells-161126183.html",
        "title": "Princess Diana’s 1985 Dress Sells for a Staggering $1.1 Million",
        "description": "Princess Diana. Tim Graham Photo Library via Getty Images It has been 26 years since Princess Diana’s tragic death, and yet the allure behind her legacy seemingly only gets stronger by the day. Julien’s Auctions,"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/even-crown-daddy-issues-174800180.html",
        "title": "Even “The Crown” Has Daddy Issues",
        "description": "As The Crown comes to a close after six seasons, its final chapter has a clear focus: daddy issues. In episode five, “Willsmania,” we see William (Ed McVey) and younger brother Harry (Luther Ford) struggling to adjust to a new normal without their beloved mother."
    },
    {
        "url": "https://www.yahoo.com/entertainment/theres-speculation-around-meghan-markles-173800584.html",
        "title": "There&#39;s Speculation Around Meghan Markle&#39;s Return to the Royal Family &amp; It Doesn&#39;t Make Sense",
        "description": "The British tabloids have made a big fuss over Prince Harry and Meghan Markle’s outreach toward King Charles III in hopes of a reconciliation. The U.K. media’s angle behind the couple’s olive branch seems to be aimed at their need for forgiveness in order to make their way back to the royal family."
    },
    {
        "url": "https://news.yahoo.com/taylor-swift-barbie-chinese-balloon-170602371.html",
        "title": "Taylor Swift, Barbie and a Chinese balloon: The biggest pop culture moments of 2023",
        "description": "What happened in 2023 pop culture? What is popular right now 2023? What are some examples of culture in 2023? Biggest pop culture events 2023. Biggest trends of 2023. Pop culture 2023 review."
    },
    {
        "url": "https://www.esquire.com/uk/culture/tv/a46160395/the-crown-william-harry-kate-final-season/",
        "title": "The Crown’s William, <b>Harry</b> and Kate Break Down Key Scenes From the Final Season",
        "description": "For Freeze Frame, the actors discuss key scenes from this final stretch: how did McVey and Ford approach the brothers’ tender relationship? What was the secret to portraying the blossoming romance between Kate and Will?"
    },
    {
        "url": "https://uk.movies.yahoo.com/virgin-river-reddit-caught-major-170000289.html",
        "title": "&#39;Virgin River&#39; Reddit Caught a Major Easter Egg in the Holiday Episodes",
        "description": "Virgin River&#39; fans on Reddit caught an easter egg to &#39;A Christmas Prince&#39; in season 5 part 2 of the hit Netflix drama."
    },
    {
        "url": "https://inews.co.uk/culture/television/did-kate-meet-diana-real-life-the-crown-2816488?ico=most_popular",
        "title": "Did Kate meet Diana in real life? Why royal meeting appears in The Crown",
        "description": "In season six of The Crown, a scene shows a young Kate Middleton (Meg Bellamy) and her mother, Carol, walking down a street, where they spot a young Prince William (Rufus Kampa) and Diana, Princess of Wales (Elizabeth Debicki) raising money for the Big Issue."
    },
    {
        "url": "https://uk.style.yahoo.com/queen-camilla-launching-podcast-book-120000347.html",
        "title": "Queen Camilla Is Launching a New Podcast for Book Lovers in January",
        "description": "Move over, Joe Rogan. Queen Camilla is taking to the airwaves. The royal is launching a new podcast for book lovers this January. Fittingly titled The Queen’s Reading Room, the new series will spotlight renowned authors, delving into their earliest reading memories, most treasured tomes, and favorite writers."
    },
    {
        "url": "https://www.telegraph.co.uk/tv/0/why-bobby-brazier-is-the-true-winner-of-strictly/",
        "title": "‘The looks of <b>Harry</b> Styles, the voice of Michael Caine’: why Bobby Brazier is the true winner of Strictly",
        "description": "Arlene Phillips compares him to Michaelango’s David; Craig Revel Horwood thinks he has the ‘swagger of Jagger’. Is he the next big thing?"
    },
    {
        "url": "https://www.vogue.co.uk/article/prince-george-marlborough",
        "title": "Are William And Kate Sending <b>Prince</b> George To Marlborough College?",
        "description": "According to reports, the royal couple have visited the Princess of Wales’s alma mater twice – and it would mark a significant break from royal tradition."
    },
    {
        "url": "https://www.glamourmagazine.co.uk/article/meghan-markle-archie-christmas-present",
        "title": "Meghan Markle says <b>Prince</b> Archie might not get his Christmas wish",
        "description": "In a panel discussion, the duchess explained that her four-year-old son has taken up an interest in a new hobby after some lessons from her friend Misan Harriman."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/celebrities/while-piers-morgan-denies-phone-hacking-verdit-a-former-colleague-unveils-new-details_art20495.html",
        "title": "While Piers Morgan denies phone hacking verdict a former colleague unveils new details",
        "description": "Last week, a judge in London ruled that Piers Morgan knew of phone hacking happening at the Daily Mirror while he was editor in chief. A former employee seemingly confirmed it"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-mirror-court-victory-151348948.html",
        "title": "<b>Prince Harry</b> and the Mirror: how court victory reopened the phone hacking scandal the British press had hoped was over",
        "description": "Prince Harry won a comprehensive victory in the first of three court cases against newspapers. What is the context for that judgement, and what are the implications for the UK press?"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-archie-christmas-31705027",
        "title": "Meghan Markle shares Christmas present she&#39;s refusing to get son Archie",
        "description": "Meghan Markle has shared the one Christmas present that she won&#39;t be buying for her son Prince Archie this year, and by doing so she has revealed some sweet details about the tot"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847140/prince-harry-meghan-markle-royal-family-exit?ruid=f20a88f0-6c02-4c1a-bbf8-5c2bb4e1ae66",
        "title": "<b>Prince Harry</b> and Meghan Markle lacked &#39;grit or sense of duty&#39; before royal exit",
        "description": "Prince Harry and Meghan Markle worked together as senior royals for less than two years after their nuptials before they stepped down and relocated to California."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-lets-slip-what-31701518",
        "title": "Meghan Markle lets slip what Archie wants for Christmas - and why he won&#39;t be getting it",
        "description": "During an appearance with her photographer friend Misan Harriman, Meghan Markle revealed a gift Prince Archie would want on his Christmas list - but she&#39;s not so sure if he will get one"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/19/eton-v-marlborough-prince-george-school-william-kate/",
        "title": "Eton vs Marlborough: How do the two schools vying for <b>Prince</b> George compare?",
        "description": "If William and Kate send the future King to the co-ed school, it will make a significant departure from tradition"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/rishi-sunak-reveals-election-date/",
        "title": "Rishi Sunak reveals election date",
        "description": "Rishi Sunak welcomed the Lobby to 10 Downing Street with mulled wine, elderflower cordial and canapés. A host of Cabinet ministers turned out for the event, which had a pared down guest list compared to previous years."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12879359/Duke-Beaufort-Prince-Harry-throwing-girl-swimming-pool-Badminton-House.html",
        "title": "EPHRAIM HARDCASTLE: Can the Duke of Beaufort ever forget <b>Prince Harry</b> throwing a girl into the swimming pool of Badminton House as a teenager?",
        "description": "Father Ted co-creator Graham Linehan celebrates Eddie Izzard&#39;s failure to be selected as Labour&#39;s next parliamentary candidate in Brighton Pavilion. &#39;Eddie&#39;s non-biodegradable rubber boobs will outlive us all, but they&#39;ll certainly outlive his political career,&#39; he says, adding: &#39;Not only funny, one of the best stand-ups the UK has ever had."
    },
    {
        "url": "https://www.btimesonline.com/articles/162764/20231220/speculation-over-prince-harrys-festive-olive-branch-to-king-charles-amid-ongoing-royal-feud.htm",
        "title": "Speculation Over <b>Prince Harry</b>&#39;s Festive Olive Branch to King Charles Amid Ongoing Royal Feud",
        "description": "As the holiday season approaches, <b>Prince Harry</b>&#39;s potential reconciliation with his father, King Charles, and the wider Royal Family remains a subject of intense speculation. Reports suggest that <b>Prince Harry</b>, currently residing in the U.S., is considering ..."
    },
    {
        "url": "https://news.sky.com/story/ex-mirror-journalist-says-he-was-asked-to-give-coronation-street-star-flowers-containing-listening-device-13033764",
        "title": "Ex-Mirror journalist says he was asked to give Coronation Street star flowers containing listening device",
        "description": "Dean Piper, a showbiz reporter at The Mirror in the early 2000s, was speaking to Sky News after a High Court judge ruled phone hacking was carried out at Mirror Group Newspapers from 1996 to 2011."
    },
    {
        "url": "https://www.ladbible.com/entertainment/film/harry-potter-new-film-trailer-cursed-child-093102-20231218",
        "title": "&#39;New <b>Harry</b> Potter trailer&#39; set in 2024 features Dumbledore and shows <b>Harry</b> all grown up",
        "description": "And then, despite the character dying in <b>Harry</b> Potter and the Half-Blood <b>Prince</b>, Dumbledore appears. An all grown-up (and rather haggard-looking to be honest), Daniel Radcliffe is also shown before a female voice says: “Awful things happen to wizards who ..."
    }
]