[
    {
        "url": "https://uk.news.yahoo.com/cindy-crawford-posts-throwback-photo-205510410.html",
        "title": "Cindy Crawford Posts Throwback Photo with Princess Diana Following Cameo in “The Crown”",
        "description": "On Aug. 31, 1997, Diana and her boyfriend, Dodi Fayed, were traveling by car in Paris with a driver and bodyguard pursued by paparazzi when their vehicle slammed into a support column of a tunnel, flipped and came to a rest in front of oncoming traffic. Dodi and the driver died instantly while Diana died later in the hospital. She was 36 years old."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12887101/The-Crowns-Dominic-West-says-understands-criticism-discomfort-Netflix-thought-lot-taking-role-Charles.html",
        "title": "The Crown&#39;s Dominic West says he &#39;understands&#39; criticism and &#39;discomfort&#39; around the Netflix show - and &#39;thought a lot about that&#39; before taking on the role of Charles",
        "description": "Prince of Wales on The Crown - told BBC 5 Live that he had &#39;thought a lot&#39; about the discomfort around events it was portraying."
    },
    {
        "url": "https://uk.style.yahoo.com/london-focus-production-sector-event-192911842.html",
        "title": "London’s Focus, the Production Sector Event, Attracts Record 3,500 Attendees",
        "description": "The ninth edition of London’s Focus, the production sector event, attracted a record number of attendees this year. More than 3,500 delegates, exhibitors and sponsors from 84 countries attended the event,"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/royal-family-chef-kate-william-kids-b2467530.html",
        "title": "Former royal chef explains unusual dinner rule for William and Kate’s children",
        "description": "Former royal chef Darren McGrady, who worked for both the late Queen Elizabeth II and Princess Diana, told Harper’s Bazaar that the royal children cannot eat with their parents at official dinners or during holidays. The chef revealed that the rule stems from the importance of learning “polite conversation”, the Mirror reports."
    },
    {
        "url": "https://metro.co.uk/2023/12/20/worlds-best-hotels-2024-named-six-uk-20005732/?ico=metro-posts_article_whats-trending-now",
        "title": "The world’s best hotels for 2024 have been named – and six are in the UK",
        "description": "That’s because six UK hotels were included in Condé Nast Traveller’s 2024 ‘ Gold List ’, which names all of the most glamorous hotels across the world for holidaymakers to shortlist. There are 68 bougie resorts and hotels on the full list, divided into continents, but these are the six that are very close to home."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847669/prince-harry-book-spare-sales",
        "title": "<b>Prince Harry</b>&#39;s book &#39;didn&#39;t sell anywhere near enough to warrant his huge payday&#39;",
        "description": "Prince Harry &#39;s tell-all book Spare reportedly didn&#39;t sell as many copies as originally hoped, with one royal commentator stating that the lack of copies sold did not &quot;warrant his huge payday&quot;. According to royal commentator Daniela Elser, Spare &quot;almost immediately broke records&quot; and was set to ensure the former royal with some &quot;success&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1847653/prince-harry-meghan-markle-public-affection-royal-family",
        "title": "<b>Prince Harry</b> and Meghan Markle told they must do this to &#39;win back public affection&#39;",
        "description": "Prince Harry and Meghan Markle have experienced a rollercoaster year in 2023, with an expert providing advice on how they can improve their fortunes in 2024."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25113491/meghan-markle-prince-harry-live-palace-no-money-royal/",
        "title": "Meghan Markle didn’t realise <b>Harry</b> didn’t have much money &amp; she wasn’t going to live in a palace, claims royal author",
        "description": "WHEN Meghan Markle started dating Prince Harry she didn’t realise she wasn’t going to live in a palace, according to royal author Tom Bower. Before the couple relocated to California, they first"
    },
    {
        "url": "https://www.hellomagazine.com/celebrities/509849/cindy-crawford-surprise-encounter-prince-william-princess-diana-crown-cameo/",
        "title": "Cindy Crawford addresses encounter with <b>Prince</b> William and Princess Diana after Crown cameo",
        "description": "Cindy Crawford has spoken about the time she met the late Princess Diana and a young Prince William after the supermodel made an unexpected cameo in the final season of The Crown."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-self-proclaimed-twin-uses-princess-diana-against-prince-harry-who-is-paul-dacre_art20515.html",
        "title": "King Charles’ self-proclaimed ‘twin’ uses Princess Diana against <b>Prince Harry</b>: Who is Paul Dacre?",
        "description": "On 16 December, among the noise of the racial row within the Royal Family, Paul Dacre wrote a feature piece in The Spectator. Who is the man who calls himself the ‘King’s"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12885685/experts-say-meghan-markle-advert-coffee-company-clevr-relaunching-herself.html",
        "title": "Meghan Markle&#39;s cameo in new advert for coffee company Clevr shows she is relaunching herself as &#39;kind&#39; and &#39;standalone&#39; brand and is &#39;not afraid to poke fun at herself&#39; after ...",
        "description": "The Duchess of Sussex features as a background extra in the new commercial for Clevr Blends, a firm based in Santa Barbara, California, in which she holds shares."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/20/royal-insight-family-recap-2023-king-charles-harry-meghan/",
        "title": "Watch Royal family 2023 recap: A year of ‘recrimination not reconciliation’ | Royal Insight",
        "description": "From <b>Prince Harry</b>’s “incendiary” autobiography “Spare”, to the first royal coronation in 70 years, Camilla Tominey says the King’s first year as monarch has been tricky. The Royal family are known for trying to show grace and calm during ..."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-cindy-crawford-cameo-b2467282.html",
        "title": "Cindy Crawford celebrates surprise The Crown cameo with Princess Diana memory",
        "description": "Cindy Crawford has honoured her brief cameo in The Crown with a beautiful memory of Princess Diana. The former supermodel, 57, shared a clip of a scene from season six of the popular Netflix drama in which a young Prince William (Ed McVey) walks in to find Prince Philip (Jonathan Pryce) looking at the pictures of models tacked to his wall."
    },
    {
        "url": "https://www.thesun.co.uk/royals/24821098/kate-middleton-christmas-harry-meghan-california/",
        "title": "How Meghan &amp; <b>Harry</b>’s Christmas will be world’s apart from Kate &amp; Wills’ – &amp; the family member they WON’T be FaceTiming",
        "description": "THEY may both be in the royal family but the Waleses’ and Sussexes’ Christmas celebrations could look worlds apart this year. While Prince William and Kate Middleton are expected to spend December"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middletons-savage-christmas-gift-31716349.amp",
        "title": "Kate Middleton&#39;s &#39;savage&#39; Christmas gift for <b>Prince Harry</b> after multiple failed romances",
        "description": "However, two people who are believed to have not made the guest list are <b>Prince Harry</b> and Meghan Markle. Since their dramatic exit from the Royal Family in 2020, they&#39;ve chosen to spend the festive season in the States with their two kids <b>Prince</b> Archie and ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/meghan-markle-prince-harry-clevr-coffee-cameo-b1128232.html",
        "title": "Meghan Markle&#39;s embarrassing cameo shows she and <b>Prince Harry</b> have begun their inevitable descent",
        "description": "That’s the last contact she’ll have with manual labour, but what this Instagram ad does show is Meghan returning to her profession – acting – in order to bolster her new endeavour, investing. Three years ago she invested an undisclosed sum in Clevr ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-harry-force-deeply-nervous-31717006",
        "title": "Meghan and <b>Harry</b> force &#39;deeply nervous&#39; King Charles to take drastic precaution over Christmas",
        "description": "The monarch is said to be anxious about Prince Harry and Meghan Markle&#39;s next move as he keeps his guard up over the Christmas period."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-age-13-real-31716421",
        "title": "<b>Prince Harry</b> age 13 in real photos from skiing trip with Charles and William in The Crown",
        "description": "Prince Harry and William&#39;s skiing trip in Whistler, Canada with their father King Charles has been recreated in Netflix&#39;s royal drama The Crown, now we look inside the real moments depicted in the sho"
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-meghan-markles-embarrassing-cameo-123014925.html",
        "title": "OPINION - Meghan Markle&#39;s embarrassing cameo shows she and <b>Prince Harry</b> have begun their inevitable descent",
        "description": "The miracle of the latest advertisement for Clevr, a “mission-driven, women-led wellness brand” which sells revolting-sounding powdered coffee, is that it features Meghan Markle doing actual work. The Duchess of Sussex is seen packing boxes,"
    },
    {
        "url": "https://uk.style.yahoo.com/inside-meghan-markle-prince-harry-150400875.html",
        "title": "Inside Meghan Markle and <b>Prince Harry</b>’s Christmas Plans Away From the Royals",
        "description": "There will be no royal Christmas reunion or reconciliation between Meghan Markle, <b>Prince Harry</b>, and the British royal family. Multiple sources told Us Weekly that Meghan and <b>Harry</b> will be spending their Christmas in Montecito, California, with their kids ..."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/meghan-markle-just-made-a-surprise-return-to-acting",
        "title": "Meghan Markle just made a surprise return to acting",
        "description": "Meghan Markle confirmed her retirement from acting when she announced her engagement to <b>Prince Harry</b> in 2017. While she had enjoyed a successful career in Hollywood, most notably starring in the popular legal drama Suits for seven seasons, Meghan said she ..."
    },
    {
        "url": "https://www.standard.co.uk/shopping/esbest/fashion/best-ruffled-blouses-for-women-b1127748.html",
        "title": "Best ruffled blouses for women: Frivolous fashion coveted by Audrey Hepburn, <b>Prince</b> and more",
        "description": "Across the Atlantic, <b>Prince</b> and Jimi Hendrix were carving up a style storm ... The dandy style has been embraced most famously by <b>Harry</b> Styles with a helping hand from stylist <b>Harry</b> Lambert, who dressed the star in Gucci galore. Fellow fashion houses ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/top-30-news-stories-2023-31711252.amp",
        "title": "Most Brits think 2023 was a memorable year for news, study finds",
        "description": "But while Brits loved seeing the crowning of the new King earlier this year, almost half of those polled (48%) say they have become fed up with hearing about <b>Prince Harry</b> and Meghan Markle. The findings come as digital newspaper and magazine app ..."
    },
    {
        "url": "https://www.hollywoodreporter.com/tv/tv-features/the-crown-season-6-finale-explained-1235765427/?ref=biztoc.com",
        "title": "‘The Crown’ Boss on Critiques of Diana’s “Ghost” and Return of Claire Foy, Olivia Colman in Series Finale",
        "description": "It felt like a beautifully intended tribute to say goodbye, goodbye to our show, goodbye to our story, and goodbye to [Queen Elizabeth],” says Suzanne Mackie of the last scene in the final episode of the Netflix drama."
    },
    {
        "url": "https://www.foxnews.com/entertainment/cindy-crawfords-crown-cameo-supermodel-reminiscing-about-prince-williams-crush",
        "title": "Cindy Crawford&#39;s &#39;The Crown&#39; cameo has supermodel reminiscing about <b>Prince</b> William&#39;s crush",
        "description": "Cindy Crawford shared a throwback photo of meeting Princess Diana after &quot;The Crown&quot; included a shot of Prince William with a poster of the supermodel."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2921228/the-crown-prince-william-supermodel-scene/",
        "title": "The Crown Didn’t Shy Away From <b>Prince</b> William’s Obsession With Supermodels &amp; Cindy Crawford Loves It",
        "description": "Related story <b>Prince Harry</b> &amp; Meghan Markle&#39;s &#39;High Demand&#39; Offers Are Setting Them Up for a Busy New Year in Hollywood “I went bright red and didn’t know quite what to say. And sort of fumbled and I think pretty much fell down the stairs on the way up ..."
    },
    {
        "url": "https://www.joe.co.uk/news/harry-potter-fans-urged-to-start-watching-philosophers-stone-at-exactly-2233-on-xmas-eve-416598",
        "title": "<b>Harry</b> Potter fans urged to start watching Philosopher’s Stone at exactly 22:33 on Xmas Eve",
        "description": "Fans have spotted somethingHarry Potter fans are being urged to watch Harry Potter and the Philosopher’s Stone at 10:33pm"
    },
    {
        "url": "https://graziadaily.co.uk/life/tv-and-film/carole-middleton-eve-best-the-crown/",
        "title": "Who Plays Carole Middleton in The Crown?",
        "description": "Eve Best&#39;s newest role will see her swapping dragons for royalty. Where was she born? What else has she starred in? Who will she play in The Crown? Read more on Grazia."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-secret-31713948",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;secret message&#39; in their simple Christmas card",
        "description": "Prince Harry and Meghan Markle recently released their 2023 Christmas card, which features a picture of them having fun at the Invictus Games closing ceremony in Germany"
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/top-30-news-stories-2023-28319045",
        "title": "How well have you paid attention to the news in 2023? Take this quiz to find out",
        "description": "Some of the top favourite stories of this year have included King Charles III&#39;s Coronation, and Boris Johnson resigning as MP, according to research"
    },
    {
        "url": "https://goss.ie/featured/meghan-markle-makes-surprise-return-to-acting-363141",
        "title": "Meghan Markle makes surprise return to acting",
        "description": "Meghan Markle made her surprise return to acting as she appeared in a new ad for coffee company Clevr Blends. The Duchess of Sussex split opinion when she popped up on their screens to promote a company she previously invested in."
    },
    {
        "url": "https://www.scotsman.com/read-this/this-quiz-will-reveal-if-youve-been-paying-attention-to-2023-news-4452264",
        "title": "This quiz will reveal if you&#39;ve been paying attention to 2023 news",
        "description": "Test your knowledge of the best stories of 2023 with this topical quiz that includes questions covering the Rugby World Cup, the Barbie movie, the new song by The Beatles, and more - have you been paying attention?"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/mother-and-baby/509816/prince-archie-cute-bobble-hat-photo-like-dad-prince-harry/",
        "title": "<b>Prince</b> Archie is like a young <b>Prince Harry</b> with cute bobble hat and red hair",
        "description": "In the photo, which is a little blurred, Archie wears a beige hooded top and a matching bobble hat. The youngster looks adorable with his red hair and brown eyes, with many fans comparing him to Prince Harry. One commented: “Beautiful! Is mini Harry,” and another said: “Harry&#39;s double.”"
    },
    {
        "url": "https://metro.co.uk/2023/12/20/meghan-markle-stars-extra-christmas-advert-coffee-company-20001521/?ico=trending-module_category_uk_item-6",
        "title": "Meghan Markle stars as extra in Christmas advert for coffee company",
        "description": "The Duchess of Sussex has yet again jumped in to help a friend, featuring in a Christmas advert. Meghan Markle appeared in the Instagram ad for Clevr Blends, a California-based ‘wellness brand’. Wearing a casual outfit, the royal is seen pacing around with a laptop, making hot drinks and stacking boxes in their warehouse."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-released-120500841.html",
        "title": "So <b>Prince Harry</b> and Meghan Markle have released their Christmas card for this year...",
        "description": "As we creep towards Christmas Day, the royals are revealing their Christmas cards – and now, we’re getting our first look at the Sussex’s offering."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/how-will-the-royals-spend-christmas-2023-b1127672.html",
        "title": "A Christmas like no other: how the royal family will spend the big day",
        "description": "Prince Andrew and Fergie are in, as are Camilla&#39;s children and grandchildren, but Harry and Meghan are categorically not invited to Sandringham this year. Luciana Bellini reports"
    },
    {
        "url": "https://www.bbc.com/news/uk-41020001",
        "title": "<b>Prince Harry</b>&#39;s struggle with Princess Diana&#39;s last moments",
        "description": "It is almost 20 years since Diana, Princess of Wales died in Paris. Prestwick Care CEO Bunty Malhotra is captured by hidden camera during a Panorama investigation. The Archbishop of Canterbury described the moment as a &quot;glitch&quot; in exclusive footage from an upcoming documentary."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/509747/prince-harry-and-meghan-markle-windsor-family-tradition-christmas-archie-lilibet/",
        "title": "<b>Prince Harry</b> and Meghan Markle continue &#39;Windsor family tradition&#39; at Christmas with <b>Prince</b> Archie and Princess Lilibet",
        "description": "This tradition of the royals exchanging gifts on Christmas Eve was popularised by Queen Victoria and Prince Albert thanks to the royal family&#39;s German ancestry. It&#39;s known as Heiligabend Bescherung - which translates as Christmas Eve exchanging presents."
    },
    {
        "url": "https://bylinetimes.com/2023/12/19/piers-morgans-statement-on-the-prince-harry-phone-hacking-case-annotated/",
        "title": "Piers Morgan’s Statement on the <b>Prince Harry</b> Phone Hacking Case – Annotated",
        "description": "Dr Evan Harris, former Director of Hacked Off and now a legal analyst to the successful claimants against Mirror Group Newspapers over phone hacking and other unlawful information gathering, deconstructs former Daily Mirror editor Piers Morgan’s statement on the damning judgement against the firm last week."
    },
    {
        "url": "https://uk.movies.yahoo.com/did-catch-hidden-message-prince-223205817.html",
        "title": "Did You Catch the Hidden Message In <b>Prince Harry</b> and Meghan Markle’s Holiday Card?",
        "description": "But there’s a detail of the Sussex holiday card you may have missed, a body language expert told The Daily Express. Darren Stanton believes that, while the card may look more “corporate,” that Harry and Meghan are subtly communicating their happiness to the public. (In the photo, both beam widely.)"
    }
]