[
    {
        "url": "https://www.instyle.com/kate-middleton-prince-william-moving-on-8420117",
        "title": "Kate Middleton and <b>Prince</b> William Have Reportedly“Moved on” From Rift With <b>Prince Harry</b> and Meghan Markle",
        "description": "After years of royal family drama, sources say Kate Middleton and Prince William, the Prince and Princess of Wales, are moving on. Get the details here."
    },
    {
        "url": "https://www.lbc.co.uk/news/explained/biggest-royal-family-stories-2023/",
        "title": "From Spare to King Charles&#39; Coronation: Here are the biggest royal stories of 2023",
        "description": "It has been a tumultuous year for the royal family, the first the Firm has had to endure without Queen Elizabeth II at the helm."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/adorable-friendship-formed-between-prince-31757740",
        "title": "Adorable friendship formed between <b>Prince</b> William and Zara Tindall&#39;s kids",
        "description": "The Prince and Princess of Wales&#39; children have developed a loving friendship with Zara and Mike Tindall&#39;s kids."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-stormed-huff-over-31647607",
        "title": "<b>Prince Harry</b> &#39;stormed off in a huff&#39; over fan&#39;s Christmas request, claims royal expert",
        "description": "Prince Harry dated Cressida Bonas on and off from 2012 to 2014, but the pair parted ways on good terms, as she attended the couple’s star-studded wedding in 2018"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/what-awaits-the-royal-family-in-2024-a-psychic-answers_art20578.html",
        "title": "What awaits the Royal Family in 2024? A psychic answers",
        "description": "As 2023 comes to a close, many choose to look back but it is also the chance to look forward. This is what this psychic has done for the Royal Family. Let’s see what they have to"
    },
    {
        "url": "https://www.plymouthherald.co.uk/news/plymouth-news/plymouth-veteran-turns-life-around-9000237",
        "title": "Plymouth veteran turns life around after desperate plight",
        "description": "Former soldier Chris survived active service and a career-ending leg injury. He’s also survived drug and alcohol addiction and sleeping rough. He’s a walking, breathing example of how someone can turn their life around."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849548/expert-says-prince-harry-and-meghan-markle-s-last-royal-christmas-was-staged",
        "title": "Inside <b>Prince Harry</b> and Meghan Markle&#39;s &#39;staged&#39; last royal Christmas as cracks showed",
        "description": "An expert claims the pair gave a series of &#39;powerful clues&#39; that all was not well in their relationship with the Royal Family."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/football/article-12903843/Paddy-McGuinness-Jaeger-Prince-Harry-date-spot-Fernandos-Soccer-Aid-bash-TV-star-Stick-Football-Brazilian-legends-Greggs.html",
        "title": "Paddy McGuinness recalls how Jager-drinking <b>Prince Harry</b> asked to go to Take Me Out date spot Fernando&#39;s during swanky Soccer Aid bash... as TV star tells Stick to Football how ...",
        "description": "The television host and comedian appeared on the Stick to Football Show alongside Gary Neville, Jamie Carragher, Roy Keane and Ian Wright."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849340/royal-family-live-prince-harry-meghan-markle-christmas",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan Markle dealt blow as royals in &#39;united front&#39;",
        "description": "Prince Harry and Meghan Markle have been shown in exact opposition to the Royal Family in the UK as they struggle to claw back."
    },
    {
        "url": "https://ca.finance.yahoo.com/news/king-charles-queen-camillas-wedding-200000235.html",
        "title": "What Was King Charles and Queen Camilla&#39;s Wedding Really Like?",
        "description": "Camilla wore two different looks for the duo of events—a white dress and coat with a wide-brimmed white Phillip Treacy hat for the civil service, and a long blue-gray coat with gold embroidery and a gold feathered headpiece for the religious ceremony. Following the wedding, she officially took up the title of Duchess of Cornwall."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25170542/adorable-moment-george-corrects-william-coronation/",
        "title": "Adorable moment <b>Prince</b> George corrects <b>Prince</b> William in royal documentary as they practised for the Coronation",
        "description": "ROYAL fans have spotted the adorable moment Prince George sweetly corrected Prince William as they practised for the Coronation. In a new BBC documentary, the 10-year-old prince joined his parents"
    },
    {
        "url": "https://uk.news.yahoo.com/kate-middleton-moved-drama-prince-140000656.html",
        "title": "Kate Middleton Has &#39;Moved on&#39; from Drama with <b>Prince Harry</b> and Meghan Markle, Says Friend (Exclusive)",
        "description": "As future queen, royal author Valentine Low tells PEOPLE that Kate &quot;has the longterm interests of the monarchy and royal family at heart&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-prince-harrys-charity-31753509",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s charity work - from huge donation to pop-up boutique",
        "description": "Meghan Markle and Prince Harry have been known to give back over the course of their careers, with the couple having supported various charities and initiatives again this year"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harrys-relationship-120500916.html",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s Relationship Timeline",
        "description": "Prince Harry and Meghan Markle &#39;s love story is the stuff of real-life fairytales. Girl meets prince — prince falls in love with girl; girl becomes princess. However, Meghan and Harry&#39;s happily-ever-after didn&#39;t exactly end as one might expect."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-williams-awful-gift-wife-31754483",
        "title": "<b>Prince</b> William&#39;s &#39;awful&#39; gift for wife Kate did not go down well",
        "description": "Kate Middleton has been treated to some incredible gifts over the years from her family but one present in particular from her husband Prince William did not go down well"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/prince-harry-dominic-west-the-crown-b2469964.html",
        "title": "The Crown star Dominic West says <b>Prince Harry</b> no longer talks to him",
        "description": "Dominic West has explained why he no longer speaks to Prince Harry despite the pair becoming friendly during a charity trek in 2013."
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/king-charles-replaced-prince-harry-8999254",
        "title": "King Charles &#39;replaced <b>Prince Harry</b>&#39; in important family role this Christmas",
        "description": "King Charles reportedly took on an important family tradition that usually used to be Prince Harry&#39;s job. His majesty is believed to have taken on the jokester role, leaving the Royal Family in hysterics."
    },
    {
        "url": "https://www.bbc.co.uk/culture/article/20231222-prince-harrys-spare-gwyneths-trial-and-try-that-in-a-small-town-11-of-the-most-controversial-culture-moments-of-2023",
        "title": "<b>Prince Harry</b>&#39;s Spare, Gwyneth&#39;s trial and Try That In a Small Town: 11 of the most controversial culture moments of 2023",
        "description": "Among all the highs and lows of the year in the arts, here are the people, works and incidents that really got everyone talking."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12903229/Inside-Prince-Williams-bromance-Mike-Tindall-Future-King-live-vicariously-fun-loving-ex-rugby-star-royal-expert-claims.html",
        "title": "Inside <b>Prince</b> William&#39;s &#39;bromance&#39; with Mike Tindall: Future King can &#39;live vicariously&#39; through fun-loving ex-rugby star, royal expert claims",
        "description": "Speaking to The Telegraph , Royal biographer Ingrid Seward, editor in chief of Majesty magazine, said that MIke&#39;s &#39;sportsman camaraderie&#39; appeals to William who was &#39;once a wild boy&#39;."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/inside-harry-meghans-christmas-california-31753660",
        "title": "Inside <b>Harry</b> and Meghan&#39;s Christmas in California from &#39;magnificent&#39; tree to new rituals",
        "description": "The Duke and Duchess of Sussex last spent the festive period with the Royal Family on the Sandringham Estate in 2018 and are now spending the festive period in California"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/psychic-who-predicted-covid-expects-31754085",
        "title": "Psychic who &#39;predicted Covid&#39; expects &#39;heartache&#39; for Meghan and royal scandal in 2024",
        "description": "Nicolas Aujula expects another stressful year for the Firm and a huge milestone for Donald Trump, while he believes &#39;extreme, far-right politics will make a dark comeback&#39; in 2024."
    },
    {
        "url": "https://uk.news.yahoo.com/crowns-dominic-west-explains-why-090431033.html",
        "title": "The Crown&#39;s Dominic West Explains Why He And Former Friend <b>Prince Harry</b> No Longer Speak",
        "description": "The Crown star Dominic West has claimed he inadvertently upset Prince Harry after revealing “too much” about one of their past encounters during an interview."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25141424/royal-family-predictions-2024-psychic/",
        "title": "Astrologer tells what’s in store for the royals in 2024 &amp; claims what will happen between ‘rifting’ Kate &amp; Meghan",
        "description": "FROM rows and interviews, to a seemingly never-ending stream of events, 2023 has been full of surprises for the royals. But as we’re leaving the year behind and heading into 2024, a psychic"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/sarah-ferguson-royal-funeral-burial-frogmore-b2469848.html",
        "title": "Sarah Ferguson ‘granted royal funeral’ by late Queen ahead of Christmas reconciliation",
        "description": "The Queen is said to have permitted a St George’s Chapel Windsor funeral for the Duchess of York followed by internment at the royal burial ground in nearby Frogmore"
    },
    {
        "url": "https://www.ibtimes.co.uk/what-dominic-west-said-prince-harry-that-ended-their-friendship-1722396",
        "title": "What Dominic West Said Of <b>Prince Harry</b> That Ended Their Friendship",
        "description": "The actor told reporters that the royal told shockingly &quot;rude&quot; jokes during their 2013 expedition to the South Pole."
    },
    {
        "url": "https://www.newstalkzb.co.nz/news/entertainment/source-reveals-if-kate-and-meghan-will-ever-reconcile/",
        "title": "Princess Kate and Meghan Markle are unlikely to reconcile according to inside source",
        "description": "Four years after Prince Harry and Meghan Markle resigned from all royal duties, a friend of Princess Kate has revealed whether there is any chance of recon"
    },
    {
        "url": "https://www.thedailybeast.com/dominic-west-says-prince-harry-no-longer-speaks-with-him-i-said-too-much",
        "title": "‘The Crown’ Actor Says <b>Prince Harry</b> No Longer Speaks to Him: ‘I Said Too Much’",
        "description": "He said his friendship with the Duke of Sussex ended after he spoke during a press conference about a trip to Antarctica the pair went on in 2013."
    },
    {
        "url": "https://www.btimesonline.com/articles/162911/20231228/prince-william-eyes-more-monarchy-control-while-honoring-king-charles.htm",
        "title": "<b>Prince</b> William Eyes More Monarchy Control While Honoring King Charles",
        "description": "Prince William is navigating a complex path, desiring more influence over the institution while unequivocally supporting his father, King Charles&#39;s reign."
    },
    {
        "url": "https://www.btimesonline.com/articles/162910/20231228/prince-harrys-stand-for-security-in-the-uk-sparks-royal-controversy.htm",
        "title": "<b>Prince Harry</b>&#39;s Stand for Security in the UK Sparks Royal Controversy",
        "description": "As the legal tangle over Prince Harry&#39;s right to police protection in the UK continues, the Duke of Sussex has reportedly taken a firm stance, asserting that he won&#39;t return without the security arrangements he believes he&#39;s entitled to."
    },
    {
        "url": "https://pagesix.com/2023/12/27/royal-family/kate-middleton-prince-william-have-moved-on-from-prince-harry-meghan-markle-drama/",
        "title": "Kate Middleton, <b>Prince</b> William have ‘moved on’ from <b>Prince Harry</b>, Meghan Markle drama: ‘They aren’t looking back’",
        "description": "The Prince and Princess of Wales’ strained relationship with Meghan and Harry began in 2020 when the latter famously resigned from their royal duties."
    },
    {
        "url": "https://pagesix.com/2023/12/27/royal-family/european-royal-scandals-top-prince-harry-and-meghan-markle/",
        "title": "Who needs ‘The Crown’? Meet the royals with love secrets, family plots, deleted selfies, and a shaman",
        "description": "Popularity has dipped in the wake of this latest scandal but it is offset by excitement about the heir to the throne, the photogenic heiress to the throne, Crown Princess Leonor of Asturias, who caused “Leonormania” last month when she pledged allegiance to the Spanish constitution on her 18th birthday."
    },
    {
        "url": "https://www.detroitnews.com/story/entertainment/books/2023/12/27/ranking-the-12-biggest-bombshells-from-2023-celebrity-memoirs-by-harry-britney-barbra-jada-and-more/72037496007/",
        "title": "Ranking the 12 biggest bombshells from 2023 celebrity memoirs by <b>Harry</b>, Britney, Barbra, Jada and more",
        "description": "With these memoirs came bombshells — about the celebrities themselves or about other famous people in their orbit. These revelations ranged from fun surprises to head-turning confessions. Some revelations also dealt with upsetting stories about painful private moments."
    },
    {
        "url": "https://www.nbcnewyork.com/entertainment/entertainment-news/the-crown-dominic-west-details-fallout-with-prince-harry/4984733/",
        "title": "‘The Crown&#39;s Dominic West details fallout with pal <b>Prince Harry</b>",
        "description": "While West, who was joined by costar Jonathan Pryce in the interview, didn&#39;t elaborate further on his and Harry&#39;s falling out, he appeared to be referencing comments he made in 2014 about the group&#39;s rowdy celebrations after finishing their journey to the Arctic."
    },
    {
        "url": "https://www.aol.com/why-does-prince-william-last-160000287.html",
        "title": "Why Does <b>Prince</b> William Use the Last Name Wales in The Crown?",
        "description": "The prince used the surname Wales throughout his school and military careers, but it&#39;s not the royal family&#39;s last name."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142277-prince-william-princess-kate-hold-future-of-royal-family-in-their-hands",
        "title": "<b>Prince</b> William, Princess Kate hold future of royal family in their hands",
        "description": "Prince William, the heir to the throne, and his wife Kate Middleton are the most liked royals. And royal commentators and historians believe that the future of the monarchy does rest on the Prince and Princess of Wales&#39;s shoulders."
    },
    {
        "url": "https://www.outlookindia.com/art-entertainment/dominic-west-s-x-rated-stories-that-caused-prince-harry-to-cut-ties-with-him-news-338994",
        "title": "Dominic West&#39;s X-Rated Stories That Caused <b>Prince Harry</b> To Cut Ties With Him",
        "description": "Hollywood actor Dominic West said Prince Harry got very rowdy on his trip to the South Pole and said he &#39;told filthy jokes while others danced naked&#39;, but his candid admissions didn&#39;t go down well with the royal."
    },
    {
        "url": "https://www.yahoo.com/entertainment/crown-star-dominic-west-says-165319897.html",
        "title": "&#39;The Crown&#39; Star Dominic West Says He ‘Lost Touch’ With <b>Prince Harry</b> Over This Revelation",
        "description": "If there’s anything fans have learned over the past few years is that royal relationships are tricky — one minute you are in, the next minute you are out. That’s what The Crown star, Dominic West, has learned about his friendship and feud with Prince Harry."
    },
    {
        "url": "https://www.etonline.com/the-crown-star-dominic-west-says-he-fell-out-with-prince-harry-because-he-said-too-much-216985",
        "title": "&#39;The Crown&#39; Star Dominic West Says He Fell Out With <b>Prince Harry</b> Because He &#39;Said Too Much&#39;",
        "description": "Dominic West &#39;s chatty ways may have caused him to fall out with his friend, Prince Harry. The actor, who took on the role of Harry&#39;s father, King Charles III, in the final two seasons of The Crown revealed that he hasn&#39;t spoken to his friend in a while."
    },
    {
        "url": "https://nypost.com/2023/12/27/entertainment/mike-tindall-has-filled-the-void-prince-william-lost-in-harrys-absence/",
        "title": "Mike Tindall has ‘filled the void’ <b>Prince</b> William lost in <b>Harry</b>’s absence",
        "description": "Silverman wrote for the Telegraph how Tindall has “filled the void” of Harry’s absence, becoming someone that William can “confide” in. Additionally, the sportsman is seen as an uncle-type figure to the Prince of Wales’ kids, Prince George, 10, Prince Louis, 5, and Princess Charlotte, 8."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/who-is-prince-harry-and-meghan-markles-son-archie-does-he-have-a-title-details-101703691526513.html",
        "title": "Who is <b>Prince Harry</b> and Meghan Markle&#39;s son Archie? Does he have a title? Details",
        "description": "Archie is entitled to the &quot;courtesy title&quot; of Earl of Dumbarton but Prince Harry and Meghan Markle chose not to give him a courtesy title at that time."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1142264-prince-williams-pal-reveals-future-kings-plans-to-control-monarchy",
        "title": "<b>Prince</b> William&#39;s pal reveals future king&#39;s plans to &#39;control monarchy&#39;",
        "description": "King Charles&#39;s eldest son Prince William&#39;s friends have shared their knowledge about the future king&#39;s intentions, claiming the Prince wants &quot;more control&quot; over the monarchy. However, the Prince of Wales&#39;s friends insisted that the heir apparent to the throne would not want to become King while his children were still young."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-gave-prince-archie-one-special-christmas-gift-he-uses-every-day.html/",
        "title": "Queen Elizabeth Gave <b>Prince</b> Archie This 1 Special Christmas Gift He Asks For Every Day",
        "description": "Queen Elizabeth once gave her great-grandson Prince Archie a special Christmas gift. According to Prince Harry, he asks for it every day."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/celebrities/2023/12/27/658c40cb268e3e31148b459b.html",
        "title": "Arnold Schwarzenegger welcomes Christmas alongside his son-in-law Chris Pratt",
        "description": "Arnold Schwarzenegger recently extended a warm welcome to Christmas alongside his son-in-law, Chris Pratt, sharing the festive spirit with a family photo. The snapshot featured b"
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-swipe-brits-royal-christmas-prince-george-1855735",
        "title": "Meghan Markle&#39;s Swipe at Brits Undermined by Royal Christmas",
        "description": "Meghan Markle&#39;s account of hugs being &quot;really jarring for a lot of Brits&quot; has been challenged after pictures of Prince George being embraced by an in-law at Christmas emerged."
    },
    {
        "url": "https://www.tvinsider.com/1116318/the-crown-dominic-west-prince-harry-falling-out-explained/",
        "title": "‘The Crown’ Star Dominic West Addresses Fallout With <b>Prince Harry</b>",
        "description": "West played Harry’s father, Prince Charles (now King Charles), in the final two seasons of Netflix ‘s The Crown. However, the pair had seemingly fallen out before West took over the role; therefore, he wasn’t able to ask the prince for any advice."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-says-rumors-kate-140000342.html",
        "title": "<b>Prince Harry</b> Says the Rumors About Kate Middleton’s Engagement Ring Are ‘Absolute Rubbish’",
        "description": "It’s no secret that Kate Middleton’s blue sapphire engagement ring used to belong to her late mother-in-law, Princess Diana. But according to Prince Harry, the rumors about how Prince William obtained the ring are completely false."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-replaced-king-charles-31753403",
        "title": "<b>Prince Harry</b> &#39;replaced&#39; by King Charles in key family role at Christmas",
        "description": "Prince Harry&#39;s absence from festive celebrations has given the King a chance to let his humour shine with a cheeky Christmas tradition that leaves the Royal Family in fits of laughter."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/27/royal-family-2023-year-key-events-coronation-charles-sussex/",
        "title": "How the Royal family survived 2023",
        "description": "If 2022 was a year of dramatic change for the Royal family, 2023 has felt steadier – but as ever, there has been light and shade"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/the-best-memes-and-moments-of-2023_uk_65856e79e4b03e698a12de53",
        "title": "The Best Memes And Moments Of 2023",
        "description": "From Rihanna’s Super Bowl performance to girl dinner and girl math, the year brought us dozens of hilarious, fun and relatable things to obsess over on the internet."
    },
    {
        "url": "https://www.theargus.co.uk/news/23980265.map-shows-sussex-film-locations-including-crown-harry-potter/",
        "title": "Map shows Sussex&#39; film locations including The Crown and <b>Harry</b> Potter",
        "description": "The holiday period is often a time for families to sit down and watch a film together – and you might just spot some of Sussex’s landmarks"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-threw-fit-ended-31751737.amp",
        "title": "<b>Prince Harry</b> &#39;threw a fit&#39; and &#39;ended friendship&#39; with Dominic West over actor&#39;s stories",
        "description": "Dominic West said he and Prince Harry are no longer friends after he exposed Harry&#39;s unsavoury behaviour on a trip to the South Pole"
    },
    {
        "url": "https://www.ok.co.uk/royal/crowns-dominic-wests-rude-stories-31752866",
        "title": "The Crown&#39;s Dominic West&#39;s rude stories that meant <b>Prince Harry</b> cut ties with him",
        "description": "Dominic West has opened up about his fallout with Prince Harry after the pair went on a trip to the South Pole together and the actor spilled the beans on their antics"
    },
    {
        "url": "https://www.ok.co.uk/royal/adorable-moment-king-charles-rubbishes-31752750",
        "title": "Adorable moment King Charles kisses <b>Prince</b> Louis - rubbishing <b>Prince Harry</b>&#39;s claim",
        "description": "King Charles has been spotted hugging and kissing Prince Louis in footage shown in a new BBC documentary, after Prince Harry claimed his dad &quot;never gives hugs&quot;"
    }
]