[
    {
        "url": "https://www.mirror.co.uk/news/royals/royal-family-shuts-door-prince-32026750",
        "title": "Royal Family &#39;shuts the door&#39; on <b>Prince Harry</b> and Meghan Markle with tight-lipped tactic",
        "description": "The Royal Family have &#39;no space&#39; for Prince Harry and Meghan Markle anymore, according to Princess Diana&#39;s former butler, who claims the Firm now have a new tactic to deal with them"
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-heading-201710043.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Are Heading to Canada This Month for a Special Celebration",
        "description": "Meghan Markle and Prince Harry are heading to Canada for an exciting countdown."
    },
    {
        "url": "https://www.instyle.com/meghan-markle-prince-harry-netflix-movies-series-8557600",
        "title": "Meghan Markle and <b>Prince Harry</b> Have So Many New Projects at Netflix",
        "description": "Netflix&#39;s content chief Bela Bajaria shared details about Meghan Markle and Prince Harry&#39;s upcoming projects with the streamer."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862275/Prince-Harry-Meghan-Markle-canada-invictus-games",
        "title": "<b>Prince Harry</b> and Meghan Markle to return to Canada in just a few weeks time",
        "description": "Prince Harry and Meghan Markle first spent some month living in Canada when they quit the Royal Family in 2020."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/netflix-obliterated-cancelled-february-b2489078.html",
        "title": "Netflix Top 10 mainstay cancelled after one season",
        "description": "Netflix has cancelled action-comedy series Obliterated after just one season, which came out only a few months ago on 30 November. The series spent six weeks in the Netflix Top 10 for English-language series, peaking at No 1 in Week 2."
    },
    {
        "url": "https://uk.movies.yahoo.com/netflix-chief-teases-meghan-markle-190919166.html",
        "title": "Netflix Chief Teases Meghan Markle and <b>Prince Harry</b>&#39;s Upcoming Projects, from Movie to Unscripted Shows",
        "description": "Chief Content Officer Bela Bajaria shared what the Duke and Duchess of Sussex are working on at the Next on Netflix event"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/01/prince-harry-meghan-new-documentaries-netflix/",
        "title": "<b>Prince Harry</b> and Meghan ‘set to release new Netflix documentaries’",
        "description": "The Duke and Duchess of Sussex are also working on a scripted television series and a film adaptation as part of their $100m deal"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033967/Anti-monarchy-Jamaican-PM-Andrew-Holness-breaks-silence-Harry-Meghan-visit-Caribbean-country-royal-row.html",
        "title": "&#39;I didn&#39;t expect to be drawn into UK internal issues!&#39;: Anti-monarchy Jamaican PM Andrew Holness breaks silence on <b>Harry</b> and Meghan after their visit to the Caribbean country ...",
        "description": "Prince Harry and Meghan met Prime Minister Andrew Holness who has previously said he intends to ditch the monarchy and warned Prince William and Kate they&#39;d never rule the island."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/01/harry-and-meghan-the-soft-power-sussexes-still-divide-opinion",
        "title": "<b>Harry</b> and Meghan, the ‘soft power’ Sussexes, still divide opinion",
        "description": "Letters: Desmond Hewitt thinks Hirschman’s hypothesis has played out perfectly, Anna Yu supports them, Colton Richards just sees two people watching a film, while Rosemary Slawinska says Harry’s treat"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-lay-off-kate-middleton-meghan-markle-career-move/",
        "title": "<b>Harry</b> warned to ‘lay off’ Kate as Meghan mulls ‘explosive’ career move",
        "description": "Paul Burrell worked for Princess Diana for more than a decade until her sudden death in 1997, and claimed Harry &#39;has a nerve&#39; to upset his sister-in-law. “I understand why they are upset, because Kate went to great lengths to find out if a royal life was for her and it caused her issues,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512574/prince-harry-meghan-markle-reveal-their-2024-valentine-day-plans-all-the-details/",
        "title": "<b>Prince Harry</b> and Meghan Markle reveal they will spend Valentine&#39;s Day in Canada",
        "description": "The Duke and Duchess of Sussex will be spending Valentine&#39;s Day 2024 celebrating a cause close to their hearts, as they will attend the Invictus Games&#39; One Year to Go event later this month in Canada."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-heart-warming-four-32024401",
        "title": "<b>Prince Harry</b>&#39;s heart-warming four-word remark about George and Charlotte",
        "description": "The Duke of Sussex was very close with his niece and nephew before he left the Royal Family in 2020 and fell out with his elder brother Prince William."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markles-future-32022959",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s future at Netflix revealed before contract expires",
        "description": "Meghan Markle and Prince Harry are facing the end of their Netflix deal, but it seems all is not lost as the streaming service&#39;s chief content officer has made a big announcement"
    },
    {
        "url": "https://www.itv.com/news/2024-02-01/harry-and-meghan-call-for-urgent-change-to-protect-children-on-social-media",
        "title": "<b>Harry</b> and Meghan call for urgent change to protect children on social media",
        "description": "It comes after a US Congressional hearing on the issue where Meta CEO Mark Zuckerberg apologised to parents of children who killed themselves over online abuse. | ITV National News"
    },
    {
        "url": "https://www.standard.co.uk/showbiz/duke-duchess-sussex-netflix-film-documentary-prince-harry-meghan-markle-b1136425.html",
        "title": "Duke and Duchess of Sussex working on a &#39;bunch&#39; of Netflix projects",
        "description": "The Duke and Duchess of Sussex are developing “a bunch” of projects with Netflix including documentaries and a film, according to a senior executive at the streaming giant. The firm’s chief content officer Bela Bajaria told a Hollywood event the couple’s projects include “a couple of unscripted things” and a series."
    },
    {
        "url": "https://uk.news.yahoo.com/harry-meghan-no-parent-keep-154606030.html",
        "title": "<b>Harry</b> and Meghan Say No Parent Can Keep Their Child Safe From Social Media",
        "description": "Andrew Milligan/Pool/ReutersPrince Harry and Meghan Markle have issued an emotional statement saying that parents are powerless to keep children “safe” from social media platforms.The statement on their Archewell website comes after Mark Zuckerberg and other social media CEOs appeared Wednesday before the U."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/the-crown-dominic-west-stayed-in-bed-after-reading-reviews-b1136415.html",
        "title": "The Crown star Dominic West reveals he &#39;stayed in bed for two days&#39; after reading poor reviews",
        "description": "Dominic West revealed that he spent &quot;two days in bed&quot; after reading the reviews for the final season of The Crown."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862166/prince-harry-meghan-markle-power-couple",
        "title": "<b>Prince Harry</b> and Meghan Markle branded &#39;power couple&#39; after important new video message",
        "description": "Prince Harry and Meghan Markle have spoken out again calling for &quot;urgent change&quot; to keep children safe online."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-regret-aimed-attack-32022202",
        "title": "<b>Prince Harry</b> will &#39;regret&#39; aimed attack at Kate Middleton that &#39;left William furious&#39;",
        "description": "The Duke of Sussex appeared to make a veiled dig at his sister-in-law the Princess of Wales during his Netflix docuseries with Meghan Markle."
    },
    {
        "url": "https://uk.style.yahoo.com/vince-mcmahon-gone-more-takeaways-140000815.html",
        "title": "Vince McMahon Is “Gone” and More Takeaways From Netflix’s Press Day",
        "description": "Ahead of next week’s semi-annual Television Critics Association press tour, Netflix staged its own press event Wednesday — dubbed Next on Netflix — at its Tudum Theater in Hollywood. Content chief Bela Bajaria and her top lieutenants,"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/harry-meghan-latest-news-netflix-b2488839.html",
        "title": "<b>Harry</b> and Meghan busy with ‘a bunch’ of new Netflix projects",
        "description": "Shedding light on the future of their deal with Netflix, the company’s chief content officer Bela Bajaria said Harry and Meghan’s Archewell Productions is gearing up to deliver at least three new projects, including a film and “a couple of other unscripted things”."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-meghan-rare-message-child-safety-online/",
        "title": "<b>Harry</b> and Meghan share rare and emotional message as they call for urgent change to child safety online",
        "description": "Prince Harry and Meghan Markle have issued a rare and emotional message on child safety on social media. Harry and Meghan spoke out after chief executives of Meta, TikTok, X and other social media giants gave evidence before the US Senate Judiciary Committee on Wednesday."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25645073/prince-harry-lay-off-kate-middleton-meghan-markle-career/",
        "title": "<b>Prince Harry</b> warned to ‘lay off’ Kate Middleton as Meghan Markle prepares for ‘explosive’ career move, ex butler claims",
        "description": "PRINCE Harry has been warned to “lay off” his sister-in-law Kate Middleton as Meghan Markle gears up to write an “explosive” memoir, according to a former royal butler."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032173/Prince-Harry-Meghan-Markle-new-video-child-online-safety.html",
        "title": "<b>Harry</b> and Meghan release video of Duchess telling families of children who have been victims of cyber bullying that &#39;we all just want to feel safe&#39; as couple front campaign ...",
        "description": "The Duke and Duchess of Sussex released the clip last night which was filmed during their appearance at a World Mental Health Day event in New York on October 10 last year."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25647972/prince-harry-meghan-markle-parenting-children/",
        "title": "<b>Prince Harry</b> and Meghan Markle open up on parenting ‘heartache’ &amp; demand change to ‘keep our children safe’",
        "description": "PRINCE Harry and Meghan Markle have called for an urgent change to “keep our children safe” on social media. The Duke and Duchess of Sussex said they had heard the"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/celebrities/piers-morgan-calls-for-the-presenter-to-be-re-investigated-grow-and-he-has-prince-harry-to-blame_art20988.html",
        "title": "Piers Morgan: Calls for the presenter to be re-investigated grow and he has <b>Prince Harry</b> to blame",
        "description": "TV presenter and journalist Piers Morgan is once again in the spotlight because of his potential involvement in phone hacking. And this time, Prince Harry might be at the"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/01/best-parenting-social-media-meta-tiktok-prince-harry-meghan/",
        "title": "‘The best parenting in the world’ cannot keep children safe from social media, say <b>Harry</b> and Meghan",
        "description": "The Sussexes told tech bosses they need to make changes to keep young people safe, rather than passing ‘the buck of responsibility’"
    },
    {
        "url": "https://www.heart.co.uk/showbiz/where-do-kate-middleton-prince-william-family-home/",
        "title": "Where do Kate Middleton and <b>Prince</b> William live? A look at their family home",
        "description": "Where is Kate Middleton&#39;s family home? How many houses do Kate and Prince William have? Here&#39;s a look inside their portfolio of royal houses."
    },
    {
        "url": "https://nypost.com/2024/02/01/entertainment/netflix-teases-great-meghan-markle-prince-harry-upcoming-projects-as-part-of-100m-deal/",
        "title": "Netflix teases ‘great’ Meghan Markle, <b>Prince Harry</b> upcoming projects as part of $100M deal",
        "description": "Bela Bajaria, Netflix’s Chief Content Officer, revealed what types of projects Prince Harry and Meghan Markle are working on for the streamer under their estimated $100 million deal with the platform. “They have a couple of unscripted things they’re working on with Brandon [Reigg],” Bajaria said, according to People."
    },
    {
        "url": "https://www.tvfanatic.com/2024/02/emily-in-paris-harry-and-meghan-michael-shannon-as-a-us-presiden/",
        "title": "Emily In Paris, <b>Harry</b> and Meghan, Michael Shannon as a US President: Netflix Is All Over the Map With Their 2024 Content Strategy",
        "description": "Netflix announced its slate of new TV series this week. And to say that we&#39;ve got a mixed bag of content ahead would be putting it very, very mildly."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/01/prince-harry-meghan-publicity-jamaica-anti-monarchy-pm/",
        "title": "<b>Harry</b> and Meghan gave Jamaica ‘more publicity’, says anti-monarchy PM",
        "description": "Andrew Holness ‘shrugs off’ controversy over red carpet photo with the Sussexes and says he was ‘very happy’ to see them"
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46611713/meghan-markle-prince-harry-video-child-online-safety-senate-hearing/",
        "title": "Duchess Meghan and <b>Prince Harry</b> Share Video on Child Online Safety Following Senate Hearing",
        "description": "The U.S. Senate Judiciary Committee held a hearing on online child safety in front of an audience of tech giants and parents whose kids have suffered or died due to online abuse"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-online-child-161858513.html",
        "title": "<b>Prince Harry</b> and Meghan: Online child safety ‘transcends division and party lines’",
        "description": "Prince Harry and Meghan, the Duke and Duchess of Sussex, are speaking out following this week’s Senate Judiciary Committee hearing on online child safety, saying the issue “transcends division and party lines."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-hug-32018421",
        "title": "Meghan Markle and <b>Prince Harry</b> hug parents as they speak out over tragic children&#39;s deaths",
        "description": "The Duke and Duchess of Sussex have been seen hugging parents over the loss of children at a mental wellness summit as they called for urgent change to child safety on social media"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/meghan-markle-prince-harry-share-032457586.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Share Emotional Message After Senate Child Safety Hearing",
        "description": "Meghan Markle and Prince Harry are expressing their support following the U.S. Senate Judiciary Committee&#39;s hearing on online safety for children on Wednesday."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/512485/meghan-markle-and-prince-harry-share-important-message-to-parents-on-keeping-kids-safe/",
        "title": "Meghan Markle and <b>Prince Harry</b> share important statement on their Archewell website",
        "description": "The Duke and Duchess of Sussex reacted to a pivotal U.S. Senate Judiciary Committee hearing that took place on Wednesday"
    },
    {
        "url": "https://www.eonline.com/news/1394169/these-secrets-about-harry-styles-will-have-you-late-night-talking",
        "title": "These Secrets About <b>Harry</b> Styles Will Have You Late Night Talking",
        "description": "Let us adore you, Harry Styles. Celebrate the singer turning 30 by looking back at his journey, including his X Factor audition, time in One Direction, Grammy wins and more"
    },
    {
        "url": "https://www.hollywoodreporter.com/tv/tv-news/vince-mcmahon-netflix-content-chief-1235812247/",
        "title": "Vince McMahon Is “Gone” and More Takeaways From Netflix’s Press Day",
        "description": "Ahead of next week’s semiannual Critics Association press tour, Netflix staged its own press event Wednesday — dubbed Next on Netflix — at its Tudum Theater in Ho"
    }
]