[
    {
        "url": "https://metro.co.uk/2024/02/07/man-killed-kidnapped-tortured-scotland-pictured-20242932/?ico=related-posts",
        "title": "First picture of man, 36, killed after being ‘held hostage and tortured’",
        "description": "<b>Prince Harry</b> reduced to &#39;using public hotel&#39; after being snubbed by King Charles Nostradamus&#39; eerie prediction about King Charles’s reign in 2024 ‘Officers are supporting them as we continue our investigation. ‘We believe this was a targeted attack ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/07/prince-william-tom-cruise-top-gun-maverick-slippers/",
        "title": "‘I haven’t got my Top Gun slippers on’: <b>Prince</b> William jokes with Tom Cruise at fundraiser",
        "description": "The Prince caused a fashion stir at the Maverick premiere in 2022 by wearing velvet shoes with fighter jets embroidered on them"
    },
    {
        "url": "https://www.thetimes.co.uk/article/will-prince-william-harry-ever-reconcile-relationship-x83t689wb",
        "title": "Will <b>Prince</b> William and <b>Prince Harry</b> ever speak again?",
        "description": "Many had hoped that Prince Harry’s mercy dash to his father’s bedside would be the start of a rapprochement between the Duke and his brother. Indeed, sources close to the King were eager to stress that the brevity of the visit was not a slight to his younger son,"
    },
    {
        "url": "https://metro.co.uk/2024/02/07/clapham-chemical-attack-suspects-injuries-may-fatal-met-police-say-20241437/?ico=read_full_story_videotrendingbar",
        "title": "Police reveal possible motive for Clapham chemical attack",
        "description": "<b>Prince Harry</b> reduced to &#39;using public hotel&#39; after being snubbed by King Charles Nostradamus&#39; eerie prediction about King Charles’s reign in 2024 Just days ago, ex-police officer Nick Aldworth revealed that Ezedi could ‘already be dead’, explaining ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/harry-kingcharles-cancer-diagnosis-visit-b2492460.html",
        "title": "Inside <b>Prince Harry</b>’s 26-hour flying visit to see Charles that lasted less than an hour",
        "description": "The Duke of Sussex flew 11 hours from LA to see his father after his diagnosis for cancer - but the reunion was brief"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harrys-sad-45-minute-9084682",
        "title": "<b>Prince Harry</b> on his way home to US after brief chat with King Charles",
        "description": "Prince Harry flew back to the US on Wednesday after a brief visit to the UK to see his father King Charles, who was diagnosed with cancer on Monday"
    },
    {
        "url": "https://www.thesun.ie/royals/12154048/prince-harry-secret-vip-suite-heathrow-airport-michelin/",
        "title": "Inside <b>Prince Harry</b>’s ‘secret’ £1.6k-an-hour VIP suite at Heathrow airport – with 96 staff &amp; a Michelin-starred menu",
        "description": "PRINCE Harry flew 5,000 miles this week to be by the side of his dad King Charles after his shock cancer diagnosis. The Duke of Sussex travelled from the US to London and landed at Heathrow"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/everything-prince-harrys-uk-trip-32067175?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b>&#39;s 25 hours in the UK - where he stayed, half hour with King and why he didn&#39;t see William",
        "description": "<b>Prince Harry</b> spent just over 24 hours in the UK after rushing back to his homeland following King Charles&#39; cancer diagnosis. Leaving Meghan Markle behind in their Montecito, California, home with <b>Prince</b> Archie and Princess Lilibet, the Duke of Sussex ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-leaves-u-k-151431231.html",
        "title": "<b>Prince Harry</b> Leaves U.K. 24 Hours After Seeing Dad King Charles But Not <b>Prince</b> William",
        "description": "A royal source said there were &quot;no plans&quot; for Prince Harry and Prince William to get together during the brief trip"
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-prince-harry-returns-la-32069350",
        "title": "<b>Prince Harry</b> flying home after just 25 hours in UK following 30 minute reunion with King",
        "description": "Prince Harry is flying back to wife Meghan Markle and their children in the US after meeting his father, King Charles, for less than an hour following the King&#39;s cancer diagnosis"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/gb-news-slammed-after-journalist-32070007.amp",
        "title": "GB News slammed after journalist claims <b>Prince Harry</b> contributed to King Charles&#39; cancer",
        "description": "GB News viewers were left outraged by one journalist’s suggestion that Prince Harry contributed to King Charles ’ cancer diagnosis. On Monday, Buckingham Palace released a statement announced that the King had been diagnosis with cancer and will undergo immediate treatment."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863923/royal-family-live-prince-harry-king-charles-meeting-cancer",
        "title": "Royal Family LIVE: <b>Prince Harry</b> &#39;will put the past aside&#39; after King Charles visit",
        "description": "Prince Harry had a &quot;brief meeting&quot; with his father hours after touching down at Heathrow following an 11-hour British Airways flight from his home in California - where his wife Meghan Markle and children,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1864156/prince-harry-king-charles-royal-relations",
        "title": "<b>Prince Harry</b>&#39;s &#39;last chance&#39; to fix royal relations if he just does one thing",
        "description": "Prince Harry travelled from California to the UK to see King Charles after learning about his health concerns, fuelling hope that the family could reconcile."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-staying-uk-hotel-2894348?ico=related_article_inline",
        "title": "Where is <b>Prince Harry</b> staying? Reports Duke used London hotel after visiting King",
        "description": "<b>Prince Harry</b> arrived back in the UK yesterday to reunite with his father, King Charles, whose cancer diagnosis was announced by Buckingham Palace on Monday. The Duke of Sussex reportedly arrived at London Heathrow from Los Angeles just after midday on ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-stays-night-london-123612358.html",
        "title": "<b>Prince Harry</b> Stays the Night in London Hotel, <b>Prince</b> William Still Doesn&#39;t &quot;Trust&quot; Him",
        "description": "<b>Prince Harry</b> was not invited to stay with his brother <b>Prince</b> William or on any other royal property after he flew to the U.K. to visit their father King Charles amid his cancer diagnosis. According to various reports, the Duke of Sussex spent Tuesday night ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/prince-harry-flies-back-after-28587355",
        "title": "<b>Prince Harry</b> flies back to US after brief reunion with King Charles following cancer diagnosis",
        "description": "<b>Prince Harry</b> has returned to the US after a quick 24-hour visit to his father, King Charles, after it was announced the monarch had been diagnosed with cancer. The Duke of Sussex flew solo for the trip, leaving his wife Meghan Markle and their two children ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/charles-tom-cruise-prince-of-wales-ellen-white-patron-b2492455.html",
        "title": "Supportive messages for Charles and Kate ‘mean a great deal to us all’ – William",
        "description": "<b>Prince</b> of Wales The heir to the throne was back at work on ... But there was no meeting between the estranged siblings William and <b>Harry</b>, who have had a fractured relationship for a number of years, exacerbated after the Sussexes stepped down as working ..."
    },
    {
        "url": "https://www.herald.co.zw/prince-back-in-london-after-kings-shock-cancer-diagnosis/",
        "title": "<b>Prince</b> back in London after king’s shock cancer diagnosis",
        "description": "London. – Prince Harry has flown back to the United Kingdom to see his father, according to media reports, after the shock announcement on Monday from Buckingham Palace that King Charles III has cancer."
    },
    {
        "url": "https://www.thetelegraph.com/news/world/article/prince-harry-s-visit-to-see-king-charles-iii-18653722.php",
        "title": "<b>Prince Harry</b>&#39;s visit to see King Charles III didn&#39;t bring reconciliation with William",
        "description": "Prince Harry flew more than 5,000 miles to see his father after King Charles III"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68226013?at_link_id=73FC777E-C601-11EE-A8FD-FE2787A28522&at_link_origin=BBC_News&at_link_type=web_link&at_campaign_type=owned&at_medium=social&at_campaign=Social_Flow&at_ptr_name=facebook_page&at_format=link&at_bbc_team=editorial",
        "title": "<b>Prince</b> William grateful for public&#39;s messages of support",
        "description": "The Prince of Wales has expressed his gratitude for &quot;the kind messages of support for Catherine and for my father, especially in recent days&quot;. These were the first public comments from Prince William since the cancer diagnosis for his father,"
    },
    {
        "url": "https://www.birminghammail.co.uk/black-country/prince-williams-makes-emotional-message-28590157",
        "title": "<b>Prince</b> Williams makes emotional message after King Charles&#39; cancer diagnosis",
        "description": "At the London Air Ambulance gala dinner, he was a guest of honour as he reported for duty shortly after the cancer diagnosis of King Charles, his father. The public were thanked by Prince William for supporting the reigning monarch, reports DailyExpress."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13058139/The-monarchys-future-depends-obliteration-Sussexes-royal-biographer-Tom-Bower-tells-Sarah-Vine-Andrew-Pierce-YouTube-talk-Reaction.html",
        "title": "The monarchy&#39;s future depends on the &#39;obliteration of the Sussexes&#39;, royal biographer Tom Bower tells Sarah Vine and Andrew Pierce on their YouTube talk show The Reaction",
        "description": "Tom Bower launched a blistering attack on the Duke of Sussex branding him a &#39;traitor&#39; when discussing his meeting with Charles on this week&#39;s The Reaction, the Mail&#39;s new YouTube talkshow."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13057615/Prince-Harry-William-Charles-cancer-visit-brief-flying-home-MAUREEN-CALLAHAN.html",
        "title": "Now we know: <b>Harry</b> will be totally, irreconcilably cut off when William is King... MAUREEN CALLAHAN&#39;s eviscerating verdict on the brutally brief visit that saw NO brotherly ...",
        "description": "Don&#39;t let the door hit you on the way out. Such is the obvious message from Buckingham Palace - and what&#39;s to come under William&#39;s"
    },
    {
        "url": "https://inews.co.uk/opinion/the-prince-harry-problem-has-suddenly-become-more-urgent-2893325?ico=related_article_inline",
        "title": "The ‘<b>Prince Harry</b> problem’ has suddenly become more urgent",
        "description": "Part of this is down to classic generational patterns. A group of siblings will reach old age together; serious health conditions can reveal themselves in children just as their parents are feeling the first pang of middle age."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/07/prince-harry-returns-to-california-just-24-hours-king/",
        "title": "<b>Prince Harry</b> returns to California just 24 hours after visiting the King following cancer diagnosis",
        "description": "Prince Harry, 39, was seen smiling as he arrived at Heathrow airport shortly before 1.30pm on Wednesday lunchtime"
    },
    {
        "url": "https://www.scotsman.com/news/national/prince-williams-first-public-comments-since-kings-cancer-diagnosis-we-really-appreciate-everyones-kind-messages-4509623",
        "title": "<b>Prince</b> William&#39;s first public comments since King&#39;s cancer diagnosis: &quot;We really appreciate everyone&#39;s kind messages&quot;",
        "description": "Prince William has thanked the public for their support as he appeared at a charity fundraising event for the London Air Ambulance. In his first public comments since it was revealed the King had been diagnosed with cancer, he said “we really appreciate everyone&#39;s kind messages, thank you”."
    },
    {
        "url": "https://www.scotsman.com/news/national/prince-william-we-really-appreciate-everyones-kind-messages-4509623",
        "title": "<b>Prince</b> William: &quot;We really appreciate everyone&#39;s kind messages&quot;",
        "description": "Prince William has thanked the public for their support as he appeared at a charity fundraising event for the London Air Ambulance. In his first public comments since it was revealed the King had been diagnosed with cancer, he said “we really appreciate everyone&#39;s kind messages, thank you”."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25793580/king-charles-first-public-statement-cancer-diagnosis/",
        "title": "King Charles makes his first public statement since cancer diagnosis &amp; says he’s ‘so sorry he can’t be there’",
        "description": "KING Charles has made his first public statement since his shock cancer diagnosis. Speaking out to mark Grenada’s 50th anniversary of Independence, the King said he sent his “congratulations"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25792092/prince-william-king-charles-kate-tom-cruise/",
        "title": "<b>Prince</b> William thanks well-wishers for supporting King and Kate at charity do where he was joined by Tom Cruise",
        "description": "PRINCE William has hailed the “kind messages” received by the Princess of Wales and King amid their health scares and said “it means a great deal to us all”. Wills, 41, has"
    },
    {
        "url": "https://www.ladbible.com/news/royal-family/king-charles-cancer-health-prince-william-statement-975508-20240205",
        "title": "<b>Prince</b> William speaks out for first time since King Charles&#39;s cancer diagnosis",
        "description": "Prince William gave a statement thanking people for their kind words following news of King Charles&#39;s cancer diagnosis."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/prince-william-speaks-first-time-32072876",
        "title": "<b>Prince</b> William speaks for first time after King&#39;s cancer diagnosis and Kate&#39;s surgery",
        "description": "Prince William has spoken for the first time since it was announced his father, King Charles, has cancer. Prince William has broken his silence and spoken publicly for the first time about King Charles&#39; diagnosis and the Princess of Wales&#39; health."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-william-joins-surprise-guest-193803201.html",
        "title": "<b>Prince</b> William Joins Surprise Guest Tom Cruise at Charity Gala amid Kate Middleton and King&#39;s Health Scares",
        "description": "The Prince of Wales was a guest of honor at the London Air Ambulance gala dinner after a morning spent handing out awards at Windsor Castle"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1864298/prince-harry-meghan-markle-experience-princess-beatrice-eugenie",
        "title": "<b>Prince Harry</b> and Meghan Markle have &#39;more experience&#39; than two royals tipped for promotion",
        "description": "Prince Harry and Meghan Markle have &quot;more experience&quot; than two royals tipped for promotion, sources have claimed. The Duke and Duchess of Sussex stepped down from royal duties at the start of 2020, having lived in the US ever since."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harrys-reunion-king-charles-28589898",
        "title": "Why <b>Prince Harry</b>&#39;s reunion with King Charles was cut short after cancer diagnosis",
        "description": "Prince Harry&#39;s reunion with his father, King Charles, was cut short due to the latter&#39;s recent cancer diagnosis, according to a Royal expert. The Duke of Sussex had flown overnight from the US for a brief meeting with his father before the King had to leave for Sandringham."
    },
    {
        "url": "https://news.sky.com/story/prince-william-speaks-publicly-for-first-time-since-king-charless-cancer-diagnosis-13066291",
        "title": "<b>Prince</b> William speaks publicly for first time since King Charles&#39;s cancer diagnosis",
        "description": "Prince William has referenced the King&#39;s cancer diagnosis for the first time since the announcement by Buckingham Palace on Monday. Arriving at a gala for the London Air Ambulance Service in central London, the Prince of Wales said: &quot;We really appreciate everyone&#39;s kind messages. Thank you&quot;."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/07/prince-harry-king-mark-dyer-prince-william-royal-family/",
        "title": "How <b>Harry</b>’s ‘second dad’ could glue the Royal family back together",
        "description": "As Prince Harry flies home after visiting his sick father, observers believe only one man could help fix the feud that has ruptured the Firm"
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/health-and-fitness/512954/royal-family-unexpected-health-issues-illness-princess-eugenie-meghan-markle/",
        "title": "How royals overcame their unexpected health issues: Princess Eugenie, Meghan Markle and more",
        "description": "While Victoria faced tremendous challenges during her treatment for anorexia, it also led to a life-changing encounter. The royal bumped into her now-husband Prince Daniel, who at the time was a personal trainer, while at the gym for one of her doctor-ordered training sessions."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-william-first-appearance-kate-middleton-surgery_n_65c395e9e4b069b665dd9066",
        "title": "<b>Prince</b> William Makes First Public Appearance After Kate Middleton&#39;s Surgery, King Charles&#39; Cancer News",
        "description": "LONDON (AP) — Prince William returned to royal duties Wednesday for the first time since his father, King Charles III, announced his cancer diagnosis and his wife Kate was hospitalized for abdominal surgery."
    },
    {
        "url": "https://metro.co.uk/2024/02/07/william-speaks-first-time-since-dad-charles-cancer-diagnosis-20242473/?ico=top-stories_news_top",
        "title": "<b>Prince</b> William speaks out for first time since dad Charles’ cancer diagnosis",
        "description": "Prince William has spoken for the first time since his father King Charles was diagnosed with cancer. The king’s eldest son is attending a charity fundraising event for the London Air Ambulance tonight. He told the BBC he was ‘grateful’ for the public support his family has received in recent weeks."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-staying-uk-hotel-2894348",
        "title": "Where is <b>Prince Harry</b> staying? Reports Duke used London hotel after visiting King",
        "description": "Rumours that Harry stayed in a London hotel after visiting the King have yet to be confirmed by spokespeople for either party"
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/harry-arrives-at-heathrow-after-visiting-king-charles-following-cancer-diagnosis",
        "title": "<b>Prince Harry</b> arrives at Heathrow after visiting King Charles following cancer diagnosis",
        "description": "Prince Harry arrived from Los Angeles on Wednesday, and met with his father at Clarence House. | ITV National News"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-broke-huge-rule-32067539?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> &#39;broke huge rule&#39; and ruined bond with Kate Middleton over &#39;snide remarks&#39;",
        "description": "Prince Harry&#39;s once close relationship with his sister-in-law Kate Middleton was ruined by her disapproval of his discussion of private family matters one expert claimed"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/everything-prince-harrys-uk-trip-32067175",
        "title": "<b>Prince Harry</b>&#39;s 25 hours in the UK - where he stayed, half hour with King and why he didn&#39;t see William",
        "description": "Prince Harry has flown from LA to the UK after hearing of his father&#39;s shock cancer diagnosis, with the Duke of Sussex having a jam-packed 24-hours since touching down"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-william-returns-work-prince-harry-lands-uk-1723281",
        "title": "<b>Prince</b> William Returns To Work As <b>Prince Harry</b> Lands In The UK",
        "description": "The Prince of Wales&#39; last public engagement was a visit to Headlingley Stadium in Leeds on Jan. 11 to give Kevin Sinfield and Rob Burrow their CBEs."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/royal-insider-says-prince-harry-28582784",
        "title": "Royal insider says <b>Prince Harry</b> is planning to &#39;spend more time&#39; in England",
        "description": "Prince Harry, the Duke of Sussex, is set to spend more time in the UK after his father King Charles III&#39;s cancer diagnosis revelation, according to a royal insider."
    },
    {
        "url": "https://metro.co.uk/2024/02/07/prince-harry-spends-night-london-hotel-meeting-king-charles-20236611/?ico=trending-module_tag_royal-family_item-0",
        "title": "<b>Prince Harry</b> reduced to ‘using public hotel’ after being snubbed by King Charles",
        "description": "Despite having a plethora of royal palaces and houses at his disposal, Prince Harry chose to spend last night in a luxury hotel, it has been claimed. Rather than staying at Windsor Castle – conveniently located for commuting to Heathrow Airport – the Duke is said to have opted to stay somewhere in central London."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-london-meet-william/",
        "title": "<b>Prince Harry</b> &#39;would have gladly met with <b>Prince</b> William&#39; but spends night &#39;in London hotel&#39; instead",
        "description": "Prince Harry would have &quot;gladly&quot; accepted a meeting with Prince William - but has instead spent the night in a London hotel."
    },
    {
        "url": "https://uk.yahoo.com/news/reason-why-king-charles-harry-083400168.html",
        "title": "Reason why King Charles and <b>Harry</b>’s meeting was so short revealed",
        "description": "The reason why King Charles and <b>Prince Harry</b>’s first face-to-face meeting in nearly a year was so short has been revealed. The Duke of Sussex flew to the UK from California on Tuesday (6 February) to see his father following his cancer diagnosis."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harry-charles-reunion-exclusive-32072331",
        "title": "<b>Prince Harry</b> warned ‘there’s no magic wand to sweep away pain’ as he takes ‘step towards reconciliation’ with Charles",
        "description": "However, despite this marking their first meeting in 16 months, <b>Harry</b>&#39;s visit was very brief and was thought to have lasted only around 30 minutes. While <b>Harry</b> reportedly jumped on a plane from the US, where he lives with wife Meghan Markle, just hours ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-king-charles-reportedly-232218526.html",
        "title": "<b>Prince Harry</b> and King Charles Reportedly Met for a Surprisingly Short Period of Time",
        "description": "The outlet adds that the sit-down was the first time that the father and son have had a face-to-face conversation since Queen Elizabeth&#39;s passing in 2022. Harry and his wife, Meghan Markle, attended King Charles&#39;s coronation last year, but they didn&#39;t interact with Charles of Camilla."
    }
]