[
    {
        "url": "https://uk.news.yahoo.com/prince-harry-honored-living-legend-191658507.html",
        "title": "<b>Prince Harry</b> to Be Honored as a &#39;Living Legend of Aviation&#39; — and John Travolta Is Hosting!",
        "description": "The Duke of Sussex, 39, is among the four people who will be inducted at the 21st Annual Living Legends of Aviation Awards in Beverly Hills on Jan. 19, it was announced on Wednesday. The event, hosted by John Travolta, will honor &quot;those who have made significant contributions to aviation/aerospace.&quot;"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854299/prince-harry-living-legend-hall-of-fame-buzz-aldrin",
        "title": "<b>Prince Harry</b> named &#39;living legend&#39; as he&#39;s inducted into Hall of Fame with Buzz Aldrin",
        "description": "<b>Prince Harry</b> has been named a &quot;living legend&quot; and will be inducted into an aviation hall of fame later this month alongside fabled astronauts Buzz Aldrin and Neil Armstrong. According to Omid Scobie, the biographer who has penned two books on the Duke of ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12948431/Prince-Harry-honoured-21st-Annual-Living-Legends-Aviation-Awards-glitzy-Beverly-Hills-ceremony-hosted-John-Travolta.html",
        "title": "<b>Prince Harry</b> will be honoured at 21st Annual Living Legends of Aviation Awards at glitzy Beverly Hills ceremony hosted by John Travolta",
        "description": "The decorated event - which will be hosted by John Travolta in Beverley Hills, California next Friday - will see the royal inducted alongside other aerospace icons."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1854294/prince-harry-meghan-markle-exposed",
        "title": "<b>Prince Harry</b> and Meghan Markle set to be &#39;completely exposed&#39; in cryptic new prediction",
        "description": "<b>Prince Harry</b> and Meghan Markle are set to face a &quot;bomb&quot; in the spring of this year, as a royal expert claimed the couple would be &quot;completely exposed&quot; in a whole new way. The new year has already begun in shaky fasion for the Sussexes, after Golden Globes ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harrys-spare-wildest-moments-31848007",
        "title": "<b>Prince Harry</b>&#39;s Spare - wildest moments revisited from &#39;frozen todger&#39; to talking toilet",
        "description": "It&#39;s been one year since Prince Harry&#39;s explosive memoir Spare hit bookshelves, and many readers were left stunned by the Royal&#39;s frank candidness about his fascinating and at times complicated life"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510988/prince-harry-ordered-huge-new-honour-star-studded-ceremony/",
        "title": "<b>Prince Harry</b> to be awarded huge new honour in star-studded ceremony – details",
        "description": "Prince Harry is to be honoured at a thrilling ceremony next week, as he is honoured by the 21st Annual Living Legends of Aviation Awards. Taking place in Beverly Hills and hosted by qualified pilot John Travolta,"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/meghan-markle-deliberately-distanced-herself-31851434",
        "title": "Meghan Markle &#39;deliberately distanced&#39; herself from <b>Prince Harry</b>&#39;s Spare after &#39;gentle concerns&#39;",
        "description": "On this day last year, readers were finally able to get their hands on Prince Harry&#39;s bombshell memoir Spare - but his wife Meghan Markle was mysteriously missing from his promotional tour for the boo"
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/king-charles-iii-prince-william-152650139.html",
        "title": "King Charles III &amp; <b>Prince</b> William Are Reportedly at Odds Over <b>Prince</b> Andrew&#39;s PR Mess",
        "description": "Since then, Charles has given Andrew privileges that he didn’t even offer to <b>Prince Harry</b> since their fallout (and alleged sexual abuse and trafficking is a much more heinous situation than revealing royal secrets in a memoir). King Charles’ next steps ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-prince-william-secret-195806196.html",
        "title": "<b>Prince Harry</b> and <b>Prince</b> William Have &#39;Secret&#39; 3-Word Code Used &#39;Only in Times of Extreme Crisis&#39;",
        "description": "&quot;For nearly twenty-five years we’d reserved that soul-crushing vow for times when one of us needed to be heard, to be believed, quickly,&quot; the Duke of Sussex wrote in &#39;Spare&#39; <b>Prince Harry</b>’s memoir Spare was published one year ago today, inspiring a look ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/virginia-giuffre-claimed-jeffery-epstein-184250985.html",
        "title": "Virginia Giuffre Claimed Jeffery Epstein Paid Her $15,000 to Have Sex with <b>Prince</b> Andrew",
        "description": "which is currently eighth behind <b>Prince Harry</b> and Meghan Markle&#39;s two children. However, he no longer uses the style &quot;His Royal Highness&quot; in any official capacity. He recently stepped out for the royal family’s annual Christmas Day church outing to St ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12946129/Nacho-Figueras-Prince-Harry-Zara-Tindall.html",
        "title": "How Nacho Figueras has befriended both <b>Prince Harry</b> and Zara Tindall with his model good looks and effortless charm",
        "description": "The father-of-four, and his wife were seen chatting to Zara and Mike Tindall at the Magic Millions on Australia&#39;s Gold Coast. So how did he become so close to royal cousins?"
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to <b>Prince</b> Andrew",
        "description": "ITV bosses have decided the Duchess of York Sarah Ferguson will not be given a full time presenting role on This Morning after her debut presenting role ended in disaster"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25306054/questions-unanswered-prince-harrys-book-spare/",
        "title": "Five questions still unanswered a year on from <b>Prince Harry</b>’s bombshell book Spare – and biggest fall outs that followed",
        "description": "A YEAR on from the release of Prince Harry’s bombshell book many questions have been left unanswered. The memoir sold 3.2million copies in its first week of publication in ­January —"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25307131/prince-harrys-book-binned-by-readers/",
        "title": "<b>Prince Harry</b>’s book broke sales records… but was binned by readers leaving companies with ‘bookcases full of them’",
        "description": "PRINCE Harry’s book has been binned by readers – leaving companies with “bookcases full of them”. The memoir sold 3.2million copies in its first week of publication in ­January — and"
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-harry-meghan-markle-brutally-mocked-golden-globes-1722633",
        "title": "<b>Prince Harry</b>, Meghan Markle Brutally Mocked At Golden Globes",
        "description": "The Duke and Duchess of Sussex were roasted for getting &quot;paid millions of dollars for doing absolutely nothing&quot; by host Jo Koy."
    },
    {
        "url": "https://www.hellomagazine.com/homes/510979/prince-harry-meghan-markles-garden-at-30-million-home-paradise-for-archie-and-lilibet/",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s never-ending garden at $30 million home is paradise for Archie and Lilibet",
        "description": "When <b>Prince Harry</b> and Meghan Markle moved into their gorgeous mansion in Montecito, California, in June 2020, royal fans were desperate to see more of their home. The Duke and Duchess of Sussex moved in when their eldest <b>Prince</b> Archie was just two years ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-meghan-markle-had-210404415.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Had to Return £7 Million in Wedding Gifts from Fans Because of Little-Known Royal Protocol",
        "description": "Fans flocked to Windsor for <b>Prince Harry</b> and Meghan Markle’s wedding on May 19, 2018—many of them bearing gifts. But, The Mirror reports, royal protocol—and a little-known rule—dictated that many of the gifts had to be returned, the outlet reports."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-william-harry-unwelcome-royals-31811743?int_source=nba",
        "title": "Kate Middleton and <b>Prince</b> William&#39;s &#39;clever move that shows <b>Harry</b> isn&#39;t welcome&#39; in Royal Family",
        "description": "<b>Prince Harry</b> and Meghan Markle are said to be hoping to &#39;reunite with the Royal Family&#39; (Image: Patrick van Katwijk/Getty Images) The royal author also claimed that people in America are &quot;fed up&quot; of <b>Harry</b> and Meghan, saying: &quot;Even in America people are fed up with their constant moaning and want them to do something positive."
    },
    {
        "url": "https://inews.co.uk/opinion/meghan-markle-is-poised-for-her-2024-comeback-2807047?ico=in-line_link",
        "title": "Meghan Markle is poised for her 2024 comeback",
        "description": "So the coming year could be a challenging one for <b>Harry</b> and Meghan. Their Archewell Foundation ... because of — what often looks like a concerted effort to upstage the <b>Prince</b> and Princess of Wales. At the end of yet another tumultuous year on the ..."
    },
    {
        "url": "https://www.palatinate.org.uk/the-abdication-of-queen-margrethe-ii-and-its-implications-for-the-british-royal-family/",
        "title": "The abdication of Queen Margrethe II and its implications for the British Royal Family",
        "description": "Indeed, the slimming down of members not considered working royals may have occurred by default, with <b>Prince</b> Andrew, <b>Prince Harry</b>, and Meghan, Duchess of Sussex, no longer receiving public funding or carrying out royal duties. This changing of the guard ..."
    },
    {
        "url": "https://www.foxnews.com/entertainment/celebrities-leading-mental-health-advocacy",
        "title": "Selena Gomez, <b>Prince Harry</b> and other celebrities leading mental health advocacy",
        "description": "<b>Prince Harry</b> and his wife, Meghan Markle, the Duchess of Sussex, have been a driving force in the mental health advocacy space. Their foundation, Archewell, has partnered with several organizations to promote mental health initiatives, including the launch ..."
    },
    {
        "url": "https://people.com/prince-harry-prince-william-secet-code-word-spare-8424749",
        "title": "<b>Prince Harry</b> and <b>Prince</b> William Have &#39;Secret&#39; 3-Word Code Used &#39;Only in Times of Extreme Crisis&#39;",
        "description": "Prince Harry&#39;s memoir &quot;Spare&quot; was published one year ago today, inspiring a look back at the dramatic passage about the code word he shares with Prince William — and why it &quot;didn&#39;t work.&quot;"
    },
    {
        "url": "https://people.com/virginia-giuffre-claimed-jeffery-epstein-paid-her-15-thousand-dollars-sex-prince-andrew-8424621",
        "title": "Virginia Giuffre Claimed Jeffery Epstein Paid Her $15,000 to Have Sex with <b>Prince</b> Andrew",
        "description": "Virginia Giuffre said Jeffrey Epstein paid her $15,000 to have sex with Prince Andrew, according to court documents unsealed in New York City."
    },
    {
        "url": "https://mynewsla.com/weather/2024/01/10/prince-harry-others-to-be-honored-as-living-legends-of-aviation/",
        "title": "<b>Prince Harry</b>, Others to be Honored as `Living Legends of Aviation’",
        "description": "Prince Harry will be among four people inducted as “Living Legends of Aviation” at the 21st Annual Living Legends of Aviation Awards in Beverly Hills this month, officials said Wednesday. Prince Harry,"
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-news-prince-harry-news-royal-family-news-prince-william-news-101704814937892.html",
        "title": "<b>Prince Harry</b>- Meghan Markle&#39;s neighbours say ‘unimpressed by their soap opera’",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s neighbours are fed up of hearing about the couple. The Duke and Duchess of Sussex stepped down from their royal roles in 2020 and moved to the US. The couple now live in Montecito with their two children <b>Prince</b> Archie and ..."
    },
    {
        "url": "https://www.nytimes.com/2024/01/10/world/europe/eton-college-flooding-toilets.html",
        "title": "Blocked Toilets Close Eton, Boarding School for Britain’s Elite Sons",
        "description": "Flooding and a sewer backup have delayed the start of the new term. Classes at the school, which has educated princes and prime ministers, will move online."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeth-fought-prince-harry-meghan-markle-after-us-move-letter-reveals-imperative-security.html/",
        "title": "Queen Elizabeth Fought For <b>Prince Harry</b> and Meghan Markle After U.S. Move, Letter Reveals: ‘Imperative’ They Have Security",
        "description": "Queen Elizabeth reportedly fought for Prince Harry, Meghan Markle and their children&#39;s protection while in the UK. They left in 2020."
    },
    {
        "url": "https://www.stuff.co.nz/life-style/royals/301037543/a-year-on-from-spare-did-prince-harry-get-the-comeback-he-wanted",
        "title": "A year on from Spare, did <b>Prince Harry</b> get the comeback he wanted?",
        "description": "In the run-up to the release, Prince Harry sat down for “tell-all” interviews, excerpts from the memoir were leaked after copies went on sale in Spain early, and the royal family stayed mostly mum on the rumour mill."
    },
    {
        "url": "https://www.btimesonline.com/articles/163186/20240110/prince-harrys-spare-unintentionally-strengthens-kate-middletons-public-image.htm",
        "title": "<b>Prince Harry</b>&#39;s &#39;Spare&#39; Unintentionally Strengthens Kate Middleton&#39;s Public Image",
        "description": "<b>Prince Harry</b>&#39;s memoir &quot;Spare&quot; has stirred a significant discourse, especially regarding the relationship between Meghan Markle and Princess Kate. A year since its record-breaking release, with sales surpassing three million copies, the book continues to ..."
    },
    {
        "url": "https://metro.co.uk/video/alexander-making-god-trailer-3097823/",
        "title": "Video: Alexander: The Making of a God Trailer",
        "description": "Alexander: The Making of a God is a six part docudrama series that reveals the extraordinary life of Alexander the Great through his radical transformation from warrior prince to living god."
    },
    {
        "url": "https://in.mashable.com/culture/67265/from-prince-harry-to-meghan-markle-and-king-charles-royal-family-drop-their-gta-7-avatars-and-its-ra",
        "title": "From <b>Prince Harry</b> To Meghan Markle And King Charles Royal Family Drop Their GTA 7 Avatars And It’s Rad",
        "description": "All Pics by David Zinyama .This AI content is a work of fiction and is intended solely for entertainment purposes. Any resemblance to real individuals, living or deceased, or to actual events or locations is purely coincidental."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-harry-sweet-fatherhood-moment-130136090.html",
        "title": "<b>Prince Harry</b>’s Sweet Fatherhood Moment Goes Viral After He Snubs Kate Middleton on Her Birthday",
        "description": "<b>Prince Harry</b> won the hearts of millions after a recently surfaced clip of him gushing over his son, Archie, went viral on TikTok. While fans of the royal have praised him for his parenting skills, many took notice of his silence on Kate Middleton’s birthday. In the TikTok video that was first posted on Monday,..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/could-2024-prince-harry-meghan-130000024.html",
        "title": "Could 2024 Be <b>Prince Harry</b> and Meghan Markle&#39;s Year?",
        "description": "With controversial memoir Spare now last year’s news, will the next 12 months mark a fresh chapter for the Sussexes?"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146491-meghan-markle-prince-harry-await-substantial-crisis-in-2024",
        "title": "Meghan Markle, <b>Prince Harry</b> await &#39;substantial crisis&#39; in 2024",
        "description": "Meghan Markle and Prince Harry have been warned of a substantial crisis in 2024 as the couple&#39;s popularity in Hollywood seemingly declines with each passing day. Recently, the Duke and"
    },
    {
        "url": "https://www.newsweek.com/prince-harry-reactions-king-charles-queen-camilla-wedding-viral-video-tiktok-1859434",
        "title": "<b>Prince Harry</b>&#39;s Reactions at Charles and Camilla&#39;s Wedding Spotted by Fans",
        "description": "&quot;I mostly kept my head bowed, eyes on the floor, just as I had during Mummy&#39;s funeral,&quot; Harry wrote of Charles&#39; wedding."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-roast-golden-globes-reputation-1859386",
        "title": "How <b>Prince Harry</b> and Meghan Markle Roast Will Impact their Reputations",
        "description": "Prince Harry and Meghan Markle &#39;s Golden Globes roast &quot;shows they&#39;re relevant&quot; going into a &quot;watershed&quot; year, a PR expert told Newsweek. The Duke and Duchess of Sussex were mocked by host Jo Koy during a monologue in which he discussed Imelda Staunton&#39;s role as Queen Elizabeth II in The Crown."
    },
    {
        "url": "https://uk.news.yahoo.com/man-charged-attempted-murder-following-173137475.html",
        "title": "Man charged with attempted murder following <b>Prince</b> George, B.C. encampment shooting",
        "description": "Five days after a man was found with serious gunshot wounds at an encampment in <b>Prince</b> George, police say the B.C. Prosecution Service has approved charges related to the case. On Wednesday, <b>Prince</b> George RCMP said 39-year-old Fabian James Charlie has been ..."
    },
    {
        "url": "https://www.romania-insider.com/libris-spare-little-prince-best-selling-books-2023",
        "title": "Libris.ro: <b>Prince Harry</b>’s Spare and The Little <b>Prince</b>, best-selling books in 2023",
        "description": "Libris.ro, a leading online bookstore in the Romanian market, sold over 2.5 million products in 2023, and the demand was quite varied. Bestsellers include Prince Harry’s memoir Spare and Antoine de Saint-Exupéry’s The Little Prince."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1146482-high-maintenance-prince-harry-meghan-markle-regret-laughable-attempts",
        "title": "<b>Prince Harry</b>, Meghan Markle in trouble after snubs from royal family, Hollywood",
        "description": "Meghan Markle and <b>Prince Harry</b> might be regretting their attempts to damage the royal family&#39;s reputation after being brutally mocked by their critics. A royal expert has blasted the Duke and Duchess of Sussex for their stunts, claiming that the couple are ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/entertainment/celebrity-life/royals/why-grifters-dig-tarnished-prince-harry-and-meghan-markles-image/news-story/35276fdd32ef5e7f49b960700015eb35",
        "title": "Why ‘grifters’ dig ‘tarnished’ <b>Prince Harry</b> and Meghan Markle’s image",
        "description": "As <b>Prince Harry</b> and Meghan Markle look towards a brighter 2024, one royal expert has claimed “redemption” might be a while off yet. The Duke and Duchess of Sussex were slammed as being “f***** grifters” by a well-known Spotify executive after ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163191/20240111/queen-camillas-podcast-success-overshadows-meghan-markles-spotify-exit.htm",
        "title": "Queen Camilla&#39;s Podcast Success Overshadows Meghan Markle&#39;s Spotify Exit",
        "description": "In contrast, Meghan Markle&#39;s foray into podcasting, a deal she shared with <b>Prince Harry</b>, was discontinued in 2023. &quot;Archetypes,&quot; which hosted celebrities like Serena Williams and Mariah Carey, ended after just one season, following a &quot;mutual decision&quot; with ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-meghan-markle-had-210404415.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Had to Return £7 Million in Wedding Gifts from Fans Because of Little-Known Royal Protocol",
        "description": "Fans flocked to Windsor for Prince Harry and Meghan Markle’s wedding on May 19, 2018—many of them bearing gifts. But, The Mirror reports, royal protocol—and a little-known rule—dictated that many of the gifts had to be returned, the outlet reports."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-snapped-hanging-out-31804642?int_source=nba",
        "title": "<b>Prince Harry</b> snapped hanging out with new Hollywood pals without Meghan Markle",
        "description": "<b>Prince Harry</b> has been spotted rubbing shoulders with Hollywood TV stars in recently-shared snaps with wife Meghan Markle nowhere to be seen. The Duke and Duchess of Sussex have made friendships with many famous faces since leaving the Royal Family to ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/prince-williams-four-word-answer-31825440?int_source=nba",
        "title": "<b>Prince</b> William&#39;s four-word answer after Meghan&#39;s pregnancy announcement at royal wedding",
        "description": "He was on good terms with his brother <b>Prince Harry</b> at the time, however their relationship has taken a turn for the worst in recent years. The Sussexes found out they were expecting their first child in 2018, and decided to break the news to some of the ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-prince-harry-relationship-31811542?int_source=nba",
        "title": "King Charles&#39; brief four-word comment over <b>Prince Harry</b>&#39;s return to UK",
        "description": "<b>Prince Harry</b> stepped down as a working senior royal in 2020 alongside his wife, Meghan Markle (Image: Getty Images) While their initial transition away from royal life seemed to go to plan - with above statements showing support for their alternative endeavours - <b>Prince Harry</b>&#39;s relations with his family in recent years have become slightly rocky."
    },
    {
        "url": "https://www.heraldscotland.com/news/13158435.princes-fly-us-friends-wedding/",
        "title": "Princes fly to the US for friend&#39;s wedding",
        "description": "THE Duke of Cambridge and a newly single <b>Prince Harry</b> will watch one of their closest friends, Guy Pelly, wed in the US at the weekend. The royal brothers are heading to America to be guests as London nightclub owner Mr Pelly marries hotel heiress ..."
    }
]