[
    {
        "url": "https://www.express.co.uk/news/royal/1862828/Prince-Harry-Meghan-Markle-alarming-feedback",
        "title": "<b>Prince Harry</b> and Meghan Markle get &#39;alarming&#39; feedback as TV careers left in tatters",
        "description": "EXCLUSIVE: Americans appears to have lost all interest in Prince Harry and Meghan Markle - with experts branding them a &#39;one trick pony&#39;."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-williams-fallout-started-32039830?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> and William&#39;s fallout - real reason behind brother&#39;s bitter disagreement spanning years",
        "description": "Prince Harry and Prince William have a frosty relationship, and their brotherly bond was badly fractured after the Duke of Sussex made a series of damning allegations in his memoir Spare"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/queen-meghan-prince-harry-b2489949.html",
        "title": "Queen ‘thought Meghan’s wedding dress was too white for a divorcee’",
        "description": "The late Queen thought that the Duchess of Sussex&#39;s wedding dress was &quot;too white&quot; because she had been married before she met Prince Harry, a new book has claimed. Ingrid Seward, the former editor-in-chief of Majesty magazine, wrote in her book My Mother and I that Elizabeth II only revealed her opinion to her closest confidantes."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/meghan-markle-oscars",
        "title": "Will Meghan Markle and <b>Prince Harry</b> be making an appearance at this year&#39;s Oscars?",
        "description": "Nominated alongside The After (Misan Harriman, Nicky Bentham) are: The Wonderful Story of Henry Sugar (Wes Anderson, Steven Rales), Knight of Fortune (Lasse Lyskjær Noer, Christian Norlyk), Invincible (Vincent René-lortie, Samuel Caron), and Red, White and Blue (Nazrin Choudhury, Sara McFarlane)."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-response-descending-down-32038066",
        "title": "<b>Prince Harry</b>&#39;s response to descending down the royal line of succession to the throne",
        "description": "Despite stepping down from his royal duties a few years ago, Prince Harry still remains fifth in line to taking over the throne."
    },
    {
        "url": "https://www.ok.co.uk/royal/queen-elizabeth-worried-four-key-32037409",
        "title": "Queen Elizabeth &#39;worried&#39; about four key moments at Meghan Markle and <b>Prince Harry</b>&#39;s wedding",
        "description": "Prince Harry and Meghan Markle&#39;s wedding ceremony at Windsor Castle was attended by their friends, family and celebrities but Queen Elizabeth was said to have had her &quot;concerns&quot;"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-prince-harry-brutally-32037291",
        "title": "Meghan Markle and <b>Prince Harry</b> brutally downgraded on Royal Family website amid &#39;errors&#39;",
        "description": "Prince Harry and Meghan Markle&#39;s profiles on the website for the Royal Family contain several errors, but the pair have now also been significantly downgraded to the bottom of the page"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1862748/prince-harry-meghan-markle-royal-family-expert",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s overheads &#39;more than their earning potential&#39;",
        "description": "EXCLUSIVE: One royal author has said that the Duke and Duchess of Sussex may face business hardships this year, as they are &#39;headed down a bad path.&#39;"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25696924/prince-harry-williams-feud-started-before-meghan/",
        "title": "<b>Prince Harry</b> and William’s feud began before Meghan, says insider as they reveal row which sparked long-lasting rivalry",
        "description": "PRINCE Harry and William’s feud started before his relationship with Meghan Markle, a palace insider has claimed. Rumours that there was a feud between the Duke of Sussex and the Prince of"
    },
    {
        "url": "https://www.lbc.co.uk/news/queen-meghan-markle-wedding-dress/",
        "title": "Queen Elizabeth thought Meghan&#39;s wedding dress was &#39;too white&#39; in secret remarks to cousin",
        "description": "Queen Elizabeth was critical of Meghan&#39;s wedding dress when she tied the knot with Prince Harry, it has emerged."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13027269/Renowned-anthropologist-met-baby-Archie.html",
        "title": "The day that a world-renowned anthropologist met baby Archie - and the rather tart exchange that followed...",
        "description": "Dr Jane Goodall is renowned the world over as an expert on chimpanzees. But it didn&#39;t take an anthropologist to interpret the very direct signals coming from Harry and Meghan."
    },
    {
        "url": "https://www.tatler.com/article/queen-camilla-reputation-evolution-nations-new-grandmother",
        "title": "The nation’s new grandmother? How Queen Camilla became a figure of appreciation and approval – after years as a target for public disgust",
        "description": "Rising like a phoenix, Queen Camilla has undergone a radical reputational transformation, rising from the ashes of her ‘wicked woman’ status in the 1990s, to a well-liked, truly Queen-like national ma"
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harrys-rift-brother-william-114014734.html",
        "title": "<b>Prince Harry</b>&#39;s rift with brother William &#39;began following heated disagreement over wildlife conservation&#39;",
        "description": "“<b>Harry</b>, on the other hand, was more interventionist. He felt that you need a more hands-on approach to ensure wildlife habitats were securely protected to enact change quickly.” The feud between the two brothers has been well reported since <b>Prince</b> ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-feud-william-conservation/",
        "title": "<b>Harry</b>&#39;s feud with William &#39;pre dates Meghan Markle and originated with a row about conserving elephants in Africa&#39;",
        "description": "The feud between Prince Harry and Prince William pre-dates his relationship with Meghan and took off during a row about conservation."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/grammys-2024-most-memorable-iconic-best-performances-ever_uk_65b8f18ee4b01c5c3a381938",
        "title": "Grammys 2024: 34 Most Memorable Performances That Got The Whole World Talking",
        "description": "Every year, the biggest musicians in the world gather under one roof to find out whether they’ve been honoured with the industry’s biggest accolade – a Grammy. For us mere mortals, though, what gets us most excited are the A-list performances,"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/princes-harry-william-dispute-pre-124243907.html",
        "title": "Princes <b>Harry</b> And William’s Dispute “Pre-dated Meghan’s Arrival,” With Real Reason Revealed",
        "description": "While the feud between royal princely siblings William and Harry was indubitably fueled by the arrival of Meghan Markle in the latter’s life, it has now been revealed that the pair’s dispute pre-dates Harry’s relationship with the Suits actress."
    },
    {
        "url": "https://uk.movies.yahoo.com/nutritionist-royals-puts-her-glam-013000949.html",
        "title": "A Nutritionist to the Royals Puts Her Glam U.K. Townhouse Up for Sale",
        "description": "GP Nutrition founder Gabriela Peacock is asking $27 million for her five-story residence sited in West London&#39;s charming Notting Hill neighborhood."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13039785/Is-real-reason-William-Harry-fell-Palace-insiders-claim-brothers-heated-disagreement-approach-conservation-Harry-met-Meghan-Duke-Sussex-faces-questions-rapes-carried-charity-rangers.html",
        "title": "Is THIS the real reason William and <b>Harry</b> fell out? Palace insiders claim brothers had heated disagreement on approach to conservation BEFORE <b>Harry</b> met Meghan - as Duke of ...",
        "description": "While the Prince of Wales is said to support community-led initiatives to help local people conserve the land, the Duke of Sussex favours a more interventionist approach."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25693934/prince-philip-meghan-markle-duchess-of-windsor/",
        "title": "<b>Prince</b> Philip called Meghan Markle the ‘D.O.W’ after the American divorcee who led Edward VIII to abdicate",
        "description": "PRINCE Philip called Meghan Markle the “D.O.W” after the Duchess of Windsor — the American divorcee who led Edward VIII to abdicate. And he warned the late Queen to be “cautious” of Prince Harry’s"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-suffer-32014568",
        "title": "<b>Prince Harry</b> and Meghan Markle suffer &#39;chaos&#39; behind closed doors as more staff quit",
        "description": "<b>Prince Harry</b> and Meghan Markle are facing more issues after a TV executive within their production company quits. Archewell - which the Duke and Duchess of Sussex set up in 2020 - has worked with some huge companies throughout the years, including Netflix ..."
    },
    {
        "url": "https://uk.yahoo.com/style/prince-harry-allegedly-put-end-130703380.html",
        "title": "<b>Prince Harry</b> Allegedly &quot;Put an End&quot; to Meghan Markle&#39;s Memoir Plans",
        "description": "<b>Prince Harry</b> releasing his memoir Spare almost completely squandered any hopes the Duke of Sussex had of reconciling with the Royal Family, and it sounds like he&#39;s determined not to let something like that happen again. Rumors that Meghan Markle wished to ..."
    },
    {
        "url": "https://nypost.com/2024/02/03/entertainment/prince-philips-nasty-nickname-for-meghan-markle-revealed-book/",
        "title": "<b>Prince</b> Philip’s nasty nickname for Meghan Markle revealed: book",
        "description": "According to Ingrid Seward’s new book, My Mother And I, the Duke of Edinburgh — who died in 2021 — alluded to Markle as the “Duchess of Windsor.”"
    },
    {
        "url": "https://www.yahoo.com/entertainment/meghan-markle-prince-harry-reported-204200611.html",
        "title": "Meghan Markle &amp; <b>Prince Harry</b>’s Reported Valentine’s Day Plans May Show Their Real Focus for 2024",
        "description": "Meghan Markle and Prince Harry’s Valentine’s Day plans are reportedly all business. While it seemed as though Prince William and Kate Middleton will be spending their Valentine’s Day in recovery and bed rest,"
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/03/65beaed9e2704ee7a48b45b4.html",
        "title": "Book reveals <b>Prince</b> Philip&#39;s unflattering nickname for Meghan Markle",
        "description": "Revelations in an upcoming book by royal biographer Ingrid Seward shed light on Prince Philip&#39;s reportedly spiteful nickname for Meghan Markle. In the bombshell excerpt from &quot;My Mo"
    },
    {
        "url": "https://nypost.com/2024/02/03/entertainment/why-prince-william-and-prince-harry-really-had-a-feud/",
        "title": "The real reason for William and <b>Harry</b>’s feud — and it’s not about Meghan Markle",
        "description": "Princes William and Harry appeared to be the closet of siblings before Meghan Markle arrived on the scene in 2016. The Duchess of Sussex has long been seen as the catalyst for the brother’s bitter fall-out — but a new report claims they were already at odds over their differing approaches to charity work."
    },
    {
        "url": "https://www.monstersandcritics.com/celebrity/prince-harry-and-meghan-markle-are-facing-business-hardships-says-royal-author/",
        "title": "<b>Prince Harry</b> and Meghan Markle are facing business hardships, says royal author",
        "description": "Harry and Meghan may be headed for trouble if their business expenses are more than the income they bring in with these deals. Martha McGinnis, the author of 10 Lessons from Harry &amp; Meghan, has a warning for the couple. She worries that they spend more than they take in with their businesses."
    },
    {
        "url": "https://www.sheknows.com/entertainment/articles/2949732/prince-harry-meghan-markle-netflix-deal-new-projects-report/",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle’s Netflix Deal Is Reportedly Still Going Strong With Future Projects",
        "description": "Despite some potential recent setbacks, Prince Harry and Meghan Markle ‘s joint business ventures are still going strong. The couple, who inked a deal with Netflix back in 2020, still have a quite a few projects in store with the streamer."
    },
    {
        "url": "https://radaronline.com/p/prince-philip-spiteful-nickname-meghan-markle-new-book/",
        "title": "<b>Prince</b> Philip Allegedly Had a &#39;Spiteful Nickname&#39; for Meghan Markle, According to New Book",
        "description": "Prince Philip, the late Duke of Edinburgh, allegedly had a spiteful nickname for Meghan Markle, according to a shocking revelation in Ingrid Seward&#39;s upcoming book, My Mother And I, RadarOnline.com has learned."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154296-prince-harry-meghan-markle-to-produce-sequel-of-netflix-docuseries",
        "title": "<b>Prince Harry</b>, Meghan Markle to produce sequel of Netflix docuseries?",
        "description": "Prince Harry and Meghan Markle, who are working on some exciting projects for Netflix, are reportedly planning to drop the sequel of their explosive docuseries amid an intensifying rift with"
    },
    {
        "url": "https://www.wionews.com/entertainment/lifestyle/news-harry-and-williams-dispute-pre-dates-meghan-markles-arrival-in-family-claims-insiders-686725",
        "title": "<b>Harry</b> And William&#39;s dispute pre-dates Meghan Markle&#39;s arrival in family, claims insiders",
        "description": "The longstanding rift between royal siblings Prince William and Prince Harry, often attributed to the arrival of Meghan Markle in Harry&#39;s life, is now revealed to have deeper roots. According to insights from palace insiders reported by The Times of London,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1154294-meghan-markle-prince-harry-decide-to-drop-royal-titles-amid-growing-outrage",
        "title": "Meghan Markle, <b>Prince Harry</b> decide to drop royal titles amid growing outrage?",
        "description": "Prince Harry and Meghan Markle, who have come under fire after their latest stunt in Jamaica, are facing mounting pressure to drop their royal titles.The Duke and Duchess of Sussex have"
    },
    {
        "url": "https://www.btimesonline.com/articles/163731/20240203/royal-health-battles-stir-concern-and-compassion.htm",
        "title": "King Charles, Princess Kate and Sarah Ferguson&#39;s Health Battles Stir Concern and Compassion",
        "description": "The British royal family has faced an unprecedented series of health challenges that have drawn widespread attention and concern."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-says-king-charles-140000798.html",
        "title": "<b>Prince Harry</b> Says King Charles Never Talked to Him About False Paternity Rumors: ‘Wholly Made Up’",
        "description": "PureWow Editors select every item that appears on this page,, and the company may earn compensation through affiliate links within the story You can learn more about that process here. Yahoo Inc. may earn commission or revenue on some items through the links below."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/meghan-markle-and-prince-harrys-spending-problem-concerns-the-palace-how-expensive-is-their-lifestyle-101706965778233.html",
        "title": "Meghan Markle and <b>Prince Harry</b>&#39;s ‘spending problem’ concerns the Palace; How expensive is their lifestyle?",
        "description": "Royal expert Matt Wilkinson dishes that Buckingham Palace actively worries about what will happen when the money runs out."
    },
    {
        "url": "https://www.btimesonline.com/articles/163728/20240203/prince-harry-and-meghan-markle-eportedly-targeted-by-travolta-in-scientology-recruitment-bid.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle Reportedly Targeted by John Travolta in Scientology Recruitment Bid",
        "description": "John Travolta, the iconic actor known for his roles in &quot;Saturday Night Fever&quot; and &quot;Grease,&quot; is reportedly making overtures to Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, with an aim to introduce them to Scientology."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-movie-premiere-appearance-hollywood-podcast-1865591",
        "title": "Why <b>Harry</b> and Meghan&#39;s Latest Appearance Strengthens Ties With Hollywood",
        "description": "The Duke and Duchess of Sussex&#39;s appearance at a red-carpet event boosts their Hollywood credibility, Newsweek&#39;s &quot;The Royal Report&quot; has discussed."
    },
    {
        "url": "https://www.samaa.tv/208739187-royal-family-website-changes-signal-strained-ties-with-prince-harry-and-meghan",
        "title": "Royal family website changes signal strained ties with <b>Prince Harry</b> and Meghan",
        "description": "Despite the major changes within the Royal Family, the official website has been discovered with notable mistakes, raising eyebrows about whether these were inadvertent errors or a deliberate message to the Sussexes."
    },
    {
        "url": "https://www.geelongadvertiser.com.au/entertainment/celebrity-life/royals/prince-philips-secret-nickname-for-meghan-markle-as-new-details-emerge-about-prince-harrys-feud-with-prince-william/news-story/e9e1ab8f4509c950f4fe3d172876b28c",
        "title": "<b>Prince</b> Philip’s ‘secret nickname’ for Meghan Markle as new details emerge about <b>Prince Harry</b>’s feud with <b>Prince</b> William",
        "description": "The feud between Prince Harry and Prince William started before the younger brother’s relationship with Meghan Markle, a palace insider has claimed."
    },
    {
        "url": "https://gamerant.com/harry-potter-pure-bloods-who-married-muggles/",
        "title": "<b>Harry</b> Potter: 7 Pure-Blood Wizards And Witches That Married Muggles",
        "description": "Some important couples were forged in the Wizarding World of Harry Potter, proving that love is not prejudice for pure-bloods and muggles."
    },
    {
        "url": "https://www.newsweek.com/prince-william-watch-prince-harry-latest-drama-carefully-africa-charity-1865925",
        "title": "Why <b>Prince</b> William Should Watch <b>Harry</b>&#39;s Latest Drama Carefully",
        "description": "Criticism of Harry&#39;s involvement with an African conservation charity could have wider ramifications, &quot;The Royal Report&quot; has heard"
    },
    {
        "url": "https://www.twincities.com/2024/02/03/lionel-richie-prince-and-a-grumpy-bob-dylan-the-untold-story-behind-we-are-the-world/",
        "title": "Lionel Richie, <b>Prince</b> and a grumpy Bob Dylan: The untold story behind ‘We Are the World’",
        "description": "“<b>Harry</b> Belafonte called me and said ... As a soloist, Lewis ended up singing a line originally meant for <b>Prince</b>, who’d been invited to take part but didn’t show up — one of the great what-ifs in pop-music lore given <b>Prince</b>’s notorious rivalry ..."
    },
    {
        "url": "https://www.allvipp.com/royals/this-is-how-harry-and-meghan-are-spending-valentine-s-day",
        "title": "THIS Is How <b>Harry</b> And Meghan Are Spending Valentine&#39;s Day",
        "description": "What will Valentine&#39;s Day be like for stars like <b>Prince Harry</b> and Duchess Meghan? The two apparently already have a precise plan for the day of lovers which involves doing what they love most: work! THIS is Valentine&#39;s Day with <b>Harry</b> and Meghan The two ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/dakota-fanning-debbie-harry-stylish-055328487.html",
        "title": "Dakota Fanning, Debbie <b>Harry</b> Make Stylish Seatmates at Marc Jacobs Show",
        "description": "Chloe Sevigny, Sofia Coppola, Winnie Harlow, Hari Nef and Nicky Hilton Rothschild were also spotted at the designer&#39;s RTW Spring 2024 Show"
    },
    {
        "url": "https://dailyhive.com/canada/prince-harry-meghan-markle-coming-vancouver",
        "title": "<b>Prince Harry</b> and Meghan Markle are coming to Vancouver this month — and here&#39;s why",
        "description": "Prince Harry and Meghan Markle could have some Vancouver Valentine&#39;s Day plans, as they&#39;re set to visit the city later this month."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-wants-to-build-bridges-focus-healing-2024-expert-says.html/",
        "title": "<b>Prince Harry</b> Wants to ‘Build Bridges’ and Focus on ‘Healing’ in 2024, Expert Says",
        "description": "<b>Prince Harry</b> still has hardly spent any time with his family in the last few years. He and his wife, Meghan Markle, stepped back from their roles as senior royals back in 2020, and this will be the fourth year since they have taken on any official royal ..."
    },
    {
        "url": "https://www.hola.com/us/royals/20240202355537/meghan-markle-prince-harry-canada-valentines-day-2024/",
        "title": "Meghan Markle and <b>Prince Harry</b> to celebrate Valentine’s Day away from home",
        "description": "<b>Harry</b>, who is the founder of the Invictus Games, announced in 2022 that the 2025 sporting event would take place in Canada. “As Invictus continues to adapt and evolve, I am extremely excited to announce that the Invictus Games Foundation has selected ..."
    },
    {
        "url": "https://www.ilmessaggero.it/en/prince_andrew_and_sarah_ferguson_considering_remarriage_will_it_cleanse_the_duke_s_image-7910780.html",
        "title": "<b>Prince</b> Andrew and Sarah Ferguson Considering Remarriage: Will It Cleanse the Duke&#39;s Image?",
        "description": "Sarah Ferguson, banished by <b>Prince</b> Philip following the separation, was forgiven by the royal family only in 2018, the year in which she participated in the wedding of the Dukes of Sussex, <b>Harry</b> and Meghan. She was not invited to William and Kate&#39;s wedding."
    }
]