[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-accused-making-huge-31998524",
        "title": "Meghan Markle accused of making huge demand &#39;to compete with Kate Middleton&#39;",
        "description": "Meghan Markle and Prince Harry moved into Nottingham Cottage in the grounds of Kensington Palace after they were engaged, but the Duchess of Sussex reportedly had grander ideas"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/kate-middleton-heart-set-different-31998788",
        "title": "Kate Middleton had heart set on different name for <b>Prince</b> George - but didn&#39;t use it",
        "description": "Prince William and his wife welcomed their first child, a son, on 22 July 2013. And they chose an unusual method to decide on his name - George Alexander Louis"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-seeking-second-high-092208997.html",
        "title": "<b>Prince Harry</b> &#39;seeking second High Court phone hacking battle with Mirror newspapers&#39;",
        "description": "Lawyers for the group bringing claims, which include the Duke of Sussex, are making a bid for MGN to pay nearly £2million in costs"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25591827/meghan-markle-prince-harry-archewell-productions-manager-quits/",
        "title": "Blow to Meghan Markle and <b>Prince Harry</b> as key member of Archewell staff quits after string of employees leave",
        "description": "HARRY and Meghan have been hit with a fresh blow after their Archewell Productions manager walked out. The company, which boasts a collaboration with Netflix, was launched in 2020 by the Sussexes"
    },
    {
        "url": "https://www.lbc.co.uk/news/harry-wants-second-trial-mirror-phone-hacking/",
        "title": "<b>Harry</b> wants second trial with Mirror publisher over phone-hacking claims despite winning £140k in December",
        "description": "<b>Prince Harry</b> wants a second phone-hacking trial against the Mirror, despite the newspaper group seeking to recoup £350,000 in legal costs from other complainants in his case. <b>Harry</b> won £140,600 from Mirror Group Newspapers (MGN) in December, with a judge ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/andrew-holness-marlene-malahoo-forte-o-1723081",
        "title": "<b>Prince Harry</b>, Meghan Markle&#39;s Jamaica Visit Sparks Claims Of &#39;<b>Harry</b> &amp; Meghan&#39; Sequel",
        "description": "<b>Prince Harry</b> and Meghan Markle stirred speculations of a new film or TV project in the works when they were pictured alongside a Paramount Pictures executive during the &quot;Bob Marley: One Love&quot; premiere in Jamaica last week. The Duke and Duchess of Sussex ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861090/prince-harry-meghan-markle-archewell-tv-production-boss-quits",
        "title": "<b>Prince Harry</b> and Meghan Markle dealt fresh chaos as Archewell production boss quits",
        "description": "<b>Prince Harry</b> and Meghan Markle have been dealt another blow at their production company after another staff member called it quits. Bennett Levine joined Archewell as a co-ordinator for the company in 2021 - but was promoted to manager in 2022. When he ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13021469/Prince-Harry-Mirror-hacking-trial.html",
        "title": "<b>Prince Harry</b> demands new Mirror hacking trial &#39;as soon as possible&#39; unless his demands for compensation are met",
        "description": "<b>Prince Harry</b> is pursuing a second High Court hacking trial against Mirror newspapers, a court heard yesterday. The Duke of Sussex wants a trial &#39;as soon as possible&#39; unless the group meets his demands for compensation. Meanwhile, two former Coronation ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1861079/royal-family-live-harry-meghan-losing-support",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan Markle are &#39;losing support&#39; in fresh blow",
        "description": "The Sussexes&#39;s surprise appearance in Jamaica could be part of an effort to bolster their flagging Hollywood careers as support collapses."
    },
    {
        "url": "https://uk.news.yahoo.com/traitors-winner-harry-shares-military-093744369.html",
        "title": "Traitors Winner <b>Harry</b> Shares How His Military Training Helped With This 1 Aspect Of The Show",
        "description": "The Traitors winner <b>Harry</b> has revealed his military background came in handy when it came to some of the show’s more difficult moments. Last week, viewers saw <b>Harry</b> scoop the Bafta-winning reality show’s £95,150 prize pot, after serving as one of its ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-king-charles-surgery-hospital-royal-family-b2487051.html",
        "title": "Royal news – live: King Charles leaves hospital hours after Kate returns home from surgery",
        "description": "Before his treatment for his enlarged prostate, Charles took time to visit his daughter-in-law Kate, who was recovering at the hospital after undergoing successful abdominal surgery last week. The pair left the private hospital within hours of each other and are said to be recovering at home."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13021205/EPHRAIM-HARDCASTLE-Dragons-Dens-Steven-Bartlett-diamond-Meghan-Markle.html",
        "title": "EPHRAIM HARDCASTLE: Dragons&#39; Den&#39;s Steven Bartlett is impressed by diamond maker whose jewellery was worn by Meghan Markle",
        "description": "Dragons&#39; Den&#39;s Steven Bartlett was impressed when the Belgian owners of artificial diamond maker Kimai boasted that the Duchess of Sussex had worn their jewellery."
    },
    {
        "url": "https://www.thetimes.co.uk/article/stop-conservation-groups-persecuting-indigenous-people-rsfv36n3k",
        "title": "Stop conservation groups persecuting indigenous people",
        "description": "The calls for <b>Prince Harry</b> to resign from the board of the charity African Parks, after revelations that its rangers have been brutally persecuting the indigenous Baka people in Congo, do not come out of the blue. Survival International has long been ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-hacking-trial-legal-bill-vm790zwgs",
        "title": "<b>Prince Harry</b> demands second hacking trial against Mirror Group",
        "description": "The Duke of Sussex wants a second tabloid hacking trial “as soon as possible” despite the publisher of the Daily Mirror seeking legal costs totalling £350,000 from other celebrity complainants. In December the duke won £140,600 in compensation after ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25586537/prince-harry-royalty-loyalty-charles-hospital/",
        "title": "<b>Harry</b>’s silence over King &amp; Kate’s health must be final nail in coffin of public opinion – we like loyalty from royalty",
        "description": "LITTLE makes Prince Harry happier than a snazzy private jet. Other things that make our Eton-educated duke happy, in no particular order, are money, PR opportunities and slagging off the monarchy"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-phone-hacking-case_n_65b7c28ae4b077c17ab5f106",
        "title": "<b>Prince Harry</b>’s Lawyers Seek $2.5 Million In Fees After Win In Tabloid Phone Hacking Case",
        "description": "LONDON (AP) — A lawyer for Prince Harry asked a judge Monday to order the publisher of the Daily Mirror tabloid to pay nearly 2 million pounds ($2.5 million) for a portion of the legal fees spent to prove that Mirror Group Newspapers invaded his privacy by hacking his phone and using unlawful means to dig up scoops on him."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-urged-step-down-172940807.html",
        "title": "<b>Prince Harry</b> Urged to Step Down from African Parks Board amid Reports of Abuse, Rape by Rangers",
        "description": "African Parks issued a statement saying that an &quot;active, ongoing investigation&quot; into the claims was its &quot;highest priority&quot;"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-phone-hacking-mirror-group-b2486499.html",
        "title": "<b>Prince Harry</b> pursues 115 further phone hacking claims after Mirror victory",
        "description": "A High Court judge found that 15 out of 33 articles were the product of phone-hacking, including articles about his former girlfriend Chelsy Davy"
    },
    {
        "url": "https://news.sky.com/story/prince-harrys-lawyers-want-1632m-in-costs-from-daily-mirror-publisher-13059447?dcmp=snt-sf-twitter",
        "title": "<b>Prince Harry</b>&#39;s lawyers want £2m in costs from Daily Mirror publisher",
        "description": "The lawyers are representing Prince Harry and a number of other high profile figures who have made phone hacking claims against Mirror Group Newspapers (MGN), the publishes of the Daily Mirror."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/29/prince-harry-further-legal-action-mirror-after-court-win/",
        "title": "<b>Prince Harry</b> considers further legal action against Mirror newspapers after court victory",
        "description": "<b>Prince Harry</b> hailed himself a &#39;dragon slayer&#39; after his victory in court over Mirror Group Newspapers Credit: Adrian DENNIS / AFP/Adrian DENNIS / AFP The Duke of Sussex is considering further legal action against Mirror Group Newspapers (MGN) if he is not ..."
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-mirror-hacking-trial-2878307?ico=related_article_inline",
        "title": "Mirror publisher faces £2m legal costs after <b>Prince Harry</b> hacking trial",
        "description": "On Monday, during the latest hearing on the case, the High Court heard the group, whose claims were brought alongside <b>Prince Harry</b>’s, are seeking payment of £1,976,660 from MGN towards legal costs. David Sherborne, barrister for the claimants ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/meghan-markles-loveliness-inspired-suits-resurgence-says-co-star-1723051",
        "title": "Meghan Markle&#39;s &#39;Loveliness&#39; Inspired &#39;Suits&#39; Resurgence, Says Co-Star",
        "description": "She did 100 episodes on the show until season 7, but had to leave acting for good when she married <b>Prince Harry</b> in May 2018. Spencer, on the other hand, appeared throughout the entire run as Dana Scott, the longtime work rival/love interest to Harvey ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-plan-build-bridges-31972393",
        "title": "<b>Prince Harry</b>&#39;s plan to &#39;build bridges&#39; with The Firm after dad&#39;s surgery",
        "description": "After OK! exclusively revealed that <b>Prince Harry</b> has &quot;shut down&quot; Meghan Markle&#39;s plans to write a tell-all book following his own bombshell memoir Spare, sources tell us <b>Harry</b> is on a mission to &quot;build bridges&quot;. After years of apparent discord between ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/prince-harry-charity-investigated-rape-torture-allegations/?n=@",
        "title": "Charity linked to <b>Prince Harry</b> investigated over allegations of rape and torture",
        "description": "Duke of Sussex was president of non-profit African Parks from 2017 until last year, when he was appointed to the organisation’s board of directors Credit: Pool/wireimage A charity linked to <b>Prince Harry</b> is investigating allegations of rape and torture ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24082915.documentary-world-goes-inside-recording-1985-charity-single/",
        "title": "Documentary on We Are The World goes inside recording of 1985 charity single",
        "description": "Netflix documentary The Greatest Night In Pop is a behind-the-scenes look at the creation of We Are The World."
    },
    {
        "url": "https://uk.style.yahoo.com/laurence-fox-loses-libel-case-180211631.html",
        "title": "Laurence Fox Loses Libel Case After Calling Former ‘RuPaul’s Drag Race UK’ Star A Paedophile",
        "description": "Laurence Fox has lost his libel case after calling two people including a former Drag Race contestant “paedophiles” on social media. The actor-turned-politician, who was fired by GB News late last year for highly misogynistic remarks,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-hacking-trial-legal-bill-vm790zwgs?ilc=timesradio:morefromthetimes",
        "title": "<b>Prince Harry</b> demands second hacking trial against Mirror Group",
        "description": "The Duke of Sussex won £140,600 in compensation from the publisher last month but says there are over 100 articles left to address"
    },
    {
        "url": "https://www.tatler.com/article/prince-philips-bold-buttressingandnbspand-queen-elizabeths-sharp-mind-why-princess-anne-represents-the-most-meritorious-deputy",
        "title": "<b>Prince</b> Philip’s bold buttressing and Queen Elizabeth’s sharp mind: why Princess Anne represents the most meritorious deputy",
        "description": "The Princess Royal stepped up her duties with great success following her brother’s ascension to the throne, but his brief absence has highlighted even further her indispensable and steadfast support"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-wants-case-against-165856538.html",
        "title": "<b>Prince Harry</b> wants case against Mirror resolved as soon as possible - lawyers",
        "description": "Prince Harry wants London&#39;s High Court to resolve the remainder of his lawsuit against Britain&#39;s Mirror Group Newspapers as soon as possible following the ruling in his favour at the end of last year,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-losing-31994145",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;losing support&#39; and desperate for deal amid latest row",
        "description": "Prince Harry and Meghan Markle stepped down as senior working royals in 2020 and relocated to the US for a new life and a glittering Hollywood career, but their plans have since seemingly crumbled"
    },
    {
        "url": "https://www.theguardian.com/media/2024/jan/29/daily-mirror-faces-2m-in-legal-costs-over-prince-harry-phone-hacking",
        "title": "Daily Mirror faces £2m in legal costs over <b>Prince Harry</b> phone hacking",
        "description": "Judge ruled that Mirror Group Newspapers’ titles all used ‘extensive’ unlawful information gathering"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/revelations-world-doc-waylon-jennings-202000300.html",
        "title": "All the Revelations in the New “We Are the World” Doc, from Waylon Jennings&#39; Exit to the <b>Prince</b> Solo That Never Was",
        "description": "The new Netflix documentary The Greatest Night in Pop, featuring interviews with Lionel Richie, Bruce Springsteen and more, is streaming now"
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/prince-harrys-fears-over-meghans-31968913",
        "title": "<b>Prince Harry</b>&#39;s fears over Meghan&#39;s tell-all threat as she wants to &#39;set the record straight&#39;",
        "description": "EXCLUSIVE: A source tells OK! that Prince Harry has shut down plans for wife Meghan Markle to tell her own story in what would likely be another bombshell royal autobiography"
    },
    {
        "url": "https://inews.co.uk/news/prince-harry-mirror-hacking-trial-2878307?ico=most_popular",
        "title": "Mirror publisher faces £2m legal costs after <b>Prince Harry</b> hacking trial",
        "description": "Last month, the Duke of Sussex was awarded £140,600 in damages after a judge riled his phone had been hacked as part of &quot;widespread and habitual&quot; phone hacking at Mirror Group Newspapers"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-blocks-meghan-markles-31993669",
        "title": "<b>Prince Harry</b> &#39;blocks&#39; Meghan Markle&#39;s memoir as it would &#39;cause more angst with family&#39;",
        "description": "<b>Prince Harry</b> has seemingly warned his wife, Meghan Markle, against writing a tell-all memoir, according to sources. The Duchess of Sussex was ready to &#39;set the record straight&#39; about her time as part of the Firm, but <b>Harry</b> has &#39;put an end to her plans&#39; as he was worried about the repercussions, reports the Mirror."
    },
    {
        "url": "https://pressgazette.co.uk/media_law/harry-hacking-mirror-costs/",
        "title": "<b>Harry</b> hacking lawyer labels case against Mirror publisher ‘overwhelmingly successful’",
        "description": "A phone hacking claim against the publisher of the Daily Mirror brought by figures including Prince Harry was “overwhelmingly successful”."
    },
    {
        "url": "https://www.independent.co.uk/news/ap-daily-mirror-mirror-group-newspapers-british-london-b2486729.html",
        "title": "<b>Prince Harry</b>&#39;s lawyers seek $2.5 million in fees after win in British tabloid phone hacking case",
        "description": "A lawyer for Prince Harry is seeking 2 million pounds ($2.5 million) in legal fees after proving the publisher of the Daily Mirror tabloid invaded his privacy by hacking his phone"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13016905/Prince-Harry-faces-calls-quit-role-conservation-charity-accused-operating-armed-militia-engaged-human-rights-atrocities-Africa.html",
        "title": "<b>Prince Harry</b> faces calls to quit his role in a conservation charity accused of operating an armed militia engaged in human rights atrocities in Africa",
        "description": "Prince Harry is being urged to quit a charity he helps to run after a probe by The Mail on Sunday uncovered allegations that it operates an armed militia."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-middleton-health-update-shes-31992210",
        "title": "Kate Middleton discharged from hospital following surgery in new health update",
        "description": "The Princess of Wales has left hospital and made her way to Adelaide Cottage in Windsor tollowing her abdominal surgery which saw her hospitalised for 13 days."
    },
    {
        "url": "https://www.hellomagazine.com/homes/512262/king-charles-bizarre-living-conditions-cold-rooms/",
        "title": "King Charles&#39; very particular living conditions that lead to a &#39;constant battle&#39; with Queen Camilla",
        "description": "King Charles&#39; penchant for frost in his palatial suites is arguably one of his more peculiar habits, which leads to &quot;battles&quot; with his wife who prefers her living spaces to be &quot;warm and cosy&quot;."
    },
    {
        "url": "https://news.sky.com/story/african-wildlife-charity-with-prince-harry-as-board-member-investigating-rape-and-torture-claims-against-eco-guards-13059259?dcmp=snt-sf-twitter",
        "title": "African wildlife charity with <b>Prince Harry</b> as board member investigating rape and torture claims against eco-guards",
        "description": "A wildlife charity which has <b>Prince Harry</b> as a board member is investigating allegations of human rights abuses by its guards in the Republic of the Congo. African Parks said it was &quot;encouraging anyone with knowledge&quot; of any abuse to come forward and said ..."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/celebrity-style/511964/alex-jones-cotton-traders-winter-fashion-edit/",
        "title": "Exclusive: Alex Jones shares her favourite fashion tips – and reveals the £36 knit she loves",
        "description": "The Welsh presenter has been at the helm of some major TV moments, including the wedding of <b>Prince Harry</b> and Meghan Markle, Eurovision, and Comic Relief. A semi-finalist on Strictly Come Dancing in 2011 and a busy mum-of-three, Alex has unveiled her latest ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/28/charity-with-prince-harry-as-director-investigated-over-and-torture-claims?ref=upstract.com",
        "title": "Charity with <b>Prince Harry</b> as director investigating rape and torture claims",
        "description": "The Duke of Sussex, <b>Prince Harry</b>, is listed as a board member of the non-profit organisation after serving as the organisation’s president for six years. Guards managed and paid by the charity had engaged in the beating, rape and torture of Indigenous ..."
    }
]