[
    {
        "url": "https://www.skynews.com.au/opinion/controversy-surrounding-prince-harrys-aviation-award-win/video/a0023b30086ba900d81572854de1649d",
        "title": "Controversy surrounding <b>Prince Harry</b>’s aviation award win",
        "description": "Writer and broadcaster Esther Krakue discusses the controversy around <b>Prince Harry</b>&#39;s induction into the Living Legends of Aviation for his service as a helicopter pilot in the British Army. The Living Legends of Aviation Awards was hosted by John Travolta ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/harry-missed-hollywood-rule-no-1-a-listers-dont-do-parties-khlgvn93t",
        "title": "<b>Harry</b> missed Hollywood rule No 1: A-listers don’t do parties",
        "description": "He’s only gone and done it again. John Travolta has ruined another celebrity party. First it was the Oscars in 2014, when he announced the award-winning actress and singer Idina Menzel as “the"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25439539/prince-harry-mario-max-selfie/",
        "title": "This is your future, <b>Harry</b>… having a selfie with fake royal like ‘<b>Prince</b>’ Mario-Max at minor bash with D-list crowd",
        "description": "But royal watchers are now asking if <b>Prince Harry</b> and <b>Prince</b> Mario-Max Schaumburg-Lippe, who posed for a selfie together at an awards bash this weekend, are really so different. The pair met after <b>Harry</b> received an award for being a “Living Legend of ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-makes-joke-king-31933838",
        "title": "<b>Prince Harry</b> makes joke about King Charles at awards ceremony amid health woes",
        "description": "Prince Harry cracked a joke about his father King Charles III at the Living Legends of Aviation awards, ahead of his prostate operation, which he will undergo in the upcoming days"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-called-john-travolta-194508600.html",
        "title": "<b>Prince Harry</b> Called Out John Travolta for &quot;Dining Out&quot; on His 1985 Dance With Princess Diana",
        "description": "Taking the stage, the royal was greeted by the actor, who placed a medal around his neck. &quot;This is nice,&quot; Harry said as he accepted his award for his time as a helicopter pilot in the British Army, telling Travolta: &quot;Thanks very much, Captain John.&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-makes-surprising-joke-31933405.amp",
        "title": "<b>Prince Harry</b> makes surprising joke at his father King Charles&#39; expense amid health woes",
        "description": "King Charles is preparing for a prostate operation but that didn&#39;t stop his youngest son having a pop at his flying skills as he appeared at the Living Legends of Aviation awards"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858141/prince-harry-jokes-king-charles-princess-kate",
        "title": "Royal expert slams <b>Prince Harry</b> for &#39;cracking jokes&#39; before message to Charles and Kate",
        "description": "A royal expert criticised Prince Harry who was &#39;cracking jokes&#39; at the Aviation Awards in a &#39;deliberate snub&#39; to his family."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/21/sussexes-offer-support-to-king-and-princess-of-wales-amid-h/",
        "title": "<b>Harry</b> and Meghan offer support to King and Princess of Wales over health struggles",
        "description": "Kate Middleton is recovering from abdominal surgery and the King is to receive treatment for an enlarged prostate"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markle-admit-28486398",
        "title": "<b>Prince Harry</b> and Meghan Markle admit &#39;concern&#39; for Kate Middleton after surgery",
        "description": "Prince Harry and Meghan Markle have reportedly sent a message of support to Prince William amid King Charles and Kate Middleton&#39;s health battles. The Sussexes are reported to be &quot;concerned&quot; about Kate&#39;s health after news of her abdominal surgery emerged."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25435320/humiliating-moment-prince-harry-poses-fake-german-prince/",
        "title": "Humiliating moment <b>Harry</b> poses with Z-list German ‘fake <b>prince</b>’ dubbed King of Trash TV who starred in show Travel Boobs",
        "description": "PRINCE Harry posed for a humiliating selfie with a Z-list German “fake prince” dubbed the “King of Trash TV”. The Duke of Sussex accepted the Living Legend of Aviation"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12988675/prince-harry-aviation-award-selfie-warning-stay-away-german-prince.html",
        "title": "&#39;<b>Harry</b> cannot stoop lower - I would advise him to stay away&#39;: German royal&#39;s fury as <b>Harry</b> takes selfie at tacky LA aviation awards with self-styled &#39;<b>prince</b>&#39; who is accused of ...",
        "description": "Max Schaumburg-Lippe - who was once dubbed the &#39;King of Trash TV&#39; -  at the &#39;Living Legends of Aviation&#39; in Los Angeles."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/kate-middleton-king-charles-princess-of-wales-harry-b2482200.html",
        "title": "Royal news - live: <b>Prince Harry</b> and Meghan ‘send get well message’ to King Charles and Kate",
        "description": "The couple reportedly reached out as Kate spends her sixth day recovering from abdominal surgery at the London Clinic"
    },
    {
        "url": "https://www.theguardian.com/music/2024/jan/21/sheku-kanneh-mason-cellist-proms-should-drop-rule-britannia",
        "title": "Cellist at <b>Prince Harry</b>’s wedding says Proms should drop Rule, Britannia!",
        "description": "Patriotic song makes people ‘feel uncomfortable’, Sheku Kanneh-Mason tells Desert Island Discs A British cellist who played at the wedding of the Duke and Duchess of Sussex has said Rule, Britannia! “makes people feel uncomfortable” and should not ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858131/prince-harry-living-legend-award-german-prince-warning",
        "title": "<b>Prince Harry</b> warned &#39;stay away&#39; from German <b>prince</b> as he&#39;s told &#39;you can&#39;t stoop lower&#39;",
        "description": "The Duke of Sussex has received an urgent warning about appearing with Prince Mario-Max Schaumburg-Lippe in public."
    },
    {
        "url": "https://metro.co.uk/2024/01/21/kate-middleton-king-charles-sent-get-well-messages-harry-meghan-20147944/?ico=metro-posts_working-metro_whats-trending-now",
        "title": "<b>Harry</b> finally wishes his dad well after snubbing him in glitzy Hollywood bash speech",
        "description": "Prince Harry and Meghan Markle have sent ‘get well’ messages to Kate Middleton and King Charles after both were hit with health concerns. Catherine, Princess of Wales, is recovering in hospital following abdominal surgery in London last week."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/prince-harry-jabs-john-travolta-princess-diana_uk_65acf0f2e4b076abd7abe5c2?d_id=7203781&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Prince Harry</b> Jabs John Travolta For &#39;Dining Out&#39; On Famous 1985 Princess Diana Dance",
        "description": "<b>Prince Harry</b> made some curiously pointed remarks on Friday about actor John Travolta, who famously once danced with the late Princess Diana. Travolta hosted the 21st Annual Living Legends of Aviation Awards in Los Angeles on Friday, where <b>Harry</b> was due to ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-called-out-weird-31935045",
        "title": "<b>Prince Harry</b> called out for &#39;weird&#39; behaviour at Living Legend of Aviation awards",
        "description": "<b>Prince Harry</b> has been called out for his alleged &quot;weird&quot; behaviour at the Living Legends of Aviation awards on Friday, it has been reported. At the glittering event, the Duke of Sussex could be heard &quot;cracking jokes&quot; instead of wishing his father King ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-markle-face-31934556",
        "title": "<b>Prince Harry</b> and Meghan Markle face &#39;crumbling Montecito empire&#39;",
        "description": "<b>Harry</b> and Meghan&#39;s &quot;crumbling Montecito empire&quot; has received another blow despite the Duke of Sussex making a &quot;wise decision&quot; recently. <b>Prince Harry</b> made the decision to withdraw his libel case against the Mail on Sunday newspaper earlier this week."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/music/news/cellist-prince-harry-rule-britannia-controversy-b2482276.html",
        "title": "<b>Prince Harry</b> and Meghan’s cellist calls for ‘Rule, Britannia!’ to be axed from Last Night of the Proms",
        "description": "The cellist who performed at the wedding of the Duke and Duchess of Sussex has said that the patriotic song “Rule, Britannia!” should be axed from the BBC’s Last Night of the Proms. Sheku Kanneh-Mason, 24, who performed at the royal wedding aged 19 ..."
    },
    {
        "url": "https://goss.ie/uk-showbiz/prince-harry-and-meghan-reach-out-to-king-charles-and-kate-middleton-amid-their-respective-health-scares-366247",
        "title": "<b>Prince Harry</b> and Meghan ‘reach out to King Charles and Kate Middleton’ amid their respective health scares",
        "description": "<b>Prince Harry</b> and Meghan Markle have reportedly reached out to King Charles and Kate Middleton amid their respective health scares. According to The Mirror, the couple have sent messages of support to the Princess of Wales, who is recovering from abdominal ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/king-charles-misses-church-before-28486631",
        "title": "King Charles misses church before prostate treatment to &#39;rest&#39;",
        "description": "where Charles - dad to <b>Prince</b> William and <b>Prince Harry</b> - is currently residing. One visitor told MailOnline today: &quot;We came up to Sandringham for a wander around and saw people waiting so we decided to investigate. We thought it would be nice to get a ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-missed-meghan-worried-31925843?int_source=nba",
        "title": "<b>Prince Harry</b> &#39;missed Meghan&#39; and was &#39;worried about King&#39;s health&#39; at Aviation Awards",
        "description": "<b>Prince Harry</b> was supposedly &quot;missing Meghan Markle&#39;s support&quot; at the Legends of Aviation Awards last night, while also &quot;worrying&quot; about his father The King, who will go into hospital next week for a procedure. The Duke&#39;s &quot;anxiousness&quot; revealed by a body ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/20/monarchy-royal-family-king-charles-kate-middleton-hospital/",
        "title": "How the Sussexes’ vanishing act exposed the weakness of the slimmed-down monarchy",
        "description": "With Kate and the King in hospital the Royal family could do with a helping hand and some stardust — but it won&#39;t be coming from California The fragile Firm: With no <b>Prince Harry</b> or Meghan to step in, the Royal family looks thinner than ever On Friday ..."
    },
    {
        "url": "https://www.dailytelegraph.com.au/news/national/prince-harry-and-prince-andrew-quietly-barred-from-councillor-of-state-role/video/cc30e4fce9de0cd5aadc6400de149553",
        "title": "<b>Prince Harry</b> and <b>Prince</b> Andrew quietly barred from Councillor of State role",
        "description": "<b>Prince Harry</b> and <b>Prince</b> Andrew have been replaced as Councillors of State, which was done quietly. According to The Times: “In a hitherto unnoticed statement during the second reading of the bill in the Lords on November 21 2022, Lord True, lord privy ..."
    },
    {
        "url": "https://www.skynews.com.au/lifestyle/celebrity-life/concern-and-best-wishes-meghan-markle-and-prince-harry-finally-reach-out-after-king-charles-and-princess-kates-health-scares/news-story/c494b61e5834ad02e56d15e47839eb16",
        "title": "Meghan and <b>Harry</b> finally reach out after Charles and Kate’s health scares",
        "description": "A British newspaper has confirmed Prince Harry and Meghan Markle have reached out to King Charles and Princess Catherine as both royals battle health conditions."
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/prince-harry-and-meghan-send-well-wishes-to-king-charles-princess-kate/",
        "title": "<b>Prince Harry</b> and Meghan send ‘well wishes’ to King Charles",
        "description": "<b>Prince Harry</b> and his wife Meghan Markle have reportedly sent “get well messages” to both Princess Kate and King Charles amid their respective health concerns. According to The Mirror, an insider close <b>Prince Harry</b> and Meghan Markle notes that ..."
    },
    {
        "url": "https://uk.style.yahoo.com/sarah-ferguson-duchess-york-battling-200132575.html",
        "title": "Sarah Ferguson, Duchess of York, battling skin cancer",
        "description": "Britain&#39;s Sarah Ferguson, Duchess of York, a breast cancer survivor was also recently diagnosed and treated for malignant melanoma."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/01/21/65ad6db0ca47416d348b45b6.html",
        "title": "Duchess of York Sarah Ferguson diagnosed with skin cancer",
        "description": "The Duchess of York, Sarah Ferguson, has been diagnosed with an aggressive form of skin cancer following her previous breast cancer diagnosis. Medical professionals removed a mol"
    },
    {
        "url": "https://www.whas11.com/article/entertainment/entertainment-tonight/why-prince-harry-playfully-called-out-john-travolta-over-his-dance-with-princess-diana/603-95fc69f3-2c98-4ad3-a424-e4f5353f9656",
        "title": "Why <b>Prince Harry</b> Playfully Called Out John Travolta Over His Dance With Princess Diana",
        "description": "&quot;I think I was maybe 7 or 8 years old in a Wessex helicopter, and I jumped into it so excited, and then my father jumped in behind the controls and I was terrified,&quot; <b>Harry</b> said to laughter of the crowd. <b>Prince Harry</b> is such a natural speaker. One could ..."
    },
    {
        "url": "https://au.yahoo.com/news/princess-wales-news-latest-kate-150200414.html",
        "title": "Royal news - live: Duchess of York, Sarah Ferguson, diagnosed with aggressive form of skin cancer",
        "description": "This comes after both King Charles and the Princess of Wales undergo treatment for their respective health scares, with <b>Prince Harry</b> and Meghan reaching out to lend their support. The couple reportedly made contact as Kate spends her sixth day recovering ..."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/sarah-ferguson-shares-malignant-melanoma-210027109.html",
        "title": "Sarah Ferguson shares malignant melanoma diagnosis just months after breast cancer",
        "description": "was an obsession of the British tabloids for years before attention turned to <b>Prince</b> William and <b>Prince Harry</b>. Last June, when Ferguson revealed her breast cancer diagnosis after a routine mammogram, she said her prognosis was good and she was symptom-free."
    },
    {
        "url": "https://uk.news.yahoo.com/sarah-duchess-york-diagnosed-malignant-194540697.html",
        "title": "Sarah, the Duchess of York, diagnosed with malignant melanoma found during breast cancer treatment",
        "description": "Sarah, 64, the ex-wife of <b>Prince</b> Andrew and the mother of Princess Beatrice and Princess Eugenie was once a favorite target of Britain’s tabloids. The former Sarah Ferguson, known as “Fergie,” has published her memoirs and authored a number of ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/21/kate-middleton-king-charles-sent-get-well-messages-harry-meghan-20147944/?ico=trending-module_tag_prince-charles_item-0",
        "title": "<b>Harry</b> finally wishes his dad well after snubbing him in glitzy Hollywood bash speech",
        "description": "Prince Harry and Meghan Markle have sent ‘get well’ messages to Kate Middleton and King Charles after both were hit with health concerns. Catherine, Princess of Wales, is recovering in hospital following abdominal surgery in London last week."
    },
    {
        "url": "https://metro.co.uk/2024/01/21/kate-middleton-king-charles-sent-get-well-messages-harry-meghan-20147944/",
        "title": "<b>Harry</b> and Meghan ‘send get well messages’ to Kate and Charles",
        "description": "Prince Harry and Meghan Markle have sent ‘get well’ messages to Kate Middleton and King Charles after both were hit with health concerns. Catherine, Princess of Wales, is recovering in hospital following abdominal surgery in London last week."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12987475/Lauren-Sanchez-calls-Prince-Harry-legend-Beverly-Hills-aviation-award.html",
        "title": "Lauren Sanchez calls <b>Prince Harry</b> a &#39;legend who shaped the history and future of flight&#39; after they both won awards at glitzy Beverly Hills aviation bash",
        "description": "Lauren Sánchez, Jeff Bezos&#39; fiancée, praised Prince Harry at the Living Legends of Aviation awards in Los Angeles on Friday night. She shared a photo of herself, Bezos, John Travolta, and Harry."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12988515/prince-harry-living-legend-aviation-joke-flight-king-charles.html",
        "title": "<b>Prince Harry</b> makes joke about King Charles at aviation awards bash in LA telling audience his was &#39;terrified&#39; when his father jumped behind the controls of a helicopter when ...",
        "description": "The Duke of Sussex was inducted into the &#39;Living Legends of Aviation&#39; during a glitzy ceremony in Los Angeles where he was asked by host John Travolta about his first flight experience."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-reportedly-090125810.html",
        "title": "<b>Prince Harry</b> and Meghan Markle are reportedly ‘shocked’ about the controversial reaction to their baby name",
        "description": "Following reports that Queen Elizabeth II was left &#39;furious&#39; over Prince Harry and Meghan Markle&#39;s decision to name their daughter after her childhood nickname, the couple are reportedly ‘shocked’ over the public&#39;s outraged reaction but not, sadly, surprised as the &#39;smear campaign&#39; continues."
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-meghan-markle-get-well-message-king-charles-kate/",
        "title": "<b>Prince Harry</b> and Meghan &#39;send get well messages&#39; to King Charles and Kate amid double health scare",
        "description": "Prince Harry and Meghan Markle are said to have sent get well messages to King Charles and Kate amid their double health scare."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markle-reach-28485279",
        "title": "<b>Prince Harry</b> and Meghan Markle reach out to Royal Family over Kate Middleton&#39;s health",
        "description": "Kate underwent abdominal surgery earlier this week and is now back at home, resting, and has cleared her diary until the spring."
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-jabs-john-travolta-for-dining-out-on-famous-1985-princess-diana-dance_n_65ac124de4b041f1ce662d8b",
        "title": "<b>Prince Harry</b> Jabs John Travolta For &#39;Dining Out&#39; On Famous 1985 Princess Diana Dance",
        "description": "Travolta twirled Diana, Harry’s mother, around at the White House in a widely photographed moment in 1985. The “ Saturday Night Fever ” actor, whose turn in the dance-heavy drama made him a superstar, reportedly once called his steps with Diana “one of the highlights of my life.”"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511593/prince-william-really-hurt-by-prince-harrys-veiled-criticisms-of-kate/",
        "title": "<b>Prince</b> William &#39;really hurt&#39; by <b>Prince Harry</b>&#39;s &#39;veiled criticisms of Kate&#39;",
        "description": "In a special podcast episode, which you can listen to below, Robert reveals that whilst King Charles is open to a reconciliation with his youngest son, one between brothers might be more difficult as Prince William was left “really hurt” by Prince Harry’s revelations in his memoir Spare."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/21/cellist-prince-harry-meghan-wedding-no-rule-britannia-proms/?utmsource=email",
        "title": "Don’t play Rule, Britannia at Proms, says <b>Prince Harry</b> and Meghan cellist",
        "description": "The cellist won the BBC Young Musician award in 2016 The cellist who performed at the wedding of the Duke and Duchess of Sussex has said Rule, Britannia! should be axed from the Last Night of the Proms. Sheku Kanneh-Mason, who became a household name at ..."
    },
    {
        "url": "https://www.btimesonline.com/articles/163435/20240122/prince-harry-and-meghan-markle-extend-support-to-ailing-kate-middleton-and-king-charles-amid-health-concerns.htm",
        "title": "<b>Prince Harry</b> and Meghan Markle Extend Support to Ailing Kate Middleton and King Charles Amid Health Concerns",
        "description": "In a significant gesture that may hint at a thawing of tensions within the British Royal Family, <b>Prince Harry</b> and his wife Meghan Markle have reportedly reached out to express their concern for the health of Kate Middleton, the Princess of Wales ..."
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/prince-harry-heard-about-king-charles-health-battle-from-news-alert/news-story/8f2d3abe7d60f6993f826ea82b6a1fa9",
        "title": "<b>Prince Harry</b> heard about King Charles’ health battle from news alert",
        "description": "<b>Prince Harry</b> reportedly found out about his father’s health struggles through a news report. Photo by Daniel LEAL / AFP. Insiders said while the palace made an effort to inform all senior members of the royal family, including <b>Harry</b>, the private message ..."
    },
    {
        "url": "https://7news.com.au/entertainment/royal-family/harry-and-meghan-respond-to-king-charles-and-catherine-princess-of-wales-hospitalisations--c-13309391",
        "title": "<b>Harry</b> and Meghan respond to King Charles and Catherine, Princess of Wales hospitalisations",
        "description": "<b>Prince Harry</b> and his wife Meghan, Duchess of Sussex have responded to the two health scares announced within the British royal family. Last week it was revealed Catherine, Princess of Wales underwent abdominal surgery while King Charles was set to have an ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/times-the-royals-broke-protocol/",
        "title": "32 times the royals broke protocol, from Diana&#39;s &#39;revenge dress&#39; to touching gestures of compassion",
        "description": "It&#39;s rumoured to be one reason why the family didn&#39;t wait for <b>Prince Harry</b> to join their flight to Balmoral when the Queen was dying, as there were already said to be multiple members of the family on board. The protocol seems to be a little more relaxed ..."
    },
    {
        "url": "https://www.cweb.com/celebrity-lauren-sanchez-posts-photos-with-fiance-jeff-bezos-prince-harry-john-travolta-at-aviation-awards/",
        "title": "Celebrity Lauren Sanchez posts photos with fiancé Jeff Bezos, <b>Prince Harry</b>, John Travolta at Aviation Awards",
        "description": "and other honorees including <b>Prince Harry</b>, actor John Travolta who was the host and others. She is the founder of Black Ops Aviation, an aerial filming company. Lauren Sanchez received the Elling Halvorson Vertical Flight Hall of Fame Award. The 54-year ..."
    },
    {
        "url": "https://sg.finance.yahoo.com/news/prince-harry-meghan-markle-reach-221517994.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Reach Out to King Charles and Princess Kate In an “Olive Branch” Gesture After Recent Health Scares",
        "description": "Well, how’s this for good news on a Saturday? The Mirror reports that, following news of health scares for both King Charles and the Princess of Wales, <b>Prince Harry</b> and Meghan Markle have reached out to send well-wishes. Charles will be hospitalized for ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/palace-makes-under-radar-move-190155082.html",
        "title": "Palace Makes Under-the-Radar Move to Ensure <b>Prince</b> Andrew and <b>Prince Harry</b> Are Barred from Ever Standing In for King Charles",
        "description": "Charles’ younger brother, <b>Prince</b> Andrew, and youngest son, <b>Prince Harry</b>, were quietly removed as Counsellors of State on November 21, 2022, when it was revealed in the House of Lords that the Royal Household confirmed that, in practice, only “working ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-jokingly-references-iconic-174927189.html",
        "title": "<b>Prince Harry</b> Jokingly References an Iconic Moment Between Princess Diana and an A-List Actor as He Receives Award in Beverly Hills",
        "description": "On the same day news broke that <b>Prince Harry</b> had ended his libel suit against The Mail on Sunday (<b>Harry</b>’s spokesperson said instead his focus was “on the safety of his family, rather than these legal proceedings”), the Duke of Sussex stepped out to ..."
    },
    {
        "url": "https://au.yahoo.com/lifestyle/prince-harry-likely-found-father-162923783.html",
        "title": "<b>Prince Harry</b> Likely Found Out About His Father King Charles’ Health Scare the Same Way the Rest of Us Did",
        "description": "In his bombshell book Endgame, Omid Scobie revealed that <b>Prince Harry</b> allegedly found out about his grandmother Queen Elizabeth’s death via an alert from the BBC News app upon landing in Scotland, en route to her on her deathbed. Now, according to The ..."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/prince-harry-prince-andrew-quietly-191333318.html",
        "title": "<b>Prince Harry</b> and <b>Prince</b> Andrew Quietly Barred from Royal Roles Allowing Them to Step in for King Charles",
        "description": "Princess Beatrice is also affected by a change in longstanding tradition Kate Green/Getty <b>Prince</b> Andrew and <b>Prince Harry</b> walk behind Queen Elizabeth&#39;s coffin during the procession for the lying-in-state on Sept. 14, 2022. <b>Prince Harry</b> and <b>Prince</b> Andrew won ..."
    }
]