[
    {
        "url": "https://observer.com/2024/01/emma-watson-style-best-fashion-moments-photos/",
        "title": "Emma Watson’s Best Style Moments",
        "description": "For her first big red carpet event at the UK premiere of Harry Potter and the Sorcerer’s Stone, Watson went for an ankle-length gray dress and purple accents in the form of snakeskin boots, a feather boa and a hair bow."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/zara-mike-tindall-hang-prince-203740869.html",
        "title": "Zara and Mike Tindall Hang Out with <b>Prince Harry</b>&#39;s Polo Pals at Equestrian Event in Australia",
        "description": "Zara rode against Nacho Figueras and Delfina Blaquier in a playful celebrity polo match at the equestrian festival"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12939419/Meghan-Markle-wasnt-invited-Suits-reunion-Golden-Globes-Patrick-J-Adams-Gabriel-Macht-Sarah-Rafferty-dont-number-reveals-former-star-Gina-Torres.html",
        "title": "Meghan Markle didn&#39;t join Suits reunion at Golden Globes because of a &#39;previous commitment&#39;, awards insider claims - as former co-star Gina Torres says the cast &#39;don&#39;t have her ...",
        "description": "Speaking to Page Six , a source alleged that the Duchess of Sussex was asked to come, but &#39;unfortunately&#39; wasn&#39;t able to make an appearance because of other plans."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/08/duke-of-sussex-left-out-of-sandhurst-alumni-book/",
        "title": "<b>Prince Harry</b> left out of Sandhurst alumni book while <b>Prince</b> William writes foreword",
        "description": "The Duke of Sussex was left out of a Sandhurst alumni book that included a foreword written by Prince William. In “They Also Served: 200 People Who Trained At Sandhurst”, author Vaughan Kent-Payne explores “exceptional” graduates who have “gained recognition beyond” the Armed Forces."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853400/prince-harry-regret-statement-meghan-markle-quit-royal-family",
        "title": "<b>Prince Harry</b> &#39;regretted&#39; bombshell statement as he and Meghan Markle quit Royal roles",
        "description": "Prince Harry and Meghan Markle sent shockwaves around the world when they announced they were stepping back from their Royal roles on this day in 2020."
    },
    {
        "url": "https://www.hellomagazine.com/film/510807/suits-star-gabriel-macht-on-why-meghan-markle-and-co-stars-probably-wont-return-for-reboot-exclusive/",
        "title": "Exclusive: Suits star Gabriel Macht on why Meghan Markle and co stars &#39;probably won&#39;t return for reboot&#39;",
        "description": "Meghan Markle &#39;s hit USA series Suits has found renewed success in the past year, leading to showrunner Aaron Korsh working on an upcoming reboot. Star Gabriel Macht tells HELLO! why the cast probably won&#39;t return – although his phone line is always open."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25288290/meghan-markle-suits-star-duchess-wasnt-invited-golden-globes/",
        "title": "Meghan Markle’s Suits co-star reveals why the Duchess wasn’t invited to the Golden Globes reunion",
        "description": "SUITS fans got a treat last night as most of the cast had a heartwarming reunion at the Golden Globes. However, one key star, Meghan Markle – who played paralegal Rachel Zane on the hit"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-andrews-uncomfortable-encounter-well-155440962.html",
        "title": "<b>Prince</b> Andrew&#39;s Uncomfortable Encounter with Well-Wishers on Christmas Caught on Camera",
        "description": "A crowd of well-wishers captured a bizarre exchange with the Duke of York, who is no longer a working member of the royal family"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1853355/prince-harry-meghan-markle-trying-to-visually-maintain-the-royal-aesthetic",
        "title": "<b>Prince Harry</b> and Meghan take on &#39;faux royal engagements&#39; in effort to &#39;impress&#39;",
        "description": "EXCLUSIVE: Prince Harry and Meghan Markle are carrying out &quot;faux royal engagements&quot;, according to a royal expert who branded them &quot;reality stars&quot;."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harrys-massive-megxit-regret-31833673.amp",
        "title": "<b>Prince Harry</b>&#39;s &#39;massive Megxit regret&#39; after unexpected backlash to &#39;blindsiding&#39; announcement",
        "description": "Prince Harry and Meghan Markle certainly started 2020 with a bang with the shock announcement they were quitting their royal roles - but it seems Harry may have wanted things to have turned out a litt"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-excluded-from-prestigious-book-celebrating-top-sandhurst-recruits/",
        "title": "<b>Prince Harry</b> excluded from prestigious book celebrating top Sandhurst recruits",
        "description": "Prince Harry has been excluded from a prestigious new book celebrating Sandhurst&#39;s top recruits, in a move that has been dubbed a humiliating &#39;snub&#39; for the duke."
    },
    {
        "url": "https://metro.co.uk/2024/01/08/fans-call-shade-targeted-meghan-markle-suits-reunion-20082860/?ico=trending-post-strip_item_3",
        "title": "Suits cast accused of ‘shading’ Meghan Markle with bombshell at reunion",
        "description": "Meghan Markle ’s former Suits co-stars have been accused of ‘shading’ her after it was revealed she wasn’t part of their group chat. At today’s Golden Globes ceremony, some of the cast of the legal drama, which ran from 2011 until 2019, appeared on stage to present an award."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/duke-duchess-sussex-finances-mocked-142515868.html",
        "title": "Duke and Duchess of Sussex mocked in Golden Globes joke about The Crown",
        "description": "The Duke and Duchess of Sussex were mocked at the Golden Globes on Sunday night as the ceremony’s host cracked jokes about their finances."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-complains-childhood-castle-31833343",
        "title": "<b>Prince Harry</b> complains his childhood castle bedroom was &#39;less luxurious&#39; than William&#39;s",
        "description": "The Duke of Sussex opened up about his and William&#39;s bedroom in Balmoral Castle when they were kids as he claimed that his older brother was always given more due to being the &#39;heir&#39;."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-left-out-of-sandhurst-guide-they-also-served-british-army-b1130967.html",
        "title": "<b>Prince Harry</b> left out of Sandhurst guide to most notable graduates",
        "description": "Prince Harry has not been included in a book celebrating the Sandhurst&#39;s top 200 alumni. The Duke of Sussex was left out of the guide called They Also Served, by Vaughan Kent-Payne, despite his brother William being included and writing the foreword."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-accused-asking-queen-31833327",
        "title": "<b>Prince Harry</b> accused of &#39;asking Queen for money&#39; in embarrassing Golden Globes roasting",
        "description": "Prince Harry was savagely mocked during the Golden Globe Awards, and accused of &#39;asking the Queen for money&#39; while being paid &#39;millions of dollars for doing absolutely nothing&#39;"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-wanted-out-royal-31832241",
        "title": "<b>Prince Harry</b> &#39;wanted out&#39; of royal life years before he quit but one relative convinced him to stay",
        "description": "The Duke of Sussex stepped down from the Royal Family in 2020 with his wife Meghan Markle but later revealed he had been sitting on the decision for many years before."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/kate-middleton-heartbroken-prince-george-eton",
        "title": "Kate Middleton is &#39;heartbroken&#39; over <b>Prince</b> George attending Eton",
        "description": "Kate Middleton is reportedly &#39;heartbroken&#39; over the decision for Prince George to follow in his father&#39;s footsteps and attend Eton College when he turns 13. Princess Catherine was reportedly bullied when she attended a same-sex boarding school and &#39;can&#39;t bear the thought&#39; of that happening to George, a royal insider has claimed."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sandhurst-army-alumni-guide-prince-harry-2nx35n5wk",
        "title": "<b>Prince Harry</b> left out of Sandhurst army graduate guide",
        "description": "The Duke of Sussex’s exclusion comes after he published a memoir that included details of his time on two tours"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937757/Golden-Globes-Jo-Koy-outrage-Royal-Family-Prince-Harry-Meghan-Markle.html",
        "title": "Golden Globes 2024: Host Jo Koy sparks outrage as he mocks the &#39;rich, white and dysfunctional&#39; Royal Family and quips <b>Prince Harry</b> and Meghan Markle were &#39;paid millions for ...",
        "description": "The comedian took aim at King Charles in his opening monologue by branding the family &#39;rich, white and dysfunctional&#39; while referencing Netflix&#39;s The Crown."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middleton-parenting-royal-family-31811965",
        "title": "Super mum Kate! Inside her 7 rules of parenting as George, Charlotte and Louis return to school",
        "description": "EXCLUSIVE: Experts examine how the Princess of Wales has become a leading voice in the field of early years development and how she uses what she has learnt at home with her children"
    },
    {
        "url": "https://www.thesun.co.uk/tvandshowbiz/25281273/meghan-harry-roasted-at-golden-globes/",
        "title": "Meghan &amp; <b>Harry</b> roasted at Golden Globes for ‘asking Queen for cash’ &amp; ‘being paid millions by Netflix for doing nothing’",
        "description": "PRINCE Harry and Meghan Markle were last night roasted at the Golden Globes for “asking the Queen for cash”. The Duke and Duchess of Sussex were the butt of the joke when comedian Jo Koy took to"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-accused-asking-money-31830560.amp",
        "title": "<b>Prince Harry</b> accused of &#39;asking for money&#39; in embarrassing attack by Golden Globes host",
        "description": "Jo Koy took over hosting duties for this year&#39;s Golden Globe Awards and the comedian hit out at Prince Harry for &#39;asking for money&#39; during his opening monologue"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-extra-085227768.html",
        "title": "<b>Prince Harry</b> and Meghan Markle have some extra help with <b>Prince</b> Archie and Princess Lilibet as this relative moves in",
        "description": "Prince Harry and Meghan Markle will have an extra pair of hands to help with Prince Archie and Princess Lilibet as Meghan’s mum, Doria Ragland, has moved in."
    },
    {
        "url": "https://www.hellomagazine.com/fashion/royal-style/510799/prince-william-rocking-full-beard-2008-unearthed-photos-kate-middleton/",
        "title": "<b>Prince</b> William, 26, rocking a full beard in rare clubbing photo with Princess Kate will make you double take",
        "description": "after it reemerged on social media following the release of <b>Prince Harry</b>&#39;s tell-all memoir, Spare. <b>Prince Harry</b> was the first to sport a beard on his wedding day to Meghan Markle after receiving formal permission from his late grandmother, Queen Elizabeth II."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/celebrity/meghan-harry-golden-globes-ceremony-2024-comedian-jo-koy-b1130940.html",
        "title": "Golden Globes comedian Jo Koy cracks &#39;savage&#39; joke about <b>Harry</b> and Meghan during ceremony",
        "description": "I&#39;m sorry. How great was Imelda Staunton in The Crown, wasn’t she amazing? Her portrayal of the Queen was so good <b>Prince Harry</b> called her and asked her for money.&quot; Acknowledging the jibe, he added: &quot;Like I said, I didn’t write all of these!"
    },
    {
        "url": "https://www.thepinknews.com/2024/01/08/facts-saltburn-movie-emerald-fennell-barry-keoghan-jacob-elordi/",
        "title": "Here are five facts you didn’t know about Saltburn",
        "description": "According to costume designer Sophie Canale, the jumping off point for Felix’s posh boy style was <b>Prince Harry</b> – who was a similar age in 2006 when the film was set. “I looked at photos of him with his friends then, going out in London, going to ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/08/harry-and-meghan-mocked-in-golden-globes-joke-about-the-cro/",
        "title": "Duke and Duchess of Sussex’s finances mocked in Golden Globes joke about The Crown",
        "description": "The Duke and Duchess of Sussex were mocked at the Golden Globes on Sunday night as the ceremony’s host cracked jokes about their finances. Comedian Jo Koy, who was revealed as the host of the awards ceremony less than three weeks ago, levelled two jokes against Prince Harry and Meghan in his opening monologue."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25249516/queen-camilla-revenge-meghan-harry-podcast/",
        "title": "Queen Camilla ‘finally gets her own back’ on Meghan &amp; <b>Harry</b> with the ‘perfect revenge’ – and ‘it will leave them livid’",
        "description": "QUEEN Camilla has “finally got her own back” on Prince Harry and Meghan Markle by releasing her own podcast – just months after their lucrative deal was canned.  Today, Camilla, 76,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-meghan-humiliated-golden-31831577",
        "title": "<b>Prince Harry</b> and Meghan humiliated at Golden Globes by host Jo Koy&#39;s savage joke",
        "description": "The Sussexes did not attend the awards ceremony in LA last night but were brutally mocked alongside the rest of the Royal Family who were described as &#39;rich, white and dysfunctional&#39; in the comedian&#39;s opening speech."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/meghan-markle-in-the-spotlight-during-golden-globes-despite-absence-why-didnt-she-attend_art20675.html",
        "title": "Meghan Markle in the spotlight during Golden Globes despite absence: Why didn&#39;t she attend?",
        "description": "One of Hollywood’s biggest events took place last night: the Golden Globes. Though this usually doesn’t involve real royalty, this year, Meghan Markle was on everyone’s"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-accused-asking-money-31830560",
        "title": "<b>Prince Harry</b> accused of &#39;asking for money&#39; in embarrassing attack by Golden Globes host",
        "description": "Jo Koy took over hosting duties for this year&#39;s Golden Globe Awards and the comedian hit out at Prince Harry for &#39;asking for money&#39; during his opening monologue"
    },
    {
        "url": "https://www.palatinate.org.uk/from-shy-di-to-style-icon-princess-dianas-influence-on-fashion-in-both-life-and-death/",
        "title": "From “Shy Di” to Style icon: Princess Diana’s influence on fashion in both life and death",
        "description": "In the second edition of the Style Pantheon series, Jennifer Bailey explores the impact of Princess Diana&#39;s style and activism."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-golden-globes-royal-31829518",
        "title": "Meghan Markle&#39;s former Suits co-stars joke about her popularity before brutal remark at Golden Globes",
        "description": "Before she left to marry Prince Harry, Meghan Markle was a star on the hit legal series Suits but her former co-stars joked about her popularity during the 81st Golden Globes"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12937681/Prince-Harry-Nacho-Figueras-wife-Gold-Coast-Australia.html",
        "title": "<b>Prince Harry</b>&#39;s right-hand man Nacho Figueras and his stunning wife Delfina Blaquier go for a swim on the Gold Coast during trip to Australia",
        "description": "Prince Harry &#39;s right hand man, 46, and his stunning wife Delfina Blaquier, 43, caught some rays on a Gold Coast, Queensland beach on Saturday. While Nacho stayed put on a towel, Delfina stripped off and waded into the water for a swim."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/golden-globes-host-joy-koy-014151556.html",
        "title": "Golden Globes host Jo Koy cracks ‘brutal’ <b>Harry</b> and Meghan joke at 2024 ceremony",
        "description": "Comedian Jo Koy shared an anti-<b>Prince Harry</b> and Meghan Markle joke at the Golden Globes. The Filipino-American comedy star didn’t hold back in his debut as host of the annual awards ceremony – a job he acquired just two weeks ago – whose winners ..."
    }
]