[
    {
        "url": "https://www.express.co.uk/news/royal/1868076/prince-harry-meghan-markle-working-to-unify-ventures",
        "title": "<b>Prince Harry</b> and Meghan Markle revealed intentions with &#39;rebranded&#39; site using titles",
        "description": "<b>Prince Harry</b> and Meghan Markle have been quite busy — launching a new website, announcing a new podcast, and a three-day work trip to Canada — and it’s all with one goal in mind, says a royal expert. Daily Express spoke to Pauline Maclaran ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/bafta-awards-2024-red-carpet-arrivals-royal-festival-hall-20301857/?ico=zone-widget_home_entertainment",
        "title": "<b>Prince</b> William makes personal confession at Baftas about Kate’s health issues",
        "description": "The <b>Prince</b> of Wales spoke briefly about his wife Kate’s recent ... Emily wasn’t the only gal flying solo this year, as Taylor Russell was also without her boyfriend – Mr <b>Harry</b> Styles. Instead of accompanying his Canadian actress girlfriend, the ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-given-stark-warning-32155433",
        "title": "<b>Prince Harry</b> given stark warning over any future reunion plans with the Royal Family",
        "description": "Prince Harry has voiced his hopes that he can reconcile with his family and support them, yet an expert has urged the Duke of Sussex &#39;actions speak louder than words&#39;"
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-william-attends-baftas-solo-192601561.html",
        "title": "<b>Prince</b> William Attends BAFTAs Solo, Reportedly Hasn’t Yet Seen ‘Barbie’",
        "description": "Jordan Pettitt/Pool via ReutersAn extremely dapper Prince William walked the BAFTAs red carpet solo Sunday night in London as the guest of honor at Britain’s most prestigious film awards. William, who is president of BAFTA (British Film and Television Academy),"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868062/prince-harry-meghan-markle-warmer-disposition",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s Invictus Games &#39;reflect well on the Royal Family&#39;",
        "description": "EXCLUSIVE: Harry and Meghan were just in Canada for the Invictus Games, and it&#39;s had a positive effect on the couple, says royal author Tom Quinn."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/prince-william-makes-apologies-kates-28657577",
        "title": "<b>Prince</b> William makes apologies for Kate&#39;s absence at Bafta film awards",
        "description": "The Prince of Wales took his seat in the front row of the Bafta film awards ceremony in his first high-profile Royal engagement since his wife&#39;s operation"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-zero-per-cent-32154815?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> has &#39;zero per cent chance&#39; of being allowed to rejoin the Royal Family",
        "description": "The Duke of Sussex has voiced his hopes that he can reconcile with his family and support them, yet palace sources have insisted he won&#39;t be accepted back as a working royal"
    },
    {
        "url": "https://www.dailyrecord.co.uk/tv/prince-william-attends-bbc-bafta-32155390",
        "title": "<b>Prince</b> William attends BBC BAFTA Awards solo as Kate recovers from surgery",
        "description": "Prince William arrived at tonight&#39;s BAFTA awards ceremony solo. His wife Kate Middleton was unable to attend the red carpet event as she continues to recover from surgery. It comes as the first high-profile engagement the Prince of Wales has had recently since Kate&#39;s abdominal surgery as she has been forced to suspend royal duties."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-meghan-markles-rule-28657501",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s rule for never attending BAFTAs as they snub event again",
        "description": "Prince of Wales took his seat in the front row of the Bafta film awards ceremony in his first high-profile royal engagement since his wife&#39;s operation."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/harry-styles-ditches-baftas-football-girlfriend-stuns-red-carpet-20302266/?ico=trending-module_author_danni-scott_item-3",
        "title": "<b>Harry</b> Styles leaves stunning girlfriend solo at Baftas for football match at ‘worst stadium in UK’",
        "description": "It’s Baftas evening and everyone who is anyone is there, including a solo Taylor Russell looking utterly glam while her boyfriend <b>Harry</b> Styles ditches the event. <b>Harry</b>, 30, was instead spotted living his best granddad jumper life as he watched Luton Town ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/gallery/weddings-funerals-coronation-what-its-32138408",
        "title": "Weddings, funerals and a Coronation! What it&#39;s really like going viral thanks to the Royals",
        "description": "From capturing royal weddings to funerals and the King’s historic Coronation, award-winning photographer Sam Hussein talks us through his most regal"
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-return-royal-slap-face-william-2912314",
        "title": "<b>Prince Harry</b>’s return would royally be a slap in the face",
        "description": "So, noble Harry fills the void. The cameras flash, the crowds are agog, and the wayward Prince dominates the front pages. Twenty-four hours later, having heroically rescued the family he has so liberally trashed, he flies back to his celebrity lifestyle in America."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/king-charles-smiles-waves-hes-28656864",
        "title": "King Charles smiles and waves as he&#39;s seen in public for first time since <b>Prince Harry</b>&#39;s visit",
        "description": "King Charles was seen smiling and waving as he attended church with the Queen in his first public outing since his son the Duke of Sussex hinted at a possible reconciliation"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097197/prince-harry-meghan-markle-sussex-website-domain-businessman.html",
        "title": "Revealed: <b>Harry</b> and Meghan bought their Sussex.com website domain name from British-born tech businessman (and he was VERY happy with the price)",
        "description": "The Duke and Duchess of Sussex launched their controversial website as part of a royal rebrand on Monday after purchasing the domain name for an undisclosed fee from tech entrepreneur Neil Agate."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26019937/prince-william-baftas-red-carpet-kate-royal/",
        "title": "<b>Prince</b> William greets fans at Baftas while Kate Middleton recovers from surgery at home",
        "description": "PRINCE William has arrived at this years BAFTA awards without wife Kate by his side. The Princess of Wales, 42, is recovering from abdominal surgery which took place last month – she is"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-interview-king-charles-cancer-news-b2497962.html?page=13",
        "title": "Royal family news - live: King in first public outing since <b>Harry</b> visit as return given ‘zero per cent chance’",
        "description": "The King smiled and waved at wellwishers in his first public appearance since meeting with Prince Harry who hinted he was hoping the royal family could reunify in the wake of his shock cancer diagnosis."
    },
    {
        "url": "https://www.thesun.ie/royals/12233601/prince-william-baftas-red-carpet-kate-royal/",
        "title": "<b>Prince</b> William makes star turn at Baftas as he waves to crowd – while Kate Middleton continues recovery at home",
        "description": "PRINCE William has arrived at this years BAFTA awards without wife Kate by his side. The Princess of Wales, 42, is recovering from abdominal surgery which took place last month – she is"
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-return-royal-slap-face-william-2912314?ico=related_stories",
        "title": "<b>Prince Harry</b>’s return to the royal fold would be a slap in the face for steadfast William",
        "description": "So, noble Harry fills the void. The cameras flash, the crowds are agog, and the wayward Prince dominates the front pages. Twenty-four hours later, having heroically rescued the family he has so liberally trashed, he flies back to his celebrity lifestyle in America."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-william-attend-baftas-solo-151037899.html",
        "title": "<b>Prince</b> William to attend Baftas solo as Kate recovers from surgery",
        "description": "Prince William is expected to attend the glitzy BAFTAs solo as his wife th e Princess of Wales continues to recover from abdominal surgery. Kensington Palace confirmed that the Prince of Wales, 41, will &quot;attend the EE BAFTA Film Awards ceremony at the Royal Festival Hall on Sunday night."
    },
    {
        "url": "https://uk.movies.yahoo.com/zero-chance-prince-william-let-145406911.html",
        "title": "‘Zero Chance’ <b>Prince</b> William Would Let <b>Prince Harry</b> Return to Royal Duties",
        "description": "Dominic Lipinski/Pool/AFP via Getty ImagesWilliam says ‘no chance’ he’d allow Harry backPrince William is reportedly determined to prevent Prince Harry’s attempts to return to the royal fold. The Mirror reports that sources close to William say he would step up to the plate if needed in the wake of King Charles’ cancer diagnosis,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097501/prince-harry-meghan-markle-sussex-website-hijacked-lady-colin-campbell.html",
        "title": "<b>Harry</b> and Meghan are accused of &#39;hijacking the name Sussex for their website&#39; - as Lady Colin Campbell reveals she&#39;s bought domain names for other Sussex-related sites",
        "description": "Lady Campbell has revealed that she has bought the domain names for other Sussex-related sites as she blasted the couple for launching a new website which &#39;has nothing to do with the county&#39;."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-william-suits-blue-velvet-184941775.html",
        "title": "<b>Prince</b> William Suits Up in Blue Velvet for BAFTA Awards, Mingles With David Beckham and Cate Blanchett",
        "description": "After paying King Charles a visit in January, William’s younger brother, <b>Prince Harry</b>, made a surprise appearance at the NFL Honors earlier this month. The Duke of Sussex presented the Walter Payton NFL Man of the Year Award to Pittsburgh Steelers player ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/22/",
        "title": "<b>Prince Harry</b> updates — ‘Uncomfortable’ Duke breaks silence on King’s cancer battle in Good Morning America interview",
        "description": "<b>PRINCE Harry</b> has broken his silence on the King&#39;s cancer diagnosis in a bombshell TV interview with Good Morning America. The Duke and Duchess of Sussex travelled to Canada this week, marking one year to go until the 2025 Invictus Games - which <b>Harry</b> ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-zero-per-cent-32154815",
        "title": "<b>Prince Harry</b> has &#39;zero per cent chance&#39; of being allowed to rejoin the Royal Family",
        "description": "The Duke of Sussex has voiced his hopes that he can reconcile with his family and support them, yet palace sources have insisted he won&#39;t be accepted back as a working royal"
    },
    {
        "url": "https://inews.co.uk/opinion/prince-harry-return-royal-slap-face-william-2912314?ico=best_of_opinion",
        "title": "<b>Prince Harry</b>’s return to the royal fold would be a slap in the face for steadfast William",
        "description": "So, noble Harry fills the void. The cameras flash, the crowds are agog and the wayward Prince dominates the front pages. Twenty-four hours later, having heroically rescued the family he has so liberally trashed, he flies back to his celebrity lifestyle in America."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-william-bafta-kate-middleton-b2498121.html",
        "title": "<b>Prince</b> William to attend Baftas solo as Kate recovers from surgery",
        "description": "Prince William is expected to attend the glitzy BAFTAs solo as his wife th e Princess of Wales continues to recover from abdominal surgery. Kensington Palace confirmed that the Prince of Wales, 41, will &quot;attend the EE BAFTA Film Awards ceremony at the Royal Festival Hall on Sunday night."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/entertainment-arts-68330645",
        "title": "Matt Smith on if he&#39;d return to Doctor Who and being <b>Prince Harry</b>&#39;s &#39;grandad&#39;",
        "description": "Speaking to the BBC&#39;s Laura Kuenssberg, Smith shared his take on whether he&#39;d return to the role. Another character that drew acclaim for the actor was for his portrayal of Prince Philip in the Netflix drama, the Crown. Smith told of the moment he met Prince Harry, who greeted him as &quot;grandad&quot;."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/18/king-waves-church-first-appearance-duke-of-sussex-interview/",
        "title": "King waves on rainy walk to church in first appearance since Duke of Sussex’s interview",
        "description": "The King waved to onlookers as he walked to church on the Sandringham Estate in Norfolk in the rain on Sunday. Charles, 75, appeared in good spirits as he made the short journey to St Mary Magdalene Church, accompanied by the Queen, 76, and Rev Canon Dr Paul Williams."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-banned-seeing-king-32153377",
        "title": "<b>Prince Harry</b> &#39;banned&#39; from seeing King Charles at Sandringham as aides &#39;fear they&#39;d never get rid&#39;",
        "description": "Prince Harry was reportedly &#39;banned&#39; from seeing King Charles at Sandringham as Royal aides were worried the Duke of Sussex would never leave the King&#39;s side."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26017708/prince-harry-meghan-markle-hijack-sussex-name/",
        "title": "<b>Prince Harry</b> &amp; Meghan Markle ‘hijacked’ Sussex name for their own good – we deplore them, blasts Lady Colin Campbell",
        "description": "LADY Colin Campbell has blasted Prince Harry and Meghan Markle for “hijacking” the Sussex name for their own good. The former I’m a Celebrity contestant has set herself on a collision"
    },
    {
        "url": "https://www.itv.com/news/2024-02-18/the-ship-has-sailed-on-prince-harry-returning-as-a-working-royal",
        "title": "The ship has sailed on <b>Prince Harry</b> returning as a working royal",
        "description": "British newspapers have been writing about a “royal return” for Harry in order to “heal the rift” with his father, King Charles. | ITV National News"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/zero-per-cent-chance-prince-28655388",
        "title": "&#39;Zero per cent chance&#39; <b>Prince</b> William will let <b>Harry</b> return to royal duty, reports say",
        "description": "Prince William has reportedly decided there is &#39;zero per cent chance&#39; Harry will be allowed back into the royal fold to help as his father battles cancer."
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-royal-pack-family-uk-camilla-long-698fkdzbs?region=global",
        "title": "There’s a gap in the royal pack and, oh look, here’s <b>Prince Harry</b>",
        "description": "Oh, it’s <b>Prince Harry</b> again, hanging on to our legs, begging to get our attention. Just look what he did last week: flew to Whistler and flung himself down a bobsleigh ride at 99mph. He also tirelessly tried “wheelchair curling”, while Meghan looked ..."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/prince-archie-and-princess-lilibet-why-has-their-surname-changed-to-sussex_art21185.html",
        "title": "<b>Prince</b> Archie and Princess Lilibet: Why has their surname changed to Sussex?",
        "description": "Prince Harry and Meghan Markle have recently decided to change their children’s names. The change has caused some backlash, but there may be a reason behind the"
    },
    {
        "url": "https://uk.style.yahoo.com/32-most-romantic-royal-moments-103911822.html",
        "title": "32 of the most romantic royal moments - from sweet displays of affection to abdicating for love",
        "description": "Royal protocol traditionally meant that fathers should not be in the room during the birth of their children, but Philip broke this protocol for the birth of his fourth child, Prince Edward. Philip reportedly held Elizabeth’s hand as she delivered her youngest in 1964, becoming the first royal father in modern history to witness his child’s birth."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/harsh-seven-word-prince-harry-28655123",
        "title": "Harsh seven word <b>Prince Harry</b> excuse used by staff to stop King Charles visit",
        "description": "Prince Harry was reportedly &#39;banned&#39; from seeing King Charles at Sandringham as Royal aides were worried the Duke of Sussex would never leave the King&#39;s side"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513704/king-charles-brave-face-first-outing-since-prince-harry-interview/",
        "title": "King Charles steps out for first time after <b>Prince Harry</b>&#39;s US interview amid cancer diagnosis",
        "description": "His Majesty appeared to be in high spirits as he was seen wearing a brown coat and waving to the public before being greeted by the Rev Canon Dr Paul Williams. Charles and Camilla&#39;s outing comes just after Prince Harry gave a rare interview to Good Morning America about his father&#39;s health."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-king-charles-sandringham-visit-cancer-b1139856.html?ref=todayheadlines.live",
        "title": "Palace aides &#39;blocked <b>Harry</b> from joining King Charles in Sandringham&#39; during his UK trip",
        "description": "Prince Harry was forced to stay in a hotel as aides reportedly worried they would “never get rid of him” if he lodged at Sandringham while visiting the King. The Duke of Sussex is said to be open to taking a temporary role back in the fold to help his father while Charles III undergoes treatment for cancer."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/harry-will-not-allowed-temporary-9107597",
        "title": "<b>Harry</b> ‘will not be allowed temporary royal role while King is ill’",
        "description": "The Duke of Sussex will not be allowed a temporary royal role while his father undergoes cancer treatment, according to reports. It was alleged that Harry told friends he would step into such a role while Charles is unwell."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/prince-harry-blocked-heart-heart-king-charles-20300503/?ico=metro-posts_uncategorized_whats-trending-now",
        "title": "<b>Prince Harry</b> ‘blocked’ from having heart to heart with King Charles",
        "description": "Prince Harry was ‘blocked’ from seeing his father King Charles one-on-one after he flew back to the UK after the King’s cancer diagnosis. The prince had allegedly wanted to join his father for ‘a few days’ at Sandringham – but was restricted to a brief meeting."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-william-harrys-royal-return-32152249",
        "title": "<b>Prince</b> William puts his foot down over <b>Harry</b>&#39;s plans to return to royal fold after Charles&#39; cancer diagnosis",
        "description": "Prince William has reportedly made it clear that his brother, Prince Harry, should not be allowed to pick up any more royal duties while King Charles III undergoes cancer treatment"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-blocked-heart-heart-28654645",
        "title": "<b>Prince Harry</b> &#39;blocked&#39; from heart-to-heart with King Charles due to aides&#39; six-word fear",
        "description": "Prince Harry planned a heart-to-heart with King Charles during his Sandringham stay but aides blocked it over a fear &quot;they would never get rid of him&quot;. Prince Harry was told to go to a hotel rather than stay with Charles, who is battling cancer."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26011068/prince-harry-charles-sandringham-stay-blocked/",
        "title": "<b>Prince Harry</b> planned King heart-to-heart &amp; Sandringham stay but aides blocked it over fear ‘they’d never get rid of him’",
        "description": "PRINCE Harry was stopped from joining the King at Sandringham after flying to the UK because Palace aides feared “they’d never get rid of him”. The Duke of Sussex was told to get a hotel instead"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68329702.amp",
        "title": "Newspaper headlines: Starmer &#39;attacks Trump&#39; and &#39;No way back for <b>Harry</b>&#39;",
        "description": "Comments by the Labour leader on Nato and Prince Harry&#39;s reported offer to return to royal duties lead the papers."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/18/queen-camilla-friends-charles-cancer-companions/",
        "title": "Inside the Queen’s ring of steel: How Camilla is coping without the King",
        "description": "Foremost among them is undoubtedly Mrs Annabel Elliot, who was by her elder sister’s side at Westminster Abbey for the Coronation last May, later joining the King and Queen on the Buckingham Palace balcony with her grandson Arthur Elliot, then 11, acting as one of eight pages of honour."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/leisure/24114131.princes-william-harry-among-celebrities-seen-swindon/",
        "title": "Princes William and <b>Harry</b> among celebrities seen in Swindon",
        "description": "Swindon has produced a number of celebrities including Billie Piper, Melinda Messenger and Nick Hewer from The Apprentice and Countdown But the town has also been visited by a number of famous people, notable names and iconic figures over the years for a variety of reasons."
    },
    {
        "url": "https://www.thesun.ie/royals/12229783/prince-harry-hybrid-royal-support-king-charles/",
        "title": "<b>Prince Harry</b> has ‘no way back’ as hybrid royal to support King Charles as insiders blast ‘how could it even work?’",
        "description": "PRINCE Harry will not be allowed the “half in, half out” hybrid royal role he once sought amid claims he has offered to make a temporary royal return. Palace insiders insist the 2020 Megxit deal"
    },
    {
        "url": "https://uk.news.yahoo.com/michael-buble-reworks-way-honour-070000705.html",
        "title": "Michael Buble reworks My Way in honour of <b>Prince Harry</b>",
        "description": "Michael Bublé hailed Prince Harry a &quot;visionary&quot; as he performed a reworked version of Frank Sinatra&#39;s &#39;My Way&#39; in honour of the royal at an Invictus Games dinner on Friday (16.02.24)."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13096043/Prince-Harry-zero-cent-chance-coming-royal-despite-Duke-Sussexs-olive-branch-palace-William-allow-brother-return.html",
        "title": "<b>Prince Harry</b> has &#39;zero per cent chance&#39; of coming back into royal fold, despite Duke of Sussex&#39;s olive branch - with palace sources saying William &#39;would not allow&#39; his brother ...",
        "description": "Prince William has told friends he will block any attempts by his brother Prince Harry to return to the royal family and would be the one to take on more responsibility if needed."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-william-said-meghan-markle-32153564",
        "title": "<b>Prince</b> William &#39;said Meghan Markle and <b>Prince Harry</b> cannot be trusted&#39;",
        "description": "The <b>Prince</b> of Wales believes his brother <b>Prince Harry</b> and sister-in-law Meghan Markle &quot;cannot be trusted&quot;, it has been claimed by a source close to <b>Prince</b> William. The source has said in the wake of King Charles&#39; cancer ­diagnosis, he would be the one to ..."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24126781.papers-say---february-18/",
        "title": "What the papers say – February 18",
        "description": "The <b>Prince</b> of Wales reportedly blocking the Duke of Sussex’s return to the royal family features among a range of stories on the front pages of Sunday’s papers in Britain. The Sunday Mirror and Sun on Sunday say there is “no way back” for <b>Harry</b> to ..."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-harry-meghan-markle-spent-175508149.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Spent Time With Michael Bublé and His Wife While Visiting Vancouver, Canada",
        "description": "<b>Prince Harry</b> and Meghan Markle spent some time with Michael Bublé and his wife Luisana Lopilato in celebration of next year&#39;s Invictus Games before enjoying a double date night. The pair of celebrity couples were spotted at the Hillcrest Community Centre ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-reportedly-talks-resume-154608306.html",
        "title": "<b>Prince Harry</b> Is Reportedly In Talks to Resume a Temporary Working Royal Role as King Charles Battles Cancer",
        "description": "Put him in, Your Majesty, he’s ready to serve (cue up the song “Centerfield” and sing along): reports are emerging that <b>Prince Harry</b> is willing to return to a temporary working role within the royal family as his father King Charles battles cancer."
    },
    {
        "url": "https://www.ok.co.uk/royal/breaking-harry-and-meghan-surname-32127238?int_source=nba",
        "title": "<b>Prince Harry</b> and Meghan Markle &#39;change children&#39;s surnames&#39; in surprise &#39;rebrand&#39; move",
        "description": "<b>Prince Harry</b> and Meghan Markle have reportedly changed their children&#39;s surnames in surprise &#39;rebrand&#39; move, where <b>Prince</b> Archie and Princess Lilibet will now be known differently"
    }
]