[
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-plays-up-nfl-32110759",
        "title": "<b>Prince Harry</b> plays up NFL connection in his and Meghan Markle&#39;s new Sussex.com site",
        "description": "Harry and Meghan&#39;s new website has quite a number of changes. For instance, the site used to be titled SussexRoyal.com. The Duke and Duchess of Sussex likely dropped &quot;royal&quot; from their URL after agreeing to no longer use the word. The agreement came after they resigned from their position in the Royal Family in 2020."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/meghan-markles-romantic-valentines-day-28620049",
        "title": "Meghan Markle&#39;s romantic Valentine&#39;s Day plans with <b>Prince Harry</b> in Canada",
        "description": "Meghan Markle once revealed her dream Valentine&#39;s Day would be spent in Paris, but this year she will be celebrating the romantic day in Canada with Prince Harry"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13075801/Its-Harry-Meghan-2-0-Royal-rebrand-couple-launch-Office-Prince-Harry-Meghan-website-Sussex-com-modestly-insists-pair-shaping-future-business-philanthropy.html",
        "title": "It&#39;s <b>Harry</b> and Meghan 2.0! Royal rebrand as couple launch The Office of <b>Prince Harry</b> and Meghan website Sussex.com which modestly insists pair are &#39;shaping the future through ...",
        "description": "The website is operated by &#39;The Office of The Duke and Duchess of Sussex &#39; and is a &#39;one-stop shop&#39; for all their activities."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-quietly-202224051.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Quietly Launch New Sussex.com Website",
        "description": "Meghan Markle and Prince Harry just got an online makeover. The Duke and Duchess of Sussex quietly launched a new website, Sussex.com, on Monday. The web address encompasses the latest news about the couple, bios for Prince Harry, 39, and Meghan, 42, as well as links to their Archewell Foundation organization and Archewell Productions hub."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865961/prince-harry-meghan-markle-new-website-latest",
        "title": "<b>Prince Harry</b> and Meghan Markle rebuilding Sussex brand as they launch new website",
        "description": "Prince Harry and Meghan Markle have launched a new website ahead of their trip to Canada this week. Sussex.com went &#39;live&#39; on Monday and is operated by the Office of the Duke and Duchess of Sussex, as a &quot;one-stop shop&quot; for all of their activities."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1865944/prince-harry-litter-picking-king-charles-news",
        "title": "<b>Prince Harry</b> mocked for &#39;perfectly normal&#39; habit that King Charles taught him",
        "description": "Prince Harry once revealed the different kind of habits he learned from King Charles including one that &#39;baffled&#39; his wife Meghan Markle, and another one that led to him being mocked at school."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25666646/prince-harry-meghan-markle-new-website/",
        "title": "<b>Prince Harry</b> and Meghan Markle ditch Archewell &amp; launch slick NEW website to share ‘personal updates’ with the world",
        "description": "PRINCE Harry and Meghan Markle have launched a new website amid a major rebrand after rumours swirled they were chasing a new deal. The couple have dubbed the site Sussex.com as a “one-stop"
    },
    {
        "url": "https://uk.style.yahoo.com/exclusive-daniel-fletcher-named-royal-193411274.html",
        "title": "EXCLUSIVE: Daniel Fletcher Named Royal Ascot’s Creative Director for 2024 Season",
        "description": "The British menswear designer will curate the event’s annual look book and Millinery Collective, two campaigns that promote fashion."
    },
    {
        "url": "https://www.standard.co.uk/comment/king-charles-princess-of-wales-prince-william-royals-illness-b1138649.html",
        "title": "There’s a lot to be said for monarchy — but just think what we ask from the royals",
        "description": "He seemed so happy. In his memoir Spare, <b>Prince Harry</b> said William had been drinking. But <b>Harry</b> ran away: that says a lot too. Ralph Fiennes opposes a wind farm in Suffolk, where he was born, and where he dug up the Sutton Hoo treasure in 2021’s The Dig ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-cheerful-flight-back-185811528.html",
        "title": "<b>Prince Harry</b> Was Cheerful on Flight Back from U.K. After Visiting Dad King Charles, Says Source",
        "description": "The Duke of Sussex was spotted at London’s Heathrow Airport on Wednesday and was back in California on Thursday, and he then made a surprise appearance in Las Vegas that evening. Prince Harry stepped out at the NFL Honors at Resorts World Theater to award the Walter Payton NFL Man of the Year to Pittsburgh Steelers defensive tackle Cameron Heyward."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513324/meghan-markle-storytelling-new-outing-close-to-heart/",
        "title": "Meghan Markle is all smiles as she showcases her storytelling skills during special outing",
        "description": "The Duchess of Sussex enjoyed a special evening out with some people very close to her heart over the weekend. On Saturday, Meghan Markle joined the Southern California Welcome Project for an evening of storytelling and cooking."
    },
    {
        "url": "https://www.thesun.ie/royals/12192897/prince-george-school-choices-princess-kate-secondary/",
        "title": "<b>Prince</b> George’s school choices revealed as Princess Kate eyes £34k-a-year secondary amid ‘flashy’ concerns – see list",
        "description": "PRINCE George could attend a different secondary school to Princess Kate and Prince William, according to reports. The Prince and Princess of Wales have considered several schools for their eldest"
    },
    {
        "url": "https://www.devonlive.com/news/uk-world-news/king-charles-cancer-diagnosis-wake-9095331",
        "title": "King Charles&#39; cancer diagnosis was a &#39;wake-up call&#39; for <b>Prince Harry</b>",
        "description": "King Charles&#39; cancer diagnosis was a wake up call for Prince Harry, according to a Royal insider. The Duke of Sussex was in a rush to get back to the UK last week after hearing the news."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/12/duke-of-sussex-tell-invictus-games-canada-special-megxit/",
        "title": "Duke of Sussex to tell Invictus Games how special Canada is to him after Megxit",
        "description": "Sussexes are to visit the Vancouver Whistler &#39;one year to go&#39; event in bid to draw attention to wounded service personnel"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13073669/will-harry-return-duke-sussex-london.html",
        "title": "Could <b>Prince Harry</b> return to the UK in May? Duke may attend the Invictus Games 10th anniversary service in London, source claims - after flying visit to cancer-stricken King ...",
        "description": "Harry has indicated that he is comfortable coming back for a British-based Invictus Games. An anniversary service is to be held in May at St Paul&#39;s Cathedral."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513316/prince-harry-and-meghan-markle-launch-new-sussex-website/",
        "title": "<b>Prince Harry</b> and Meghan Markle launch Sussex.com website in major rebrand - Exclusive",
        "description": "The Duke and Duchess of Sussex have launched a new website, Sussex.com on the eve of their trip to Canada. Prince Harry and Meghan unveiled the new site, which is operated by the Office of the Duke and Duchess of Sussex, as a &quot;one-stop shop&quot; for all their activities."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-prince-harrys-45-minute-meeting-with-his-father-could-have-a-secret-meaning_art21107.html",
        "title": "King Charles: <b>Prince Harry</b>’s 45-minute meeting with his father could have a secret meaning",
        "description": "After King Charles announced to the public his new health scare, Prince Harry flew to the UK to visit his father. There could be a hidden meaning as to"
    },
    {
        "url": "https://uk.style.yahoo.com/netflix-gets-scoop-prince-andrews-161506308.html",
        "title": "Netflix Gets the &#39;Scoop&#39; on <b>Prince</b> Andrew&#39;s Bombshell BBC Interview in New Movie Trailer",
        "description": "Netflix said the film, starring Gillian Anderson and Rufus Sewell, will reveal &quot;the story of the women who secured the scoop of the decade&quot; this April"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/world-news/prince-harrys-sweet-tribute-meghan-28618186",
        "title": "<b>Prince Harry</b>&#39;s sweet tribute to Meghan Markle and kids spotted in resurfaced video",
        "description": "Prince Harry has a sweet tribute to his wife Meghan Markle and their two children in his home office, and the artwork was actually created by an independent artist"
    },
    {
        "url": "https://metro.co.uk/2024/02/12/kings-friends-say-walking-painting-will-keep-busy-cancer-diagnosis-20265608/",
        "title": "King’s friends say walking and painting will keep him busy after cancer diagnosis",
        "description": "King Charles will overcome boredom by painting and keeping active, his close friends have claimed. Buckingham Palace revealed to the nation that the monarch, 75, was suffering from an undisclosed form of cancer earlier this month."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markles-forgotten-32107500?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s forgotten website they were banned from using after weeks",
        "description": "When Prince Harry and Meghan Markle shocked the world by quitting as working royals they set up their own website - but it is no longer used by them, although it can still be accessed, due to a ruling"
    },
    {
        "url": "https://www.telegraph.co.uk/columnists/2024/02/12/prince-harry-king-charles-camilla-reconciliation/",
        "title": "<b>Prince Harry</b> ‘did not want to be in the same room as the Queen’ – more fool him",
        "description": "Hostilities flared up last week between Prince Harry and Queen Camilla. Or rather, the Duke of Sussex apparently launched an unprovoked volley in the direction of a 75-year-old woman. In an irony that will no doubt escape this self-proclaimed feminist and Lochinvar of the New World,"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-cant-rely-family-9094116",
        "title": "<b>Prince Harry</b> &#39;can&#39;t rely on family anymore&#39; after developing strained relationship",
        "description": "The Sussex&#39;s explosive interviews with the press have taken its toll on the Harry&#39;s relationship with his relatives"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25881895/prince-william-never-see-harry-royal-expert/",
        "title": "<b>Prince</b> William was never going to see <b>Harry</b> – not after everything he’s done, royal expert says",
        "description": "PRINCE William was never going to see Prince Harry after years of attacks by the duke, a royal expert has claimed. Writer and broadcaster Robert Jobson exclusively told The Sun’s Royal"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/uk-world-news/prince-harry-set-return-uk-9093589",
        "title": "<b>Prince Harry</b> &#39;set to return to UK in May&#39; for special event",
        "description": "Prince Harry is likely to return to the UK soon for the 10th anniversary of the Invictus Games, an event he founded. The Duke of Sussex made a quick trip to London after hearing about King Charles&#39;s cancer diagnosis,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-can-no-longer-32105309",
        "title": "<b>Prince Harry</b> can no longer &#39;lean back on&#39; the Royal Family, old pal claims",
        "description": "A former friend of the duke&#39;s believes that Harry no longer has relatives he can &quot;rely&quot; due to his broken relationship with the Royal Family."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-heartbreaking-real-reason-32107412",
        "title": "<b>Prince Harry</b>&#39;s &#39;heartbreaking&#39; real reason behind rush back to UK after King&#39;s cancer diagnosis",
        "description": "<b>Prince Harry</b>&#39;s real reason for rushing back home to the UK after the news of King Charles&#39; cancer diagnosis has been revealed. It&#39;s believed that the monarch himself told his youngest son about his poor health during a private phone call and the duke wasted no time in flying from LA to London to see his father."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-duchess-meghan-quietly-213100696.html",
        "title": "<b>Prince Harry</b> and Duchess Meghan Quietly Relaunch Their Official Royal Website",
        "description": "Microsoft’s head of Xbox, Phil Spencer, will directly address those Xbox multiplatform rumors on February 15. He’ll appear on the Official Xbox Podcast, along with Sarah Bond and Matt Booty. The focus is on whether the S&amp;P 500 can keep up its rally, with a key CPI test ahead."
    },
    {
        "url": "https://www.romper.com/entertainment/archie-lilibet-drawing-prince-harry-home-office",
        "title": "<b>Prince Harry</b> Has A Sweet Drawing Of Archie &amp; Lilibet Displayed In His Home Office",
        "description": "Prince Harry has a sweet drawing of his children with Meghan Markle, Archie and Lilibet, hung in his home office."
    },
    {
        "url": "https://www.kelownadailycourier.ca/news/national_news/article_ae600d0b-f107-5a34-baae-079cce40f958.html",
        "title": "No plans for royal tour by King Charles in Canada this year as monarch battles cancer",
        "description": "OTTAWA - King Charles will not travel to Canada for his first royal tour as Canada&#39;s monarch this year, as he battles cancer."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-reportedly-turned-invite-super-bowl.html/",
        "title": "<b>Prince Harry</b> Reportedly Turned Down an Invite to the Super Bowl — Here’s Why",
        "description": "Prince Harry reportedly rejected an offer to attend Super Bowl LVIII because of what he and Meghan Markle have coming up soon."
    },
    {
        "url": "https://people.com/meghan-markle-prince-harry-quietly-launch-new-website-sussex-8576365",
        "title": "Meghan Markle and <b>Prince Harry</b> Quietly Launch New Sussex.com Website",
        "description": "Meghan Markle and Prince Harry revamped their online presence with a new website, Sussex.com, quietly launched ahead of their trip to Canada for the one-year countdown to the Invictus Games."
    },
    {
        "url": "https://www.yahoo.com/news/lifestyle/meghan-markle-prince-harry-relaunch-193800739.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Relaunch Their Website",
        "description": "When <b>Prince Harry</b> and Meghan Markle got married, they split their household from <b>Prince</b> William and Kate Middleton, and began operating under the &quot;Sussex Royal&quot; brand. They began sharing updates with the world using the handle &quot;SussexRoyal&quot; on Instagram ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-king-charles-royal-32087494",
        "title": "&#39;Panic stricken’ <b>Prince Harry</b>&#39;s fears Charles had ‘sugar-coated’ cancer news",
        "description": "EXCLUSIVE: Following the worrying news of King Charles&#39; cancer diagnosis, a source tells OK! why Prince Harry was &quot;panic stricken&quot; and returned instantly"
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-major-185400701.html",
        "title": "Meghan Markle and <b>Prince Harry</b> will make a major joint Valentine’s Day appearance",
        "description": "Meghan Markle and Prince Harry are set to make a joint Valentine’s Day appearance. The couple will attend a launch event for the 2025 Invictus Games."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/prince-william-still-processing-king-28616715",
        "title": "<b>Prince</b> William &#39;still processing&#39; King Charles cancer news",
        "description": "Just a week after Kate was discharged from hospital following abdominal surgery last month, it was revealed the King had been diagnosed with a form of cancer"
    },
    {
        "url": "https://www.theargus.co.uk/news/24113403.piers-morgan-enjoys-pint-sussex-pub-prince-harry-settlement/",
        "title": "Piers Morgan enjoys pint at Sussex pub after <b>Prince Harry</b> settlement",
        "description": "Piers Morgan was spotted enjoying a pint at his favourite Sussex pub, The Royal Oak in Newick, just a day after the remainder of Prince"
    },
    {
        "url": "https://au.lifestyle.yahoo.com/suits-patrick-j-adams-gabriel-191952546.html",
        "title": "When &#39;Suits&#39; Patrick J. Adams and Gabriel Macht Last Spoke to Meghan Markle",
        "description": "&quot;The thing about it is, I know she has [<b>Prince] Harry</b>, right?&quot; he told Page Six while attending the National Board of Review Annual Gala last month. &quot;And of course the beautiful kids,&quot; Pierce added, referring to Markle and <b>Prince Harry</b>&#39;s two children ..."
    },
    {
        "url": "https://www.itv.com/news/central/2024-02-12/walsall-baker-creates-taylor-swift-super-bowl-cake-out-of-130kg-of-ingredients",
        "title": "Baker creates Taylor Swift Super Bowl cake out of 130kg of ingredients",
        "description": "Lara Mason spent 38 hours in her workshop creating the seven foot high replica of the singer. | ITV News Central"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-diagnosis-harry-william-kate-b2494556.html",
        "title": "King Charles cancer – latest: Monarch seen in first public appearance as <b>Harry</b> set to return to UK in weeks",
        "description": "After receiving his first cancer treatment, King Charles III has taken up residence at Sandringham House, which is located along the North Sea coast of eastern England. He stepped out on the grounds on Sunday as he attended church on his first public outing since his cancer diagnosis was revealed."
    },
    {
        "url": "https://www.ntnews.com.au/entertainment/celebrity-life/royals/king-charles-health-update-prince-william-upset-over-prince-harrys-uk-visit/news-story/cbfa433baf167dd3e9f99742ac4e0a5b",
        "title": "King Charles health update: <b>Prince</b> William ‘upset’ over <b>Prince Harry</b>’s UK visit",
        "description": "Prince William is “upset” over his brother Prince Harry’s 24-hour dash to see their cancer-stricken father, King Charles, it has been claimed."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25879843/prince-harry-sent-clear-message-royal-expert/",
        "title": "<b>Prince Harry</b> has been sent a clear message…he’s not forgiven &amp; he’s done a lot of damage, says royal expert",
        "description": "KING CHARLES and Prince William have sent Prince Harry a clear message that he’s not forgiven, a royal expert has claimed. Writer and broadcaster Robert Jobson exclusively told The Sun’s"
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/celebs-tv/prince-harry-heading-back-uk-28614737",
        "title": "<b>Prince Harry</b> heading back to the UK again &#39;in weeks&#39; after King Charles reunion",
        "description": "Prince Harry is tipped to return to the UK in May to celebrate the 10th anniversary of the Invictus Games, which he founded in 2014, in celebrations due to take place at St Paul&#39;s Cathedral"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513270/inside-prince-harry-king-charles-reunion/",
        "title": "Inside <b>Prince Harry</b> and King Charles&#39; emotional 45-minute reunion",
        "description": "The short reunion was the first meaningful time father and son had spent together since the death of Elizabeth II in September 2022. Although Harry attended his father&#39;s coronation last May, the two are thought to have only had limited contact since then amid the fallout around the Duke&#39;s controversial memoir Spare."
    },
    {
        "url": "https://www.ibtimes.co.uk/piers-morgan-reacts-prince-harrys-mgn-win-stern-warning-1723377",
        "title": "Piers Morgan Reacts To <b>Prince Harry</b>&#39;s MGN Win With Stern Warning",
        "description": "The TV host tells the Duke of Sussex to stop invading the privacy of the Royal Family in response to the royal&#39;s victory over his hacking case against MGN."
    },
    {
        "url": "https://www.ok.co.uk/royal/kate-middleton-meghan-markle-harry-32103476",
        "title": "Meghan Markle &#39;envious&#39; of <b>Prince Harry</b>&#39;s bond with sister-in-law Kate Middleton",
        "description": "A royal expert claims the Duchess of Sussex is &#39;envious&#39; of her sister-in-law, the Princess of Wales&#39;, close bond with Prince Harry as he &#39;always longed for a sister&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/camilla-king-charles-secret-weapon-2898574?ico=best_of_opinion",
        "title": "How Camilla became King Charles’s secret weapon",
        "description": "It portends a more high-profile role for Camilla – and surfaces testing questions about how the royal pecking order will work during the King’s illness and beyond. One one score, the Queen has scotched doubts about her commitment to duties by performing several public events in the last year (including the draining preparation for the coronation) and energetically working the crowds on visits to Berlin,"
    },
    {
        "url": "https://www.ibtimes.co.uk/king-charles-iii-unhappy-prince-harrys-visit-after-shock-cancer-diagnosis-says-royal-author-1723372",
        "title": "King Charles III &#39;Unhappy&#39; With <b>Prince Harry</b>&#39;s Visit After Shock Cancer Diagnosis, Says Royal Author",
        "description": "&quot;Harry caused some disquiet by &#39;taking it upon himself&#39; to fly over unbidden,&quot; claims royal biographer Robert Jobson."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68265751?at_link_type=web_link&at_ptr_name=facebook_page&at_campaign=Social_Flow&at_link_origin=BBC_Radio_Norfolk&at_format=link&at_bbc_team=editorial&at_medium=social&at_link_id=88B61596-C8C0-11EE-A0A7-4CD0413A1DFE&at_campaign_type=owned",
        "title": "King Charles thanks public for support after cancer diagnosis",
        "description": "What does it mean for William, <b>Harry</b> and the other royals? How will the King&#39;s duties change? Timeline: The King&#39;s health Speaking at a charity fundraiser for London&#39;s Air Ambulance, attended by guests including Hollywood star Tom Cruise, <b>Prince</b> William ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-cancer-diagnosis-harry-william-kate-b2494556.html?page=4",
        "title": "King Charles cancer – latest: Monarch smiles and waves at Sandringham as William ‘upset’ with <b>Harry</b>",
        "description": "Ingrid Seward, editor-in-chief of Majesty Magazine, said that William would be “upset” as it would look to him that Harry merely used the visit as a “PR opportunity”. King Charles III has been diagnosed with a form of cancer and has begun treatment, Buckingham Palace has said, less than a year after he was crowned."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/prince-harry-had-no-plans-011221379.html",
        "title": "<b>Prince Harry</b> Had No Plans to Attend Super Bowl Despite NFL Honors Appearance",
        "description": "Prince Harry and Meghan Markle had no intention of attending the Super Bowl on Sunday, despite the Duke of Sussex&#39;s appearance at the NFL Honors a few days earlier, PEOPLE understands."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/king-charles-health-updates-cancer-news/page/10/",
        "title": "<b>Prince Harry</b> updates — Duke and Meghan ‘will attend’ Super Bowl as Kate Middleton ‘recovering well’ from abdominal op",
        "description": "PRINCE Harry and Meghan Markle will attend this weekend’s Super Bowl just days after the Duke’s whirlwind visit to the UK, sources say. Harry met with King Charles in a short 30-minute"
    },
    {
        "url": "https://uk.style.yahoo.com/why-prince-harry-meghan-markle-222000139.html",
        "title": "Why <b>Prince Harry</b> and Meghan Markle Will Not Attend the Super Bowl",
        "description": "Prince Harry attended the NFL Honors in Las Vegas, but that doesn&#39;t mean he will be at the Super Bowl on Sunday."
    }
]