[
    {
        "url": "https://edmonton.ctvnews.ca/beauty-in-the-struggle-edmonton-tiktoker-aims-to-end-hunger-with-street-outreach-1.6701016",
        "title": "&#39;Beauty in the struggle&#39;: Edmonton TikToker aims to end hunger with street outreach",
        "description": "Kora-lea Vidal, once a running back for Canada&#39;s silver-medal-winning national football team, says she never thought she&#39;d escape domestic violence and become homeless."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12899723/Princess-Charlottes-Mia-Tindall-flowers-Kate-Middleton-Prince-Andrew-Sarah-Ferguson-Sandringham-church-service.html",
        "title": "Moment helpful cousins Princess Charlotte and Mia Tindall take flowers from Kate Middleton while <b>Prince</b> Andrew and Sarah Ferguson joke with crowds after Sandringham church service",
        "description": "Cousins Princess Charlotte and Mia Tindall greeted crowds today after the Christmas church service at Sandringham today where they took flowers from Princess Kate."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-fell-out-actor-31747976",
        "title": "<b>Prince Harry</b> fell out with actor over &#39;filthy jokes&#39;, &#39;naked dance&#39; and &#39;prosthetic leg&#39;",
        "description": "Dominic West said Prince Harry got very rowdy on his trip to the South Pole and claimed he &#39;told filthy jokes while others danced naked&#39;, but his candid admissions didn&#39;t go down well with the royal"
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-christmas-speech-snub-31748076",
        "title": "King Charles&#39; Christmas speech snub to <b>Prince Harry</b> and Meghan Markle as he praises &#39;beloved&#39; royals",
        "description": "King Charles III delivered his second-ever Christmas speech to the nation but there was no mention of his youngest son Prince Harry and his wife Meghan Markle"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/25/prince-louis-mia-royal-christmas-sandringham/?n=@",
        "title": "<b>Prince</b> Louis and Mia Tindall lead the Royal Christmas at Sandringham",
        "description": "Well-wishers greet the youngsters after Monday morning&#39;s youthful and joyous service at St Mary Magdalene Church"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12899629/Prince-Harry-Meghan-Markle-Christmas-mansion-montecito-Archie-Lilibet.html",
        "title": "<b>Prince Harry</b> and Meghan Markle spend Christmas at their mansion in Montecito with Archie and Lilibet after last joining royal family for festive celebrations in 2018",
        "description": "Harry, Meghan and their children Prince Archie, 4, and Princess Lilibet, 2, will spend the day at their family home, surrounded by Meghan&#39;s mother Doria Ragland and their friends, sources have claimed."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/king-uses-christmas-message-to-praise-growing-awareness-of-protecting-environment/",
        "title": "King uses Christmas message to praise &#39;growing awareness&#39; of protecting environment",
        "description": "King Charles has used his second Christmas message to praise people&#39;s growing awareness of how we must protect our Earth."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/breaking-prince-harry-meghan-markle-31745220",
        "title": "<b>Prince Harry</b> and Meghan Markle snubbed by King Charles on Christmas Day in his speech",
        "description": "Prince Harry and Meghan Markle didn&#39;t get a mention in King Charles&#39; Christmas Day speech after stepping down as working royals three years ago"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/25/sarah-ferguson-duchess-of-york-royal-family-sandringham/",
        "title": "Duchess of York joins Royal family at Sandringham for first time in 30 years",
        "description": "Sarah Ferguson made a surprise appearance at the Christmas Day service alongside ex-husband Prince Andrew and daughters Beatrice and Eugenie"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1849058/king-charles-christmas-speech-prince-harry",
        "title": "King Charles is right to ignore <b>Prince Harry</b> and Meghan Markle in Christmas speech",
        "description": "COMMENT: King Charles has delivered his second Christmas Speech as monarch where he praised a number of royals for their tireless devotion to the Crown - but Prince Harry and Meghan Markle were notably absent."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25161488/king-charles-prince-harry-andrew-christmas-message/",
        "title": "King Charles fails to mention <b>Prince Harry</b> or Andrew in Christmas message – after fresh scandal hit Duke of York",
        "description": "KING Charles has failed to mention Prince Harry or Prince Andrew in his Christmas message.  Most senior members of the royal family featured in his annual speech – but the Duke of York and"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25159619/kings-speech-christmas-2023-charles-william-kate-updates/page/2/",
        "title": "King’s Speech 2023 LIVE — Charles hails key workers in moving Christmas day address as royals gather at Sandringham",
        "description": "KING Charles delivered his second Christmas address as monarch to the nation today as he is hailed essential workers. The King took to our screens at 3pm to reflect on 2023 and look forward"
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-makes-major-departure-190020776.html",
        "title": "King Charles makes major departure from Queen in his Christmas speech",
        "description": "In 2019, Prince Harry and Meghan and Prince Andrew were notably missing from the Queen’s speech table following a turbulent year for the royals and now it seems that King Charles has ditched the tradition altogether. Some commentators suggested that the move was made to avoid the awkward choice to include or exclude Harry and Meghan."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848975/royal-family-live-meghan-markle-prince-harry-new-year-redemption",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan ordered to &#39;just stop&#39; as they plan redemption",
        "description": "Journalist Emma Woolf told Talk TV viewers, &#39;Just make them stop!&#39;, amid reports the Duke and Duchess of Sussex want to get closer to Hollywood."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/prince-harry-cut-ties-crown-28347193",
        "title": "<b>Prince Harry</b> &#39;cut ties&#39; with The Crown actor after he &#39;said too much&#39; during an interview",
        "description": "Dominic West, who plays King Charles in the popular Netflix series The Crown, has openedup about his friendship with Prince Harry - revealing that the two are no longer speaking after he &quot;said too much&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/real-reason-prince-harry-broke-31747356.amp",
        "title": "The real reason <b>Prince Harry</b> broke off friendship with The Crown&#39;s Dominic West",
        "description": "The Crown&#39;s Dominic West revealed the truth behind his fallout with Prince Harry after admitting the reason they no longer speak is probably because he once &#39;said too much&#39; during a press conference"
    },
    {
        "url": "https://uk.yahoo.com/news/prince-andrew-attends-royal-christmas-121511419.html",
        "title": "<b>Prince</b> Andrew Attends Royal Christmas as Ex-Wife Sarah Ferguson Joins for First Time Since 1990s",
        "description": "Prince Andrew and Sarah Ferguson joined members of the royal family for their traditional Christmas Day church outing."
    },
    {
        "url": "https://uk.style.yahoo.com/king-charles-queen-camilla-lead-121229673.html",
        "title": "King Charles and Queen Camilla Lead Christmas Walk During an Extra Special Year for Camilla",
        "description": "This year is set to be an extra special holiday for Queen Camilla. While Camilla would leave the royal family&#39;s Christmas gathering in the afternoon to spend time with her children and grandchildren on the holiday in years past, King Charles reportedly invited his wife&#39;s family to Sandringham this year."
    },
    {
        "url": "https://www.edp24.co.uk/news/24011146.royal-family-attend-christmas-church-service-norfolk/",
        "title": "Royal family attend Christmas church service in Norfolk",
        "description": "The royal family was seen marking Christmas Day in Norfolk by attending a traditional church service at Sandringham estate with smiles and waves."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/news/prince-harry-meghan-markle-christmas-b2469316.html",
        "title": "How <b>Harry</b> and Meghan will spend Christmas this year",
        "description": "It is unlikely the Sussexes will fly back to the UK to spend Christmas at Sandringham this year, delaying any chance of a royal reconciliation"
    },
    {
        "url": "https://uk.news.yahoo.com/sarah-ferguson-joins-royal-family-152828152.html",
        "title": "Sarah Ferguson Joins Royal Family Christmas Walk For First Time In Years",
        "description": "Christmas morning in the UK saw the King lead the royal family’s traditional walk to church from his home of Sandringham in Norfolk, eastern England, with some familiar faces on display. Included in the family outing was his brother Prince Andrew – seemingly back in the royal fold for private events,"
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-family-christmas-card-best-worst-b2469310.html",
        "title": "The best (and worst) royal Christmas cards of all time",
        "description": "From family portraits to memorable trips, the British royal family has made it a tradition to send out a Christmas card every year"
    },
    {
        "url": "https://www.theguardian.com/tv-and-radio/2023/dec/25/top-tv-moments-of-2023",
        "title": "Sex noises on Match of the Day to Brian Cox’s X-rated speech: it’s 2023’s wildest TV moments",
        "description": "The world’s worst Prince Harry impersonator! Naga Munchetty crying over a pigeon! That middle finger! Here are the year’s most jaw-dropping bits of television"
    },
    {
        "url": "https://calgary.ctvnews.ca/byfield-scores-twice-as-kings-halt-hot-flames-5-3-1.6701008",
        "title": "Byfield scores twice as Kings halt hot Flames 5-3",
        "description": "Quinton Byfield scored twice, Trevor Moore got his team-leading 16th goal, and the Los Angeles Kings defeated the Calgary Flames 5-3 on Saturday night. Alex Laferriere and Pierre-Luc Dubois also scored, Cam Talbot made 29 saves and the Kings avoided their first three-game losing streak on home ice."
    },
    {
        "url": "https://www.nzherald.co.nz/lifestyle/prince-harry-meghan-markle-and-children-spend-christmas-in-montecito-with-friends-and-family/7AVQ52UM4BBSVPWKNSNNFN64TU/",
        "title": "<b>Prince Harry</b>, Meghan Markle and children spend Christmas in Montecito with friends and family",
        "description": "Prince Harry and Meghan Markle were absent from the royal family’s Christmas at Sandringham, but it appears they still had a wholesome day spent with family and friends. The couple and their two children,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/kate-middleton-refused-spend-christmas-royal-family-until-ring-on-finger-insider-reveals.html/",
        "title": "A Young Kate Middleton Refused to Spend Christmas With the Royal Family Until She ‘Had a Ring on Her Finger,’ Insider Reveals",
        "description": "Kate Middleton reportedly rejected Prince William&#39;s invite to Christmas at Sandringham once because he had not proposed."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141720-taylor-swift-brings-santa-to-travis-kelce-s-christmas-game-video-goes-viral",
        "title": "Taylor Swift brings Santa to Travis Kelce’s Christmas game, video goes viral",
        "description": "Taylor Swift gave a special present to Travis Kelce on Christmas Day as she arrived in Arrowhead Stadium with Santa to support her boyfriend as he and the Chiefs took on the Las Vegas Raiders in Christmas showdown on Monday."
    },
    {
        "url": "https://gamerant.com/harry-potter-love-magic-explained/",
        "title": "<b>Harry</b> Potter: Love Magic, Explained",
        "description": "While it may sound too cheesy to actually be real, it is true that love might be the most important form of magic in the Harry Potter world. Without love magic, Voldemort would have become a force that no wizard alive could have stopped. It may be shocking, but there is a lot to learn about love magic."
    },
    {
        "url": "https://nypost.com/2023/12/25/entertainment/royals-including-prince-andrew-attend-christmas-church-service/",
        "title": "Royals, including disgraced <b>Prince</b> Andrew, attend Christmas church service",
        "description": "The disgraced Prince Andrew, who was “fired” from his royal duties in 2020, also attended with his ex-wife Sarah Ferguson. Ferguson’s attendance was especially noteworthy, as she"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1141713-king-charles-deals-fresh-blow-to-prince-harry",
        "title": "King Charles deals fresh blow to <b>Prince Harry</b>",
        "description": "King Charles III appeared teaching a lesson to his younger son Prince Harry with his Christmas Day message on Monday. The 75-year-old praised the &#39;beloved&#39; royals as his speech, aired on BBC One, showcased Buckingham Palace and highlighted the charity work done by Prince William, Princess Kate and their three children in 2023."
    },
    {
        "url": "https://nypost.com/2023/12/25/entertainment/prince-louis-steals-the-show-during-royal-carols-christmas-broadcast/",
        "title": "<b>Prince</b> Louis steals the show during Royal Carols Christmas broadcast: ‘Look how excited!’",
        "description": "Prince Louis, 5, amused and delighted audiences during his first appearance at the annual Royal Carol service in the UK. Broadcast on Christmas Eve, “Royal Carols: Together at Christmas” took place at Westminster Abbey, taped on Dec. 8 but broadcast on Dec. 24."
    },
    {
        "url": "https://www.aol.com/lifestyle/princess-margaret-once-gave-prince-150000638.html",
        "title": "Princess Margaret Once Gave <b>Prince Harry</b> the Oddest Christmas Present",
        "description": "Prince Harry is sharing rare details about his relationship with Princess Margaret, including the interesting Christmas gift he received from her. In his memoir Spare, the Duke of Sussex, 39, discussed his experience with several members of the royal family."
    },
    {
        "url": "https://www.btimesonline.com/articles/162859/20231226/dominic-wests-royal-rift-actor-reveals-fallout-with-prince-harry.htm",
        "title": "Dominic West&#39;s Royal Rift: Actor Reveals Fallout with <b>Prince Harry</b>",
        "description": "Dominic West, known for his portrayal of Prince Charles in Netflix&#39;s &quot;The Crown,&quot; has opened up about the end of his friendship with Prince Harry, which dates back to their shared involvement in the &quot;"
    },
    {
        "url": "https://www.wionews.com/world/king-charles-iii-delivers-peace-message-on-christmas-prince-harry-meghan-remain-missing-673465",
        "title": "King Charles III delivers peace message on Christmas; <b>Prince Harry</b>, Meghan remain missing",
        "description": "King Charles III on Monday (Dec 25) delivered his second Christmas message, focusing on environmentalism and peace. Addressing the whole of Britain in a pre-recorded video message, the monarch touched upon various topics,"
    },
    {
        "url": "https://www.gulftoday.ae/opinion/2023/12/25/royal-family-bizarre-eating-habits-and-unspoken-dining-rules",
        "title": "Royal family’s bizarre eating habits and unspoken dining rules",
        "description": "In an interview with Marie Claire, Darren McGrady — who worked for the British royal family as their private chef between 1982 and 1993 — revealed some of the eating habits of the late Her Majesty the Queen,"
    },
    {
        "url": "https://www.aol.com/lifestyle/prince-harry-says-son-archie-140000900.html",
        "title": "<b>Prince Harry</b> Says Son Archie Broke Christmas Ornament of Queen Elizabeth",
        "description": "We all know “accidents happen”—but this saying even applies to royals. In an excerpt from Prince Harry’s bombshell memoir, Spare, the Duke of Sussex, 39, details how his son, Archie, 4, broke a present he opened on Christmas Eve in 2020."
    },
    {
        "url": "https://torontosun.com/entertainment/celebrity/dominic-west-reveals-why-he-and-prince-harry-are-no-longer-on-speaking-terms",
        "title": "Dominic West reveals why he and <b>Prince Harry</b> are no longer on speaking terms",
        "description": "Long before Dominic West took on the role of Prince Charles on The Crown, he and Prince Harry were pals in real life. But the two men no longer speak after the royal cut ties with West. West, who has starred on The Affair and The Wire, was asked about his friendship with the royal, to which the actor revealed that it is no more."
    },
    {
        "url": "https://www.ok.co.uk/royal/royal-news/royal-family-live-christmas-church-31746438",
        "title": "Royal Family LIVE: Meghan and <b>Harry</b> spend Christmas in California as Charles breaks tradition with annual speech",
        "description": "Meghan Markle and Prince Harry will once again be spending Christmas in America as the Royal Family descend on Sandringham for a church service followed by lunch"
    },
    {
        "url": "https://www.ibtimes.co.uk/former-royal-butler-reveals-bizarre-gifts-he-received-king-charles-iii-1722361",
        "title": "Former Royal Butler Reveals &#39;Bizarre&#39; Gifts He Received From King Charles III",
        "description": "She gave him a spoon embossed with &quot;cereal killer&quot; on the shallow bowl end. The book likewise shared that <b>Prince Harry</b> gave Queen Elizabeth II in 2018 a cap emblazoned with the phrase &quot;Ain&#39;t life a (expletive)&quot; which she loved. Another time he gave her a ..."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25127769/reverse-ageing-two-weeks-royal-nutritionist-prince-harry/",
        "title": "How to reverse ageing in just 2 weeks, according to royal go-to nutritionist who has worked with <b>Prince Harry</b> &amp; Eugenie",
        "description": "DO you ever look in the mirror and wish you could pause the clock on ageing or even wind it back in time? Thankfully there are many easy tricks you can do to look more youthful in just two weeks,"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510044/prince-louis-grabs-princess-kates-attention-in-adorable-carol-service-moment/",
        "title": "<b>Prince</b> Louis grabs Princess Kate&#39;s attention in adorable carol service moment",
        "description": "During the service, <b>Harry</b> Potter star Jim Broadbent took to the stage to read The Father Christmas Letters from JRR Tolkien, which appeared to delight the little <b>Prince</b>, five, who was entranced watching the actor, nudging his mum and whispering &quot;Mama!&quot;"
    },
    {
        "url": "https://www.standard.co.uk/shopping/esbest/fashion/best-ski-socks-b1127764.html",
        "title": "Best ski socks for hitting the slopes in snug style",
        "description": "High-profile dressers such as Bella Hadid, Hailey Bieber and Emily Ratajkowksi have fallen prey to the allure of Salomon pieces, while Arc’teryx’s clientele has grown to include Drake and even <b>Prince Harry</b>. While saving up for the full shebang of a ..."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/meghan-markle-lets-slip-what-31701518?int_source=nba",
        "title": "Meghan Markle lets slip what Archie wants for Christmas - and why he won&#39;t be getting it",
        "description": "Meghan and <b>Prince Harry</b> are expected to spend Christmas in California with their children Archie, four, and two-year-old Princess Lilibet. There&#39;s no doubt the youngsters will be in line for some lovely gifts from their parents. However, speaking at an ..."
    }
]