[
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-william-loathed-princess-dianas-31783989",
        "title": "<b>Prince</b> William &#39;loathed&#39; Princess Diana&#39;s act for him and brother <b>Harry</b>",
        "description": "Prince Harry claims in his memoir Spare that his older brother Prince William &#39;didn&#39;t want to know him&#39; at Eton and hated the two of them being thought of as a &#39;package deal&#39;"
    },
    {
        "url": "https://www.theaustralian.com.au/commentary/prince-harry-very-much-under-meghans-thumb/video/bc5685bf9e549c701df550d279e05ad5",
        "title": "<b>Prince Harry</b> very much ‘under Meghan’s thumb’",
        "description": "Royal commentator and biographer Angela Levin says Prince Harry is “very much under Meghan’s thumb” and will listen to what she says. A NOTE ABOUT RELEVANT ADVERTISING: We collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites."
    },
    {
        "url": "https://www.skynews.com.au/opinion/royal-family-cant-trust-prince-harry-and-meghan-markle/video/86d05efcfa937dc12fea4dc0e97ee6b5",
        "title": "Royal Family ‘can’t trust’ <b>Prince Harry</b> and Meghan Markle",
        "description": "Royal commentator and biographer Angela Levin warns the Royal Family “can’t trust” Meghan Markle and Prince Harry. The royal commentator was asked what it would take for Prince Harry to return to the Royal fold. “I fear if they do come back as Harry is alleged to want – Meghan does not,” she told Sky News host James Macpherson."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850872/prince-harry-waited-princess-diana-will-changed-inheritance",
        "title": "<b>Prince Harry</b> waited five years longer than Diana wanted to receive his inheritance",
        "description": "Prince Harry was just 12 when his mother Princess Diana died - and she had written a number of her final wishes before her life was tragically cut short."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1850877/prince-harry-king-charles-frogmore-archie-lilibet",
        "title": "<b>Prince Harry</b>&#39;s &#39;seven-word question&#39; to King Charles after he ordered Frogmore eviction",
        "description": "Michael Cole described the lack of contact between the King and his grandchildren as &quot;very sad&quot;. He told GB News: &quot;When the King asked Prince Harry and his wife to vacate Frogmore Cottage, Harry said &#39;doesn&#39;t the King want to see his grandchildren&#39;."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-meghan-markles-high-31707733",
        "title": "<b>Prince Harry</b> and Meghan Markle&#39;s &#39;high risk&#39; 2024 plan - &#39;total system reboot and seismic changes&#39;",
        "description": "Prince Harry and Meghan Markle have certainly had an eventful past 12 months but what could be in store for them in 2024 and what can they do to boost their brand? Here we take a"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/01/queen-margrethe-prince-frederik-mary-denmark-abdication/",
        "title": "How a bar room romance put a Scot on the throne of Denmark",
        "description": "The romance between Crown Prince Frederik and his Scottish-Australian wife Mary has finally reached its fairytale"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/boy-16-killed-in-primrose-hill-stabbing-on-new-years-eve-is-named-by-police/",
        "title": "Boy, 16, killed in Primrose Hill stabbing on New Year&#39;s Eve is named by police",
        "description": "A 16-year-old boy who was stabbed to death on New Year&#39;s Eve in London has been named by police. Harry Pitman was attacked at about 11.40pm on Primrose Hill, north London, on Sunday night, the Met Police said."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/boy-16-stabbed-to-death-on-new-years-eve-on-primrose-hill-named-by-police-as-teenager-arrested/",
        "title": "Boy, 16, stabbed to death on New Year&#39;s Eve on Primrose Hill named by police - as teenager arrested",
        "description": "A 16-year-old boy who was stabbed to death on New Year&#39;s Eve in London has been named by police. Harry Pitman was attacked at about 11.40pm on Primrose Hill, north London, on Sunday night, the Met Police said."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510346/king-charles-feeling-unsettled-2024-begins/",
        "title": "King Charles feeling &#39;unsettled&#39; as family rift continues into 2024",
        "description": "King Charles is feeling &quot;less settled and calm&quot; as he goes into 2024 and his relationship with his son the Duke of Sussex remains strained, astrologer to the stars, Debbie Frank, has said."
    },
    {
        "url": "https://metro.co.uk/2024/01/01/harry-potter-stars-kids-embarrassed-films-20048871/?ico=mosaic_tag",
        "title": "<b>Harry</b> Potter star’s kids ’embarrassed’ by her in films",
        "description": "Harry Potter star Jessie Cave’s kids are ’embarrassed’ by their mother’s part in the franchise. The 36 year old’s children are hooked on the magical world of Hogwarts over 20 years after Harry Potter and the Philosopher Stone’s release in 2001."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12916265/Meanwhile-Count-Nikolai-looks-2023-glam-photos-Australia-started-new-life-stripped-title-Frederik-takes-throne-Denmarks-Prince-Harry-brought-fold.html",
        "title": "Meanwhile down under! Count Nikolai looks back on 2023 with glam photos in Australia where he started a new life after being stripped of his title - but as Frederik takes the ...",
        "description": "Queen Margrethe stripped Prince Joachim&#39;s four children of their prince and princess titles in 2022, leaving Nikolai a count. He then headed Down Under to study on exchange at University of Technology."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12916207/Charles-Camillas-carriage-2024.html",
        "title": "Charles and Camilla&#39;s New Year shout-outs: King and Queen share 2023 highlights video which includes William and Kate, Gareth Southgate and Andy Burnham - but NOT <b>Harry</b>, Meghan ...",
        "description": "His Majesty is seen talking to his wife and waving to crowds in a rare glimpse inside their horse drawn carriage after it left Buckingham Palace and headed down The Mall on November 7 this year."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-makes-same-new-31783305",
        "title": "Meghan Markle makes the same New Year resolutions each year but always fails after a &#39;few drinks&#39;",
        "description": "The Duchess of Sussex previously revealed some of her most &#39;unladylike&#39; habits that she tries to give up each year but never abides by after consuming alcohol."
    },
    {
        "url": "https://uk.news.yahoo.com/buckingham-palace-sources-prince-william-140000328.html",
        "title": "Buckingham Palace Sources Say <b>Prince</b> William and King Charles Have a &quot;Rivalry&quot; Over William&#39;s Desire for Power",
        "description": "Buckingham Palace sources say Prince William and King Charles have a new &quot;rivalry&quot; thanks to Prince William wanting more influence and control over the monarchy."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/510348/prince-harry-meghan-markle-preparing-family-move/",
        "title": "&#39;Restless&#39; <b>Prince Harry</b> preparing for family move: &#39;He&#39;ll do what the royal family least expects&#39;",
        "description": "Reading Prince Harry and Meghan Markle &#39;s astrological charts for 2024, Debbie, who was Princess Diana&#39;s close confidante, has exclusively told HELLO! that a move is on the cards for the Sussex family – and that Harry will do what the royal family &quot;least expects&quot;."
    },
    {
        "url": "https://www.ok.co.uk/celebrity-pictures/gallery/celeb-psychic-sally-morgans-2024-31718821",
        "title": "Celeb psychic Sally Morgan’s 2024 predictions in full - from Josie Gibson to <b>Harry</b> and Meghan",
        "description": "EXCLUSIVE: Psychic Sally Morgan has made her predictions about what&#39;s in store for some of our favourite stars in 2024 - and a few of them are in for a wild ride"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-wants-answers-king-31781478",
        "title": "Meghan Markle &#39;wants answers&#39; from King Charles, says royal expert",
        "description": "Meghan Markle has reportedly tried to arrange a meeting with King Charles to discuss why she has been subjected to different rules to other members of the Royal Family"
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24020546.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to <b>Prince Harry</b>",
        "description": "From Barbie to Prince Harry, test how much you remember about 2023 with our epic 23-question end-of-the-year quiz."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-seeking-answers-king-31781789",
        "title": "Meghan Markle is seeking &#39;answers&#39; from King Charles amid &#39;confusion&#39;, royal expert claims",
        "description": "The Duchess of Sussex is said to have questions about why she and Prince Harry have been subjected to different rules to other members of the Royal Family, according to an expert."
    },
    {
        "url": "https://www.ibtimes.co.uk/nostradamus-predictions-2024-naval-battle-crisis-royal-family-1722468",
        "title": "Nostradamus Predictions For 2024: A Naval Battle And Crisis In The Royal Family",
        "description": "The French seer is said to have predicted that a new Pope will soon replace Pope Francis. The morbid prediction says that he might pass away in 2024. &quot;Through the death of a very old Pontiff, A Roman of good age will be elected, Of him it will be said that he weakens his see, But long will he sit and in biting activity.&quot;"
    },
    {
        "url": "https://www.vogue.co.uk/article/gen-z-european-queens",
        "title": "Meet The Next Generation Of European Queens",
        "description": "The world has been gripped by so-called “Leonormania” in recent weeks, after the heir to the Spanish throne turned 18. The eldest of King Felipe and Queen Letizia’s two daughters, Princess Leonor is fast-becoming a national obsession, with her every fashion choice (and potential boyfriend) documented and dissected."
    },
    {
        "url": "https://www.btimesonline.com/articles/162986/20240102/prince-harry-misses-uk-life-as-meghan-markle-faces-spoilt-label-amidst-royal-feud.htm",
        "title": "<b>Prince Harry</b> Misses UK Life as Meghan Markle Faces Spoilt Label Amidst Royal Feud",
        "description": "Prince Harry&#39;s public declarations of missing &quot;the weird family gatherings&quot; and the &quot;British way of life,&quot; as shared in their Netflix documentary, have sparked a debate about the authenticity of his sentiments."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/most-damning-celebrity-memoir-revelations-of-2023-101704126958104.html",
        "title": "Most damning celebrity memoir revelations of 2023",
        "description": "Bombshell celebrity memoirs that shook 2023, featuring intimate insights from Prince Harry, Britney Spears, Jada Pinkett Smith, and more."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/queen-elizabeths-very-different-reactions-kate-middleton-meghan-markles-wedding-dresses-caught-camera.html/",
        "title": "Queen Elizabeth’s Very Different Reactions to Kate Middleton and Meghan Markle’s Wedding Dresses Caught on Camera",
        "description": "Prince William and Kate Middleton were married at London’s Westminster Abbey in 2011. Then seven years later, Prince Harry and Meghan Markle tied the knot in St. George’s Chapel at Windsor Castle. Each wedding was a grand affair watched by millions around the world and both brides donned show-stopping wedding gowns."
    },
    {
        "url": "https://www.itv.com/watch/news/sixteen-year-old-boy-stabbed-to-death-on-new-years-eve-named-as-harry-pitman/whznbj9",
        "title": "Sixteen-year-old boy stabbed to death on New Year&#39;s Eve named as <b>Harry</b> Pitman",
        "description": "Mon 1 Jan 5pm • Police said the 16 year old was with friends near a viewing platform on Primrose Hill in London on New Year&#39;s Eve when he &quot;became involved in an altercation&quot;."
    },
    {
        "url": "https://blazingcatfur.ca/2024/01/01/could-the-royals-get-any-more-rotten/",
        "title": "Could the royals get any more rotten?",
        "description": "2023 has left the arrogance of Charles and the ridiculousness of the Sussexes brutally exposed. 2023 – the year of King Charles’s coronation and Prince Harry’s Spare – was a weird year for a republican like me. Though I nurse a profound and lifelong loathing for Charles, I found myself repeatedly taking his side against Harry and Meghan of Montecito. Add to this my weakness for Diana-faced Prince William (even when he is manhandling man-necklaces) and his well-groomed, well-meaning wife (great-great-granddaughter of a miner, daughter of a trolly dolly), and my attitude towards the British monarchy became something of a hot mess."
    },
    {
        "url": "https://www.aol.com/princess-diana-brother-unveils-portrait-140000705.html",
        "title": "Princess Diana’s Brother Unveils Portrait of Their Dad (and Fans Think He Looks Like <b>Prince</b> George)",
        "description": "It always reminds us how strong the royal genes are whenever we see the striking resemblance between members of the British royal family and their distant relatives. (We can’t be the only ones who think Princess Charlotte looks like the spitting image of Princess Diana’s niece,"
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/meghan-markle-prince-harry-decline-predicted-last-through-2024-so-many-fails.html/",
        "title": "Meghan Markle and <b>Prince Harry</b>’s ‘Decline’ Predicted to Last Through 2024: ‘So Many Fails’",
        "description": "Meghan Markle and Prince Harry&#39;s decline is predicted to last through 2024 says a royal commentator. &#39;So many fails,&#39; they say as 2023 ends."
    },
    {
        "url": "https://www.sport.co.uk/news/max-verstappen-tells-story-about-meeting-prince-harry-in-his/991942/",
        "title": "Max Verstappen tells story about meeting <b>Prince Harry</b> in his trademark way",
        "description": "It may come as little surprise to F1 fans that Max Verstappen was not star-struck by Prince Harryread full article"
    },
    {
        "url": "https://www.vogue.com/article/next-generation-of-european-queens",
        "title": "Meet the Next Generation of European Queens",
        "description": "The world has been gripped by so-called “Leonormania” in recent weeks, after the heir to the Spanish throne turned 18. The eldest of King Felipe and Queen Letizia’s two daughters, Princess Leonor is fast becoming a national obsession, with her every fashion choice (and potential boyfriend) documented and dissected."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1143807-prince-harry-meghan-markle-forced-to-prove-their-worth-with-notable-projects",
        "title": "<b>Prince Harry</b>, Meghan Markle forced to ‘prove their worth’ with notable projects",
        "description": "Prince Harry and Meghan Markle have been advised to prove their worth in 2024 with their involvement in some notable projects. As per PR expert Nick Ede, the Montecito couple needs to use"
    },
    {
        "url": "https://www.skynews.com.au/opinion/prince-harry-very-much-under-meghans-thumb/video/bc5685bf9e549c701df550d279e05ad5",
        "title": "<b>Prince Harry</b> very much ‘under Meghan’s thumb’",
        "description": "Royal commentator and biographer Angela Levin says Prince Harry is “very much under Meghan’s thumb” and will listen to what she says. It comes as the royal commentator was asked what it would take for Prince Harry to return to the Royal fold."
    },
    {
        "url": "https://www.livemint.com/news/world/queen-margrethe-ii-abdication-after-52-year-reign-new-years-eve-address-prince-frederik-royals-11704069723073.html",
        "title": "Queen Margrethe II surprises nation with abdication after 52-year reign in New Year&#39;s Eve address",
        "description": "Denmark&#39;s Queen Margrethe II unexpectedly announced that she will step down in 2024 and hand over the crown to her son, Crown Prince Frederik, during her New Year&#39;s Eve address."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1143805-king-charles-royal-family-snub-prince-harry-in-first-post-of-2024",
        "title": "King Charles, royal family snub <b>Prince Harry</b> in first post of 2024",
        "description": "King Charles and Queen Camilla have released a sweet photo round-up of their royal engagements in 2023 with some unseen family pictures with royal members and children, snubbing Prince Harry"
    },
    {
        "url": "https://www.thesun.co.uk/who/lady-louise-windsor/page/1/",
        "title": "Lady Louise Windsor",
        "description": "Lady Louise Windsor is the Queen ’s youngest granddaughter and a regular at Royal Family events. She turned 18 in November 2020 and in recent years has joined her parents – Prince Edward and Sophie, Countess of Wessex at several engagements. She is a keen carriage driver and was introduced to the sport by her late grandfather Prince Philip."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-meghan-markle-mocked-comedian-1856849",
        "title": "<b>Prince Harry</b> and Meghan Brutally Mocked by Comedian",
        "description": "British comic Simon Brodkin said Prince Harry and Meghan Markle&#39;s cringiest moment was so bad he started rooting for Prince Andrew."
    },
    {
        "url": "https://www.skynews.com.au/breaking-news/national-archives-release-photo-of-prince-harry-former-governor-general-20-years-on/news-story/3b96f8b7582ad60ce425e04a2efc7984",
        "title": "National Archives release photo of <b>Prince Harry</b>, former governor general 20 years on",
        "description": "Long before he married Meghan Markle and made a new life for himself away from royal life, Prince Harry spent a “gap year” in the Australian outback, where he said he had the “best weeks of (his) life”."
    },
    {
        "url": "https://www.newsweek.com/us-views-meghan-markle-royal-race-poll-1856805",
        "title": "How U.S. Really Views Meghan Markle&#39;s Royal Race Allegation",
        "description": "Meghan is 42 while the median age for U.S. women giving birth is 30, NBC News reported in 2022. In other words, those above this age or old enough to be grandparents appeared to be most critical of the royal race saga while those most likely to be expecting themselves were the least."
    },
    {
        "url": "https://www.timesnownews.com/entertainment-news/web-series/the-crowns-luther-ford-reveals-who-pushed-him-to-audition-for-prince-harrys-role-article-106448291",
        "title": "The Crown&#39;s Luther Ford Reveals Who Pushed Him To Audition For <b>Prince Harry</b>&#39;s Role",
        "description": "The newcomer landed the role of Prince Harry in the final season of the British series even though he didn&#39;t think he looked much like the younger son of Princess Diana., Web Series News, Times Now"
    },
    {
        "url": "https://www.cosmopolitan.com/uk/reports/a42374411/meghan-markle-new-years-resolution/",
        "title": "Meghan Markle&#39;s former New Year&#39;s resolution is basically proof she manifested her royal romance",
        "description": "Meghan went on to reveal a piece of advice her former co-star Gina Torres had given her too. &quot;She stopped me, &#39;Meg, I will just say one thing. Make sure you leave room for magic&#39;,&quot; Meghan recalled, adding: &quot;And that is my point. My New Year’s resolution is to leave room for magic.&quot;"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25029903/king-charles-dracula-property-transylvania-stay-room/",
        "title": "King Charles owns a ‘Dracula-esque’ property in Transylvania – and you can stay in his actual room",
        "description": "KING Charles owns castles and palaces across the UK – did you know he also has a “dracula”-style Transylvanian property too? The monarch first visited Romania in the nineties and fell in"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/meaning-behind-princess-wales-high-160000450.html",
        "title": "The meaning behind the Princess of Wales’ high-low jewellery choices this year",
        "description": "The Princess of Wales must be the first queen in waiting to be famous for wearing £14 Accessorize earrings. Of course, she also has access to priceless heirloom jewels bearing some of the world’s finest"
    },
    {
        "url": "https://www.leeds-live.co.uk/best-in-leeds/whats-on-news/big-fat-quiz-year-20-28353746",
        "title": "Big fat quiz of the year with 20 questions from Barbie to <b>Prince Harry</b>",
        "description": "Either way, we’ve put together a big fat quiz of 2023. It aims to test your knowledge of the year that was. In the quiz, you’ll find 20 questions which will test your knowledge of general current affairs, entertainment, sport and other topics. There will also be some questions specifically focused on Yorkshire."
    },
    {
        "url": "https://news.sky.com/story/queen-margrethes-reign-in-pictures-13040198",
        "title": "Queen Margrethe&#39;s reign in pictures",
        "description": "Europe&#39;s current longest-serving monarch announced in a New Year&#39;s Eve speech that she will step down on 14 January - exactly 52 years to the day of her ascension to the throne in 1972."
    },
    {
        "url": "https://www.yahoo.com/news/entertainment/crown-may-broken-dominic-west-144302281.html",
        "title": "‘The Crown’ May Have Broken Up Dominic West and <b>Prince Harry</b>’s Friendship",
        "description": "Apparently, however, that lack of ill will has faded somewhat. Dominic West, the actor who plays Harry’s father Prince Charles on The Crown, has revealed that although he was previously acquaintances with Harry, the two have since lost touch, allegedly due to remarks West publicly made about his rendition of the role."
    }
]