[
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12993499/EDEN-CONFIDENTIAL-David-Bowies-daughter-Lexi-Jones-turmoil-anguish-fathers-death.html",
        "title": "EDEN CONFIDENTIAL: David Bowie&#39;s daughter Lexi Jones opens up on the personal turmoil and anguish she went through after her father&#39;s death",
        "description": "Ritchie&#39;s company, Ashcombe Estates, bought the airfield in north Dorset in 2022. Perhaps he should invite <b>Prince Harry</b>, who accepted a Living Legends Of Aviation award in Hollywood at the weekend? Why Abbey is three years younger than she thought Abbey ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/press-awards-are-refreshingly-free-of-envy-or-bitterness-zqplv5vrh",
        "title": "Press awards are refreshingly free of envy or bitterness",
        "description": "The meanness directed at Britain’s greatest airman, Prince Harry of Montecito, as he prepared to pick up an award at the Living Legends of Aviation gala in Los Angeles was typical of the jealousy and"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25451985/queen-camilla-slow-down-king-charles-work/",
        "title": "Queen Camilla urges workaholic King Charles, 75, to take it easy as he’s pictured driving ahead of prostate op",
        "description": "QUEEN Camilla has told workaholic King Charles to slow down after his recent health scare. The 75-year-old monarch was pictured driving around his Sandringham Estate. The King is recuperating"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858659/prince-harry-true-feelings-princess-kate",
        "title": "<b>Prince Harry</b>&#39;s &#39;true feelings&#39; about Princess Kate before latest message of support",
        "description": "The Duke and Duchess of Sussex have &#39;reached out&#39; to both King Charles and the Princess of Wales after their recent health scares."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/22/sarah-ferguson-duchess-of-york-melanoma-royal-family/",
        "title": "How the Royal family is rallying around the Duchess of York",
        "description": "Yet in a sign of her royal rehabilitation, she was invited to <b>Prince Harry</b>’s wedding to Meghan Markle in 2018. In the absence of her father, Major Ronald Ferguson, who died in 2003 and her mother Susan Barrantes, who was killed in a car crash in 1998 ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858511/prince-harry-award-speech-royal-family",
        "title": "<b>Prince Harry</b> branded ‘phoney’ for deciding not to mention &#39;shocking news&#39; about family",
        "description": "Prince Harry is a &quot;phoney&quot; for not mentioning the &quot;shock&quot; health news about his father, King Charles and sister-in-law, Princess Kate while accepting an award recently, a royal commentator has claimed."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-sad-appearance-living-31941497.amp",
        "title": "<b>Prince Harry</b>&#39;s &#39;sad&#39; appearance at Living Legends awards sees him pose with D-list crowd",
        "description": "Prince Harry received his Living Legends of Aviation award at the prestigious ceremony in what has been described as &#39;a desperate move to accept a ridiculous gong&#39;"
    },
    {
        "url": "https://www.ok.co.uk/royal/queen-changed-prince-louis-name-31941730",
        "title": "Queen &#39;changed <b>Prince</b> Louis&#39; name&#39; after overturning decades-old historic rule",
        "description": "The late Queen Elizabeth overturned a historic rule to have her say in the naming of the Prince and Princess of Wales&#39; youngest son, Louis Arthur Charles, when he was born in 2018"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/itv-loose-women-hot-water-28493632",
        "title": "ITV Loose Women in hot water as viewers say &#39;let it be&#39; and &#39;have some respect&#39;",
        "description": "Loose Women welcomed a Royal Family biographer on Monday January 22, with Ruth Langsford, Brenda Edwards, Olivia Attwood and Linda Robson on the panel."
    },
    {
        "url": "https://www.devonlive.com/news/celebs-tv/queen-changed-prince-louis-name-9050949",
        "title": "The Queen changed <b>Prince</b> Louis&#39; name by overturning history Royal Family rule",
        "description": "William and Kate named their youngest son Louis Arthur Charles and his name is certainly a popular one in the history of the Royal Family. They honoured Prince Charles&#39; mentor Lord Louis Mountbatten, who died in an IRA bombing in 1979."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-king-charles-aviation-awards-b2482825.html",
        "title": "<b>Prince Harry</b> makes rare joke about father King Charles amid royal rift",
        "description": "Prince Harry has made a rare comment about his father King Charles III amid rumoured tension with the British royal family."
    },
    {
        "url": "https://www.theargus.co.uk/news/24066465.meghan-markle-price-harry-contact-king-health-news/",
        "title": "Meghan Markle and Price <b>Harry</b> &#39;contact King&#39; after health news",
        "description": "The Duke and Duchess of Sussex have contacted two key members of the Royal Family after being informed about their health issues."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/royal-family-a-new-poll-reveals-who-the-top-5-most-attractive-royal-are-and-the-results-are-unexpected_art20864.html",
        "title": "Royal Family: A new poll reveals who the top 5 most attractive royal are and the results are unexpected",
        "description": "One of the most surprising British Royals has made it to the list of top 5 most attractive royals in the world. Here’s who he"
    },
    {
        "url": "https://www.hellomagazine.com/brides/511644/prince-harry-first-meeting-mother-in-law-doria-marked-the-end-of-the-beginning/",
        "title": "<b>Prince Harry</b>&#39;s first meeting with mother-in-law Doria marked &#39;the end of the beginning&#39;",
        "description": "Prince Harry admitted that his first meeting with Meghan Markle &#39;s mother Doria Ragland marked &quot;the end of the beginning&quot; in his bombshell book Spare, which was released in 2023."
    },
    {
        "url": "https://www.ok.co.uk/royal/george-charlotte-royal-family-parenting-31939018",
        "title": "<b>Prince</b> George is &#39;grateful&#39; for sister Charlotte and &#39;won&#39;t repeat&#39; mistakes made by William and <b>Harry</b>",
        "description": "Prince George and Princess Charlotte share an incredibly close bond as a leading parenting expert points out how the pair&#39;s relationship should avert any future royal sibling drama"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harry-unveiled-true-feelings-31940754.amp",
        "title": "<b>Prince Harry</b> unveiled &#39;true feelings&#39; about Kate before sending messages of support, says expert",
        "description": "As Kate Middleton recovers in hospital following her abdominal surgery, Harry and Meghan have reached out despite their ongoing feud - but it&#39;s now been revealed he once let slip his true feelings about his sister-in-law."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/us-gossip/prince-harrys-weird-behaviour-living-31933077",
        "title": "<b>Prince Harry</b>&#39;s &#39;weird&#39; behaviour at Living Legend of Aviation awards called out by guest",
        "description": "Prince Harry surprised guests at the Living Legend of Aviation awards in Los Angeles on Friday night when he didn&#39;t pay tribute to his ailing family members"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12991449/prince-harry-aviation-award-selfie-German-mario-max-fake.html",
        "title": "How has <b>Harry</b> been reduced to tacky selfies with German reality stars? Royal experts question Duke of Sussex for posing with TV &#39;<b>prince</b>&#39; Mario-Max Schaumburg-Lippe - as he ...",
        "description": "<b>Prince Harry</b> made a &#39;fool of himself&#39; by posing for a selfie with a German &#39;<b>prince</b>&#39; best known for Celebrity Big Brother at the &#39;Living Legends of Aviation&#39; gala hosted by John Travolta in LA, experts told MailOnline today. Mario-Max Schaumburg-Lippe ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/harry-meghan-king-charles-kate-middleton-princess-wales-hospital-surgery-prostate-b1133830.html",
        "title": "<b>Harry</b> and Meghan &#39;send get well messages&#39; to King Charles and Princess of Wales amid health concerns",
        "description": "Kate is spending a seventh day at a private London hospital, while the King is due to undergo surgery this week"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/king-charles-would-love-prince-31937703?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "King Charles ‘would love to have <b>Prince Harry</b> back’ as new monarch wants to make amends",
        "description": "Prince Harry and Meghan Markle stepped down from their roles as senior members of the Royal Family in 2020, and since then, his relationship with father King Charles has deteriorated"
    },
    {
        "url": "https://sg.finance.yahoo.com/news/prince-harry-jokes-king-charles-172307300.html",
        "title": "<b>Prince Harry</b> Jokes About King Charles While Telling John Travolta About His First Flight",
        "description": "The Duke of Sussex had something lighthearted to say about a flight with his father, King Charles Samir Hussein/Samir Hussein/WireImage King Charles and <b>Prince Harry</b> at the premiere of &quot;Our Planet&quot; at the Natural History Museum on April 4, 2019 in London."
    },
    {
        "url": "https://sg.finance.yahoo.com/news/everything-know-royal-healthcare-141800686.html",
        "title": "Everything You Need to Know About Royal Healthcare",
        "description": "When he needed an emergency heart procedure in 2011, this was carried out at the NHS Papworth Hospital in Cambridge. <b>Prince Harry</b>’s hernia operation when he was three years old was carried out at the Great Ormond Street Hospital for Sick Children ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-meghan-markle-reportedly-143400668.html",
        "title": "<b>Prince Harry</b> and Meghan Markle Have Reportedly Reached Out to the Royals Amid Kate Middleton&#39;s Hospitalization",
        "description": "<b>Prince Harry</b> and Meghan Markle have reportedly sent their best wishes to Kate Middleton and King Charles amid His Majesty&#39;s prostate surgery and the Princess of Wales&#39; ongoing hospitalization. “The King and the Princess of Wales have received support ..."
    },
    {
        "url": "https://uk.news.yahoo.com/ve-had-wrong-why-princess-112140103.html",
        "title": "We’ve Had It All Wrong About Why Princess Kate Didn’t Go with <b>Prince</b> William to Balmoral on the Day Queen Elizabeth Died",
        "description": "In 2022, reports indicated that Meghan Markle had been asked to stay behind while <b>Prince Harry</b> made his journey to Scotland, and the perception was that Kate was also excluded for similar reasons, People reports. But, according to Hardman, it was Kate who ..."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/films/news/prince-harry-john-travolta-princess-diana-b2482693.html",
        "title": "John Travolta ‘proud’ to host <b>Prince Harry</b>, 40 years after dancing with Diana",
        "description": "On Friday (19 January), the actor hosted the Living Legends of Aviation ceremony in Los Angeles, where <b>Prince Harry</b> was recognised for his work as a British Army veteran and pilot. The event came nearly 40 years after <b>Harry</b>’s late mother, Princess Diana ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/prince-harry-john-travolta-princess-los-angeles-jeff-bezos-b1133930.html",
        "title": "John Travolta ‘proud’ to host <b>Harry</b> – 40 years after dancefloor spin with Diana",
        "description": "Travolta captioned the picture: “I was so proud to host <b>Prince Harry</b>, Jeff Bezos and Lauren Sanchez at Living Legends of Aviation awards event Friday night. “Congrats to both <b>Prince Harry</b> and Lauren on their awards!!” During his speech at the ..."
    }
]