[
    {
        "url": "https://www.thesun.co.uk/royals/26072432/meghan-markles-cousin-reveals-her-privileged-childhood-with-hawaii-disney-trips-despite-her-saying-they-struggled/",
        "title": "Meghan Markle’s cousin reveals her privileged childhood, with Hawaii &amp; Disney trips, despite her saying they struggled",
        "description": "MEGHAN Markle’s cousin has opened up about his childhood with the now-Duchess of Sussex – including detailing some of the swanky holidays she went on. This follows Meghan claiming her family"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-prince-harry-face-32173374",
        "title": "Meghan Markle and <b>Prince Harry</b> face &#39;internal conflict&#39; after controversial rebrand",
        "description": "Prince Harry and Meghan Markle relaunched their website using their official coat of arms, which many believe could be a telltale sign of an &#39;internal conflict&#39;, according to one royal expert. The pair raised eyebrows last week when they replaced their Archewell website with Sussex."
    },
    {
        "url": "https://uk.style.yahoo.com/prince-william-admits-hes-had-201248930.html",
        "title": "<b>Prince</b> William Admits He&#39;s Had &#39;Other Things on My Mind&#39; in Rare Candid Moment at BAFTAs",
        "description": "The Prince of Wales shared that he&#39;s watched the &quot;fewest&quot; amount of nominated films this year amid Kate Middleton&#39;s surgery and King Charles&#39; cancer diagnosis"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/20/teddies-st-edwards-marlborough-school-prince-george-waleses/",
        "title": "The public schools that <b>Prince</b> George could attend – and how the people in charge compare",
        "description": "As the future king prepares for secondary education, the Prince and Princess of Wales have their eyes on two excellent institutions"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-william-barbie-baftas_n_65d4aa46e4b0b65d69209130",
        "title": "<b>Prince</b> William Stuns Fans By Admitting He Hasn&#39;t Seen This 1 Movie",
        "description": "The Prince of Wales, who is the president of the British Academy of Film and Television Arts, left fans gobsmacked by this admission."
    },
    {
        "url": "https://www.ok.co.uk/lifestyle/prince-philip-would-sad-see-32172512",
        "title": "<b>Prince</b> Philip &#39;would be sad&#39; to see <b>Prince Harry</b> abandon 64-year-old royal tradition",
        "description": "Prince Harry and Meghan Markle shocked Royal fans last week when they moved on from a 64 year old Royal tradition and gave their children, Archie and Lilibet, a brand new surname"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-could-lose-royal-32172221.amp",
        "title": "<b>Prince Harry</b> risks losing his Royal titles in effort to become a US citizen, says lawyer",
        "description": "Prince Harry admitted that he was considering becoming an American citizen but if the Duke of Sussex wants to keep his Royal titles, he may face a court battle that would likely go all the way to the U."
    },
    {
        "url": "https://www.instyle.com/prince-william-ayo-edebiri-and-phoebe-dynevor-awkward-photo-explainer-8594562",
        "title": "<b>Prince</b> William, Ayo Edebiri, and Phoebe Dynevor&#39;s Viral Awkward Photo Finally Has a Backstory",
        "description": "Prince William created an awkward photo opportunity with Ayo Edebiri and Phoebe Dynevor after talking about ‘How to Have Sex’ with actress Mia McKenna-Bruce at the 2024 BAFTA Film Awards."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-georges-godmother-julia-samuel-172945943.html",
        "title": "<b>Prince</b> George&#39;s Godmother Julia Samuel Reveals She Was Injured in Ski Accident: &#39;Ooooops I Fell&#39;",
        "description": "Julia Samel was friends with Princess Diana and previously said that she would have loved Prince George &quot;so much&quot;"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/harry-styles-alleged-stalker-sent-singer-8000-cards-court-told/",
        "title": "<b>Harry</b> Styles: Alleged stalker sent singer 8,000 cards, court told",
        "description": "A Brazilian woman charged with stalking <b>Harry</b> Styles has appeared in court in the UK ... during the brief hearing and did not indicate a plea. Read more on Sky News: <b>Prince</b> William makes rare intervention on Israel-Hamas war Body found in search for ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513858/king-charles-education-school-university-revealed/",
        "title": "Everything you need to know about King Charles&#39; education – where he went to school and university",
        "description": "Charles&#39; first school was Hill House School, in Knightsbridge, which he started attending in November 1956. The school was founded in 1951 by former politician Stuart Townend and it remains in his family, with Richard Townend speaking to the Independent about the royal&#39;s education."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25739957/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/25/",
        "title": "<b>Prince Harry</b> updates — Duke has ‘no way back’ after Royal Family crunch talks as King battles cancer",
        "description": "<b>PRINCE Harry</b> &#39;has no way back&#39; to becoming a working royal after the Royal Family held a fresh round of crunch talks, according to sources. Palace insiders insist the 2020 Megxit deal barring <b>Harry</b>, 39, and Meghan, 42, from such an arrangement remains in ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/meghan-markle-prince-harry-share-154804459.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Share Unseen Photo from Canada Visit: &#39;It Filled Our Hearts&#39; (Exclusive)",
        "description": "The Duke and Duchess of Sussex exclusively tell PEOPLE they &quot;loved being back in Canada&quot; for the countdown to next year&#39;s Invictus Games"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/meghan-markles-winter-hair-transformation-202355554.html",
        "title": "Meghan Markle&#39;s Winter Hair Transformation: The Secret Behind Her &#39;Chocolate Chestnut Glow&#39;",
        "description": "Lee credited the Duchess of Sussex’s “bounciest, long-lasting blowout” to hair stylist Hector and posted four pictures of Meghan at the Whistler Sliding Center. Meghan kept warm with a navy blue beanie at the mountain on Thursday, where her long hair was styled in loose curls."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harrys-11-word-response-28669799",
        "title": "<b>Prince Harry</b>&#39;s 11-word response when asked about return to royal duties",
        "description": "But he gave a very different response when quizzed on the same TV show a year ago. The Prince gave Good Morning America a very telling answer about any return to royal life, MirrorOnline reports."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868802/prince-philip-prince-harry-old-royal-tradition",
        "title": "<b>Prince</b> Philip ‘would turn in his grave’ after <b>Prince Harry</b> ditched old royal tradition",
        "description": "Prince Harry and Meghan Markle shocked fans when they broke away from an old tradition and changed their children&#39;s surnames - but it is thought the late Duke of Edinburgh would not have approved of the decision."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-sliding-royal-role-32169742",
        "title": "<b>Prince Harry</b>&#39;s &#39;sliding into Royal role&#39; claim as King Charles&#39; health sparks return rumours",
        "description": "Prince Harry has been tipped to return to a temporary Royal role while his father King Charles undergoes cancer treatment, but the Duke of Sussex has previously given a very telling answer about any return to Royal life."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868735/prince-harry-canada-gesture-royal-feud-latest",
        "title": "&#39;Laid back&#39; <b>Prince Harry</b> proves he is taking action to finally heal rift with Royal Family",
        "description": "Prince Harry made a very telling gesture during his trip to Canada last week which signals he may be on his way to mending the rift with the Royal Family, according to a PR expert."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-told-nobody-wants-32167544",
        "title": "<b>Prince Harry</b> told &#39;nobody wants you back&#39; in bitter Piers Morgan rant amid return rumour",
        "description": "Piers Morgan has lashed out at Prince Harry in a nine-minute monologue where he slams the Duke Of Sussex for his response to his father&#39;s recent cancer diagnosis and claims &#39;nobody wants you back&#39;"
    },
    {
        "url": "https://www.ok.co.uk/royal/gallery/inside-prince-harrys-special-passion-32133108",
        "title": "Inside <b>Prince Harry</b>&#39;s special passion that he shares with wife Meghan Markle",
        "description": "Prince Harry captured his love of Africa on camera back in 2014, during a tour in support of his charity, Sentebale, which supports the wellbeing of people affected by HIV"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/royal-news/prince-harry-finally-realises-no-9111675",
        "title": "<b>Prince Harry</b> &#39;finally realises he has no choice&#39; with Royal Family",
        "description": "Prince Harry is said to have had a &#39;realisation&#39; about his relationship with the Royal family following his visit to the UK, but insiders say there is &#39;no chance&#39; he will be allowed to return to a Royal role."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/20/65d52854ca474180418b4595.html",
        "title": "Meghan Markle&#39;s departure left Kate Middleton lonely within the Royal Family, per report",
        "description": "UK News. Meghan Markle&#39;s Suits co-star is still traumatized by &quot;foul&quot; smell at her wedding to <b>Prince Harry</b> UK News. King Charles told <b>Prince</b> William to &#39;spend more time with family&#39; in telling royal message But the current situation is getting in the way ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/royal-family/prince-harry-meghan-markle-canada-b2499377.html",
        "title": "<b>Prince Harry</b> and Meghan reflect on their ‘meaningful’ visit to Canada",
        "description": "Meghan Markle and <b>Prince Harry</b> have sweetly reflected on their “meaningful” trip to Canada, which they took in honour of the 2025 Invictus Games. The Duke and Duchess of Sussex opened up about their trip during an interview with People, published on 20 ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-understands-how-difficult-28666999",
        "title": "<b>Prince Harry</b> understands how &#39;difficult it is to repair damage&#39; he caused Royal family",
        "description": "<b>Prince Harry</b> is said to have had a &#39;realisation&#39; about his relationship with the Royal family following his visit to the UK, but insiders say there is &#39;no chance&#39; he will be allowed to return to his former role <b>Prince Harry</b> recognises the significant ..."
    },
    {
        "url": "https://www.tatler.com/article/prince-george-st-edwards-school-educational-future",
        "title": "Teddies for <b>Prince</b> George? St Edward’s is reportedly being considered for <b>Prince</b> George’s educational future",
        "description": "It has been a custom for royal children to attend Gordonstoun, for example. This tradition broke, however, when <b>Prince</b> William and <b>Harry</b> were sent to Eton in 1995 and 1997 respectively. Why? The current King Charles’ apparent disdain for the Scottish ..."
    },
    {
        "url": "https://www.tatler.com/article/tea-party-st-james-palace-princess-beatrice-dyslexia",
        "title": "Not holding me back! Princess Beatrice hosts tea party at St James’s Palace in aid of dyslexia charity",
        "description": "Return of the son? <b>Prince Harry</b> gives friendly signals as he suggests he is likely to be spending more time in UK In an interview with Good Morning America, <b>Prince Harry</b> expressed that he loved his family and said he was ‘grateful’ to be able to visit ..."
    },
    {
        "url": "https://startsat60.com/media/news/prince-philip-would-turn-in-his-grave-following-harry-and-meghans-latest-move-royal-biographer-claims",
        "title": "<b>Prince</b> Philip would ‘turn in his grave’ following <b>Harry</b> and Meghan’s latest move, royal biographer claims",
        "description": "The move has been seen as a significant deviation from royal tradition. Source: Getty Images. <b>Prince Harry</b> and Meghan Markle’s recent antics have significantly strained relations with the Royal Family. Nevertheless, it is believed that the late <b>Prince</b> ..."
    },
    {
        "url": "https://thekit.ca/culture/royals/prince-william-statement-gaza/",
        "title": "<b>Prince</b> William Made a Bold Statement on Gaza as He Takes Over the Royal Spotlight",
        "description": "Almost overnight, Prince William has become the most senior “face” of the Royal Family, shouldering much of the public spotlight while King Charles receives treatment for cancer, and his wife and partner-in-public-events,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159729-prince-harry-meghan-markle-argue-as-duke-wants-to-end-royal-feud",
        "title": "<b>Prince Harry</b>, Meghan Markle argue as Duke wants to ‘end royal feud’",
        "description": "<b>Prince Harry</b> and Meghan Markle don’t seem to be on the same page when it comes to the thought of repairing the “damage” caused to their relationship with the royal family. According to a source, <b>Prince Harry</b> and Meghan Markle have reportedly been ..."
    },
    {
        "url": "https://hollywoodlife.com/2024/02/20/suits-star-rick-hoffman-recalls-smell-at-meghan-markles-wedding/",
        "title": "Meghan Markle’s ‘Suits’ Co-Star Rick Hoffman Recalls ‘Foul’ Smell at Royal Wedding: It ‘Was Terrible’",
        "description": "Rick Hoffman wanted to clear the air about something that ruined Meghan Markle ’s wedding for him. The Suits alum, 53, recalled a “really terrible and foul” scent that hit him during his former co-star’s 2018 wedding, when she married her husband, Prince Harry."
    },
    {
        "url": "https://face2faceafrica.com/article/invictus-games-meghan-and-prince-harry-unveiled-a-historic-first-in-canada",
        "title": "Invictus Games: Meghan and <b>Prince Harry</b> unveiled a historic first in Canada",
        "description": "Meghan Markle and Prince Harry made headlines after they unveiled the groundbreaking Invictus Games Vancouver Whistler 2025 logo, a collaborative effort involving the Squamish, Tsleil-Waututh, Musqueam,"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-harry-and-michael-buble-try-wheelchair-curling-during-invictus-event-20240221-p5f6k8.html",
        "title": "<b>Prince Harry</b> and Michael Buble try wheelchair curling during Invictus event",
        "description": "Prince Harry and Michael Buble try wheelchair curling during Invictus event marking one year until Invictus Vancouver Whistler 2025."
    },
    {
        "url": "https://www.statesman.com/story/entertainment/celebrities/2024/02/15/prince-harry-duchess-meghan-invictus-games/72623103007/",
        "title": "<b>Prince Harry</b>, Duchess Meghan hit the slopes in Canada to scope out new Invictus Games site: See photos",
        "description": "WHISTLER, British Columbia — <b>Prince Harry</b> raced head-first on a tiny skeleton sled going 99 kph (61.5 mph) down a track at next year&#39;s Invictus Games site Thursday, saying with a smile afterward that everyone should do it. <b>Harry</b> was in Whistler ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/royals-sporting-moments/",
        "title": "32 times the royals showed off their sporting prowess",
        "description": "The Princess of Wales might be known for her talents at tennis and more, but she&#39;s far from the only sporty royal!"
    },
    {
        "url": "https://people.com/meghan-markle-winter-hair-transformation-secret-chocolate-chestnut-glow-8594650",
        "title": "Meghan Markle&#39;s Winter Hair Transformation: The Secret Behind Her &#39;Chocolate Chestnut Glow&#39;",
        "description": "Hair colorist Kadi Lee revealed the secret to Meghan Markle&#39;s &quot;dynamic shade&quot; of &quot;chocolate chestnut brunette&quot; that the Duchess of Sussex sported in Canada with Prince Harry."
    },
    {
        "url": "https://pagesix.com/2024/02/20/style/meghan-markle-wore-blenders-grove-sunglasses-in-canada-and-theyre-under-60/",
        "title": "Meghan Markle wore these under-$60 sunglasses during her trip to Canada",
        "description": "The Duchess of Sussex might be practically up to her eyeballs in designer duds, but she still loves a good pair of budget-friendly frames."
    },
    {
        "url": "https://www.yahoo.com/entertainment/prince-william-kate-middleton-celebrity-195630649.html",
        "title": "All of <b>Prince</b> William Kate Middleton’s Celebrity Friends",
        "description": "After Meghan Markle and <b>Prince Harry</b> moved into the US, it seems as though they know everyone who’s anyone in Hollywood. From attending high-profile events together with other celebs and doing podcasts with them, we have a good rundown on who the Duke ..."
    },
    {
        "url": "https://www.arise.tv/prince-william-urges-swift-end-to-israel-gaza-conflict-stresses-humanitarian-concerns/",
        "title": "<b>Prince</b> William Urges Swift End To Israel-Gaza Conflict, Stresses Humanitarian Concerns",
        "description": "<b>Prince Harry</b> Accuses <b>Prince</b> William of Physical Attack over Meghan Markle Escalating Violence in Gaza Raises Concerns of Humanitarian Crisis and Mass Exodus United in Grief But Still Miles Apart: William, <b>Harry</b> to Re-unite at <b>Prince</b> Philips&#39; Funeral In ..."
    },
    {
        "url": "https://www.aol.com/prince-harry-meghan-reflect-meaningful-174002512.html",
        "title": "<b>Prince Harry</b> and Meghan reflect on their ‘meaningful’ visit to Canada",
        "description": "It filled our hearts to once again be surrounded by Canadian people, food and culture,’ Duke and Duchess of Sussex say"
    },
    {
        "url": "https://www.aol.com/entertainment/meghan-markle-suits-costar-recalls-173814321.html",
        "title": "Meghan Markle’s ‘Suits’ Costar Recalls ‘Foul’ Smell at <b>Prince Harry</b> Wedding",
        "description": "Karwai Tang/WireImage Meghan Markle’s Suits costar Rick Hoffman went viral for making a face at her 2018 wedding to Prince Harry — and he says there’s a simple reason why. “If you type in my name in on Google,"
    },
    {
        "url": "https://www.thenews.com.pk/latest/1159720-tom-cruise-gets-emotional-while-speaking-up-about-his-son-in-ed-zwicks-memoir",
        "title": "Tom Cruise gets emotional while speaking up about his son in Ed Zwick’s memoir",
        "description": "Tom Cruise gets emotional while talking about his then eight-year-old son Connor on the set of The Last Samurai.In Ed Zwick’s memoir Hits, Flops, and Other Illusions: My Fortysomething"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/20/prince-william-end-fighting-gaza-palestine-israel-hamas/",
        "title": "Israel responds to <b>Prince</b> William’s call to end fighting in Gaza",
        "description": "The Prince of Wales has called for an end to the fighting in Gaza and for the release of hostages as he warned that “too many have been killed” in Israel’s conflict."
    },
    {
        "url": "https://ca.sports.yahoo.com/news/meghan-markle-nailed-low-effort-184545744.html",
        "title": "Meghan Markle Nailed the Low Effort Updo in a Brand New Pic from Her Canada Trip",
        "description": "Prince Harry and Meghan Markle arrived in Canada for the start of Invictus Games season in the middle of February. The Duchess of Sussex wasted no time in showing off her impeccable cold-weather style, as well as her commitment to skinny jeans —no matter what the Zoomers on TikTok have to say. Queen behavior, obviously."
    },
    {
        "url": "https://news.sky.com/story/harry-styles-alleged-stalker-sent-singer-8000-cards-court-told-13076272?dcmp=snt-sf-twitter",
        "title": "<b>Harry</b> Styles: Alleged stalker sent singer 8,000 cards, court told",
        "description": "A Brazilian woman charged with stalking <b>Harry</b> Styles has appeared in court in the UK. Myra Carvalho, 35, allegedly sent the Watermelon Sugar singer 8,000 cards in less than a month, including some wedding cards. Carvalho is said to have sent the former One ..."
    },
    {
        "url": "https://www.hellomagazine.com/healthandbeauty/hair/513853/meghan-markle-new-hair-colour/",
        "title": "Meghan Markle&#39;s hair stylist reveals secret behind Duchess&#39; stunning new &#39;red&#39; hair",
        "description": "Meghan&#39;s hair colorist Kadi Lee was the mastermind behind her espresso-hued locks. Taking to Instagram via the Highbrow Hippie account, Kadi revealed the exact process to achieving the royal&#39;s high-shine tresses - and the surprising color she used to achieve Meghan&#39;s &#39;do."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13103307/meghan-markle-prince-harry-friendship-michael-buble-jessica-mulroney.html",
        "title": "How Meghan Markle and <b>Prince Harry</b> owe their friendship with Michael Buble to Duchess&#39; former BFF Jessica Mulroney - as couple enjoy intimate performance from singer in Canada",
        "description": "Meghan and Michael met over dinner hosted by the stylist and her husband Ben in 2015. The pair were reunited last week at a lavish gala in Vancouver to celebrate the 2025 Winter Invictus Games."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-markle-prince-harry-share-154804459.html",
        "title": "Meghan Markle and <b>Prince Harry</b> Share Unseen Photo from Canada Visit: &#39;It Filled Our Hearts&#39; (Exclusive)",
        "description": "The Duke and Duchess of Sussex exclusively tell PEOPLE they &quot;loved being back in Canada&quot; for the countdown to next year&#39;s Invictus Games"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/prince-harry-realises-no-option-9111506",
        "title": "<b>Prince Harry</b> &#39;realises he has no other option&#39; over Royal role",
        "description": "Prince Harry is said to have had a &#39;realisation&#39; about his relationship with the Royal family following his visit to the UK, but insiders say there is &#39;no chance&#39; he will be allowed to return to a Royal role."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/meghan-markles-no-filter-body-28666460",
        "title": "Meghan Markle&#39;s &#39;no filter&#39; body language with <b>Prince Harry</b> over King Charles",
        "description": "Meghan Markle showed &quot;no filter&quot; in her body language towards Prince Harry as Michael Buble mentioned the Duke of Sussex&#39;s father, King Charles, during a rendition of Frank Sinatra&#39;s &quot;My Way&quot;, an expert has said."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/prince-william-holding-fort-prince-harry-prepares-return-family",
        "title": "William is &#39;holding the fort&#39; as <b>Harry</b> prepares &#39;to return to the family&#39;",
        "description": "In the wake of the news about the King&#39;s diagnosis, Prince Harry briefly returned to the UK to see his father, and it has sparked fresh hope that the estranged royal may reunite with his family as he said in an interview: &quot;I think any illness, any sickness, brings families together. I see it time and time again, and that makes me very happy.&quot;"
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-finally-understands-difficult-32165852.amp",
        "title": "<b>Prince Harry</b> &#39;finally&#39; understands &#39;difficult to repair damage&#39; he caused royal family",
        "description": "Prince Harry believes he &#39;must repair the damage&#39; caused, according to royal sources, but Prince William is &#39;categorically clear&#39; on not allowing a royal comeback for the Sussexes"
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-royal-family-return-32165357",
        "title": "<b>Prince Harry</b>&#39;s revealing 11-word response over return to royal duties to assist King Charles",
        "description": "Prince Harry has reportedly told friends he would be willing to step into a temporary Royal role while his father undergoes cancer treatment, but just over a year ago he gave a very telling answer abo"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/513807/prince-george-godmother-julia-samuel-injured-ski-accident/",
        "title": "<b>Prince</b> George&#39;s godmother Julia Samuel left injured in ski accident",
        "description": "Prince George &#39;s godmother Julia Samuel has revealed she was unfortunate enough to suffer a serious injury last week. During a family skiing holiday to the French Alps, the psychotherapist – who was a close friend to Princess Diana – was left in serious pain following the accident."
    },
    {
        "url": "https://www.ibtimes.co.uk/matt-smith-says-prince-harry-joked-about-his-role-crown-1723539",
        "title": "Matt Smith Says <b>Prince Harry</b> Joked About His Role In &#39;The Crown&#39;",
        "description": "The actor said the Duke of Sussex called him &quot;granddad&quot; because of his portrayal of Prince Philip in the Netflix series."
    },
    {
        "url": "https://www.lbc.co.uk/news/princess-elisabeth-belgium-instant-connection-rochdale-student-family-comment/",
        "title": "Princess Elisabeth of Belgium &#39;forms connection&#39; with Rochdale student - as family insist &#39;they just study together&#39;",
        "description": "Princess Elisabeth of Belgium is said to have formed an &quot;instant connection&quot; with a Rochdale student - as his family insists that the pair &quot;just study together&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13101087/Hermes-jacket-Joan-Arctic-boots-Meghan-wardrobe-rich-mom.html",
        "title": "From a £3,000 Hermes bomber jacket to £195 Joan of Arctic boots, hidden meanings behind Meghan&#39;s &#39;rich mom energy&#39; ski-slope wardrobe (worth over £44,000!)",
        "description": "Getting dressed is a minefield these days. Not only do you have to worry about whether your clothes are in fashion, there&#39;s also increasing pressure to worry about their provenance."
    },
    {
        "url": "https://www.ibtimes.co.uk/king-charles-iii-good-spirits-first-sighting-since-prince-harrys-tv-interview-1723536",
        "title": "King Charles III In Good Spirits In First Sighting Since <b>Prince Harry</b>&#39;s TV Interview",
        "description": "His Majesty attended Sunday service at St. Mary Magdalene Church in Sandringham with Queen Camilla on Feb. 18."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-harry-william-cancer-news-b2498916.html?page=2",
        "title": "Royal family news - live: <b>Prince</b> William to address Gaza crisis in Middle East and rise in antisemitism",
        "description": "The King smiled and waved at wellwishers in his first public appearance since Prince Harry’s interview aired where he hinted he was hoping the royal family could reunify in the wake of his father’s shock cancer diagnosis."
    },
    {
        "url": "https://www.thesun.ie/royals/12141651/prince-harry-good-morning-america-interview-king-charles-cancer-latest/page/7/",
        "title": "<b>Prince Harry</b> updates — Duke not seeking a return to duty despite rumours as King Charles battles cancer",
        "description": "<b>PRINCE Harry</b> is not planning to return to his royal duties, a source has insisted. The speculation came as the Times reported the Duke had said he was ready to help the royals as the King battles cancer. Palace insiders say the 2020 Megxit deal barring ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/king-charles-harry-william-cancer-news-b2498916.html?page=4",
        "title": "Royal family news - live: King in first outing since <b>Harry</b> interview as ‘zero chance’ of <b>prince</b>’s return",
        "description": "The King smiled and waved at wellwishers in his first public appearance since Prince Harry’s interview aired where he hinted he was hoping the royal family could reunify in the wake of his father’s shock cancer diagnosis."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/rich-prince-william-family-2024-100000178.html",
        "title": "How rich are <b>Prince</b> William and his family in 2024?",
        "description": "He&#39;s next in line to the UK throne – so how wealthy are king-to-be Prince William, his wife Kate Middleton, and their three children in 2024?"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/prince-william-to-highlight-plight-of-those-affected-in-middle-east-conflict/",
        "title": "<b>Prince</b> William to highlight plight of those affected in Middle East conflict",
        "description": "The Prince of Wales has been so horrified by the human suffering unfolding in the Middle East he&#39;s set to carry out a series of engagements to highlight the plight of all those affected by the ongoing conflict."
    },
    {
        "url": "https://www.marieclaire.co.uk/royal-news/prince-william-selfie-allergy",
        "title": "Why <b>Prince</b> William has had to overcome a so-called &#39;allergy&#39; to connect with royal fans",
        "description": "<b>Prince</b> William may be an elder millennial, but that doesn&#39;t mean he&#39;s completely on board with all of his generation&#39;s preferences. Back in 2018, William joked to a royal fan: &quot;I&#39;m allergic to selfies,&quot; but since then he has indulged many well-wishers in ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/19/david-tennants-wife-georgia-sends-trans-rights-message-baftas-20309459/?ico=mosaic_showbiz",
        "title": "David Tennant’s wife Georgia showcased powerful trans rights message at Baftas",
        "description": "David Beckham angers Brits everywhere by saying one word at the Baftas <b>Prince</b> William makes personal confession at ... And in July 2023, the former <b>Harry</b> Potter actor wore a t-shirt that said ‘Leave trans kids alone, you absolute freaks’ to a ..."
    },
    {
        "url": "https://www.statesman.com/story/entertainment/celebrities/2024/02/16/prince-harry-king-charles-cancer-reunion-good-morning-america/72626172007/",
        "title": "<b>Prince Harry</b> says he&#39;s &#39;grateful&#39; he visited King Charles III amid cancer diagnosis",
        "description": "<b>Prince Harry</b> is speaking out for the first time, a week after seeing his father, King Charles III, after the British monarch was diagnosed with cancer. &quot;I spoke to him. And I jumped on a plane and went to go see him as soon as I could,&quot; the Duke of ..."
    }
]