[
    {
        "url": "https://uk.style.yahoo.com/prince-william-visited-kate-middleton-173451359.html",
        "title": "<b>Prince</b> William Visited Kate Middleton in the Hospital After Her Surprise Surgery",
        "description": "Prince William is stepping up to the plate as a supportive husband after it was announced that Kate Middleton was hospitalized following an abdominal surgery. The royal was spotted leaving the private hospital on Thursday — in an Audi e-Tron GT Carbon Vorsprung,"
    },
    {
        "url": "https://www.lbc.co.uk/news/prince-harry-kate-king-hospital/",
        "title": "<b>Prince Harry</b> urged to call royals as King Charles and Kate Middleton face hospital spells",
        "description": "Prince Harry has been told to call King Charles and Princess Kate as both face spells in hospital. Kate has undergone abdominal surgery and is recovering at the London Clinic, where she is expected to spend up to two weeks. She has cleared her engagements calendar until after Easter."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857266/Prince-Harry-jogging-Meghan-Markle-Lilibet",
        "title": "<b>Prince Harry</b>&#39;s &#39;unusual gesture&#39; while jogging shows he&#39;s &#39;frustrated&#39;, says expert",
        "description": "Prince Harry was snapped breaking cover for the first time since the Lilibet name scandal - and a body language expert spotted a sign he&#39;s &#39;angry&#39;."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1857262/prince-harry-meghan-markle-fans-disgusting-comments",
        "title": "<b>Prince Harry</b> and Meghan Markle fans spark outrage over &#39;disgusting&#39; Princess Kate comments",
        "description": "Fans of the Sussexes appeared to take aim at the Princess of Wales and a royal commentator has hit out at them branding their comments &quot;disgusting&quot;."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25408525/prince-harry-flying-award-hollywood-john-travolta-royal/",
        "title": "Hollywood A-lister with ‘strong emotional link’ to <b>Prince Harry</b> was behind duke receiving ‘Legend of Aviation’ award",
        "description": "PULP Fiction actor John Travolta was the driving force behind Prince Harry being inducted into an aviation hall of fame, it’s been claimed. Harry, 39, is set to be inducted tomorrow in"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/heartbroken-prince-harry-comforted-princess-31912632",
        "title": "Heartbroken <b>Prince Harry</b> &#39;comforted by Princess Anne&#39; after being told of Queen’s death",
        "description": "Queen Elizabeth II passed away in September 2022 at Balmoral Castle in Scotland, and Prince Harry recalled he arrived too late to see his dying grandmother after flying in from the US"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/princess-lilibet-could-inherit-980000-worth-of-jewellery-from-meghan-and-princess-diana_art20822.html",
        "title": "Princess Lilibet could inherit £980,000 worth of jewellery from Meghan and Princess Diana",
        "description": "Princess Lilibet is expected to be the owner of some of history’s most impressive jewellery pieces. From Meghan Markle’s collection to Princess Diana’s, here’s what she could"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/13-little-known-facts-severus-145124852.html",
        "title": "13 little-known facts about Severus Snape that &#39;<b>Harry</b> Potter&#39; fans probably don&#39;t remember",
        "description": "Snape, the Hogwarts Potions professor was a mysterious double agent, so even the biggest &quot;Harry Potter&quot; fans may not have heard all of these secrets."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12978251/ROBERT-JOBSON-Harry-contemplating-different-family-needs-gone-AWOL-raises-important-ifs.html",
        "title": "ROBERT JOBSON: <b>Harry</b> must be contemplating how it could have been so different. His family needs him, but he has gone AWOL. And it raises some important &#39;what ifs&#39;...",
        "description": "Rather than gazing at his navel or collecting pointless awards - lauded as a &#39;legend&#39; of aviation - the royal formerly known as Prince could have been doing something useful for Crown and country."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25406689/prince-harry-needs-call-dad-king-charles-kate/",
        "title": "<b>Prince Harry</b> NEEDS to call his dad King Charles and sister-in-law Kate over ops to bridge ‘very deep rift’, expert says",
        "description": "PRINCE Harry needs to call his dad and sister-in-law over their operations to bridge the “very deep rift”, a royal expert has said. The 42-year-old Princess of Wales is recovering in a"
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/royals-hospitals-london-clinic-kate-middleton-king-charles-b1133235.html",
        "title": "Inside the exclusive private London hospitals used by the royals",
        "description": "The Princess of Wales is recovering in the London Clinic in Marylebone, after a successful abdominal surgery, it was revealed yesterday. She’s expected to spend between ten and fourteen days at the private Harley Street clinic, before returning home to Windsor to continue her recovery."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/queen-camilla-confirms-king-charles-31911823.amp",
        "title": "Queen Camilla confirms King Charles is &#39;looking forward to getting back to work&#39; after hospital visit",
        "description": "The 75-year-old monarch, who acceded to the throne 16 months ago, will be admitted to hospital next week. <b>Prince Harry</b>&#39;s claim about Queen&#39;s death &#39;isn&#39;t exactly true&#39;, says royal author In a statement, Buckingham Palace said: “In common with thousands ..."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12976113/RICHARD-KAY-double-blow-King-Charles-Princess-Kates-medical-treatment-send-collective-shiver-spines.html",
        "title": "RICHARD KAY: The double blow of King Charles and our future Queen Kate&#39;s medical treatment leaves the nation reeling... it sends a shiver down our spines and shows how ...",
        "description": "After the sadness of the late Queen&#39;s slow decline and death, the bulletin about Catherine has sent a collective shiver down the spine of royal fans. People are reeling."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-william-visits-wife-kate-125234616.html",
        "title": "<b>Prince</b> William visits wife Kate in London hospital as she recovers from abdominal surgery",
        "description": "Thursday&#39;s visit came as the Princess of Wales was said to be &#39;doing well&#39; after a comfortable night at the private London Clinic"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-account-queens-death-31908122",
        "title": "<b>Prince Harry</b>&#39;s account of the Queen&#39;s death &#39;isn&#39;t exactly true&#39;, royal author claims",
        "description": "Prince Harry has claimed he found out about the death of Queen Elizabeth II from the BBC website, but a new book has now said the Royal Family &#39;urgently&#39; tried to contact him"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/prince-harrys-claim-queens-death-31909499",
        "title": "<b>Prince Harry</b>&#39;s claim about Queen&#39;s death &#39;isn&#39;t exactly true&#39;, says royal author",
        "description": "<b>Prince Harry</b> claims to have not found out about his grandmother Queen Elizabeth&#39;s death from his family but a royal author has now said that is not entirely true. The Duke of Sussex rushed to be by the late monarch&#39;s side when he heard about her fast declining health in the hours before her passing."
    },
    {
        "url": "https://www.ok.co.uk/royal/sarah-fergusons-hopes-landing-full-31846685",
        "title": "Sarah Ferguson&#39;s hopes of landing full-time This Morning role dashed in blow to <b>Prince</b> Andrew",
        "description": "Despite suggestions from the King for him to shift into <b>Prince Harry</b> and Meghan Markle &#39;s more modest four-bedroom Frogmore Cottage on the Windsor estate, Andrew&#39;s friends affirm that the Royal is not intending to consider alternate accommodation options."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12977963/zara-mike-tindall-royal-family-monarchy-princess-anne.html",
        "title": "Is it time for Mike and Zara Tindall to replace <b>Prince Harry</b> and Meghan Markle? Popular couple are already comfortable in the limelight - and swapping their money-making deals ...",
        "description": "The couple, who live together on Princess Anne &#39;s Gatecombe Estate in Gloucestershire, already have a closeness with the Wales family, are very popular with the public."
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/king-charles-and-kate-middleton-both-in-hospital-who-could-take-over-for-the-monarch-if-hes-incapacitated_art20815.html",
        "title": "King Charles and Kate Middleton both in hospital: Who could take over for the monarch if he’s incapacitated?",
        "description": "On Wednesday 17 January, it was announced that both the Princess of Wales and King Charles are having health issues requiring surgeries. While the Princess of Wales can be taken"
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-copyright-lilbet-name-31909336",
        "title": "Meghan Markle &#39;copyrighted the name of daughter Lilibet before birth&#39; says royal expert",
        "description": "Meghan Markle allegedly copyrighted the name Lilibet before she and Prince Harry welcomed their daughter in 2021, claims royal expert Angela Levin, who branded it &#39;disrespectful&#39;"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/kate-princess-of-wales-hospital-abdominal-surgery-william-kensington-palace-b1132967.html",
        "title": "Princess of Wales &#39;doing well&#39; in hospital after abdominal surgery as William postpones duties",
        "description": "The Princess of Wales has undergone planned abdominal surgery, Kensington Palace has said. Kate, 42, was admitted to The London Clinic on Tuesday for the planned procedure."
    },
    {
        "url": "https://www.thesun.ie/royals/12020158/princess-lilibet-inherit-gift-meghan-markle-princess-diana/",
        "title": "Princess Lilibet, two, set to inherit £980,000 gift from Meghan Markle &amp; there’s a nod to Princess Diana",
        "description": "SHE’S only two, but Princess Lilibet is set to receive a staggering £980,000 worth of jewellery from mum Meghan Markle in years to come. The Duchess of Sussex, 42, has an impressive collection of"
    },
    {
        "url": "https://www.hellomagazine.com/brides/511546/princess-eugenie-unearthed-comments-out-of-fashion-wedding-dress/?n=%40",
        "title": "Princess Eugenie&#39;s unearthed comments on &#39;out of fashion&#39; wedding dress",
        "description": "The Princess settled on a gown designed by Peter Pilotto and Christopher De Vos with a V at the front and the back which, combined with her lack of veil, showed off her scoliosis scar. It was a style she had envisioned from the moment she started her wedding dress search following Jack&#39;s proposal on New Year&#39;s Day in 2018."
    },
    {
        "url": "https://www.ibtimes.co.uk/blatant-attack-kate-middleton-royal-left-prince-william-furious-says-new-book-1722830",
        "title": "&#39;Blatant Attack&#39; On Kate Middleton By Royal Left <b>Prince</b> William Furious, Says New Book",
        "description": "Royal author Robert Hardman claimed that the Prince of Wales was furious over an assumption that he did not marry Kate Middleton for love."
    },
    {
        "url": "https://uk.news.yahoo.com/inside-exclusive-private-london-hospitals-135507369.html",
        "title": "Inside the exclusive private London hospitals used by the royals",
        "description": "The Princess of Wales is recovering in the London Clinic in Marylebone, after a successful abdominal surgery, it was revealed yesterday. She’s expected to spend between ten and fourteen days at the private Harley Street clinic, before returning home to Windsor to continue her recovery."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/511491/prince-william-and-kates-unknown-kind-gesture-to-prince-harry-and-meghan-markle-after-queens-death-revealed/",
        "title": "<b>Prince</b> William and Kate&#39;s unknown kind gesture to <b>Prince Harry</b> and Meghan after Queen&#39;s death revealed",
        "description": "Over the past couple of years, there has been much attention on Prince William and Prince Harry &#39;s strained relationship. The fractured ties were closely monitored during the period of mourning after Queen Elizabeth&#39;s death in September 2022 when the Waleses and Sussexes came together."
    },
    {
        "url": "https://www.newstatesman.com/culture/books/book-of-the-day/2024/01/charles-iii-biography-king-robert-hardman",
        "title": "Herbs and flowers flourish in my hilltop garden, except where I want them",
        "description": "Robert Hardman’s obsequious biography pays court to a monarch who is enjoying his power over a deferential nation."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/01/17/double-whammy-health-problems-blow-to-royal-hopes/",
        "title": "Double whammy of King and Princess’s health problems hits hopes of royal ‘annus mirabilis’",
        "description": "Prince of Wales will also be sidelined as he helps his wife convalesce and looks after children, leaving slimmed-down ‘Firm’ badly stretched"
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/take-kate-princes-wales-three-28466185",
        "title": "It will take Kate, Princes of Wales, three months to recover after surgery",
        "description": "The <b>Prince</b> of Wales is to take time off ... The Waleses also faced the ongoing rift between William and his brother the Duke of Sussex, with <b>Harry</b> making controversial claims about Charles, Camilla, William and Kate in his Netflix documentary and memoir ..."
    }
]