[
    {
        "url": "https://www.itv.com/news/2024-02-05/harry-to-fly-to-uk-to-be-with-his-father-after-king-charles-cancer-diagnosis",
        "title": "<b>Harry</b> to fly to UK to be with his father after King Charles cancer diagnosis",
        "description": "The duke, who has had a troubled relationship with Charles, has spoken to his father about the development. | ITV National News"
    },
    {
        "url": "https://www.huffpost.com/entry/king-charles-cancer-surgery_n_65c122cde4b069b665dc4f83?origin=alerts-banner",
        "title": "King Charles Diagnosed With Cancer, Buckingham Palace Says",
        "description": "King Charles has been diagnosed with cancer, Buckingham Palace said in a statement Monday. The palace did not go into detail about the kind of cancer the British monarch has, or its severity. “During The King’s recent hospital procedure for benign prostate enlargement,"
    },
    {
        "url": "https://edition.cnn.com/2024/02/05/uk/king-charles-cancer-explainer-intl-gbr/index.html",
        "title": "King Charles has cancer. Here’s what we know",
        "description": "King Charles III has been diagnosed with cancer and has started treatment in London. The shock diagnosis comes a week after the 75-year-old British monarch left hospital following a separate procedure for an enlarged prostate."
    },
    {
        "url": "https://news.sky.com/story/king-cancer-diagnosis-latest-he-chose-to-share-diagnosis-to-prevent-speculation-13064923?postid=7187980",
        "title": "King Charles cancer diagnosis latest: He chose to share news to &#39;prevent speculation&#39;; <b>Prince Harry</b> to travel to UK to see father",
        "description": "The King, like his mother before him, is a fluent French speaker, and made 34 official visits to France as the <b>Prince</b> of Wales ... The Sun&#39;s political editor <b>Harry</b> Cole and the royal historian Kate Williams, live from 10.30pm in the stream above."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46651016/british-government-outline-monarchy-king-charles-william/",
        "title": "How the British Government Will Be Affected by King Charles’s Recent Diagnosis",
        "description": "Current Counsellors of State include Queen Camilla, <b>Prince</b> William, Princess Beatrice, Princess Anne, and <b>Prince</b> Edward. <b>Prince Harry</b> and <b>Prince</b> Andrew used to serve in the role until they stepped back from their royal duties, resulting in an amendment ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-68211941",
        "title": "What does the King&#39;s diagnosis mean for William, <b>Harry</b> and the other royals?",
        "description": "It&#39;s been a bleak midwinter for the Royal Family. Prince William, Prince Harry and their royal relations will now face private anxieties and public pressures after the King&#39;s worrying health news."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/king-charles-apologises-for-postponed-engagements-after-cancer-diagnosis/",
        "title": "King Charles apologises for postponed engagements after cancer diagnosis",
        "description": "Read more: The Palace&#39;s statement in full <b>Prince Harry</b> to visit King King&#39;s health issues over the years Other members of the Royal Family, including the <b>Prince</b> of Wales, may take on some extra duties on behalf of the King. It is understood the King will ..."
    },
    {
        "url": "https://www.newstatesman.com/uncategorized/2024/02/the-king-of-suffering",
        "title": "The woman hunting Ed Davey",
        "description": "Buckingham Palace’s announcement this evening that the King has been diagnosed with cancer turns Charles’ words around. The suffering and the hardship that Charles saw everywhere will belong to him now too."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68208157?at_campaign_type=owned&at_ptr_name=facebook_page&at_medium=social&at_format=link&at_campaign=Social_Flow&at_bbc_team=editorial&at_link_id=15BE6812-C452-11EE-8386-B3538161DE7E&at_link_type=web_link&at_link_origin=BBC_South",
        "title": "King Charles III diagnosed with cancer, Buckingham Palace says",
        "description": "The Duke of Sussex, <b>Prince Harry</b>, who lives in the United States, spoke to his father and will be travelling to the UK to see him in the coming days. The King returned to London from Sandringham in Norfolk on Monday morning and the palace says he has ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13049051/king-charles-cancer-diagnosis-remains-hugely-positive.html",
        "title": "&#39;The prognosis is good&#39;: King Charles III remains &#39;hugely positive&#39; regarding his cancer diagnosis and will carry on with &#39;business as usual&#39; - as nation holds its breath and ...",
        "description": "Family and friends were said to be amazed by his determination to carry on with &#39;business as usual&#39;. It is understood his condition has been caught very early and the prognosis is good."
    },
    {
        "url": "https://uk.news.yahoo.com/harry-fly-uk-king-cancer-222719121.html",
        "title": "<b>Harry</b> to fly to UK to be with the King after cancer news",
        "description": "The Duke of Sussex has spoken to the King about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Harry said. The King has started treatment today, a Buckingham Palace statement says. The palace has not confirmed what type of cancer the 75-year-old monarch has."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048705/Trump-sends-prayers-King-Charles-fast-recovery-cancer-Ex-President-calls-monarch-wonderful-man-got-know-presidency.html",
        "title": "Trump sends his prayers to King Charles for a &#39;fast and full recovery&#39; from cancer: Ex-President calls monarch a &#39;wonderful man&#39; who he got to know &#39;very well&#39; during his ...",
        "description": "The King is understood to have personally informed his sons <b>Prince</b> William and <b>Prince Harry</b> about his condition. <b>Harry</b> will be flying to London from the U.S. in the &#39;coming days&#39; to be by his father&#39;s side as he begins treatment. Biden last met King ..."
    },
    {
        "url": "https://www.theguardian.com/uk-news/live/2024/feb/05/king-charles-cancer-royal-health-latest-news-updates?page=with:block-65c165608f08d62b48aaa9b3",
        "title": "King Charles: <b>Prince Harry</b> to travel to UK to see father after cancer diagnosis – as it happened",
        "description": "King Charles ‘wholly positive about treatment’ but will postpone public-facing duties"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/05/king-charles-cancer-diagnosis-royal-family/",
        "title": "King’s confident start to reign forced off course by cancer diagnosis",
        "description": "Workaholic monarch is now left to contemplate not what he can do but what he can manage as he is forced to – temporarily – slow down"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25741435/king-charles-cancer-returning-duty/",
        "title": "King Charles ‘remains wholly positive and looks forward to returning to duty’ after cancer diagnosis",
        "description": "As <b>Prince Harry</b> prepared to fly from the US to see his father, there was an outpouring of support for the monarch from around the world. The King, 75, has already begun hospital care as an out-patient after returning from Sandingham to London. While it is ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25742668/king-charles-health-battles-cancer-back-pain/",
        "title": "King Charles’ health battles before cancer diagnosis – including chronic neck pain &amp; broken rib",
        "description": "KING Charles has faced a number of health battles in his life before being given a cancer diagnosis. The monarch, like anyone who is 75-years-old, has faced a number of issues with his health over"
    },
    {
        "url": "https://www.thetimes.co.uk/article/prince-harry-visit-uk-king-charles-cancer-k0h97s72p?ilc=timesradio:morefromthetimes",
        "title": "<b>Prince Harry</b> to visit King in UK for rare meeting",
        "description": "“Please, boys … don’t make my final years a misery”, Charles is said to have told his sons, according to <b>Prince Harry</b>’s incendiary memoir, Spare. These words have taken on a new poignancy since the news about the King’s health on Monda"
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/king-charles-issues-touching-apology-32054919",
        "title": "King Charles issues touching apology as news of his cancer diagnosis is revealed",
        "description": "Buckingham Palace confirmed in a statement that King Charles has been diagnosed with cancer and will postpone his forthcoming public duties as he begins treatment straight away"
    },
    {
        "url": "https://www.theguardian.com/uk-news/live/2024/feb/05/king-charles-cancer-royal-health-latest-news-updates?page=with:block-65c164908f0856364121ea5c",
        "title": "King Charles: <b>Prince Harry</b> to travel to UK in coming days to see father after cancer diagnosis – latest news updates",
        "description": "King Charles ‘wholly positive about treatment’ but will postpone public-facing duties"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/king-charles-why-cancer-is-an-entirely-individual-disease-and-which-factors-will-influence-monarchs-treatment/",
        "title": "King Charles: Why cancer is an entirely individual disease - and which factors will influence monarch&#39;s treatment",
        "description": "Given most of us prefer to keep our health matters private, it&#39;s absolutely no surprise Buckingham Palace have decided not to reveal more details about the King&#39;s cancer diagnosis, other than to say it&#39;s not prostate cancer."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/king-charles-offers-touching-apology-28576115",
        "title": "King Charles offers touching apology as his cancer diagnosis is announced",
        "description": "King Charles III has apologised after postponing his upcoming public duties following his cancer diagnosis. It was announced by Buckingham Palace earlier this evening that Charles had been diagnosed with an unspecified form of cancer. The King pulled out of his planned engagements earlier this month to receive treatment for an enlarged prostate."
    },
    {
        "url": "https://news.sky.com/story/king-charles-cancer-diagnosis-prince-harry-to-travel-to-uk-to-see-monarch-in-coming-days-13064948",
        "title": "King Charles cancer diagnosis: <b>Prince Harry</b> to travel to UK to see monarch &#39;in coming days&#39;&#39;",
        "description": "The diagnosis comes following treatment for an enlarged prostate, although the palace said he does not have prostate cancer."
    },
    {
        "url": "https://www.newsletter.co.uk/news/people/prince-harry-set-to-jet-out-to-the-uk-to-be-with-his-father-king-charles-after-cancer-news-4506467",
        "title": "<b>Prince Harry</b> set to jet out to the UK to be with his father King Charles after cancer news",
        "description": "<b>Harry</b> has a troubled relationship with his father, although they are still in contact, but his long-running rift with the <b>Prince</b> of Wales remains ongoing. Charles, according to <b>Harry</b>, pleaded with his sons during a tense meeting after the Duke of Edinburgh ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863050/prince-harry-meghan-markle-poll",
        "title": "Royal Family LIVE: <b>Prince Harry</b> and Meghan Markle&#39;s popularity plunges in brutal new poll",
        "description": "Prince Harry and Meghan Markle&#39;s popularity since they left the Royal Family has continued its downward spiral, new polling results show."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harry-rushing-back-uk-32055183",
        "title": "<b>Prince Harry</b> &#39;rushing back to UK tonight&#39; as Meghan stays at home after Charles&#39; diagnosis",
        "description": "Prince Harry is believed to be flying back to the UK from California to be by his father King Charles III&#39;s side, after the news was confirmed that the Monarch has been diagnosed with cancer"
    },
    {
        "url": "https://www.leeds-live.co.uk/news/meghan-markle-stays-away-prince-28576402",
        "title": "Meghan Markle stays away as <b>Prince Harry</b> flies to see King Charles on his own following cancer diagnosis",
        "description": "Meghan Markle will not be returning to the UK to see King Charles, as her husband Prince Harry flies to London alone following his dad the King&#39;s cancer blow. Harry, The Duke of Sussex is flying back to the UK &#39;in the coming days&#39; to be with his dad, according to PA."
    },
    {
        "url": "https://uk.style.yahoo.com/biden-trump-wish-king-charles-210914357.html",
        "title": "Biden and Trump Wish King Charles the Best Amid Cancer Battle",
        "description": "Kevin Lamarque/ReutersPresident Joe Biden has expressed concern for Britain’s King Charles III following his cancer diagnosis, news of which the palace announced Monday—sending shockwaves across the United Kingdom."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/celebs-tv/king-charles-final-years-plea-28576376",
        "title": "King Charles&#39; &#39;final years&#39; plea and the bitter feud as <b>Prince Harry</b> flies to UK after cancer diagnosis",
        "description": "Prince Harry is flying back to the UK urgently to see his father King Charles after it was made public that the monarch has been diagnosed with cancer. The Duke of Sussex, who lives in the States with wife Meghan Markle, has been locked in a feud with the Royal Family but is &#39;clearing his diary&#39; to fly back from his California home to see his dad."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/charles-prince-william-harry-last-32054545",
        "title": "When did Charles, <b>Prince</b> William and <b>Harry</b> last speak? Timeline of royal relationship",
        "description": "Prince Harry has had a fractured relationship with his father and brother ever since he and his wife Meghan Markle stepped back from royal duties in 2020."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863421/prince-harry-royal-family-feud-king-charles",
        "title": "<b>Prince Harry</b> feud &#39;could finally end&#39; as he rushes back to support King Charles",
        "description": "<b>Prince Harry</b> is rushing home to be by his father King Charles’s side after his cancer diagnosis - and it could be the start of a reconciliation according to a royal expert. The Duke of Sussex, who currently lives with his wife Meghan in Montecito ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/prince-harry-fly-uk-king-28576282",
        "title": "<b>Prince Harry</b> to fly to UK to be with the King after cancer diagnosis",
        "description": "The Duke of Sussex will clear his diary and travel from his home in California to be with his father in the coming days after the royal&#39;s shock cancer diagnosis"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/05/prince-william-prince-harry-king-charles-cancer-diagnosis/",
        "title": "William is in a bind, if the Royal family ever needed <b>Harry</b> it’s now",
        "description": "What the Prince of Wales and the Duke of Sussex do still have in common is their shared love for their ‘darling Pa’"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/prince-harry-head-u-k-202117633.html",
        "title": "<b>Prince Harry</b> Will Head to the U.K. to Visit King Charles After His Cancer Diagnosis",
        "description": "Sources say Charles called his sons to tell them the news."
    },
    {
        "url": "https://www.bbc.com/news/uk-68209692?at_format=link&at_ptr_name=twitter&at_campaign_type=owned&at_link_type=web_link&at_link_origin=BBCNews&at_bbc_team=editorial&at_link_id=C4CB018A-C457-11EE-98A3-6E93D0B4AF07",
        "title": "King Charles: <b>Prince Harry</b> to visit his father in coming days",
        "description": "A source close to <b>Prince Harry</b> said he had spoken to his father about the diagnosis. The news comes as well wishes pour in for the King, led by the prime minister. &quot;Wishing His Majesty a full and speedy recovery,&quot; Rishi Sunak said. &quot;I have no doubt he&#39;ll ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/prince-harry-travel-uk-see-9080021",
        "title": "<b>Prince Harry</b> to travel to UK to see King Charles after monarch&#39;s cancer diagnosis",
        "description": "Prince Harry is expected to travel to the UK to his father King Charles after the announcement that he has cancer. A source close to the Duke of Sussex said he would fly to the UK &quot;in the coming days&quot;."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/king-charles-continuing-royal-duties-revealed-amid-cancer-treatment-20229320/?ico=trending-module_tag_cancer_item-1",
        "title": "King Charles has been diagnosed with cancer. How will this affect his royal duties?",
        "description": "‘We look forward to seeing him back to swift full health.’ <b>Prince Harry</b> is also rushing back to the UK after learning of his father’s health worries via personal phone call. He will fly from California to London tonight. The Duchess of Sussex will ..."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-personally-shared-diagnosis-230000499.html",
        "title": "King Charles &#39;personally shared diagnosis with his family&#39;",
        "description": "<b>Prince Harry</b> and other family members of the news. Charles shared the diagnosis with his sons and his siblings - Princess Anne, <b>Prince</b> Andrew and <b>Prince</b> Edward - before Buckingham Palace formally announced the news to the world, according to PEOPLE."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/harry-meghan-hit-stinging-new-32049557?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "<b>Harry</b> and Meghan hit with stinging new claims about Queen Elizabeth&#39;s opinion of them",
        "description": "<b>Prince Harry</b> and Meghan Markle have come under fire in a brand new book, which suggests Queen Elizabeth II wasn&#39;t a fan of their romance or lavish wedding. The Duke and Duchess of Sussex started dating in 2016 before tying the knot in a fairy-tale wedding ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/details-prince-harrys-last-minute-28576542",
        "title": "Details of <b>Prince Harry</b>&#39;s last minute flight home after King Charles&#39; cancer diagnosis revealed by source",
        "description": "<b>Prince Harry</b> is said to be flying home alone from his home in California in the coming days, after personally receiving the information from the King in a phone call. Now, <b>Harry</b> is clearing his diary and travelling home, with the move likely to raise ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048557/Harry-King-Charles-cancer-diagnosis-royal-reconciliation-MAUREEN-CALLAHAN.html",
        "title": "MAUREEN CALLAHAN: How hard it must have been for <b>Harry</b> to hear the sad news of Charles&#39;s cancer diagnosis from so far away. Now, as he flies home, could this be the start of a ...",
        "description": "Prince Harry is essential to his family, now as never before. King Charles has said that the door is always open to his youngest son. Now is the perfect time for him to take this"
    },
    {
        "url": "https://www.ok.co.uk/royal/itvs-lorraine-calls-family-reunion-32055037",
        "title": "ITV&#39;s Lorraine calls for family reunion as <b>Prince Harry</b> heads to UK after Charles diagnosis",
        "description": "Lorraine Kelly has shared a message of support for the Royal Family after it was announced that Prince Harry would be returning to the UK after his father King Charles&#39; cancer diagnosis"
    },
    {
        "url": "https://inews.co.uk/news/king-charles-reign-test-cancer-2891592?ico=most_popular",
        "title": "King Charles personally called <b>Prince</b> William and <b>Harry</b> about cancer diagnosis",
        "description": "In a signal of the road ahead, a Buckingham Palace statement said King Charles had been advised to postpone &#39;public-facing duties&#39; while he receives care"
    },
    {
        "url": "https://inews.co.uk/news/king-charles-diagnosed-cancer-2891290?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "King Charles diagnosed with cancer, Buckingham Palace announces",
        "description": "Charles personally called both the Duke of Sussex and the <b>Prince</b> of Wales – as well as his siblings the Princess Royal, the Duke of York and the Duke of Edinburgh – to share the news of his diagnosis. <b>Harry</b>, who lives in the United States, will travel ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/moment-bbc-broke-news-king-charles-cancer-diagnosis-20229721/?ico=metro-posts_cars_whats-trending-now",
        "title": "The moment BBC broke news of King Charles’ cancer diagnosis",
        "description": "Awful news. Wish him a full and speedy recovery,’ the full message read. <b>Prince Harry</b> will travel to the UK in the coming days to be with his father, and TV presenter Lorraine Kelly hopes ‘bridges can be rebuilt’. ‘Families need to come together ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/prince-harry-travel-u-k-185805350.html",
        "title": "<b>Prince Harry</b> Will Travel to the U.K. Soon to See King Charles amid His Father&#39;s Cancer Diagnosis",
        "description": "Related: King Charles, 75, Announces Cancer Diagnosis, Postpones All Future Engagements for Now. Prince Harry has returned to the U.K. on several occasions since, including to att"
    },
    {
        "url": "https://www.bbc.com/news/uk-68209692",
        "title": "King Charles: <b>Prince Harry</b> to visit his father in coming days",
        "description": "The Duke of Sussex will travel to the UK to visit King Charles &quot;in the coming days&quot; after Buckingham Palace announced the monarch had been diagnosed with cancer, the BBC understands. A source close to Prince Harry said he had spoken to his father about the diagnosis."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/prince-harry-returning-uk-visit-28575839",
        "title": "<b>Prince Harry</b> returning to UK to visit King Charles after cancer diagnosis",
        "description": "The Duke of Sussex is said to have spoken to his father about his recent cancer diagnosis and will travel to the UK in the coming days"
    },
    {
        "url": "https://news.sky.com/story/prince-harry-to-travel-to-uk-to-see-king-in-coming-days-after-cancer-diagnosis-13064948",
        "title": "<b>Prince Harry</b> to travel to UK to see King &#39;in coming days&#39; after cancer diagnosis",
        "description": "The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Harry said."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/prince-harry-fly-back-uk-28575819",
        "title": "<b>Prince Harry</b> to fly back to UK after King Charles called personally to share cancer diagnosis",
        "description": "The Duke of Sussex has spoken with the King about his cancer diagnosis and will travel to the UK to see him in the coming days, a source close to Harry said."
    },
    {
        "url": "https://www.irishmirror.ie/showbiz/celebrity-news/prince-harry-dash-back-uk-32054205",
        "title": "<b>Prince Harry</b> to dash back to UK after father King Charles&#39; cancer diagnosis",
        "description": "<b>Prince Harry</b> will reportedly fly back to the UK in the next few days after speaking to his father King Charles, who told him personally about his cancer diagnosis Want all the latest Showbiz news direct to your inbox? Share your email for news, gossip and ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-fly-back-uk-204345503.html",
        "title": "<b>Prince Harry</b> To Fly Back To UK To Be With King Charles After Father&#39;s Cancer Diagnosis",
        "description": "Prince Harry is to fly to London to be with his father after the King’s shock cancer diagnosis. The Duke of Sussex has spoken with King Charles about his condition and will travel to the UK to see him in the coming days, a source close to Prince Harry has said."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863160/prince-harry-meghan-markle-royals-first-time",
        "title": "<b>Prince Harry</b> lays bare &#39;struggle&#39; when introducing Meghan Markle to royals for first time",
        "description": "Prince Harry once revealed the one struggle he had to face when he introduced his wife, Meghan Markle to his family."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/showbiz-news/prince-harry-set-return-uk-28575862",
        "title": "<b>Prince Harry</b> set to return to UK after King Charles III cancer diagnosis",
        "description": "<b>Prince Harry</b> is set to return to the UK after King Charles III revealed his cancer diagnosis. A statement from Buckingham Palace today, February 5, confirmed His Majesty has been diagnosed with a form of cancer. According to PA News, a source close to the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/prince-harry-travelling-uk-after-28575846",
        "title": "<b>Prince Harry</b> &#39;travelling to the UK&#39; after King Charles cancer diagnosis",
        "description": "<b>Prince Harry</b> will be flying into the UK in the coming days after his father King Charles was diagnosed with cancer, a source close to him has said. The King is currently receiving treatment for cancer, it was announced today. He has postponed public duties ..."
    }
]