[
    {
        "url": "https://www.cheatsheet.com/entertainment/william-kate-probably-happy-harry-meghans-canada-trip-according-royal-author.html/",
        "title": "Why William and Kate Were Probably Happy About <b>Harry</b> and Meghan’s Canada Trip, According to a Royal Author",
        "description": "A royal author says Prince William and Kate Middleton probably didn&#39;t &#39;mind&#39; Prince Harry and Meghan Markle&#39;s Canada trip for this reason."
    },
    {
        "url": "https://www.telegraph.co.uk/us/politics/2024/02/24/donald-trump-us-election-2024-joe-biden-republicans-cpac/",
        "title": "Donald Trump promises ‘liberation day’ for America",
        "description": "While at CPAC, Mr Trump also lashed out at <b>Prince Harry</b>, warning he would not “protect” him if he wins a second term, amid a legal challenge relating to the Duke’s visa application. “I wouldn’t protect him. He betrayed the Queen. That’s ..."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/24/prince-harry-on-his-own-if-i-win-again-says-donald-trump/?n=@",
        "title": "<b>Prince Harry</b> ‘on his own’ if I win again, says Donald Trump",
        "description": "Donald Trump has said Prince Harry will be “on his own” if he wins a second term this year as the former president criticised him for an “unforgivable” betrayal of Queen Elizabeth II. Mr Trump said that Joe Biden’s administration had been “too gracious” to the Duke of Sussex since he moved to America in 2020."
    },
    {
        "url": "https://www.thesun.ie/royals/12280319/meghan-markle-agent-tv-deals-netflix/",
        "title": "Meghan Markle smiles as she leaves lunch despite fears her Netflix deal will be axed",
        "description": "THE Duchess of Sussex is all smiles as she leaves a lunch — despite fears her Netflix deal will be canned. Meghan, 42, wore an oversized brown coat in Beverly Hills as she met with Clare Waight"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13122011/king-charles-viral-card-royal-dont-wear-cone.html",
        "title": "I sent King Charles the viral card - he needed a laugh after his cancer diagnosis: Royal well-wisher behind &#39;at least you don&#39;t have to wear a cone&#39; joke revealed - as designer ...",
        "description": "EXCLUSIVE: Lisa Moffat, 53, was dumbstruck by videos and photographs of the King chuckling at the £9.99 &#39;giant&#39; get well Moonpig, depicting a sorry-looking dog in a cone."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1870457/prince-harry-blunt-meghan-markle-reply-buckingham-palace",
        "title": "<b>Prince Harry</b>’s blunt two-word reply to Meghan Markle in awkward Buckingham Palace moment",
        "description": "<b>Prince Harry</b> gave a blunt two-word response to Meghan Markle in a recently unearthed awkward moment on the balcony of Buckingham Palace. Eagle-eyed royal fans spotted the tricky exchange between the Duke and Duchess of Sussex during a flypast to mark the ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/prince-harrys-difficult-call-over-32203990",
        "title": "<b>Prince Harry</b>&#39;s &#39;difficult call&#39; over awkward King Charles moment - but Meghan had &#39;no filter&#39;",
        "description": "Meghan Markle and Prince Harry were treated to a performance by Michael Buble during a glitzy event in Canada last week - but a body language expert suggests Harry wasn&#39;t impressed"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1870445/prince-harry-prince-william-reunion-royal-family-latest",
        "title": "<b>Prince Harry</b> ‘out for himself’ after PR stunt with &#39;no chance&#39; of <b>Prince</b> William reunion",
        "description": "Prince Harry suggested that his father King Charles&#39;s recent cancer diagnosis could reunite him with his family, including his elder brother Prince William."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-harrys-big-2024-sussex-32203761",
        "title": "Meghan and <b>Harry</b>&#39;s big 2024 Sussex rebrand is &#39;being rejected by the world&#39;",
        "description": "<b>Prince Harry</b> and Meghan Markle&#39;s rebrand is being &quot;rejected by the world&quot; according to a royal expert. After a tough 2023, the Duke and Duchess of Sussex are seemingly embarking on a fresh rebrand in 2024. Just two months into the year, the couple have ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/prince-harry-coming-back-royal-32203480.amp",
        "title": "<b>Prince Harry</b> coming back into royal fold is &#39;laughable and unthinkable&#39;, claims source",
        "description": "Sources have reportedly said that the idea of Prince Harry returning to the royal fold amid King Charles&#39; treatment for cancer is both &#39;laughable and unthinkable&#39;"
    },
    {
        "url": "https://www.hellomagazine.com/royalty/514137/meghan-markle-gorgeous-stunning-new-photo-black-history-month/",
        "title": "Meghan Markle is gorgeous in stunning new photo as she celebrates cause close to her heart",
        "description": "Meghan Markle has celebrated Black History Month through a post on Archewell, which highlighted museums and other cultural spaces across the United States which are focused on Black history."
    },
    {
        "url": "https://www.thesun.co.uk/royals/26134506/harry-meghan-william-camilla-royal/",
        "title": "<b>Harry</b> and Meghan ‘have said too much about William and Camilla’ for them to have any hybrid royal role, expert says",
        "description": "PRINCE Harry and Meghan Markle have said too much about Prince William and Queen Camilla for the couple to have any hope of a hybrid royal role, an expert has said. Palace insiders claim Harry has"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-left-out-king-32202540",
        "title": "<b>Prince Harry</b> &#39;left out&#39; of King Charles’ contingency plans as &#39;none involve him&#39;",
        "description": "Prince Harry is reported to have been &#39;left out&#39; of his father King Charles’ contingency plans amid his cancer diagnosis, with none off the plans reported to involve the Duke of Sussex"
    },
    {
        "url": "https://uk.style.yahoo.com/royals-favourite-holiday-destinations-bahamas-130033649.html",
        "title": "These are the royals&#39; favourite holiday destinations, from the Bahamas to Botswana",
        "description": "If you&#39;re after some inspiration for your next getaway, then the royals&#39; favourite holiday destinations may be a good place to start. While the family&#39;s official duties may take them all over the world, certain stunning locations have become their go-to places to unwind."
    },
    {
        "url": "https://www.harpersbazaar.com/celebrity/latest/a46935234/meghan-markle-business-casual-knit-sweater-jeans/",
        "title": "Duchess Meghan Takes On Business Casual in Cozy Knits, Uncharacteristically Laid-Back Jeans",
        "description": "Duchess Meghan is in her business mogul era, and taking a laid-back approach to dressing the part."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12730505/Charles-Diana-engagement-traumatised-remark.html",
        "title": "The day Charles and Diana announced their engagement to the world - and the <b>Prince</b> &#39;traumatised&#39; the young Lady Di with just one casual remark...",
        "description": "He had popped the question no fewer than three times when he fianlly met the woman he would marry. Prince Charles announced his engagement on February 24, 1981."
    },
    {
        "url": "https://metro.co.uk/2024/02/24/kings-cancer-may-dangerous-led-believe-20339616/",
        "title": "King’s cancer ‘may be more dangerous than we have been led to believe,’ warns expert",
        "description": "King Charles has reportedly begun work on his succession plan, sparking fears his cancer diagnosis may be ‘more dangerous than we have been led to believe.’ Earlier this month Charles revealed he had been diagnosed with cancer after being admitted to hospital for a separate issue regarding an enlarged prostate."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-releases-video-thousands-112938620.html",
        "title": "King Charles Releases Video Of Thousands Of Cards Received Since Cancer Diagnosis: “Greatest Comfort”",
        "description": "More from Deadline <b>Prince Harry</b> &quot;Willing To Take Up Royal Role&quot; Following King Charles&#39;s Cancer Diagnosis - Report <b>Prince Harry</b> Talks To &#39;Good Morning America&#39; After Visiting Father But Gives No Details On King Charles&#39; Health Outlook: &quot;That Stays Between ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/514077/prince-harry-life-in-pictures/",
        "title": "<b>Prince Harry</b>’s life in photos: from a young boy to family life with Meghan Markle",
        "description": "<b>Prince Harry</b> is the youngest son of King Charles and the late Diana, Princess of Wales. Born Henry Charles Albert David on 15 September 1984, he is currently fifth in line to the throne after his older brother, <b>Prince</b> William, and his three children ..."
    },
    {
        "url": "https://uk.news.yahoo.com/prince-harry-may-lied-drug-085840799.html",
        "title": "<b>Prince Harry</b> &#39;may have lied&#39; about drug use in Spare to sell copies, US lawyer argues in visa case",
        "description": "Prince Harry’s memoir is not “proof” he took drugs and could have been embellished to “sell books”, a lawyer for the Biden administration argued on Friday. Sharon Osbourne spent several months in therapy after an explosive row defending Piers Morgan over issues of race regarding Meghan, Duchess of Sussex."
    },
    {
        "url": "https://www.thesun.co.uk/news/26164390/donald-trump-royal-family-soft-prince-harry/",
        "title": "Donald Trump claims Royal Family have been too soft on <b>Prince Harry</b> &amp; he won’t ‘protect’ him as president",
        "description": "DONALD Trump claims the Royal Family have been too soft on <b>Prince Harry</b> — and that he won’t “protect” him if he becomes President again. The ex-President believes the royals were “too gracious” over <b>Harry</b>’s revelations, including the royal ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-william-harry-royal-32201497",
        "title": "King Charles &#39;puts succession plan in place&#39; but it&#39;s kept &#39;highly secret&#39; from <b>Prince Harry</b>",
        "description": "King Charles is reportedly putting plans in place for the eventual succession of the <b>Prince</b> of Wales - but it seems <b>Prince Harry</b> has been left out of these secret discussions. King Charles was diagnosed with cancer last month after a routine operation for ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/king-charless-blunt-four-word-28697771",
        "title": "King Charles&#39;s blunt four-word response after Royal fan&#39;s plea for <b>Prince Harry</b> return",
        "description": "Speculation over a possible return to Royal duties for <b>Prince Harry</b> have been circulating following news of his dad&#39;s cancer battle. Buckingham Palace previously announced King Charles would be stepping back from public duties while he has treatment for ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/meghan-markle-broke-royal-tradition-32204565",
        "title": "Meghan Markle broke royal tradition with Princess Beatrice&#39;s husband following her lead",
        "description": "At the time, Meghan was engaged to <b>Prince Harry</b> as they prepared for their upcoming wedding which would take place a few months later in May 2018, the Mirror reports. The rule was bent for Meghan because she was living in London at Nottingham Cottage ..."
    },
    {
        "url": "https://www.irishmirror.ie/news/world-news/king-charles-prince-harry-meghan-32196134.amp",
        "title": "King Charles once gave four-word response when asked to &#39;bring back&#39; <b>Prince Harry</b>",
        "description": "Charles seemingly let Royal fans catch a glimpse of his affection for the Duke of Sussex during a walkabout at the University of East London&#39;s Stratford campus King Charles once had a short but sweet reply when someone asked him to bring <b>Prince Harry</b> back ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/us/prince-harrys-memoir-spare-is-not-a-testimony-that-he-took-drugs-lawyer-tells-court/articleshow/107967027.cms",
        "title": "<b>Prince Harry</b>’s memoir ‘Spare’ is not a testimony that he took drugs, lawyer tells court",
        "description": "In a Washington DC court, the Biden administration disputes <b>Prince Harry</b>&#39;s memoir as proof of drug use amid his visa application hearing. The Heritage Foundation demands public disclosure, arguing his drug acknowledgment should disqualify him. DHS opposes ..."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/24/65da5f0eca4741b8618b45a2.html",
        "title": "Princess Kate&#39;s return plans unveiled by health specialist",
        "description": "Princess Kate is currently in the process of recuperating from a recent abdominal surgery, and as she prepares to resume her royal duties, a delicate balance between her mental and"
    },
    {
        "url": "https://www.etonline.com/king-charles-shares-video-of-get-well-cards-hes-received-since-his-cancer-diagnosis-220391",
        "title": "King Charles Shares Video of Get Well Cards He&#39;s Received Since His Cancer Diagnosis",
        "description": "&quot;✉️ The King has had a chance to read a wide selection of the thousands of Get Well cards and letters that have been sent to Buckingham Palace since his diagnosis. 🖋️ Thank you to all those who have written in,&quot; the caption, alongside the video shared across the king&#39;s official social media accounts, read."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1161208-prince-harry-faces-big-setback-after-showing-desire-for-royal-reunion",
        "title": "<b>Prince Harry</b> faces big setback after showing desire for royal reunion",
        "description": "Prince Harry has been advised to forget about his dream of a royal reunion after King Charles&#39;s cancer diagnosis.Ingrid Seward, a royal commentator told Fabulous magazine that the Duke of"
    },
    {
        "url": "https://www.news.com.au/entertainment/celebrity-life/royals/kate-middletons-nightmare-return-to-work/news-story/e9011256057bbcb351582137e9098b65",
        "title": "Kate Middleton’s nightmare return to work",
        "description": "As we all know, Kate has been Off with a capital ‘O’ since 2023, not seen since the royal family braved the chill on December 25 to walk to church betwixt masses of hardcore royal fans armed with 2004 digital cameras and petrol station forecourt flowers."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/24/65da418222601dc0218b456f.html",
        "title": "King Charles could use secret weapon to rectify issues with <b>Prince Harry</b> and Meghan",
        "description": "King Charles may enlist his &quot;no-nonsense&quot; sister, Princess Anne, to mediate the ongoing rift with Prince Harry and Meghan Markle, at least according to a royal expert. The 75-year"
    },
    {
        "url": "https://deadline.com/2024/02/king-charles-video-reading-cards-supporters-cancer-diagnosis-1235836450/",
        "title": "King Charles Releases Video Of Thousands Of Cards Received Since Cancer Diagnosis: “Greatest Comfort”",
        "description": "King Charles has shared his thanks for the thousands of cards and letters of support he has received since making public his cancer diagnosis. In a video released Friday evening, the King was seen reading several of the letters of good wishes and was quoted: “Such kind thoughts are the greatest comfort and encouragement.”"
    },
    {
        "url": "https://www.livemint.com/news/trends/will-prince-harry-s-book-have-his-us-visa-rejected-due-to-admission-of-drug-use-today-s-court-ruling-may-decide-so-11708755543123.html",
        "title": "Will <b>Prince Harry</b>’s book have his US visa rejected due to admission of drug use? Today’s court ruling may decide so",
        "description": "Prince Harry&#39;s autobiography &#39;Spare&#39; where he admitted to drug use may impact his future in the US, sparking a legal challenge regarding his visa status."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/us-news/meghan-markle-back-in-business-eyes-major-hollywood-role-amid-prince-harrys-uk-return-row-report-101708754984076.html",
        "title": "Meghan Markle back in business: Eyes major Hollywood role amid <b>Prince Harry</b>&#39;s UK return row: Report",
        "description": "This development coincides with reports of <b>Prince Harry</b> considering a temporary return to the UK amid King Charles&#39; illness. FILE - <b>Prince Harry</b> and Meghan Markle, Duke and Duchess of Sussex visit the track and field event at the Invictus Games in The ..."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/prince-harry-shares-extremely-rare-160000377.html",
        "title": "<b>Prince Harry</b> Shares Extremely Rare Update About His Two Kids",
        "description": "A few weeks back, Prince Harry and Meghan Markle, 42, issued a rare statement about their kids, Archie, 4, and Lilibet, 2, following the U.S. Senate Judiciary Committee’s hearing on protecting children online."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/us/will-meghan-markle-extend-her-netflix-contract-or-be-a-lifestyle-entrepreneur-here-is-what-we-know/articleshow/107972436.cms",
        "title": "Will Meghan Markle extend her Netflix contract or be a lifestyle entrepreneur? Here is what we know",
        "description": "Media reports suggest that Meghan Markle is most likely to take on lifestyle gurus like Martha Stewart, Gwyneth Paltrow, and Ina Garten and play them at their own game. Will she not renew her Netflix deal?"
    },
    {
        "url": "https://www.btimesonline.com/articles/164288/20240225/king-charles-vision-clashes-with-princess-annes-warnings-against-a-slimmed-down-monarchy.htm",
        "title": "King Charles&#39; Vision Clashes with Princess Anne&#39;s Warnings Against A &#39;Slimmed-down&#39; Monarchy",
        "description": "King Charles III&#39;s decision to potentially streamline the Royal Family has sparked discussions and differing opinions among royal insiders, including his sister, Princess Anne. Despite her warnings against a &quot;slimmed-down&quot; monarchy,"
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/prince-george-cutest-moments-growing-up/",
        "title": "32 of <b>Prince</b> George&#39;s cutest moments growing up, from his first day of school to royal family weddings",
        "description": "We&#39;ve delved into the royal archives to find some of Prince George&#39;s cutest moments growing up. Within hours of his birth, Prince William and Kate Middleton&#39;s firstborn was being introduced to the world - and, ever since, we have been given frequent insights into the adorable youngster&#39;s childhood."
    },
    {
        "url": "https://e.vnexpress.net/news/vogue/meghan-markle-wears-6250-coat-out-for-lunch-4714665.html",
        "title": "Meghan Markle wears $6,250 coat out for lunch",
        "description": "The Duchess of Sussex Meghan Markle drew attention at the celebrity hotspot restaurant Cipriani Beverly Hills wearing a cashmere coat worth $6,250 in sunny weather on Thursday."
    },
    {
        "url": "https://nypost.com/2024/02/24/entertainment/king-charles-may-send-royal-familys-secret-weapon-to-sort-out-harry-meghan-expert/",
        "title": "King Charles may send royal family’s ‘secret weapon’ to ‘sort out’ <b>Harry</b>, Meghan: expert",
        "description": "King Charles could recruit his “no-nonsense” sister Princess Anne to “sort out” Prince Harry and Meghan Markle, one royal expert has asserted. The monarch, 75, is currently battling an undisclosed form of cancer amid estrangement from the Duke and Duchess of Sussex ,who are living in Montecito, Calif."
    },
    {
        "url": "https://www.btimesonline.com/articles/164277/20240224/queen-camillas-fury-unleashed-on-prince-harry-in-royal-family-showdown-over-kings-illness.htm",
        "title": "&#39;Dangerous&#39; Queen Camilla&#39;s Fury Unleashed on <b>Prince Harry</b> in Royal Family Showdown Over King&#39;s Illness",
        "description": "Tensions within the British royal family reached a new zenith amidst reports of a confrontation between Queen Camilla and Prince Harry during a highly charged visit to the ailing King Charles III. The incident,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13047431/Cousin-Prince-Harrys-best-friend-henry-pelly-wins-public-footpath-battle.html",
        "title": "Millionaire with links to <b>Prince Harry</b> wins battle against villagers over 100-year footpath through his £1.2m Wiltshire estate",
        "description": "Henry Pelly blocked off a footpath running through his £1.25million mansion with barbed wire to stop ramblers from going through the garden next to his home."
    },
    {
        "url": "https://www.samaa.tv/2087310295-meghan-markle-s-hopes-for-uk-return-dashed-by-royal-opposition",
        "title": "Meghan Markle&#39;s hopes for UK return dashed by royal opposition",
        "description": "Meghan Markle, the Duchess of Sussex, may have faced a setback in her plans for a return to the United Kingdom alongside her husband, <b>Prince Harry</b>, as reports suggest that the royal family has blocked any such move. Speculation arose after Meghan Markle ..."
    },
    {
        "url": "https://www.newsweek.com/meghan-markle-scandal-tv-fashion-expert-1871584",
        "title": "Meghan Markle&#39;s Scandalous Style",
        "description": "Meghan&#39;s personal style is closely aligned to someone she once identified as the &quot;fiercest female character on TV.&quot;"
    },
    {
        "url": "https://www.ohmymag.co.uk/entertainment/royal-family/who-is-the-duchess-of-gloucester-the-royal-queen-camilla-has-been-relying-on-during-official-engagements_art21277.html",
        "title": "Who is the Duchess of Gloucester? The Royal Queen Camilla has been relying on during official engagements",
        "description": "<b>Prince</b> Richard and Brigitte also accompanied King Charles and Queen Camilla to church at St. Mary Magdalene at Sandringham on New Year’s Eve."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/guy-fieri-just-revealed-details-150000505.html",
        "title": "Guy Fieri Just Revealed Details About His Son Hunter&#39;s &#39;Star-Studded&#39; Wedding",
        "description": "Guy Fieri opened up about his son&#39;s upcoming wedding and the star-studded guest list, that we can only assume will include fellow Food Network personalities."
    },
    {
        "url": "https://uk.news.yahoo.com/sharon-osbourne-underwent-8-months-070000163.html",
        "title": "Sharon Osbourne underwent 8 months of therapy after Duchess Meghan row",
        "description": "Sharon Osbourne spent several months in therapy after an explosive row defending Piers Morgan over issues of race regarding Meghan, Duchess of Sussex."
    },
    {
        "url": "https://www.cheatsheet.com/entertainment/prince-harry-archie-lilibet-meghan-markle-every-single-day.html/",
        "title": "<b>Prince Harry</b> on What Archie and Lilibet Do for Him and Meghan Markle ‘Every Single Day’",
        "description": "Archie and Lili now have the surname of Sussex, reflecting <b>Prince Harry</b> and Meghan Markle’s royal titles Sussex is now a family name for <b>Harry</b>, Meghan, and their kids. The parents of two quietly changed Archie and Lili’s last names from Mountbatten ..."
    },
    {
        "url": "https://www.thenews.com.pk/latest/1161171-prince-harry-given-multi-million-dollar-advice-for-free",
        "title": "<b>Prince Harry</b> given multi-million dollar advice for free",
        "description": "<b>Prince Harry</b> can&#39;t be welcomed back to the royal family by King Charles <b>Prince Harry</b>, who appeared extending olive branch to his royal relatives amid their health crisis, has been advised to show his willingness to return to the royal family with his ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/harry-left-out-kings-contingency-32205310",
        "title": "<b>Harry</b> &#39;left out&#39; of King&#39;s contingency plans as talk of his return to Firm is branded &#39;laughable&#39;",
        "description": "<b>Prince Harry</b> has reportedly been &quot;left out&quot; of King Charles&#39; contingency plans which mention no trace of the estranged <b>prince</b>, according to an insider. It was reported last week that a source close to the duke said <b>Harry</b> &quot;would try&quot; to help the monarchy out if his father, King Charles asked him to."
    },
    {
        "url": "https://thelinkpaper.ca/prince-harry-and-wife-meghan-visit-vancouver/",
        "title": "<b>Prince Harry</b> and wife Meghan visit Vancouver",
        "description": "<b>Prince Harry</b> and his wife, Meghan, the Duchess of Sussex, were in Vancouver last week to meet with Invictus Games athletes at a local curling rink, one year ahead of the competition. BC is hosting the Invictus Games 2025 in Whistler. Founded in 2014 by ..."
    },
    {
        "url": "https://www.womanandhome.com/life/royal-news/royal-family-traditions/",
        "title": "32 royal family traditions you may not have known about",
        "description": "Reportedly, Meghan Markle once got Queen Elizabeth II a singing toy hamster for the festive season, while Kate Middleton is famously said to have purchased a ‘Grow Your Own Girlfriend’ kit for her brother-in-law, <b>Prince Harry</b>. Ouch! A Royal Christmas ..."
    },
    {
        "url": "https://au.lifestyle.yahoo.com/why-prince-harry-reportedly-asked-192844283.html",
        "title": "Why <b>Prince Harry</b> Was Reportedly Asked to Leave Clarence House After Flying In to See King Charles",
        "description": "<b>Prince Harry</b> immediately flew to the U.K. in the aftermath of his father King Charles&#39; cancer diagnosis. But apparently, not everyone was pleased with his recent U.K. visit. Queen Camilla reportedly asked <b>Harry</b> to leave Clarence House after just 30 minutes."
    },
    {
        "url": "https://uk.style.yahoo.com/32-times-royal-children-struggled-220059654.html",
        "title": "32 times the royal children struggled to behave at official events, from the Queen&#39;s Jubilee to the King&#39;s Coronation",
        "description": "Because while all of the little royals have had their moments over the years, a young <b>Prince Harry</b> and <b>Prince</b> Louis stand out for their unpredictable reactions when faced with a camera. Be prepared to smile... It seemed to be a little too noisy for <b>Prince</b> ..."
    },
    {
        "url": "https://www.cp24.com/news/prince-harry-meghan-in-whistler-for-a-second-day-for-2025-invictus-games-training-1.6769864?cache=yes%2Ffive-lessons-from-someone-who-bought-nothing-for-a-year",
        "title": "<b>Prince Harry</b>, Meghan in Whistler for a second day for 2025 Invictus Games training",
        "description": "<b>Prince Harry</b> and his wife Meghan, the Duchess of Sussex, are back in Whistler, B.C., this morning at the Invictus Games training camp. The Games will be the first to feature alpine skiing, nordic skiing, skeleton and wheelchair curling, but it will also ..."
    },
    {
        "url": "https://www.marca.com/en/lifestyle/uk-news/2024/02/24/65da165446163fe6258b4598.html",
        "title": "Kate Middleton frustrated after surgery and could bring forward her return to work",
        "description": "Amid Prince Harry&#39;s alleged plans to support King Charles and the monarchy, Kate Middleton is reportedly gearing up to resume her royal duties following her recent abdominal surger"
    },
    {
        "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/royals/prince-harry-and-meghan-steal-the-spotlight-at-invictus-games-gala/",
        "title": "<b>Prince Harry</b> and Meghan steal the spotlight at Invictus Games gala",
        "description": "In a dazzling fusion of regal glamour and unwavering philanthropy, Meghan Markle and <b>Prince Harry</b> illuminated the Invictus Games One Year to Go Dinner in Vancouver on Friday night. WARNING!!!!! Here’s a cute, funny, charming, engaging and relatable ..."
    },
    {
        "url": "https://www.hindustantimes.com/world-news/us-news/prince-harry-s-memoir-isn-t-sworn-testimony-or-proof-that-he-took-drugs-says-biden-administration-lawyer-101708745999875.html",
        "title": "<b>Prince Harry</b>’s memoir ‘isn’t sworn testimony or proof’ that he took drugs, says Biden administration lawyer",
        "description": "Biden administration lawyer argues the book is not &#39;proof&#39; that Prince Harry took drugs and may be exaggerated for book sales."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066255/Tallest-buildings-history-revealed-interactive-graphic-Great-Pyramid-Giza-Dubais-gleeming-Burj-Khalifa.html",
        "title": "Incredible interactive graphic reveals tallest buildings throughout history from the Great Pyramid of Giza to Dubai&#39;s gleaming Burj Khalifa... but a building in LINCOLN ruled ...",
        "description": "Below, MailOnline has created an incredible interactive graphic which allows you to see the tallest buildings since the Great Pyramid was completed in 2570BC."
    },
    {
        "url": "https://ca.news.yahoo.com/king-charles-overwhelmed-public-support-220440420.html",
        "title": "King Charles pictured laughing as he reads card from well-wisher among 7,000 sent since cancer diagnosis",
        "description": "The King has been overwhelmed by messages of support from around 7,000 well-wishers worldwide since his cancer diagnosis, Buckingham Palace says."
    },
    {
        "url": "https://www.newsweek.com/prince-harry-us-politics-citizenship-1871635",
        "title": "How <b>Prince Harry</b> Could Go Into U.S. Politics",
        "description": "Prince Harry could have a path into U.S. politics—following in Arnold Schwarzenegger&#39;s footsteps—but the road would be bumpy."
    },
    {
        "url": "https://www.samaa.tv/2087310279-king-charles-iii-and-prince-william-forge-stronger-bond-amid-turbulent-times",
        "title": "King Charles III and <b>Prince</b> William forge stronger bond amid turbulent times",
        "description": "Speculation looms about Prince William&#39;s potential ascension to the throne should King Charles III pass away, with the Prince of Wales poised to become King William V, alongside his wife assuming the title of Queen Catherine and their son,"
    },
    {
        "url": "https://www.news18.com/world/us-govt-claims-prince-harry-may-have-lied-about-using-cocaine-weed-in-memoir-to-sell-books-8791170.html",
        "title": "US Govt Claims <b>Prince Harry</b> May Have Lied about Using Cocaine, Weed in Memoir to Sell Books",
        "description": "The US government argued in a federal court that Prince Harry’s admissions in his memoir that he took drugs are not &#39;proof&#39; that he actually did. They said it could have been a ploy to &#39;sell books&#39;."
    },
    {
        "url": "https://www.independent.com/2024/02/23/harry-meghan-and-barry/",
        "title": "Meghan, <b>Harry</b>, and Barry",
        "description": "Meghan and Harry have seven acres. (I googled it.) They could be cavorting around the property with Anastasia Romanov, the lost tribes of Israel and Jo-Jo the Dog-faced Boy, and I couldn’t see any of it from where I live."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/why-prince-harry-reportedly-asked-192844283.html",
        "title": "Why <b>Prince Harry</b> Was Reportedly Asked to Leave Clarence House After Flying In to See King Charles",
        "description": "<b>Prince Harry</b> immediately flew to the U.K. in the aftermath of his father King Charles&#39; cancer diagnosis. But apparently, not everyone was pleased with his recent U.K. visit. Queen Camilla reportedly asked <b>Harry</b> to leave Clarence House after just 30 minutes."
    }
]