[
    {
        "url": "https://www.radiotimes.com/tv/drama/beyond-paradise-humphrey-martha-fostering-newsupdate/",
        "title": "Beyond Paradise Christmas special teases exciting life change for Humphrey and Martha",
        "description": "For all of its whimsy and low-stakes action, Beyond Paradise&#39;s first season wasn&#39;t afraid to tackle some weighty issues, one of which was Martha and Humphrey&#39;s IVF journey. Sally Bretton&#39;s character suffered a miscarriage in the first episode following multiple attempts to get pregnant."
    },
    {
        "url": "https://inews.co.uk/culture/television/beyond-paradise-review-lazy-tv-2819833?ico=related_stories",
        "title": "Beyond Paradise review: Lazy TV – enough with the spin-offs",
        "description": "Kelby detained the 11-year-old thief identifying himself as “<b>Rishi Sunak</b>”. Needless to say, this unhappy lad was connected, in a roundabout way, to the mysterious break-ins. The redemptive storyline (a dying burglar attempting to make amends by ..."
    },
    {
        "url": "https://www.walesonline.co.uk/lifestyle/tv/watched-beyond-paradise-christmas-special-28336664",
        "title": "I watched the Beyond Paradise Christmas special and it should be available on prescription",
        "description": "I also love spin-off Beyond Paradise, arguably and perhaps somewhat controversially, a little more… Kris Marshall is iconic as DI Humphrey Goodman. His performance as the bumbling (but genius) detective has cemented itself in the history books,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/rishi-sunak-stop-dithering-ukraine-funding-2024/",
        "title": "<b>Rishi Sunak</b> urged to stop ‘dithering’ over Ukraine funding",
        "description": "<b>Rishi Sunak</b>’s Government must announce urgently how much military aid will be given to Ukraine next year, four former Tory defence secretaries have said. The Government pledged £2.3 billion in 2022 and again in 2023 but has still not announced how much ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67801167?at_ptr_name=facebook_page&at_format=link&at_campaign=Social_Flow&at_campaign_type=owned&at_link_type=web_link&at_medium=social&at_link_origin=BBC_Wales_News&at_bbc_team=editorial&at_link_id=5DED000E-A106-11EE-9EA4-092C8161DE7E",
        "title": "New £38,700 visa rule will be introduced in early 2025, says <b>Rishi Sunak</b>",
        "description": "Plans requiring people to earn £38,700 a year before bringing family to the UK will be introduced in early 2025, <b>Rishi Sunak</b> has said. The rise from the current £18,600 level was announced earlier this month and had been scheduled for the spring."
    },
    {
        "url": "https://www.fxempire.com/forecasts/article/gbp-usd-price-outlook-for-2024-navigating-uncertainty-and-opportunity-in-the-year-ahead-1398105",
        "title": "GBP/USD Price Outlook for 2024: Navigating Uncertainty and Opportunity in the Year Ahead",
        "description": "GBP/USD navigate through Brexit, central bank policies, and geopolitical tensions, ending with a cautious yet hopeful recovery."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/nhs-boss-warning-patients-over-31745165",
        "title": "NHS boss&#39; warning to patients over longest ever New Year junior doctors strike",
        "description": "Junior doctors are preparing to mount the longest strike in NHS history - but Richard Meddings, the chairman of the health service in England said he is &#39;fearful&#39; of the effects"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898273/michelle-mone-complains-pablo-escobar-treatment-accounts-frozen-national-crime-agency.html",
        "title": "Lingerie tycoon Michelle Mone says she has been treated like drug lord Pablo Escobar after the bank accounts were frozen by National Crime Agency amid PPE scandal",
        "description": "Baroness Michelle Mone has claimed that she is being treated like Colombian drug lord Pablo Escobar after her bank accounts were frozen amid the PPE scandal."
    },
    {
        "url": "https://news.sky.com/video/christmas-party-leaders-deliver-messages-of-hope-for-the-country-13037419",
        "title": "Christmas: Party leaders deliver messages of &#39;hope&#39; for the country",
        "description": "Christmas: Party leaders deliver messages of &#39;hope&#39; for the country Prime Minister <b>Rishi Sunak</b> said Christmas is a &quot;time of hope&quot; and urged people to keep the promise of a brighter future &quot;burning into the new year&quot; in his message to the country on Christmas Eve."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/manchester-united-confirm-sale-of-25-stake-to-british-billionaire-sir-jim-ratcliffe/",
        "title": "Manchester United confirm sale of 25% stake to British billionaire Sir Jim Ratcliffe",
        "description": "Manchester United has confirmed the sale of a 25% stake to the British billionaire petrochemicals tycoon Sir Jim Ratcliffe."
    },
    {
        "url": "https://inews.co.uk/news/politics/block-truss-resignation-honours-sunak-list-published-2823864?ico=related_article_inline",
        "title": "Block Truss’s resignation honours, <b>Sunak</b> urged ahead of list being published",
        "description": "The former Prime Minister&#39;s resignation honours list has been delayed for months but could be published this week"
    },
    {
        "url": "https://www.thetimes.co.uk/article/403f4038-b2a1-490f-9f8f-cb2c612861b1?shareToken=d8e47bcaadc3bc0c275df95da45e4988",
        "title": "Reform UK to challenge Tories in every seat at general election",
        "description": "The leader of Reform UK has privately given his senior team “cast-iron guarantees” that general election candidates will not be told to step aside for Tory opponents in a move that could split <b>Rishi Sunak</b>’s vote in key seats. Richard Tice has offered ..."
    },
    {
        "url": "https://www.thesun.co.uk/health/25057531/surgery-mistakes-nhs-never-events-scalding-wrong-organ/",
        "title": "The 12 most common NHS ‘never events’ revealed – from leaving drill bits INSIDE patients to removing the wrong organs",
        "description": "PATIENTS have had organs wrongly removed, drill bits left inside them and been scalded by hot water, official NHS data shows. Some 179 serious, preventable safety incidents occurred at hospitals"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/manchester-united-to-confirm-sale-of-25-stake-to-sir-jim-ratcliffe/",
        "title": "Manchester United to confirm sale of 25% stake to Sir Jim Ratcliffe",
        "description": "Manchester United Football Club will on Sunday confirm the sale of a 25% stake to the billionaire petrochemicals tycoon Sir Jim Ratcliffe."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/james-cleverly-rishi-sunak-yvette-cooper-home-secretary-prime-minister-b1128944.html",
        "title": "Cleverly’s date rape ‘joke’ the latest time he has talked his way into trouble",
        "description": "James Cleverly has found himself in hot water over unguarded comments for the third time in just six weeks as Home Secretary. He faced calls to resign after an “ironic joke” at a No 10 reception about using a date rape drug on his wife was made public by the Sunday Mirror."
    },
    {
        "url": "https://news.sky.com/story/adam-boulton-things-may-be-bad-but-there-are-reasons-to-be-cheerful-in-2024-13036452?dcmp=snt-sf-twitter",
        "title": "Adam Boulton: Things may be bad, but there are reasons to be cheerful in 2024",
        "description": "Despite challenges and suffering, optimism remains an essential element of the human spirit. There are some reasons to be cheerful at the end of this year and as we head into the next."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/richard-holden-conservative-chairman-party-inward-looking/",
        "title": "Tory chairman says party has been too ‘inward looking’ amid migration rows",
        "description": "Richard Holden insists Conservatives are now ‘election ready’ as Labour says it is braced for Rishi Sunak to go to the polls in May"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/james-cleverlys-gaffe-filled-42-31744253",
        "title": "James Cleverly&#39;s gaffe-filled 42 days as Home Secretary - Commons swearing to sick joke",
        "description": "Home Secretary James Cleverly - who is facing calls to resign after he joked about giving his wife a date-rape joke - has been branded &#39;Colonel Calamity&#39; by Tory MPs"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/24/rwanda-bill-will-get-the-job-done-and-stop-small-boat-crossings-says-david-cameron?ref=upstract.com",
        "title": "Rwanda bill will ‘get the job done’ and stop small boat crossings, says David Cameron",
        "description": "In comments aimed at rebellious Tory backbenchers unhappy with <b>Rishi Sunak</b>’s Rwanda legislation, Lord Cameron, the foreign secretary, said it was the “best bill to get the job done”. The former Conservative leader, who was brought back into ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848861/Rishi-Sunak-nuclear-ambition-net-zero?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "<b>Rishi Sunak</b> plans to scale back UK’s nuclear ambitions in latest Net Zero climbdown",
        "description": "<b>Rishi Sunak</b> is set to cut the UK’s ambitious 2050 nuclear target in the latest Net Zero climb down. Under Boris Johnson, the Government pledged that by the middle of the century, the UK would have 24 gigawatts of capacity. However uncertainty around the ..."
    },
    {
        "url": "https://www.itv.com/watch/news/rishi-sunak-on-promise-of-brighter-future-in-christmas-message-before-election-year/g99srkc",
        "title": "<b>Rishi Sunak</b> on &#39;promise of brighter future&#39; in Christmas message before election year",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-reform-general-election-b2469037.html",
        "title": "Nigel Farage’s Reform UK vows to fight the Tories in every seat at next year’s general election",
        "description": "The party, which contested the 2019 general election as the Brexit Party, has given ‘cast-iron guarantees’ to top figures that it will not do a deal with the Tories"
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24010706.bbc-documentary-discuss-queen-elizabeths-final-days/",
        "title": "BBC documentary to discuss Queen Elizabeth&#39;s final days",
        "description": "The Coronation Year is a new BBC documentary about Charles&#39; first year as King and it touches on Queen Elizabeth II&#39;s final days."
    },
    {
        "url": "https://uk.news.yahoo.com/christmas-offers-promise-better-world-135658728.html",
        "title": "‘Christmas offers the promise of a better world’: <b>Rishi Sunak</b> shares festive message with nation",
        "description": "<b>Rishi Sunak</b> has delivered his Christmas message to the nation for 2023, acknowledging that this year will be difficult for many, but offering thanks to the NHS, police, and &quot;amazing&quot; armed forces who will be working. “Christmas is a time of peace ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-inflation-hits-lowest-level-082906730.html",
        "title": "UK inflation hits lowest level in more than two years",
        "description": "The news handed a further boost to embattled Conservative Prime Minister <b>Rishi Sunak</b> after inflation had already achieved his goal of falling below five percent in October. Finance minister Jeremy Hunt welcomed the news but conceded that Britons were still ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848861/Rishi-Sunak-nuclear-ambition-net-zero",
        "title": "<b>Rishi Sunak</b> plans to scale back UK’s nuclear ambitions in latest Net Zero climbdown",
        "description": "The Prime Minister is reportedly set to cut the UK&#39;s 2050 nuclear target in a blow to environmental ambitions."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/this-should-be-career-ending-james-cleverly-under-fire-over-joke-about-drink-spiking-120612100.html",
        "title": "&#39;This should be career ending&#39;: James Cleverly under fire over joke about drink spiking",
        "description": "Home secretary James Cleverly is facing calls to resign after joking about drugging his wife, hours after unveiling new measures to prevent spiking."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-hit-fresh-general-31743948",
        "title": "<b>Rishi Sunak</b> hit by fresh general election blow as major change confirmed for next year",
        "description": "The Conservatives will find it harder to cling on to seats at the next election as Nigel Farage&#39;s old party Reform UK vows to stand against its MPs for the first time"
    },
    {
        "url": "https://www.gazette-news.co.uk/news/23996634.essex-pylons-project-moving-closer-going-offshore-mp-says/",
        "title": "Essex pylons project moving closer to going offshore, MP says",
        "description": "Harwich and North Essex MP Sir Bernard Jenkin has said he believes the battle against an onshore pylon project to be &#39;90 per cent won&#39;"
    },
    {
        "url": "https://uk.news.yahoo.com/uks-cleverly-apologises-joke-spiking-112841744.html",
        "title": "UK&#39;s Cleverly apologises for joke about spiking wife&#39;s drink",
        "description": "British interior minister James Cleverly apologised on Sunday after he was reported to have joked about spiking his wife&#39;s drink with a sedative known for its use as a date-rape drug. The Sunday Mirror tabloid reported that Cleverly,"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67813689?at_ptr_name=facebook_page&at_link_type=web_link&at_format=link&at_bbc_team=editorial&at_medium=social&at_link_origin=BBC_News&at_link_id=BE2E24C0-A246-11EE-ADC4-1EC2D9B5F045&at_campaign_type=owned&at_campaign=Social_Flow",
        "title": "Home Secretary James Cleverly apologises for &#39;ironic joke&#39; about spiking wife&#39;s drink",
        "description": "Home Secretary James Cleverly has apologised for making an &quot;ironic joke&quot; about spiking his wife&#39;s drink at a Downing Street reception. He reportedly said the ideal spouse was &quot;someone who is always mildly sedated so she can never realise there are better men out there&quot;."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/24/reform-uk-leader-gives-guarantee-that-it-wont-step-aside-for-tories-at-election",
        "title": "Reform UK leader gives ‘guarantee’ that it won’t step aside for Tories at election",
        "description": "Richard Tice assures senior members of his party in writing that he will not revive Brexit party’s 2019 deal with Conservatives"
    },
    {
        "url": "https://news.sky.com/video/prime-minister-rishi-sunak-and-other-political-leaders-from-around-the-uk-issue-festive-christmas-messages-to-the-country-13037302",
        "title": "Prime minister <b>Rishi Sunak</b> and other political leaders from around the UK issue festive Christmas messages to the country",
        "description": "Prime minister <b>Rishi Sunak</b> and other political leaders from around the UK issue festive Christmas messages to the country Prime Minister went on pay tribute to the those in the NHS, police forces and armed forces and said looking ahead &quot;let&#39;s keep that promise of a brighter future burning into the New Year.&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898153/rishi-sunak-christmas-message-no-10-kier-starmer-ed-davey.html",
        "title": "<b>Rishi Sunak</b> urges the nation to focus on &#39;the promise of a brighter future&#39; in Christmas message from No 10 - as Labour leader Kier Starmer and Lib Dem&#39;s Ed Davey also issue ...",
        "description": "The Prime Minister said Christmas was &#39;a time of hope&#39; but it was important to remember &#39;those facing a difficult time&#39;. He also highlighted the &#39;Christian values at the heart of this celebration."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898131/Rishi-Sunak-control-abuse-spousal-visas-warns-former-minister-amid-fears-lax-rules-allowing-young-women-India-Pakistan-exploited-arranged-marriages.html",
        "title": "<b>Rishi Sunak</b> must control &#39;abuse&#39; of spousal visas, warns former minister - amid fears lax rules are allowing young women from India and Pakistan to be exploited for arranged ...",
        "description": "Former home office minister Sarah Dines has claimed lax rules are allowing young women from India and Pakistan to be exploited for arranged marriages."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24004926.nhs-dire-straits-snp-hasnt-courage-face/?ref=socialflow",
        "title": "NHS is in dire straits, but SNP hasn&#39;t the courage to face it",
        "description": "WITH the ramifications of the Scottish budget dominating media headlines, the deficiencies of the NHS in Scotland have receded into the"
    },
    {
        "url": "https://www.politicshome.com/news/article/mps-christmas-christmas-wishlist-general-election-peace",
        "title": "All MPs Want For Christmas Is... Trainers, A Nap, And a General Election",
        "description": "As Westminster quietened down for the Christmas period, PoliticsHome asked MPs across the political divide what was on their wishlist from Santa."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lord-cameron-iran-middle-east-israel-b2469029.html",
        "title": "Lord Cameron warns of Iran’s ‘malign influence’ and global threat",
        "description": "The former prime minister described Hamas, the Houthis and Hezbollah as ‘proxies’ for Iran and said they are contributing to an ‘extremely high’ level of ‘danger and insecurity’ around the world"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nhs-keir-starmer-prime-minister-humza-yousaf-charity-b1128898.html",
        "title": "Christmas offers the ‘promise of a better world’, <b>Sunak</b> says",
        "description": "“For Christians the world over, this is a time to rejoice in the birth of Jesus Christ – God’s son. “The birth of Jesus Christ brings light into our world and reminds us that in times of darkness and despair, hope, love and peace are always worth advocating for."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848802/Rishi-Sunak-migrant-crackdown-delay-OBR",
        "title": "<b>Rishi Sunak</b> delayed migration crackdown fearing it would hurt the economy",
        "description": "Rishi Sunak reportedly delayed a major crackdown of Britain’s record high immigration numbers, due to fears it would hurt the economy. Mr Sunak began considering a major reduction in the current influx as far back as the autumn, however plans failed to emerge until the beginning of December."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/james-cleverly-accused-of-making-vile-joke-about-date-rape-drug_uk_6587668ee4b0fe4ffe33987e",
        "title": "James Cleverly Accused Of Making &#39;Vile&#39; Joke About Date Rape Drug",
        "description": "That there experiences are just bantz.” Cleverly was appointed home secretary in November after <b>Rishi Sunak</b> sacked Suella Braverman. He has not denied calling the prime minster’s Rwanda deportation scheme “batshit” but did reject accusations he ..."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/arts-and-culture/film-and-tv/charles-iii-the-coronation-year-princess-anne-reveals-queens-final-thoughts-in-documentary-4457470",
        "title": "Charles III: The Coronation Year: Princess Anne reveals Queen’s final thoughts in documentary",
        "description": "Queen Elizabeth II felt it would be “difficult” if she died at Balmoral but was persuaded to step back from the “decision making process,” the Princess Royal has told a documentary."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/sunak-starmer-christian-values-christmas-message/",
        "title": "<b>Rishi Sunak</b> and Keir Starmer preach Christian values in festive messages",
        "description": "The message from the Prime Minister, a Hindu who said his faith guides him in every aspect of his life, will be released on Christmas Eve"
    },
    {
        "url": "https://www.thetimes.co.uk/article/1be8a373-d362-407e-a08c-1e89fa3dcad5?shareToken=4871e6948385e7cbac5f73d202250274",
        "title": "Jeremy Hunt’s emissions levy faces dirty tricks",
        "description": "Or that the levy bumps up the price of goods, causing inflation — a risk that <b>Rishi Sunak</b> is previously thought to have fretted over. Or that the tax is seen as a form of protectionism, triggering a tit-for-tat trade war — China imposing higher duties ..."
    },
    {
        "url": "https://www.theguardian.com/culture/2023/dec/24/from-barbie-to-cameron-the-most-memorable-comebacks-of-2023",
        "title": "From Barbie to Cameron: the most memorable comebacks of 2023",
        "description": "Observer writers choose the outstanding returns of the year in the worlds of politics, fashion, sport and film"
    },
    {
        "url": "https://news.sky.com/story/christmas-offers-promise-of-a-brighter-future-rishi-sunak-says-as-party-leaders-deliver-messages-13036862?dcmp=snt-sf-twitter",
        "title": "Christmas offers &#39;promise of a brighter future&#39;, <b>Rishi Sunak</b> says - as party leaders deliver messages",
        "description": "Labour leader Sir Keir Starmer used his festive message to say the story of Jesus was a reminder that &quot;in times of darkness and despair, hope, love and peace are always worth advocating for&quot;."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/chatgpt-ai-safety-summit-ai-000100875.html",
        "title": "From ChatGPT to the AI Safety Summit: The year in AI",
        "description": "In 12 months, conversations around AI have gone from concerns over how it could be exploited by schoolchildren to do their homework for them, to Prime Minister <b>Rishi Sunak</b> hosting the first AI safety summit of nations and technology companies to discuss ..."
    },
    {
        "url": "https://www.thepinknews.com/2023/12/24/lgbtq-protests-allies-solidarity-2023/",
        "title": "Six times the LGBTQ+ community and their allies fought together for a better future in 2023",
        "description": "Across the pond in the UK, the LGBTQ+ community also faced an onslaught of anti-trans hate from prime minister <b>Rishi Sunak</b> and his Conservative Party, leaving queer folk concerned over the state of transgender rights in the UK. When hate surfaced ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24010356.nhs-england-boss-fearful-patients-junior-doctor-strikes/",
        "title": "NHS England boss ‘fearful’ for patients during junior doctor strikes",
        "description": "Prime Minister <b>Rishi Sunak</b> branded the action “disappointing” and urged junior doctors to call off strikes. The next strike will begin at 7am on January 3 and end at 7am on January 9. It will be the longest strike in the 75-year history of the NHS."
    },
    {
        "url": "https://www.heraldscotland.com/politics/23112431.rishi-sunak-nicola-sturgeon-meet-tomorrow/?ref=habersitesi.org",
        "title": "<b>Rishi Sunak</b> and Nicola Sturgeon to meet tomorrow",
        "description": "It will be the first time the two have met since the new Prime Minister took over from Liz Truss just three weeks ago. Mr <b>Sunak</b> revealed the meeting as he and Ian Blackford clashed over Alister Jack&#39;s position during an exchange at Prime Minister’s ..."
    }
]