[
    {
        "url": "https://www.lep.co.uk/news/traffic-and-travel/lancashire-set-to-get-share-of-more-than-ps2bn-of-reallocated-hs2-money-to-improve-transport-links-4531773",
        "title": "Lancashire set to get share of more than £2bn of reallocated HS2 money to improve transport links",
        "description": "On Monday, the Prime Minister Rishi Sunak is expected to reveal how more than £2bn of reallocated HS2 funding will go to local authorities in the North, including across Lancashire, to spend on local transport improvements."
    },
    {
        "url": "https://uk.news.yahoo.com/tyranny-never-triumph-says-uks-230748188.html",
        "title": "&#39;Tyranny will never triumph&#39;, says UK&#39;s <b>Sunak</b> over Ukraine war",
        "description": "UK Prime Minister Rishi Sunak renewed his pledge of support for Ukraine on the second anniversary of Russia&#39;s invasion, insisting in a statement Friday that &quot;tyranny will never triumph&quot;.&quot;This is the moment to show that tyranny will never triumph and to say once again that we will stand with Ukraine today and tomorrow,"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-faces-call-kick-32200665",
        "title": "<b>Rishi Sunak</b> faces call to kick Liz Truss out of Tory Party for &#39;damaging&#39; conspiracy rants",
        "description": "Labour has written to Rishi Sunak calling on him to punish Liz Truss after she blamed a &#39;deep state&#39; for her failure and failed to challenge claims Tommy Robinson is a &#39;hero&#39;"
    },
    {
        "url": "https://www.thetimes.co.uk/article/peer-pollster-rumblings-plan-oust-rishi-sunak-7rcvbgbmf",
        "title": "The peer, the pollster and the rumblings of a plan to oust <b>Rishi Sunak</b>",
        "description": "Rumoured rebels including Lord Frost and Will Dry, a former adviser to the PM, have been spotted around Golden Cross House near Trafalgar Square"
    },
    {
        "url": "https://www.ft.com/content/ec279514-bc03-455a-9b39-4634afa3197a",
        "title": "<b>Rishi Sunak</b> urged to discipline Lee Anderson over Islamist claims",
        "description": "Rishi Sunak was urged on Friday to remove the Conservative whip from senior MP Lee Anderson, after he claimed that Islamists had “got control” of London and the capital’s Labour mayor Sadiq Khan."
    },
    {
        "url": "https://news.sky.com/story/calls-for-lee-anderson-to-be-kicked-out-of-conservatives-over-divisive-and-dangerous-comments-13079525",
        "title": "Calls for Lee Anderson to be kicked out of Conservatives over &#39;divisive and dangerous&#39; comments",
        "description": "Politicians from across the political spectrum have criticised the MP following remarks he made about London mayor Sadiq Khan."
    },
    {
        "url": "https://www.bbc.com/news/uk-68388542",
        "title": "Ukraine war: UK reaffirms Ukraine support on war anniversary",
        "description": "Political leaders in the UK have reaffirmed their support for Ukraine ahead of the second anniversary of Russia&#39;s full-scale invasion. Prime Minister Rishi Sunak said Britain was prepared to do &quot;whatever it takes, for as long as it takes&quot; to help Ukraine achieve victory."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-ashworth-liz-truss-rishi-sunak-labour-steve-bannon-b1141263.html",
        "title": "Labour demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth condemned remarks made by the pair as ‘egregious’."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-vows-full-support-223103854.html",
        "title": "<b>Rishi Sunak</b> vows full support for Ukraine ‘until they prevail’ as war enters third year",
        "description": "UK political leaders are marking the second anniversary of the war in Ukraine by vowing to stand with Kyiv “until they prevail”. Prime Minister Rishi Sunak said “tyranny will never triumph” as President Volodymyr Zelensky ’s troops defend the country against an emboldened Russia."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/ukraine-rishi-sunak-keir-starmer-kyiv-prime-minister-b1141262.html",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "Prime Minister Rishi Sunak said Britain was prepared to do ‘whatever it takes, for as long as it takes’ to help the country."
    },
    {
        "url": "https://www.thetimes.co.uk/article/who-could-will-replace-rishi-sunak-tory-leader-candidates-conservatives-v88xlwt6m",
        "title": "Who could replace <b>Rishi Sunak</b>? These are the agents of change",
        "description": "Potential Conservative Party leadership candidates are on manoeuvres, hosting drinks and plotting war on spreadsheets and social media while giving Sunak their ‘full support’"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/sport/uk-sport-news/luke-littler-gives-blunt-response-28696165",
        "title": "Luke Littler gives blunt response after Prime Minister <b>Rishi Sunak</b> request",
        "description": "But it&#39;s not just sports stars who want to rub shoulders with him. Politicians too have noticed his meteoric rise to fame, including Prime Minister, <b>Rishi Sunak</b>. No wonder then, that 17-year-old Littler has hired a publicist to help manage his dizzying life."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/king-chuckles-card-revealing-supportive-messages-made-cry-20338646/?ico=trending-post-strip_item_3",
        "title": "King chuckles at cheeky card after revealing get well soon messages made him cry",
        "description": "One card, like many sent to the King, was hand-drawn, with the words ‘get well soon’ written beneath a picture of a crown, complete with rubies and emeralds, and with a rainbow on the back. Where the public have included an address they will receive a response of thanks for their cards or letters."
    },
    {
        "url": "https://www.thisiswiltshire.co.uk/news/national/24140534.former-post-office-boss-paula-vennells-forfeits-cbe-role-horizon-scandal/",
        "title": "Former Post Office boss Paula Vennells forfeits CBE for role in Horizon scandal",
        "description": "Former Post Office boss Paula Vennells has forfeited her CBE for “bringing the honours system into disrepute” following her handling of the Horizon crisis. Ms Vennells was named on Friday in a list published on the Cabinet Office website as an individual whose honour had been revoked by the King."
    },
    {
        "url": "https://www.itv.com/news/2024-02-23/palace-releases-video-of-king-receiving-over-7000-messages-from-well-wishers",
        "title": "Palace releases video of King receiving over 7,000 messages from well-wishers after cancer diagnosis",
        "description": "The King was left tickled pink by messages from well-wishers, pictures released by Buckingham Palace have shown. Charles has been pictured looking through some of the 7,000 messages of support Buckingham Palace’s correspondence team has received from around the world since his cancer diagnosis."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24140857.sunak-backs-farmers-protesting-welsh-government-reform/",
        "title": "<b>Sunak</b> backs farmers protesting against Welsh Government reform",
        "description": "RISHI Sunak has offered his support to protesting farmers in Wales. Farmers across Wales have objected to the Welsh Labour government’s proposals to change farming subsidies to require more land to be set aside for environmental schemes."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870149/labour-countryside-wales-rishi-sunak",
        "title": "Labour&#39;s &#39;war on countryside&#39;: Welsh farmers beg <b>Rishi Sunak</b> for help in major protest",
        "description": "Rishi Sunak was met with applause as he described Labour’s plans as “absolutely not right”. Farmers lined their tractors at the Welsh Conservative Party conference in protest of the scheme, which will require farmers to give over some of their land to trees and wildlife to receive subsidies."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/moment-rishi-sunak-addresses-welsh-28690375",
        "title": "The moment <b>Rishi Sunak</b> addresses Welsh farmers gathered outside his conference",
        "description": "Rishi Sunak addressed farmers protesting against Welsh Government farm subsidy changes as he attended the Welsh Conservative Party conference in Llandudno. With tractors lining the seafront, the Prime Minister was greeted with a round of applause as he left via the front entrance to speak to protesting farmers who had gathered outside."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hdmmwq",
        "title": "Prime Minister <b>Rishi Sunak</b> speaks to Radio Wales Breakfast",
        "description": "Rishi Sunak speaks to Oliver Hides ahead of the Welsh Conservatives Spring conference"
    },
    {
        "url": "https://www.bournemouthecho.co.uk/news/national/24141534.king-amused-well-wishers-card-showing-disgruntled-cone-wearing-dog/",
        "title": "King amused by well-wisher’s card showing disgruntled cone-wearing dog",
        "description": "Since his cancer diagnosis Charles has postponed all public-facing duties, but is continuing with behind-the-scenes work on his state papers."
    },
    {
        "url": "https://www.ok.co.uk/royal/king-charles-giggles-reacts-well-32200649",
        "title": "King Charles giggles as he reacts to well-wishers&#39; cards following cancer diagnosis",
        "description": "King Charles has been pictured looking through some of the 7,000 messages of support he has received from around the world since his cancer diagnosis earlier this month"
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-child-activity-workers-legally-obliged-report-child-sexual-abuse-1723604",
        "title": "UK Child Activity Workers To Be &#39;Legally Obliged&#39; To Report Child Sexual Abuse",
        "description": "UK&#39;s sex offense laws are going to be strengthened with stricter child sexual abuse law which makes it a punishable offence to hide any child sexual exploitation leading to prison term."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/king-chuckles-card-revealing-supportive-messages-made-cry-20338646/?ico=metro-posts_article_whats-trending-now",
        "title": "King chuckles at cheeky card after revealing get well soon messages made him cry",
        "description": "Charles looked at the messages, sent in his daily red box of paperwork, on Wednesday and during that day carried out his first face-to-face official duties – an audience with Prime Minister <b>Rishi Sunak</b> and a Privy Council meeting – since his condition ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/gogglebox-viewers-rip-couple-expose-political-views-20338710/?ico=trending-post-strip_item_2",
        "title": "Gogglebox viewers rip into fan favourite couple as they expose political views",
        "description": "‘Or have died,’ he brother Pete quipped. After being informed of the massive swing against the Tories, some of the critics took aim at Prime Minister <b>Rishi Sunak</b> when he was shown. But then Giles and Mary started reflecting on the 1997 election."
    },
    {
        "url": "https://news.sky.com/story/amp/leading-critic-of-welsh-farming-proposals-gareth-wyn-jones-receives-death-threats-13079245",
        "title": "Leading critic of Welsh farming proposals Gareth Wyn Jones &#39;receives death threats&#39;",
        "description": "I have to think about my family.&quot; Mr Wyn Jones, from Conwy, was among the farmers who met with Prime Minister <b>Rishi Sunak</b> outside the Welsh Conservative Conference in Llandudno on Friday to voice their concerns about the plans. Image: <b>Rishi Sunak</b> speaking ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/ukraine-rishi-sunak-kyiv-prime-minister-vladimir-b2501696.html",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "Prime Minister <b>Rishi Sunak</b> said “tyranny will never triumph” as President Volodymyr Zelensky’s troops defend the country against an emboldened Russia. Mr <b>Sunak</b> said the UK is “going further in our support”, and Britain is prepared to do ..."
    }
]