[
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/10/what-the-papers-say--january-10/",
        "title": "What the papers say – January 10",
        "description": "The Daily Mail echoes calls from campaigners for Ms Vennells to return £3 million in bonuses and pension. The Daily Telegraph says the man who created the faulty software in the Horizon Post Office scandal has “demanded immunity” before he agrees to appear at the public inquiry."
    },
    {
        "url": "https://www.thetimes.co.uk/article/tory-rebels-set-for-battle-over-rwanda-bill-6j3pdttrs",
        "title": "Tory rebels set for battle over Rwanda bill",
        "description": "<b>Rishi Sunak</b> faces a fresh headache over his Rwanda policy when Conservative rebels table a series of amendments on Wednesday to prevent European judges and human rights laws blocking deportation flights. More than 30 right-wing MPs have already backed the ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/10/tory-mps-seek-to-toughen-rwanda-bill-as-sunak-faces-commons-showdown/",
        "title": "Tory MPs seek to ‘toughen’ Rwanda Bill as <b>Sunak</b> faces Commons showdown",
        "description": "Rishi Sunak faces a showdown with MPs over his Rwanda Bill when it returns to the Commons next week, with around 30 MPs prepared to back amendments aimed at toughening up the legislation. Commons Leader Penny Mordaunt on Tuesday announced the Safety of Rwanda (Asylum and Immigration) Bill’s committee stage will take place on January 16 and 17."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/ministers-under-pressure-to-move-swiftly-to-address-horizon-post-office-scandal-107667/",
        "title": "Ministers under pressure to move swiftly to address Horizon Post Office scandal",
        "description": "Mr Chalk promised “further announcements shortly”, with <b>Rishi Sunak</b> likely to face questions about the Government’s response to the situation when he appears in the Commons for the first prime minister’s questions of the year. A public inquiry into ..."
    },
    {
        "url": "https://www.theguardian.com/society/2024/jan/09/rishi-sunaks-subpar-solution-to-nhs-waiting-lists",
        "title": "<b>Rishi Sunak</b>’s subpar solution to NHS waiting lists",
        "description": "<b>Sunak</b>’s elimination plan | Dmitry Rybolovlev’s riches | Dog-free Wetherspoon’s | The price of good news | Blood scandal series Good to see that <b>Rishi Sunak</b> is dealing with NHS waiting lists in the traditional Tory manner. “Although we’ve ..."
    },
    {
        "url": "https://www.burnleyexpress.net/business/prime-minister-rishi-sunak-full-of-praise-for-burnley-and-veka-during-third-visit-to-the-town-4471861",
        "title": "Prime Minister <b>Rishi Sunak</b> full of praise for Burnley and VEKA during third visit to the town",
        "description": "Prime Minister Rishi Sunak talked about Burnley’s ‘huge potential’ while visiting the town for a third time in nine months."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-wife-gives-up-31840420",
        "title": "<b>Rishi Sunak</b>&#39;s wife gives up childcare shares after PM conflict of interest row",
        "description": "<b>Rishi Sunak</b>&#39;s wife has given up her shares in a childcare firm that was given a boost in the Budget, it has been announced. Akshata Murty donated her stake in Koru Kids to charity after her involvement became an &quot;unfair distraction&quot; for the charity ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-wife-koru-kids-b2475495.html",
        "title": "<b>Rishi Sunak</b>’s wife gives up controversial stake in childcare firm",
        "description": "Akshata Murty gave her 1 per cent stake in the childcare agency to charity in order to let the company ‘focus on its work and grow’"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-has-claimed-he-is-making-progress-on-his-5-pledges-to-voters-and-people-arent-convinced_uk_659bdff3e4b0bfe5ff640cdc?d_id=7155395&ncid_tag=fcbklnkukhpmg00000008",
        "title": "<b>Rishi Sunak</b> Has Claimed He Is Making &#39;Progress&#39; On His 5 Pledges To Voters And People Aren&#39;t Convinced",
        "description": "<b>Rishi Sunak</b> has been criticised after he claimed he had “made progress’ on “all five” of his pledges to voters. He promised a year ago that he would halve inflation, grow the economy, reduce debt, cut NHS waiting lists and “stop the boats”."
    },
    {
        "url": "https://www.cheshire-live.co.uk/news/chester-cheshire-news/rishi-sunak-booed-heckled-leaves-28398974?int_source=nba",
        "title": "<b>Rishi Sunak</b> is booed and heckled as he leaves Stockport restaurant",
        "description": "Shouts of &#39;resign&#39; were heard from several people gathered on the opposite side of the road as Mr <b>Sunak</b> left La Dolce Vita on Stockport Road. <b>Sunak</b> was on a whistle-stop tour of the region this morning, also taking in Altrincham Food Market with local MP ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/23152467.rishi-sunak-facing-growing-tory-revolt-windfarm-ban/?ref=habersitesi.org",
        "title": "<b>Rishi Sunak</b> facing growing Tory revolt on windfarm ban",
        "description": "<b>RISHI Sunak</b> is facing a growing rebellion of senior Conservatives who are joining Boris Johnson and Liz Truss in trying to force him to drop a ban on new onshore wind farms. Former party chairman Sir Jake Berry added his name on Sunday to the Tory MPs ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/slowdown-in-hiring-is-bad-news-for-rishi-sunak-rj6n2p3gw",
        "title": "Slowdown in hiring is bad news for <b>Rishi Sunak</b>",
        "description": "Andrew Bailey may see signs that the Bank of England’s interest rate medicine works but he risks ruining the prime minister’s chances of a pre-election bounce"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/post-office-horizon-government-will-mellor-people-b1131329.html",
        "title": "Ministers under pressure to move swiftly to address Horizon Post Office scandal",
        "description": "It comes as public anger over the Horizon IT scandal saw former Post Office boss Paula Vennells hand back her CBE."
    },
    {
        "url": "https://www.ibtimes.co.uk/climate-advisers-criticize-jeremy-hunts-net-zero-target-claims-1722590",
        "title": "Climate Advisers Criticise Jeremy Hunt&#39;s Net Zero Target Claims",
        "description": "The absence of clear and immediate strategies to decarbonise these sectors has raised doubts about the government&#39;s commitment to its climate pledges."
    },
    {
        "url": "https://news.sky.com/story/tory-rebels-table-amendments-aimed-at-toughening-sunaks-rwanda-bill-13044936",
        "title": "Tory rebels table amendments aimed at &#39;toughening&#39; <b>Sunak</b>&#39;s Rwanda bill",
        "description": "More than 30 Tory MPs are poised to back amendments aimed at &quot;toughening&quot; Rishi Sunak&#39;s Rwanda bill when it returns to the Commons next week."
    },
    {
        "url": "https://www.ft.com/content/db0567e7-04b8-46ab-849d-dd453e6a9e29",
        "title": "Tory rightwingers set up showdown with <b>Sunak</b> over Rwanda bill",
        "description": "The legislation brought forward by Sunak and home secretary James Cleverly states that Rwanda is a safe country and disapplies some sections of the UK’s Human Rights Act. It stops short, however, of blocking European courts from intervening in UK verdicts, and leaves open the opportunity for individual challenges to removal orders."
    },
    {
        "url": "https://inews.co.uk/news/politics/jeremy-hunt-pledges-to-make-a-start-on-bringing-down-tax-burden-2845881",
        "title": "Jeremy Hunt pledges to ‘make a start’ on bringing down tax burden",
        "description": "The cost of pandemic spending and support during the energy crisis pushed taxes so high that they cannot be brought down “in one go,” Jeremy Hunt has suggested. The Chancellor said it was not possible to bring the tax burden to “pre-pandemic” levels quickly but he would “make a start”."
    },
    {
        "url": "https://inews.co.uk/news/politics/lord-cameron-no-regrets-chinese-investment-links-2845480?ico=related_stories",
        "title": "Cameron has ‘no regrets’ over Chinese investment links",
        "description": "The Foreign Secretary has faced criticism over his links to China since being appointed to the role by Rishi Sunak, given the UK now regards the Asian giant as an “epoch-defining and systemic challenge” – a far cry from the “golden era” of relations with Beijing pursued by Lord Cameron as prime minister in the 2010s."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/09/ed-davey-paula-vennells-post-office-horizon-it-scandal/",
        "title": "Pressure on Ed Davey over knighthood after Post Office boss hands back CBE",
        "description": "Paula Vennells’ decision that she will forfeit the honour puts pressure on Liberal Democrat leader who was Post Office minister at the time"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12944815/Tory-rebels-call-Rishi-Sunak-tougher-new-Rwanda-laws-Suella-Braverman-warns-failing-act-betray-British-people.html",
        "title": "Tory rebels call for <b>Rishi Sunak</b> to get tougher on the new Rwanda laws as Suella Braverman warns failing to act would &#39;betray the British people&#39;",
        "description": "Writing exclusively for today&#39;s Mail, the Tory former home secretary says the Safety of the Rwanda Bill will be useless if Rishi Sunak refuses to back the changes."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-prime-minister-rwanda-bill-penny-mordaunt-b2476024.html",
        "title": "Tory MPs seek to ‘toughen’ Rwanda Bill as <b>Sunak</b> faces Commons showdown",
        "description": "Rishi Sunak faces a showdown with MPs over his Rwanda Bill when it returns to the Commons next week, with around 30 MPs prepared to back amendments aimed at toughening up the legislation. Commons Leader Penny Mordaunt on Tuesday announced the Safety of Rwanda (Asylum and Immigration) Bill’s committee stage will take place on January 16 and 17."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12944847/post-office-boss-paula-vennells-bonuses-pension-return.html",
        "title": "Shamed former Post Office boss Paula Vennells faces calls to return £3 million in bonuses and pension after handing backing her CBE",
        "description": "The former Post Office chief yesterday bowed to huge public pressure and finally gave up the CBE she was awarded in 2019."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/09/sunak-mps-revolt-amendments-rwanda-bill/",
        "title": "<b>Rishi Sunak</b> faces Rwanda Bill revolt by at least nine former Cabinet ministers",
        "description": "More than 30 MPs table amendments in effort to toughen up Prime Minister&#39;s legislation to stop the small boats"
    },
    {
        "url": "https://www.thesun.co.uk/news/25304904/tory-rebels-harden-rishi-sunak-rwanda-bill/",
        "title": "Tory rebels launch plot to harden <b>Rishi Sunak</b>’s Rwanda bill so meddling European judges are automatically overruled",
        "description": "TORY rebels last night launched a plot to harden the Rwanda plan so meddling European judges are automatically overruled. More than 30 rightwing MPs are backing a bid to hijack Rishi Sunak’s Bill"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853877/rwanda-bill-doesnt-end-merry-go-round-legal-challenges",
        "title": "The Rwanda Bill &#39;doesn’t end the merry-go-round of legal challenges&#39;, protests Mr Jenrick",
        "description": "The ex-immigration minister warned Sunak the &#39;stakes could not be higher&#39;, after they issued a series of demands to toughen up new Rwanda deportation laws."
    },
    {
        "url": "https://www.lbc.co.uk/news/rebel-tory-mps-unite-toughen-up-rwanda-law-ignoring-foreign-courts/",
        "title": "Rebel Tory MPs unite in fresh bid to &#39;toughen up&#39; Rwanda law by ignoring foreign courts and closing &#39;loopholes&#39;",
        "description": "Rebel Tories have put down several amendments demanding Rishi Sunak ignore foreign court orders and quash legal challenges to get flights off to Rwanda."
    },
    {
        "url": "https://www.itv.com/news/2024-01-09/norway-government-criticised-after-approving-deep-sea-mining-practice",
        "title": "&#39;Catastrophe for the ocean&#39;: Norway government criticised after approving deep-sea mining",
        "description": "The UK is one of a number of countries which has urged caution on deep-sea mining, with Prime Minister <b>Rishi Sunak</b>&#39;s government announcing its support for a moratorium on the practice last year. In November, more than 100 European politicians wrote an open ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25303785/mr-bates-vs-the-post-office-state-bullies/",
        "title": "What Mr Bates vs The Post Office shows is how little state bullies care about ordinary people",
        "description": "SUNLIGHT, they say, is the best disinfectant. And so is the harsh spotlight of a major television drama. Consequently, the Post Office scandal is finally attracting the national disgust it"
    },
    {
        "url": "https://www.onlondon.co.uk/charles-wright-what-will-michael-goves-london-plan-review-come-up-with/",
        "title": "Charles Wright: What will Michael Gove’s ‘London Plan review’ come up with?",
        "description": "Some six months after Rishi Sunak said he was “stepping in” to sort out London’s housing crisis, we’ve finally seen some action in the form of a panel of “expert advisers” appointed by levelling up secretary Michael Gove,"
    },
    {
        "url": "https://www.thisiswiltshire.co.uk/news/national/24038507.cameron-worried-israel-may-acted-international-law/",
        "title": "Cameron ‘worried’ Israel may have acted against international law",
        "description": "Asked if <b>Rishi Sunak</b> shares Lord Cameron’s concerns about whether Israel has been acting within international law, the Prime Minister’s official spokesman said: “It’s an issue we continue to keep under review and obviously we have made our views ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/09/sunaks-wife-donates-koru-kids-shares-to-charity",
        "title": "<b>Sunak</b>’s wife donates Koru Kids shares to charity after code of conduct breach",
        "description": "Akshata Murty decided to exit investment after it became ‘unfair distraction’ for childcare business, say representatives"
    },
    {
        "url": "https://news.sky.com/story/tory-mp-appeals-for-unity-ahead-of-rwanda-bills-return-to-parliament-13044937?dcmp=snt-sf-twitter",
        "title": "Tory MP appeals for unity ahead of Rwanda bill&#39;s return to parliament",
        "description": "A senior figure in the party&#39;s centrist wing, Matt Warman, says members must be &quot;prepared to compromise&quot; as tensions are set to rise over the controversial legislation."
    },
    {
        "url": "https://www.express.co.uk/finance/personalfinance/1853500/martin-lewis-jeremy-hunt-tax-cuts",
        "title": "Martin Lewis clashes with Jeremy Hunt as Chancellor insists he wants more tax cuts",
        "description": "The Money Saving Expert founder sat down with Chancellor Jeremy Hunt to talk about Britain&#39;s finances on The Martin Lewis Money Show."
    },
    {
        "url": "https://www.heraldscotland.com/news/24038747.humza-yousaf-indy-economic-speech-fails-carve-path/?ref=rss",
        "title": "Humza Yousaf: Indy economic speech fails to carve path",
        "description": "It is quite clear to anyone with half a brain that whether <b>Rishi Sunak</b> or Sir Keir secures the keys to Number 10 at the general election, calls for either a second referendum or independence itself, will be filed in the usual place. One of the biggest ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/09/post-office-horizon-scandal-ministers-scramble-quash-convictions-20085131/?ico=metro-posts_africa_whats-trending-now",
        "title": "Ministers scramble to speed up overturning of Post Office Horizon convictions",
        "description": "Former Post Office boss Paula Vennells was coming under increasing pressure over her CBE after <b>Rishi Sunak</b> signalled he would support a committee looking into stripping her of the honour. More than a million people have signed a petition demanding she lose ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/kingswood-by-election-damien-egan-labour-mayor-lewisham-chris-skidmore-b1131305.html",
        "title": "Mayor of Lewisham announced as Labour candidate in Kingswood by-election",
        "description": "Chris Skidmore launched a scathing attack on Prime Minister <b>Rishi Sunak</b>’s green credentials before he formally resigned as an MP on Monday. Mr Skidmore, who led a Government review of net zero, said the &quot;future will judge harshly&quot; anyone who backed the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/uk-hospitals-declare-critical-incident-31845020",
        "title": "UK hospitals declare critical incident for second week after sudden rise in Covid and flu patients",
        "description": "But speaking during a recent visit to Nottinghamshire, Prime Minister <b>Rishi Sunak</b> said the county&#39;s critical incident underlined the &quot;damage&quot; that strikes were causing. Dr Briggs added: &quot;This is not a decision that we take lightly and the status remains ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/09/scottish-government-ban-conversion-therapy/",
        "title": "Scottish government publish plans to ban conversion therapy",
        "description": "While UK-based activists sit tight in wait of an update on <b>Rishi Sunak</b>’s conservative party to follow through on their promise to ban the abhorrent practice, Scotland is pushing ahead with proposed legislation that would “prevent and respond to harmful ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67929003.amp",
        "title": "David Cameron worried Israel may have broken international law in Gaza",
        "description": "Asked if <b>Rishi Sunak</b> shares Lord Cameron&#39;s concerns about whether Israel has been acting within international law, the prime minister&#39;s official spokesman said: &quot;It is an issue we continue to keep under review and obviously we have made our views clear to ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/uk-g7-country-household-budgets-pre-pandemic_uk_659ba8e8e4b0f9f6621d61e8/",
        "title": "UK At The Bottom Of G7 Yet Again As We Continue To Drag In Post-Pandemic Recovery",
        "description": "“We can’t go on like this. Britain cannot afford the Tories for a day longer.” Although <b>Rishi Sunak</b> did manage to deliver on his pledge to halve inflation by the end of 2023 (cutting it to 3.9%), predictions from the Office for Budget Responsibility ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12944979/Kates-former-postmaster-used-serve-Doritos-Haribo-sweets-Princess-Wales-teenager-reveals-stood-wrongly-accused-stealing-16-000-Horizon-scandal.html",
        "title": "Kate&#39;s former postmaster who used to serve Doritos and Haribo sweets to the Princess of Wales when she was a teenager reveals how she stood by him when he was wrongly accused ...",
        "description": "Hasmukh Shingadia, 63, used to serve Haribo and Doritos to the Princess of Wales and her sister Pippa at his Spar and Post Office in Upper Bucklebury, Berkshire, when they were teenagers."
    }
]