[
    {
        "url": "https://www.ibtimes.co.uk/astrazeneca-partners-ai-company-find-cure-cancer-1721974",
        "title": "AstraZeneca Partners With AI Company to Find Cure For Cancer",
        "description": "Absci, a drug and target discovery company, has been harnessing the power of deep learning AI to develop new and existing disease treatments."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/timeline-of-the-government-s-rwanda-asylum-deal-105156/",
        "title": "Timeline of the Government’s Rwanda asylum deal",
        "description": "December 19: The High Court rules the Government’s Rwanda policy is legal but orders the cases of the first eight deportees to be reconsidered. Campaigners later take the case to the Court of Appeal. December 31: A record 45,755 migrants made the Channel crossing over the course of the year, according to Government figures."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/05/rishi-sunak-suffers-first-parliamentary-defeat-in-infected-blood-vote",
        "title": "<b>Rishi Sunak</b> suffers first parliamentary defeat in infected blood vote",
        "description": "Tory MPs revolt in vote for amendment to victims and prisoners bill to establish compensatory body <b>Rishi Sunak</b> has suffered a parliamentary defeat as MPs voted to establish a compensatory body for victims of the infected blood scandal. MPs voted 246 to 242 ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/times-letters-fears-decline-modern-languages-comment-0hkvtdf8n",
        "title": "Times letters: Fears over the decline in modern languages",
        "description": "<b>Rishi Sunak</b> clearly cares about education: witness his ambition to ensure everyone studies maths up to the age of 18. He could do the same for language learning by restoring the"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/why-was-rwanda-policy-blocked-by-courts-and-what-is-rishi-sunak-s-plan-b-105157/",
        "title": "Why was Rwanda policy blocked by courts and what is <b>Rishi Sunak</b>’s Plan B?",
        "description": "<b>Rishi Sunak</b>’s promise to the British public was a straightforward one – he vowed to “stop the boats” as thousands of asylum seekers crossed the Channel without authorisation. But as crossings continued, the pledge has been complicated by legal ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/23967788.james-cleverly-heading-rwanda-seal-new-asylum-treaty/",
        "title": "James Cleverly heading to Rwanda to seal new asylum treaty",
        "description": "James Cleverly is travelling to Kigali to sign the agreement as <b>Rishi Sunak</b> bids to make the plan to send migrants to the African nation legally watertight after the Supreme Court’s ruling against the policy. Domestic legislation is also planned so ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/james-cleverly-heading-to-rwanda-to-sign-new-asylum-treaty-2791468?ITO=msn",
        "title": "James Cleverly heading to Rwanda to sign new asylum treaty",
        "description": "He is expected to land in the capital at about 8am UK time, according to reports. <b>Rishi Sunak</b> has been attempting to make his plan to send migrants to the African nation legally watertight after the Supreme Court’s ruling against the policy last month."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-approval-rating-tory-members-worst-ever-ffhwkwkqn",
        "title": "<b>Rishi Sunak</b>’s approval rating hits new low with Tory members",
        "description": "<b>Rishi Sunak</b> has fallen to his lowest opinion rating among Conservative activists and James Cleverly’s popularity has collapsed since he became home secretary. The prime minister is now bottom of the monthly cabinet league table compiled by the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-suffers-first-commons-defeat-214700986.html",
        "title": "<b>Sunak</b> suffers first Commons defeat as MPs vote for infected blood compensation body",
        "description": "<b>Rishi Sunak</b> has suffered his first defeat in the House of Commons since becoming prime minister, as MPs voted to establish a compensatory body for victims of the infected blood scandal."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-says-bbc-realistic-074553923.html",
        "title": "<b>Rishi Sunak</b> says BBC should be &#39;realistic&#39; about what people pay for TV licence fee",
        "description": "<b>Rishi Sunak</b> has shared that the BBC needs to be &quot;realistic about what it can expect people to pay&quot; for the TV licence fee during times of high inflation. The Prime Minister has also welcomed £500 million in savings the corporation plans to make in the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rwanda-james-cleverly-rishi-sunak-kigali-plan-b-b1124763.html",
        "title": "Why was Rwanda policy blocked by courts and what is <b>Rishi Sunak</b>’s Plan B?",
        "description": "Rishi Sunak’s promise to the British public was a straightforward one – he vowed to “stop the boats” as thousands of asylum seekers crossed the Channel without authorisation. But as crossings continued, the pledge has been complicated by legal challenges arguing that forcibly removing migrants to Rwanda is against their rights and the law."
    },
    {
        "url": "https://www.thetimes.co.uk/article/tory-rebels-seek-ban-on-gay-therapy-ghcfxwzwd",
        "title": "Tory rebels seek ban on conversion therapy",
        "description": "Rishi Sunak is facing a fresh Commons row after a group of Tory MPs threw their weight behind a bill to ban conversion therapy. Former senior ministers and the first openly transgender MP are among those who have co-sponsored a private member’s bill to clamp down on the practice."
    },
    {
        "url": "https://www.property118.com/sadiq-khan-wants-epc-measures-for-the-prs-reinstated/",
        "title": "Sadiq Khan wants EPC measures for the PRS reinstated",
        "description": "Sadiq Khan, the London Mayor, wants powers to reinstate the EPC minimum standard for the PRS and impose rent freeze."
    },
    {
        "url": "https://www.nwemail.co.uk/news/national/23967788.james-cleverly-heading-rwanda-seal-new-asylum-treaty/",
        "title": "James Cleverly heading to Rwanda to seal new asylum treaty",
        "description": "The Home Secretary is preparing to sign a new treaty with Rwanda for the Government’s stalled asylum deal. James Cleverly is travelling to Kigali to sign the agreement as Rishi Sunak bids to make the plan to send migrants to the African nation legally watertight after the Supreme Court’s ruling against the policy."
    }
]