[
    {
        "url": "https://www.telegraph.co.uk/business/2023/11/19/twitter-elon-musk-blow-government-pulls-advertising/",
        "title": "Fresh blow for Elon Musk as government pulls millions in Twitter advertising",
        "description": "The Government has stopped advertising on Twitter in a fresh blow for Elon Musk ’s social network as it faces an exodus of major brands. Departments have stopped paying for ads on Twitter, now known as X, in recent months, The Telegraph understands."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/11/19/foreign-workers-will-need-30k-salary-to-come-to-britain/",
        "title": "Foreign workers will need salary of over £30,000 to come to Britain",
        "description": "Ministers are expected to set out proposals to reduce the level of net migration by raising the salary threshold for skilled workers"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-jeremy-hunt-rwanda-suella-braverman-prime-minister-b1121327.html",
        "title": "New Rwanda treaty seems unlikely to be ratified before new year",
        "description": "Rishi Sunak’s new deal aimed at getting his asylum policy off the ground is not believed to be coming before Wednesday’s autumn statement."
    },
    {
        "url": "https://socialistworker.co.uk/news/well-keep-up-fight-against-tories-and-far-right-says-stand-up-to-racism-conference/",
        "title": "‘We’ll keep up fight against Tories and far right’ says Stand Up To Racism conference",
        "description": "Around 500 people participated in Stand Up To Racism’s (SUTR) national conference in-person in London and online on Sunday. The conference celebrated the downfall of former home secretary Suella Braverman—and vowed to keep up the fight against the Tories racist attacks."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/hunt-warns-against-fuelling-inflation-but-hints-at-tax-cuts-for-businesses-363449/",
        "title": "Hunt warns against fuelling inflation but hints at tax cuts for businesses",
        "description": "The Sunday Times had reported Mr Hunt and Prime Minister <b>Rishi Sunak</b> are weighing up cuts to income tax or national insurance in a last-minute move to boost growth and their favour with voters. Ms Reeves told the BBC’s Sunday with Laura Kuenssberg ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1836743/left-wing-whitehall-rwanda",
        "title": "Warning left-wing ‘Blob’ will plot to ruin chances of sending migrants to Rwanda",
        "description": "There are fears civil servants could attempt to run down the clock and wreck the plan to send asylum seekers to Rwanda."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/nov/19/rishi-sunak-could-block-key-human-rights-law-force-through-rwanda-asylum-plan?ref=mc.news",
        "title": "<b>Sunak</b> could block Human Rights Act to force through Rwanda asylum plan",
        "description": "No 10 has discussed possibility of ‘disapplying’ key human rights law to emergency bill to head off legal challenges"
    },
    {
        "url": "https://inews.co.uk/news/politics/jeremy-hunt-autumn-statement-tax-cuts-businesses-boost-growth-2765320?ITO=msn",
        "title": "Jeremy Hunt to focus Autumn Statement tax cuts on businesses to boost growth",
        "description": "The Sunday Times had reported Mr Hunt and <b>Rishi Sunak</b> are weighing up cuts to income tax or national insurance in a last-minute move to boost growth and their favour with voters. Shadow Chancellor Rachel Reeves told the BBC’s Sunday with Laura Kuenssberg ..."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/23930935.rishi-sunak-visits-great-smeaton-academy-primary-school/",
        "title": "<b>Rishi Sunak</b> visits Great Smeaton Academy Primary School",
        "description": "Rishi Sunak helped children with preparations to celebrate their school’s special anniversary. The Richmond MP and Prime Minister visited Great Smeaton Academy Primary School, which is 50 years old this academic year. The school is planning a celebration event early in 2024. Mr Sunak joined the children’s discussion about what form it might take."
    },
    {
        "url": "https://news.sky.com/story/chancellor-says-everything-on-the-table-for-autumn-statement-as-he-promises-to-remove-tax-barriers-for-business-13011400?dcmp=snt-sf-twitter",
        "title": "Chancellor says &#39;everything on the table&#39; in autumn statement as he promises to remove tax &#39;barriers&#39; for business",
        "description": "Jeremy Hunt tells Sky News the tax burden is &quot;too high&quot;, as he hints at cuts ahead of Wednesday&#39;s major fiscal event."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/dwp-set-announce-strict-new-28136029",
        "title": "DWP set to announce strict new bank account rules from Wednesday",
        "description": "The Telegraph reports the new law expected to be announced in the Chancellor’s Autumn Statement next week, which Jeremy Hunt will deliver on Wednesday."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/nov/19/tory-mp-bob-stewart-to-stand-down-after-racial-abuse-conviction",
        "title": "Tory MP Bob Stewart to stand down after racial abuse conviction",
        "description": "Politician had told activist Sayed Ahmed Alwadaei to ‘go back to Bahrain’ during row last year"
    },
    {
        "url": "https://inews.co.uk/news/politics/jeremy-hunt-autumn-statement-tax-cuts-businesses-boost-growth-2765320",
        "title": "Jeremy Hunt to focus Autumn Statement tax cuts on businesses to boost growth",
        "description": "Jeremy Hunt vowed to put the UK on the “path to a lower tax economy” as he raised the prospect of cutting taxes on businesses in a bid to boost growth in this week’s Autumn Statement."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12768179/rishi-sunak-rwanda-treaty-ropes-whitehall-sources-claim.html",
        "title": "<b>Rishi Sunak</b>&#39;s Rwanda treaty is on the ropes with the deal &#39;unlikely to be ratified before the new year&#39;, Whitehall sources claim",
        "description": "The deal that the Prime Minister hopes to sign after the Supreme Court defeat had been billed for as soon as Monday but is now not expected before the autumn statement on Wednesday."
    },
    {
        "url": "https://inews.co.uk/opinion/joe-biden-failed-grasp-difference-between-wars-ukraine-gaza-2765214?ico=related_article_inline",
        "title": "Joe Biden has failed to grasp the difference between the wars in Ukraine and Gaza",
        "description": "From the moment Hamas terrorists went on their murderous rampage in Israel, Joe Biden sought to tie together two seismic conflicts that erupted during his presidency by claiming the struggles are comparable."
    },
    {
        "url": "https://www.getsurrey.co.uk/news/uk-world-news/anyone-living-near-new-electricity-28132321",
        "title": "Anyone living near a new electricity pylon set to get £10,000 off bills",
        "description": "Chancellor Jeremy Hunt is to announce the change which aims to reduce planning objections to new power projects"
    },
    {
        "url": "https://bellacaledonia.org.uk/2023/11/19/stopping-the-boats/",
        "title": "Stopping the Boats",
        "description": "Suella Braverman’s departure – and replacement with the smooth-faced former Prime Minister is a momentous act of virtue-signalling by the beleaguered Tories, as they watch their"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67465841?at_format=link&at_campaign=Social_Flow&at_bbc_team=editorial&at_campaign_type=owned&at_medium=social&at_ptr_name=facebook_page&at_link_type=web_link&at_link_id=3F7C032A-86C8-11EE-AAC4-09788161DE7E&at_link_origin=BBC_Wales_News",
        "title": "Autumn Statement: Homes close to new pylons to get £1,000 off bills",
        "description": "Households living close to new pylons and electricity substations could receive up to £1,000 a year off energy bills for a decade under new plans. It is hoped the plan would convince people to support upgrades in their area, which are needed in part for new electric vehicle charging points."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1836772/jeremy-hunt-older-voters-triple-lock-figures",
        "title": "Tories warned older voters will &#39;never forgive&#39; them if they &#39;fiddle&#39; triple lock figures",
        "description": "Jeremy Hunt was warned older voters will never forgive the Tories if they &quot;fiddle&quot; the figures on the triple lock."
    },
    {
        "url": "https://www.racingpost.com/news/britain/mp-conor-mcginn-asks-home-secretary-to-approve-recommendations-to-help-tackle-stable-staff-shortages-alQkX5Z9VDss/",
        "title": "MP asks home secretary to approve recommendations to help tackle stable staff shortages",
        "description": "New home secretary James Cleverly has been asked to approve recommendations which would help address the staffing crisis in Britain&#39;s racing and breeding industries."
    },
    {
        "url": "https://news.sky.com/story/rwanda-scheme--dead-claims-former-supreme-court-justice-13011535",
        "title": "Rwanda scheme &#39;probably dead&#39;, claims former Supreme Court justice",
        "description": "Politics live: Chancellor &#39;wants to lower tax burden&#39; Prime Minister <b>Rishi Sunak</b> has pledged to push on with the scheme - which aims to deter asylum seekers travelling to the country on small boats - promising to turn the agreement with the east African ..."
    }
]