[
    {
        "url": "https://uk.yahoo.com/?_guc_consent_skip=1706803877",
        "title": "Yahoo UK | News, email and search",
        "description": "<b>Rishi Sunak</b> has published his personal tax return, showing he paid more than half a million pounds in UK tax last year. More famous faces swap their day jobs for oven gloves in The Great Celebrity Bake Off 2024. Here&#39;s everything we know about it so far."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/the-king-ayesha-hazarika-labour-plaid-cymru-douglas-ross-b1138306.html",
        "title": "No 10 announces 13 new political life peers during recess",
        "description": "Thirteen new life peers have been announced by the Government. Downing Street published the list of political peerages on Friday as MPs were on holiday. The Tories’ eight nominations include Paul Goodman, a former Conservative MP and editor of the influential ConservativeHome website."
    },
    {
        "url": "https://news.sky.com/story/sunak-paid-half-a-million-pounds-in-tax-last-year-according-to-his-tax-returns-13067577",
        "title": "<b>Sunak</b> paid half a million pounds in tax last year, according to his tax returns",
        "description": "Rishi Sunak has published his personal tax return, showing he paid more than £500,000 in UK tax last year, as his total income rose to £2.2m. The summary of the prime minister&#39;s financial affairs was made public on Friday afternoon as parliament was in recess."
    },
    {
        "url": "https://www.thetimes.co.uk/article/ill-use-whatever-pronouns-i-think-courteous-hqhzmwj55",
        "title": "I’ll use whatever pronouns I think courteous",
        "description": "Even if her poor vulnerable child had not been murdered, this was no way for <b>Rishi Sunak</b> to speak. Navigating a political course between trans and women’s rights is delicate and serious, not the source of cheap zingers when you’re desperate for a win."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/09/rishi-sunak-earned-more-than-22m-last-year/",
        "title": "<b>Rishi Sunak</b> earned more than £2.2m last year",
        "description": "Rishi Sunak earned more than £2.2 million last year and paid an effective tax rate of 23 per cent, according to official accounts released on Friday. Downing Street published the Prime Minister’s tax return which showed that in total he paid just over £500,000 in UK taxes in 2022-23."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-labour-nominate-political-columnists-house-of-lords-2900258?ico=related_article_inline",
        "title": "Tories and Labour both nominate political columnists to House of Lords",
        "description": "The Conservatives and Labour have both nominated political columnists to the House of Lords, as 13 new life peers were announced by the Government. Downing Street published the latest list of political peerages on Friday as MPs were on holiday."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-exclusive-interview-prime-minister-nqhrdhtkc",
        "title": "<b>Rishi Sunak</b>: I’ll cut taxes to reward hard work",
        "description": "The prime minister is hitting the road as he gears up for the election — and putting economic competence at the heart of his campaign"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/barrister-removed-ba-flight-armed-32091769",
        "title": "Barrister removed from BA flight by armed cops after cabin crew row given peerage by PM",
        "description": "Prime Minister Rishi Sunak slipped out the list of new peers on Friday evening that also includes a council leader who bragged about trying to kill moles with a blowtorch"
    },
    {
        "url": "https://www.mirror.co.uk/news/health/huge-majority-uks-dentists-think-32090957",
        "title": "Huge majority of UK&#39;s dentists think <b>Rishi Sunak</b>&#39;s Conservatives are harming the NHS",
        "description": "A pair of surveys questioning more than 3,000 dentists across the UK revealed that two-thirds of them now plan to go private – and a whopping 90% think Rishi Sunak&#39;s Conservative government is to blam"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24110322.rishi-sunak-richmond-campaign-slams-6-3m-nhs-waiting-list/",
        "title": "<b>Rishi Sunak</b>: Richmond campaign slams 6.3m NHS waiting list",
        "description": "Images projected on buildings in Rishi Sunak&#39;s North Yorkshire seat of Richmond have slammed the 6.3m NHS waiting list."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/09/frustrated-businesses-staff-abroad-britons-abandon-work/",
        "title": "‘Frustrated’ businesses seek staff abroad as Britons abandon work",
        "description": "Businesses have become “frustrated” with trying to hire British workers and are increasingly looking abroad to fill vacancies, the National Institute of Economic and Social Research (NIESR) has warned."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/cash-first-support-for-families-struggling-with-high-baby-formula-costs-in-scotland/",
        "title": "&#39;Cash first&#39; support for families struggling with high baby formula costs in Scotland",
        "description": "<b>Sunak</b> paid half a million pounds in tax last year, according to his tax returns <b>Rishi Sunak</b> has published his personal tax return, showing he paid more than £500,000 in UK tax last year, as his total income rose to £2.2m. New Body Shop owner to call in ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/09/rishi-sunak-paid-effective-tax-rate-of-23-on-22m-income-last-year?ref=mc.news",
        "title": "<b>Rishi Sunak</b> paid effective tax rate of 23% on £2.2m income last year",
        "description": "Low capital gains rate and US location of funds mean tax bill of £508,000 much less than under top income rate of 45% <b>Rishi Sunak</b> paid more than half a million pounds in tax in 2023 after making a £1.8m profit on his holding in a US investment fund ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/09/will-uk-go-war-russia-putins-world-war-three-warning-20254528/?ico=mosaic_tag",
        "title": "Will the UK go to war with Russia? Putin’s World War Three warning and other threats",
        "description": "Prime Minister <b>Rishi Sunak</b> recently warned that ‘if Putin wins in Ukraine, he will not stop there’. ‘That is why Ukraine’s security is our security,’ he added. ‘NATO’ stands for North Atlantic Treaty Organisation. The group was formed in 1949 ..."
    },
    {
        "url": "https://www.sidmouthherald.co.uk/news/24110797.prime-minister-rishi-sunak-makes-flying-visit-sidbury/",
        "title": "Prime Minister <b>Rishi Sunak</b> makes flying visit to Sidbury",
        "description": "Prime Minister, <b>Rishi Sunak</b> MP was in Sidbury today, (Friday, February 9) to speak to farmers at Sidbury Village Hall. During the roundtable meeting chaired by Simon Jupp, farmers from Broadclyst, Talaton, Venn Ottery, Seaton, Sidbury, Sidmouth and ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24110568.rishi-sunak-earned-2-2-million-paid-508-000-tax-documents-show/",
        "title": "<b>Rishi Sunak</b> earned £2.2 million and paid £508,000 in tax, documents show",
        "description": "<b>Rishi Sunak</b> has published his tax documents, showing that he paid more than £500,000 in UK tax last year, as his total income rose to £2.2 million. The Prime Minister released the summary of his tax affairs on Friday afternoon as the House of Commons was ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68250020.amp?trk=public_post_comment-text",
        "title": "Laura Trott interview: Fact-checking Treasury minister&#39;s claim on debt",
        "description": "Talking about the debt today, <b>Rishi Sunak</b> said it was &quot;on schedule&quot; to fall. That is correct, and different to statements he made in November 2023, when he was criticised by the statistics regulator for claiming that &quot;debt is falling&quot;. &quot;Members of the ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/rishi-sunak-tax-records-released/",
        "title": "<b>Rishi Sunak</b> earned £2.2m last year, according to tax records",
        "description": "Mr Suank paid £508,308 of UK tax on earnings of just over £2.2 million in 2023. The tax summary, published by Downing Street, showed Mr <b>Sunak</b> paid £163,364 in tax on a total income of £432,884. Mr <b>Sunak</b> also paid £359,240 in tax on £1.8 million in ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/health/blood-scandal-compensation-anger-montgomery-28601777",
        "title": "Infected Blood victims furious after Government appoints expert with pharma links",
        "description": "There are questions as to why a professor who previously advised Bayer Pharmaceuticals has been asked to advise the Government on infected blood compensation"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-earned-more-than-ps22-million-last-year_uk_65c6553ee4b069b665df57be?d_id=7284396&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b> Earned More Than £2.2 Million Last Year",
        "description": "The prime minister paid the taxman paid £508,308 in tax - a rate of less than 23%. The figures were revealed in <b>Sunak</b>’s tax return of 2022/23 and confirm his status as one of the country’s richest men. It takes his total earnings over the last four ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-two-million-cost-crisis-b2493725.html",
        "title": "<b>Rishi Sunak</b> makes £2 million as Britons struggle with cost of living crisis",
        "description": "Rishi Sunak’s income topped £2m last year as UK voters struggled with the cost of living crisis. The prime minister also paid more than half a million pounds in UK tax. Mr Sunak’s financial affairs have come under intense scrutiny since The Independent revealed his wife Akshata Murty held “non-dom” tax status to avoid UK tax on foreign income."
    },
    {
        "url": "https://www.thenational.scot/news/24109735.rishi-sunak-appear-replacement-jacob-rees-mogg-gb-news/?s=09",
        "title": "<b>Rishi Sunak</b> to appear as replacement for Jacob Rees-Mogg on GB News",
        "description": "<b>RISHI Sunak</b> is set to appear on a GB News show as he steps in as a temporary replacement for Jacob Rees-Mogg. The right-wing broadcaster has previously fallen foul of Ofcom rules on due impartiality after airing a pre-recorded interview with Chancellor ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gaffes-prime-minister-b2492189.html",
        "title": "<b>Rishi Sunak</b>’s history of gaffes, blunders and offensive comments",
        "description": "During his stints in both No 10 and No 11 Downing Street, Mr Sunak has managed to rack up a significant back catalogue of blunders"
    },
    {
        "url": "https://www.mirror.co.uk/money/rishi-sunak-insists-debt-on-32087727",
        "title": "<b>Rishi Sunak</b> insists debt is &#39;on schedule&#39; to fall despite minister&#39;s confusion",
        "description": "The Prime Minister said &quot;economic conditions are improving&quot; when pressed on the Government&#39;s portrayal of the state of the public finances"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-again-repeatedly-refuses-to-apologise-for-trans-joke_uk_65c5e370e4b0fb721d609c26?d_id=7282799&ncid_tag=fcbklnkukhpmg00000008",
        "title": "<b>Rishi Sunak</b> Again Repeatedly Refuses To Apologise For Trans Joke",
        "description": "Rishi Sunak has again refused to apologise for making a joke about trans people after being told told the mother of murdered teenager Brianna Ghey was watching. In an interview with BBC Radio Somerset on Friday morning, the prime minster was repeatedly asked if he would say sorry."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunaks-video-reveals-another-priority-learn-to-spell-8xvqt8cj3",
        "title": "<b>Rishi Sunak</b>’s video reveals another priority: learn to spell",
        "description": "Rishi Sunak’s brand new video had been online for less than its three-minute duration before it had already been repackaged into several million jokes"
    }
]