[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h14v3c",
        "title": "Chris Mason on 2024: The year of the election campaign",
        "description": "In this episode of the 5 Minutes On podcast, the BBC&#39;s Political Editor Chris Mason considers what is at stake for all the political parties in 2024, the year of the election campaign."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24012109.car-parking-fees-hospitals-soar-50-year-figures-show/",
        "title": "Car parking fees at hospitals soar by 50% in a year, figures show",
        "description": "Hospital patients and visitors forked out £146 million for car parking last year – up by 50% from the previous year, figures show. The Liberal Democrats, who uncovered the data, branded it a “tax on caring” and criticised the Tory Government for “failing to deliver” on a manifesto pledge to end unfair hospital car parking charges."
    },
    {
        "url": "https://www.thenational.scot/news/24011983.rishi-sunak-slammed-cringe-worthy-number-10-christmas-video/",
        "title": "<b>Rishi Sunak</b> slammed for ‘cringe-worthy’ Number 10 Christmas video",
        "description": "Rishi Sunak continues his tradition of cringe worthy videos &amp; images made at our expense. All underlying how clueless &amp; completely out of touch he is with the state of the country he is PM of. https://t.co/hj1cKFLclH"
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-scraps-imperial-measures-f58n7dvzd",
        "title": "<b>Rishi Sunak</b> scraps return to imperial measures",
        "description": "Rishi Sunak has abandoned Boris Johnson’s signature Brexit “dividend” of allowing British shops to once again sell products in pounds and ounces. In an announcement slipped out ­quietly over Christmas,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/rwanda-processed-05-percent-of-asylum-claims-in-six-months-587v8hxlt",
        "title": "Rwanda processed 0.5% of asylum claims in six months",
        "description": "Rishi Sunak is facing more questions over his Rwanda policy as figures reveal that the country is processing fewer than 100 asylum claims each year. Both governments have repeatedly insisted that the migrant deportation scheme is uncapped,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/conservatives-daisy-cooper-liberal-democrats-government-hospital-b1129123.html",
        "title": "Car parking fees at hospitals soar by 50% in a year, figures show",
        "description": "Hospital patients and visitors forked out £146 million for car parking last year – up by 50% from the previous year, figures show. The Liberal Democrats, who uncovered the data, branded it a “tax on caring” and criticised the Tory Government for “failing to deliver” on a manifesto pledge to end unfair hospital car parking charges."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/anger-nhs-parking-scandal-gets-31751836",
        "title": "Anger as NHS parking scandal gets worse with patients shelling out £146million",
        "description": "The Lib Dems have hit out at the Government as new figures showed a huge rise in parking fees - with NHS staff forced to pay £46.7million sparking fears of an exodus"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-67825269",
        "title": "Newspaper headlines: Tory election plans and &#39;NHS parking scandal&#39;",
        "description": "The front pages carry a range of stories, including different ways the Tories may seek to &quot;woo&quot; voters ahead of the election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tories-michael-gove-rishi-sunak-government-the-times-b1129104.html",
        "title": "Tories float tax cuts and help for house-buyers to turn around dire polling",
        "description": "And the Prime Minister has ordered a “gear change” to reduce the historically high tax burden, possibly axing inheritance tax and reducing income tax, according to the Telegraph. Both reports emerged as he struggles to turn the tide in favour of his party as Labour sits around 20 points clear in the polls."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12902403/Government-axing-inheritance-tax-three-months-General-Election.html",
        "title": "Government &#39;considering axing inheritance tax in three months in bid to increase vote share in rumoured 2024 General Election&#39;",
        "description": "Prime Minister Rishi Sunak is reportedly looking at scrapping the levy as part of a &#39;gear change&#39; on tax policies before voters go to the polls."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-12901679/UKs-woeful-lack-vision-Politicians-learn-stick-long-term-goals-says-ALEX-BRUMMER.html",
        "title": "UK&#39;s woeful lack of vision: Politicians must learn to stick to long-term goals, says ALEX BRUMMER",
        "description": "Finally, there is HS2. <b>Rishi Sunak</b>’s decision to cancel the Birmingham to Manchester leg of the project is the biggest economic blunder of his trouble-strewn administration. Transport experts and businesses have been making plans for almost a decade on ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/bills/article-12901023/Test-money-knowledge-quiz-year.html",
        "title": "Test your money knowledge in our quiz of the year",
        "description": "Do you know your Isas from your Lisas or your bond rates from your base rates? Find out if you&#39;re a money maestro or a fiscal flop with our quiz of the year."
    },
    {
        "url": "https://www.thesun.co.uk/news/25167826/keir-starmer-immigration-plan-labour-void/",
        "title": "Sir Keir Starmer knows Labour has a void where a plan for stopping the small boats should be",
        "description": "Migrants stunt LABOUR love to denounce the Tories’ Rwanda migrants scheme as a “gimmick”. Their latest so-called alternative is worse — it is a blatant, cynical stunt. Keir Starmer knows his party"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12902179/Keir-Starmer-frontbenchers-spring-general-election-Rishi-Sunak-2024.html",
        "title": "Keir Starmer tells his frontbenchers to prepare for a spring general election after <b>Rishi Sunak</b> confirms one will be held in 2024",
        "description": "Shadow ministers have been told to have their policy proposals ready by mid-January so that the party can have a full manifesto by February 8, insiders have said."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/26/uk-leader-first-g20-nation-halve-carbon-emissions/",
        "title": "UK hailed as ‘world leader in tackling climate change’ as first G20 nation to halve carbon emissions",
        "description": "Net Zero Secretary praises milestone reduction over past 50 years despite a far larger population and economy than in the 1970s"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/26/rishi-sunak-end-inheritance-tax-spring-ahead-of-election/",
        "title": "<b>Sunak</b> plots to end inheritance tax in spring ahead of election",
        "description": "The overall tax burden is heading to its highest level for around 70 years, with a freeze on many tax threshold levels used to recover money spent in the Covid pandemic. But in November’s Autumn Statement, Mr Sunak and Jeremy Hunt, the Chancellor, signalled a change in approach, delivering the biggest single package of tax cuts since the 1980s."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/woman-abused-after-being-spiked-31751101.amp",
        "title": "EXCLUSIVE: Woman &#39;abused after being spiked&#39; says James Cleverly should be sacked",
        "description": "A political campaigner who says she was &quot;often drugged&quot; and abused in the past has demanded <b>Rishi Sunak</b> sacks James Cleverly over his vile date-rape drug joke. Gina Miller, who heads the True and Fair Party, described Rohypnol spiking as &quot;one of the worst ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/26/end-government-by-whatsapp-urges-former-gchq-head",
        "title": "End government by WhatsApp, urges former GCHQ head",
        "description": "Scrutiny of government decision-making has also been hindered by Johnson and <b>Rishi Sunak</b> having lost their WhatsApp messages covering crucial stretches of time. The government initially resisted having to hand over messages between ministers, senior ..."
    }
]