[
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24135848.many-childcare-providers-will-struggle-meet-demand-places-says-charity/",
        "title": "Many childcare providers will struggle to meet demand for places, says charity",
        "description": "Prime Minister <b>Rishi Sunak</b> said last month that all eligible children in England will be able to benefit from the expansion of Government-funded childcare provision which will begin to roll out this spring. But with just six weeks to go until the first ..."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/national/24135845.sunak-touts-gigabit-broadband-rollout-levelling-tour-north-wales/",
        "title": "<b>Sunak</b> touts gigabit broadband rollout on ‘levelling up tour’ of North Wales",
        "description": "<b>Rishi Sunak</b> is heading to North Wales on Thursday where he said his Government was “breathing new life into communities” through levelling up, as it was announced that one million UK properties had been connected to high-speed broadband. The Prime ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24135842.poorer-families-full-time-jobs-need-eight-day-week-escape-poverty/",
        "title": "Poorer families in full-time jobs ‘need eight-day week to escape poverty’",
        "description": "It referred to a comment in Parliament by Prime Minister <b>Rishi Sunak</b> on working households following the autumn statement and said its analysis counters this thinking. Mr <b>Sunak</b> had said: “We do not want any child to grow up in poverty, and the best way ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/rishi-sunak-wales-two-days-28679831",
        "title": "<b>Rishi Sunak</b> is in Wales for two days as part of his &#39;levelling up tour&#39;",
        "description": "Rishi Sunak will be in Wales for two days as part of a so-called &quot;levelling up tour&quot; of the country. The Prime Minister&#39;s visit to north Wales from today coincides with an announcement that one million UK properties had been connected to high-speed broadband."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/20/i-have-your-back-rishi-sunak-tells-farmers-at-nfu-conference?share=reddit",
        "title": "I have your back, <b>Rishi Sunak</b> tells farmers at NFU conference",
        "description": "<b>Sunak</b> becomes first PM to address conference since Gordon Brown in 2008, as Tories court farming sector <b>Rishi Sunak</b> has told farmers: “I have your back” at the National Farmers Union conference, as he promised to “change the culture” in government ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/everything-you-need-to-know-about-the-fasting-mimicking-diet-nutrition-advice-lgkvrb6px",
        "title": "Everything you need to know about the fasting mimicking diet",
        "description": "A five-day diet that drastically reduces calories and focuses on fat has been found to help ward off type 2 diabetes, writes Maria Lally"
    },
    {
        "url": "https://www.which.co.uk/news/article/ways-isas-are-changing-in-april-2024-a7Cqc3N7yclx",
        "title": "5 ways Isas are changing in April 2024",
        "description": "In November&#39;s Autumn Statement, the Chancellor announced several changes which will come into force from 6 April 2024: Savers will be able to open and pay into multiple Isas of the same type annually. That will replace current rules that only let you put money into one of each type of Isa every tax year."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/north-wales-prime-minister-government-mark-drakeford-jo-stevens-b2500308.html",
        "title": "<b>Sunak</b> touts gigabit broadband rollout on ‘levelling up tour’ of North Wales",
        "description": "<b>Rishi Sunak</b> is heading to North Wales on Thursday where he said his Government was “breathing new life into communities” through levelling up, as it was announced that one million UK properties had been connected to high-speed broadband. The Prime ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-children-action-for-children-parliament-government-b2500314.html",
        "title": "Poorer families in full-time jobs ‘need eight-day week to escape poverty’",
        "description": "It referred to a comment in Parliament by Prime Minister <b>Rishi Sunak</b> on working households following the autumn statement and said its analysis counters this thinking. Mr <b>Sunak</b> had said: “We do not want any child to grow up in poverty, and the best way ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110543/JOHN-MACLEOD-Camerons-return-like-Bobby-stepping-Dallas-shower-Tories-worse-bad-dream.html",
        "title": "JOHN MACLEOD: Cameron&#39;s return was like Bobby stepping out of the Dallas shower. But for the Tories, this is worse than a bad dream",
        "description": "It is quite outnumbered in the House of Lords; it trails in the opinion polls. Blithe, boyish and at times seemingly in tenuous touch with reality, <b>Rishi Sunak</b> is but the latest failed Prime Minister since Tony Blair. We had the usual excuses after ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/long-term-sick-being-failed-32181011",
        "title": "Long-term sick being failed by Tories&#39; record NHS backlog, Keir Starmer says",
        "description": "There is also a backlog of 7.6million NHS appointments and record waits. Earlier this month <b>Rishi Sunak</b> admitted his government had failed on his pledge to cut NHS waiting lists, saying he had &quot;not made enough progress&quot;. Labour says it will cut the NHS ..."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1869390/meghan-markle-prince-harry-royal-family-return",
        "title": "Meghan Markle&#39;s part in Prince Harry&#39;s possible return to the Royal Family revealed",
        "description": "The King has been back in the capital meeting Prime Minister <b>Rishi Sunak</b> this week, and he is still said to be of the &quot;firm opinion&quot; that his younger son can never return to royal duties. He and Prince William are in &quot;solid agreement&quot; on this point ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/king-charles-still-very-much-32183103",
        "title": "King Charles is &#39;still very much in charge&#39; and eager to carry on duties after PM meeting",
        "description": "The monarch - who is undergoing treatment for the currently unspecified cancer - met with <b>Rishi Sunak</b> today for his first face-to-face audience with the PM since announcing his diagnosis earlier this month. Judi James told the Mirror: &quot;The long ..."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13110835/EPHRAIM-HARDCASTLE-Jon-Sopel-mocks-Rishi-Sunaks-Farmers-Union-speech-PM-uses-quote-words-appear-Brainy-Quotes-list-farming-phrases.html",
        "title": "EPHRAIM HARDCASTLE: Jon Sopel mocks <b>Rishi Sunak</b>&#39;s Farmer&#39;s Union speech after the PM uses a quote that are the first words to appear on BrainyQuote&#39;s list of farming phrases",
        "description": "Ex-BBC correspondent Jon Sopel mocks PM <b>Rishi Sunak</b>&#39;s speech to the National Farmers&#39; Union – in particular his decision to quote President Eisenhower&#39;s remark: &#39;Farming looks mighty easy when your plough is a pencil and you&#39;re a thousand miles from the ..."
    },
    {
        "url": "https://inews.co.uk/news/king-reduced-to-tears-by-messages-of-support-since-cancer-diagnosis-2919891?ico=most_popular",
        "title": "King ‘reduced to tears’ by messages of support since cancer diagnosis",
        "description": "King Charles III meets with Prime Minister <b>Rishi Sunak</b> at Buckingham Palace for their first in-person audience (Photo: Jonathan Brady – Pool/Getty Images) Mr <b>Sunak</b> told the monarch, who looked relaxed during the 45-minute-long audience, it was ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-21/uk-sanctions-the-heads-of-artic-penal-colony-where-alexei-navalny-died",
        "title": "Lord Cameron urges world to hold &#39;Putin and his cronies to account&#39; after Navalny death",
        "description": "Six individuals at the head of the Arctic penal colony where Alexei Navalny died have been sanctioned by the UK. The men are now banned from the UK and subject to an asset freeze preventing UK companies and individuals from dealing with them."
    },
    {
        "url": "https://www.ft.com/content/ac89b09b-6fd0-43e4-b7ff-7e147801e73a",
        "title": "Badenoch rows highlight combative style of Tory leadership prospect",
        "description": "Stance as ‘anti-woke, black woman’ seen as making her popular with predominantly white, older party membership."
    },
    {
        "url": "https://news.sky.com/story/politics-live-defence-secretary-to-make-commons-statement-after-failed-nuclear-deterrent-launch-12593360?postid=7266151",
        "title": "Politics latest: Motion of no confidence in Speaker after Gaza debate descends into chaos",
        "description": "Watch: <b>Sunak</b> holds first in-person meeting with King since cancer diagnosis Away from the chaos in the Commons chamber, <b>Rishi Sunak</b> held his first in-person meeting with the King since his cancer diagnosis. The King said he has been &quot;reduced to tears&quot; by ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/king-charles-reduced-tears-messages-28679868",
        "title": "King Charles reduced to tears by messages of support as PM <b>Rishi Sunak</b> tells him &#39;country is behind you&#39;",
        "description": "King Charles has carried out his first face-to-face official duties since his cancer diagnosis, as Prime Minister Rishi Sunak told him the &#39;country is behind you&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/infantile-mps-political-games-gaza-burns-2917672?ico=more_from_this_author",
        "title": "As our infantile MPs play political games, Gaza burns",
        "description": "That seemed strong enough to keep Labour MPs onside while allowing them to abstain on the SNP motion. <b>Rishi Sunak</b> then threw a spanner in the works by tabling his own Government amendment, which proposed an “immediate humanitarian pause” while backing ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-68363202",
        "title": "King &#39;reduced to tears&#39; by cancer support messages sent to him",
        "description": "He was meeting Prime Minister <b>Rishi Sunak</b>, who said: &quot;Wonderful to see you looking so well.&quot; &quot;It&#39;s all done by mirrors,&quot; the King joked, lightening the mood. The King told Mr <b>Sunak</b> that he had been very moved by all the cards and good wishes that had been ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/21/rishi-sunak-latest-news-atkins-labour-snp-gaza/?utmsource=email",
        "title": "More than 30 MPs sign no confidence motion against Lindsay Hoyle",
        "description": "The SNP will trigger a vote this afternoon calling for an “immediate ceasefire” in the Israel-Hamas conflict. But a Labour amendment calling for an “immediate humanitarian ceasefire” that must be observed by “all sides” has been selected by Sir Lindsay Hoyle, the Commons Speaker."
    },
    {
        "url": "https://www.huffpost.com/entry/king-charles-cancer-support-reduced-tears_n_65d64857e4b0cc1f2f7a78d6",
        "title": "King Charles Says Public Support Following Cancer Diagnosis &#39;Reduced Me To Tears&#39;",
        "description": "“I’ve had so many messages and cards,” the monarch said about his well-wishers during his first meeting with Prime Minister <b>Rishi Sunak</b> this year, which took place at Buckingham Palace. “They’ve reduced me to tears, most of them,” the king ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68357074.amp",
        "title": "Sarah Munby: Top civil servant hits out in Post Office compensation row",
        "description": "Henry Staunton, who was sacked last month, said the comment was made by a senior civil servant during a meeting last year. It comes amid an escalating row over his previous claim he was told to delay Horizon compensation payments for sub-postmasters. This has been rejected by ministers."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-68364476",
        "title": "King Charles seen meeting PM <b>Rishi Sunak</b> after cancer diagnosis",
        "description": "Video shows King Charles&#39;s first meeting with <b>Rishi Sunak</b> since revealing his cancer diagnosis. The prime minister commented on how well the King looked, when meeting him at Buckingham Palace for an audience on Wednesday afternoon. The pair discussed the ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24135732.analysis-gaza-ceasefire-scrap-politics-worst/?ref=rss",
        "title": "Analysis: Gaza ceasefire scrap is politics at its worst",
        "description": "The party is likely to be grappling with Mr Yousaf’s party across many central belt Westminster seats when <b>Rishi Sunak</b> does finally call the general election. As well as placating potential Labour voters in the north of England, Sir Keir is also ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/king-charles-reduced-tears-messages-since-cancer-diagnosis-20321435/?ico=trending-module_tag_royal-family_item-0",
        "title": "King Charles pictured back at work for the first time since cancer diagnosis",
        "description": "King Charles met with <b>Rishi Sunak</b> during his weekly audience at Buckingham Palace (Picture: PA) The King has been pictured back at work for the first time since his cancer diagnosis. He shook hands with <b>Rishi Sunak</b> for their weekly audience together at ..."
    },
    {
        "url": "https://www.instyle.com/king-charles-vulnerable-moment-cancer-diagnosis-response-8598215",
        "title": "King Charles Had a Rare Vulnerable Moment When Speaking About the Response to His Cancer Diagnosis",
        "description": "On Wednesday, Charles returned to his royal duties during a meeting with U.K. Prime Minister <b>Rishi Sunak</b> at Buckingham Palace, their first in-person one since Charles&#39;s diagnosis was revealed. During the visit, <b>Sunak</b> told Charles it was &quot;wonderful&quot; to see ..."
    },
    {
        "url": "https://uk.news.yahoo.com/watch-king-charles-meets-sunak-202208105.html",
        "title": "Watch: King Charles meets <b>Sunak</b> for first time since cancer diagnosis",
        "description": "King Charles III and <b>Rishi Sunak</b> met in person for their first audience since His Majesty&#39;s cancer diagnosis on Wednesday, 21 February.Source: PA"
    },
    {
        "url": "https://uk.news.yahoo.com/king-holds-first-audience-pm-184946183.html",
        "title": "King holds first audience with PM since cancer revealed",
        "description": "The King has held his first face-to-face official duties – an audience with Prime Minister <b>Rishi Sunak</b> and a Privy Council – since being diagnosed with cancer. Charles met Mr <b>Sunak</b> at Buckingham Palace late on Wednesday afternoon, marking the restart ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/king-charles-reduced-tears-over-183435898.html",
        "title": "King Charles Says He Has Been &#39;Reduced to Tears&#39; Over Response to His Cancer Diagnosis in Vulnerable Moment",
        "description": "The King held his first in-person meeting with Prime Minister <b>Rishi Sunak</b> after working behind the scenes in recent weeks since sharing his cancer diagnosis The Royal Family/ X Prime Minister <b>Rishi Sunak</b> and King Charles meet at Buckingham Palace on Feb ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/king-charles-holds-first-person-205400884.html",
        "title": "King Charles Holds First In-Person Meeting with Prime Minister <b>Rishi Sunak</b> Since Cancer Diagnosis",
        "description": "For the first time since his cancer diagnosis was revealed, King Charles met in person with UK Prime Minister <b>Rishi Sunak</b> today. The audience was held at Buckingham Palace, and was the first in person audience that the King and <b>Sunak</b> had this year."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?page=with:block-65d649908f08aff1ffae2bf3&filterKeyEvents=false",
        "title": "Labour amendment calling for immediate Gaza ceasefire passes after government and SNP walkout – UK politics live",
        "description": "The current situation in the Commons remains extremely chaotic and unedifying. The King has held his first face-to-face official duties – an audience with prime minister <b>Rishi Sunak</b> and a Privy Council – since being diagnosed with cancer."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-post-office-cameron-government-horizon-b1140612.html",
        "title": "PM ignores calls to repeat ‘lying’ allegation aimed at ex-Post Office chairman",
        "description": "<b>Rishi Sunak</b> has sidestepped calls to repeat Business Secretary Kemi Badenoch’s claims that the former Post Office chairman was lying in the row over Horizon compensation payments. Labour leader Sir Keir Starmer pressed the Prime Minister in the Commons ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-keir-starmer-quotes-south-28679995",
        "title": "Sir Keir Starmer quotes South Tyneside postmaster in calling for greater transparency surrounding Post Office scandal",
        "description": "The Labour leader asked Prime Minister <b>Rishi Sunak</b> if he would give postmasters &quot;the peace of mind they need&quot; by releasing correspondence between the Post Office, the Department for Business, Energy and Industrial Strategy (BEIS), and the UK Government ..."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24135714.king-moved-tears-get-well-messages-pm-says-country-behind-you/",
        "title": "King moved to tears by get well messages as PM says ‘country is behind you’",
        "description": "The King revealed he has been reduced to tears by the messages and cards of support he has received since his cancer diagnosis, as Prime Minister <b>Rishi Sunak</b> told him the “country is behind you”. Charles carried out his first face-to-face official ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/king-charles-says-brought-tears-28679857",
        "title": "King Charles says he was &#39;brought to tears&#39; during first audience since cancer diagnosis",
        "description": "The King admitted he was &#39;brought to tears&#39; during his first face-to-face audience with the Prime Minister since his shock cancer diagnosis. King Charles met with <b>Rishi Sunak</b> at Buckingham Palace this afternoon. During the meeting, the monarch confessed that the outpouring of well-wishes from the public since he announced his health battle &#39;brings me to tears&#39;."
    },
    {
        "url": "https://www.bournemouthecho.co.uk/news/national/uk-today/24135682.king-charles-back-work-first-time-since-cancer-diagnosis/",
        "title": "King Charles back at work for first time since cancer diagnosis",
        "description": "The 75-year-old met with Prime Minister <b>Rishi Sunak</b> and a Privy Council on Wednesday afternoon (February 21) at Buckingham Palace, marking the restart of their weekly encounters to discuss matters of government. Charles, who was wearing a suit and tie ..."
    },
    {
        "url": "https://www.channel4.com/news/sunak-refuses-to-repeat-badenochs-claims-in-post-office-lying-row",
        "title": "<b>Sunak</b> refuses to repeat Badenoch’s claims in Post Office ‘lying’ row",
        "description": "Then at PMQs, <b>Rishi Sunak</b> sidestepped calls to repeat his Business Secretary’s allegations that Mr Staunton was lying, but the former chairman has been called to give evidence to MPs next week."
    },
    {
        "url": "https://www.thesun.co.uk/motors/26097513/motorists-ripped-off-jeremy-hunt-howard-cox/",
        "title": "Motorists are still being ripped off at the petrol pump – the Chancellor must cut duty to get the economy going",
        "description": "<b>Rishi Sunak</b> is always saying we must lead the world on various political issues. So why not lead the way on having the lowest driving tax economy? Of course, no Chancellor will have the cajónes to make such a sizeable reduction because of emotive ill ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/26/boris-johnson-british-army-fight-uk-russia-war/?s=09",
        "title": "‘Of course I jolly well would’: Boris Johnson pledges to join Army to fight Russia if needed",
        "description": "He said the Government would need to “train and equip” a citizen army, which forced <b>Rishi Sunak</b> to reject the idea and insist there would be no conscription of the public. However, in his column for Mail Plus, Mr Johnson insisted he supported Gen Sir ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/post-office-cameron-government-horizon-prime-minister-b2499921.html",
        "title": "PM ignores calls to repeat ‘lying’ allegation aimed at ex-Post Office chairman",
        "description": "Labour leader Sir Keir Starmer called for an investigation into claims the Government wanted to stall Horizon compensation payments."
    }
]