[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h47f7b",
        "title": "The Post Office Scandal: Justice Delivered?",
        "description": "James and Chris talks Rebecca Thomson, the journalist who first broke the story back in 2009. Alicia Kearns, chair of the Foreign Affairs Select Committee is also on, after having grilled Lord Cameron, the foreign secretary, over the UK’s approach to the war in the middle east, as well as military support for Ukraine."
    },
    {
        "url": "https://inews.co.uk/news/politics/pressure-sunak-sanction-fujitsu-post-office-scandal-2847932?ico=above_article_ticker",
        "title": "Pressure on <b>Sunak</b> to sanction Fujitsu over Post Office scandal",
        "description": "Pressure is mounting on Rishi Sunak to ban Fujitsu from securing future government contracts and for the Japanese giant to compensate victims of the Post Office scandal."
    },
    {
        "url": "https://www.channel4.com/news/rishi-sunak-facing-tory-rebellion-over-rwanda-bill",
        "title": "<b>Rishi Sunak</b> facing Tory rebellion over Rwanda bill",
        "description": "Rishi Sunak is facing renewed pressure from both sides of his party, as MPs threaten to rebel when the Rwanda bill is voted on next week. Tories on the right of the party want the bill to get tougher to severely limit rights to appeal against deportation, but that would infuriate One Nation Tories who fear breaking international law."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/scottish-horizon-victims-to-be-exonerated-first-minister-says-97261/",
        "title": "Scottish Horizon victims to be exonerated, First Minister says",
        "description": "Humza Yousaf has written to the Prime Minister about the efficacy of a UK-wide approach to overturning the criminal convictions of those affected."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24040315.rishi-sunak-probed-commons-private-jet-expenses-wifes-company/",
        "title": "<b>Rishi Sunak</b> probed in Commons over private jet expenses and wife’s company",
        "description": "Mr Sunak was also probed about his declaration of private jet travel expenses, and his relationship with the businessman who provided the donation."
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-flights-must-start-sunak-quell-tory-war-win-election-2847827?ico=more_from_this_author",
        "title": "Rwanda flights must start for <b>Sunak</b> to quell Tory war and win election",
        "description": "Despite one febrile week in December when it looked like Conservative right-wingers could once again bring down a Prime Minister, <b>Rishi Sunak</b> looks like he will be able to pass his controversial Rwanda laws without too much hassle next week. Right-wing ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/trump-got-a-secret-lurking-eastern-bloc-20087642/?ico=trending-module_category_world_item-5",
        "title": "Trump has a secret lurking in the Eastern Bloc",
        "description": "In the Balkans, the voice of superpowers like the US counts for a lot. <b>Rishi Sunak</b> (left) welcomes the Albanian PM Edi Rama to 10 Downing Street (Picture: PA) With Kosovo seeking to gain greater international recognition – including from neighboring ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/post-office-scandal-eurovision-tv-shows-sparked-a-revolution-20093855/?ico=more_text_links",
        "title": "From Mr Bates to Eurovision: When TV shows sparked a revolution",
        "description": "The ITV drama of one of the biggest miscarriages of justice in UK history has sparked new legislation (Picture: ITV/REX/Shutterstock) ITV drama Mr Bates vs The Post Office has taken the country by storm, and launched one of the biggest miscarriages of ..."
    },
    {
        "url": "https://uk.news.yahoo.com/post-office-scandal-key-questions-195347644.html",
        "title": "The Post Office scandal: Key questions around plan to quash convictions",
        "description": "A look at the key questions about the Post Office scandal, after <b>Rishi Sunak</b> announced plans for new legislation to clear the names of subpostmasters wrongfully convicted because of faulty accounting software."
    },
    {
        "url": "https://www.heraldscotland.com/news/24040063.rishi-sunak-brands-scotland-high-tax-capital-uk-snp/?ref=rss",
        "title": "<b>Rishi Sunak</b> brands Scotland &#39;high tax capital&#39; of UK under SNP",
        "description": "Rishi Sunak has branded Scotland “the high tax capital of the United Kingdom” as he accused the SNP of going in the opposite direction to"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-accuses-snp-politicising-124902965.html",
        "title": "<b>Rishi Sunak</b> accuses SNP of &#39;politicising&#39; Post Office Horizon scandal",
        "description": "<b>RISHI Sunak</b> has accused the SNP of “politicising” the Post Office Horizon scandal. It comes after Stephen Flynn grilled <b>Rishi Sunak</b> on the scandal, in which more than 700 Post Office managers from across the UK were convicted due to faulty software."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/10/keir-starmer-tory-traps-labour-conservative",
        "title": "Keir Starmer dodging Tory traps is a sign of good judgment, not timidity",
        "description": "The exceptional quality of Blair’s record is the straw at which <b>Rishi Sunak</b> clutches in hope of averting electoral catastrophe. Downing Street has a new plan for 2024. The template is April 1992, when a beleaguered John Major beat Neil Kinnock in ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/humza-yousaf-rishi-sunak-government-prime-minister-first-minister-b1131561.html",
        "title": "Scottish Horizon victims to be exonerated, First Minister says",
        "description": "Humza Yousaf has written to the Prime Minister about the efficacy of a UK-wide approach to overturning the criminal convictions of those affected."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-gary-lineker-challenged-to-run-against-tory-mp-in-stoke-on-trent-north-12593360",
        "title": "Politics latest: Gary Lineker challenged to run against Tory MP in Stoke-on-Trent North",
        "description": "After <b>Rishi Sunak</b> announced legislation to exonerate victims of the Post Office scandal, the postal affairs minister tells Politics Hub with Sophy Ridge the government does have concerns about the move. Also on the show, a Tory MP lays down the gauntlet to ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/10/rishi-sunak-rwanda-bill-deportation-international-law/",
        "title": "<b>Sunak</b> faces party split over Rwanda as Left-wing Conservatives seek to water down Bill",
        "description": "<b>Rishi Sunak</b> faces a new party split over his Rwanda Bill as centrist MPs prepare amendments to limit what they claim are potential breaches of international law. Sir Robert Buckland, a former justice secretary, is working on new amendments that would ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/ministers-move-to-quash-scottish-post-office-scandal-victim-338491/",
        "title": "Ministers move to quash Scottish Post Office scandal victim convictions",
        "description": "First Minister Humza Yousaf has written to Prime Minister Rishi Sunak to exonerate those wrongly convicted of criminal offences under Scottish Law."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/ex-postmistress-jailed-horizon-scandal-moves-host-tears-20096125/?ico=mosaic_uk",
        "title": "Ex-postmistress who was jailed in Horizon scandal moves Nicky Campbell to tears",
        "description": "A sub-postmistress who was jailed after the Horizon scandal has revealed her story on BBC Radio 5 for the first time. Karen Jolliffe, 77, told Nicky Campbell about her ‘nightmare’ time in prison, after being inspired by ‘brave’ ex-Post Office staff."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/national/24040432.horizon-scandal-subpostmasters-names-cleared-end-year/",
        "title": "Horizon scandal subpostmasters could have names cleared by end of year",
        "description": "Prime Minister Rishi Sunak said they were victims of ‘one of the greatest miscarriages of justice in our nation’s history’."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-67938713?at_campaign=KARANGA&at_medium=RSS",
        "title": "Post Office scandal: Jailed postmaster unconvinced by plan",
        "description": "A former sub-postmaster jailed in the Post Office scandal says he is not convinced by <b>Rishi Sunak</b>&#39;s latest plan. Noel Thomas, 77, from Anglesey, was locked up for false accounting in 2006 after his books fell short by £48,000. Upon hearing that new ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-trying-fundamentally-change-31852497.amp",
        "title": "<b>Rishi Sunak</b> trying to &#39;fundamentally change reality&#39; with Rwanda &#39;fiction&#39;, MPs told",
        "description": "Tyrone Steele, interim legal director at law charity Justice, said <b>Rishi Sunak</b>&#39;s Safety of Rwanda Bill &quot;has tried to fundamentally change reality&quot; - amid warnings it won&#39;t tackle a huge asylum backlog <b>Rishi Sunak</b> has been accused of trying to push through ..."
    },
    {
        "url": "https://news.sky.com/story/suella-braverman-criticised-by-her-own-review-into-woke-policing-13045485",
        "title": "Suella Braverman criticised by her own review into &#39;woke&#39; policing",
        "description": "A row broke out last year over the influence of politicians on the police after Mrs Braverman and <b>Rishi Sunak</b> were involved in a stand-off with Britain&#39;s most senior officer over whether to ban pro-Palestinian protests in London on Remembrance weekend."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/10/rishi-sunak-latest-news-post-office-hollinrake-horizon/?utmsource=email",
        "title": "Politics latest news: <b>Sunak</b> &#39;taken hostage&#39; by Tory MPs over Rwanda plan, claims Starmer",
        "description": "Cost of London to Birmingham HS2 leg ‘up by £10bn’ Sir Keir Starmer claimed <b>Rishi Sunak</b> had been “taken hostage” by Tory MPs over his flagship Rwanda plan. The Rwanda Bill will return to the House of Commons on Tuesday and Wednesday next week ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24040315.rishi-sunak-probed-commons-private-jet-expenses-wifes-company/",
        "title": "<b>Rishi Sunak</b> probed in Commons over private jet expenses and wife’s company",
        "description": "Mr Sunak was also probed about his declaration of private jet travel expenses, and his relationship with the businessman who provided the donation."
    },
    {
        "url": "https://www.channel4.com/news/sunak-announces-blanket-exoneration-for-wrongly-convicted-in-post-office-scandal",
        "title": "<b>Sunak</b> announces blanket exoneration for wrongly convicted in Post Office scandal",
        "description": "<b>Rishi Sunak</b> told MPs that the scandal caused by the faulty Horizon IT system is “one of the greatest miscarriages of justice” in the nation’s history. The Government acknowledged it is controversial to use Parliament to override the verdicts of ..."
    }
]