[
    {
        "url": "https://www.mirror.co.uk/news/politics/sick-date-rape-joke-proof-31741786",
        "title": "&#39;Sick date-rape joke is proof Home Secretary James Cleverly has to go&#39;",
        "description": "The Sunday Mirror says James Cleverly should know better after it was revealed the Home Secretary made a &#39;joke&#39; about giving Rohypnol to his wife"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12897365/Boost-Rishi-Sunak-increases-hopes-tax-cuts.html",
        "title": "Boost for <b>Rishi Sunak</b> as &#39;Santa rally&#39; increases hopes of tax cuts in Spring Budget providing dose of optimism for struggling families",
        "description": "Rising share values are a signal of optimism on markets and will bring a dose of Christmas cheer to millions of British savers - including those with pension plans - and business leaders."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/23/lord-cameron-insists-play-no-role-telegraph-sale-uae/",
        "title": "Cameron insists he will play no role in review of UAE-backed Telegraph takeover",
        "description": "Foreign Secretary says review of a takeover involving Abu Dhabi is entirely a matter for Lucy Frazer, the Culture Secretary"
    },
    {
        "url": "https://www.thetimes.co.uk/podcasts/stories-of-our-times?trk=public_post_comment-text",
        "title": "Stories of our times",
        "description": "There he encounters a young woman from the streets,... This weekend, <b>Rishi Sunak</b> was in Rome meeting Italy&#39;s prime minister Giorgia Meloni. As well as being a fan of the British PM, she&#39;s also a devotee of one of the UK&#39;s most famous writers - author of ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/cameron-warns-of-destructive-potential-of-small-boats-issue-34WJ7WW4VBMG7MF5Y66HWSUQCM/",
        "title": "Cameron warns of ‘destructive’ potential of small boats issue",
        "description": "In a Telegraph interview, Lord Cameron suggested the Foreign Office could do more to support <b>Rishi Sunak</b>’s promise to “stop the boats”. South Korean President state visit to the UK Lord Cameron backed <b>Rishi Sunak</b>’s drive to ‘stop the boats’ He ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/james-cleverly-joked-giving-wife-31741719?trk=public_post_comment-text",
        "title": "James Cleverly joked about giving wife date-rape drug after announcing new spiking law",
        "description": "Now angry campaigners – battling a crime they described as an epidemic in a parliamentary inquiry last year – are calling on <b>Rishi Sunak</b> to investigate his Cabinet minister’s behaviour. Colin Mackie, chair of Spike Aware UK, who lost a child through ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-accused-of-weakness-by-tory-mps-over-immigration-climbdown_uk_65867b57e4b04da9842720d5?d_id=7108122&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b> Accused Of &#39;Weakness&#39; By Tory MPs Over Immigration Climbdown",
        "description": "Rishi Sunak has been accused of “weakness” as he faced an angry Tory backlash over his latest climbdown. The prime minister confirmed that visa changes designed to reduce immigration have been delayed by a year until 2025."
    },
    {
        "url": "https://www.standard.co.uk/news/health/nhs-england-england-government-matthew-taylor-british-medical-association-b1128893.html",
        "title": "NHS England boss ‘fearful’ for patients during junior doctor strikes",
        "description": "Prime Minister <b>Rishi Sunak</b> branded the action “disappointing” and urged junior doctors to call off strikes. The next strike will begin at 7am on January 3 and end at 7am on January 9. It will be the longest strike in the 75-year history of the NHS."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153667/sun-says-keir-starmer-green-pledge/",
        "title": "Sneaky Sir Keir Starmer cannot be allowed to pull the wool over the eyes of voters",
        "description": "Keir must not fool voters on eco plans SLIPPERY Sir Keir Starmer is quietly trying to wriggle out of his reckless £28 billion eco splurge. The Labour leader is now plotting behind the scenes to"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-foreign-secretary-foreign-office-rwanda-mps-b1128890.html",
        "title": "Cameron warns of ‘destructive’ potential of small boats issue",
        "description": "Lord Cameron said tackling the problem was important to protect the UK’s immigration system and people’s trust in politics."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153369/conservatives-unite-taxes-win-general-election/",
        "title": "Warring Conservatives must unite and cut taxes if they want to have a shot at winning general election, poll suggests",
        "description": "WARRING Tories must unite and cut taxes to have a shot at winning next year’s general election, an exclusive poll for The Sun on Sunday suggests. Many people also believe immigration — currently"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/governments-legal-bill-defend-stalling-31742106",
        "title": "Government&#39;s legal bill to defend stalling Rwanda migrant scheme tops £2million",
        "description": "Not a single migrant has been sent to east African nation under a controversial Tory scheme, but the Government&#39;s legal bill for defending it against court challenges has ballooned"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/23/sunak-delayed-migration-crackdown-obr-tax-cuts/",
        "title": "<b>Sunak</b> delayed migration crackdown amid fears OBR would slash tax-cutting headroom",
        "description": "PM was considering announcing measures restricting arrival of foreign workers in the autumn, but waited until December"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848742/rishi-sunak-uk-visa-rules-tory-criticism",
        "title": "<b>Rishi Sunak</b> defends visa clampdown delay after Tory criticism",
        "description": "The Prime Minister restated his intention to implement stricter UK visa rules for overseas family members, despite facing criticism from within the Tory party."
    },
    {
        "url": "https://uk.news.yahoo.com/tory-donor-paid-rishi-sunak-134036171.html",
        "title": "Tory donor who paid for <b>Rishi Sunak</b>’s private jet faces legal challenge over business dealings",
        "description": "Entrepreneur Akhil Tripathi, who made his fortune inventing an anti-snoring device, has donated more than £150,000 to the Conservative Party since 2021"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848736/dyson-rishi-sunak-liz-truss",
        "title": "James Dyson praises Liz Truss in stinging swipe at <b>Rishi Sunak</b> as UK on brink of recession",
        "description": "Recent stats show the UK economy shrank in the last quarter, painting a damning image of Mr Sunak&#39;s current economic strategy."
    },
    {
        "url": "https://www.independent.co.uk/travel/news-and-advice/rail-train-cancellations-fare-rise-b2468785.html",
        "title": "Rail is on track for managed decline, with fare rises only part of the problem",
        "description": "On the east coast mainline, which connects London King’s Cross with Yorkshire, northeast England and Scotland, LNER cancelled and curtailed a number of trains on Saturday, again because of crew shortages. This was particularly significant because King’s Cross station is closed on Christmas Eve due to engineering work."
    },
    {
        "url": "https://uk.news.yahoo.com/james-dyson-accuses-rishi-sunak-101227200.html",
        "title": "James Dyson accuses <b>Rishi Sunak</b> of not ‘going for growth’ as UK at risk of recession",
        "description": "Sir James Dyson has lashed out at Rishi Sunak and Jeremy Hunt, accusing the government of not “ going for growth ”. The billionaire inventor said wealth generation and growth have become “dirty words” under the prime minister and chancellor’s leadership."
    },
    {
        "url": "https://www.theguardian.com/technology/2023/dec/23/james-dyson-criticises-tories-for-not-going-for-growth-after-fall-in-gdp?ref=biztoc.com",
        "title": "James Dyson criticises Tories for not ‘going for growth’ after fall in GDP",
        "description": "The remarks come after the latest economic assessment revealed gross domestic product (GDP) fell by 0.1% in the third quarter, rather than the previous estimate of no growth, dealing a blow to the prime minister, <b>Rishi Sunak</b>, who had pledged economic ..."
    },
    {
        "url": "https://www.ft.com/content/aad0afd4-57cf-4d34-ae42-7397354600de?shareType=nongift",
        "title": "How migration is pushing Europe to the right",
        "description": "Italy’s Giorgia Meloni welcomes her UK counterpart <b>Rishi Sunak</b> and Albania’s Edi Rama in Rome at the weekend. The leader of the Brothers of Italy was elected last year after promising tough measures to curb the flow of migrants from across the ..."
    },
    {
        "url": "https://www.ft.com/content/c3ea19ff-537b-4708-865e-8d2a1ec58051?sharetype=gift",
        "title": "UK to introduce carbon levy on imports by 2027",
        "description": "Jess Ralston, head of energy at the Energy and Climate Intelligence Unit, said the UK scheme made sense given the EU was pressing ahead and said it sent a more positive message in the wake of UK Prime Minister <b>Rishi Sunak</b>’s decision earlier this year to ..."
    }
]