[
    {
        "url": "https://www.standard.co.uk/news/politics/ukraine-david-cameron-kyiv-prime-minister-russian-b1129987.html",
        "title": "UK continues to ‘stand steadfastly’ by Ukraine’s side in 2024, PM tells Zelensky",
        "description": "The UK has committed £4.6 billion of military spending towards Ukraine’s defence against the Russian invasion since 2022."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24023861.ministers-accused-playing-fast-loose-migration-backlog-figures/",
        "title": "Ministers accused of ‘playing fast and loose’ with migration backlog figures",
        "description": "The Government was warned that the public ‘will not be fooled by smoke and mirrors’ over asylum processing claims."
    },
    {
        "url": "https://www.express.co.uk/finance/personalfinance/1851098/Prime-Minister-Rishi-Sunak-win-general-election-2024-Labour-Keir-Starmer-polling-day",
        "title": "Don’t write off <b>Sunak</b> yet – these 5 things that could actually go right for him this year",
        "description": "Everybody assumes that Prime Minister Rishi Sunak will be naming the date of his political demise when he calls a general election this year, but that&#39;s lazy thinking. Events are moving in his favour,"
    },
    {
        "url": "https://thetab.com/uk/2024/01/02/rishi-sunak-boasting-new-international-student-visa-rules-343902",
        "title": "<b>Rishi Sunak</b> called ‘evil’ for boasting about new changes to international student visa rules",
        "description": "So, Prime Minister Rishi Sunak has decided to kick off 2024 by boasting about “delivering” for the British people by effectively splitting up families of international students and people are rightfully livid about it."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-asylum-small-boats-pledge-misleading-2832884?ico=most_popular",
        "title": "Why <b>Sunak</b>’s claim he has met small boats pledge has been branded misleading",
        "description": "Rishi Sunak has faced accusations he has been &#39;misleading&#39; and &#39;false&#39; over claims the legacy asylum backlog has been cleared"
    },
    {
        "url": "https://www.thenational.scot/news/24021480.critics-hit-rishi-sunak-claims-asylum-backlog-cleared/",
        "title": "Critics hit out as <b>Rishi Sunak</b> claims asylum backlog is cleared",
        "description": "CRITICS have hit out as Rishi Sunak credited “relentless action” after the UK Government announced it met a target to clear a backlog of"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/02/in-pictures-another-turbulent-12-months-in-uk-politics/",
        "title": "In Pictures: Another turbulent 12 months in UK politics",
        "description": "Rishi Sunak is still standing after his first full year as Prime Minister but things have been far from plain sailing for the Conservative government."
    },
    {
        "url": "https://uk.news.yahoo.com/tories-insist-rishi-sunak-steep-120713093.html",
        "title": "Tories insist <b>Rishi Sunak</b> has ‘steep and narrow’ path to victory despite lagging in polls",
        "description": "In an end-of-year analysis, Tory peer Lord Barwell, a former Croydon MP who was Theresa May’s chief-of-staff, argued: “The Conservative brand is too damaged for them to win the next election, but right now the alternative is not getting the scrutiny it should be getting because of the continuing Conservative soap opera over Rwanda et al."
    },
    {
        "url": "https://www.thesun.co.uk/news/25217605/rishi-sunak-small-boats-asylum-cases-crossings/",
        "title": "<b>Rishi Sunak</b> kicks off year claiming double-win on small boats – with backlog of asylum cases cleared &amp; crossings down",
        "description": "RISHI Sunak last night kicked off a do-or-die election year claiming a double-win on small boats. The PM revealed the groaning backlog of 92,000 legacy asylum cases had finally been cleared. And"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-under-fire-over-075703711.html",
        "title": "<b>Rishi Sunak</b> under fire over ‘misleading’ claim to have cleared asylum backlog",
        "description": "Rishi Sunak’s claim to have met a pledge to clear the backlog of so-called legacy asylum claims has been branded misleading as thousands are still awaiting a decision. The prime minister credited “relentless action” as the government announced on Monday that it had met a target to clear a backlog of asylum claims."
    },
    {
        "url": "https://www.standard.co.uk/comment/rishi-sunak-may-november-general-election-ready-b1129948.html",
        "title": "The Standard View: <b>Rishi Sunak</b> is getting ready for his ballot-box battle",
        "description": "Convincing the public after the economic mayhem of the Liz Truss era and at a time when the tax burden is still forecast to rise to the highest levels since the Fifties won’t be easy, but if he wants to win, <b>Sunak</b> will have to make people believe that ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/government-home-office-prime-minister-yvette-cooper-stephen-kinnock-b1129981.html",
        "title": "Ministers accused of ‘playing fast and loose’ with migration backlog figures",
        "description": "The Government was warned that the public ‘will not be fooled by smoke and mirrors’ over asylum processing claims."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/around-16-million-low-paid-31789106",
        "title": "Around 1.6 million low-paid workers set to bear brunt of Tory stealth taxes",
        "description": "Labour&#39;s analysis says by 2024-2025 a family with two adults working full time on the National Living Wage will pay £1,320 more a year due to Tory stealth taxes"
    },
    {
        "url": "https://www.opendemocracy.net/en/general-election-manifesto-pledges-conservatives-40-hospitals-rishi-sunak/",
        "title": "Will the Tories meet their 2019 manifesto pledges?",
        "description": "As we approach a 2024 general election in the UK, it is <b>Rishi Sunak</b>, not Boris Johnson, who will be held accountable for any broken promises. The government is likely to fail on this manifesto pledge – even after cutting back its target from 40 to 32 ..."
    },
    {
        "url": "https://www.thesun.co.uk/money/25229643/petrol-prices-rise-houthi-attacks-red-sea-shipping/",
        "title": "Petrol prices set to rise amid rebel attacks on Red Sea shipping",
        "description": "PETROL prices are set to rise amid attacks on Red Sea shipping. Oil costs, which dictate prices at the pumps, shot up yesterday as Middle East tensions increased. A barrel of Brent Crude rose by"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/lib-dems-aim-to-unseat-jeremy-hunt-and-michael-gove-as-election-campaigning-begins_uk_65940b12e4b0912833ade62d",
        "title": "Lib Dems Aim To Unseat Jeremy Hunt And Michael Gove As Election Campaign Begins",
        "description": "The Lib Dems will target the seats of Jeremy Hunt and Michael Gove at the next election as the party aims to tear down the “blue wall” at the general election. Lib Dem leader Ed Davey will campaign across marginal seats in Surrey - where both cabinet ministers have their seats - on Wednesday."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-income-tax-cut-tories-labour-economy-2834452?ico=more_from_this_author",
        "title": "<b>Sunak</b> draws up income tax cut plan",
        "description": "The Government is weighing up pre-election cuts to income tax as Rishi Sunak seeks to draw dividing lines with Labour on the economy. The Prime Minister will use his first public appearance of the year on Thursday to argue that he is cutting taxes on individuals – despite the overall tax burden heading for a record high."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12920515/ANDREW-NEIL-Putin-Xi-Kim-New-Year-threats-Wests-2024-year-despots.html",
        "title": "ANDREW NEIL: With Putin, Xi Jinping and Kim Jong Un issuing New Year threats, the West&#39;s woeful leadership crisis means 2024 could become the year of the despots",
        "description": "Even though there will be votes in over 60 countries, 2024 is more likely to be a year of crisis for democracy, which is in greater peril than at any time since the Cold War."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12920445/NHS-bosses-paid-300k-year-running-trusts-junior-doctors-strike.html",
        "title": "Revealed: The NHS fat cats pocketing up to £300,000 a year while running floundering trusts as the longest doctors&#39; strike in history begins",
        "description": "While the row over pay and conditions shows little sign of a conclusion, a Mail investigation found bosses of the 11 trusts with the longest referral waiting times all earn more than the Prime Minister."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/mortgageshome/article-12919587/Wood-panels-living-rooms-City-life-vogue-nine-trends-2024-house-prices.html?mrn_rm=rta",
        "title": "Wood panels in living rooms. City life back in vogue... nine trends for 2024 house prices",
        "description": "Bold interior trends, falling borrowing costs and new opportunities for first-time buyers will bring colour and life back into the property market in 2024."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-engulfed-row-over-135513230.html",
        "title": "<b>Rishi Sunak</b> engulfed by row over ‘false’ asylum statistics as 100,000 migrants still stuck in backlog",
        "description": "Labour accused the PM of ‘barefaced lie’ after figures showed 4,500 so-called legacy claims are still outstanding"
    },
    {
        "url": "https://www.armaghi.com/news/armagh-news/armaghs-own-willie-nugent-honoured-by-prime-minister-for-50-years-of-fundraising/231081",
        "title": "Armagh’s own Willie Nugent honoured by Prime Minister for 50 years of fundraising",
        "description": "Armagh stalwart Willie Nugent has been honoured with Prime Minister Rishi Sunak’s daily Points of Light award. Willie has been fundraising for 50 years"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/02/jimmy-dimly-lights-our-way-to-the-glorious-gospel-of-rish",
        "title": "Jimmy Dimly lights our way to the glorious gospel of Rish!",
        "description": "The home secretary, faithful apostle of an unerring PM, imparted new principles of truth for a new year to his doubtful listeners"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/02/channel-migrant-crossings-could-hit-35000-this-year/",
        "title": "Channel migrant crossings could hit 35,000 this year despite ‘stop the boats’ pledge",
        "description": "Channel migrant crossings are projected to rise to around 35,000 this year despite Rishi Sunak’s pledge to “stop the boats” by the next election, according to leaked Border Force documents."
    },
    {
        "url": "https://www.telegraph.co.uk/education-and-careers/2024/01/02/ampleforth-college-abuse-victims-yorkshire-vat-labour/",
        "title": "Ampleforth College headmaster: ‘We will not pass on Labour&#39;s VAT charge to parents’",
        "description": "Peter Roberts brought the school back from the brink after a sex abuse scandal – but says its past cannot be forgotten"
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/02/japan-earthquakes-tsunami-alert-dropped-but-residents-told-not-to-return-to-homes",
        "title": "Japan earthquakes: ‘battle against time’ to find those trapped under rubble as death toll rises",
        "description": "The quakes, the largest of which had a magnitude of 7.6, started a fire and collapsed buildings on the west coast of Japan’s main island, Honshu"
    }
]