[
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/national/24026490.sunak-faces-calls-act-pledge-cut-waiting-lists-strike-action-continues/",
        "title": "<b>Sunak</b> faces calls to act on pledge to cut waiting lists as strike action continues",
        "description": "Millions of people stuck on the waiting lists are “getting sicker while waiting” and the situation is causing them “anxiety and uncertainty, according to presenter Stephen Fry, comedian Jo Brand, former NHS doctor and comedian Adam Kay and poet Michael Rosen."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24026488.electric-vehicles-hit-one-million-mark-month/",
        "title": "Electric vehicles to hit one million mark this month",
        "description": "The number of pure battery electric vehicles (EVs) on UK roads is expected to hit one million this month, according to new analysis. More than 967,000 of the vehicles were licensed at the end of November, the RAC Foundation said. That is up from 674,000 at the end of 2022."
    },
    {
        "url": "https://www.thesun.co.uk/news/25241463/rishi-sunak-launch-defence-five-pledges-voters-keep-faith/",
        "title": "<b>Rishi Sunak</b> to launch full-throated defence of his five pledges and beg voters to keep the faith",
        "description": "RISHI Sunak will today launch a full-throated defence of his five pledges and beg voters to keep the faith. The PM will claim “great progress” has been made on the one-year anniversary of his"
    },
    {
        "url": "https://www.thenational.scot/news/24025308.report-reveals-rishi-sunaks-five-key-pledges-met/",
        "title": "Report reveals if <b>Rishi Sunak</b>’s five key pledges have been met",
        "description": "RISHI Sunak is failing to deliver on most of the five key pledges he made a year ago which he said his government should be judged on, a report says."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/times-tetchy-rishi-sunak-lost-31719623",
        "title": "All the times tetchy <b>Rishi Sunak</b> lost his cool when forced to defend his record",
        "description": "Despite his best efforts, Rishi Sunak has started to develop an unfortunate reputation for being thin-skinned and tetchy when grilled over Government failings"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67876860.amp",
        "title": "Statistics watchdog to examine government asylum backlog claims",
        "description": "<b>Rishi Sunak</b> has claimed in a tweet to have cleared &quot;the backlog of asylum decisions&quot; The UK&#39;s statistics watchdog is looking into the government&#39;s claims to have cleared the asylum backlog. On Tuesday, the Home Office said it had fulfilled a pledge to ..."
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/national/24026490.sunak-faces-calls-act-pledge-cut-waiting-lists-strike-action-continues/",
        "title": "<b>Sunak</b> faces calls to act on pledge to cut waiting lists as strike action continues",
        "description": "Millions of people stuck on the waiting lists are “getting sicker while waiting” and the situation is causing them “anxiety and uncertainty, according to presenter Stephen Fry, comedian Jo Brand, former NHS doctor and comedian Adam Kay and poet Michael Rosen."
    }
]