[
    {
        "url": "https://news.sky.com/story/labours-latest-rishi-sunak-attack-ad-lands-on-tory-supporting-website-conservative-home-within-hours-13042566",
        "title": "Labour&#39;s latest <b>Rishi Sunak</b> attack ad lands on Tory-supporting website Conservative Home within hours",
        "description": "In its new ad to kick off the long campaign for the general election, Labour claims the prime minister&#39;s tax cuts constitute a &quot;raw deal&quot; for working people because of the impact of frozen tax thresholds."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/transport/plan-for-faster-train-from-sheffield-to-london-announced-4467861",
        "title": "Plan for &#39;faster&#39; train from Sheffield to London announced",
        "description": "People living in Sheffield have been told a “faster” train service to London could be launched next year. FirstGroup has announced its operator Hull Trains plans to run two return journeys to London King’s Cross, via Retford, Worksop and Woodhouse."
    },
    {
        "url": "https://www.messengernewspapers.co.uk/news/24030298.prime-minister-rishi-sunak-spotted-altrincham-market/",
        "title": "Prime Minister <b>Rishi Sunak</b> spotted at Altrincham Market",
        "description": "Mr Sunak was spotted with Conservative MP Sir Graham Brady and his prospective replacement, Oliver Carroll, on Friday."
    },
    {
        "url": "https://www.standard.co.uk/news/environment/england-met-office-environment-agency-oli-claydon-great-western-railway-b1130540.html",
        "title": "Environment Agency: More than 1,000 properties flooded across England",
        "description": "More than 1,000 properties across England have been flooded this week, with temperatures set to plummet at the weekend, the Environment Agency has said. Hundreds of flood warnings and alerts remained in place on Friday morning, with the UK Health Security Agency (UKHSA) issuing a cold weather alert from Saturday."
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042?ico=related_stories",
        "title": "The general election will be swayed by foreign policy – good news for <b>Sunak</b>",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-packs-audience-tories-31811898",
        "title": "<b>Rishi Sunak</b> packs audience with Tories despite vowing to meet as many voters as possible",
        "description": "As the election year opens, the PM was said to be launching a campaign to reach out to as many voters as possible to brag about the good things the Tories have done"
    },
    {
        "url": "https://www.borehamwoodtimes.co.uk/news/national/24030191.no-one-grow-poor-sunak-says-tory-mps-crap-parenting-remark/",
        "title": "No one should grow up poor, <b>Sunak</b> says after Tory MP’s ‘crap parenting’ remark",
        "description": "Bury North MP James Daly faced criticism over Christmas for suggesting most children who struggle in the town are ‘products of crap parents’."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/flooded-areas-should-be-reassured-at-response-says-sunak-107383/",
        "title": "Flooded areas should be ‘reassured’ at response, says <b>Sunak</b>",
        "description": "Rishi Sunak has insisted that local people should be “reassured” by the response to flooding, after parts of the country were submerged following heavy rain. It comes as opposition parties accused ministers of failing to take seriously the danger of flooding, with the Prime Minister urged to personally visit the affected areas."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rishi-sunak-greater-manchester-cafe-28395343",
        "title": "<b>Rishi Sunak</b> booed as he leaves Greater Manchester café",
        "description": "The Prime Minister is visiting Stockport in a trip to the region today, but several people shouted &#39;resign&#39; as he was leaving"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prison-cells-overcrowding-ministry-of-justice-b2468048.html",
        "title": "<b>Sunak</b> failing on pledge to tackle prison overcrowding as less than half of promised pop-up cells built",
        "description": "Rishi Sunak is failing to deliver on the government’s pledge to tackle prison overcrowding as less than half of the pop-up cells promised have been built so far - and they aren’t even suitable for dangerous prisoners, The Independent can reveal."
    },
    {
        "url": "https://www.itv.com/news/2024-01-04/rishi-sunak-working-towards-general-election-in-second-half-of-the-year",
        "title": "<b>Rishi Sunak</b> working towards general election in &#39;second half of the year&#39;",
        "description": "Labour has claimed that a spring vote is the &#39;worst kept secret in Parliament&#39; in a possible ploy to claim Mr Sunak has bottled it if he goes longer. | ITV National News"
    },
    {
        "url": "https://uk.news.yahoo.com/why-rishi-sunak-suggested-hes-190240049.html",
        "title": "Why Has <b>Rishi Sunak</b> Suggested He&#39;s Waiting Until Autumn For A General Election?",
        "description": "Under the Dissolution and Calling of Parliament Act 2022, a prime minister has the power to call an election earlier than the deadline – all voters would have to wait for is the 25 days between a PM making a “request” to the King to dissolve parliament (and as a constitutional monarch, the King Charles could not reject it) and polling day."
    },
    {
        "url": "https://www.heraldscotland.com/news/24028515.rishi-sunak-backing-corner-without-escape-dignity/?nid=2254",
        "title": "<b>Rishi Sunak</b> is backing into a corner without any escape or dignity",
        "description": "The upshot is that the PM manifestly does not look in control of events. Despite the repeal of the Fixed-term Parliaments Act giving him the power to name his own date, he has been backed into the second half of the year against his will."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/04/rishi-sunak-rules-out-may-general-election-prime-minister/?utmsource=email",
        "title": "<b>Sunak</b> appears to rule out May general election",
        "description": "PM’s ‘working assumption’ is for vote in second half of year, but Labour and Lib Dems accuse him of ‘squatting’ in Number 10"
    },
    {
        "url": "https://www.thesun.co.uk/news/25241463/rishi-sunak-launch-defence-five-pledges-voters-keep-faith/",
        "title": "<b>Rishi Sunak</b> to launch full-throated defence of his five pledges and beg voters to keep the faith",
        "description": "RISHI Sunak will today launch a full-throated defence of his five pledges and beg voters to keep the faith. The PM will claim “great progress” has been made on the one-year anniversary of his"
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/darts/luke-humphries-receives-backlash-gushing-31804122.amp",
        "title": "Luke Humphries receives backlash for gushing <b>Rishi Sunak</b> message after World Championship win",
        "description": "Luke Humphries has been criticised on social media after he thanked <b>Rishi Sunak</b> for acknowledging his World Darts Championship success. The 28-year-old kept up his sensational momentum at Alexandra Palace on Wednesday night as he halted teenage sensation ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/environment-agency-prime-minister-households-government-england-b1130571.html",
        "title": "Flooded areas should be ‘reassured’ at response, says <b>Sunak</b>",
        "description": "Rishi Sunak has insisted that local people should be “reassured” by the response to flooding, after parts of the country were submerged following heavy rain. It comes as opposition parties accused ministers of failing to take seriously the danger of flooding, with the Prime Minister urged to personally visit the affected areas."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/05/no-one-should-grow-up-poor-sunak-says-after-tory-mps-crap-parenting-remark/",
        "title": "No one should grow up poor, <b>Sunak</b> says after Tory MP’s ‘crap parenting’ remark",
        "description": "Bury North MP James Daly faced criticism over Christmas for suggesting most children who struggle in the town are ‘products of crap parents’."
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042?ico=best_of_opinion",
        "title": "The general election will be decided by foreign policy – good news for <b>Sunak</b>",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12930381/Rishi-Sunak-election-Samoa-Commonwealth-summit-campaign.html",
        "title": "<b>Rishi Sunak</b> could spend a chunk of general election campaign in SAMOA at Commonwealth summit if he sets the poll date for November",
        "description": "A November 14 election date would mean a potentially awkward clash with the Commonwealth Heads of Government summit - CHOGM."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-heckled-as-he-leaves-cafe-in-greater-manchester_uk_6598051de4b0912833afbac6",
        "title": "&#39;Boo, Resign&#39;: <b>Rishi Sunak</b> Heckled As He Leaves Cafe In Greater Manchester",
        "description": "Rishi Sunak has been booed, heckled and told to “resign” as he left a cafe in Stockport. The prime minister was meeting Conservative Party activists and members in the North West on Friday. In a video captured by the Manchester Evening News, Sunak was met with shouts of “boo”, “boo”, “leave now” and “resign”."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/05/latest-uk-politics-news-general-election-keir-starmer-rishi-sunak-labour-tories-live?filterKeyEvents=false&page=with:block-659803748f08640ae963a74d",
        "title": "<b>Rishi Sunak</b> refuses to criticise Tory MP who said struggling children in his town were ‘products of crap parents’ – UK politics live",
        "description": "Asked if he agreed with MP for Bury North’s comments, PM says it’s important children grow up in household where parents work"
    },
    {
        "url": "https://www.standard.co.uk/news/environment/england-met-office-environment-agency-oli-claydon-rishi-sunak-b1130540.html",
        "title": "Environment Agency: More than 1,000 properties flooded across England",
        "description": "More than 1,000 properties across England have been flooded this week, with commuters facing further travel disruption after heavy downpours across the UK, the Environment Agency has said."
    },
    {
        "url": "https://www.theguardian.com/uk-news/live/2024/jan/05/uk-weather-storm-henk-rain-flooding-england-latest-news?filterKeyEvents=false&page=with:block-6597ff4b8f08d8e96baf7c65",
        "title": "Cold weather alert issued after homes flooded and transport network hit across England and Wales – live",
        "description": "UK Health Security Agency says temperatures set to plummet after flooding brings misery"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/sunak-urged-to-act-as-areas-hit-by-flooding-96894/",
        "title": "<b>Sunak</b> urged to act as areas hit by flooding",
        "description": "Rishi Sunak has been accused of ignoring warnings about the danger of flooding, after parts of the country were submerged following heavy rain. Opposition parties have urged the Prime Minister to visit the affected areas, with the Midlands and parts of southern England including Gloucestershire badly hit."
    },
    {
        "url": "https://www.thelondoneconomic.com/opinion/elevenses/elevenses-mayday-366350/",
        "title": "Elevenses: Mayday",
        "description": "This article originally appeared in our Elevenses newsletter."
    },
    {
        "url": "https://news.sky.com/story/weather-latest-havoc-for-travellers-as-major-train-line-and-road-closed-by-flooding-evacuations-after-canal-bursts-banks-13040904",
        "title": "Weather latest: Havoc for travellers as major train line and road closed by flooding; evacuations after canal bursts banks",
        "description": "The Environment Agency has warned parts of England are facing &quot;significant&quot; surface water and river flooding this morning - which is likely to cause difficulties for commuters. About 50 people were evacuated in Hackney Wick late last night after a canal burst its banks."
    }
]