[
    {
        "url": "https://www.standard.co.uk/news/uk/leo-varadkar-government-british-rishi-sunak-stormont-b1135704.html",
        "title": "Leo Varadkar will talk to <b>Rishi Sunak</b> after DUP deal to restore Stormont",
        "description": "Mr Varadkar is waiting to see the fine details of what has been agreed between the DUP and the British government."
    },
    {
        "url": "https://www.bbntimes.com/environment/uk-government-announces-ban-on-disposable-vapes",
        "title": "UK Government Announces Ban on Disposable Vapes",
        "description": "In a bid to curb the alarming increase in youth vaping, the UK government has announced plans to implement a ban on disposable vapes."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022439/Angela-Rayner-Palestinian-protesters-police-Israel-Gaza.html",
        "title": "Angela Rayner resurfaces on GMB following low-key few weeks as she says she &#39;understands&#39; rage of pro-Palestinian protesters after needing police escort from chaotic fundraiser ...",
        "description": "But Sir Keir held firm to his position that Israel has a right to self-defence, although he has since shifted slightly to call for a &#39;sustainable ceasefire&#39; along with Prime Minister <b>Rishi Sunak</b>."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24083331.kemi-badenoch-ally-says-evil-plotters-group-claim-silly-gossip/",
        "title": "Kemi Badenoch ally says ‘Evil Plotters’ group claim is ‘silly gossip’",
        "description": "The Business Secretary is reportedly part of a WhatsApp group with the title, despite telling Tory rebels to back Rishi Sunak."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/30/uk-northern-ireland-dup-power-sharing-stormont-latest-politics-news-updates?page=with:block-65b8c5d18f088db3a2e121db",
        "title": "Northern Ireland will no longer automatically have to follow EU laws under deal to restore power sharing, DUP leader says – politics live",
        "description": "The DUP were angry about the Northern Ireland protocol, and the modified version negotiated by <b>Rishi Sunak</b> last year, the Windsor protocol. The DUP supported Brexit, but they were angry about the protocol, and the framework, imposing post-Brexit trading ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24082837.rishi-sunak-much-proud-might-yet-sneak-win/",
        "title": "<b>Rishi Sunak</b> has much to be proud of. He might yet sneak a win",
        "description": "WHEREVER Rishi Sunak looks, the received wisdom is that he, the Conservatives and their General Election campaign are all doomed. But in years"
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/national/24083126.rishi-sunak-sending-mixed-signals-climate-change-say-official-advisers/",
        "title": "<b>Rishi Sunak</b> sending mixed signals on climate change, say official advisers",
        "description": "The Government is not doing enough to meet its climate change obligations and the Prime Minister has “sent mixed signals” to international partners, his official advisers have warned. The Climate Change Committee said perception of the UK around the world as a leader on green issues was hit after Rishi Sunak weakened some of the country’s policies."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/people-government-michael-gove-rishi-sunak-bbc-radio-b1135645.html",
        "title": "People with ‘close connections’ to the UK to be prioritised for social housing",
        "description": "Last week organisations working in the not-for-profit social housing sector wrote to the Prime Minister <b>Rishi Sunak</b> and Housing Secretary Michael Gove to express concern over the plans. They said: “Social housing is designed to support those in the ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/what-happens-next-northern-ireland-deal-075103266.html",
        "title": "What happens next after dramatic Northern Ireland deal?",
        "description": "Heaton-Harris was appointed secretary of state for Northern Ireland in September 2022 by Liz Truss during her short stint as prime minister, but was retained in the role by her successor, <b>Rishi Sunak</b>, and helped negotiate the Windsor Framework, a deal ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/beleaguered-rishi-sunak-on-a-wing-and-a-prayer-and-now-a-fasting-regime",
        "title": "Beleaguered <b>Rishi Sunak</b> on a wing and a prayer – and now a fasting regime",
        "description": "PM battling to salvage his party from predicted electoral obliteration but Tories carry on plumbing the depths"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24082154.rishi-sunak-says-fasting-important-discipline-me/",
        "title": "<b>Rishi Sunak</b> says fasting is an ‘important discipline for me’",
        "description": "He may have a demanding schedule as Prime Minister, but <b>Rishi Sunak</b> has described intermittent fasting as being an “important discipline” for his “balanced lifestyle”. Mr <b>Sunak</b> typically avoids eating on Mondays as part of a health drive which he ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/kemi-badenoch-michael-gove-rishi-sunak-simon-clarke-cabinet-b1135685.html",
        "title": "Kemi Badenoch ally says ‘Evil Plotters’ group claim is ‘silly gossip’",
        "description": "The Business Secretary is reportedly part of a WhatsApp group with the title, despite telling Tory rebels to back Rishi Sunak."
    },
    {
        "url": "https://news.stv.tv/world/white-house-is-not-looking-for-a-war-with-iran-as-us-soldiers-named",
        "title": "White House is &#39;not looking for a war with Iran&#39; as US soldiers named",
        "description": "The US response to the drone strike in Jordan could be multi-levelled and sustained, US Secretary of State Anthony Blinken said Monday."
    },
    {
        "url": "https://uk.news.yahoo.com/tory-grandee-ken-clarke-warns-092948564.html",
        "title": "Tory grandee Ken Clarke warns Rwanda bill risks an ‘elected dictatorship’",
        "description": "Tory grandee Ken Clarke has criticised Rishi Sunak’s Rwanda bill, warning that overturning a Supreme Court ruling could see the UK slipping into an “elected dictatorship”. Former chancellor Lord Clarke is a key figure in the moderate wing of the conservative party and had previously backed the Rwanda deportation policy,"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunaks-strike-busting-law-092304271.html",
        "title": "<b>Rishi Sunak</b>&#39;s &#39;Strike-Busting&#39; Law Flops As Train Drivers Walk Out",
        "description": "A flagship government law which was meant to make it harder for unions to go on strike has been branded a flop after train drivers staged a major walkout. Members of the Aslef union will stage industrial action over the next week in a dispute over pay."
    },
    {
        "url": "https://www.thetimes.co.uk/article/dougie-smith-poll-general-election-tory-party-w5wpk3rbz?ilc=timesradio:morefromthetimes",
        "title": "Tory aide Dougie Smith linked to rebels behind plot to oust <b>Rishi Sunak</b>",
        "description": "A senior Conservative strategist who has worked as an adviser to successive prime ministers is in contact with a group of rebels who are plotting to oust <b>Rishi Sunak</b>. Dougie Smith, who has played a key role as a fixer for decades in the Conservative Party ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/bbdaf4a0-0eec-4ede-a02c-e672733397d9?shareToken=a0076ec4635a9cd3409268194d511273",
        "title": "People wanted me jailed based on fake news, says climate adviser",
        "description": "Several reports by the the Climate Change Committee, a statutory body created by the 2008 Climate Change Act, were the subject of a Conservative Party briefing issued after <b>Rishi Sunak</b>’s net zero “reset” speech in September. Stark was speaking days ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/households-face-100-council-tax-31998231",
        "title": "Households face £100 council tax hikes in April in fresh cost of living misery",
        "description": "Local authority leaders in England are expected to make the maximum 4.99% hike to council tax in April, in a move that would slap around £100 on the average bills"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/30/uk-northern-ireland-dup-power-sharing-stormont-latest-politics-news-updates",
        "title": "Northern Ireland will no longer automatically have to follow EU laws under deal to restore power sharing, DUP leader says – politics live",
        "description": "The DUP has endorsed a deal with the UK government to restore power-sharing in NI, paving an end to two years of political deadlock"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "Politics latest news: Archbishop of Canterbury wrong over small boats crisis, suggests Nigel Farage",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-13022309/Children-banned-buying-cheap-disposable-vapes-abroad-UK-ban-Rishi-Sunaks-war-child-e-cig-epidemic.html",
        "title": "Children &#39;to be banned from buying cheap disposable vapes from abroad&#39; get around UK ban under <b>Rishi Sunak</b>&#39;s war on child e-cig epidemic",
        "description": "In efforts to stamp out the UK&#39;s child vaping epidemic, the PM has pledged to ban disposable e-cigs completely. Ministers are also considering an import ban on single-use vapes."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/people-government-michael-gove-rishi-sunak-afghan-b2486997.html",
        "title": "People with ‘close connections’ to the UK to be prioritised for social housing",
        "description": "Applicants will be required to demonstrate a connection to the UK for at least 10 years and their local area for at least two years."
    },
    {
        "url": "https://www.politicshome.com/news/article/dup-green-lights-return-power-sharing-northern-ireland",
        "title": "DUP Green Lights Return To Power Sharing In Northern Ireland",
        "description": "The Democratic Unionist Party has agreed to return to power sharing in Northern Ireland after a post-Brexit boycott lasting nearly two years."
    },
    {
        "url": "https://www.lbc.co.uk/news/british-homes-for-british-workers/",
        "title": "&#39;Fairer&#39; social housing reforms will ensure system used &#39;in the right way&#39; by those who &#39;play by the rules&#39;",
        "description": "People who don&#39;t &#39;play by the rules&#39; will not have access to social housing under new plans to ensure those who have &#39;paid in to this country&#39; get priority access to homes."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/kemi-badenoch-whatsapp-group-evil-plotters-b2487111.html",
        "title": "Kemi Badenoch is ‘member of Tory Whatsapp group called Evil Plotters’",
        "description": "The plot against Rishi Sunak thickens as two cabinet ministers are said to be part of a Whatsapp group focused on leadership ambitions while a senior aide is linked to the brewing rebellion"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25591641/dup-agrees-deal-to-restore-power-sharing/",
        "title": "DUP agrees deal to restore power sharing in Northern Ireland as two-year boycott ends",
        "description": "POWER-SHARING in Northern Ireland will finally restart after unionists and ministers last night agreed to re-jig Rishi Sunak’s Brexit deal. DUP chief Sir Jeffrey Donaldson said he would end"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861100/lord-ken-clarke-rwanda-bill-rishi-sunak",
        "title": "Lord Ken Clarke warns UK hurtling towards &#39;elected dictatorship&#39; in angry migration rant",
        "description": "The former Home Secretary said he did not have the experience to judge whether Rwanda is or is not a safe country, having never visited."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022265/Northern-Ireland-Sinn-Fein-Rishi-Sunak-Brexit-Stormont.html",
        "title": "Breakthrough in Belfast (and it only cost £3bn): Sinn Fein set to run Northern Ireland for first time after dramatic late-night meeting sees DUP FINALLY agree <b>Rishi Sunak</b>&#39;s ...",
        "description": "After two years of political standoff, the DUP paved the way for Stormont to be restored by agreeing a deal at a marathon meeting."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/business/northern-ireland/manufacturer-of-vaping-products-criticises-pms-plans-to-ban-disposable-vapes-as-extreme/a538934611.html",
        "title": "Manufacturer of vaping products criticises PM’s plans to ban disposable vapes as ‘extreme’",
        "description": "A manufacturer of vaping products in Northern Ireland has criticised the Prime Minister’s plans to ban disposable vapes as “extreme”."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cp3e20v4z58o",
        "title": "Calls for bus passes to be accepted at all times",
        "description": "A petition calling for bus pass holders to be allowed free travel before 09:30 GMT has gathered almost 1,500 signatures. Stoke-on-Trent North MP Jonathan Gullis is calling on the city council and bus companies to make the change so pass holders can get to medical appointments or work without paying to travel."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/conservative-former-minister-george-freeman-28534908",
        "title": "Conservative former minister George Freeman quit because he could not afford mortgage hike - despite earning £118,000",
        "description": "George Freeman said he &#39;simply couldn’t afford&#39; his mortgage, despite a gross salary of almost £10,000 a month"
    },
    {
        "url": "https://metro.co.uk/video/rwanda-bill-wins-vote-house-lords-big-boost-rishi-sunak-3111557/",
        "title": "Video: Rwanda bill wins first vote in House of Lords in big boost for <b>Rishi Sunak</b>",
        "description": "After more than six hours of debate on Monday, unelected members of the House of Lords, largely made of former politicians and government officials, defeated an amendment that would have killed off the legislation by 206 votes to 84."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/30/first-edition-dup-stormont-boycott-ends",
        "title": "Tuesday briefing: The late night vote to restore power-sharing in Northern Ireland",
        "description": "In today’s newsletter: how the DUP finally brought two-year boycott of Stormont assembly to an end"
    },
    {
        "url": "https://bmmagazine.co.uk/news/scrapping-vat-free-shopping-for-tourists-costs-uk-11bn/",
        "title": "Scrapping VAT-free shopping for tourists costs UK £11bn",
        "description": "The government’s decision to scrap VAT-free shopping for tourists is costing the economy £11.1 billion in lost GDP and deterring about two million foreign visitors each year, according to an analysis by the Centre for Economics and Business Research (CEBR)."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/kid-vapes-ban-2879157",
        "title": "Every kid I know vapes, including my own – I can’t wait till it’s banned",
        "description": "On top of the ban on disposable vapes, I would prohibit ALL sweet flavourings – day-old-fag taste would soon put the kids off. Any e-cigarettes or non-disposable vapes should be sold in plain packaging in pharmacies as medicine rather than in newsagents like sweets."
    },
    {
        "url": "https://practicebusiness.co.uk/government-set-to-ban-disposable-vapes",
        "title": "NEWS: Government set to ban disposable vapes",
        "description": "It is already illegal to sell any vape to anyone under 18, but the government said disposable vapes – often sold in smaller, more colourful packaging than refillable ones – were a “key driver behind the alarming rise in youth vaping”."
    },
    {
        "url": "https://www.edp24.co.uk/news/24081967.city-norwich-school-use-sniffer-dogs-stop-vaping/",
        "title": "City of Norwich School to use sniffer dogs to stop vaping",
        "description": "One of Norfolk’s biggest schools is drafting in a sniffer dog as part of a raft of measures to curb the use of vapes amongst its pupils. City of Norwich School (CNS) has introduced the tough tactics hoping that they will act as a deterrent. It comes amid mounting national concern about the number of children using vapes."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/nostalgia/gallery/birmingham-railway-stations-through-years-28511636",
        "title": "Birmingham railway stations through the years",
        "description": "Moor Street Station Birmingham 1974. Aerial view of the construction of stanchions that will support a 300 metre-long viaduct, to bring the high-speed trains into the new Birmingham Curzon Street Station. Curzon Street in April 1979."
    },
    {
        "url": "https://www.motoringresearch.com/advice/2035-petrol-diesel-car-ban-explained/",
        "title": "What will the 2035 petrol and diesel car ban mean for you?",
        "description": "The UK government plans to outlaw the sale of new petrol and diesel cars, including hybrids, from 2035. We explain how will this affect you."
    },
    {
        "url": "https://www.lse.co.uk/news/new-post-brexit-customs-checks-spark-uk-border-worries-ii7wnzd0gh8dkjb.html",
        "title": "New post-Brexit customs checks spark UK border worries",
        "description": "(Alliance News) - The UK will finally roll out post-Brexit border checks Wednesday on food, plant and animal products imported from the EU, fanning fears of more price hikes, empty shelves and even Valentine&#39;s Day flower shortages."
    },
    {
        "url": "https://www.cityam.com/tourist-tax-ms-and-primark-urge-jeremy-hunt-to-think-again-as-11-1bn-wiped-of-gdp/",
        "title": "Tourist Tax: M&amp;S and Primark urge Jeremy Hunt to ‘think again’ as £11.1bn wiped of GDP",
        "description": "Business leaders are piling fresh pressure on the government to scrap its controversial tourist tax as data shows it is eating away at the UK GDP."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24081934.blackburns-totally-wicked-weighs-disposable-vape-ban/",
        "title": "Blackburn’s Totally Wicked weighs in on disposable vape ban",
        "description": "Totally Wicked said it supports the Government’s aim of reducing youth vaping but adds that an outright ban is “seldom the answer”."
    },
    {
        "url": "https://www.itv.com/news/meridian/2024-01-30/channel-crossings-top-1000-for-year-so-far",
        "title": "Channel crossings top 1,000 for year so far",
        "description": "Home Office figures show more than 300 people made the journey at the weekend, taking the provisional total for 2024 to date to 1,057. | ITV News Meridian"
    },
    {
        "url": "https://www.thegrocer.co.uk/finance/media-bites-30-january-brexit-vaping-delivery-hero/687666.article",
        "title": "Media Bites 30 January: Brexit, vaping, Delivery Hero",
        "description": "Shares in London-listed vaping firms took a kicking yesterday after <b>Rishi Sunak</b> announced a ban on disposables, with Chill Brands losing nearly a third of its value (Daily Mail). Delivery Hero is selling its stake in fellow online food dispatch group ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/liz-truss-should-hang-head-31997206",
        "title": "Liz Truss should hang her head in shame as she vows to scupper ban on disposable vapes",
        "description": "It’s not often <b>Rishi Sunak</b> manages to do something useful but credit to him for listening to campaigners and working with Holyrood to make this vapes ban possible. But the Prime Minister, as we know, is cursed with a party full of zealots who pick big ..."
    },
    {
        "url": "https://inews.co.uk/opinion/lord-cameron-is-a-safe-pair-of-eyes-for-rishi-sunak-2879694?ico=related_article_inline",
        "title": "Lord Cameron is a safe pair of eyes for <b>Rishi Sunak</b>",
        "description": "If the speech goes ahead, Lord Cameron will doubtless face claims in Westminster he is usurping <b>Rishi Sunak</b>’s rightful place as the guiding mind of British foreign policy. Ignore them – in a year when the Prime Minister will inevitably have to focus ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/ce5kyprrx1yo?at_link_id=2A71D248-BEC7-11EE-90E7-E261D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Midlands&at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_format=image&at_link_type=web_link",
        "title": "Fans condemn West Brom v Wolves crowd trouble",
        "description": "It’s not about the football then…and that’s what’s really, really sad.” A spokesman for Prime Minister <b>Rishi Sunak</b> said those responsible should face criminal charges. &quot;There&#39;s no place for that kind of behaviour in football. The prime minister ..."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24082154.rishi-sunak-says-fasting-important-discipline-me/",
        "title": "<b>Rishi Sunak</b> says fasting is an ‘important discipline for me’",
        "description": "He may have a demanding schedule as Prime Minister, but <b>Rishi Sunak</b> has described intermittent fasting as being an “important discipline” for his “balanced lifestyle”. Mr <b>Sunak</b> typically avoids eating on Mondays as part of a health drive which he ..."
    }
]