[
    {
        "url": "https://www.thetimes.co.uk/article/sunak-told-home-office-to-halve-migrant-hotel-closures-h5blpnjgn",
        "title": "<b>Sunak</b> told Home Office to halve migrant hotel closures",
        "description": "PM’s lack of faith in Rwanda policy blamed for planned being scaled down as empty beds cost taxpayer £1.5m a day"
    },
    {
        "url": "https://inews.co.uk/news/politics/conservative-rebellion-avoided-north-sea-oil-and-gas-vote-rescheduled-2843851?ico=related_stories",
        "title": "Conservative rebellion avoided as North Sea oil and gas vote rescheduled",
        "description": "An expected Conservative rebellion over Rishi Sunak’s controversial plans to expand oil and gas drilling was postponed on Thursday after a vote on flagship legislation was rescheduled at the last minute."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/starmer-slams-sunaks-slow-response-31836471",
        "title": "Starmer slams <b>Sunak</b>&#39;s slow response to UK flooding as thousands of homes devastated",
        "description": "Touring flooded homes in Loughborough afflicted by Storm Henk Labour leader Keir Starmer slammed the Government&#39;s response to the disaster which he says wasn&#39;t fast enough"
    },
    {
        "url": "https://inews.co.uk/news/politics/fast-track-postmaster-exonerations-2843813?ico=related_article_inline",
        "title": "Plan to fast-track postmaster exonerations to be set out shortly, minister says",
        "description": "Post Office minister Kevin Hollinrake told MPs that the plans aimed to resolve outstanding criminal convictions &#39;with much more pace&#39;"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12940079/Boost-BAE-Germans-finally-green-light-5bn-Saudi-Typhoon-jet-deal.html?mrn_rm=rta",
        "title": "Boost for BAE as Germans finally give the green light to £5bn Saudi Typhoon jet deal",
        "description": "The defence giant signed a memorandum of understanding to sell the kingdom 48 of the aircraft (pictured) back in 2018 for a reported £5bn."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67918976",
        "title": "Ministers seeking to speed up Post Office appeals",
        "description": "Campaigners called for the Post Office to be prevented from taking part in appeals against the convictions of former sub-postmasters. The government also announced retired judge Sir Gary Hickinbottom would chair an independent panel overseeing compensation payments to those whose convictions have been overturned."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-scores-an-own-goal-at-accrington-stanley-r2kch8dzf",
        "title": "<b>Rishi Sunak</b> scores an own goal at Accrington Stanley",
        "description": "I say this only to point out that, when he’s turning in little circles around a tiny coffee table inside a very small room at Accrington Stanley Football Club, doing something that used to be called a speech but which he has decided to call a “PM Connect event” instead,"
    },
    {
        "url": "https://uk.news.yahoo.com/exclusive-rishi-sunak-accused-stuffing-193811487.html",
        "title": "Exclusive: <b>Rishi Sunak</b> Accused Of &#39;Stuffing&#39; Public Meeting With Tory Members",
        "description": "An anti-Trump PAC gave a dire warning to 2024 voters with an ad campaign Monday, saying the former president is likely to encourage a second Jan. 6-like riot. The ad from the Republican Accountability PAC is titled “Trump Will Do This Again” and features footage of the Jan. 6, 2021, Capitol riot, with audio of…"
    },
    {
        "url": "https://www.bbc.co.uk/news/business-67908791?trk=public_post_comment-text",
        "title": "Post Office scandal: Former minister calls for mass appeal against convictions",
        "description": "The situation is different in Scotland and in Northern Ireland. Prime Minister <b>Rishi Sunak</b> has said the government is reviewing options, including stripping the Post Office of its role in the appeal process, and is also looking at how to speed up the ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-treasury-accused-holding-31834517.amp",
        "title": "<b>Rishi Sunak</b>&#39;s Treasury accused of holding up proper compensation for Post Office victims",
        "description": "Paul Scully, who was Post Office Minister, said the Treasury demanded a value for money exercise was done before agreeing to giving further money to victims including Alan Bates <b>Rishi Sunak</b> was Chancellor as the victims of the Post Office scandal asked for ..."
    },
    {
        "url": "https://uk.news.yahoo.com/beth-rigby-rishi-sunak-may-202700635.html",
        "title": "Beth Rigby: <b>Rishi Sunak</b> may not be behind Post Office scandal - but he can&#39;t afford to not put it to bed",
        "description": "<b>Rishi Sunak</b> began 2023 hounded by the contamination of the Johnson and Truss premierships, and kicks off 2024 weighed down by what happened on David Cameron&#39;s watch, as the hundreds of Post Office managers wrongly criminalised and convicted comes back to h ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/ministers-looking-speed-overturning-horizon-200307134.html",
        "title": "Ministers looking to speed up overturning of Horizon scandal convictions",
        "description": "Former Post Office boss Paula Vennells was coming under greater pressure over her CBE after <b>Rishi Sunak</b> signalled he would support a committee looking into the honour. The Prime Minister’s official spokesman said he would “strongly support” the ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-has-claimed-he-is-making-progress-on-his-5-pledges-to-voters-and-people-arent-convinced_uk_659bdff3e4b0bfe5ff640cdc?d_id=7155392&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b> Has Claimed He Is Making &#39;Progress&#39; On His 5 Pledges To Voters And People Aren&#39;t Convinced",
        "description": "<b>Rishi Sunak</b> has been criticised after he claimed he had “made progress’ on “all five” of his pledges to voters. He promised a year ago that he would halve inflation, grow the economy, reduce debt, cut NHS waiting lists and “stop the boats”."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-would-strongly-support-moves-to-strip-former-post-office-boss-of-cbe_uk_659bee49e4b075f4cfd34ba8?d_id=7155286&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b> Would &#39;Strongly Support&#39; Moves To Strip Former Post Office Boss Of CBE",
        "description": "Downing Street said the prime minister “shares the public’s feeling of outrage” over the Horizon scandal. More than a million people have now signed a petition demanding that Paula Vennells lose her gong. Hundreds of sub-postmasters were wrongly ..."
    },
    {
        "url": "https://www.buxtonadvertiser.co.uk/news/politics/prime-minister-rishi-sunaks-two-day-visit-to-the-high-peak-4469920",
        "title": "Prime Minister <b>Rishi Sunak</b>’s two-day visit to the High Peak",
        "description": "Rishi Sunak made a special two-day visit to the High Peak to hold a farmers policy discussion – and present a local pub with a special award."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853264/Rishi-Sunak-PM-Connect-event-Accrington",
        "title": "&#39;I saw <b>Rishi Sunak</b> get standing ovation for one promise voters want to see&#39;",
        "description": "Our Home Affairs and Defence Editor Michael Knowles attended the PM&#39;s latest event in Lancashire today - here are his"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/08/rishi-sunak-conservatives-election-event-labour-keir-starmer-uk-politics-latest-updates?filterKeyEvents=false&page=with:block-659bdc278f0881d21e2a9261",
        "title": "<b>Rishi Sunak</b> claims he has ‘made progress’ on five priorities at first major campaign event – UK politics live",
        "description": "By submitting your message, you are agreeing to share your details with us, which we may use in this blog. <b>Rishi Sunak</b> has just started his PM Connect event. He is in Accrington in Lancashire. He starts by claiming he has “made progress” on the five ..."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12940069/will-mellor-post-office-horizon-scandal-truth-lee-castleton-falsely-accused-fraud.html",
        "title": "Will Mellor calls for Post Office bosses at time of Horizon scandal to &#39;finally tell the truth&#39; after playing Lee Castleton in powerful TV drama which tells how former ...",
        "description": "So I am very proud to be part of it.&#39; The drama has drawn a renewed interest in the scandal after airing last week, prompting Prime Minister <b>Rishi Sunak</b> to reconsider ways to finally compensate all wrongly accused postmasters. Lee had tried to inform the ..."
    },
    {
        "url": "https://www.channel4.com/news/post-office-scandal-pm-strongly-supports-withdrawing-cbe-from-ex-post-office-boss",
        "title": "Post Office scandal: PM “strongly supports” withdrawing CBE from ex-Post Office boss",
        "description": "“We are on it” Rishi Sunak declared today as he sought to reassure sub-postmasters who were wrongly convicted of defrauding the Post Office in the Horizon scandal that he would speed up the process of quashing their convictions and making sure they get full compensation."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/08/fujitsu-post-office-compensation-horizon-scandal/",
        "title": "Fujitsu could pay compensation for Post Office scandal, minister suggests",
        "description": "Ministers are considering chasing Fujitsu for millions of pounds in compensation for the victims of the Post Office Horizon scandal. Around £138 million has already been paid to victims and hundreds of others are still waiting, with the bill covered by the taxpayer."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/post-office-horizon-scandal-itv-convictions-rishi-sunak-kevin-hollinrake-b1131070.html",
        "title": "Justice for Horizon scandal victims &#39;is my highest priority&#39;, Post Office minister vows",
        "description": "Former High Court judge Sir Gary Hickinbottom will chair an independent panel assessing the financial losses of postmasters with overturned convictions, it was announced."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/08/scots-to-miss-out-on-pre-election-tax-cuts-warns-yousaf/",
        "title": "Scots won’t get income tax cuts even if there is a pre-election giveaway in rest of UK, warns Yousaf",
        "description": "Cross-border tax gap likely to widen if Jeremy Hunt announces changes to the levy as SNP leader rules out revising budget plans"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-warms-square-one-201058088.html",
        "title": "<b>Rishi Sunak</b> Warms Of &#39;Square One&#39; With Keir Starmer – And That Doesn&#39;t Sound So Bad To Many",
        "description": "Tory leader changes election strategy, billing himself as a continuity candidate after saying &quot;change&quot; 30 times in his October conference speech."
    },
    {
        "url": "https://www.heraldscotland.com/news/24036085.pain-rishi-sunak-by-election-confirmed-reform-rises-poll/",
        "title": "Pain for <b>Rishi Sunak</b> as by-election confirmed and Reform rises in poll",
        "description": "Rishi Sunak is facing more electoral pain after it was confirmed there is to be a by-election in a Labour target seat and an opinion poll showed"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/08/ministers-clear-names-victims-post-office-horizon-accounting-it-scandal",
        "title": "Ministers scramble to clear names of victims of Post Office Horizon scandal",
        "description": "Government draws up plans to speed up process of justice for those who were wrongfully convicted as public pressure grows"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/08/rishi-sunak-conservatives-election-event-labour-keir-starmer-uk-politics-latest-updates?page=with:block-659be2b48f08f409d77a7fc1",
        "title": "<b>Rishi Sunak</b> claims he has ‘made progress’ on five priorities at first major campaign event – UK politics live",
        "description": "Prime minister speaks in Lancashire as MP says Tories have to accept ‘we have left the country sadder and less united’"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-keeps-getting-community-noted-on-x-for-posting-misleading-claims_uk_659bd058e4b0bfe5ff63fdb6",
        "title": "<b>Rishi Sunak</b> Keeps Getting Community Noted On X For Posting Misleading Claims",
        "description": "Rishi Sunak has been repeatedly rapped for posting misleading claims on X, the social media platform formerly known as Twitter. Since New Year’s Eve, the prime minister has been “community noted” on numerous occasions following a series of posts boasting about the government’s performance."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-alters-uk-conservative-144820160.html",
        "title": "<b>Rishi Sunak</b> Alters UK Conservative Election Strategy to Continuity from Change",
        "description": "Rishi Sunak raised eyebrows in October when he pitched himself to Conservative activists at his party’s annual conference as the “change” candidate despite the Tories ruling for the past 13 years. That no longer appears to be the plan."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24033639.pm-vows-confront-difficult-challenges-heads-lancashire/",
        "title": "PM vows to ‘confront difficult challenges’ as he heads to Lancashire",
        "description": "Ahead of Parliament’s return on Monday, Mr Sunak is expected to visit businesses and speak with voters in Lancashire as part of his so-called PM Connect series. The Commons will later debate the Offshore Petroleum Licensing Bill, which has already led to the resignation of one senior Tory."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/south-west-england-met-office-steve-reed-rishi-sunak-south-wales-b2475222.html",
        "title": "More snow flurries expected across England, amid warning for ice",
        "description": "The wintry weather comes after Prime Minister <b>Rishi Sunak</b> visited flood-hit residents in Oxford, and as Environment Agency workers are still trying to mop up from the heavy rainfall and high winds during Storm Henk last week. The Environment Agency said ..."
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-sunak-loves-being-pm-thats-why-there-wont-be-an-election-until-autumn-2840160?ico=in-line_link",
        "title": "<b>Rishi Sunak</b> loves being PM – that’s why there won’t be an election until Autumn",
        "description": "<b>Rishi Sunak</b> indicated that an autumn vote was a lot more likely than a spring one (Photo: Jacob King/Reuters) Check out <b>Rishi Sunak</b>’s Wikipedia page and the description is “Prime Minister of the United Kingdom”. Like all the best titles, it is simple ..."
    }
]