[
    {
        "url": "https://www.thetimes.co.uk/article/minette-batters-nfu-farming-union-rishi-sunak-interview-8ztg62zhx",
        "title": "Minette Batters: ‘Boris took nothing seriously. Liz Truss? Awful’",
        "description": "It was all about the stilettos ten years ago when Minette Batters became the first female deputy president of the National Farmers’ Union. Could a petite blonde farmer drive a tractor in heels? Had she ever stuck her hand up a sheep, with a manicure? The ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/farming-is-all-about-timing-not-that-rishi-sunak-would-know-6jzqjvznj",
        "title": "Farming is all about timing, not that <b>Rishi Sunak</b> would know",
        "description": "After the outgoing president of the NFU highlighted the turmoil of past governments, the prime minister rebuked the country’s lack of buying British tomatoes"
    },
    {
        "url": "https://www.ibtimes.co.uk/what-does-uk-entering-recession-after-steeper-expected-fall-gdp-mean-brits-1723493",
        "title": "What Does UK Entering Recession After Steeper-Than-Expected Fall In GDP Mean For Brits",
        "description": "While recessions of the past, notably during the global financial crisis of 2008-2009, were protracted and severe, indications suggest that this downturn may be milder and short-lived."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/lib-dems-call-for-extra-1bn-for-farming-budget-in-bid-to-win-rural-votes-110981/",
        "title": "Lib Dems call for extra £1bn for farming budget in bid to win rural votes",
        "description": "The party is also calling for ‘arbitrary’ visa salary thresholds to be abandoned in order to help plug workforce gaps in the food sector."
    },
    {
        "url": "https://www.devonlive.com/news/devon-news/rishi-sunaks-surprise-devon-visit-9110854",
        "title": "<b>Rishi Sunak</b>&#39;s surprise Devon visit sparks plea",
        "description": "A surprise visit from the Prime Minister has sparked a renewed call for action on Cullompton&#39;s transport woes. Mid Devon Liberal Democrats are urging the Government to honour its pledges of funding for the town&#39;s relief road, Junction 28 and train station, following a public consultation that showed overwhelming support for the projects."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/rishi-sunak-announce-427m-farming-28666711",
        "title": "<b>Rishi Sunak</b> to announce £427m farming support package in speech to National Farmers&#39; Union",
        "description": "Rishi Sunak is set to pledge he will &quot;never take our food security for granted&quot; as he outlines support for farmers in a speech to the sector. Speaking to the National Farmers&#39; Union conference on Tuesday, the Prime Minister is expected to say the Government will &quot;be by their side&quot; as farming goes through its biggest change in a generation."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-has-been-rinsed-for-his-latest-cringey-video_uk_65d46b35e4b0f7fbe7b3ed2d",
        "title": "<b>Rishi Sunak</b> Absolutely Rinsed After Dialling Up The Cringe In Latest Video",
        "description": "The Labour Party posted its own version of the video, asking: “What sort of notifications could be annoying <b>Rishi Sunak</b> so much?” They then show the prime minister looking at mocked-up news alerts showing Britain has gone into recession, NHS waiting ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/tory-mps-say-sunak-should-resign-if-he-refuses-move-more-towards-right-1723519",
        "title": "Tory MPs Say <b>Sunak</b> Should Resign If He Refuses To Move More Towards The Right",
        "description": "Since the Labour Party overturned majorities in Kingswood and Wellingborough, Tory MPs have threatened a vote of no confidence and urged Sunak to knuckle down on immigration."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106515/Farming-union-boss-celebrities-greenwashing.html",
        "title": "Farming union boss takes swipe at celebrities buying up land to &#39;greenwash&#39; their jet-setter lifestyles",
        "description": "The farming union leader has criticised celebrities who buy farmland to &#39;greenwash&#39; their jet-setter lifestyles."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68346129",
        "title": "Labour calls for immediate humanitarian ceasefire in Gaza for first time",
        "description": "Shadow foreign secretary David Lammy says the party&#39;s call mirrors the language of the UN and international allies."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/mordaunt-could-beat-starmer-next-election-tory-voters/",
        "title": "Only Mordaunt could beat Starmer at next election, say Tory voters",
        "description": "Leader of the Commons only candidate backed by 2019 Conservative voters to give party a better chance if she replaced Rishi Sunak"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/prince-william-hamas-israel-war-b2499157.html",
        "title": "Prince William calls for Israel-Hamas fighting to end ‘as soon as possible’ in rare statement on crisis",
        "description": "Prince William said he was deeply concerned about the “terrible human cost of the conflict in the Middle East” which followed the Hamas attacks on Oct. 7."
    },
    {
        "url": "https://www.lbc.co.uk/news/labours-ceasefire-motion-broader-and-goes-further-than-the-snp-david-lammy/",
        "title": "&#39;I want to do what is right&#39;: Labour&#39;s ceasefire motion is &#39;broader&#39; and &#39;goes further&#39; than the SNP&#39;s, says David Lammy",
        "description": "Any ceasefire would need to be sustainable by meeting certain conditions, including &quot;hostages being released, Hamas no longer being in charge of Gaza (and) removing the terrorist infrastructure&quot;, <b>Rishi Sunak</b>&#39;s spokeswoman said. Hamas&#39; October 7 attack on ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868905/Rishi-Sunak-It-s-completely-ridiculous-for-illegal-migrants-to-jump-the-queue",
        "title": "<b>Rishi Sunak</b>: It&#39;s &#39;completely ridiculous&#39; for illegal migrants to jump the queue",
        "description": "IN HIS strongest attack on illegal migration yet, <b>Rishi Sunak</b> has hit out at the “completely ridiculous” breach of Britain’s borders by small boats. The Prime Minister said it is unfair that illegal migrants are jumping the queue and putting ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/20/farmer-rish-woos-the-nfu-conference-in-full-on-panic-to-secure-rural-vote?trk=public_post_comment-text",
        "title": "Farmer Rish! woos the NFU conference in full-on panic to secure rural vote",
        "description": "Downing Street team was in love-bombing mode at farmers’ union meeting in Birmingham"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/rishi-sunak-surplus-food-waste-farms-nfu-national-farmers-union-conference-b1140426.html",
        "title": "Victory for Standard campaign against food waste on farms as <b>Sunak</b> announces £15m to redirect surplus produce",
        "description": "Today the Government has listened and the Prime Minister has announced, as part of a wider stimulus package to help farmers, a new measure in which “£15 million is being allocated to redirect surplus food to those who need it”. Further details fleshing out the pilot scheme will be announced in due course."
    },
    {
        "url": "https://inews.co.uk/news/politics/diplomat-prince-uk-william-gaza-ceasefire-2916944?ico=in-line_link",
        "title": "The diplomat prince: UK deploys William to call for Gaza ceasefire",
        "description": "Both the Prince of Wales and Foreign Secretary Lord Cameron have warned that &#39;too many have been killed&#39; in the fighting between Israel and Hamas since 7 October"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/20/akshata-murty-london-fashion-samantha-cameron-suit/",
        "title": "Prime Minister’s wife wears suit by Samantha Cameron to back British design at London Fashion Week",
        "description": "Akshata Murty, the Prime Minister’s wife, wore a suit designed by Lady Cameron on the final day of London Fashion Week in a nod to one of her predecessors in Downing Street. Hos"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868870/prince-william-israel-gaza-statement-poll",
        "title": "Express readers divided over whether Prince William&#39;s Gaza statement was too political",
        "description": "Prime Minister <b>Rishi Sunak</b> expressed his support for the Prince, whereas former UKIP leader turned reality star Nigel Farage hit back, saying William should &quot;stick to the BAFTAS&quot;. A spokeswoman for the PM said: &quot;[William&#39;s message is] consistent with the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68349246?at_medium=social&at_link_id=F2F8D450-CFF2-11EE-A9E4-FAE6A9F30DC0&at_format=link&at_link_origin=BBC_Politics&at_bbc_team=editorial&at_campaign_type=owned&at_campaign=Social_Flow&at_link_type=web_link&at_ptr_name=facebook_page",
        "title": "<b>Rishi Sunak</b> defends Kemi Badenoch in Post Office clash",
        "description": "Speaking to BBC Radio 4&#39;s Farming Today, <b>Rishi Sunak</b> said Ms Badenoch had &quot;made a fulsome statement&quot;. The PM was asked whether he could categorically deny Mr Staunton&#39;s claim that a senior civil servant had told him to &quot;stall&quot; on compensation payments ..."
    },
    {
        "url": "https://www.ft.com/content/cae5c81e-e2d0-481b-9b5e-bbb4dec6a040",
        "title": "<b>Rishi Sunak</b> should resist a swerve to the right",
        "description": "Bleeding support on that scale on its right flank, they say, could compound its losses in an election. They are urging Sunak to tack further to the right in cutting taxes, slowing climate goals and hardening his line on “illegal” migration,"
    },
    {
        "url": "https://inews.co.uk/opinion/politicians-rural-posturing-isnt-fooling-our-farmers-2916317?ico=related_stories",
        "title": "Politicians’ rural posturing isn’t fooling our farmers",
        "description": "It is a battlefield that has seen a Tory retreat which Labour hopes to turn into a rout. So a lot of urban ministers are digging out their Hunter wellies to visit distant places and share worries about absent local bus services and fertiliser prices."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nigel-farage-tells-prince-william-32171842",
        "title": "Prince William told &#39;stick to BAFTAs&#39; by Nigel Farage after Gaza statement",
        "description": "Any ceasefire would need to be sustainable by meeting certain conditions, including &quot;hostages being released, Hamas no longer being in charge of Gaza (and) removing the terrorist infrastructure&quot;, <b>Rishi Sunak</b>&#39;s spokeswoman said."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/top-tory-defends-flood-party-32171074.amp",
        "title": "Top Tory defends &#39;flood&#39; of party donors into House of Lords as Liz Truss allies take oath",
        "description": "<b>Rishi Sunak</b> came under fire for not blocking his predecessor&#39;s appointments following her catastrophic 49 days in No10. Also introduced to the Lords today was Matthew Elliott, the former chief of the Vote Leave campaign for Brexit. Labour backbench peer ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/london-fashion-week-celebrates-big-212715817.html",
        "title": "London Fashion Week Celebrates Its Big 40 at 10 Downing Street",
        "description": "In the reception area inside the residence and office of British Prime Minister <b>Rishi Sunak</b>, designers including Stephen Jones, Sandra Choi, Andreas Kronthaler, David Koma, Emilia Wickstead, Aaron Esh, Anya Hindmarch and Anna Jewsbury of Completedworks ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/20/majority-parents-think-primary-school-meals-free-20310832/?ico=trending-post-strip_item_4",
        "title": "Majority of parents think all primary school meals should be free",
        "description": "‘It is so vital that Prime Minister <b>Rishi Sunak</b> listens to the voices of parents and children and extends free school meals so that every primary school child in England can benefit.’ Dr Camilla Kingdon, president of The Royal College of Paediatrics ..."
    },
    {
        "url": "https://www.channel4.com/news/sunak-pledges-help-to-farming-industry-in-crisis",
        "title": "<b>Sunak</b> pledges help to farming industry ‘in crisis’",
        "description": "“I’ve got your back”: <b>Rishi Sunak</b>’s message to farmers as he became the first prime minister to address the National Farmers Union conference since Gordon Brown in 2008. He announced a package of measures, including reducing red tape and improving ..."
    },
    {
        "url": "https://www.dunmowbroadcast.co.uk/news/national/24131359.food-security-vital-part-national-security-sunak-tells-farmers/",
        "title": "Food security ‘vital part of national security’, <b>Sunak</b> tells farmers",
        "description": "<b>Rishi Sunak</b> has told farmers that food security is a vital part of national security as he set out support for the sector. Speaking at the National Farmers’ Union (NFU) annual conference, the Prime Minister outlined a doubling of the amount going to ..."
    },
    {
        "url": "https://www.farminguk.com/news/nfu-conference-pm-unveils-new-farm-support-worth-nearly-430m_64202.html",
        "title": "NFU Conference: PM unveils new farm support worth nearly £430m",
        "description": "<b>Rishi Sunak</b> unveiled the support at today&#39;s (20 February) NFU Conference, where he told delegates at Birmingham’s ICC “I’ve got your back”. He announced that the government will open the largest ever grant offer for farmers in the coming financial ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868867/Rishi-Sunak-commits-to-introducing-assisted-dying-laws-if-MPs-want-change",
        "title": "<b>Rishi Sunak</b> commits to introducing assisted dying laws if MPs want change",
        "description": "<b>Rishi Sunak</b> told a leading campaigner for assisted dying that he will change the law if that is what MPs want. Matt Ryan, 44, gave a heart-rending account directly to the Prime Minister of how reforms could have eased the suffering his family faced when ..."
    }
]