[
    {
        "url": "https://www.gg2.net/plane-with-indian-passengers-leaves-france-for-mumbai/",
        "title": "Plane with Indian passengers leaves France for Mumbai",
        "description": "A PLANE with close to 300 Indian passengers detained near Paris over suspicions of human trafficking took off on Monday (25) for Mumbai after being cleared"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-has-confidence-james-31748351",
        "title": "<b>Rishi Sunak</b> &#39;has confidence&#39; in James Cleverly as pressure grows over date-rape drug joke",
        "description": "Prime Minister RIshi Sunak is under pressure to denounce the Home Secretary&#39;s remarks after James Cleverly joked about giving his wife a date-rape drug"
    },
    {
        "url": "https://footballleagueworld.co.uk/southampton-fcs-5-most-famous-celebrity-supporters/",
        "title": "Southampton FC&#39;s 5 most famous celebrity supporters",
        "description": "Famous celebrities such as Ed Chamberlin, Rishi Sunak, Iwan Thomas, Craig David, and Lucy Pinder are known supporters of Southampton FC. These celebrities have expressed their love for the club and have been seen attending games or writing about their support."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-cameron-prime-minister-liz-truss-coca-cola-b1128994.html",
        "title": "<b>Sunak</b> and Starmer share family festive traditions",
        "description": "Rishi Sunak has revealed that he takes charge of cooking the turkey on Christmas day, while Sir Keir Starmer heads to his local pub."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/israel-hamas-war-not-close-to-end-netanyahu-warns-as-gaza-conditions-remain-catastrophic/",
        "title": "Israel-Hamas war &#39;not close to end&#39;, Netanyahu warns - as Gaza conditions remain &#39;catastrophic&#39;",
        "description": "Israel&#39;s ground offensive in Gaza will expand over the coming days, Benjamin Netanyahu has warned, as attacks appeared to intensify on Christmas Day."
    },
    {
        "url": "https://www.theguardian.com/environment/2023/dec/25/the-weasel-words-of-cop28-can-be-easily-twisted",
        "title": "The weasel words of Cop28 can be easily twisted",
        "description": "Letters: It is well past time to find radical alternatives to this failed process, says John Foster, and Peter Allen backs citizens’ action"
    },
    {
        "url": "https://news.sky.com/video/share-13036370",
        "title": "<b>Rishi Sunak</b> buys mince pies at King&#39;s Cross &#39;for key workers&#39;",
        "description": "The prime minister was seen at King&#39;s Cross railway station purchasing seasonal treats, which were reportedly for key workers."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-growing-election-threat-farage-reform-uk-2820860?ico=in-line_link",
        "title": "Tories facing growing election threat from Farage’s Reform UK",
        "description": "John Curtice&#39;s analysis of polling over the course of 2023 shows Rishi Sunak has failed to close the gap on Labour to a meaningful degree"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/king-uses-christmas-message-to-praise-growing-awareness-of-protecting-environment/",
        "title": "King uses Christmas message to praise &#39;growing awareness&#39; of protecting environment",
        "description": "King Charles has used his second Christmas message to praise people&#39;s growing awareness of how we must protect our Earth."
    },
    {
        "url": "https://www.standard.co.uk/culture/taylor-swift-christmas-family-discussions-xmas-rishi-sunak-prince-harry-b1129006.html",
        "title": "&quot;What&#39;s the deal with that Taylor Swift then, eh?&quot; How to win at Christmas family discussions",
        "description": "Christmas dinner and heated discussion about Just Stop Oil So: how’s it going? Lunch all great? Eye-rolling at that M&amp;S Nut Roast for one all done? Socks gratefully received? Good. Now it’s time for your family to ask you to explain – kid-’splain,"
    },
    {
        "url": "https://www.theguardian.com/lifeandstyle/2023/dec/25/christmas-travel-quiz-2023",
        "title": "What on Earth: the bumper 2023 travel quiz",
        "description": "Which country drinks the most tea? Where did Rishi Sunak go on holiday? There’s a shipwreck on which national flag? Test your knowledge with our quiz for all travellers (including armchair ones)"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/25/mike-freer-mp-suspected-arson-constituency-office-finchley/",
        "title": "Police investigate suspected arson attack on Tory MP’s office",
        "description": "Met officers inquire into fire starting in a shed at back of Finchley and Golders Green politician’s constituency building on Christmas Eve"
    },
    {
        "url": "https://inews.co.uk/news/politics/cheaper-ev-charging-tax-cuts-jeremy-hunt-net-zero-budget-2823017?ico=editors_picks",
        "title": "Cheaper EV charging and green tax cuts: Jeremy Hunt’s Net Zero options for Spring Budget",
        "description": "Mr Hunt has been urged to consider a range of measures including a green stamp duty cut and a reduction in VAT on electric vehicle charging points"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-finally-learns-use-31746828.amp",
        "title": "<b>Rishi Sunak</b> finally learns to use contactless machine in Christmas miracle",
        "description": "The Prime Minister joked that he was &#39;nailing it&#39; as he successfully made contactless payments in a festive video - after a previous clip of him struggling to use his card went viral"
    },
    {
        "url": "https://www.thehansindia.com/news/national/islamophobic-politics-amplified-in-europe-846673",
        "title": "Islamophobic politics amplified in Europe",
        "description": "Recent events and political upheavals in many European countries point to the increasing Islamophobic and anti-Islam right-wingers inching closer to power in these countries."
    },
    {
        "url": "https://www.indiatoday.in/world/story/james-cleverly-uk-minister-apology-prime-minister-rishi-sunak-government-2480062-2023-12-25",
        "title": "UK Minister jokes about spiking wife&#39;s drink with sedative, apologises",
        "description": "The Sunday Mirror tabloid reported that Cleverly, one of the most senior ministers in Prime Minister <b>Rishi Sunak</b>&#39;s government, had joked to female guests at an event this month that &quot;a little bit&quot; of the drug in his wife&#39;s drink every night was &quot;not really ..."
    },
    {
        "url": "https://www.firstpost.com/world/rewind-2023-a-look-at-key-summits-that-showed-indias-growing-heft-on-global-stage-13543122.html",
        "title": "Rewind 2023: A look at key summits that showed India&#39;s growing heft on global stage",
        "description": "In the year gone by, India&#39;s prominence on the global stage has been underscored by its active participation in several crucial summits. From regional collaborations to engagements with major global powers,"
    },
    {
        "url": "https://www.news-herald.com/2023/12/25/rachel-marsden-western-leaders-are-panicking-after-setting-off-a-ticking-time-bomb/",
        "title": "Rachel Marsden: Western leaders are panicking after setting off a ticking time bomb",
        "description": "US President Joe Biden isn’t alone in being mugged by reality and by Senate Republicans insisting that he reduce options for asylum seekers as a condition of further fueling the conflict"
    },
    {
        "url": "https://www.politico.eu/article/how-uk-rishi-sunak-keir-starmer-liz-truss-politicians-spend-christmas-day/",
        "title": "How <b>Rishi Sunak</b>, Keir Starmer, Liz Truss and more do Christmas",
        "description": "POLITICO London Playbook rounds up the festive traditions of Westminster’s power players — in their own words."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/christmas-day-rituals-of-westminster/",
        "title": "Christmas Day rituals of Westminster",
        "description": "Victoria Prentis, attorney general: “I spend every Christmas Eve organising the village nativity with dogs dressed up as sheep, alpacas pretending to be camels, and a pony who is acting the part of the donkey. Hundreds of people come to see the spectacle!”"
    },
    {
        "url": "https://nypost.com/2023/12/25/news/british-home-secretary-james-cleverly-under-fire-for-making-joke-about-date-rape-drug/",
        "title": "British home secretary James Cleverly under fire for making joke about date rape drug",
        "description": "Cleverly, 54, who met his wife in college and has two children, previously described tackling violence against women and girls as a personal priority."
    },
    {
        "url": "https://www.majorcadailybulletin.com/news/local/2023/12/25/119857/mallorca-britons-british-expats-can-get-their-right-vote-back-next-month-sunak-not-for-the-overseas-vote.html",
        "title": "British expats can get their right to vote back next month",
        "description": "Back in April, Conservative MP and Deputy Speaker of the House, Sir Roger Gale, who has for decades championed the rights of British expatriates, was informed that British expats would be given the right to vote for life ahead of the next general election in the UK."
    },
    {
        "url": "https://www.aol.com/google-were-people-england-searching-072247518.html",
        "title": "Google: What were people in England searching for this year?",
        "description": "Temu launched in the UK in April 2023 and has become the UK&#39;s most downloaded shopping app with an estimated nine million users, according to Apple. The shop sells everything from apparel to electronics and allows consumers to bypass warehouse stores and buy directly from Chinese manufacturers."
    },
    {
        "url": "https://www.sfgate.com/business/article/the-year-of-social-media-soul-searching-twitter-18573218.php",
        "title": "The year of social media soul-searching: Twitter dies, X and Threads are born and AI gets personal",
        "description": "Musk revealed the X logo in July. It quickly replaced Twitter&#39;s name and its whimsical blue bird icon, online and on the company&#39;s San Francisco headquarters. &quot;And soon we shall bid adieu to the twitter brand and, gradually, all the birds,” Musk posted on the site."
    },
    {
        "url": "https://theindependent.co/uks-parliamentary-hinders-effective/",
        "title": "UK’s Parliament: What hinders it from being effective?",
        "description": "The members of Parliament were noted to have lacked participation and the backbone to challenge Sunak this entire year"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-67801541",
        "title": "Archbishop of Wales calls for Christmas peace prayers",
        "description": "The Archbishop of Wales has called on the public to focus on and pray for peace for those suffering this Christmas. Andrew John noted the struggles facing people across the world in &quot;one of those dreadful years&quot;."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847984/who-said-it-quiz-rishi-sunak-or-star-wars",
        "title": "Quiz: Who said it - <b>Rishi Sunak</b> or Star Wars?",
        "description": "Try our special quiz to see if you can tell the Prime Minister, perhaps Westminster&#39;s biggest Star Wars geek, apart from the epic sci-fi film saga"
    },
    {
        "url": "https://inews.co.uk/opinion/year-ripped-tory-party-apart-2816177?ico=more_from_this_author",
        "title": "The year that ripped the Tory Party apart",
        "description": "It was a timely warning from a man who had seen it happen before. Last autumn when MPs were on the brink of ousting Liz Truss as prime minister, George Brandis, the former Australian High Commissioner to the UK,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847425/margaret-thatcher-rishi-sunak-conservative-party",
        "title": "Margaret Thatcher would be &#39;horrified&#39; by <b>Rishi Sunak</b>&#39;s Tory Party, says Ann Widdecombe",
        "description": "With the Conservatives facing another potentially damaging by-election after a recall petition against Wellingborough MP Peter Bone, and the party continuing to bicker over immigration, <b>Rishi Sunak</b>, the current occupant of Number 10, is struggling to ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/2023-british-politics-wrapped-how-much-of-this-nonsense-do-you-remember_uk_657b22c7e4b020f3b6741bfc?3qlb",
        "title": "2023 Politics Wrapped: How Much Of This Nonsense Do You Remember?",
        "description": "Nadhim Zahawi was sacked as Tory Party chairman after “a serious breach of the ministerial code” over his tax affairs. Sunak marked his first 100 days in office by being less popular at that point than his five predecessors (who made it that far). Labour headed into the year with a 26-point lead."
    },
    {
        "url": "https://www.independent.co.uk/travel/news-and-advice/christmas-travel-met-office-weather-forecast-snow-uk-b2469237.html?page=4",
        "title": "Met Office gives verdict on snow tomorrow after warmest Christmas Eve in 20 years - live",
        "description": "The UK has seen its warmest Christmas Eve in over 20 years after Heathrow hit 15.3C, making it the warmest Christmas Eve since 1997."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/25/rare-edward-viii-gold-medal-to-go-up-for-auction/",
        "title": "Rare Edward VIII gold medal to go up for auction",
        "description": "Mr Seton-Watson was awarded the prestigious accolade while a schoolboy at Winchester College, the alma mater of Prime Minister <b>Rishi Sunak</b>, to mark an achievement of distinction in Latin verse. “It’s made that much more special because it is a Royal ..."
    },
    {
        "url": "https://www.radiotimes.com/tv/drama/beyond-paradise-humphrey-martha-fostering-newsupdate/",
        "title": "Beyond Paradise Christmas special teases exciting life change for Humphrey and Martha",
        "description": "For all of its whimsy and low-stakes action, Beyond Paradise&#39;s first season wasn&#39;t afraid to tackle some weighty issues, one of which was Martha and Humphrey&#39;s IVF journey. Sally Bretton&#39;s character suffered a miscarriage in the first episode following multiple attempts to get pregnant."
    },
    {
        "url": "https://www.walesonline.co.uk/lifestyle/tv/watched-beyond-paradise-christmas-special-28336664",
        "title": "I watched the Beyond Paradise Christmas special and it should be available on prescription",
        "description": "I also love spin-off Beyond Paradise, arguably and perhaps somewhat controversially, a little more… Kris Marshall is iconic as DI Humphrey Goodman. His performance as the bumbling (but genius) detective has cemented itself in the history books,"
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/christmas-zarach-bed-charity-child-poverty-b2469137.html",
        "title": "Your generosity has given children a Christmas to remember",
        "description": "Who could easily say, for example, which of <b>Rishi Sunak</b>, Keir Starmer or Ed Davey informed us that: “Christmas is a time of peace, joy, compassion, a time of hope and promise of a better world”? Or that “for me, the message of Christmas is for us to ..."
    }
]