[
    {
        "url": "https://inews.co.uk/news/politics/tory-rebels-defeat-sunak-rwanda-look-weak-theresa-may-2803493?ico=above_article_ticker",
        "title": "If Tory rebels defeat <b>Sunak</b> on Rwanda, he will look as weak as Theresa May",
        "description": "So why should you care? Because this issue cuts to the heart of <b>Rishi Sunak</b>‘s political authority. If he can win over nearly all his own MPs to his migration policy, the Prime Minister will enter the new year in the same position he has occupied most of ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67684785",
        "title": "<b>Rishi Sunak</b> faces crunch Rwanda vote as Tory MPs split",
        "description": "Prime Minister <b>Rishi Sunak</b> is facing a battle to persuade Tory MPs to back his flagship Rwanda bill, ahead of a key vote on Tuesday. The legislation seeks to revive the government&#39;s plan to send some asylum seekers to the east African country. MPs on the ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/sunak-defends-eat-help-scheme-164733874.html",
        "title": "Covid Inquiry: <b>Sunak</b> defends Eat Out to Help Out scheme",
        "description": "Rishi Sunak has defended his Eat Out to Help Out scheme arguing it protected the country from the “devastating consequences” of mass job losses."
    },
    {
        "url": "https://www.politicshome.com/news/article/rishi-sunak-in-last-ditch-talks-to-avert-rwanda-rebellion",
        "title": "<b>Rishi Sunak</b> In Last-Ditch Talks To Avert Tory Rwanda Rebellion",
        "description": "Prime Minister Rishi Sunak will spend the coming hours trying to persuade a critical mass of MPs on the right of the Conservative party to back"
    },
    {
        "url": "https://news.sky.com/story/showdown-for-sunak-as-tory-mps-in-disarray-over-rwanda-vote-13028258",
        "title": "Showdown for <b>Sunak</b> as Tory MPs in disarray over Rwanda vote",
        "description": "The prime minister has faced calls from the Tory right to scrap the Safety of Rwanda Bill before it faces its first Commons vote on Tuesday because it is not &quot;fit for purpose&quot; - but moderate Tories ha"
    },
    {
        "url": "https://www.irishnews.com/news/uknews/2023/12/11/news/eat_out_to_help_out_a_mistake_says_son_whose_father_died_with_covid-19-3841086/",
        "title": "Eat Out To Help Out ‘a mistake&#39;, says son whose father died with Covid-19",
        "description": "Stephen Allen said the Eat Out To Help Out scheme was ‘a mistake&#39; after his father Charles Allen died in hospital with Covid-19 in 2020."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844453/David-Cameron-Rwanda-vote-exclusive-interview",
        "title": "David Cameron makes desperate plea to Tory MPs as <b>Rishi Sunak</b> faces Rwanda rebellion",
        "description": "David Cameron has urged warring Tories to unite behind Prime Minister <b>Rishi Sunak</b> as his premiership was pushed to the brink. The Foreign Secretary on Monday night insisted that planned new laws to get deportation flights to Rwanda off the ground &quot;will ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-mysteriously-fails-to-get-the-message-on-backing-up-his-mobile-st6cnf9k9?ilc=timesradio:morefromthetimes",
        "title": "<b>Rishi Sunak</b> mysteriously fails to get the message on backing up his mobile",
        "description": "The prime minister told the Covid inquiry that ‘multiple phone changes’ meant he could not produce his WhatsApp messages from the pandemic"
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-handed-lifeline-centrist-one-nation-tories-back-rwanda-bill-2803415",
        "title": "<b>Sunak</b> handed lifeline as centrist One Nation Tories back Rwanda bill",
        "description": "Moderate Tory MPs handed Rishi Sunak a lifeline after they came out in support of the contentious Rwanda bill, pledging to vote with the Government when the legislation is put to a vote in the Commons on Tuesday."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-covid-inquiry-live-31643920",
        "title": "Covid Inquiry RECAP: <b>Rishi Sunak</b> denies calling free school meal parents &#39;freeloaders&#39;",
        "description": "Rishi Sunak, who was branded &#39;Dr Death&#39; by Government scientists, issued an apology to bereaved families at the start of his Covid Inquiry grilling"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/rishi-sunak-defends-eat-help-175705382.html",
        "title": "<b>Rishi Sunak</b> defends Eat Out to Help Out scheme as ‘micro policy’",
        "description": "Rishi Sunak has defended his Eat Out to Help Out scheme to the Covid-19 inquiry as a “micro-policy” and said he was not warned about the risks."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/forgetful-rishi-sunak-says-cannot-31650515",
        "title": "Forgetful <b>Rishi Sunak</b> says he cannot remember more than 20 times in Covid Inquiry grilling",
        "description": "Prime Minister Rishi Sunak appeared rattled as he faced six hours of questions at the Covid Inquiry about his role as Chancellor in the pandemic, including on Eat Out To Help Out"
    },
    {
        "url": "https://www.politico.eu/article/british-pm-rishi-sunak-crisis-immigration-wtf-happens-next-rwanda-plan/",
        "title": "<b>Rishi Sunak</b>’s in crisis over immigration. WTF happens next?",
        "description": "POLITICO charts all the possible pathways as Rishi Sunak tries to get his flagship asylum legislation through Parliament."
    },
    {
        "url": "https://news.sky.com/story/amp/rishi-sunak-apologises-as-he-gives-covid-inquiry-evidence-13028026",
        "title": "COVID inquiry: <b>Rishi Sunak</b> says advisers had &#39;ample opportunity&#39; to raise concerns over Eat Out - <b>Sunak</b>",
        "description": "Medical advisers were not consulted about the Eat Out to Help Out scheme as it was deemed a &quot;micro&quot; policy, according to <b>Rishi Sunak</b>. The prime minister is appearing before the UK&#39;s COVID inquiry, as part of its module on governmental decision-making in ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/23982002.rishi-sunak-eat-help-matter-social-justice/?ref=rss",
        "title": "<b>Rishi Sunak</b>: Eat Out to Help Out &#39;matter of social justice&#39;",
        "description": "Rishi Sunak has defended policies encouraging customers back into the hospitality and leisure trade at the height of the pandemic as a"
    },
    {
        "url": "https://www.thesun.co.uk/news/25009097/rishi-sunak-covid-inquiry-eat-out/",
        "title": "Top scientists never raised concerns about Eat Out To Help Out scheme, <b>Rishi</b> tells Covid inquiry",
        "description": "RISHI Sunak has defended his controversial Eat Out to Help Out scheme insisting none of the Government’s top scientists chose to express concerns to him before its implementation. The"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-getting-customers-back-140941804.html",
        "title": "<b>Rishi Sunak</b>: Getting customers back to hospitality was &#39;matter of social justice&#39;",
        "description": "Rishi Sunak has defended policies encouraging customers back into the hospitality and leisure trade at the height of the pandemic as a &quot;matter of social justice&quot;."
    },
    {
        "url": "https://www.heraldscotland.com/news/23982002.rishi-sunak-saving-hospitality-matter-social-justice/",
        "title": "<b>Rishi Sunak</b>: Saving hospitality &#39;matter of social justice&#39;",
        "description": "Rishi Sunak has defended policies encouraging customers back into the hospitality and leisure trade at the height of the pandemic as a"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-defends-not-asking-scientists-if-eat-out-to-help-out-would-spread-covid_uk_65771cbbe4b0fca7ad2183a4",
        "title": "<b>Rishi Sunak</b> Defends Not Asking Scientists If Eat Out To Help Out Would Spread Covid",
        "description": "Rishi Sunak has defended not consulting government scientists before launching Eat Out To Help Out (EOHO) while serving as chancellor during the pandemic. Giving evidence to the the Covid inquiry on Monday, he said the scheme helped avoid “devastating consequences” for millions of workers."
    },
    {
        "url": "https://www.wandsworthguardian.co.uk/news/national/23981977.rishi-sunak-pressure-happens-next-rwanda-bill/",
        "title": "Why is <b>Rishi Sunak</b> under pressure and what happens next to the Rwanda Bill?",
        "description": "Prime Minister Rishi Sunak is under pressure from both wings of his party over his bid to ensure migrants can be removed to Rwanda. Flagship legislation combined with a new treaty declaring Rwanda a safe country was sold as a fair yet robust response to the Supreme Court ruling that his plan was unlawful."
    },
    {
        "url": "https://www.scotsman.com/news/politics/analysis-rishi-sunak-plays-it-safe-at-the-covid-inquiry-ahead-of-crucial-week-for-leadership-4441389",
        "title": "Analysis: <b>Rishi Sunak</b> plays it safe at the Covid Inquiry ahead of crucial week for leadership",
        "description": "Rishi Sunak has sought to keep the peace as MPs conspire to remove him."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/off-head-bamboozled-sunak-faces-202210677.html",
        "title": "Off with his head! A bamboozled <b>Sunak</b> faces the flat pack thrown",
        "description": "I’m not saying Lady Hallett’s job as judge of the Covid Inquiry has gone to her head, but she entered the hearing room in a sedan chair – to be greeted by the wonderfully pretentious and plummy Hugo Keith KC."
    },
    {
        "url": "https://inews.co.uk/news/politics/inside-no-10-chaos-ministers-scramble-contain-tory-rebellion-rwanda-2803427",
        "title": "Inside No 10 chaos as ministers scramble to contain Tory rebellions on Rwanda",
        "description": "Ministers are urging Rishi Sunak to stand firm, with one telling i: &#39;His middle-of-the-road answer is the only realistic one he can offer&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/11/channel-churchill-uk-lead-support-ukraine-sunak/",
        "title": "Channel Churchill and reclaim UK’s role in leading support for Ukraine, <b>Sunak</b> urged",
        "description": "Allies want Britain to step up as Germany, France and the US struggle to maintain backing for Kyiv, say sources"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-defends-eat-out-28271731",
        "title": "<b>Rishi Sunak</b> defends Eat Out to Help Out scheme saying it was &#39;right thing to do&#39;",
        "description": "Giving evidence to the Covid-19 Inquiry on Monday, the former chancellor said the Eat Out to Help Out scheme helped protect workers from the &quot;devastating consequences&quot; of job losses"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-government-rwanda-mps-james-cleverly-b1126301.html",
        "title": "<b>Rishi Sunak</b>’s Rwanda plan boosted by backing from moderate group of Tory MPs",
        "description": "The One Nation group has recommended its members back the plan but warned it would oppose amendments that would risk the UK breaching the rule of law."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/11/rwanda-bill-star-chamber-tory-lawyers-rishi-sunak-advice/",
        "title": "Rwanda Bill: Five key things the Government and Tory rebels disagree on",
        "description": "A ‘star chamber’ of Conservative lawyers doesn’t think the legislation goes far enough but Rishi Sunak has published his own legal advice"
    },
    {
        "url": "https://www.ft.com/content/84d774fd-b1a1-454b-b33c-c65bf9d73960",
        "title": "Government to face down party rebels over Rwanda bill",
        "description": "Rishi Sunak will on Tuesday seek to face down rightwing Tory rebels by pushing ahead with his controversial Rwanda bill, despite calls for him to pulp the legislation and come back with a more robust plan."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/23983016.prime-minister-defends-eat-help-six-hour-covid-inquiry-hearing/",
        "title": "Prime Minister defends Eat Out To Help Out during six-hour Covid inquiry hearing",
        "description": "Rishi Sunak made an impassioned defence of his Eat Out To Help Out scheme during a six-hour evidence session in front of the Covid inquiry."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2023/dec/11/rishi-sunak-covid-inquiry-conservatives-rwanda-asylum-bill-uk-politics-live?page=with:block-65776b498f08635a62431a05",
        "title": "One Nation Tory MPs vow to drop support for Rwanda bill if there are amendments as ERG calls for it to be rewritten – UK politics live",
        "description": "Damian Green says government must ‘stick to guns’ but chair of European Research Group calls for bill to be pulled and rewritten"
    },
    {
        "url": "https://www.thelondoneconomic.com/news/rishi-sunak-to-host-a-rebel-breakfast-as-rwanda-vote-looms-364889/",
        "title": "<b>Rishi Sunak</b> to host a ‘rebel breakfast’ as Rwanda vote looms",
        "description": "<b>Rishi Sunak</b> and James Cleverly are engaged in last-ditch efforts to persuade would-be Tory rebels to back the Government’s Rwanda plan. The Prime Minister has faced calls from the Tory right to scrap the Safety of Rwanda Bill before it faces its first ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rwanda-bill-sunak-one-nation-caucus-new-conservatives_uk_65775fc6e4b0fca7ad21bb0c",
        "title": "Moderate Tories Warn <b>Sunak</b> To Resist Pressure From Hardliners As Rwanda Bill Hangs In The Balance",
        "description": "One Nation Caucus backs controversial legislation despite &quot;concerns&quot; as right-wing faction tells PM the plan needs “major surgery”."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/11/tory-mps-given-outdated-analysis-in-push-for-rwanda-bill",
        "title": "Tory MPs given ‘outdated’ analysis in push for Rwanda bill",
        "description": "Party sources say whips circulating flawed Home Office analysis in effort to persuade MPs to back bill Ministers are using an “outdated and flawed” Home Office analysis to persuade Tory MPs to vote for <b>Rishi Sunak</b>’s Rwanda bill, informed party ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/millennials-hit-by-surging-rent-prices-after-biggest-annual-hike-on-record/",
        "title": "Millennials hit by surging rent prices after biggest annual hike on record",
        "description": "Showdown for <b>Sunak</b> as Tory MPs in disarray over Rwanda vote <b>Rishi Sunak</b> is braced for a showdown on his Rwanda bill that could fatally undermine his authority as rival Tory factions make conflicting demands of the prime minister. PM waits to see size of ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/rishi-sunak-covid-inquiry-live-eat-out-boris-whatsapp-b2461822.html?page=7",
        "title": "<b>Rishi Sunak</b> Covid inquiry – live: PM ‘deeply sorry’ for lives lost as he’s quizzed over missing WhatsApps",
        "description": "WhatsApp messages shown to the Covid-19 Inquiry have revealed that government advisers referred to Mr Sunak as ‘Dr Death’ during the pandemic"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/rishi-sunak-heads-into-a-perilous-week/",
        "title": "<b>Rishi Sunak</b> heads into a perilous week",
        "description": "Listen to the latest episode of Politics at Jack and Sam’s, with our Jack Blanchard and Sky’s Sam Coates, to get the full rundown on what’s coming up in the political week ahead. HE COULD DO WITHOUT THIS: Prime Minister Rishi Sunak takes to the stand at the COVID probe in Dorland House,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-eat-out-help-out-whatsapp-covid-inquiry-b2461842.html",
        "title": "‘Dr Death’ <b>Rishi Sunak</b> to be grilled over Eat Out to Help out and missing WhatsApps",
        "description": "It is claimed that Rishi Sunak is set to be ‘absolutely slaughtered’ for his failure to hand over WhatsApp messages to the probe"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-apologises-covid-victims-110539216.html",
        "title": "<b>Rishi Sunak</b> Apologises To Covid Victims During Evidence At Inquiry",
        "description": "<b>Rishi Sunak</b> has apologised to the victims of Covid, as he faced questions over his role as chancellor during the pandemic. It came as the prime minister gave evidence to the Covid inquiry on Monday morning. “I just wanted to start by saying how deeply ..."
    }
]