[
    {
        "url": "https://news.sky.com/story/labour-to-scale-back-28bn-green-prosperity-plan-sky-news-understands-13066410",
        "title": "Labour to ditch £28bn green prosperity plan, Sky News understands",
        "description": "The costly pledge has long been used by the Tories to criticise Labour&#39;s fiscal responsibility, following <b>Rishi Sunak</b>&#39;s decision to scrap a number of the government&#39;s own green pledges. The party is said to be split on the matter, with some shadow ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/07/king-charles-breaks-silence-since-cancer-diagnosis-20242685/?ico=trending-post-strip_item_3",
        "title": "King Charles breaks silence after his cancer diagnosis",
        "description": "King Charles has spoken out for the first time since Buckingham Palace made his cancer diagnosis public. It was just two days ago that the nation was wrecked by the announcement of the Majesty’s ill health, prompting people from all corners of the world ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/adult-dies-in-ireland-after-contracting-measles/",
        "title": "Adult dies in Ireland after contracting measles",
        "description": "Brianna Ghey&#39;s father demands apology from PM after transgender jibe in Commons The father of murdered transgender teenager Brianna Ghey has demanded an apology from <b>Rishi Sunak</b>, saying he was &quot;shocked&quot; by the prime minister&#39;s comments in the Commons today."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-government-turned-transgender-32073306",
        "title": "&#39;<b>Rishi Sunak</b>&#39;s government has turned transgender lives into a political football&#39;",
        "description": "Only under the Tories have trans rights been weaponised as the next frontier of their toxic culture war in a last-ditch attempt to save themselves from electoral wipeout, writes Mizy Judah Clifton"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/man-dies-in-ireland-after-contracting-measles/",
        "title": "Man dies in Ireland after contracting measles",
        "description": "Brianna Ghey&#39;s father demands apology from PM after transgender jibe in Commons The father of murdered transgender teenager Brianna Ghey has demanded an apology from <b>Rishi Sunak</b>, saying he was &quot;shocked&quot; by the prime minister&#39;s comments in the Commons today."
    },
    {
        "url": "https://www.thenational.scot/news/24105222.rishi-sunak-defends-trans-joke-in-front-brianna-gheys-mother/?sent_id=PREVIEW&secret=PREVIEW",
        "title": "<b>Rishi Sunak</b> defends making trans joke in front of Brianna Ghey&#39;s mother",
        "description": "<b>RISHI Sunak</b> is refusing to apologise for a “crass” joke he made about transgender people during Prime Minister’s Questions. During an exchange with Labour leader Keir Starmer, the Prime Minister attempted to skewer his opponent over the breaking of ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864161/wellingborough-by-election-reform-win-odds",
        "title": "Odds of Reform UK pulling off shock by-election victory slashed with Tory voters on strike",
        "description": "After declaring that the by-election is &quot;a referendum on <b>Rishi Sunak</b>&#39;s government&quot;, Mr Habib has suddenly found himself installed as the clear second favourite at just 8/1, a dramatic fall in his odds as money piled on for him to win. Meanwhile ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-refuses-apologise-callous-184744799.html",
        "title": "<b>Rishi Sunak</b> refuses to apologise for ‘callous’ transgender joke at PMQs",
        "description": "RISHI Sunak is refusing to apologise for a “crass” joke he made about transgender people during Prime Minister’s Questions."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/rishi-sunak-refuses-apologise-over-28586523",
        "title": "<b>Rishi Sunak</b> refuses to apologise over &#39;deplorable&#39; trans jibe in front of Brianna Ghey&#39;s mum",
        "description": "Rishi Sunak has refused to apologise for his &quot;deplorable&quot; comments about trans people in front of the mother of murdered teenager Brianna Ghey."
    },
    {
        "url": "https://uk.news.yahoo.com/happened-rishi-sunaks-disappearing-topjaw-133713104.html",
        "title": "What happened in <b>Rishi Sunak</b>&#39;s disappearing Topjaw interview?",
        "description": "Around Christmastime, Sunak appeared on an episode of Topjaw, the social media sensation which sees food presenter Jesse Burgess ask chefs and public figures for their London restaurant recommendations. Each interview has the same questions, including “best pizza”, “best burger”, and “best pub”."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/charles-tom-cruise-prince-of-wales-ellen-white-patron-b2492455.html",
        "title": "Supportive messages for Charles and Kate ‘mean a great deal to us all’ – William",
        "description": "Charles has postponed all public-facing duties, but is continuing with behind-the-scenes work on his red boxes of state papers and took a private call from <b>Rishi Sunak</b> earlier. William may step in to represent his father at an event, but no engagements are ..."
    },
    {
        "url": "https://www.scotsman.com/news/national/supportive-messages-for-charles-and-kate-mean-a-great-deal-to-us-all-william-4509623",
        "title": "Supportive messages for Charles and Kate ‘mean a great deal to us all’ – William",
        "description": "Downing Street took the unusual step of confirming details about a personal phone call between <b>Rishi Sunak</b> and the King this evening, where the Prime Minister is likely to have wished Charles well, ahead of their regular audiences resuming on February 21."
    },
    {
        "url": "https://www.thetimes.co.uk/article/ishi-sunak-boiler-tax-2024-heat-pumps-t85tqlnr8?ilc=timesradio:morefromthetimes",
        "title": "<b>Rishi Sunak</b> faces internal revolt over plan to scrap ‘boiler tax’",
        "description": "The energy secretary is facing a revolt from her climate minister and senior officials over plans to scrap a so-called “boiler tax” designed to incentivise the uptake of heat pumps. Graham Stuart, the minister of state for climate,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-prime-minister-labour-rishi-sunak-laura-trott-b1137785.html",
        "title": "Brianna Ghey’s father demands apology from <b>Sunak</b> over transgender jibe",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender joke in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-sunak-ends-disaster-of-a-day-with-invitation-to-family-of-brianna-ghey-12593360",
        "title": "Politics latest: <b>Sunak</b> ends &#39;disaster&#39; of a day with invitation to family of Brianna Ghey",
        "description": "Brianna Ghey&#39;s family have been invited to meet <b>Rishi Sunak</b> about online safety after the prime minister endured a day of relentless criticism for making a joke about transgender issues during PMQs - just as the mother of the murdered teenager was in the ..."
    },
    {
        "url": "https://www.channel4.com/news/sunak-trans-jibe-calls-for-pm-to-apologise-over-comments-in-pmqs",
        "title": "<b>Sunak</b> trans jibe: calls for PM to apologise over comments in PMQs",
        "description": "Rishi Sunak is facing calls to apologise for making a transgender dig at Sir Keir Starmer during PMQs, while Brianna Ghey’s mother was visiting parliament. The Labour leader accused him of shameful behaviour, while Brianna’s father, Peter Spooner, said the comments were “dehumanising” and “degrading”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13058165/israeli-pm-benjamin-netanyahu-hamas-hostage-deal.html",
        "title": "Israeli PM Benjamin Netanyahu rejects Hamas&#39; &#39;delusional&#39; hostage deal proposal and insists &#39;total victory&#39; is the only path to peace",
        "description": "The Israeli Prime Minister slammed the terrorists&#39; demands as &#39;bizarre&#39; and said to agree to them would &#39;only invite another massacre&#39; when they are &#39;a finger away from a decisive victory&#39;."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/brianna-gheys-father-demands-apology-28589994",
        "title": "Brianna Ghey’s father demands apology from <b>Rishi Sunak</b> over &#39;dehumanising&#39; transgender remark",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender remark in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.thetimes.co.uk/article/empathy-bypass-will-haunt-sunak-for-his-remaining-time-in-office-qzlfjrpck?ilc=timesradio:morefromthetimes",
        "title": "Empathy bypass will haunt <b>Sunak</b> for his remaining time in office",
        "description": "Prime minister’s folder of retorts let him down when a bit of humanity was required"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-needs-steady-ship-2895650",
        "title": "Starmer needs to steady his ship",
        "description": "The Labour leader may look like he is cruising, but to lead an effective government he will need to get his own house in order"
    },
    {
        "url": "https://www.channel4.com/news/send-struggle-years-out-of-school-waiting-for-education-support",
        "title": "SEND struggle: years out of school waiting for education support",
        "description": "Rishi Sunak told parliament today he wants every child to thrive. But over 1.5 million pupils in England have special educational needs, and with the number of applications for a child education plan rising by almost a quarter, the waiting time has also gone up."
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/sister-of-transwoman-who-died-awaiting-gender-affirming-care-criticises-sunak",
        "title": "Sister of transwoman who died awaiting gender-affirming care criticises <b>Sunak</b>&#39;s &#39;devastating&#39; jibe",
        "description": "The prime minister has come under pressure to apologise for accusing Sir Keir Starmer of having difficulty in &#39;defining a woman&#39;. | ITV National News"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-sunak-trans-joke-brianna-ghey-2895221",
        "title": "Brianna Ghey’s father calls on <b>Sunak</b> to apologise for ‘degrading’ trans ‘joke’",
        "description": "Peter Spooner is &#39;disgusted&#39; with the PM&#39;s &#39;absolutely dehumanising&#39; comment as Tory MPs complain to whips and PM refuses to apologise"
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/william-carries-out-first-royal-engagement-since-kings-cancer-diagnosis",
        "title": "William tells well-wishers Royal Family &#39;appreciate kind messages&#39; after King&#39;s cancer diagnosis",
        "description": "The heir to the throne, will be the leading member of the royal family at official events as the King receives treatment for an undisclosed type of cancer. | ITV National News"
    },
    {
        "url": "https://www.scotsman.com/news/national/prince-william-we-really-appreciate-everyones-kind-messages-4509623",
        "title": "Prince William: &quot;We really appreciate everyone&#39;s kind messages&quot;",
        "description": "Prince William has thanked the public for their support as he appeared at a charity fundraising event for the London Air Ambulance. In his first public comments since it was revealed the King had been diagnosed with cancer, he said “we really appreciate everyone&#39;s kind messages, thank you”."
    },
    {
        "url": "https://uk.news.yahoo.com/uks-sunak-criticised-over-trans-195454796.html",
        "title": "UK&#39;s <b>Sunak</b> criticised over trans jibe",
        "description": "Opposition politicians demanded UK Conservative Prime Minister Rishi Sunak apologise Wednesday for making a jibe about transgender people in parliament.A spokeswoman for Sunak declined to apologise when pressed by reporters after,"
    },
    {
        "url": "https://www.thesun.co.uk/royals/25792092/prince-william-king-charles-kate-tom-cruise/",
        "title": "Prince William thanks well-wishers for supporting King and Kate at charity do where he was joined by Tom Cruise",
        "description": "PRINCE William has hailed the “kind messages” received by the Princess of Wales and King amid their health scares and said “it means a great deal to us all”. Wills, 41, has"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/labour-weaponised-brianna-ghey-murder-says-kemi-badenoch/",
        "title": "Labour weaponised Brianna Ghey murder, says Kemi Badenoch",
        "description": "Rishi Sunak criticised for saying Keir Starmer has difficulty ‘defining a woman’ while the trans teenager’s mother attended PMQs"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/24105179.echo-comment-rishi-sunaks-transgender-joke-pmqs/",
        "title": "Echo Comment on <b>Rishi Sunak</b>&#39;s transgender &quot;joke&quot; at PMQs",
        "description": "IT has been a bad week for Rishi Sunak. One day, he is goaded into making an intemperate bet by Piers Morgan, and the next he is criticised for"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/sunak-strike-crackdown-could-breach-brexit-trade-deal/",
        "title": "<b>Sunak</b> strike crackdown could breach Brexit trade deal, EU claims",
        "description": "The European Union has accused Britain of potentially breaching the Brexit trade deal with Rishi Sunak’s crackdown on strikes. Brussels is considering whether to trigger a formal dispute with No 10 over the introduction of minimum service levels."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/07/mayors-put-forward-alternatives-to-hs2-scrapped-northern-section?ref=biztoc.com",
        "title": "Mayors put forward alternatives to HS2 scrapped northern section",
        "description": "It follows the cancellation, announced in October, of the northern leg of the HS2 line to Manchester. <b>Rishi Sunak</b> promised instead to divert £36bn into alternative transport schemes known as Network North. Street said the cancellation of the northern HS2 ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/07/the-guardian-view-on-public-service-queues-a-grim-symbol-of-chronic-underinvestment?ref=biztoc.com",
        "title": "The Guardian view on public service queues: a grim symbol of chronic underinvestment",
        "description": "It isn’t just dentistry. <b>Rishi Sunak</b> admitted in a TV interview broadcast this week that he was failing to keep a promise to bring down waiting lists across the NHS. The prime minister disingenuously identified industrial action as the main obstacle to ..."
    },
    {
        "url": "https://www.midweekherald.co.uk/news/24103825.rishi-sunak-makes-trans-jibe-front-brianna-gheys-mother/",
        "title": "<b>Rishi Sunak</b> makes trans jibe in front of Brianna Ghey’s mother",
        "description": "Rishi Sunak made the tone-deaf comments while the mother of a murdered trans schoolgirl sat in the public gallery."
    },
    {
        "url": "https://www.independent.co.uk/tech/openai-sam-altman-effective-accelerationism-b2492430.html",
        "title": "Inside the political split between AI designers that could decide our future",
        "description": "Protesters calling on AI companies to &quot;hit pause&quot; have become a regular sight in San Francisco. British prime minister <b>Rishi Sunak</b> has begun warning that AI could lead to human extinction. One influential philosopher of AI, Eliezer Yudkowsky, has even ..."
    },
    {
        "url": "https://www.burytimes.co.uk/news/national/24103700.taxpayers-scammed-archbishop-canterbury-says-tory-mp/",
        "title": "Taxpayers are being ‘scammed’ by Archbishop of Canterbury, says Tory MP",
        "description": "Prime Minister <b>Rishi Sunak</b> replied: “When it comes to illegal migrants we need to have a system whereby if someone comes here illegally they shouldn’t be able to stay. “I can tell him the Home Secretary has asked for more information about the extent ..."
    }
]