[
    {
        "url": "https://www.hambletontoday.co.uk/rishi-sunak-talks-to-school-about-democracy-and-parliament/",
        "title": "<b>Rishi Sunak</b> talks to school about democracy and Parliament",
        "description": "Rishi Sunak spoke about the importance of Parliament and democracy during a visit to a North Yorkshire primary school. In an illustrated presentation to Appleton Wiske Community Primary School, the MP described how our system"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/year-tragic-death-crowds-gathered-28613269",
        "title": "A year on from her tragic death the crowds gathered to remember &#39;funny&#39; and brave Brianna Ghey",
        "description": "One year on from the tragic murder of 16-year-old Brianna Ghey, school friends, family members, and well-wishers from the wider community gathered to remember the &quot;funny&quot; and &quot;witty&quot; schoolgirl whose death shook the town and shocked the wider country."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/brianna-gheys-mum-says-hold-28613403",
        "title": "Brianna Ghey&#39;s mum says &#39;hold your children tight&#39; at vigil for murdered teen",
        "description": "People gathered to pay tribute to the 16 year old, who was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire"
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-will-not-ask-boris-johnson-to-help-on-campaign-trail-wxdj3drj5",
        "title": "<b>Rishi Sunak</b> will not ask Boris Johnson to help on campaign trail",
        "description": "Prime minister has no plans to reach out to his predecessor, despite allies making it clear that former leader is waiting for a ‘personal approach’"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13072079/boris-johnson-rishi-sunak-kwasi-kwarteng-election.html",
        "title": "&#39;Swallow your pride and bring back Boris!&#39; Kwasi Kwarteng urges <b>Rishi Sunak</b> to ask Johnson for election help",
        "description": "The Prime Minister is under mounting pressure to bury the hatchet and harness Mr Johnson&#39;s campaigning skills which helped deliver a landslide in 2019."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/deranged-donald-trump-no-friend-32102101",
        "title": "&#39;Deranged Donald Trump is no friend of Britain - he is a grave security threat&#39;",
        "description": "Boris Johnson rashly endorsed a Trump triumph as “what the world needs” with a caveat about still supporting Ukraine which is why it’s more important that Rishi Sunak and David Cameron break diplomati"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/11/immigration-minister-thinks-rwanda-policy-will-break-law/",
        "title": "Leaked documents show even immigration minister thinks Rwanda policy will break law",
        "description": "When solicitor general, Michael Tomlinson advised that ignoring Strasbourg injunctions blocking flights would put UK in breach of ECHR"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13071621/Recession-set-confirmed-inflation-double-blow-economy.html",
        "title": "Recession set to be confirmed and inflation up too in double blow to economy",
        "description": "That would deliver a blow to ministers&#39; hopes of reviving growth and bringing the cost of living squeeze to an end as the election nears."
    },
    {
        "url": "https://www.thesun.co.uk/news/25871329/election-clock-minute-midnight-time-rishi-tories-starmer-labour/",
        "title": "Election clock is at a minute to midnight but there is still time for <b>Rishi</b> and the Tories to avoid the iceberg",
        "description": "SOMETIMES when watching true-life disaster movies like Titanic or Gallipoli, it’s hard to suppress an absurd hope it might somehow turn out differently. All the victims need to do is wake up,"
    },
    {
        "url": "https://www.libdems.org.uk/press/release/ae-waits-this-conservative-government-is-a-catastrophe-for-our-nhs",
        "title": "A&amp;E waits: This Conservative government is a catastrophe for our NHS",
        "description": "The latest NHS data has revealed that the number of people waiting more than 12 hours in A&amp;E departments from a decision to admit them to actually being admitted hit 54,308 in January, up sharply from 44,"
    },
    {
        "url": "https://www.libdems.org.uk/press/release/no-fault-evictions-pm-must-deliver-on-his-governments-promises",
        "title": "No fault-evictions: PM must deliver on his government&#39;s promises",
        "description": "Responding to figures that show no-fault evictions spiked by almost a third last year, Liberal DemocratHousing spokesperson, Helen Morgan MP said:"
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/11/michael-gove-says-no-fault-evictions-will-be-banned-this-year",
        "title": "Michael Gove says no-fault evictions will be banned this year",
        "description": "UK housing minister promises section 21 evictions in England will have ended by time of general election"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/vigil-one-year-murder-brianna-ghey-mum-hold-kids-love/",
        "title": "&#39;Hold your children tight&#39;, Brianna Ghey&#39;s mother tells vigil marking a year since her murder",
        "description": "Brianna Ghey’s mother has told a crowd gathered to mark one year since her daughter’s death to “hold your children tight”. People gathered at Golden Square Shopping Centre in Warrington on Sunday to mark a year since the 16-year-old was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire."
    },
    {
        "url": "https://www.indcatholicnews.com/news/49109",
        "title": "Christian Aid renews calls for &#39;unambiguous opposition&#39; to Israel&#39;s latest military onslaught in Gaza.",
        "description": "As Israel prepares to expand military operations into the city of Rafah, Christian Aid has renewed its calls for Rishi Sunak to &#39;demonstrate unambiguous opposition&#39;.Israeli Prime Minister Benjamin Netanyahu is reported to be drafting evacuation plans ahead of ordering troops to"
    },
    {
        "url": "https://inews.co.uk/news/boy-head-injuries-suspected-xl-bully-attack-2900750?ico=most_popular",
        "title": "Boy, 8, suffers ‘life-changing’ head injuries after suspected XL Bully attack",
        "description": "An eight-year-old boy has suffered “serious” and “life changing” head injuries after a suspected XL Bully attack in Merseyside. Officers were called to Wadham Road in Bootle just after 5.20pm on Saturday following a report that a dog had attacked a young boy. The dog, which officers believe to be an XL Bully, was seized."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/king-charles-keen-seen-public-32100948.amp",
        "title": "King Charles is &#39;keen to be seen&#39; in public during cancer treatment - and William won&#39;t deputise",
        "description": "The monarch, who gave his “heartfelt thanks” for messages of support on Saturday, was seen out in public as he was joined by the Queen for the service at Sandringham"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13070949/Young-people-abandon-democracy-afford-homes-warns-Michael-Gove.html",
        "title": "Young people may &#39;abandon democracy&#39; if they can&#39;t afford homes, warns Michael Gove as he vows to build tens of thousands of homes in cities and ban &#39;no fault&#39; evictions before ...",
        "description": "The Housing Secretary said he is doing everything he can &#39;short of laying siege&#39; to the Chancellor&#39;s home to persuade him to put more money into housing in the spring Budget."
    },
    {
        "url": "https://www.ft.com/content/e2b5444e-8bf1-4858-99ce-a34e1817f046",
        "title": "Biden hosts Jordan’s King Abdullah and UK holds by-elections",
        "description": "The attempt to find a solution to the Israel-Gaza conflict comes to Washington on Monday with President Joe Biden playing host to King Abdullah of Jordan. The meeting has been billed as an effort to find “an enduring end” to the crisis in Gaza, including “a two-state solution with Israel’s security guaranteed”, according to a White House statement."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/labour-rochdale-by-election-israel-hamas-wellingborough-kingswood-b2494352.html",
        "title": "Will the Israel-Hamas war be a factor in the Rochdale by-election for Labour?",
        "description": "Both Labour and the Conservatives face tests over their policies and the popularity of their leaders during this month’s three big by-elections, writes Zoe Grunewald"
    },
    {
        "url": "https://www.ft.com/content/d5c9e07b-1278-4815-a9e9-203642a83e09",
        "title": "Now is the time to put people before robots",
        "description": "Everything? National income in any country can be divided into the part that goes to owners of capital and the part that goes to owners of labour. Decades ago, economists such as Nicholas Kaldor believed that this division of national income between labour and capital was fixed for eternity."
    },
    {
        "url": "https://www.thetimes.co.uk/article/clean-it-up-campaign-one-year-anniversary-935scqps2",
        "title": "Clean It Up campaign one year on: what progress has been made?",
        "description": "As we reach the first anniversary of our fight to tackle water pollution, we review any steps that have been taken to overhaul the damage done to UK waterways"
    },
    {
        "url": "https://www.thelondoneconomic.com/news/multi-millionaire-sunak-pays-same-tax-rate-as-teacher-368482/",
        "title": "Multi-millionaire <b>Sunak</b> pays same tax rate as teacher",
        "description": "Our tax system is rigged in favour of the super-rich. It’s time to make them pay their fair share!”, Labour MP Richard Burgon said."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24112408.sunak-swallow-pride-bring-back-johnson-says-kwarteng/",
        "title": "<b>Sunak</b> should ‘swallow some pride’ and bring back Johnson, says Kwarteng",
        "description": "Rishi Sunak should be “swallowing some pride” and bringing back Boris Johnson to help boost the Tories’ electoral fortunes, ex-chancellor Kwasi Kwarteng has said."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24112531.brianna-gheys-mother-tells-vigil-teenager-amazing-unique-joyful/",
        "title": "Brianna Ghey’s mother tells vigil teenager was ‘amazing, unique and joyful’",
        "description": "It comes after Prime Minister <b>Rishi Sunak</b> refused to apologise to Brianna’s father and said it is “sad and wrong” to link his transgender joke at Prime Minister’s Questions to her case. Brianna’s father, Peter Spooner, said Mr <b>Sunak</b> should say ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/11/the-guardian-view-on-rishi-sunaks-transgender-jibe-sorry-seems-to-be-the-hardest-word?ref=biztoc.com",
        "title": "The Guardian view on <b>Rishi Sunak</b>’s transgender jibe: sorry seems to be the hardest word",
        "description": "Editorial: The prime minister should be making an apology to a murdered teenager’s parents rather than continuing with a culture war on GB News"
    },
    {
        "url": "https://www.irishnews.com/news/uk/brianna-gheys-mother-tells-vigil-teenager-was-amazing-unique-and-joyful-ZVDKTOMXVZLPVCNWW77RSIQS6I/",
        "title": "Brianna Ghey’s mother tells vigil teenager was ‘amazing, unique and joyful’",
        "description": "It marked one year since the 16-year-old was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-inflation-rise-possible-recession-budget-hunt-2901153",
        "title": "UK set for inflation rise and possible recession in double Budget blow for Hunt",
        "description": "The Office for National Statistics will publish data on inflation and GDP growth in the coming days, ahead of the Budget"
    }
]