[
    {
        "url": "https://uk.news.yahoo.com/tory-donor-embroiled-post-office-203036415.html",
        "title": "Tory donor embroiled in Post Office scandal given government role",
        "description": "A Tory donor caught up in the Post Office scandal was given a non executive government role on the Board of the UK Health Security Agency (UKHSA)."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24060182.shipping-chiefs-told-uk-wont-stand-by-red-sea-attacks-continue/",
        "title": "Shipping chiefs told UK ‘won’t stand by’ while Red Sea attacks continue",
        "description": "The UK “won’t stand by” while international shipping is under attack, the Government vowed as Iran-backed Houthi rebels said they would continue targeting vessels – including those from Britain."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857271/Rishi-Sunak-McDonalds-menu-return",
        "title": "<b>Rishi Sunak</b> &#39;excited&#39; about the return of his &#39;favourite&#39; McDonalds menu item",
        "description": "EXCLUSIVE: The Express understands the Prime Minister has responded enthusiastically to a recent announcement by McDonald&#39;s."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/watchdog-slams-rishi-sunak-over-114328284.html",
        "title": "<b>Rishi Sunak</b> rapped by watchdog over claim to have ‘cleared’ asylum backlog",
        "description": "The UK’s statistics watchdog has slammed Rishi Sunak for his repeated claim to have “cleared” the asylum backlog – and warned that the assertion could erode trust in the government. Sir Robert Chote, the chair of the UK Statistics Authority, also said voters may have felt “misled”."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-slammed-over-misleading-123549088.html",
        "title": "<b>Rishi Sunak</b> Has Been Slammed Over His &#39;Misleading&#39; Claim To Have Cleared The Asylum Backlog",
        "description": "Rishi Sunak has been criticised by a top watchdog after wrongly claiming to have cleared the asylum backlog. The UK Statistics Authority said “people may feel misled” by the claim, which the prime minister made on X (formerly Twitter) earlier this month. They also said the controversy “may affect public trust” in claims made by the government."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-live-pm-address-31909158",
        "title": "<b>Rishi Sunak</b> LIVE: PM to address nation at Downing Street press conference",
        "description": "<b>Rishi Sunak</b> will address the nation from Downing Street shortly after he survived another day of Tory chaos over his Rwanda policy. The PM is expected to speak just after 10am before taking questions at a press conference - just hours after rebels warned ..."
    },
    {
        "url": "https://www.politics.co.uk/opinion-former/press-release/2024/01/18/rishi-sunak-all-mouth-and-no-trousers-when-it-comes-to-nature-protection/",
        "title": "<b>Rishi Sunak</b> “all mouth and no trousers” when it comes to nature protection",
        "description": "In response to the Office for Environmental Protection’s second annual report, published today, Doug Parr, Chief Scientist at Greenpeace UK, said:  “When it comes to protecting nature, this report proves beyond doubt that Rishi Sunak is all mouth and no trousers."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856939/tory-wimps-rishi-sunak-rwanda-comment",
        "title": "How <b>Rishi Sunak</b> beat Tory right with Priti Patel deal, Keir Starmer&#39;s PMQs and &#39;wimp&#39; MPs",
        "description": "ANALYSIS: Rishi Sunak has won a major victory and defeated the Right of his party meaning he now will almost certainly lead the Tories into the next election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-house-lords-rwanda-bill-b2481090.html",
        "title": "<b>Rishi Sunak</b> set for titanic battle with Lords over Rwanda bill",
        "description": "Defiant peers have rejected <b>Rishi Sunak</b>’s warning not to frustrate “the will of the people” by opposing his flagship Rwanda legislation, as the prime minister heads for a showdown with the House of Lords. The PM described his controversial ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/government-dft-irwin-mitchell-prime-minister-department-for-transport-b1133257.html",
        "title": "Smart motorway death widow hits out at Government over ‘stalling tactics’",
        "description": "“Otherwise, if it means legal action, then that’s something I’m prepared to do.” In April last year, Prime Minister <b>Rishi Sunak</b> announced the cancellation of planned projects to build ALR smart motorways. He said this was due to cost pressures and ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/four-post-office-victims-who-31849165?int_source=nba",
        "title": "Four Post Office victims who took their own lives and will never get justice",
        "description": "Hundreds of ordinary families were torn apart after postmasters were wrongly accused of swindling money - with some so damaged by the ordeal that they decided to end it all. The Post Office scandal, dubbed the UK&#39;s biggest miscarriage of justice, saw more ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-hikes-tax-domestic-31910697",
        "title": "<b>Rishi Sunak</b> hikes tax on domestic flights - but not private jets or helicopters",
        "description": "Details buried in the Finance Bill show that luxury flight-loving Prime Minister will raise Air Passenger Duty (APD) on flights within the UK - except private jets and helicopters"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/playing-second-fiddle-rishi-sunak-david-cameron/",
        "title": "I don’t mind playing second fiddle to <b>Sunak</b>, says ex-PM Cameron",
        "description": "Lord Cameron describes Mr Sunak as ‘easy to work for’, adding that his respect for him was part of why he had chosen to return"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12980391/Tories-Rwanda-Labour-general-election-Conservatives-Boris-Johnson.html",
        "title": "Tories stuck in political &#39;tailspin&#39; amid failed Rwanda rebellion with insiders fearing a Labour wipe out at the next general election - as Conservatives say there&#39;s a lot of ...",
        "description": "Prime Minister Rishi Sunak is under pressure from MPs on the right of the party who have been left infuriated by the Government&#39;s handling of the Rwanda Bill."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/18/tory-donor-post-office-scandal-government-role-pamdemic/",
        "title": "Tory donor embroiled in Post Office scandal given government role",
        "description": "A Tory donor caught up in the Post Office scandal was given a non executive government role on the Board of the UK Health Security Agency (UKHSA)."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857323/bbc-question-time-emily-thornberry-rwanda-plan",
        "title": "BBC Question Time fury as audience lashes out at Rwanda plan: &#39;Cheated as a Brexit voter&#39;",
        "description": "Emily Thornberry was also challenged to spell out Labour&#39;s alternative when it came to stopping migrant boats crossing the English Channel."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/18/jeremy-hunt-hints-at-voter-friendly-tax-giveaway-in-march-budget",
        "title": "Jeremy Hunt hints at voter-friendly tax giveaway in March budget",
        "description": "With polls predicting electoral disaster for Tories, chancellor says ‘economy would be more successful if we had more competitive taxes’"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/shipping-chiefs-told-uk-won-t-stand-by-while-red-sea-attacks-continue-b1133351.html",
        "title": "Shipping chiefs told UK ‘won’t stand by’ while Red Sea attacks continue",
        "description": "The UK “won’t stand by” while international shipping is under attack, the Government vowed as Iran-backed Houthi rebels said they would continue targeting vessels – including those from Britain."
    },
    {
        "url": "https://uk.news.yahoo.com/hypocrite-rishi-sunak-called-over-190649390.html",
        "title": "&#39;Hypocrite&#39; <b>Rishi Sunak</b> Called Out Over Warning To &#39;Unelected&#39; House Of Lords Over Rwanda Bill",
        "description": "Rishi Sunak hosts a press conference at Downing Street the morning after he saw off a Tory rebellion to win the Commons’ backing for his flagship Safety of Rwanda Bill. Rishi Sunak has faced a backlash after urging the unelected House of Lords not to block his Rwanda plan."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/government-will-be-presented-with-west-yorkshire-mass-transit-plans-after-promising-ps25bn-4484303",
        "title": "Government will be presented with West Yorkshire mass transit plans after promising £2.5bn",
        "description": "The Government will be presented with preliminary plans for a long-awaited mass-transit system in West Yorkshire in the spring, after it promised £2.5bn for the project."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-stuck-to-his-new-slogan-relentlessly-but-some-mps-believe-it-backfired-spectacularly-13051068",
        "title": "<b>Rishi Sunak</b> stuck to his new slogan relentlessly - but some MPs believe it backfired spectacularly",
        "description": "The prime minister said the word &quot;plan&quot; a remarkable 41 times in his news conference, which worked out at a mention every 40 seconds during his opening remarks and responses to 11 questions from journalists."
    },
    {
        "url": "https://news.sky.com/story/politics-live-former-tory-deputy-chair-giving-first-interview-since-quitting-over-rwanda-bill-12593360",
        "title": "Politics live: Former Tory deputy chair giving first interview since quitting over Rwanda bill",
        "description": "<b>Rishi Sunak</b> has insisted he will &quot;ignore&quot; international law in order to ensure asylum seekers get deported to Rwanda. The prime minister managed to get his controversial policy through its latest parliamentary stage last night after days of rebellions from ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-first-rwanda-flight-may-2862597?ico=related_stories",
        "title": "<b>Rishi Sunak</b> targets May for first Rwanda flight",
        "description": "Government privately presents Lords timeline which would see PM&#39;s &#39;emergency&#39; laws to save the policy enacted by Easter"
    },
    {
        "url": "https://www.lbc.co.uk/news/nearly-6000-migrants-missing-failed-asylum-applications/",
        "title": "Nearly 6,000 migrants missing after asylum applications failed, Home Office admits",
        "description": "Close to 6,000 migrants have disappeared after their asylum applications were withdrawn, the Home Office has said."
    },
    {
        "url": "https://www.modernghana.com/news/1286490/uk-pm-says-controversial-rwanda-plan-is-will-of.html",
        "title": "UK PM says controversial Rwanda plan is &#39;will of the people&#39;",
        "description": "Rishi Sunak on Thursday urged members of the UK&#39;s unelected upper chamber of parliament to pass his contentious plan to send migrants to Rwanda, insisting it was the will of the people ."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-leadership-threat-robert-jenrick-migration-2861660",
        "title": "<b>Sunak</b> ‘facing leadership threat’ as Jenrick prepares to turn screw on migration",
        "description": "It comes after the ex-minister led a failed rebellion to toughen up Mr Sunak’s Rwanda laws this week. MPs voted to pass Mr Sunak’s Rwanda Safety Bill, which paves the way for flights to the country, on Wednesday. It must now clear th Lords."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12980181/Fury-Home-Office-loses-track-6-000-asylum-seekers-roaming-Britain-immigration-farce-branded-shocking-Labour.html",
        "title": "Fury as Home Office loses track of almost 6,000 asylum seekers who are now roaming Britain in immigration farce branded &#39;shocking&#39; by Labour",
        "description": "The migrants &#39;remain in the UK and the Home Office is taking steps to urgently re-establish contact with them&#39;, the disclosure to MPs revealed."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24057459.sir-keir-starmer-no-skeletons-waiting-come-general-election/",
        "title": "Sir Keir Starmer has ‘no skeletons’ waiting to come out this general election",
        "description": "Labour leader Sir Keir Starmer has said he has “no skeletons in the closet” from his time in charge of the Crown Prosecution Service (CPS) ahead of the general election."
    },
    {
        "url": "https://www.westerntelegraph.co.uk/news/national/24058488.watchdog-rebukes-government-claim-asylum-backlog-cleared/",
        "title": "Watchdog rebukes Government over claim asylum backlog had been ‘cleared’",
        "description": "UK Statistics Authority chairman Sir Robert Chote warned the “episode may affect public trust” as he outlined the findings of the body’s investigation into complaints received about <b>Rishi Sunak</b>’s claim ministers had “cleared” the outstanding ..."
    },
    {
        "url": "https://www.channel4.com/news/rwanda-pm-urges-house-of-lords-to-pass-bill-to-deport-asylum-seekers",
        "title": "Rwanda: PM urges House of Lords to pass bill to deport asylum seekers",
        "description": "<b>Rishi Sunak</b> has told the House of Lords that they should not frustrate his plans to deport asylum seekers to Rwanda. He told them that as the Commons passed his Bill with no changes last night, peers would be “frustrating the will of the people” if ..."
    }
]