[
    {
        "url": "https://www.kentonline.co.uk/news/national/uk-to-be-part-of-international-coalition-to-protect-red-sea-ships-from-attack-106284/",
        "title": "UK to be part of international coalition to protect Red Sea ships from attack",
        "description": "It comes after oil giant BP paused tanker journeys over safety concerns after Iranian-backed Houthi militants in Yemen stepped up attacks on vessels."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/man-charged-murder-after-womans-28314033",
        "title": "Man charged with murder after woman&#39;s body found in home as police link Middlesbrough incidents",
        "description": "Detectives investigating an alleged attempted murder of a man in Laycock Street, Middlesbrough, on Friday are now linking the incident with the tragic discovery of a woman&#39;s body at an address in Grimwood Avenue, Brambles Farm, Middlesbrough. The lady has now been formally identified as 50-year-old Glenna Siviter."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-tees-67752463?at_medium=RSS&at_campaign=KARANGA",
        "title": "Middlesbrough mayor hits back at <b>Rishi Sunak</b>&#39;s &#39;mismanagement&#39; claim",
        "description": "Middlesbrough&#39;s mayor has hit back at comments by the prime minister accusing the council of mismanaging finances. Discussing difficulties faced by various councils, Rishi Sunak said blame for Middlesbrough&#39;s monetary woes rested with its Labour-run council."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-visits-scotland-uk-094033128.html",
        "title": "<b>Rishi Sunak</b> visits Scotland as UK Government faces Michelle Mone scandal",
        "description": "RISHI Sunak is visiting Scotland amid an ongoing scandal over Covid contracts awarded to a firm recommended by Michelle Mone"
    },
    {
        "url": "https://www.echo-news.co.uk/news/national/23995855.rishi-sunak-thank-military-personnel-service-festive-season/",
        "title": "<b>Rishi Sunak</b> to thank military personnel for service over the festive season",
        "description": "Mr Sunak will also host a video call with members of the armed forces who are abroad over Christmas. He is expected to wish them a happy Christmas and tell them their commitment will be at the front and centre of his mind during the festive season."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/red-sea-middle-east-hamas-iranian-yemen-b1127804.html",
        "title": "UK to be part of international coalition to protect Red Sea ships from attack",
        "description": "It comes after oil giant BP paused tanker journeys over safety concerns after Iranian-backed Houthi militants in Yemen stepped up attacks on vessels."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-67750367",
        "title": "How will Scotland plug its £1.5bn budget shortfall?",
        "description": "Finance secretary Shona Robison must explain how she will fill an estimated £1.5bn hole in Scotland&#39;s books when she delivers her £60bn budget later. Options on the table include tax rises for higher earners, spending cuts for government departments, and public sector job losses."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/volcano-erupts-in-iceland-after-thousands-evacuated-from-village/",
        "title": "Volcano erupts in Iceland after thousands evacuated from village",
        "description": "A volcano has erupted in Iceland after weeks of intense earthquake activity. An evacuation had already taken place in recent days, moving nearly 4,000 people out of the fishing town of Grindavik in the country&#39;s southwest. The nearby Blue Lagoon geothermal spa had also been closed as a precaution."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-calls-on-scottish-government-to-explain-different-approach-to-tax-106281/",
        "title": "<b>Sunak</b> calls on Scottish Government to explain ‘different approach’ to tax",
        "description": "The Prime Minister challenged the Scottish Government ahead of Tuesday’s budget, which is expected to include tax rises for higher earners."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2023/12/18/rishi-sunak-to-thank-military-personnel-for-service-over-the-festive-season/",
        "title": "<b>Rishi Sunak</b> to thank military personnel for service over the festive season",
        "description": "Mr Sunak will also host a video call with members of the armed forces who are abroad over Christmas. He is expected to wish them a happy Christmas and tell them their commitment will be at the front and centre of his mind during the festive season."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-scotland-scottish-tories-scottish-labour-douglas-ross-b2466247.html",
        "title": "Tories will not be wiped out in Scotland, says <b>Sunak</b>",
        "description": "We remain very confident about both what we&#39;re accomplishing and delivering in Scotland and the response that we&#39;re getting from people on the ground Prime Minister <b>Rishi Sunak</b> Speaking to journalists during a visit to RAF Lossiemouth in Moray, the Prime ..."
    }
]