[
    {
        "url": "https://www.mirror.co.uk/news/politics/top-tory-accused-offering-vip-32040731",
        "title": "Top Tory accused of offering &#39;VIP lane&#39; for <b>Rishi Sunak</b>&#39;s wife&#39;s firm in UK",
        "description": "A Mirror Investigation has revealed details of a meeting between a top Conservative operator and the tech company in which Prime Minister Rishi Sunak&#39;s wife Akshata has £624m in shares"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/sunak-should-learn-ppe-must-32040910",
        "title": "&#39;<b>Sunak</b> should learn from PPE - there must be no VIP access for wife&#39;s family firm&#39;",
        "description": "The difference is, a wealthy PM must take greater care over any perceived conflicts of interest. That’s where <b>Rishi Sunak</b> falls down. There can be no “VIP access” for the firm responsible for his family fortune. Yet trade minister Lord Johnson ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-13041071/MIDAS-SHARE-TIPS-UPDATE-tip-Idox-vote-winner.html",
        "title": "MIDAS SHARE TIPS UPDATE: Our tip Idox is still a vote winner",
        "description": "Idox is one of the leading players in the field. Working with councils on local and general elections it is expected to play a key role when Prime Minister <b>Rishi Sunak</b> unveils the date for this year&#39;s vote. Based in Woking, Surrey, Idox specialises in ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041299/Rishi-Sunak-vaping-gang-warfare.html",
        "title": "<b>Rishi Sunak</b>&#39;s warned disposable ban could lead to &#39;turf wars&#39; by doctors as Australia&#39;s anti-vaping laws leads to rise in smoking and gang violence",
        "description": "The package of proposals, unveiled by Prime Minister Rishi Sunak last week, came after reports the number of children vaping has tripled in three years."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-13041747/CITY-WHISPERS-Electricity-firm-Bboxx-shock-relocation-Rwanda.html",
        "title": "CITY WHISPERS: Electricity firm Bboxx in shock relocation - to Rwanda",
        "description": "Bboxx has announced that it will be upping sticks and shifting its global headquarters from London to the capital Kigali."
    },
    {
        "url": "https://www.thesun.co.uk/news/25703756/rishi-sunak-paul-scully-mayor-london-race/",
        "title": "Fresh blow to <b>Rishi Sunak</b> as top Tory MP considers running AGAINST his own party in race to be Mayor of London",
        "description": "PM Rishi Sunak faces a fresh nightmare with one of his own MPs considering running against the Tories for London Mayor. Paul Scully is mulling over standing as an independent after being urged to"
    },
    {
        "url": "https://uk.news.yahoo.com/villagers-slam-plans-for-shipping-container-development-next-to-homes-201638205.html",
        "title": "Villagers slam plans for shipping container development next to homes",
        "description": "Villagers have hit out at plans to install nearly 900 shipping containers next to their homes as part of a new battery storage energy system."
    },
    {
        "url": "https://www.bbc.com/news/topics/cdn42nmd5yvt?page=11",
        "title": "Schools concrete crisis",
        "description": "Wales&#39; first minister says building material at centre of schools closures can be maintained. The party wanted access to documents about choices <b>Rishi Sunak</b> made on funding school repairs. Work begun at Sandbach School after RAAC was found in a refectory ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "Labour vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/rishi-sunak-says-his-parents-wanted-him-to-speak-without-an-accent-to-fit-in?trk=public_post_comment-text",
        "title": "<b>Rishi Sunak</b> says his parents wanted him to speak without an accent to ‘fit in’",
        "description": "PM says he experienced racism as a child and that his parents sent him for extra drama lessons so that he could ‘speak properly’ <b>Rishi Sunak</b> has spoken about the racism he experienced as a child and how his parents were so determined he should fit in ..."
    },
    {
        "url": "https://news.sky.com/story/pro-palestine-demonstrators-promise-to-march-for-as-long-as-it-takes-13063338",
        "title": "Pro-Palestine demonstrators promise to march for &#39;as long as it takes&#39;",
        "description": "In contrast with the constant flux of the situation in the Middle East - the US airstrikes on Iranian-linked targets the latest example - protesters&#39; demands have remained the same, ever since the first of these marches in October. Ending the war in Gaza, in their view, ends the wider regional conflict."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/police-release-footage-raid-home-28566139",
        "title": "Police release footage of raid on home in hunt for corrosive substance attack suspect",
        "description": "“Significant and important pieces of evidence” were recovered in raids at two addresses in east London and three in Newcastle, police said. They include empty containers with corrosive warnings found at one address in Newcastle, which the new footage shows."
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-orders-crack-down-dirty-money-counterfeit-goods-coming-londons-american-style-candy-shops-1723195",
        "title": "UK Orders Crack Down On &#39;Dirty Money&#39; And &#39;Counterfeit Goods&#39; Coming From London&#39;s American-Style Candy Shops",
        "description": "Police have seized more than 2,000 unlawful items from an American sweet shop in London, including fake designer products and vapes containing illegal amounts of nicotine."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "Labour ditches radical reforms as it prepares ‘bombproof’ election manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://cherwell.org/2024/02/03/a-crash-course-in-british-politics-how-elections-work-week-1/",
        "title": "A crash course in British politics: How elections work (Week 1)",
        "description": "This week’s article will explain how British elections work, and hopefully will answer all your related questions."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/100-mps-and-peers-join-call-ban-iranian-group/",
        "title": "More than 100 MPs and peers join call to ban Iranian ‘terrorist’ group",
        "description": "More than 100 parliamentarians have urged Rishi Sunak to stand up to the Iranian regime’s “belligerence” by proscribing its Islamic Revolutionary Guard Corps (IRGC) as terrorists, as Conservative MPs warned the Prime Minister: “We need a new strategy.”"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/metropolitan-police-newcastle-police-london-christianity-b1136843.html",
        "title": "Police release footage of raid on address in Abdul Ezedi manhunt",
        "description": "Police searching for alkali attack suspect Abdul Ezedi have released footage of empty containers with corrosive warnings being found by officers."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/thousands-gather-in-edinburgh-to-call-for-immediate-ceasefire-in-gaza-109709/",
        "title": "Thousands gather in Edinburgh to call for immediate ceasefire in Gaza",
        "description": "Thousands of pro-Palestine supporters gathered in Edinburgh on Saturday in support of an immediate ceasefire in Gaza. Carrying Palestinian flags and placards, they marched from Edinburgh Castle down the Royal Mile to the Scottish Parliament, shouting slogans such as: “No Justice, No Peace”, and: “Ceasefire now!”"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24095693.clapham-common-chemical-attack-police-share-video-showing-raid/",
        "title": "Clapham Common chemical attack: Police share video showing raid",
        "description": "He was put on the Sex Offenders Register for 10 years. Prime Minster <b>Rishi Sunak</b>’s spokesman said on Friday that the PM does not think “foreign criminals should be able to stay” in the UK. It has been reported that the suspect was able to gain asylum ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68190390.amp",
        "title": "Sir Bob Neill: Former Tory minister to stand down at next general election",
        "description": "Even so, I have concluded that it is right for me to spend more time supporting her.&quot; In the statement, he praised Prime Minister <b>Rishi Sunak</b> for &quot;giving the country the honest, diligent and pragmatic leadership that our country deserves&quot;, and said he ..."
    },
    {
        "url": "https://www.armaghi.com/news/armagh-news/armagh-legends-personal-thank-you-letter-from-fellow-dog-lover-pm-rishi-sunak/233797",
        "title": "Armagh legend’s personal thank you letter from ‘fellow dog lover’ PM <b>Rishi Sunak</b>",
        "description": "It comes a month after Willie was officially honoured with Prime Minister <b>Rishi Sunak</b>’s daily Point of Light award for his contributions to charity. Willie has been fundraising for 50 years and has raised over £1 million for charity in that time."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    }
]