[
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68167504",
        "title": "MP: &#39;Garrote&#39; offenders with intestines to cut fly tipping",
        "description": "Desmond Swayne has suggested drastic action to cut the number of fly tipping cases. The Conservative MP for New Forest West intervened in a Commons debate, saying the current penalties were insufficient, but if “offenders were garrotted with their own intestines” then numbers would fall."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/tricky-2023-sats-grammar-question-32003265",
        "title": "Tricky 2023 SATS grammar question has people stumped as even teachers &#39;don&#39;t have a clue&#39;",
        "description": "It&#39;s time to brush up on your grammar and get your thinking caps on - as a 2023 question designed for children in Year 6 has left grown adults, including teachers, baffled. Can you solve it?"
    },
    {
        "url": "https://www.mirror.co.uk/sport/football/news/is-football-entering-dark-age-32034189",
        "title": "&#39;Is football entering a dark age? Fans and players have never been better behaved&#39;",
        "description": "If Fleet Street thought the sex lives of football players and the behaviour of fans was worth writing about back in the day there wouldn&#39;t be any space left for actual news, writes Mirror columnist Br"
    },
    {
        "url": "https://www.thenational.scot/politics/24093807.nicola-sturgeons-covid-inquiry-session-showed-scotlands-media/",
        "title": "Nicola Sturgeon&#39;s Covid Inquiry session showed up Scotland&#39;s media",
        "description": "SCOTLAND is very poorly served by its media, the broadcast media is controlled from London and pursues an avowedly British political and"
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-rebels-sunak-dinner-tory-mps-2887828",
        "title": "Rwanda rebels did not attend <b>Sunak</b>’s dinner for Tory MPs but say it wasn’t a snub",
        "description": "Five out of 11 MPs who voted against the Safety of Rwanda bill confirmed to i they were not in attendance but insisted there was &#39;nothing to it&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-deal-with-intimidation-mps-angela-rayner/",
        "title": "<b>Sunak</b> vows to tackle intimidation faced by ‘too many’ MPs",
        "description": "Rishi Sunak has vowed to “deal with” the intimidation that many MPs face after Mike Freer, the Tory MP, announced that he was stepping down following death threats."
    },
    {
        "url": "https://www.ft.com/content/1d6cd4c5-8084-4579-aae1-f8cca14f4105",
        "title": "Stormont prepares to reconvene with region’s first nationalist leader",
        "description": "Emma Little-Pengelly, a 44-year-old barrister, former Stormont legislator and former MP, is expected to be the DUP’s pick for deputy first minister."
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-sunak-asylum-turkey-2886998?ico=best_of_opinion",
        "title": "The next asylum headache for <b>Rishi Sunak</b> is from Turkey",
        "description": "The Turkish paradox is one that highlights a central conundrum of asylum policy and one which will also haunt a Labour succession as it seeks to constrain illegal arrivals, while upholding pledges to assist those most in need of refuge."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/clapham-alkaline-attack-row-asylum-b2489543.html",
        "title": "Clapham alkaline attack: Immigration row over refugee granted asylum despite sex crimes",
        "description": "Abdul Ezedi, 35, who is on the run after an attack in Clapham, south London, on Wednesday, pleaded guilty to sexual assault and exposure in 2018 but was still granted asylum in Britain in 2021 or 2022."
    },
    {
        "url": "https://www.itv.com/news/2024-02-02/questions-over-how-suspect-in-chemical-attack-was-granted-asylum-after-offence",
        "title": "Questions over how suspect in chemical attack was granted asylum after sex offence",
        "description": "Abdul Ezedi, suspected of attacking families with a corrosive substance, was convicted of a sex offence in 2018 and later granted asylum. | ITV National News"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/labour-is-in-the-worst-of-all-worlds-with-confused-messaging-on-its-28bn-pledge",
        "title": "Labour is in the worst of all worlds with confused messaging on its £28bn pledge",
        "description": "Tories watch on delighted as Starmer continues to talk about the figure while the shadow Treasury team distances itself from it"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/turkey-safe-asylum-seekers-rwanda-immigration-b2489725.html",
        "title": "Why Turkey has dealt another blow to <b>Rishi Sunak</b>’s Stop the Boats plan",
        "description": "Rishi Sunak ’s promise to “stop the boats” has suffered another setback. The Home Office has declared Turkey an unsafe country for the purposes of asylum, meaning deporting anyone there could risk their life, in breach of domestic and international human rights law."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-back-to-the-immigration-row/",
        "title": "London Playbook PM: Back to the immigration row",
        "description": "**POLITICO Pro Financial Services UK is launching in February 2024! Providing insightful news on U.K. financial services, for City dwellers and finance up-and-comers alike, our newest policy area will unseal the vault of U.K. finance policy as it enters new territory. Get a four-week free trial here.**"
    },
    {
        "url": "https://www.thetimes.co.uk/article/a-prime-ministers-diet-is-rarely-just-about-the-food-59h5vb7fn",
        "title": "A prime minister’s diet is rarely just about the food",
        "description": "Margaret Thatcher was queen of the political kitchen but leaders have always used their professed tastes to gain an advantage"
    },
    {
        "url": "https://www.gg2.net/britain-needs-156000-homes-annually-to-manage-influx-of-immigrants/",
        "title": "Britain needs 156,000 homes annually to manage influx of immigrants",
        "description": "PRIME MINISTER Rishi Sunak is under pressure to cut immigration as new figures indicate Britain must construct 156,000 homes annually to accommodate influx,"
    },
    {
        "url": "https://www.coventrytelegraph.net/news/coventry-news/rishi-sunak-backs-bid-speedway-28559279",
        "title": "<b>Rishi Sunak</b> backs bid for speedway to return to Coventry Stadium",
        "description": "The Prime Minister, asked about the matter during Prime Minister&#39;s Questions, said he wants to see speedway and stock car racing return to Brandon Stadium"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/02/home-secretary-asks-clapham-attack-suspect-official-papers-abdul-ezedi",
        "title": "Home secretary asks for all Clapham attack suspect’s official papers",
        "description": "Rightwing Tories have seized on case after it emerged Abdul Ezedi was granted asylum despite sexual assault conviction"
    },
    {
        "url": "https://www.maidenhead-advertiser.co.uk/news/maidenhead/194369/royal-borough-council-says-vaping-crackdown-is-good-news.html",
        "title": "Royal Borough council says vaping crackdown is &#39;good news&#39;",
        "description": "A Government crackdown on vaping has been welcomed by the Royal Borough – which has previously joined calls for single-use vapes to be banned."
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-13037735/What-pharmacists-REALLY-think-Rishi-Sunaks-revolution-let-ill-Brits-bypass-GP-straight-chemist.html",
        "title": "What pharmacists REALLY think about <b>Rishi Sunak</b>&#39;s &#39;revolution&#39; to let ill Brits bypass their GP and go straight to the chemist",
        "description": "Critics have warned pharmacists are a &#39;diluted and risky alternative&#39; to doctors. Pharmacists themselves warned of the &#39;immense pressure&#39; they face."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1862340/brianna-ghey-sentencing-live",
        "title": "Brianna Ghey sentencing: Teen killers&#39; faces blank as judge jails them for life",
        "description": "A girl and a boy, who were convicted of Brianna&#39;s murder in December, have been named for the first time in a landmark ruling and will be sentenced today."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-quiz-of-the-week-cricketing-feats-and-runaway-beasts-3jzj8lj3c",
        "title": "The Times quiz of the week: cricketing feats and runaway beasts",
        "description": "A savvy animal went on the run after escaping from a wildlife park in Scotland this week, but which species was it? Meanwhile, <b>Rishi Sunak</b> announced a ban on disposable vapes, but which online publication did he use to make the statement? From a thrilling ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68181899",
        "title": "Alkali attack suspect Abdul-Shokoor Ezedi was not eligible for asylum",
        "description": "Afghan refugee Abdul-Shokoor Ezedi&#39;s 2018 sexual assault conviction in Newcastle should have disqualified him from asylum. But his claim was approved after being rejected twice, despite him being placed on the Sex Offenders Register. Police are hunting for Ezedi after a corrosive substance attack."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/",
        "title": "Politics latest news: Labour starts pre-election talks with civil service",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://uk.news.yahoo.com/labours-angela-rayner-doesnt-scary-195909417.html",
        "title": "Labour&#39;s Angela Rayner &#39;doesn&#39;t go out&#39; after &#39;scary&#39; confrontation with protesters",
        "description": "Labour’s deputy leader Angela Rayner has said she is scared to go out socially after being targeted by protesters amid the ongoing Israel-Gaza conflict. Speaking in an interview with Sky News on Friday, the Labour frontbencher said she had been forced to change her day-to-day behaviour after being intimidated in public."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-apology-rosamund-adoo-kissidebrah-ella-died-air-pollution-asthma-south-circular-b1136576.html",
        "title": "Sadiq Khan apologises to mother of Ella Adoo-Kissi-Debrah after her air pollution asthma death",
        "description": "Mayor issues &#39;full and unqualified apology&#39; to Rosamund Adoo-Kissi-Debrah for the loss of her daughter Ella in 2013"
    },
    {
        "url": "https://www.standard.co.uk/news/londoners-diary/dominic-cummings-asks-oxford-students-to-help-him-win-power-b1136597.html",
        "title": "Dominic Cummings asks Oxford students to help him win power",
        "description": "Dominic Cummings is building a political army and his first recruiting station is the University of Oxford. In the hallowed debating chamber of the Oxford Union last night, the former chief adviser to Boris Johnson called on the university’s bright young minds to join him in an attempt to take power."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/labour-commences-access-talks-with-civil-service-99173/",
        "title": "Labour commences access talks with civil service",
        "description": "Labour has commenced access talks with the civil service in preparation for a potential change of government after the general election. Sir Keir Starmer wrote to Cabinet Secretary Simon Case to request to start the preparations last month after Rishi Sunak authorised that the talks could begin."
    },
    {
        "url": "https://www.ft.com/content/16ec4c4c-b5d6-4198-89be-d825f8d2efaf?shareType=nongift",
        "title": "Welcome to the era of the non-state actor",
        "description": "We can no longer hold out hope that it was an AI-generated deep fake. Last autumn, <b>Rishi Sunak</b> really did interview Elon Musk on stage. To repeat, a serving head of government took the junior role to a businessman at a public event. As piercing and ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-rebels-sunak-dinner-tory-mps-2887828?ico=related_article_inline",
        "title": "Rwanda rebels did not attend <b>Sunak</b>’s dinner for Tory MPs but say it wasn’t a snub",
        "description": "Five out of 11 MPs who voted against the Safety of Rwanda Bill confirm to i they were not in attendance but say there was &#39;nothing to it&#39;"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/labour-commences-access-talks-with-civil-service-109652/",
        "title": "Labour commences access talks with civil service",
        "description": "Labour has commenced access talks with the civil service in preparation for a potential change of government after the general election. Sir Keir Starmer wrote to Cabinet Secretary Simon Case to request to start the preparations last month after Rishi Sunak authorised that the talks could begin."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1862517/robert-taylor-rishi-sunak-get-a-grip-or-go",
        "title": "<b>Rishi Sunak</b> must get a grip or go now, writes Robert Taylor",
        "description": "I’m a <b>Rishi Sunak</b> fan. He is a committed, hard-working prime minister, with good conservative instincts. He has steadied the ship following the disastrous Liz Truss, and righted the economy after the idiocy of lockdown. The Prime Minister has done his ..."
    },
    {
        "url": "https://www.insider.co.uk/news/uk-should-more-positive-ai-32031321",
        "title": "UK should be more positive about AI to avoid missing out on tech &#39;gold rush&#39;",
        "description": "The UK’s approach to artificial intelligence (AI) has become too narrowly focused on safety and the threats the technology could pose, rather than its benefits, meaning it could “miss out on the AI gold rush”."
    },
    {
        "url": "https://uk.style.yahoo.com/smoking-ban-vaping-young-people-poll-results-141101777.html",
        "title": "Should smoking be completely banned? Yahoo readers have their say",
        "description": "It received 10,567 votes and showed 67% of Yahoo readers agreed strongly with a complete ban on smoking for younger people. Some 27% of voters said they did not agree &#39;at all&#39; with the ban, while just 6% did not lean either way."
    },
    {
        "url": "https://www.edie.net/un-climate-chief-calls-on-uk-to-seriously-re-engineer-emissions-plans/",
        "title": "UN climate chief calls on UK to ‘seriously re-engineer’ emissions plans",
        "description": "Stiell pledges transformative efforts for a net-zero global economy at COP29. Aims to unlock finance for emissions reductions and sustainable development."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/nottingham-killer-valdo-calocane-refused-32028441",
        "title": "Nottingham killer Valdo Calocane &#39;refused to give hair sample&#39; amid sentence controversy",
        "description": "Police reportedly never took toxicology samples from Valdo Calocane, who went on a knife rampage in Nottingham killing three people, which potentially means he could have avoided a tougher sentence"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/02/abdul-ezedi-tory-ex-minister-calls-for-review-of-how-chemical-assault-suspect-gained-asylum",
        "title": "No 10 questions UK status of ‘foreign criminals’ amid chemical assault row",
        "description": "Robert Jenrick says granting of asylum to Abdul Ezedi despite sexual assault conviction raises serious concerns"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/turkey-home-office-rishi-sunak-recep-tayyip-erdogan-home-secretary-b1136543.html",
        "title": "Hopes for Turkey migrant returns deal dashed after Home Office review – report",
        "description": "According to the paper, the Home Office review found that an analysis showed that 99% of Turkish asylum cases to the UK were based on “a fear of the state”, with the document also critical of the country’s “over-zealous” use of anti-terrorism law and the independence of the courts."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-italy-seek-innovative-partnerships-131559788.html",
        "title": "UK, Italy seek &#39;innovative partnerships&#39; to deal with illegal migration",
        "description": "LONDON (Reuters) -British Prime Minister Rishi Sunak and Italian Prime Minister Giorgia Meloni agreed to keep working together to deal with illegal migration by developing &quot;innovative partnerships&quot; along migration routes,"
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-tells-tories-england-cricket-132133378.html",
        "title": "<b>Sunak</b> tells Tories they are like England cricket team – down but not out",
        "description": "<b>Rishi Sunak</b> tried to cheer up deflated Conservative MPs by comparing the party to England cricket’s heroes. The prime minister likened the Tories to the English cricketers who produced an unlikely comeback by beating India in the first test. The ..."
    },
    {
        "url": "https://uk.yahoo.com/news/london-paloma-faith-150010473.html",
        "title": "My London: Paloma Faith",
        "description": "In Abney Park Cemetery — and for all the gay men to cottage on my grave. Couldn’t do much to get rid of <b>Rishi Sunak</b> in a day, could I? So in which case I’d give Soho back to Soho. I literally spent my whole life there, so many stories and it’s ..."
    }
]