[
    {
        "url": "https://www.wsws.org/en/articles/2024/01/25/lvbd-j25.html",
        "title": "Britain’s top army general issues call for conscription and “whole of nation mobilisation” for war",
        "description": "The Times reported, “No 10 has repeatedly blocked military chiefs from speaking to the media and insiders have blamed <b>Rishi Sunak</b> for being paranoid about messaging before the general election.” The reason for <b>Sunak</b>’s intervention is clear ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-dangerous-war-talk-31969979",
        "title": "<b>Rishi Sunak</b>&#39;s dangerous war talk bluster could spark off genuine conflict",
        "description": "A top NATO commander says the UK&#39;s alliance with Ukraine - after Sunak increased military aid to £2.5billion a year - is preparing for a conflict with Russia “in the next 20 years”"
    },
    {
        "url": "https://www.politicshome.com/news/article/no-10-halts-police-funding-plans-over-electoral-basklash-concern",
        "title": "Downing Street Halts New Police Funding Plan Over Fears Of Election Backlash",
        "description": "A long-planned new formula for how the police are funded has been put on hold over concern among ministers that it could result in some local"
    },
    {
        "url": "https://news.sky.com/story/nearly-10bn-written-off-value-of-ppe-bought-during-covid-pandemic-13056349",
        "title": "Nearly £10bn written off value of PPE bought during COVID pandemic",
        "description": "Labour&#39;s shadow health secretary Wes Streeting said &quot;Rishi Sunak threw away taxpayers&#39; money as if it were confetti&quot; when chancellor, but the government insisted the decision to try to secure PPE for frontline health and care workers &quot;was right&quot;."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/brexit/rishi-sunaks-offer-to-dup-on-sea-border-makes-a-nonsense-of-brexit-warns-jim-allister/a1159820922.html",
        "title": "<b>Rishi Sunak</b>’s offer to DUP on sea border ‘makes a nonsense of Brexit’, warns Jim Allister",
        "description": "Jim Allister has warned that the Prime Minister’s reported offer to sacrifice some of Britain’s freedoms in a bid to appease the DUP and restore power-sharing “would make a nonsense of Brexit”."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7126026",
        "title": "Politics latest: <b>Sunak</b> responds to plot to oust him - as MP warns of &#39;alarming&#39; change that may hit your travel plans",
        "description": "A defiant <b>Rishi Sunak</b> has insisted he is &quot;making progress&quot; on delivering for the country after it emerged a former adviser is working with a group of Tory rebels to oust him. Meanwhile, it&#39;s been revealed how much severance pay Liz Truss received after ..."
    },
    {
        "url": "https://uk.news.yahoo.com/israel-braces-interim-ruling-gaza-191942259.html",
        "title": "Israel braces for interim ruling on Gaza genocide allegation from UN’s top court",
        "description": "The Hague-based International Court of Justice (ICJ) has been deliberating a case brought by South Africa that Israel calls baseless"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/police-targeted-miners-just-post-31969361",
        "title": "&#39;Police targeted miners just as the Post Office went for postmasters - now time for justice&#39;",
        "description": "Fire Brigades Union leader Matt Wrack is calling on the Government to overturn convictions from the 1984 Miners&#39; Strike and offer compensation"
    },
    {
        "url": "https://inews.co.uk/news/politics/george-osborne-secret-tory-leadership-plotters-2873697",
        "title": "Secret Tory plotters are ‘casting a shadow’ over the party, George Osborne says",
        "description": "Ex-chancellor says Conservative Britain Alliance is &#39;casting a big shadow&#39; over the party amid questions over Sunak&#39;s leadership"
    },
    {
        "url": "https://www.itv.com/news/central/2024-01-25/nottingham-attacks-999-call-alerting-police-to-triple-killer-valdo-calocane",
        "title": "Nottingham attacks: Chilling 999 call alerting police to triple killer Valdo Calocane",
        "description": "<b>Rishi Sunak</b> sent his “heartfelt condolences” to the families of three people killed in the Nottingham attacks, as Downing Street said agencies should learn any lessons required from the incident. A spokeswoman for the prime minister said ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/sunak-prepared-to-defy-european-court-over-rwanda-despite-judges-warning-367567/",
        "title": "<b>Sunak</b> prepared to defy European court over Rwanda despite judge’s warning",
        "description": "<b>Rishi Sunak</b> said he was prepared to defy the European Court of Human Rights over his Rwanda plan despite a senior judge warning he would be breaking international law by doing so. The Prime Minister said he would not have put powers to ignore the court in ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/25/uk-government-wasted-nearly-10bn-on-unused-covid-ppe-figures-show",
        "title": "UK government wasted nearly £10bn on unused Covid PPE, figures show",
        "description": "Wes Streeting, the shadow health secretary, said: “As chancellor, <b>Rishi Sunak</b> threw away taxpayers’ money as if it were confetti and has failed to get our money back. <b>Sunak</b>’s carelessness has cost our country dear. Never again can the Conservatives ..."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1859871/tory-mps-trump-biden-election",
        "title": "MPs should beware getting stuck into the US election - voters hate both Trump and Biden",
        "description": "So having senior Conservative figures openly back such an unpopular international figure in the throes of a general election campaign can be added to a list of <b>Rishi Sunak</b>’s worries. But it should be noted that just as our cousins across the ocean ..."
    },
    {
        "url": "https://thelincolnite.co.uk/2024/01/rishi-sunak-pledged-not-to-allow-great-swathes-solar-farm-plans-in-lincolnshire/",
        "title": "<b>Rishi Sunak</b> pledged not to allow “great swathes” solar farm plans in Lincolnshire",
        "description": "Dr Caroline Johnson MP said that Prime Minister Rishi Sunak had pledged not to allow “great swathes” of the Lincolnshire countryside to be occupied by solar panels, and that she will meet with more policymakers in the coming days and weeks to further present the case against Nationally Significant Infrastructure Projects (NSIP) in our region."
    },
    {
        "url": "https://metro.co.uk/2024/01/25/bully-dog-happy-begging-treats-minutes-attacking-two-men-20173165/?ico=trending-module_author_katie-boyden_item-1",
        "title": "Bully dog was ‘happy and begging for treats’ minutes before attacking two men",
        "description": "All XL Bullies must be muzzled and on a lead in public. Last year, prime minister <b>Rishi Sunak</b> called the breed a ‘danger to communities’ after Ian Price was killed by two of the dogs while protecting his elderly mum. Two people were arrested after a ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24073877.fears-public-inquiry-pressurise-coast-coast-work/",
        "title": "Fears public inquiry could pressurise Coast to Coast work",
        "description": "The developers of a new national Coast to Coast trail pushed forward by Rishi Sunak have expressed concerns over the route’s progress."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/pm-insists-he-is-making-progress-despite-tory-warnings-of-electoral-massacre-367569/",
        "title": "PM insists he is ‘making progress’ despite Tory warnings of electoral ‘massacre’",
        "description": "Rishi Sunak has told Conservatives fearing they face being electorally “massacred” that he is “making progress&quot;."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24075728.rishi-sunak-visits-construction-skills-village-scarborough/",
        "title": "<b>Rishi Sunak</b> visits Construction Skills Village, Scarborough",
        "description": "Prime Minister Rishi Sunak admitted it was a stressful moment as he helped wire up a fuse box at a construction training centre and waited to see"
    },
    {
        "url": "https://inews.co.uk/opinion/farage-reform-tories-existential-panic-2873287?ico=more_from_this_author",
        "title": "Farage is sending the Tories into an existential panic",
        "description": "Has Simon Clarke really succeeded in uniting the Conservative Party? The former Cabinet minister’s demand this week that his colleagues replace <b>Rishi Sunak</b> to avoid being “massacred” at the next election was met largely with noisy jeering – and ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006903/Rishi-Sunak-progress-Tory-rebels-Farage-Reform-Labour.html",
        "title": "<b>Rishi Sunak</b> insists he is making &#39;progress&#39; as Tory rebels plot to replace him with the party just SEVEN points ahead of Nigel Farage&#39;s Reform while Labour has a lead of 34 in ...",
        "description": "Two polls released today gave Labour a huge lead in its main target seats, and gave the Conservatives a narrowing lead over third-placed Reform UK."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-concerned-civilian-killings-gaza-163037751.html",
        "title": "<b>Sunak</b> ‘concerned’ by civilian killings in Gaza",
        "description": "<b>Rishi Sunak</b> says he is ‘concerned’ about the loss of life in Gaza, after ITV News broadcast footage showing a civilian man being fatally shot whilst carrying a white flag."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/rwanda-policy-rishi-sunak-migration-echr-illegal/",
        "title": "Europe’s top judge sets up Rwanda showdown with <b>Sunak</b>",
        "description": "<b>Rishi Sunak</b> is on course for a showdown with a European court over his Rwanda deportation scheme after Strasbourg’s most senior judge ruled that the plans were unlawful. Siofra O’Leary, the president of the European Court of Human Rights, said on ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/hospital-consultants-narrowly-reject-pay-9058612",
        "title": "Hospital consultants narrowly reject pay offer",
        "description": "Shadow health secretary Wes Streeting said: “Last week, <b>Rishi Sunak</b> was bragging that NHS doctors had accepted his pay offer. This vote shows he was trying to pull the wool over the public’s eyes. “The NHS is in the second year of strikes."
    },
    {
        "url": "https://www.channel4.com/news/senior-tories-reject-call-for-rishi-sunak-to-resign",
        "title": "Senior Tories reject call for <b>Rishi Sunak</b> to resign",
        "description": "“Foolish”, “self-indulgent” and “divisive” – that’s the furious response from Conservative MPs to one of their colleagues who called on Rishi Sunak to resign yesterday."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/24/rishi-sunak-tory-critics-six-weeks-turn-premierhsip-around/?utmsource=email",
        "title": "<b>Rishi Sunak</b>’s Tory critics warn he has six weeks to turn premiership around",
        "description": "Tory critics of <b>Rishi Sunak</b> are warning he has six weeks to improve the party’s electoral fortunes or face more Conservative MPs going public with their discontent. The two by-elections on Feb 15 and the Budget on March 6 are being earmarked by the Prime ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24070162.really-comparing-johnson-sturgeon-seriously/?ref=eb",
        "title": "Are we really comparing Johnson and Sturgeon? Seriously?",
        "description": "While <b>Rishi Sunak</b> seems to have been given a free ride by the UK press over the unavailability of his WhatsApp messages, speculation abounds about what was contained in Nicola Sturgeon’s social media messages with some (without even knowing what was ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/hospital-consultants-narrowly-reject-pay-28513675",
        "title": "Hospital consultants in England narrowly reject pay offer",
        "description": "Walk-outs by various staff groups including doctors, nurses, paramedics and physiotherapists have led to more than 1.3 million appointments, procedures and operations being rescheduled by the NHS"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24075728.prime-minister-visits-construction-skills-village-scarborough/",
        "title": "Prime Minister visits Construction Skills Village, Scarborough",
        "description": "Prime Minister Rishi Sunak admitted it was a stressful moment as he helped wire up a fuse box at a construction training centre and waited to see"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/mayor-sheds-more-light-agreement-28513113",
        "title": "Mayor sheds more light on &#39;agreement&#39; with company at centre of Post Office scandal",
        "description": "Andy Burnham has shed more light on the agreement he signed with scandal-hit software firm Fujitsu. Japanese company Fujitsu has been at the centre of the Post Office scandal, with its faulty Horizon accounting software being used to convict more than 900 sub-postmasters and sub-postmistresses for years."
    },
    {
        "url": "https://uk.news.yahoo.com/down-drain-9-9-billion-173949784.html",
        "title": "&#39;Down The Drain&#39;: £9.9 Billion Spent On Covid PPE Written Off By Government",
        "description": "According to the annual report, the government spent £13.6bn on PPE. Since then “the department has written down the value of its PPE inventory by £9.9 billion because it was unusable or its market price had fallen since it was purchased during the pandemic.”"
    },
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/rishi-sunak-declines-back-call-9058551",
        "title": "<b>Rishi Sunak</b> declines to back call for public inquiry into Nottingham attacks",
        "description": "Prime Minister Rishi Sunak has declined to back calls for an inquiry into the Nottingham attacks after being asked directly about it today (January 25). Nottinghamshire Live has today called for an inquiry to be launched into the circumstances that led to psychotic killer Valdo Calocane brutally slaying three people and trying to kill three more."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/prime-minister-rishi-sunak-weathers-blown-fuse-fears-in-visit-to-yorkshire-construction-training-centre-4493355",
        "title": "Prime Minister <b>Rishi Sunak</b> weathers blown fuse fears in visit to Yorkshire construction training centre",
        "description": "Prime Minister Rishi Sunak admitted it was a stressful moment as he helped wire up a fuse box at a construction training centre and waited to see if the lights came on once the switch was thrown."
    },
    {
        "url": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-un-genocide-south-africa-b2485017.html",
        "title": "Israel braces for interim ruling on Gaza genocide allegation from UN’s top court",
        "description": "The Hague-based International Court of Justice (ICJ) has been deliberating a case brought by South Africa that Israel calls baseless"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/25/simon-clarke-rishi-sunak-ship-jumping-polls-guru-sketch",
        "title": "You don’t need to be a ship-jumping polls guru to work out Rish!’s numbers are dire",
        "description": "It seems Simple Simon Clarke wasn’t entirely alone in his failed rebellion – enter previously unknown Will Dry"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-prime-minister-labour-mps-conservative-b1134881.html",
        "title": "PM insists he is ‘making progress’ despite Tory warnings of electoral ‘massacre’",
        "description": "Rishi Sunak has told Conservatives fearing they face being electorally “massacred” that he is “making progress”, as he urged them to stick with his plan. Former Cabinet minister Sir Simon Clarke’s warning that the Tories face oblivion at the next election without a change in the Prime Minister was followed by fresh gloom from an adviser."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scarborough-prime-minister-north-yorkshire-graham-westminster-b1134889.html",
        "title": "<b>Sunak</b> weathers blown fuse fears in visit to construction training centre",
        "description": "The Prime Minister admitted to a ‘nervous moment’ as he helped wire up a fuse box at the Construction Skills Village in Scarborough."
    },
    {
        "url": "https://www.propertyroad.co.uk/1-deposit-mortgages/",
        "title": "Will 1% Deposit Mortgages Help Struggling First-Time Buyers?",
        "description": "The government has come up with a new plan to help people onto the housing ladder: 1% deposit mortgages. But will it work?"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68098666",
        "title": "Blair: World is undergoing new Industrial Revolution",
        "description": "Sir Tony Blair has said that current global changes are of &quot;even greater magnitude&quot; than the 19th century Industrial Revolution."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/breaking-hospital-strikes-continue-nhs-31968898",
        "title": "NHS consultants reject Government pay offer in massive blow for <b>Rishi Sunak</b>",
        "description": "NHS consultants from the British Medical Association in England voted 51.1% against a pay deal aimed at ending the long dispute over their wages"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006763/nhs-GP-drives-elderly-patient-hospital-three-hours-ambulance-wait.html",
        "title": "Moment furious GP films himself driving deteriorating elderly patient to A&amp;E after waiting three hours in vain for an ambulance",
        "description": "This is the shocking moment when a desperate doctor was forced to &#39;save&#39; a sick patient by driving him to an A&amp;E - after waiting three hours for an ambulance."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-declines-to-back-calls-for-public-inquiry-into-nottingham-attacks-108992/",
        "title": "<b>Sunak</b> declines to back calls for public inquiry into Nottingham attacks",
        "description": "Barnaby Webber’s mother Emma said Nottinghamshire Police had ‘blood on your hands’ after a triple killer was sentenced."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/drew-hendry-our-mp-faces-toughest-battle-to-hold-on-to-his-340230/",
        "title": "COLIN CAMPBELL: Our MP faces toughest battle to hold on to his seat",
        "description": "Councillor Angus MacDonald and MP Drew Hendry. Drew Hendry has entered his 10th year as MP for the Inverness constituency, and the question looms large as to whether or not he wil"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/emma-prime-minister-nottinghamshire-police-nottingham-north-yorkshire-b2484921.html",
        "title": "<b>Sunak</b> declines to back calls for public inquiry into Nottingham attacks",
        "description": "<b>Rishi Sunak</b> has declined to back calls for a public inquiry into the circumstances that led to the Nottingham attacks. It comes after a judge handed down a hospital order to Valdo Calocane, who has paranoid schizophrenia and whose pleas to manslaughter by ..."
    }
]