[
    {
        "url": "https://www.dailymail.co.uk/news/article-12872419/Rwanda-Sir-Keir-Labour-candidate-sells-CHILDRENs-holidays-illegal-migrants.html",
        "title": "Still say Rwanda isn&#39;t safe Sir Keir? Labour candidate sells CHILDREN&#39;s holidays to the very country party insists is too risky for illegal migrants",
        "description": "<b>Rishi Sunak</b> last week oversaw a potential Commons rebellion to introduce legislation to designate Rwanda a safe country – after the Supreme Court ruled his proposals to send asylum seekers there unlawful. Last week Labour leader Sir Keir Starmer said he ..."
    },
    {
        "url": "https://www.sthelensstar.co.uk/news/23992716.teenage-social-media-ban-considered-rishi-sunak/",
        "title": "Teenage social media ban being considered by <b>Rishi Sunak</b>",
        "description": "The Government wants to review the possible link between social media use and the impact on the mental health of children"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/jeremy-hunt-treating-voters-fools-31690182",
        "title": "&#39;Jeremy Hunt is treating voters as fools - but they know they&#39;re being taken for a ride&#39;",
        "description": "Jeremy Hunt&#39;s national insurance cut will land in pay packets next month but it is less a handout and more sleight of hand because we will still pay more tax overall"
    },
    {
        "url": "https://www.thesun.co.uk/news/25078467/rishi-sunak-democracy-britain-illegal-migration/",
        "title": "<b>Rishi Sunak</b> needs to come out fighting in 2024 from day one",
        "description": "PM must come out fighting in 2024 RISHI Sunak warned yesterday that the very future of democracy depends on Britain getting to grips with illegal migration. Spot on, PM. The Sun has warned many"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/we-dont-want-them-back-in-bags-israelis-protest-government-inaction-over-hostages/",
        "title": "&#39;We don&#39;t want them back in bags&#39;: Israelis protest &#39;government inaction&#39; over hostages",
        "description": "Waving placards and flags thousands arrived to protest what they see as government inaction over the plight of the hostages."
    },
    {
        "url": "https://www.varsity.co.uk/comment/26610",
        "title": "How to queer your life when the government won’t",
        "description": "On 4th October 2023, <b>Rishi Sunak</b> addressed his party at the annual Conservative party conference. “A man is a man and a woman is a woman,” he said, “that’s just common sense”. During a similar speech, one party member was removed by police for ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/hundreds-people-take-streets-latest-28303981",
        "title": "Hundreds of people take to the streets for latest pro-Palestine march in Manchester",
        "description": "Hundreds of people took to the streets for the latest pro-Palestine march in Manchester. Protestors held placards and led chants as they made their way from Platt Fields Park in Fallowfield to the city centre, eventually stopping at St Peter&#39;s Square."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-haunted-man-deepening-31689536",
        "title": "&#39;<b>Rishi Sunak</b> is a haunted man as deepening woes signal the end of his Tory regime&#39;",
        "description": "Keir Mudie says Rishi Sunak is a Scrooge who hasn’t learned any lessons, despite what the ghosts are telling him - and a horrible festive season is in store for him"
    },
    {
        "url": "https://www.politico.eu/article/uks-sunak-likens-italys-meloni-to-margaret-thatcher/",
        "title": "UK’s <b>Sunak</b> likens Italy’s Meloni to Margaret Thatcher",
        "description": "British prime minister calls on European leaders to channel the old Conservative leader’s ‘radicalism’ and challenge decades-old rules on refugees."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-rwanda-tories-labour-election-polls-b2464856.html",
        "title": "<b>Rishi Sunak</b> faces election wipeout even if flights to Rwanda take off, top pollster warns",
        "description": "Exclusive: Devastating forecast has Tories heading for landslide defeat – as voters care more about economy and NHS rather than deportation policy"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/16/labour-lead-slips-to-13-points-poll-nhs-priority-sunak-rwanda",
        "title": "Labour lead slips to 13 points in poll that shows NHS is voters’ main priority",
        "description": "Sunak’s approval increases slightly after surviving potential rebellion over Rwanda bill"
    },
    {
        "url": "https://www.express.co.uk/news/world/1846432/rishi-sunak-migration-giorgia-meloni-vladimir-putin",
        "title": "<b>Rishi Sunak</b> warns refugees are being used as a weapon to &#39;overwhelm&#39; Britain",
        "description": "Mr Sunak did not name names - but it is highly likely he was at least in part referring to Vladimir Putin&#39;s Russia."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/23994858.school-suspensions-hit-record-high-last-autumn-term-study-says/",
        "title": "School suspensions hit record high last autumn term, study says",
        "description": "There was a record high of a quarter of a million suspensions from school in last year’s autumn term, affecting 135,000 pupils, according to new data. An analysis of Department for Education data by the Centre for Social Justice found that 6,"
    },
    {
        "url": "https://inews.co.uk/news/school-suspensions-hit-staggering-record-high-in-the-autumn-term-last-year-2813020",
        "title": "School suspensions hit ‘staggering’ record high in the autumn term last year",
        "description": "A report also noted that pupils from some ethnic groups, including Roma, Irish Traveller and black Caribbean, face &#39;disproportionate rates&#39; of school exclusion"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/16/counter-extremism-plans-sitting-on-shelf-dame-sara-khan/",
        "title": "Britain’s counter-extremism plans ‘sitting on a shelf gathering dust’, says former commission head",
        "description": "Dame Sara Khan voices concern for the nation after Home Office failed to respond to her reports of ‘unprecedented’ levels of radicalisation"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872193/Sir-tony-blair-david-cameron-speculation-keir-starmer-lord-labour-cabinet.html",
        "title": "Sir Tony Blair says he has no interest in &#39;doing a Cameron&#39; amid speculation Keir Starmer could make him a Lord and bring him back to Labour cabinet",
        "description": "David Cameron made a shock return to politics as the new Foreign Secretary last month, displacing James Cleverly who has since taken over in the Home Office"
    },
    {
        "url": "https://www.thetimes.co.uk/article/love-in-by-the-tiber-sunak-and-meloni-find-common-ground-vpqrdj0d5",
        "title": "Love-in by the Tiber: <b>Sunak</b> and Meloni find common ground",
        "description": "Rishi Sunak waded into one of the odder events on the global political calendar when he spoke on Saturday at Atreju, a festival of ideas run by Giorgia Meloni, head of the Brothers of Italy party and the prime minister of Italy."
    },
    {
        "url": "https://www.wokingnewsandmail.co.uk/news/hitler-post-investigated-as-tory-county-councillor-for-woking-north-is-suspended-655963",
        "title": "‘Hitler’ post investigated as Tory county councillor for Woking North is suspended",
        "description": "The Conservative county councillor for Woking North, Riasat Khan, has been suspended for an offensive social-media post."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/16/rishi-sunak-faces-tory-rebellion-over-candidate-selection/",
        "title": "<b>Sunak</b> faces Tory rebellion over ‘plan to stitch up’ candidate selection",
        "description": "Rishi Sunak is facing a revolt from the Right of his party over alleged plans to impose shortlists of parliamentary candidates on Tory associations."
    },
    {
        "url": "https://leftfootforward.org/2023/12/hilarious-clip-of-rishi-sunaks-lack-of-memory-at-the-covid-inquiry-goes-viral/",
        "title": "Hilarious clip of <b>Rishi Sunak</b>’s lack of memory at the Covid Inquiry goes viral",
        "description": "Rishi Sunak was in the Covid Inquiry hot seat this week, where he was grilled over his controversial ‘Eat Out to Help Out’ discount hospitality scheme. During the six hours of questioning, Sunak insisted the scheme was the ‘right thing to do,’ while arguing his ‘Dr Death’ nickname was not justified."
    },
    {
        "url": "https://www.thesun.co.uk/news/25077649/rishi-sunak-gamble-rwanda-job-vacancies-brits/",
        "title": "<b>Rishi Sunak</b> made a foolish gamble staking his career on Rwanda, we must fill 1million job vacancies with Brits instead",
        "description": "Keir Starmer says he wants to target people traffickers and “smash the gangs”. Don’t we all? In March, <b>Rishi Sunak</b> pledged £480million to France, spread over three years, to invest in police, technology and intelligence, to reduce the illegal ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-accused-misleading-public-073115102.html",
        "title": "<b>Rishi Sunak</b> accused of misleading public over Tory campaign questionnaire landing on doorsteps",
        "description": "The leaflets, branded potentially misleading and “routine party propaganda”, asks who voters backed at the last election and who they would prefer as prime minister - Sunak or Starmer. It is delivered alongside a letter headed “Rishi Sunak Prime Minister”, which twice asks: “What are your priorities for Britain? Tell the prime minister”."
    },
    {
        "url": "https://www.yahoo.com/news/rishi-sunak-meeting-asylum-pledge-011920059.html",
        "title": "Is <b>Rishi Sunak</b> meeting his asylum pledge?",
        "description": "The government is set to grant record numbers of people asylum this year as it tries to meet one of <b>Rishi Sunak</b>&#39;s key pledges on illegal immigration. On 13 December 2022, Mr <b>Sunak</b> said he wanted to &quot;abolish&quot; the legacy backlog of claims by the end of 2023."
    },
    {
        "url": "https://www.france24.com/en/live-news/20231216-italy-uk-leaders-unite-on-migration-agree-tunisia-deal",
        "title": "Italy, UK leaders unite on migration, agree Tunisia deal",
        "description": "British Prime Minister Rishi Sunak hailed Italian premier Giorgia Meloni&#39;s approach to tackling illegal migration Saturday, in a visit to Rome where they agreed to co-fund a project to help"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/16/minister-warns-rishi-sunak-labour-outflanking-tories/",
        "title": "Minister warns <b>Rishi Sunak</b> that Labour is outflanking Tories on the Right",
        "description": "Private paper co-written by Steve Baker details in stark terms the threat that Conservatives face from Sir Keir Starmer"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/rishi-sunak-diverted-raf-jet-31689182",
        "title": "<b>Rishi Sunak</b> diverted RAF jet to pick him up after political event and take him to Rome",
        "description": "Downing Street confirmed while the Prime Minister travelled to Teeside via train to campaign in a marginal seat near his home, the jet flew there from London."
    },
    {
        "url": "https://www.standard.co.uk/news/world/layla-moran-lib-dem-family-gaza-israel-risk-b1127430.html",
        "title": "Lib Dem MP worried for safety of family going without food and water",
        "description": "On Saturday, Ms Moran - who is of Palestinian descent - tweeted about the plight of her relatives who are stuck in Holy Family Church in Gaza City as Israeli Defense Force soldiers remain outside. She wrote: “Soldiers are at the gates and there was a fire when they hit one of the (already dysfunctional) generators."
    },
    {
        "url": "https://www.theguardian.com/world/2023/dec/16/sunak-accused-toxic-rhetoric-after-warning-overwhelming-migration-europe?ref=mc.news",
        "title": "<b>Sunak</b> accused of toxic rhetoric after warning of ‘overwhelming’ migration to Europe",
        "description": "Prime minister makes controversial remarks at Rome conference organised by Giorgia Meloni’s party"
    },
    {
        "url": "https://www.itv.com/news/2023-12-16/school-suspensions-hit-record-high-of-247400-last-autumn-term-study-says",
        "title": "School suspensions hit record high of 247,400 last autumn term, study says",
        "description": "New data shows that more than one million days were lost to suspensions over the course of the academic year. | ITV National News"
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/rwanda-policy-distraction-rishi-sunak-nhs-b2465294.html",
        "title": "The Rwanda policy is a distraction from what really matters to people",
        "description": "Editorial: The deportation plan is unwise on Rishi Sunak’s own terms, because the voters care about prices and the NHS more"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12871889/Rishi-Sunak-Italian-PM-Giorgia-Meloni-touchy-feely-hug-Rome.html",
        "title": "That&#39;s some VERY close political co-operation! <b>Rishi Sunak</b> and Italian PM Giorgia Meloni look delighted to get touchy-feely as they hug on Prime Minister&#39;s trip to Rome",
        "description": "The Prime Minister and his Italian counterpart were delighted to get touchy-feely with one another as they met in the country&#39;s capital for an event organised by Ms Meloni&#39;s right-wing party."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-says-migration-threatens-to-overwhelm-europe-13031810",
        "title": "<b>Rishi Sunak</b> says migration threatens to &#39;overwhelm&#39; Europe",
        "description": "The prime minister has been battling to pass his Rwanda bill, which has split Conservatives as it does not allow the UK to override the European Convention on Human Rights."
    },
    {
        "url": "https://www.thenational.scot/news/23994703.rishi-sunak-says-migration-used-weapon/",
        "title": "<b>Rishi Sunak</b> says migration being ‘used as weapon’",
        "description": "CHANGES to global refugee rules could be needed to tackle illegal migration, Prime Minister Rishi Sunak has claimed, adding that migrants"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-giorgia-meloni-italy-tunisia-edi-rama-b1127421.html",
        "title": "<b>Sunak</b> warns of migrant threat as UK and Italy agree to fund Tunisia plan",
        "description": "During a trip to Rome Mr Sunak met Italian prime minster Giorgia Meloni, with whom he has developed a strong partnership."
    },
    {
        "url": "https://uk.news.yahoo.com/migration-being-used-weapon-rishi-170708072.html",
        "title": "Migration being ‘used as weapon’, <b>Rishi Sunak</b> tells far-right allies in Rome",
        "description": "CHANGES to global refugee rules could be needed to tackle illegal migration, Prime Minister <b>Rishi Sunak</b> has claimed, adding that migrants could “overwhelm” European countries. At a gathering of Italian conservatives and right-wingers in Rome, ..."
    },
    {
        "url": "https://www.channel4.com/news/sunak-says-migrants-could-overwhelm-european-countries",
        "title": "<b>Sunak</b> says migrants could ‘overwhelm’ European countries",
        "description": "The Prime Minister <b>Rishi Sunak</b> has claimed migrants could “overwhelm” European countries – as he called for radical solutions to tackle illegal migration. Mr <b>Sunak</b> was speaking at the right-wing Brothers of Italy gathering in Rome, hosted by the ..."
    }
]