[
    {
        "url": "https://www.channel4.com/news/middle-east-tension-sunak-says-attacks-on-houthi-are-unrelated-to-israel-gaza-conflict",
        "title": "Middle-East tension: <b>Sunak</b> says attacks on Houthi are unrelated to Israel-Gaza conflict",
        "description": "Rishi Sunak has told MPs that last week’s strikes on Houthi infrastructure were unrelated to the conflict between Israel and Gaza. Speaking to a largely sympathetic Commons, he said the US led attacks were carried out in self defence in response to attacks on shipping in the Red Sea."
    },
    {
        "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-01-15-24/h_2bdafce0648d3c9b974ec31347f6ebbe",
        "title": "The latest on Israel&#39;s war in Gaza",
        "description": "Israel&#39;s Prime Minister Benjamin Netanyahu said &quot;nobody will stop us&quot; from destroying Hamas as the war in Gaza passed the 100-day mark. Follow live updates."
    },
    {
        "url": "https://news.sky.com/story/beth-rigby-there-are-still-battles-the-pm-can-win-but-hes-already-lost-the-war-13049183",
        "title": "Beth Rigby: There are still battles the PM can win - but he&#39;s already lost the war",
        "description": "<b>Rishi Sunak</b> is a prime minister who has always found it easy to build consensus on the world stage. But when it comes to his own backyard, this premiership tells a very different story. With voters, he is struggling to build any sort of coalition ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/sunak-blasted-yemen-air-strikes-people-said-171604470.html",
        "title": "<b>Sunak</b> blasted over Yemen air strikes - what the key people said",
        "description": "However, the US military has said some vessels have had no connection to Israel. <b>Rishi Sunak</b> told MPs on Thursday - the first time he had spoken with MPs since launching the strikes - that the military action was a “last resort” designed to “restore ..."
    },
    {
        "url": "https://www.bbc.com/news/world-middle-east-67986226",
        "title": "Houthi missile hits US-owned container ship in Gulf of Aden",
        "description": "Houthi rebels have hit a US-owned container ship with a ballistic missile off the coast of Yemen, the US says. The vessel, Gibraltar Eagle, reported &quot;no injuries or significant damage&quot;, according to the United States military command for the Middle East (Centcom)."
    },
    {
        "url": "https://www.politico.eu/article/rishi-sunak-deputy-party-chairman-lee-anderson-join-rwanda-immigration-bill-rebellion/",
        "title": "<b>Rishi Sunak</b>’s deputy party chairman to join rebellion over flagship immigration bill",
        "description": "Lee Anderson will join Tory MPs who want to toughen the flagship Safety of Rwanda (Asylum and Immigration) Bill."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-tory-rebels-international-law-rwanda-2855724?ITO=msn",
        "title": "Lee Anderson dares <b>Sunak</b> to sack him after saying he will vote with Rwanda rebels",
        "description": "Tory MPs dismiss PM&#39;s claim he will ignore international law to push through his Rwanda deportation deal as a “lie” that contradicts Government legal advice"
    },
    {
        "url": "https://www.thesun.co.uk/tv/25370618/boris-johnson-downing-street-door-replica-the-crown/",
        "title": "Boris Johnson swoops to bid on a surprising piece of memorabilia from The Crown",
        "description": "BORIS Johnson seems so keen to get back into No10 he’s in the bidding for a £30,000 replica of the Downing Street door. The 13ft prop was used in The Crown. It is being sold with a wrought-iron"
    },
    {
        "url": "https://www.hvnplus.co.uk/news/uk-climate-watchdog-to-recruit-new-chief-executive-to-lead-work-15-01-2024/",
        "title": "UK climate watchdog to recruit new chief executive to lead work",
        "description": "The independent Climate Change Committee (CCC) will this year look for new leadership to steer its work advising the government on areas such as building"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/breaking-tory-deputy-chairman-lee-31888275",
        "title": "Tory deputy chairman Lee Anderson says he&#39;ll join rebels over Rwanda in hammer blow to <b>Rishi Sunak</b>",
        "description": "Loudmouth Tory deputy chairman Lee Anderson has confirmed he will back Rwanda Bill amendments put forward by Sir Bill Cash and Robert Jenrick in a huge blow to Rishi Sunak"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/15/rishi-sunak-accused-of-using-islamophobic-trope-in-the-commons/",
        "title": "<b>Rishi Sunak</b> accused of using ‘Islamophobic trope’ in the Commons",
        "description": "Rishi Sunak has been accused of using an “Islamophobic trope” after he asked Labour’s Zarah Sultana to “call on Hamas and the Houthis to de-escalate the situation”. Labour MP Naz Shah said it was a “painful blow” by the Prime Minister and called on him to apologise."
    },
    {
        "url": "https://www.thenational.scot/news/24051145.rishi-sunak-faces-commons-grilling-yemen-airstrikes/",
        "title": "<b>Rishi Sunak</b> faces Commons grilling on Yemen airstrikes",
        "description": "RISHI Sunak defended failing to consult the Commons before launching airstrikes on Houthi rebels in Yemen as he faced MPs for the first time"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-accused-using-islamophobic-184658797.html",
        "title": "<b>Rishi Sunak</b> accused of using ‘Islamophobic trope’ against Labour MP",
        "description": "Rishi Sunak has been accused of using an ‘Islamophobic trope’ after he asked Labour ’s Zarah Sultana to “call on Hamas and the Houthis to de-escalate the situation”. Labour MP Naz Shah said it was a “painful blow” by the Prime Minister and called on him to apologise."
    },
    {
        "url": "https://www.techradar.com/pro/hundreds-of-ads-featuring-a-deep-faked-rishi-sunak-went-up-on-facebook-and-its-only-going-to-get-worse",
        "title": "Hundreds of ads featuring a deep faked <b>Rishi Sunak</b> went up on Facebook - and it&#39;s only going to get worse",
        "description": "The research found that 143 different adverts using Rishi Sunaks deep fake likeness were shown to over 400,000 people on Facebook. Luckily, of this 400,000, the adverts were shown to “less than 0.5 percent of UK users”, according to a spokesperson speaking to The Guardian."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-face-uk-lawmakers-131411755.html",
        "title": "<b>Rishi Sunak</b> will face UK lawmakers over his decision to join US strikes on Yemen&#39;s Houthis",
        "description": "Prime Minister Rishi Sunak was due to face Parliament Monday to explain why the U.K. joined the U.S. in striking Houthi targets in Yemen — and why British lawmakers did not get a say on the military action."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/isaac-levido-mps-rishi-sunak-yougov-safety-b1132515.html",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    },
    {
        "url": "https://www.ft.com/content/3d089314-eb97-4e21-9101-962876c7d480?sharetype=gift",
        "title": "UK government vows to protect litigation funding that helped sub-postmasters",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. The UK government will change the law to protect the litigation funding sector that allowed hundreds of sub-postmasters to take the Post Office to court in the Horizon ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67982650",
        "title": "I am determined to pass Rwanda bill, says <b>Rishi Sunak</b>",
        "description": "Prime Minister Rishi Sunak has said he is &quot;determined&quot; to get his Safety of Rwanda Bill into law, despite criticism from his own backbenchers. More than 50 Conservative MPs have backed amendments they say would toughen up the bill, which returns to the House of Commons on Tuesday."
    },
    {
        "url": "https://westbridgfordwire.com/horizon-former-sutton-sub-postmaster-jailed-for-200000-shortfall-slams-government-inaction/",
        "title": "Horizon: Former Sutton sub-postmaster jailed for £200,000 shortfall slams Government inaction",
        "description": "A former sub-postmaster who was wrongfully convicted and jailed for theft has criticised the Government’s “inaction” on the matter."
    },
    {
        "url": "https://www.express.co.uk/news/world/1855979/yemen-strikes-morally-indefensible-middle-east-war",
        "title": "Yemen strikes will &#39;do nothing&#39; but continue &#39;morally indefensible&#39; war in Middle East",
        "description": "EXCLUSIVE: British and US air strikes in Yemen will only exacerbate the Israel-Hamas war, says Nick Witney from the European Council on Foreign Relations."
    },
    {
        "url": "https://socialistworker.co.uk/news/tory-racism-kills-refugees-as-rwanda-bill-moves-forward/",
        "title": "Tory racism kills refugees as Rwanda bill moves forward",
        "description": "Five refugees drown when crossing the British Channel as Tories push their racist Rwanda bill through parliament"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-naz-shah-prime-minister-commons-hamas-b1132506.html",
        "title": "<b>Rishi Sunak</b> accused of using ‘Islamophobic trope’ in the Commons",
        "description": "Rishi Sunak has been accused of using an “Islamophobic trope” after he asked Labour’s Zarah Sultana to “call on Hamas and the Houthis to de-escalate the situation”. Labour MP Naz Shah said it was a “painful blow” by the Prime Minister and called on him to apologise."
    },
    {
        "url": "https://www.heraldscotland.com/news/24051505.rishi-sunak-refuses-rule-air-strikes-amid-esclation-fears/",
        "title": "<b>Rishi Sunak</b> refuses to rule out more air strikes amid esclation fears",
        "description": "Rishi Sunak has said joint US-UK air strikes on Houthi targets in Yemen last week were intended as a “limited single action” but refused to"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12964091/Tory-poll-Reform-UK-Farage-Labour-RIshi-Sunak-Keir-Starmer-election.html",
        "title": "Is YOUR MP about to be kicked out? Interactive map based on major new poll shows how Keir Starmer is on track to turn the country red at the election - as <b>Rishi Sunak</b> tries to ...",
        "description": "Rishi Sunak insisted he has a &#39;plan&#39; after a huge survey of 14,000 voters found the Conservatives are on course to lose nearly 200 seats at this year&#39;s general election."
    },
    {
        "url": "https://www.itv.com/news/2024-01-15/concerns-thousands-of-asylum-seekers-lost-amid-pressure-over-rwanda-bill",
        "title": "Mounting pressure over Rwanda Bill amid concerns &#39;thousands&#39; of asylum seekers &#39;lost&#39;",
        "description": "Labour accused the home secretary of losing &#39;thousands&#39; of asylum seekers earmarked for removal to Rwanda and failing to get a hold of the issue. | ITV National News"
    },
    {
        "url": "https://www.scotsman.com/news/politics/yemen-bombings-rishi-sunak-defends-uk-strikes-in-red-sea-amid-inflation-fears-as-snp-seek-answers-over-long-term-strategy-4479420",
        "title": "Yemen bombings: <b>Rishi Sunak</b> defends UK strikes in Red Sea amid inflation fears as SNP seek answers over long-term strategy",
        "description": "Rishi Sunak has insisted the UK must be “prepared to back our words with actions”, as a fresh strike against a US-owned ship in the Red Sea fuelled tensions and economists warned the conflict risked fuelling a new spike in inflation."
    },
    {
        "url": "https://www.chronicle.gi/shapps-makes-case-for-increased-western-defence-spending-in-pre-war-era/",
        "title": "Shapps makes case for increased western defence spending in ‘pre-war’ era",
        "description": "By David Hughes, PA Political Editor The UK is facing a “pre-war world” and the “peace dividend” that allowed successive governments to ease spending on defence is over, Grant Shapps has said. Before taking the role,"
    },
    {
        "url": "https://www.chronicle.gi/uk-will-back-words-with-actions-in-red-sea-says-sunak-as-attacks-continue/",
        "title": "UK will ‘back words with actions’ in Red Sea, says <b>Sunak</b> as attacks continue",
        "description": "By PA Reporters Rishi Sunak has warned that the UK Government remains “prepared to back our words with actions”, as missile attacks continued in the Red Sea despite last week’s air strikes against Houthi rebels."
    },
    {
        "url": "https://nottstv.com/former-sub-postmaster-wrongfully-jailed-for-theft-criticises-government-inaction/",
        "title": "Former sub-postmaster wrongfully jailed for theft criticises Government ‘inaction’",
        "description": "A former sub-postmaster who was wrongfully convicted and jailed for theft has criticised the Government&#39;s &quot;inaction&quot; on the matter."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-says-strikes-against-houthis-in-yemen-part-of-single-limited-action-amid-fears-of-escalation-13049029",
        "title": "<b>Rishi Sunak</b> says strikes against Houthis in Yemen part of &#39;single, limited action&#39; amid fears of escalation",
        "description": "The prime minister said attacks on Houthi bases in Yemen were &quot;completed unrelated&quot; to the Israel-Hamas conflict and came in response to &quot;the biggest attack on our navy for decades&quot;."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tory-mps-mps-rishi-sunak-yougov-prime-b2479070.html",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    },
    {
        "url": "https://www.lbc.co.uk/news/jess-phillips-labour-mp-rochdale-report-grooming-gangs-children-uk/",
        "title": "Grooming gangs found in Rochdale ‘happening to children all over the country’, Jess Phillips tells LBC",
        "description": "The Rochdale report follows reports by the same authors on grooming in Manchester and Oldham, which found authorities had again failed children leaving them in the clutches of paedophile gangs."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1855980/rishi-sunak-european-judges-rwanda-migrants",
        "title": "<b>Rishi Sunak</b> vows to &#39;ignore European judges&#39; and put illegal migrants on Rwanda flights",
        "description": "Mr Sunak said the bill he has put forward “will work” and insisted it will allow him to ignore the rule 39 “pyjama injunctions” imposed by the European Court of Human Rights to block deportations. &quot;I won&#39;t let a foreign court stop us from getting flights off and this deterrent working,” he said."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/15/israel-hamas-war-latest-updates-gaza-yemen-day-101-live/?utmsource=email",
        "title": "Israel-Hamas war: <b>Sunak</b> warns Houthis after fresh missile attack",
        "description": "Rishi Sunak has warned the Houthis of further Western airstrikes, after a missile from the rebel group hit a US-owned ship near Yemen. Challenged in parliament on further military action, he said: “Of course we will not hesitate to protect our security, our people and our interests.”"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-mps-parliament-government-keir-starmer-b1132496.html",
        "title": "<b>Sunak</b>: It was necessary to strike Houthis at speed rather than recall Parliament",
        "description": "Rishi Sunak has defended his decision not to consult Parliament before approving RAF airstrikes against Houthi rebels, amid pleas to avoid escalation across the Middle East. The Prime Minister said sometimes there is a need to act “decisively” and the Government must have the power to act in such emergencies."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/15/rishi-sunak-uk-willing-further-military-action-houthis?ref=mc.news",
        "title": "<b>Rishi Sunak</b>: UK willing to take further military action against Houthis",
        "description": "Prime minister addresses MPs hours after Yemen-based group fires on another container ship in Red Sea"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-government-conservative-mps-robert-jenrick-rwanda-b2478777.html",
        "title": "<b>Rishi Sunak</b> facing growing pressure from Tory right to toughen Rwanda Bill",
        "description": "Rishi Sunak has said he is talking to Tory MPs as he faces growing pressure from right-wingers to toughen up the Rwanda Bill, as deputy chairman Lee Anderson confirmed he will join a possible rebellion."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/boris-johnson-supporters-demand-tories-31887697",
        "title": "Boris Johnson supporters demand Tories &#39;show guts&#39; and send letters now to oust <b>Rishi Sunak</b>",
        "description": "David Campbell Bannerman, chairman of the Conservative Democracy Organisation, said the party&#39;s MPs will be responsible for &#39;Harakiri&#39; if they fail to remove Rishi Sunak"
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/01/rishi-sunak-can-afford-to-face-down-tory-rebels-over-the-rwanda-bill",
        "title": "Is Reform UK really gifting Labour a majority?",
        "description": "The Prime Minister knows that few of his critics genuinely want another leadership contest before the next election."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/15/tory-conservatives-labour-rishi-runak-yemen-houthis-keir-starmer-latest-politics-news-updates",
        "title": "<b>Rishi Sunak</b> dismisses ‘malign narrative’ that strikes on Houthis were part of Israel-Gaza war – as it happened",
        "description": "Prime minister tells MPs that strikes were in response to Houthi attacks on commercial shipping in the Red Sea"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67985452",
        "title": "<b>Rishi Sunak</b>: Strikes on Houthis intended as &#39;limited, single action&#39;",
        "description": "But the prime minister says the UK &quot;will not hesitate to protect our security&quot; following Houthi attacks on shipping."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-rishi-returns-to-the-commons/",
        "title": "London Playbook: <b>Rishi</b> returns to the Commons",
        "description": "Good afternoon. This is Andrew McDonald. Emilio Casalicchio will be back in your inboxes tomorrow afternoon. — Rishi Sunak made the case for Britain’s strikes on the Houthis. — But Keir Starmer had some piercing questions for the PM. — Tory right-wingers are getting ready to confront Isaac Levido at the 1922 committee"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/houthi-strikes-drone-missile-launch-171448997.html",
        "title": "Houthi strikes: Drone and missile launch sites destroyed, <b>Rishi Sunak</b> tells MPs",
        "description": "Drone and ballistic missile launch sites were destroyed in “carefully targeted” strikes by Britain and the US in Yemen last week, Rishi Sunak has told MPs."
    },
    {
        "url": "https://www.politics.co.uk/parliament/rishi-sunak-defends-limited-proportionate-strikes-on-houthi-forces-in-yemen/",
        "title": "<b>Rishi Sunak</b> defends ‘limited, proportionate’ strikes on Houthi forces in Yemen",
        "description": "In a statement to the House of Commons this afternoon, prime minister Rishi Sunak defended the strikes on Houthi forces in Yemen as “limited” and “proportionate”, informing the House they were made in “self defence”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/15/half-voters-rishi-sunak-seat-robert-jenrick-rwanda-plan/",
        "title": "<b>Sunak</b> facing small boats battle in his own constituency",
        "description": "In Richmond and Northallerton, which replaces Mr Sunak’s Richmond constituency at the election, 50.2 per cent of voters want small boat arrivals removed immediately without the right of appeal, compared with 21 per cent who think they should be allowed to stay and fight their case."
    },
    {
        "url": "https://www.which.co.uk/news/article/spring-budget-2024-what-it-means-for-your-money-aRzMQ1q7C9uy",
        "title": "Spring Budget 2024: what changes could Jeremy Hunt announce?",
        "description": "A 6 March Budget announcement therefore fits that timeline well. Prime Minister <b>Rishi Sunak</b> has since said he expects the general election to be held at some point in the second half of the year – although he hasn&#39;t ruled out the possibility of a May event."
    }
]