[
    {
        "url": "https://news.yahoo.com/election-triggered-suspended-mp-peter-203645613.html",
        "title": "By-election triggered as suspended MP Peter Bone loses his seat",
        "description": "<b>Rishi Sunak</b> will face another by-election test after MP Peter Bone lost his seat in parliament in a recall petition. The Wellingborough MP was suspended from the Commons for six weeks in October after an inquiry found he had subjected a staff member to ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-by-election-tory-mp-peter-bone-recalled-2816976?ico=related_stories",
        "title": "<b>Sunak</b> will face another by-election as MP Peter Bone recalled over sex misconduct",
        "description": "Rishi Sunak is set to face another by-election in a Tory seat after constituents in Wellingborough voted to recall suspended Conservative MP Peter Bone."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/peter-bone-recall-petition-results-wellingborough-byelection-mp-tories-rishi-sunak-b1128031.html",
        "title": "<b>Rishi Sunak</b> faces more by-election peril as voters recall disgraced MP Peter Bone",
        "description": "Rishi Sunak ’s Conservatives face another by-election battle after MP Peter Bone was kicked out by his constituents on Tuesday, posing a further test of the embattled Prime Minister heading into a General Election next year."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-will-face-another-by-election-as-tory-mp-peter-bone-recalled-over-sex-misconduct-2816976?ico=above_article_ticker",
        "title": "<b>Sunak</b> will face another by-election as Tory MP Peter Bone recalled over sex misconduct",
        "description": "Rishi Sunak is set to face another by-election in a Tory seat after constituents in Wellingborough voted to recall suspended Conservative MP Peter Bone."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-facing-another-by-election-as-mp-peter-bone-loses-seat-in-recall-petition-13033993",
        "title": "<b>Rishi Sunak</b> facing another by-election as MP Peter Bone loses seat in recall petition",
        "description": "Peter Bone, who has been the MP for Wellingborough in Northamptonshire since 2005, was found by parliament to have subjected a staff member to bullying and sexual misconduct."
    },
    {
        "url": "https://www.itv.com/news/anglia/2023-12-19/why-sunaks-latest-by-election-test-could-be-a-problem-for-labour",
        "title": "Why the by-election for Peter Bone&#39;s Wellingborough seat could actually present a problem for Labour",
        "description": "The Conservatives may have had a bad run in recent by-elections, but David Wood believes Labour will have to fight hard to overturn a chunky majority. | ITV News Anglia"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847390/Rishi-Sunak-by-election-Peter-Bone-MP-Wellingborough",
        "title": "<b>Rishi Sunak</b> faces fresh by-election nightmare after Peter Bone ousted as MP",
        "description": "Rishi Sunak is facing another potentially bruising by-election after 13.2% of electorate in Wellingborough vote for recall petition to remove Peter Bone after he was suspended for bullying &amp; exposing himself."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/ex-tory-mp-peter-bone-sacked-by-voters-over-bullying-and-sexual-harassment-case_uk_6581566fe4b036ecab467387",
        "title": "Ex-Tory MP Peter Bone Sacked By Voters Over Bullying And Sexual Harassment Case",
        "description": "The veteran Brexiteer has been recalled by his constituents in Wellingborough, leaving Rishi Sunak with a fresh by-election headache."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/19/no-firm-date-for-stopping-the-boats-admits-rishi-sunak/",
        "title": "No firm date for stopping the boats, admits <b>Sunak</b>",
        "description": "Rishi Sunak has said there is no “firm date” for when he will deliver his promise of stopping small boat Channel crossings despite making it one of his five priorities in office."
    },
    {
        "url": "https://www.thenational.scot/politics/24001322.michelle-mone-scandal-uncovers-new-depths-tory-duplicity/",
        "title": "Michelle Mone scandal uncovers new depths of Tory duplicity",
        "description": "Meanwhile, Mone has hit out at <b>Rishi Sunak</b> and Michael Gove, insisting that they were both fully aware of her involvement from the very beginning. Yesterday, during an unnecessary trip to Lossiemouth which was a blatantly obvious attempt to avoid scrutiny ..."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-slapped-down-by-statistics-watchdog-for-wrongly-claiming-debt-is-falling-13034204",
        "title": "<b>Rishi Sunak</b> slapped down by statistics watchdog for wrongly claiming debt is falling",
        "description": "The statistics watchdog says claims by Mr Sunak gave the impression debt is falling or decisions had lowered it at fiscal events - &quot;neither of which is the case&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-slammed-statistics-watchdog-184912178.html",
        "title": "<b>Rishi Sunak</b> Slammed By Statistics Watchdog Over Misleading Debt Claims",
        "description": "Rishi Sunak has been slammed by the UK statistics watchdog for wrongly claiming that government debt is falling. The prime minister made that one of his five pledges to voters at the start of the year. He claimed in a social media video, and also in the House of Commons, that debt was falling."
    },
    {
        "url": "https://www.nme.com/news/music/johnny-marr-issues-warning-over-ai-generated-voice-messages-3561151",
        "title": "Johnny Marr issues warning over AI-generated voice messages",
        "description": "Johnny Marr has issued a warning over fake AI -generated voice messages that may appear to be him."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67759768?at_medium=RSS&at_campaign=KARANGA",
        "title": "Statistics watchdog rebukes <b>Rishi Sunak</b> over claim debt falling",
        "description": "In a letter in response, Sir Robert said the PM&#39;s office had told the watchdog the claims referred to the fact that the Office for Budget Responsibility was forecasting debt would be falling as a proportion of GDP in the final year of its five-year forecast."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-tells-liaison-committee-stop-boats-migration-3ftt293td",
        "title": "<b>Rishi Sunak</b>: No firm date to meet migration pledge",
        "description": "<b>Rishi Sunak</b> has said that there is no “firm date” for meeting his pledge to “stop the boats” as the number of migrants who have crossed the Channel this year reaches nearly 30,000. In January, <b>Sunak</b> announced the pledge as one of his five ..."
    },
    {
        "url": "https://betting.betfair.com/politics/uk-politics/next-general-election-odds---michelle-mone-killing-tory-chances-191223-171.html",
        "title": "UK Politics: Michelle Mone could hammer the final into the Tory coffin",
        "description": "With the Tories at rock-bottom going into an election year, politics betting expert Paul Krishnamurty says the PPE scandal could deal a mortal blow"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/19/rish-never-said-he-would-stop-the-boats-it-was-all-that-lecterns-doing",
        "title": "Rish! never said he would stop the boats – it was all that lectern’s doing",
        "description": "At the liaison committee, the PM is shocked to learn nobody else realises just how well everything is going"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/michelle-mone-interview-gove-ppe-news-b2466848.html",
        "title": "Michelle Mone - latest: Michael Gove dragged into PPE procurement scandal",
        "description": "Cabinet minister Michael Gove has been dragged into the PPE procurement scandal involving the firm recommended to top officials during the Covid pandemic by Tory peer Michelle Mone. The housing secretary revealed on Tuesday that he has co-operated with the National Crime Agency’s investigation into PPE Medpro,"
    },
    {
        "url": "https://www.itv.com/news/border/2023-12-19/tax-changes-and-a-council-tax-freeze-key-takeaways-from-the-scottish-budget",
        "title": "Scottish Budget: What it means for you as tax changes and a council tax freeze announced",
        "description": "Prime Minister <b>Rishi Sunak</b> has questioned the move, saying the Scottish Government “needs to explain why it’s choosing a different path which is one of higher tax for both people and businesses”. NHS, social care and childcare The Scottish Government ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12882433/James-Cleverly-insists-number-refugees-come-Britain-Rwanda-migrant-scheme-single-digits-Rishi-Sunak-refuses-hard-date-meeting-stop-boats-pledge.html",
        "title": "James Cleverly insists the number of refugees who might come to Britain FROM Rwanda under migrant scheme will only be in &#39;single digits&#39; - while <b>Rishi Sunak</b> refuses to give a ...",
        "description": "The Home Secretary told a House of Lords committee that the numbers who might come from the east African nation to the UK was &#39;tiny&#39;."
    },
    {
        "url": "https://thenantwichnews.co.uk/2023/12/19/cec-still-in-talks-over-hs2-compensation-amid-bankruptcy-fears/",
        "title": "CEC still in talks over HS2 compensation amid bankruptcy fears",
        "description": "Cheshire East Council to continue negotiating for compensation over HS2, amid fears it could plunge council into financial crisis"
    },
    {
        "url": "https://www.politics.co.uk/parliament/stop-the-boats-rishi-sunak-tells-mps-there-is-no-firm-date-to-fulfil-pledge/",
        "title": "‘Stop the boats’: <b>Rishi Sunak</b> tells MPs there is no firm date to fulfil pledge",
        "description": "During his appearance before the liaison committee today, Rishi Sunak was asked about the timescale for delivery on his “stop the boats” pledge, which he made at the start of the year. Dame Diana Johnson,"
    },
    {
        "url": "https://metro.co.uk/video/pm-refuses-say-airlines-sign-rwanda-flights-3085099/",
        "title": "Video: PM refuses to say if airlines will sign up for Rwanda flights",
        "description": "Rishi Sunak refused to say if airlines will sign up for Rwanda flights during a grilling in the liaison committee."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/uk-stats-authority-accuses-sunak-of-undermining-trust-in-government-with-claim-to-have-reduced-debt",
        "title": "UK Stats Authority accuses <b>Sunak</b> of undermining trust in Government with claim to have ‘reduced debt’",
        "description": "The UK Statistics Authority Chair, Sir Robert Chote, has criticised Rishi Sunak’s claims that debt is falling as a percentage of GDP, saying that the PM’s comments have ‘undermined trust’."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/19/rishi-sunak-refuses-to-say-if-airlines-will-sign-up-for-rwanda-flights",
        "title": "<b>Rishi Sunak</b> refuses to say if airlines will sign up for Rwanda flights",
        "description": "In liaison committee appearance, PM also says he cannot say when he will deliver on ‘stop the boats’ pledge <b>Rishi Sunak</b> has refused to disclose whether any airline would be willing to fly asylum seekers to Rwanda, amid concerns they could face ..."
    },
    {
        "url": "https://www.burnhamandhighbridgeweeklynews.co.uk/news/national/24000449.no-firm-date-stopping-boats-sunak-tells-mps/",
        "title": "‘No firm date’ for ‘stopping the boats’, <b>Sunak</b> tells MPs",
        "description": "Rishi Sunak has said there is no “firm date” for meeting his promise to “stop the boats” as Channel crossings approached 30,000 for the year."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/sunak-may-undermined-trust-claims-172136356.html",
        "title": "<b>Sunak</b> may have undermined trust with claims to have ‘reduced debt’ – watchdog",
        "description": "<b>Rishi Sunak</b> has been challenged over his claims to have reduced public debt by the chief of the UK’s statistics watchdog. The Prime Minister said that “debt is falling” in a social media video and that “we have indeed reduced debt” at Prime ..."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/opinion/letters/rishi-sunak-must-resign-now-rather-than-wait-to-be-forced-out-of-office-yorkshire-post-letters-4443514",
        "title": "<b>Rishi Sunak</b> must resign now rather than wait to be forced out of office - Yorkshire Post Letters",
        "description": "Prime Minister <b>Rishi Sunak</b> during a press conference in the Downing Street Briefing Room. PIC: James Manning/PA Wire He should be making clear that the UK, as a rich historically polluting country, is prepared to lead the way on delivering the renewable ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-admits-no-firm-170241742.html",
        "title": "<b>Rishi Sunak</b> admits there is no firm date for his pledge to ‘stop the boats’",
        "description": "Rishi Sunak has admitted he does not know when he will be able to “stop the boats”, insisting there is no “firm date” on the promise he made. The PM made stopping migrant crossings in the English Channel one of his five key pledges in January, but has so far failed to deliver on it and three other promises."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/rishi-sunak-claims-tories-not-31701919.amp",
        "title": "<b>Rishi Sunak</b> claims Tories will not be wiped out in Scotland at next general election",
        "description": "The Prime Minister said he was “confident” of his party’s chances in Scotland when voters finally head to the polls."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2023/12/19/sunak-facing-by-election-test-after-peter-bones-constituents-back-a-recall/",
        "title": "<b>Sunak</b> facing by-election test after Peter Bone’s constituents back a recall",
        "description": "Prime Minister <b>Rishi Sunak</b> will face an electoral test early in the new year after voters in Peter Bone MP’s seat triggered a by-election. North Northamptonshire Council confirmed that 13.2% of the electorate in Wellingborough backed a petition to recall ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2023/12/rwanda-ruined-rishi-sunak-priorities",
        "title": "The stench of Tory decay is overwhelming",
        "description": "At today’s Liaison Committee session, the Prime Minister’s “tetchiness” was on display. By Rachel Cunliffe Given the choice, <b>Rishi Sunak</b> would probably have elected to skip today’s Liaison Committee session. It has been a harrowing few months for ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/letters/michael-gove-housing-policy-michelle-mone-ppe-scandal-b2466528.html",
        "title": "The Tory party are protecting the wealthy at the expense of the rest of us",
        "description": "So, just when you thought that <b>Rishi Sunak</b> had overseen any threats to his leadership, along comes Michael Gove to give a keynote speech on housing policy in central London rather than to the houses of parliament. This proves yet again the Conservative’s ..."
    },
    {
        "url": "https://www.hl.co.uk/news/articles/what-were-the-top-investment-strategies-of-2023",
        "title": "What were the top investment strategies of 2023?",
        "description": "This brought together industry leaders and well-known figures, including Elon Musk, who took part in an interview with UK Prime Minister <b>Rishi Sunak</b>. The strength of the Indian economy has taken centre stage for those investing in Asia and emerging markets."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-67759418?at_medium=RSS",
        "title": "Scottish Budget: Higher earners to pay more income tax",
        "description": "Higher earners in Scotland are to pay more income tax, the Scottish government has announced. A new 45% band will be introduced for people earning between £75,000 and £125,140 - meaning they will pay more tax than they currently do. The top rate of tax, paid by those earning more than £125,000, will also rise from 47% to 48%."
    },
    {
        "url": "https://www.lbc.co.uk/news/cheltenham-a-and-e-closing-restricting-treatment-festive-junior-doctors-strikes/",
        "title": "Cheltenham A&amp;E department closing or restricting treatment over festive period due to junior doctors&#39; strikes",
        "description": "Prime Minister <b>Rishi Sunak</b> said the strikes are “very disappointing”, in the Commons Liaison Committee, and said the government has demonstrated “considerable reasonableness” in reaching resolutions with other public sector workers."
    },
    {
        "url": "https://news.stv.tv/politics/michael-gove-hopes-case-can-be-brought-quickly-into-michelle-mone-ppe-medpro-probe",
        "title": "Gove hopes criminal case will be brought over Michelle Mone PPE scandal",
        "description": "The levelling up minister said he is fully cooperating with a National Crime Agency investigation into PPE Medpro."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/sunak-may-have-undermined-trust-with-claims-to-have-reduced-debt-watchdog-b1128068.html",
        "title": "<b>Sunak</b> may have undermined trust with claims to have ‘reduced debt’ – watchdog",
        "description": "The chair of the UK Statistics Authority criticised the Prime Minister’s claims last month that debt is falling."
    },
    {
        "url": "https://www.chronicle.gi/sunak-says-red-sea-attacks-deeply-concerning-as-royal-navy-warship-joins-task-force/",
        "title": "<b>Sunak</b> says Red Sea attacks ‘deeply concerning’ as Royal Navy warship joins task force",
        "description": "<b>Rishi Sunak</b> hit out at the “malign” actions of Iran-backed militants targeting shipping in the Red Sea as a Royal Navy destroyer joined an international coalition to protect vessels. Downing Street said the UK had a “clear-eyed” view of Tehran’s ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-kids-ask-the-best-questions/",
        "title": "London Playbook PM: Kids ask the best questions",
        "description": "KIDS ASK THE BEST QUESTIONS PART TWO: His liaison committee grilling over, Rishi Sunak finally faced the questions he’d hoped for. In the corridor outside the hearing room on the mezzanine level of Portcullis House, Sunak went toe to toe with a child about his favorite topic: Star Wars."
    },
    {
        "url": "https://www.politics.co.uk/parliament/gaza-war-rishi-sunak-pressed-on-whether-principle-of-proportionality-is-being-upheld-by-israel/",
        "title": "Gaza war: <b>Rishi Sunak</b> pressed on whether principle of proportionality is being ‘upheld’ by Israel",
        "description": "During his appearance at the liaison committee today, Rishi Sunak was asked whether the “principle of proportionality” is being upheld by Israel in its bombing campaign in Gaza. Alicia Kearns, chair of the foreign affairs select committee,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847330/SNP-Santa-Claus-mockery-Westminster",
        "title": "SNP MPs mocked for demanding parliament ‘recognises the importance of Santa Claus’",
        "description": "MPs for the pro-independence party have launched a new campaign to get <b>Rishi Sunak</b> to “acknowledge the contribution of the idea of Santa Claus to Christmas”. The oddly worded mission statement details demands from 10 of the party’s Westminster MPs ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12881537/From-Australian-wine-Japanese-cars-clothes-Bangladesh-Map-shows-supplies-goods-threat-Red-Sea-shipping-attacks-experts-warn-impact-crisis-Britains-High-Street-felt-days.html",
        "title": "From Australian wine, to Japanese cars and clothes from Bangladesh: Map shows supplies of goods under threat by Red Sea shipping attacks as experts warn impact of crisis on ...",
        "description": "Prime Minister <b>Rishi Sunak</b> told the cabinet that &#39;malign actors were seeking to exploit the situation in the Middle East for their own ends&#39;. He told ministers that Houthi attacks have &#39;led to several companies suspending passage through the area&#39;, and ..."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/23996729.letter-im-writing-show-support-proportional-representation/",
        "title": "Letter: &#39;I&#39;m writing to show support for Proportional Representation&#39;",
        "description": "I am writing to express my strong support for Proportional Representation in UK general elections. Our current First Past the Post system results"
    },
    {
        "url": "https://morningstaronline.co.uk/article/lingerie-millionaire-lady-mone-attacks-ministers-over-ppe-deals-keeping-spotlight-on-tory-sleaze",
        "title": "Lingerie millionaire Lady Mone attacks ministers over PPE deals, keeping spotlight on Tory sleaze",
        "description": "LINGERIE millionaire Michelle Mone kept the spotlight on Tory sleaze today as she stepped up her attack on government ministers."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24000449.no-firm-date-stopping-boats-sunak-tells-mps/",
        "title": "‘No firm date’ for ‘stopping the boats’, <b>Sunak</b> tells MPs",
        "description": "Rishi Sunak has said there is no “firm date” for meeting his promise to “stop the boats” as Channel crossings approached 30,000 for the year."
    },
    {
        "url": "https://www.insider.co.uk/news/live-2024-scottish-budget-happens-31706288.amp",
        "title": "The 2024 Scottish Budget as it happened",
        "description": "The new bracket is rumoured to be 45% for those earning between £75,000 and £125,000 a year. Prime Minister <b>Rishi Sunak</b> questioned the move, saying the Scottish Government “needs to explain why it’s choosing a different path which is one of higher ..."
    },
    {
        "url": "https://www.nme.com/news/music/christmas-number-one-hopeful-louise-harris-says-song-tackles-how-climate-change-affects-us-all-3561122",
        "title": "Christmas Number One hopeful Louise Harris says song tackles “how climate change affects us all”",
        "description": "Harris, 25, from Hertfordshire, was arrested after performing the track at a peaceful protest outside Prime Minister <b>Rishi Sunak</b>’s home at the end of November. Her bail conditions mean she cannot currently enter the area within the M25 motorway ..."
    }
]