[
    {
        "url": "https://inews.co.uk/news/sunaks-asylum-backlog-pledge-misleading-2832568?ico=most_popular",
        "title": "<b>Sunak</b>’s claim to have met asylum backlog pledge branded ‘misleading’",
        "description": "Rishi Sunak had pledged to “abolish” a portion of outstanding older legacy asylum applications by the end of 2023"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-home-office-government-prime-minister-labour-b1129811.html",
        "title": "Thousands of asylum seekers await decision but Government says backlog cleared",
        "description": "The department said on Monday that Mr Sunak’s “commitment of clearing the legacy asylum backlog has been delivered” and it had processed more than 112,000 asylum cases overall in 2023, while the Prime Minister said the Government was saving the taxpayer “millions of pounds” by doing so."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-fumio-kishida-joe-biden-prime-minister-japan-b1129810.html",
        "title": "UK ‘ready to support Japan’ after major earthquakes, <b>Sunak</b> says",
        "description": "The Prime Minister said his thoughts were with those impacted by the quakes that had ’caused such terrible damage’."
    },
    {
        "url": "https://news.sky.com/story/japan-earthquake-latest-at-least-six-dead-as-bodies-are-pulled-from-rubble-sunak-says-uk-ready-to-support-japan-13040241",
        "title": "Japan earthquake latest: At least six dead as bodies are pulled from rubble; <b>Sunak</b> says UK ready to support Japan",
        "description": "Major earthquakes have hit Japan with thousands urged to take shelter overnight. Earlier tsunami warnings have now been downgraded to &#39;advisories&#39;."
    },
    {
        "url": "https://www.thetimes.co.uk/article/intensely-problematic-how-sunaks-lawyers-warned-him-on-rwanda-033pdxs9v?ilc=timesradio:morefromthetimes",
        "title": "‘Intensely problematic’: how <b>Sunak</b>’s lawyers warned him on Rwanda",
        "description": "The government’s most senior lawyer said ignoring European rulings would affect Britain’s ‘attitude to international law’"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-defying-people-pathetic-31784961",
        "title": "&#39;<b>Rishi Sunak</b> defying will of the people is pathetic sight of an unpopular PM&#39;",
        "description": "Today&#39;s Daily Mirror poll shows the country is crying out for change after two-thirds (66%) said they wanted an election held before the start of the summer"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/sunak-condemned-for-boasting-about-banning-foreign-students-from-bringing-family-to-uk_uk_6593070ce4b0cd3cf0e5c5aa",
        "title": "<b>Sunak</b> Condemned For Boasting About Banning Foreign Students From Bringing Family To UK",
        "description": "Rishi Sunak has been roasted on social media after he boasted about banning most foreign students from bringing family to the UK. The ban is a key element of Sunak’s plan to bring down the number of immigrants coming to Britain. Last year, 136,000 visas were issued to the dependants of foreign students - up from 16,000 in 2019."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-announces-tory-tax-calculator-223000142.html",
        "title": "Labour announces ‘Tory tax calculator’ ahead of national insurance cut",
        "description": "The launch of the online tool on Tuesday comes after the UK entered a likely election year, with Prime Minister <b>Rishi Sunak</b> having to send the country to the polls to elect a new Westminster government by January 2025. Using the domain ToryTaxCalculator ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/11-rishi-sunaks-biggest-fights-31777226?ruid=50afc1ab-f950-4dd0-94b8-eac25f63d72b",
        "title": "11 of <b>Rishi Sunak</b>&#39;s biggest fights in 2024 from Rwanda battle to more NHS strikes",
        "description": "PM Rishi Sunak faces a bruising year as he goes into a general election campaign heading a divided party and trailing Keir Starmer in the polls - with a lot of battles on the way"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/evidence-of-failure-rishi-sunak-slammed-after-breaking-pledge-to-stop-the-boats_uk_65929cd0e4b0b01d3e4035ef",
        "title": "&#39;Evidence Of Failure&#39;: <b>Rishi Sunak</b> Slammed After Breaking Pledge To &#39;Stop The Boats&#39;",
        "description": "Rishi Sunak has been slammed after breaking his key promise to voters to “stop the boats” carrying asylum seekers across the English Channel. A total of 29,437 people made the perilous crossing from France in 2023, according to provisional Home Office figures."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/national/24020535.pictures-another-turbulent-12-months-uk-politics/",
        "title": "In Pictures: Another turbulent 12 months in UK politics",
        "description": "Rishi Sunak is still standing after his first full year as Prime Minister but things have been far from plain sailing for the"
    },
    {
        "url": "https://www.brusselstimes.com/858554/nearly-30000-undocumented-migrants-crossed-the-channel-in-2023",
        "title": "Nearly 30,000 undocumented migrants crossed the Channel in 2023",
        "description": "In 2023, nearly 30,000 undocumented migrants reached the English coast by crossing the Channel in makeshift boats, marking a significant decline from the record-breaking figures of 2022."
    },
    {
        "url": "https://news.sky.com/story/japan-earthquake-latest-major-tsunami-warning-after-quakes-as-local-residents-ordered-to-evacuate-13040241?postid=6999540",
        "title": "Japan earthquake latest: Thousands urged to take shelter amid tsunami advisory",
        "description": "Major earthquakes have hit Japan with thousands urged to take shelter overnight. Earlier tsunami warnings have now been downgraded to &#39;advisories&#39;."
    },
    {
        "url": "https://www.thesun.co.uk/news/25217605/rishi-sunak-small-boats-asylum-cases-crossings/",
        "title": "<b>Rishi Sunak</b> kicks off year claiming double-win on small boats – with backlog of asylum cases cleared &amp; crossings down",
        "description": "RISHI Sunak last night kicked off a do-or-die election year claiming a double-win on small boats. The PM revealed the groaning backlog of 92,000 legacy asylum cases had finally been cleared. And"
    },
    {
        "url": "https://www.thesun.co.uk/news/25217908/rishi-sunak-slashed-small-boat-arrivals-illegal-migration/",
        "title": "<b>Rishi Sunak</b> has slashed small boat arrivals &amp; voters worried about illegal migration should back him to sort it",
        "description": "Tide turning IT is fair enough for Rishi Sunak to begin 2024 by claiming some measure of ­success on illegal migration. A vast backlog of 92,000 asylum cases has been wiped out, roughly half the"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/01/sunak-under-fire-claim-cleared-asylum-backlog/",
        "title": "<b>Sunak</b> under fire over ‘false’ claim to have cleared asylum backlog",
        "description": "Mr Sunak said: “By clearing the legacy asylum backlog, deciding more than 112,000 cases, we are saving the taxpayer millions of pounds in expensive hotel costs, reducing strain on public services and ensuring the most vulnerable receive the right support.”"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/01/thousands-of-legacy-asylum-cases-awaiting-decisions-despite-sunaks-pledge",
        "title": "Thousands of ‘legacy’ asylum cases awaiting decisions despite <b>Sunak</b>’s pledge",
        "description": "PM promised to clear backlog of cases from before June 2022 by end of 2023 but 4,500 complex cases need further checks"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12917417/David-Davis-Margaret-Thatcher-message-Tory-faithful-party-beat-Labour-voters-polls-year.html",
        "title": "David Davis invokes the spirit of Margaret Thatcher as he sends a stirring message to the Tory faithful that the party CAN beat Labour as voters prepare to go to the polls this ...",
        "description": "Despite a Labour poll lead of 20 per cent, the Tory grandee says the party can prevail by invoking the spirit of Margaret Thatcher, who won the 1987 election by a landslide."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/the-election-year-dawns-and-small-boats-are-a-key-battle-line/",
        "title": "The election year dawns - and small boats are a key battle line",
        "description": "Rishi Sunak himself declared that 2024 will be an election year - at the least discreet location possible: a Christmas party for political journalists."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1850874/sunak-drive-down-illegal-migration",
        "title": "<b>Rishi Sunak</b> insists &#39;relentless action&#39; to drive down illegal migration is &#39;working&#39;",
        "description": "Sunak said Channel small boat arrivals have fallen year-on-year for the first time since current records began but vowed to &quot;work day and night&quot; to end the problem."
    },
    {
        "url": "https://www.thenational.scot/news/24021294.poll-two-thirds-brits-want-general-election-summer/",
        "title": "Poll: Two-thirds of Brits want General Election by summer",
        "description": "A further 16% of people said they wanted a vote in the summer, meaning two-thirds of British voters want an election before the autumn. In total, just 9% said they would want to have the next General Election next autumn, while just 3% opted for next winter."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1850868/Nigel-farage-criticises-rishi-sunak-achievements-gb-news",
        "title": "Nigel Farage rips apart every one of <b>Rishi Sunak</b>’s achievements: ‘It didn’t impress me!’",
        "description": "Former UKIP and Brexit Party leader belittles PM&#39;s claims of success and says he is ‘sick to death&#39; of how ‘disingenuous&#39; it seems ministers are."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/xl-bully-ban-dogs-england-b2471906.html",
        "title": "Man drives 200 miles to Scottish Borders to save XL Bully dogs before ban",
        "description": "An XL Bully lover drove more than 200 miles on New Year’s Eve to rehome dogs in Scotland - just hours before a ban on the breed was introduced in England and Wales."
    },
    {
        "url": "https://www.thenational.scot/news/24021278.experts-condemn-rishi-sunaks-first-twitter-post-2024/",
        "title": "Experts condemn <b>Rishi Sunak</b>&#39;s first Twitter post of 2024",
        "description": "STEPHEN Flynn has joined the voices condemning Prime Minister Rishi Sunak after his “bleak” first post on Twitter/X in 2024"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/five-things-rishi-sunak-promised-28374505",
        "title": "The five things <b>Rishi Sunak</b> promised us this time last year as general election looms",
        "description": "The prime minister asked us to judge him on how well he delivered his five priorities for 2023 - which is exactly what will happen when Britain goes to the polls"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-kent-67856720?at_medium=RSS&at_campaign=KARANGA?bingParse",
        "title": "Channel migrants: Crossings fell in 2023, government figures show",
        "description": "The number of migrants crossing the Channel has fallen year-on-year for the first time since current records began. Government figures show the total arrivals in 2023 were down by more than a third on 2022. The provisional annual total for the year, 29,437, is 36% lower than the record 45,774 crossings for the whole of 2022."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/01/lib-dems-sunak-investigate-not-declare-cummings-meetings/",
        "title": "Lib Dems call for <b>Rishi Sunak</b> to face investigation over failure to declare Cummings meetings",
        "description": "Party suggests Prime Minister broke ministerial code after reports that major changes of government policy were discussed"
    },
    {
        "url": "https://www.irishnews.com/opinion/rejoice-the-british-government-has-actually-found-a-problem-it-can-solve-gavin-esler-746VW43UGVAVVPVCGCHW7EXZ44/",
        "title": "Rejoice! The British government has actually found a problem it can solve – Gavin Esler",
        "description": "The Boris Johnson era was one of weaponised nostalgia. Johnson, like Rees-Mogg, deliberately cultivated the Eton and Oxford antiquated toff image. Both used words and phrases you might expect in the English Just William stories of the 1920s, about a boy who was “always getting into scrapes”."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/live-wales-breaking-news-plus-28371850",
        "title": "Live: Wales breaking news plus weather and traffic updates (Monday, January 1)",
        "description": "Hello, and welcome to Wales Online&#39;s live blog for Monday, January 1) We will be bringing you all of the latest news from across Wales - whether you&#39;re on the move, at home or at work - as well as the latest traffic and travel."
    },
    {
        "url": "https://inews.co.uk/opinion/dominic-cummingss-radicalism-is-still-seductive-2832508?ico=most_popular",
        "title": "Dominic Cummings’s radicalism is still seductive",
        "description": "It seems unlikely that the Prime Minister invited Cummings to his northern fastness simply to reminisce about the old days"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunaks-claim-cleared-asylum-182100140.html",
        "title": "<b>Rishi Sunak</b>&#39;s claim to have cleared asylum backlog branded &#39;misleading&#39;",
        "description": "The government is claiming victory in clearing the backlog of asylum claims - but that has been described as &quot;misleading&quot; as thousands are still waiting for a final decision. Prime Minister Rishi Sunak pledged in December 2022 that he would &quot;abolish&quot; the legacy backlog of asylum claims made before 28 June of that year,"
    }
]