[
    {
        "url": "https://www.thetimes.co.uk/article/clarkson-clause-could-waive-planning-permission-for-farm-shops-cc9mx2qcq?ilc=timesradio:morefromthetimes",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "<b>Rishi Sunak</b> will allow farmers to open shops, offices and other rural businesses without full planning permission in a Clarkson-inspired pitch to rural voters. The prime minister is also promising more robots to help with planting and harvesting to reduce ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/science-environment-68342314?at_campaign=KARANGA&at_medium=RSS",
        "title": "PM announces support for farming amid industry &#39;crisis&#39;",
        "description": "The prime minister will announce a package of measures on Tuesday to help farmers - but many say more is needed to support an industry &quot;in crisis&quot;. Rishi Sunak will use a speech at Tuesday&#39;s National Farmers Union annual conference to outline government plans to boost the UK&#39;s food security."
    },
    {
        "url": "https://www.bbc.com/news/articles/cp490rp287wo",
        "title": "Cost of living fears rife in election battleground",
        "description": "I’m not going to be 40 and still living at home.&quot; Shannon Challoner is a bingo hall cashier who sees no way of ever owning her own home. As a general election looms, the 20-year-old from from Rhyl, Denbighshire,"
    },
    {
        "url": "https://news.sky.com/story/tories-accused-of-failing-parents-as-cost-of-childcare-rises-faster-than-inflation-13075864",
        "title": "Tories accused of failing parents as cost of childcare rises faster than inflation",
        "description": "Analysis by the Labour Party shows the price of a part-time nursery place has jumped from £82 per week in 2010 to £146 now."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13101935/Fruit-picking-robots-slash-need-migrant-labour-Rishi-Sunak-tell-farmers-unveils-220-million-fund-new-technology.html",
        "title": "Fruit-picking robots could slash the need for migrant labour, <b>Rishi Sunak</b> to tell farmers as he unveils £220 million fund for new technology",
        "description": "Fruit-picking robots could slash the need for migrant labour, <b>Rishi Sunak</b> will tell farmers today. Addressing the National Farmers&#39; Union conference, the Prime Minister will unveil a £220 million fund to help deploy new technology to help boost ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-gb-news-appearance-120254733.html",
        "title": "<b>Rishi Sunak</b>’s GB News appearance probed by Ofcom after 500 complaints",
        "description": "Ofcom said the so-called People’s Forum garnered around 500 complaints and it was investigating the show under its impartiality rules"
    },
    {
        "url": "https://www.ft.com/content/ab467c3b-63ef-4f83-bd1c-e6de458b5983",
        "title": "<b>Sunak</b> bids to win back support of British farmers",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. <b>Rishi Sunak</b> will seek to win back British farmers on Tuesday ahead of the general election expected later this year, pledging the government “will be by their side ..."
    },
    {
        "url": "https://www.bbc.com/news/entertainment-arts-68336048",
        "title": "Ofcom to investigate GB News show featuring <b>Rishi Sunak</b>",
        "description": "Ofcom has launched an investigation into a GB News programme which featured Prime Minister Rishi Sunak. In a statement, the UK&#39;s communications and broadcast regulator said: &quot;We have received around 500 complaints about the programme which aired on GB News on 12 February 2024&quot;."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-labour-rishi-sunak-government-ukraine-b1140168.html",
        "title": "PM to tell farming conference Government is ‘by their side’",
        "description": "<b>Rishi Sunak</b> is set to pledge he will “never take our food security for granted” as he outlines support for farmers in a speech to the sector. Speaking to the National Farmers’ Union conference on Tuesday, the Prime Minister is expected to say the ..."
    },
    {
        "url": "https://news.sky.com/story/well-never-take-food-security-for-granted-promises-sunak-as-farming-chief-warns-it-risks-becoming-poor-relation-to-other-priorities-13075775",
        "title": "&#39;We&#39;ll never take food security for granted&#39; promises <b>Sunak</b>, as farming chief warns it risks becoming &#39;poor relation&#39; to other priorities",
        "description": "NFU chief Minette Batters says the next government needs to treat farming &quot;as one vital part of our national infrastructure&quot;. Political parties are attending the NFU conference as they seek to win the rural vote ahead of the general election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/clarkson-clause-could-waive-planning-permission-for-farm-shops-cc9mx2qcq",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "Rishi Sunak’s pitch to rural voters comes as polling shows a collapse in Conservative support in the party’s traditional heartlands"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1868393/Rishi-Sunak-farming-technology-planning-reforms",
        "title": "<b>Rishi Sunak</b> will confirm Government plans to slash farming red tape and boost technology",
        "description": "Prime Minister Rishi Sunak met with National Farmers Union members to discuss the future of farming during a private meeting in East Devon last week."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/19/english-farmers-to-be-offered-largest-ever-grant-scheme-amid-food-security-concerns",
        "title": "English farmers to be offered ‘largest ever’ grant scheme amid food security concerns",
        "description": "Agricultural sector hit by post-Brexit turmoil with protests over trade deals, environmental legislation and rising costs"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/holiday-lets-being-scapegoated-in-housing-crisis-says-think/",
        "title": "Holiday lets being &#39;scapegoated&#39; for the housing crisis, says think tank",
        "description": "<b>Rishi Sunak</b> has faced criticism over the move with some politicians calling it &#39;socialist nanny state intervention&#39; Credit: John Keeble/Getty <b>Rishi Sunak</b> has faced a backlash over the Government’s planned crackdown on short-term holiday lets.‌"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/post-brexit-deal-eu-border-agency-stop-boats-sunak/",
        "title": "Post-Brexit deal with EU border agency boosts ‘stop the boats’ plan",
        "description": "Agreement means Border Force officers will be able to get live intelligence mapping of migrant movements across EU borders"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-triple-lock-tories-2914529?ico=more_from_this_author",
        "title": "Labour’s triple-lock pension pledge will force the Tories to do the same",
        "description": "Starmer and Reeves are set to commit to the state policy in their general election manifesto - it&#39;s a no-brainer for them"
    },
    {
        "url": "https://inews.co.uk/news/politics/triple-lock-pension-labour-manifesto-commitment-2914271?ico=more_from_this_author",
        "title": "Triple-lock pension set to be Labour manifesto commitment",
        "description": "Keir Starmer is planning to keep the policy if he becomes PM, amid fears over pensioner poverty in housing crisis"
    },
    {
        "url": "https://news.sky.com/story/former-minister-tobias-ellwood-calls-for-new-legislation-to-stop-protesters-visiting-mps-houses-13075718",
        "title": "Former minister Tobias Ellwood calls for new legislation to stop protesters visiting MPs&#39; houses",
        "description": "Tobias Ellwood has called for new laws amid suggestions from Just Stop Oil that it plans to target MPs&#39; houses in the run-up to the next election."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/henry-staunton-former-post-office-chairman-investigated-over-bullying-before-dismissal-business-secretary-claims/",
        "title": "Henry Staunton: Former Post Office chairman investigated over bullying before dismissal, business secretary claims",
        "description": "Kemi Badenoch has said former Post Office chair Henry Staunton was being investigated over bullying allegations before his dismissal - as she accused him of seeking revenge against the government."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/starmer-should-wary-final-furlong-32163502",
        "title": "&#39;Starmer should be wary of a final furlong fall - Labour needs to get its act together&#39;",
        "description": "Darren Lewis says the Labour Party appears convinced it needs only to turn up to win a general election – because it’s not the Tories"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868416/Rishi-Sunak-I-know-it-s-been-tough-but-our-plan-will-boost-Britain",
        "title": "<b>Rishi Sunak</b>: I know it&#39;s been tough, but our plan will boost Britain",
        "description": "Rishi Sunak vowed he will give Britain a renewed sense of pride after the “tough times” the country has been through. The Prime Minister admitted the last few years have not been easy but insisted the future is bright under his plan to turn the economy around."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/19/it-must-be-exhausting-to-be-kemi-badenoch-anger-her-ever-faithful-companion",
        "title": "It must be exhausting to be Kemi Badenoch, outrage her ever-faithful companion",
        "description": "The business secretary is a passionate defender of free speech – apart from any criticism of her"
    },
    {
        "url": "https://www.itv.com/news/2024-02-19/badenoch-under-pressure-to-back-up-claims-ex-post-office-boss-lied",
        "title": "Badenoch says ex-Post Office boss &#39;seeking revenge&#39; for being sacked with compensation allegations",
        "description": "The former  Chairman alleged he was told by a senior civil servant to “stall” spending on compensation to subpostmasters ahead of the election. | ITV National News"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24130115.right-describe-navalnys-death-murder-minister-says/",
        "title": "Right to describe Navalny’s death as ‘murder’, minister says",
        "description": "Alicia Kearns, the Foreign Affairs Committee chairwoman, had urged MPs to call out Russian opposition leader Alexei Navalny’s death as murder."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68341833",
        "title": "Wellingborough&#39;s new Labour MP takes her seat in Parliament",
        "description": "The new Labour MP for Wellingborough in Northamptonshire has taken her seat in the House of Commons. Gen Kitchen overturned an 18,540 majority in the seat previously held by Peter Bone, who was ousted following a recall petition. Ms Kitchen recited the Parliamentary Oath and shook the Speaker&#39;s hand."
    },
    {
        "url": "https://www.gg2.net/un-raises-human-rights-concerns-about-sunaks-rwanda-policy/",
        "title": "UN raises human rights concerns about <b>Sunak</b>’s Rwanda policy",
        "description": "Britain’s new legislation regarding its controversial plan to send asylum seekers to Rwanda for processing was criticised by the UN human rights chief, Volker"
    },
    {
        "url": "https://uk.news.yahoo.com/tories-accused-failing-parents-cost-210100248.html",
        "title": "Tories accused of failing parents as cost of childcare rises faster than inflation",
        "description": "The Conservatives have been accused of failing parents after figures showed the cost of childcare has risen a third faster than inflation since the party came to power in 2010. Analysis by the Labour Party found the price of a part-time nursery place has jumped from £82 per week in 2010 to £146 now,"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/donald-trump-breaks-silence-on-alexei-navalnys-death-but-makes-no-mention-of-vladimir-putin/",
        "title": "Donald Trump breaks silence on Alexei Navalny&#39;s death - but makes no mention of Vladimir Putin",
        "description": "Donald Trump has broken his silence on the death of Russian opposition leader Alexei Navalny - but avoided casting blame on President Vladimir Putin."
    },
    {
        "url": "https://www.gg2.net/uk-court-convicts-small-boat-pilot-of-migrant-deaths-in-channel/",
        "title": "UK court convicts small boat pilot of migrant deaths in Channel",
        "description": "A man who piloted an “unseaworthy” boat across the English Channel was found guilty Monday of the manslaughter of four migrants who drowned during the crossing."
    },
    {
        "url": "https://www.newstatesman.com/diary/2024/02/how-breathtaking-brought-tears-to-the-baftas",
        "title": "Demoted to wingman",
        "description": "Also this week: In awe of maverick nurses, and why swearing should be prescribed on the NHS."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7256770",
        "title": "Politics live: Possible move against Russia would send &#39;very powerful signal&#39;",
        "description": "Honestly? Not much. The US is &quot;considering additional sanctions on Russia&quot;. <b>Rishi Sunak</b> has said he&#39;s outraged. Donald Trump - with no mention of Putin - has compared Navalny&#39;s imprisonment to his own legal trials in the US. There have been a lot more ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/former-minister-tobias-ellwood-calls-for-new-legislation-to-stop-protesters-visiting-mps-houses/",
        "title": "Former minister Tobias Ellwood calls for new legislation to stop protesters visiting MPs&#39; houses",
        "description": "An MP has called for new legislation to stop protesters visiting MPs&#39; houses following reports that Just Stop Oil plans to occupy politicians&#39; homes ahead of the next general election."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/19/kemi-badenoch-post-office-scandal-alexei-navalny-uk-politics-live",
        "title": "Minister says government working on sanction options for those involved in Alexei Navalny’s death – UK politics live",
        "description": "The business and trade secretary says Henry Staunton gave an interview ‘full of lies’"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-sanction-russians-navalny-putin-2912636?ico=more_from_this_author",
        "title": "Labour would sanction more Russians on Navalny ‘list’ of Putin henchmen",
        "description": "Labour has called on <b>Rishi Sunak</b> and Lord Cameron to consider sanctions against nearly 8,000 people on Alexei Navalny’s “list” of Vladimir Putin’s henchmen following the death of the Russian dissident. Shadow Foreign Secretary David Lammy told i ..."
    }
]