[
    {
        "url": "https://www.thisislocallondon.co.uk/news/24089071.young-reporter-rishi-sunak-bans-disposable-vapes--kamakshi-p-tgs/",
        "title": "Young Reporter <b>Rishi Sunak</b> bans disposable vapes- Kamakshi P. TGS",
        "description": "Nowadays, vapes have been advertised to children with fluorescent colours, tempting flavours, and attractive packaging. The new law will make it illegal to sell tobacco products to anyone born on or after 1st January 2009, in a pledge to create a smokefree generation."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-opposition-labour-party-pledge-223300546.html",
        "title": "UK opposition Labour party pledge productivity fix in latest pitch to business",
        "description": "Britain&#39;s opposition Labour Party will pledge to fix Britain&#39;s stagnating productivity at a conference for businesses on Thursday, its latest charm offensive to companies and investors ahead of a national election expected this year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13030621/Power-sharing-Northern-Ireland-begin-thanks-Rishi-Sunaks-trade-boosting-deal.html",
        "title": "Power-sharing in Northern Ireland to begin again thanks to <b>Rishi Sunak</b>&#39;s trade-boosting deal",
        "description": "Rishi Sunak&#39;s latest post-Brexit deal on trading rules for Northern Ireland was yesterday hailed on both sides of the Irish Sea."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861875/Mike-Freer-Rishi-Sunak-elections-quit-politics",
        "title": "Justice Minister Mike Freer to quit frontline politics over death threats",
        "description": "The Justice Minister told Prime Minister <b>Rishi Sunak</b> today that he will step down from frontline politics following several threats and incidents, which culminated in an “arson” attack on his constituency office in December. The MP, 63, says he feels ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13030513/Archbishop-Canterbury-Justin-Welby-joins-forces-former-judge-Labour-peer-mission-derail-Rwanda-plan.html",
        "title": "Archbishop of Canterbury Justin Welby joins forces with a former top judge and a Labour peer in mission to derail Rwanda plan",
        "description": "The Archbishop is backing changes which would instead give the United Nations High Commissioner on Refugees (UNHCR) the final say on whether the east African nation is safe."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24088926.dup-says-stormont-deal-delivered-fundamental-change-uk-eu-trading-rules/",
        "title": "DUP says Stormont deal has delivered ‘fundamental change’ to UK/EU trading rules",
        "description": "The EU has said it will ‘carefully analyse’ measures that would end routine checks on goods moving from GB to and staying in NI."
    },
    {
        "url": "https://www.itv.com/news/2024-01-31/chancellor-says-less-room-for-tax-cuts-in-spring-budget-than-in-autumn",
        "title": "Chancellor says less room for tax cuts in spring Budget than in autumn",
        "description": "Have you heard our new podcast Talking Politics? Every week Tom, Robert and Anushka dig into the biggest issues dominating the political agenda… Prime Minister <b>Rishi Sunak</b>’s party has been consistently behind Sir Keir Starmer’s Labour in opinion ..."
    },
    {
        "url": "https://news.stv.tv/world/rishi-sunak-accused-of-laughing-at-struggling-iceland-worker",
        "title": "<b>Rishi Sunak</b> accused of ‘laughing’ at ‘struggling’ Iceland worker",
        "description": "Labour leader Sir Keir said highlighted the case of Iceland employee Phil who is struggling to pay his mortgage at PMQs."
    },
    {
        "url": "https://leftfootforward.org/2024/01/rishi-sunak-brutally-mocked-for-claiming-he-is-absolutely-confident-he-will-win-the-general-election/",
        "title": "<b>Rishi Sunak</b> brutally mocked for claiming he is ‘absolutely’ confident he will win the general election",
        "description": "Prime Minister Rishi Sunak has been brutally mocked online after claiming that he is ‘absolutely’ confident he will win the next general election. His ‘confidence’ comes at a time when the Labour Party has increased its lead over the Tories to 22 points, with a number of polls predicting an electoral wipeout for the Conservative Party."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunaks-northern-ireland-deal-154200084.html",
        "title": "<b>Rishi Sunak</b>&#39;s Northern Ireland deal is a fudge - but it&#39;s working so far",
        "description": "The most important thing about Rishi Sunak&#39;s Northern Ireland deal is that it&#39;s working. Barring some unforeseen problem, the Stormont Assembly will sit once more, for the first time in two years, next week."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/dup-chris-heatonharris-stormont-eu-commission-cameron-b1136216.html",
        "title": "DUP says Stormont deal has delivered ‘fundamental change’ to UK/EU trading rules",
        "description": "The EU has said it will ‘carefully analyse’ measures that would end routine checks on goods moving from GB to and staying in NI."
    },
    {
        "url": "https://www.thesun.co.uk/news/25639121/dup-restore-power-sharing-northern-ireland/",
        "title": "DUP agrees to restore power-sharing in Northern Ireland after two-year bitter Brexit row",
        "description": "NORTHERN Ireland is on the cusp of a return to a working government after two years. Hardline unionist party the DUP has agreed to restore power-sharing after a bitter Brexit row. And Michelle"
    },
    {
        "url": "https://www.thesun.co.uk/news/25638429/train-drivers-striking-more-pay-tablets-use/",
        "title": "Striking train drivers demand even MORE pay for using iPad-style tablets at work",
        "description": "STRIKING train drivers are demanding even more pay for using iPad-style tablets at work. The devices notify drivers of speed limits and safety checks on routes. But militant union chiefs from"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/ill-debate-jim-allister-when-he-publishes-paper-on-his-windsor-framework-achievements-donaldson/a116078044.html",
        "title": "I’ll debate Jim Allister when he publishes paper on his Windsor Framework achievements: Donaldson",
        "description": "Sir Jeffrey Donaldson has said he will have a public debate with Jim Allister when the TUV leader publishes a paper on what he has achieved in changing the Windsor Framework."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/the-key-questions-on-the-deal-to-restore-powersharing-at-stormont-109467/",
        "title": "The key questions on the deal to restore powersharing at Stormont",
        "description": "The DUP has agreed to end its blockade on devolution after two years protesting at post-Brexit trading arrangements."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24088898.hunt-less-scope-tax-cuts-march-budget-autumn/",
        "title": "Hunt: Less scope for tax cuts in March Budget than in the autumn",
        "description": "Prime Minister <b>Rishi Sunak</b> has faced calls for more tax cuts from Tory MPs amid dire polling for his party (Ian Forsyth/PA) In a reduction that came into force on January 6 and is being felt in pay packets this month, the main rate of national insurance ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497?ico=more_from_this_author",
        "title": "Labour urges restraint in Middle East following deadly attack on US base",
        "description": "The UK and US blamed Iran for the a drone attack on an American base in Jordan, which killed three troops, and <b>Rishi Sunak</b> called for tensions to be de-escalated. Labour leader Sir Keir Starmer said those responsible for the attack should be “held to ..."
    }
]