[
    {
        "url": "https://www.thetimes.co.uk/article/teesworks-freeport-project-secretive-and-poorly-governed-q3p7h3ckm",
        "title": "Teesworks freeport project ‘secretive and poorly governed’",
        "description": "A high-profile levelling-up project, championed by Rishi Sunak and Michael Gove, is secretive, poorly governed and is failing to protect public money, a damning report has concluded. An independent investigation into the regeneration of the Redcar steelworks in Teesside found that taxpayers had so far paid more than £500 million to convert the site into one of the country’s first freeports."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/justin-welby-rwanda-government-channel-archbishop-of-canterbury-b1135631.html",
        "title": "Rwanda Bill clears first Lords hurdle as Archbishop Of Canterbury issues warning",
        "description": "The Most Rev Justin Welby accused the Government of outsourcing the country’s ‘legal and moral responsibilities’."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/beleaguered-rishi-sunak-on-a-wing-and-a-prayer-and-now-a-fasting-regime",
        "title": "Beleaguered <b>Rishi Sunak</b> on a wing and a prayer – and now a fasting regime",
        "description": "PM battling to salvage his party from predicted electoral obliteration but Tories carry on plumbing the depths"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24082154.rishi-sunak-says-fasting-important-discipline-me/",
        "title": "<b>Rishi Sunak</b> says fasting is an ‘important discipline for me’",
        "description": "He may have a demanding schedule as Prime Minister, but <b>Rishi Sunak</b> has described intermittent fasting as being an “important discipline” for his “balanced lifestyle”. Mr <b>Sunak</b> typically avoids eating on Mondays as part of a health drive which he ..."
    },
    {
        "url": "https://www.reuters.com/world/uk/british-pm-sunak-wins-first-vote-house-lords-new-rwanda-asylum-law-2024-01-29/",
        "title": "British PM <b>Sunak</b> wins first vote in House of Lords on new Rwanda asylum law",
        "description": "LONDON, Jan 29 (Reuters) - British Prime Minister <b>Rishi Sunak</b> won the first vote in the upper house of parliament on his legislation to revive a plan to send asylum seekers to Rwanda despite lawmakers spending hours attacking the bill as unethical and ..."
    },
    {
        "url": "https://news.sky.com/story/rwanda-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-as-bill-passes-latest-lords-hurdle-13059470",
        "title": "Rwanda: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury as bill passes latest Lords hurdle",
        "description": "Justin Welby says plans to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;. But peers nod the scheme through - for now."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/justin-welby-government-archbishop-of-canterbury-archbishop-prime-minister-b1135631.html",
        "title": "Rwanda Bill clears first Lords hurdle as Archbishop Of Canterbury issues warning",
        "description": "The Most Rev Justin Welby accused the Government of outsourcing the country’s ‘legal and moral responsibilities’."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunaks-rwanda-bill-clears-215628311.html",
        "title": "<b>Rishi Sunak</b>&#39;s Rwanda bill clears first hurdle in the House of Lords",
        "description": "Bill has cleared its first major hurdle in the House of Lords, after peers voted 206 to 84, majority 122, against a motion designed to block it."
    },
    {
        "url": "https://www.mirror.co.uk/news/world-news/convoy-heading-towards-israel-border-31996951",
        "title": "Convoy heading towards Israel border with Lebanon as Middle East braces for war",
        "description": "President Joe Biden vowed the US “shall respond” to the attack on ­logistics base Tower 22 in Jordan which was hit by increasingly aggressive pro-Iranian militia who are based in Syria"
    },
    {
        "url": "https://inews.co.uk/opinion/lord-cameron-is-a-safe-pair-of-eyes-for-rishi-sunak-2879694",
        "title": "Lord Cameron is a safe pair of eyes for <b>Rishi Sunak</b>",
        "description": "It is an asset rather than a liability to have an experienced Foreign Secretary focusing solely on the international picture"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/29/kemi-badenoch-is-member-of-evil-plotters-whatsapp-group/",
        "title": "Kemi Badenoch is member of ‘Evil Plotters’ Tory WhatsApp group",
        "description": "But spokesman for Business Secretary rejects talk of a plot as ‘utter nonsense’ and suggests it is a targeted campaign against the minister"
    },
    {
        "url": "https://www.nottinghampost.com/news/nottingham-news/nottingham-attacks-victims-families-visit-9065652",
        "title": "Nottingham attacks: Victims&#39; families visit <b>Rishi Sunak</b> as Prime Minister does not rule out public inquiry",
        "description": "Valdo Calocane stabbed students Barnaby Webber and Grace O’Malley-Kumar and school caretaker Ian Coates to death."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/craig-mackinlay-rishi-sunak-net-zero-green-agenda-decline/",
        "title": "<b>Rishi Sunak</b>’s net zero targets are a ‘path to ruin’, says leading Tory MP",
        "description": "Craig Mackinlay accuses PM of ‘shameful acceptance of decline’ in the name of the green agenda and urges an end to damaging climate policies"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/ken-clarke-rwanda-bill-supreme-court_uk_65b7ff5ee4b077c17ab61647",
        "title": "Ken Clarke Warns Rwanda Bill Moves UK Towards An &#39;Elected Dictatorship&#39;",
        "description": "Ken Clarke has blasted Rishi Sunak ’s Rwanda bill, warning that overturning a Supreme Court ruling is “very dangerous” amid fears of the UK slipping into an “elected dictatorship”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13020887/rishi-sunak-fasting-monday-michael-mosley.html",
        "title": "<b>Rishi Sunak</b> says his routine of fasting on Mondays is an &#39;important discipline&#39; which helps with a &#39;balanced lifestyle&#39;",
        "description": "Despite his demanding schedule as Prime Minister, Mr Sunak said avoiding eating for 36 hours at the start of each week is good for a &#39;balanced lifestyle&#39;."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13020177/Vaping-firm-Chill-Brands-hammered-Rishi-announces-ban-disposables.html",
        "title": "Vaping firm Chill Brands hammered after <b>Rishi</b> announces ban on disposables",
        "description": "Chill Brands saw shares drop 30%, wiping £4.6m off its value and leaving it with a market capitalisation of just over £12m."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861039/kemi-badenoch-evil-plotters-whatsapp",
        "title": "Kemi Badenoch erupts at claim she is part of &#39;Evil Plotters&#39; Tory WhatsApp group",
        "description": "The Business and Trade Secretary, who is a favourite among the party faithful, criticised colleagues as she toured broadcast studios yesterday for &quot;stirring&quot; by suggesting she could replace <b>Rishi Sunak</b>. But The Guardian has now reported that she is a ..."
    },
    {
        "url": "https://www.investomania.co.uk/supreme-confident-on-vaping-as-it-unveils-buyback-despite-crackdown/",
        "title": "Supreme confident on vaping as it unveils buyback despite crackdown",
        "description": "The update came as Prime Minister <b>Rishi Sunak</b> set out plans to ban the sale of disposable vapes in England to protect children’s health. In a trading update for the three months to December 31st, traditionally its busiest period, Supreme said it enjoyed ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/dougie-smith-poll-general-election-tory-party-w5wpk3rbz",
        "title": "Tory aide Dougie Smith linked to rebels behind plot to oust <b>Rishi Sunak</b>",
        "description": "A senior Conservative strategist who has worked as an adviser to successive prime ministers is in contact with a group of rebels who are plotting to oust <b>Rishi Sunak</b>. Dougie Smith, who has played a key role as a fixer for decades in the Conservative Party ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/sunaks-rwanda-plan-faces-more-hurdles-as-tory-peers-condemn-policy?ref=biztoc.com",
        "title": "<b>Sunak</b>’s Rwanda plan faces more hurdles as Tory peers condemn policy",
        "description": "Conservative opposition in the House of Lords could prolong wrangling over bill’s implementation"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68134496?at_medium=RSS&at_campaign=KARANGA%E2%80%A6",
        "title": "Nottingham attacks: Police face probe over killer&#39;s alleged assaults",
        "description": "A police force which was investigating alleged assaults by a triple killer weeks before the Nottingham attacks has referred itself to the watchdog. Barnaby Webber and Grace O&#39;Malley-Kumar, both 19, were fatally stabbed on 13 June along with Ian Coates, 65. Valdo Calocane was given a hospital order for the killings on Thursday."
    },
    {
        "url": "https://www.thesun.co.uk/news/25586537/prince-harry-royalty-loyalty-charles-hospital/",
        "title": "Harry’s silence over King &amp; Kate’s health must be final nail in coffin of public opinion – we like loyalty from royalty",
        "description": "Manners maketh the man, so the saying goes. Just not in these woke times. NO wonder <b>Rishi Sunak</b> is under-performing – he’s bloody starving. Friends of the little-boy-bodied PM, have revealed the masochist “doesn’t eat on Mondays”. Instead ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/kemi-badenoch-part-tory-whatsapp-31996640",
        "title": "Kemi Badenoch is part of Tory WhatsApp group chat called &#39;Evil Plotters&#39;",
        "description": "Kemi Badenoch is part of a Tory WhatsApp group called &quot;Evil Plotters&quot;, according to bombshell reports. The Business and Trade Secretary insisted just yesterday that she doesn&#39;t want to topple <b>Rishi Sunak</b> and told Tory plotters to &quot;stop messing around&quot;. But in a shock twist it has emerged Ms Badenoch is a member of an &quot;Evil Plotters&quot; group chat, the Guardian revealed."
    },
    {
        "url": "https://inews.co.uk/news/politics/vape-tax-budget-sunak-health-legacy-2879554?ico=related_article_inline",
        "title": "Vape tax could be in budget as <b>Rishi Sunak</b> plans health legacy",
        "description": "<b>Rishi Sunak</b> unveiled his plans to outlaw disposable e-cigarettes and heavily curtail their availability in shops while visiting a school in Darlington on Monday, telling parents and pupils some vape flavours “literally look like sweets”. “There’s a ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-norfolk-68133873.amp",
        "title": "George Freeman quit as minister as he &#39;couldn&#39;t afford&#39; mortgage",
        "description": "Downing Street said it had &quot;no plans to change our approach to ministerial pay&quot;. Mr Freeman, who resigned amid <b>Rishi Sunak</b>&#39;s cabinet reshuffle, added: &quot;We&#39;re in danger of making politics something only hedge fund donors, young spin doctors and failed trade ..."
    },
    {
        "url": "https://uk.news.yahoo.com/u-k-ban-disposable-vapes-210704219.html",
        "title": "U.K. to Ban Disposable Vapes in Bid to Keep Them Out of Kids’ Hands",
        "description": "The package, introduced on Monday by Prime Minister <b>Rishi Sunak</b>, would also allow the government to regulate flavors, as well as how cartridges are packaged and displayed in shops. “You talk to any parent or teacher, they’ll talk to you about the ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24082154.rishi-sunak-says-fasting-important-discipline-me/",
        "title": "<b>Rishi Sunak</b> says fasting is an ‘important discipline for me’",
        "description": "He may have a demanding schedule as Prime Minister, but Rishi Sunak has described intermittent fasting as being an “important discipline” for his “balanced lifestyle”. Mr Sunak typically avoids eating on Mondays as part of a health drive which he said helps to combat his “weakness for sugary things”."
    },
    {
        "url": "https://metro.co.uk/2024/01/29/caught-15-year-old-vaping-reaction-ban-terrifies-20187938/?ico=trending-post-strip_item_1",
        "title": "I caught my 15-year-old vaping. Her reaction to the ban terrifies me",
        "description": "I started to believe I was a bad influence. So when <b>Rishi Sunak</b> announced he was planning to ban disposable vapes and restrict the flavour range by the end of the year, I felt relieved. She’s never lied to me before (Picture: Crystal Baynam ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/poll-ban-disposable-vapes-children-rishi-sunak-135911017.html",
        "title": "Do you agree with the ban on disposable vapes? Have your say",
        "description": "<b>Rishi Sunak</b> has announced plans to ban disposable vapes in an effort to protect children&#39;s health. In a visit to a school on Monday, the prime minister said he aims to &quot;stamp out&quot; vaping among young people. It is already illegal to sell vapes to anyone ..."
    },
    {
        "url": "https://www.standard.co.uk/news/health/james-nottingham-prime-minister-keir-starmer-rishi-sunak-b1135622.html",
        "title": "Nottingham victims’ families say <b>Rishi Sunak</b> has not ruled out public inquiry",
        "description": "The victims’ families have backed calls for a public inquiry. <b>Rishi Sunak</b> has previously resisted them but it emerged on Monday night that he told the families at a meeting in Downing Street that he had not ruled out an inquiry. Mr Webber’s father ..."
    },
    {
        "url": "https://www.channel4.com/news/disposable-vapes-to-be-banned-and-flavours-limited-to-tackle-alarming-rise-in-children-vaping",
        "title": "Disposable vapes to be banned and flavours limited to tackle ‘alarming’ rise in children vaping",
        "description": "<b>Rishi Sunak</b> has set out plans to ban disposable vapes after a steep rise in the number of children taking up vaping. It’s already illegal to sell vapes to anyone under 18 and the government also wants to limit flavours and end the use of colourful ..."
    },
    {
        "url": "https://www.channel4.com/news/rwanda-bill-is-leading-nation-down-a-damaging-path-says-archbishop-of-canterbury",
        "title": "Rwanda bill is ‘leading nation down a damaging path’, says Archbishop of Canterbury",
        "description": "The House of Lords looks set to make significant changes to the Government’s flagship Rwanda Bill, in defiance of <b>Rishi Sunak</b>’s demand that they should pass it unamended. On its first day of debate in the Lords a string of bishops, former mandarins and ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-grandee-ken-clarke-rwanda-bill-black-white-2879467",
        "title": "Tory grandee Ken Clarke savages Rwanda Bill: ‘It’s like saying all dogs are cats’",
        "description": "Tory grandee Ken Clarke has savaged Rishi Sunak’s Rwanda laws with a warning that they risk moving the UK towards an “elected dictatorship”. The former chancellor reversed his previous support for legislation related to the controversial deportation deal, warning that the Prime Minister’s latest move was a “a step too far”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/rishi-sunak-liz-truss-smoking-ban-vapes-unconservative/",
        "title": "<b>Rishi Sunak</b> hits back at Liz Truss after she called smoking ban ‘profoundly unconservative’",
        "description": "Prime Minister seeking to prevent anyone now aged 15 or under from ever legally buying cigarettes and to ban single-use vapes"
    }
]