[
    {
        "url": "https://www.tivysideadvertiser.co.uk/news/national/24013936.chancellor-jeremy-hunt-fuels-election-talk-announcing-march-6-budget/",
        "title": "Chancellor Jeremy Hunt fuels election talk after announcing March 6 budget",
        "description": "The Conservatives are expected to make a series of policy announcements in a bid to woo voters ahead of the general election."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-rush-find-alternative-asylum-plan-before-rwanda-flights-take-off-1722402",
        "title": "Labour Rush To Find Alternative Asylum Plan Before Rwanda Flights Take Off",
        "description": "While Rishi Sunak continues to push his emergency Rwanda Treaty, Keir Starmer is considering processing asylum applications from overseas."
    },
    {
        "url": "https://www.romfordrecorder.co.uk/news/national/24013374.sunak-considers-matter-cleverlys-date-rape-joke-closed-says-no-10/",
        "title": "<b>Sunak</b> considers matter of Cleverly’s date rape joke ‘closed’, says No 10",
        "description": "Downing Street said it was ‘right’ that the Home Secretary had apologised for making the remarks during a ‘private conversation’."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunaks-rather-unusual-home-154429928.html",
        "title": "<b>Rishi Sunak</b>&#39;s Rather Unusual Home Alone-Style Christmas Day Video Still Has People Talking",
        "description": "Rishi Sunak’s Christmas gift to social media was certainly unexpected this year. In a post shared on X (formerly Twitter) on Christmas Day, the prime minister can be seen apparently beavering away in an empty No.10 Downing Street office – before realising he is actually the only person in the whole building."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/nhs-medical-director-issues-warning-28355897",
        "title": "NHS medical director issues warning as junior doctors plan six more days of strikes",
        "description": "The medical director of the NHS has issued a stark warning as junior doctors plan six more days of strike action, as figures reveal the number of cancelled appointments has now topped 1.2m."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12904365/People-traffickers-Christmas-migrants-cross-Channel.html",
        "title": "People-traffickers take Christmas off as no migrants cross Channel to UK on Christmas Eve, Christmas Day or Boxing Day - the first time in five years",
        "description": "According to Home Office records, there were no new arrivals from small boats, which could be explained by poor weather conditions preventing people from making the perilous journey."
    },
    {
        "url": "https://www.theguardian.com/artanddesign/2023/dec/27/greece-would-offer-major-treasures-to-uk-for-parthenon-marbles-minister-says",
        "title": "Greece would offer major treasures to UK for Parthenon marbles, minister says",
        "description": "Culture minister Lina Mendoni pledges to ‘fill the void’ at the British Museum should the ancient sculptures be returned"
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/27/how-a-spring-uk-budget-could-fire-the-starting-gun-for-an-early-election?ref=biztoc.com",
        "title": "How a spring UK budget could fire the starting gun for an early election",
        "description": "UK economic prospects are bleak but an agenda-setting fiscal event such as sweeping tax cuts in March offers another roll of the dice"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/out-touch-rishi-sunak-blasted-31757372",
        "title": "Out-of-touch <b>Rishi Sunak</b> blasted over &#39;obscene&#39; tax cut for millionaires",
        "description": "Rishi Sunak is considering scrapping inheritance tax for the richest families, after ordering a &#39;gear change&#39; on tax in a desperate bid to turn around Tory fortunes"
    },
    {
        "url": "https://www.thetimes.co.uk/article/spring-budget-2024-date-time-jeremy-hunt-w3wch276c?ilc=timesradio:morefromthetimes",
        "title": "Spring budget 2024 set for March 6: this is what it might mean",
        "description": "Jeremy Hunt will unveil his 2024 spring budget on March 6, in what is likely to be his final fiscal statement before the next general election. The budget is expected to focus on tax cuts, growth and wooing voters,"
    },
    {
        "url": "https://www.property118.com/spring-budget-will-take-place-on-march-6-but-landlords-look-like-missing-out-again/",
        "title": "Spring Budget will take place on March 6 – but landlords look like missing out (again…)",
        "description": "Budget has been scheduled for March 6, 2024; Chancellor Jeremy Hunt has announced. He has now commissioned a fiscal and economic forecast from the Office for Budget Responsibility (OBR)"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2023/12/27/chancellor-jeremy-hunt-fuels-election-talk-after-announcing-march-6-budget/",
        "title": "Chancellor Jeremy Hunt fuels election talk after announcing March 6 budget",
        "description": "The Conservatives are expected to make a series of policy announcements in a bid to woo voters ahead of the general election."
    },
    {
        "url": "https://news.sky.com/story/amp/sunak-considers-matter-closed-after-home-secretary-apologises-for-date-rape-joke-13038230",
        "title": "<b>Sunak</b> &#39;considers matter closed&#39; after home secretary apologises for date rape joke",
        "description": "Mr Cleverly apologised for the remarks but has faced calls to resign by a women&#39;s charity while Labour accused <b>Rishi Sunak</b> of an &quot;absence of leadership, accountability and integrity&quot; for failing to take action against him. Asked for the prime minister&#39;s ..."
    }
]