[
    {
        "url": "https://www.ibtimes.co.uk/bibby-stockholm-barge-suicide-victim-identified-albanian-national-1722246",
        "title": "Bibby Stockholm Barge Suicide Victim Identified As Albanian National",
        "description": "Asylum seekers are speaking out against the Bibby Stockholm Barge after a series of suicides, revealing that &quot;the boat is like a prison&quot;."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/20/joe-biden-gave-green-light-to-ireland-for-troubles-ambush/",
        "title": "How Joe Biden gave green light to Ireland for Troubles ambush",
        "description": "The president is fiercely proud of his Irish roots and gave his personal blessing for Dublin’s legal challenge against immunity legislation"
    },
    {
        "url": "https://uk.news.yahoo.com/private-sector-pay-hs2-euston-204135881.html",
        "title": "Private sector will pay for HS2 Euston tunnel, Transport Secretary Mark Harper insists",
        "description": "Transport Secretary Mark Harper has dismissed fears that private developers will refuse to pay for 4.5 miles of HS2 tunnelling works into Euston station."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/20/michelle-mone-to-be-sued-by-newspaper-ppe/",
        "title": "Michelle Mone to be sued by newspaper over PPE ‘lies’",
        "description": "The New European seek reimbursement for legal fees as Tory peer threatens to leak private recording with civil servant"
    },
    {
        "url": "https://www.cityam.com/private-sector-ai-forum-to-launch-in-january-no10-announce/",
        "title": "Private sector AI forum to launch in January, No10 announce",
        "description": "A new artificial intelligence (AI) opportunity forum to explore private sector adoption of the technologies will launch in the new year."
    },
    {
        "url": "https://www.investing.com/news/world-news/macron-defends-new-french-migration-law-despite-political-tensions-3261143",
        "title": "Macron defends new French migration law despite political tensions",
        "description": "The bill underscored Macron&#39;s difficulties governing without a parliamentary majority, which he lost last year, as well as the rightward shift in much of Europe as governments try to curb the rise of the far-right by being tougher on immigration."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847753/rishi-sunak-ireland-court-Leo-Varadkar",
        "title": "<b>Rishi Sunak</b> takes brutal swipe at Ireland after it makes &#39;misguided&#39; decision",
        "description": "Prime Minister <b>Rishi Sunak</b>&#39;s administration was speaking after it emerged Irish Taoiseach Leo Varadkar planned to sue Britain in a spat over the UK Legacy Act. Aspects of the legislation include a limited form of immunity from prosecution for Troubles ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24004159.michael-gove-questions-answer-ppe-medpro-scandal/",
        "title": "Michael Gove has questions to answer about PPE Medpro scandal",
        "description": "THE fallout and stench from the Michelle Mone scandal seems to be growing by the day and have many possible implications for some very"
    },
    {
        "url": "https://www.thesun.co.uk/news/25122127/rishi-sunak-inflation-falls-two-year-low-rate-cuts/",
        "title": "Festive joy for <b>Rishi Sunak</b> as inflation falls to two-year low and hopes grow of interest rate cut in early 2024",
        "description": "PRIME Minister Rishi Sunak got an early Christmas gift yesterday — as inflation fell. And the surprise slump has boosted hopes of a spring tax giveaway. Experts are now predicting interest rate"
    },
    {
        "url": "https://www.thesun.co.uk/news/25121339/michelle-mone-bra-profiteered-covid-crisis/",
        "title": "Ghastly Baroness Bra profiteered in Covid crisis then lied about it to the Press",
        "description": "THE great thing about the Conservative Party is that they keep ­throwing up these absolutely awful people, one after another. It’s the gift that keeps on giving. The latest is a real piece of"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24002334.gateshead-council-leaders-fears-tyne-bridge-delays/",
        "title": "Gateshead council leader&#39;s fears over Tyne Bridge delays",
        "description": "Any further delay to the restoration of the Tyne Bridge will pose a “real danger” of even greater disruption for the people of the North"
    },
    {
        "url": "https://www.borehamwoodtimes.co.uk/news/national/24004103.ministers-warned-accountability-risk-missing-whatsapp-messages/",
        "title": "Ministers warned of accountability risk over missing WhatsApp messages",
        "description": "It comes after Penny Mordaunt claims messages between her and former prime minister Boris Johnson had vanished."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12887083/uk-northern-ireland-amnesty-law-legal-challenge.html",
        "title": "Dublin says it has &#39;no choice&#39; but to take legal action over UK&#39;s Northern Ireland amnesty law - as British government slams the move as &#39;unnecessary&#39;",
        "description": "The new Troubles legacy act became law in September and gives conditional amnesties to former soldiers and militants involved in decades of violence."
    },
    {
        "url": "https://inews.co.uk/news/politics/tax-cuts-2024-surprise-drop-inflation-2818811?ico=more_from_this_author",
        "title": "Tax cuts coming in 2024 after surprise drop in inflation",
        "description": "The fall in inflation was driven by lower fuel and energy prices and a slowing in the pace of increase in food prices, the ONS said. Core inflation – which strips out the most volatile elements – also saw a significant reduction, despite unusually high wage growth."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847729/tory-every-vote-sunak-byelection",
        "title": "Tory ministers set to fight for &#39;every single vote&#39; in <b>Rishi Sunak</b>&#39;s by-election test",
        "description": "Tory ministers have admitted they are fighting “for every single vote” in a fresh by-election test for <b>Rishi Sunak</b>. Voters in Wellingborough voted to oust disgraced MP Peter Bone after being accused of bullying and sexual misconduct in 2012 and 2013."
    },
    {
        "url": "https://www.itv.com/news/2023-12-20/girl-8-crowned-best-female-chess-player-at-european-championship",
        "title": "&#39;Phenomenon&#39;: Girl, 8, crowned best female chess player at European championship",
        "description": "Bodhana Sivanandan has made history after defeating a master player 30 years her senior to be crowned the best female player at a Euro championship. | ITV National News"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/20/peter-bone-saga-shows-tories-are-weak-labour-tells-wellingborough-voters",
        "title": "Peter Bone saga shows Tories are weak, Labour tells Wellingborough voters",
        "description": "Jonathan Ashworth, out campaigning for byelection, says <b>Rishi Sunak</b> is being ‘pushed around’ by rightwingers Labour’s Jonathan Ashworth has accused the Conservatives of being weak in their handling of the case of the disgraced former MP Peter Bone ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-small-boats-eu-deal-latest-b2467498.html",
        "title": "New EU anti-migrant deal will help <b>Rishi Sunak</b> ‘stop the boats’, claims French politician",
        "description": "French MEP Fabienne Keller, of the Renew Europe group, who led the negotiations, insisted the Geneva Convention will be “fully applied” in the so-called waiting zones, adding: “If I may make a comparison, instead of sending people to Rwanda, we are doing it on European soil.”"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/20/wellingborough-byelection-gives-labour-another-chance-to-humiliate-rishi-sunak",
        "title": "Wellingborough byelection gives Labour another chance to humiliate <b>Rishi Sunak</b>",
        "description": "Recall of MP Peter Bone opens up Brexit-leaning former safe seat where defections from Tories in any direction could help Labour win"
    },
    {
        "url": "https://news.sky.com/story/government-sparks-anger-and-ridicule-with-multi-million-network-north-road-project-for-london-13034791?dcmp=snt-sf-twitter",
        "title": "Government sparks anger and ridicule with multi-million pound &#39;Network North&#39; road project... for London",
        "description": "Rishi Sunak had pledged to use Network North to &quot;join up our great towns and cities in the North and the Midlands&quot;. But the latest announcement from the scheme is to fix the capital&#39;s roads."
    },
    {
        "url": "https://news.sky.com/video/cost-of-living-crisis-slowing-inflation-nothing-to-do-with-tories-says-iceland-boss-richard-walker-13035100",
        "title": "Cost of living crisis: Slowing inflation &#39;nothing to do with Tories&#39;, says Iceland boss Richard Walker",
        "description": "Richard Walker said it was &quot;unedifying to see Rishi [Sunak] celebrating that he has single-handedly halved inflation when, of course, we know it&#39;s nothing to do with him - it&#39;s the Bank of England and global economic factors&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12886825/Looking-tips-Rishi-Prime-Minister-Sunak-shares-joke-actress-Joanna-Scanlan-Downing-Street-film-industry-reception.html",
        "title": "Looking for tips <b>Rishi</b>? Prime Minister <b>Sunak</b> shares a joke with The Thick Of It actress Joanna Scanlan at Downing Street film industry reception",
        "description": "Scanlan is known for her role as Terri Coverley on the classic BBC comedy, a notoriously useless senior press officer for the Department of Social Affairs and Citizenship."
    },
    {
        "url": "https://inews.co.uk/opinion/2024-housing-crisis-dwarfs-cost-of-living-2818780?ico=most_popular",
        "title": "2024 will be the year the housing crisis dwarfs the cost of living",
        "description": "For <b>Rishi Sunak</b>, the latest sharp drop in inflation was the early Christmas present he’d been hoping for. The dip in the Consumer Prices Index (CPI), from 4.6 per cent to 3.9 per cent last month, means that he will certainly fulfil his new year promise ..."
    },
    {
        "url": "https://www.politicshome.com/thehouse/article/its-rishi-sunak",
        "title": "It’s all over for <b>Rishi Sunak</b>",
        "description": "The received wisdom is that we are way past the point where the final nail has been hammered into Rishi Sunak’s political coffin, and it is now"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-faces-major-tory-132740502.html",
        "title": "<b>Rishi Sunak</b> faces ‘boiler tax’ rebellion",
        "description": "<b>Rishi Sunak</b> is facing another major Tory rebellion over his plans to introduce a net zero “boiler tax” to railroad through the switch to heat pumps. Conservative backbenchers are mobilising to oppose the proposals when they come before the Commons for ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67759768?at_medium=RSS",
        "title": "Statistics watchdog rebukes <b>Rishi Sunak</b> over claim debt falling",
        "description": "Prime Minister <b>Rishi Sunak</b>&#39;s claim that the government has reduced debt has been challenged by the UK&#39;s statistics watchdog. The watchdog&#39;s chairman said the assertion &quot;may have undermined trust in the government&#39;s use of statistics&quot;. Debt has been going ..."
    },
    {
        "url": "https://www.gq-magazine.co.uk/article/8-tech-predictions-2024",
        "title": "How tech will change your life in 2024, according to experts",
        "description": "Experts offer their predictions on how our lives will change – in big and small ways – in the 12 months to come"
    },
    {
        "url": "https://inews.co.uk/opinion/2024-housing-crisis-dwarfs-cost-of-living-2818780?ico=best_of_opinion",
        "title": "2024 will be the year the housing crisis dwarfs the cost of living",
        "description": "The real story of 2024 may well be that the cost of living crisis will be replaced by a cost of housing crisis. Even if wages finally outpace inflation, and even if some food and energy prices ease, the sheer difficulty in paying a rent or mortgage may further undermine any sense of security."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/penny-mordaunt-boris-johnson-conservative-government-cabinet-office-b1128360.html",
        "title": "Ministers warned of accountability risk over missing WhatsApp messages",
        "description": "It comes after Penny Mordaunt claims messages between her and former prime minister Boris Johnson had vanished."
    },
    {
        "url": "https://www.ft.com/content/9b01ac20-d174-43fc-8540-1011ae925c7b",
        "title": "Rare bright spot for <b>Rishi Sunak</b> as UK inflation tumbles",
        "description": "Also in this newsletter: concerns mount over shipping disruption, FT person of the year, court rules that AI machine cannot be an inventor"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847734/rishi-sunak-warning-david-cameron-craig-oliver",
        "title": "<b>Rishi Sunak</b> warned &#39;it&#39;s all over&#39; by David Cameron&#39;s former top aide",
        "description": "The former official claimed in a bombshell column that &quot;we are way past the point where the final nail has been hammered into Rishi Sunak&#39;s political coffin&quot;."
    },
    {
        "url": "https://www.ft.com/content/697d4a19-38fd-4daf-ac7f-3548506260e3",
        "title": "‘Network North’ HS2 savings spent on London pothole repair",
        "description": "We&#39;ve confirmed funding for each London borough to ensure millions of road users enjoy smoother and safer journeys. This is only possible due to £8.3 billion of extra investment from redirected HS2 funding, enough to resurface up to 5,000 miles of roads across the country. pic.twitter.com/5JUlQJMsK9"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/uk-sign-financial-services-deal-174604677.html",
        "title": "UK to sign financial services deal with Switzerland",
        "description": "Chancellor Jeremy Hunt is set to ink a financial services deal with Switzerland in a bid to ease business transactions with UK firms and individuals."
    },
    {
        "url": "https://www.heraldscotland.com/news/23986529.mark-drakeford-quits-welsh-first-minister/?ref=twtrec",
        "title": "Mark Drakeford quits as Welsh first minister",
        "description": "At PMQs, <b>Rishi Sunak</b> wished Mr Drakeford well Sir Keir Starmer described him as a &quot;titan of Labour and Welsh politics&quot;. The leader of the Welsh Conservatives, Andrew RT Davies said: “I wish Mark well as he stands down from the helm. “While we may have ..."
    }
]