[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h3gmh4",
        "title": "How To Interview A Prime Minister",
        "description": "Laura’s preparing for an interview with Rishi Sunak on Sunday. She and Paddy are joined by political journalist and documentary maker Michael Cockerell, who’s interviewed nearly every prime minister from 1963 onwards."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/americans-will-rally-around-constitution-mike-pence-tells-sky-news-he-has-confidence-in-upcoming-election-process/",
        "title": "&#39;Americans will rally around constitution&#39;: Mike Pence tells Sky News he has confidence in upcoming election process",
        "description": "Three years after rioters shouted hang Mike Pence during the attack on the US Capitol, the former vice president has said he did the right thing that day."
    },
    {
        "url": "https://metro.co.uk/2024/01/06/hundreds-flood-warnings-still-place-across-uk-20073606/?ico=metro-posts_gadgets_whats-trending-now",
        "title": "Hundreds of flood warnings still in place as temperatures plummet across the UK",
        "description": "Prime Minister <b>Rishi Sunak</b> insisted people should be ‘reassured’ by the response to flooding, but Labour accused the Government of being ‘asleep at the wheel’ over flood warnings with leader Sir Keir Starmer vowing to make flood defences ‘fit for ..."
    },
    {
        "url": "https://uk.news.yahoo.com/shift-renewable-energy-economic-growth-170633268.html",
        "title": "Shift to renewable energy would make economic growth impossible, says expert",
        "description": "Given all that, he said he had sympathy for politicians such as Mr Macron and <b>Rishi Sunak</b> who continue to plug “green growth”. He said: “They can’t really promise anything else because they have no alternative. France, like the UK, has no plan B ..."
    },
    {
        "url": "https://www.politics.co.uk/week-in-review/2024/01/06/week-in-review-how-rishi-sunak-lost-control-of-the-election-narrative/",
        "title": "Week-in-Review: How <b>Rishi Sunak</b> lost control of the election narrative",
        "description": "Incumbency advantage is a very real thing in UK politics. When asked to select who they want as prime minister — either the incumbent or the Leader of the Opposition — Britons tend to lump in, perhaps logically,"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-goes-high-expose-132151746.html",
        "title": "If <b>Rishi Sunak</b> goes high, he can expose the folly of Labour’s pitch",
        "description": "Considering how scathing and universal the criticism of Rishi Sunak’s government has been, it is really quite remarkable how ineffectual the Opposition attacks on him seem to be. When even the forces that might be expected to remain loyal to any Tory leader appear to have given up on this regime,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/robert-jenrick-rwanda-rishi-sunak-suella-braverman-bill-b2474330.html",
        "title": "Robert Jenrick threatens to amend PM’s Rwanda Bill unless it is strengthened",
        "description": "Mr Jenrick said he plans to “lay amendments to the Bill next week” if <b>Rishi Sunak</b> has not strengthened it since it last appeared before MPs. The Safety of Rwanda legislation is due to return to the House of Commons this month as <b>Rishi Sunak</b> looks to ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24031707.rishi-sunak-refuses-back-calls-strip-vennells-cbe/",
        "title": "<b>Rishi Sunak</b> refuses to back calls to strip Vennells of her CBE",
        "description": "Rishi Sunak and Sir Keir Starmer have both resisted backing calls for a former Post Office boss to lose her CBE over the Horizon scandal."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rishi-sunak-reckons-levelling-up-28397237",
        "title": "<b>Rishi Sunak</b> reckons &#39;levelling up&#39; is working - we asked voters in a Tory constituency... some just laughed",
        "description": "Rishi Sunak says the government is making &#39;great progress&#39; in &#39;levelling up&#39; the country. But when the Manchester Evening News asked voters in a Conservative constituency which the Prime Minister visited in Greater Manchester today (January 5), hardly anyone agreed."
    },
    {
        "url": "https://www.cheshire-live.co.uk/news/chester-cheshire-news/rishi-sunak-booed-heckled-leaves-28398974.amp",
        "title": "<b>Rishi Sunak</b> is booed and heckled as he leaves Stockport restaurant",
        "description": "Shouts of &#39;resign&#39; were heard from several people gathered on the opposite side of the road as Mr <b>Sunak</b> left La Dolce Vita on Stockport Road. <b>Sunak</b> was on a whistle-stop tour of the region this morning, also taking in Altrincham Food Market with local MP ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/storm-henk-flooding-government-announces-payments-worth-thousands-of-pounds-to-help-communities-recover/",
        "title": "Storm Henk flooding: Government announces payments worth thousands of pounds to help communities recover",
        "description": "Areas hit hard by flooding after Storm Henk will be able to apply for thousands of pounds in government money to pay for recovery work and repairs."
    },
    {
        "url": "https://www.lbc.co.uk/news/jenrick-amend-rwanda-bill/",
        "title": "Ex-Immigration Minister Jenrick vows amendments to Rwanda bill after resigning of Govt asylum plan",
        "description": "Former Immigration Minister Robert Jenrick has vowed to amend the Government&#39;s Rwanda bill to make it - after he resigned in protest at the bill last year."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/06/shift-to-renewable-energy-make-economic-growth-impossible/",
        "title": "Shift to renewable energy would make economic growth impossible, says expert",
        "description": "Jean-Marc Jancovici, the author of World Without End, the graphic novel on climate change which has sold nearly a million copies in France, said that wind, solar and hydroelectric power offer no miracle solution and “will not allow us to maintain today’s modern industrial world”."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67901849",
        "title": "Kuenssberg: New year, new tactics but old problems for <b>Sunak</b>",
        "description": "There is a sense in every nook and cranny of Westminster that changing the mood is almost impossible, given how many things have gone wrong. A view that decline has taken hold is most definitely in fashion. That is what the polls and newspaper columns say - and so, privately, do many MPs."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12933335/Britain-grants-asylum-greater-percentage-migrants-European-countries-double-rate-France-Sweden.html",
        "title": "Britain grants asylum to a greater percentage of migrants than most European countries - and rate has doubled since Brexit",
        "description": "Asylum approval rates have soared to 75.1 per cent in the year ending September 2023, up from 31.1 per cent in 2018, analysis of official data shows."
    },
    {
        "url": "https://metro.co.uk/video/protesters-attend-free-palestine-coalition-demonstration-london-3095009/",
        "title": "Video: Protesters attend Free Palestine Coalition demonstration in London",
        "description": "Around 200 pro-Palestinian protesters sat down on the road in front of Westminster Bridge. Other protesters in the same area wore facemasks of leading politicians, including Prime Minister Rishi Sunak and US President Joe Biden,"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1852752/met-police-london-palestine-protest-westminster-bridge",
        "title": "Met Police mocked for standing by as protesters block Westminster Bridge",
        "description": "The Metropolitan Police has been brutally mocked for standing by as protestors blocked Westminster Bridge, with many asking why arrests were not made - and the march stopped. Hundreds of pro-Palestine protestors took to the streets of London on Saturday, with their march ending on one of the capital&#39;s busiest bridges."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1852751/fears-for-self-driving-cars",
        "title": "Fears for self-driving cars after US rollout",
        "description": "Experts warn the &quot;truly terrible&quot; record self-driving cars have in America, after PM used King&#39;s Speech to pave the way for their introduction in the market."
    },
    {
        "url": "https://inews.co.uk/news/vets-refuse-euthanise-xl-bully-dogs-2841241",
        "title": "Vets refuse to euthanise XL Bully dogs after threats and abuse",
        "description": "Vets are defying a ban on the dogs, which is being rolled out from this month in England and Wales, having been subjected to &#39;abuse, intimidation and threats&#39;"
    },
    {
        "url": "https://leftfootforward.org/2024/01/the-right-wing-plot-against-ukraine/",
        "title": "The right-wing plot against Ukraine",
        "description": "With Nigel Farage, a self-declared Putin admirer, believed to be on the political rise and intending to ‘shape politics’ before the country goes to the polls this year, you wonder how the western right’s anti-Ukraine sentiment may impact on the UK."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/06/rwanda-plan-rishi-sunak-eu-court-block-flights-ongoing-risk/",
        "title": "Home Office warns that European court intervention is &#39;critical&#39; threat to Rwanda plan",
        "description": "Flights to Rwanda have been grounded since June 2022, when the European Court of Human Rights blocked the first departure"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/pro-palestinian-protesters-stage-sit-in-at-westminster-bridge-96946/",
        "title": "Pro-Palestinian protesters stage sit-in at Westminster Bridge",
        "description": "Other protesters wore facemasks of leading politicians, including Prime Minister <b>Rishi Sunak</b> and US President Joe Biden, and held up hands covered in red paint."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/ex-immigration-minister-threatens-toughen-130826973.html",
        "title": "Ex-immigration minister threatens to toughen Rwanda bill after leak suggests <b>Sunak</b> tried to scale back scheme",
        "description": "<b>Rishi Sunak</b> faces a growing battle over his flagship Rwanda legislation after his former immigration minister threatened to lead a parliamentary revolt to try to toughen the bill. Robert Jenrick warned that if the prime minister did not strengthen the new ..."
    }
]