[
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-sinking-feeling-58-mps-32156072",
        "title": "&#39;Tories sinking feeling as 58 MPs announce plans to abandon Conservative ship&#39;",
        "description": "Some 58 Tory MPs have already announced they are quitting next time around but the figure could top 100 – by some counts even 150"
    },
    {
        "url": "https://inews.co.uk/news/uk-kremlin-critic-release-navalny-2912614?ico=related_article_inline",
        "title": "US urges UK to secure Kremlin critic’s release after Navalny death",
        "description": "Vladimir Kara-Murza was jailed for 25 years on treason charges last year after he criticised Russia’s full-scale invasion of Ukraine"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/sunak-warned-against-playing-footsie-with-farage-and-reform-uk-100315/",
        "title": "<b>Sunak</b> warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.politico.eu/article/eu-u-k-announce-new-migration-agency-cooperation/",
        "title": "EU, UK announce joint effort on migration",
        "description": "The EU and the U.K. have completed talks ahead of a new blueprint to crack down on illegal migration. The two parties will release details of the new cooperation agreement, which has been in the works since at least the fall, in the coming days."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/was-a-lack-of-ukrainian-ammunition-to-blame-for-russia-taking-avdiivka/",
        "title": "Was a lack of Ukrainian ammunition to blame for Russia taking Avdiivka?",
        "description": "Adam Boulton: <b>Sunak</b>&#39;s by-election nightmare, Starmer&#39;s Rochdale headache, and why a May election is a distinct possibility... This week&#39;s two by-elections had something for everyone - except <b>Rishi Sunak</b>&#39;s Conservatives. Alexei Navalny: Allies accuse ..."
    },
    {
        "url": "https://uk.style.yahoo.com/baftas-christopher-nolan-scores-first-202224864.html",
        "title": "BAFTAs: Christopher Nolan Scores First Best Director Win From British Academy With ‘Oppenheimer’",
        "description": "More from Deadline Breaking Baz: Christopher Nolan Lauded By UK Premier <b>Rishi Sunak</b>, Who Cracks A Few Risqué Gags At Prestigious BFI Fellowship Event Oscar Lunch Brings Out The Stars And Nominees But It Was &#39;Anatomy Of A Fall&#39;s French Border Collie That ..."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/national/24126967.rishi-sunak-defended-by-election-defeats-set-difficult-backdrop/",
        "title": "<b>Rishi Sunak</b> defended after by-election defeats set against ‘difficult backdrop’",
        "description": "A Conservative minister has defended Rishi Sunak and the party after two by-election defeats, saying they were set against a “very difficult backdrop”. The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened Reform UK party, were the latest blow to the Prime Minister."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "<b>Rishi Sunak</b> warned against &#39;playing footsie&#39; with Nigel Farage and Reform UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-patten-prime-minister-nigel-farage-labour-neil-kinnock-b1139917.html",
        "title": "<b>Sunak</b> warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/baftas-christopher-nolan-scores-first-202224864.html",
        "title": "BAFTAs: Christopher Nolan Scores First Best Director Win From British Academy With ‘Oppenheimer’",
        "description": "Given the number of high-wattage films garnering multiple nominations at the BAFTAs this year, the rationing of awards was always likely unpredictable on the night. And so it proved, meaning that The Zone of Interest and Poor Things had already nibbled away at Oppenheimer’s chances of a decent sweep before the Best Director award came"
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/uk-world-news/new-uk-bridge-thats-two-28657801",
        "title": "The new UK bridge that&#39;s two miles long and costs £1.6billion to build",
        "description": "The world&#39;s longest railway viaduct is being built as part of HS2 Phase One, which will connect London and Birmingham. It is costing around £1.6bn and is more than halfway complete"
    },
    {
        "url": "https://www.lbc.co.uk/news/alexei-navalny-wife-goodbye/",
        "title": "Alexei Navalny&#39;s wife shares goodbye photo as Yulia Navalnaya blames Putin after husband died in prison",
        "description": "Alexei Navalny&#39;s wife Yulia Navalnaya has shared a photo with her opposition leader husband after it was announced he had died in prison on Friday."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-von-der-leyen-express-190118389.html",
        "title": "<b>Sunak</b>, von der Leyen express outrage at Navalny&#39;s death, discuss Mideast, Ukraine",
        "description": "&quot;The Prime Minister and President Von der Leyen expressed their outrage at the death of Alexei Navalny, and underscored the utmost importance of holding those responsible within the Russian system to account,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/general-election-conservative-tory-boris-johnson-leadership/",
        "title": "Tory Party under Boris Johnson could regain votes of ‘lost Conservatives’",
        "description": "Among the “lost Conservatives”, who said they won’t vote Tory at the next election but don’t know who to vote for, 52 per cent said they would vote for Mr Johnson over Sir Keir. This is compared to 39 per cent saying they would vote for the current Prime Minister over the Labour leader."
    },
    {
        "url": "https://news.sky.com/story/the-week-britain-hits-back-over-navalny-13075041",
        "title": "The week... Britain hits back over Navalny",
        "description": "Two of Westminster&#39;s best-connected journalists, Sky News&#39;s Sam Coates and Politico&#39;s Jack Blanchard, guide us through their predictions of how British politics will play out over the next seven days. It&#39;s looking to be another big week for foreign affairs."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/18/royal-mail-delay-bulk-letters-nhs-government-court-summons/",
        "title": "Royal Mail weighs up delaying bulk deliveries of NHS and government letters",
        "description": "<b>Rishi Sunak</b> has already ruled out any move to water down the USO over fears it could lead to vital correspondence arriving later than required. Hours after Ofcom floated the idea of slowing down mail or cutting the USO in January, Mr <b>Sunak</b> said ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/left-jobless-ostracised-judged--28637585",
        "title": "It left them jobless, ostracised and judged ... but it saved their lives",
        "description": "With anti-trans hate crime at a record high, the M.E.N&#39;s James Holt speaks to three inspirational people about their journey to becoming their true self"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/18/tory-mps-pushing-for-rishi-sunak-to-quit-before-he-is-deposed",
        "title": "Tory MPs pushing for <b>Rishi Sunak</b> to quit before he is deposed",
        "description": "Backbench MPs said to be lobbying for PM to stand down after local elections in May to avoid spectacle of coup"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097839/Rwanda-flights-soon-bill-passed-illegal-migration-minister-insists.html",
        "title": "Rwanda flights will take off &#39;as soon as the bill is passed&#39;, illegal migration minister insists",
        "description": "Michael Tomlinson (left)defended the Conservative&#39;s policy and said asylum seekers will be sent to Kigali, the capital of Rwanda, &#39;as soon as possible&#39;."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/public-services-tax-cuts-gaslighting-no-10-20294998/",
        "title": "Public services over tax cuts and gaslighting from no.10?",
        "description": "In today’s MetroTalk, a reader writes in to express frustration at tax cuts – because he, like most of us, wants to invest them to our public services. Meanwhile, the UK is in a recession, and so, readers were rather perplexed at the prime minister’s rather optimistic assertion on Wednesday that the UK economy had actually ‘turned a corner.’"
    },
    {
        "url": "https://inews.co.uk/news/politics/tax-cuts-without-slashing-public-spending-hunt-2912540?ico=more_from_this_author",
        "title": "Tax cuts still possible without slashing public spending, Hunt believes",
        "description": "Mr Hunt and Rishi Sunak are still eyeing up tax cuts in the 6 March Budget, a key moment for Tory poll prospects"
    },
    {
        "url": "https://uk.news.yahoo.com/where-do-uk-political-parties-stand-gaza-ceasefire-171714480.html",
        "title": "Where do the UK&#39;s political parties stand on a Gaza ceasefire?",
        "description": "With Labour changing its stance and backing an immediate ceasefire, here&#39;s where the main UK parties stand on the Gaza conflict."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13097317/DOMINIC-LAWSON-firms-Labour-win-power-jobs.html",
        "title": "DOMINIC LAWSON: You can virtually hear big firms sucking up to Labour, but if they win it&#39;ll be the sound of jobs gurgling down the plughole...",
        "description": "Only four months earlier, he had written to <b>Rishi Sunak</b>: ‘It is my most fervent wish that I succeed in becoming an approved Conservative Party Candidate, and I have — over the past two years — given my all to earning that privilege . . . I have ..."
    },
    {
        "url": "https://www.gg2.net/rishi-sunak-appeals-tory-family-to-come-together/",
        "title": "<b>Rishi Sunak</b> appeals Tory family to come together",
        "description": "PRIME MINISTER Rishi Sunak on Saturday (17) made a direct appeal to voters to stick with his plan to turn things around as he made a plea for the Tory family"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/afghans-soldiers-uk-settlement-sunak-b2496269.html",
        "title": "British army veteran’s final mission to give brave Afghan comrade a UK home",
        "description": "Exclusive: Veteran paratrooper demands Britain reverses decision to deny sanctuary to Afghan commando who risked his life to fight with UK troops against the Taliban"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/millions-uk-households-issued-brutal-28656875",
        "title": "Millions of UK households issued brutal £523 council tax bombshell",
        "description": "Office for Budget Responsibility documents suggest the amount raised from council tax is set to reach £57.4billion - double what is was under Labour."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13094795/Housebuilders-call-urgent-stamp-duty-cut.html",
        "title": "Housebuilders call for urgent stamp duty cut to boost property market",
        "description": "Taylor Wimpey&#39;s Jennie Daly said that there was a &#39;real case&#39; for reducing the levy on lower-priced properties and for sellers over the age of 60 who were looking to downsize."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/18/when-grapefruit-mustnt-be-your-cup-of-tea",
        "title": "When grapefruit mustn’t be your cup of tea",
        "description": "Brexit shoulder | Murderous Mozart | Emeritus professors | Rishi Sunak on the edge"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/michael-tomlinson-guarantee-flights-rwanda-election-b2498158.html",
        "title": "Minister claims he can guarantee flights to Rwanda before general election",
        "description": "Illegal migration minister Michael Tomlinson has said he can guarantee flights carrying asylum seekers to Rwanda will take off before the next election as he defended the government&#39;s floundering plans to ‘stop the boats ’. Rishi Sunak has repeatedly refused to go that far, saying his aim is to get planes in the air."
    },
    {
        "url": "https://www.thesun.co.uk/motors/26018296/smart-motorway-drivers-stung-8k-fines/",
        "title": "The smart motorway where drivers are stung by £8,000 fines every day amid 60mph limit",
        "description": "DRIVERS have been left shocked after being stung by £8,000 fines every day on a smart motorway with a 60mph limit. During the four-year trial, over 22,000 motorists were hit with speeding fines"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/starmer-says-fighting-must-stop-now-in-gaza-conflict-ahead-of-ceasefire-vote/",
        "title": "Starmer says &#39;fighting must stop now&#39; in Gaza conflict ahead of ceasefire vote",
        "description": "Sir Keir Starmer called for a ceasefire that lasts in Gaza - ahead of a vote in the Commons which risks re-opening Labour divisions on the issue."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68331448",
        "title": "Rwanda plan will deal with asylum claim loophole, government says",
        "description": "But new laws requiring their deportation only became effective from 20 July. It leaves the claims of more than 22,400 people in apparent legal limbo. Minister Michael Tomlinson said the Rwanda plan, which the Supreme Court ruled unlawful in November, will give the government a way to deal with the claims."
    },
    {
        "url": "https://www.lse.co.uk/news/uk-pm-rishi-sunak-defended-after-bruising-by-election-defeats-249f05hdkob0x3k.html",
        "title": "UK PM <b>Rishi Sunak</b> defended after bruising by-election defeats",
        "description": "(Alliance News) - A Conservative minister has defended <b>Rishi Sunak</b> and the party after two by-election defeats, saying they were set against a &quot;very difficult backdrop&quot;. The losses to Labour in Wellingborough and Kingswood, as well as increased support for ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/council-tax-bombshell-see-households-32153240",
        "title": "Council tax bombshell will see households hit by £523 extra on their bills",
        "description": "Figures buried in Office for Budget Responsibility documents suggest the amount raised from council tax is set to reach £57.4billion - double what is was under Labour"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24127124.keir-starmer-nearly-quit-hartlepool-by-election-loss/",
        "title": "Keir Starmer &#39;nearly quit&#39; after Hartlepool by-election loss",
        "description": "Sir Keir Starmer nearly resigning after the crushing defeat in the Hartlepool by-election in 2021, according to a new biography."
    },
    {
        "url": "https://www.scotsman.com/news/politics/post-office-henry-staunton-horizon-compenstion-stalled-claim-4522998",
        "title": "Government rejects Post Office chairman Henry Staunton claim Horizon compensation stalled ahead of election",
        "description": "Former Post Office chairman Henry Staunton alleged senior government official urged him to &#39;stall&#39; Horizon compensation payouts for political reasons"
    },
    {
        "url": "https://www.irishnews.com/news/uk/rishi-sunak-defended-after-by-election-defeats-set-against-difficult-backdrop-ZNVHJTT4LRKSRIY6CW7MMX4GDM/",
        "title": "<b>Rishi Sunak</b> defended after by-election defeats set against ‘difficult backdrop’",
        "description": "A Conservative minister has defended Rishi Sunak and the party after two by-election defeats, saying they were set against a “very difficult backdrop”. The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened Reform UK party, were the latest blow to the Prime Minister."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867951/rishi-sunak-brexit-eu-regulations-equalities?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "<b>Rishi Sunak</b> accused of squandering Brexit freedoms by introducing more EU rules",
        "description": "<b>Rishi Sunak</b> has been accused of squandering Brexit freedoms after quietly rewriting sweeping EU equality rules into UK law. The new regulations enshrine European Court of Justice (ECJ) rulings into domestic law. The judgements would have stopped applying ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/3ff6af62-c5f0-42d6-b180-d60960b31be7?shareToken=5308b06c7906c1bbf4ad0e64753e71fa",
        "title": "Post Office boss: I was told to stall compensation to help Tories",
        "description": "Pictured: the Post Office victims who died without justice The ITV drama Mr Bates vs The Post Office unleashed a tidal wave of public anger, prompting <b>Rishi Sunak</b> and Hollinrake to promise unprecedented legislation to overturn all convictions related to ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/events/nominations-open-for-spirit-of-ni-awards/a1441326987.html",
        "title": "Nominations open for Spirit of NI Awards",
        "description": "Presenting the award to Mr Caldwell via video-link, Prime Minister <b>Rishi Sunak</b> told him he represented “the true spirit of Northern Ireland”. The detective chief inspector was shot several times in a dissident republican attack in front of innocent ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/david-cameron-alexei-navalny-volodymyr-zelensky-foreign-secretary-russia-b1139842.html",
        "title": "UK weighs up response in wake of Navalny death",
        "description": "Prime Minister <b>Rishi Sunak</b> spoke to European Commission president Ursula von der Leyen on Sunday, with the death of Mr Navalny raised in the conversation alongside aid for Ukraine. A Downing Street spokeswoman said: “Ahead of the second anniversary of ..."
    },
    {
        "url": "https://news.stv.tv/politics/labour-still-considering-snp-motion-on-gaza-ceasefire-says-david-lammy",
        "title": "Labour still considering SNP motion on Gaza ceasefire, says Lammy",
        "description": "In an open letter to Labour MPs ahead of Wednesday’s vote, the SNP’s Westminster leader Stephen Flynn said: “For more than four months, the UK has followed the strategy of equivocation supported by <b>Rishi Sunak</b> and Sir Keir Starmer. The devastation ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-best-result-rishi-sunak-election-2909342?ico=more_from_this_author",
        "title": "Reform’s best-ever election result is not <b>Sunak</b>’s biggest concern",
        "description": "Reform UK secured its best ever by-election results on Friday, in a result that will give the Conservatives even more cause for concern ahead of the general election. The party scored double-digit vote shares to come third in both Wellingborough and ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-wiltshire-68274739.amp",
        "title": "Cornish patients visit NHS dentist in Wiltshire - 200 miles away",
        "description": "Prime Minister <b>Rishi Sunak</b> told BBC Spotlight last week getting appointments was &quot;too difficult&quot;. He added the government had a &quot;significant plan&quot; to ease the shortage of places. &quot;I wanted to come to the South West because I know it&#39;s been a challenge here ..."
    }
]