[
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24048135.david-cameron-hints-britain-strike-houthis-continue-attacking/",
        "title": "David Cameron hints Britain could strike again if Houthis continue attacking",
        "description": "Meanwhile, Sir Keir Starmer defended his support for the strikes, which <b>Rishi Sunak</b> ordered without first consulting Parliament, as Prime Ministers sometimes do before military interventions. RAF Typhoon FGR4 taking off to launch air strikes against ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/13/rishi-sunak-political-hero-tax-raising-labour-chancellor/",
        "title": "<b>Rishi Sunak</b> hid his admiration for an unlikely political hero - a tax-raising Labour chancellor",
        "description": "However, during Mr Sunak’s tenure as chancellor, the portrait raised eyebrows among some of his colleagues given that Gaitskell’s brief stint at the Treasury between 1950 and 1951 saw a tax-raising budget that would send shivers down the spines of today’s jittery Conservative MPs."
    },
    {
        "url": "https://www.bignewsnetwork.com/news/274094398/former-polish-pm-admits-ukraines-strategy-failed",
        "title": "Former Polish PM admits Ukraine&#39;s strategy failed",
        "description": "The conflict is going in the wrong direction Mateusz Morawiecki told the UKs Express newspaper Ukraines 2023 counteroffensive w"
    },
    {
        "url": "https://english.almayadeen.net/news/politics/biden--sunak-re-election--economic-recovery-hindered-by-red",
        "title": "Biden, <b>Sunak</b> re-election, economic recovery hindered by Red Sea crisis",
        "description": "There is now growing concern in government circles in London and Washington that Sunak and Biden&#39;s adventure in the Red Sea could hinder their re-election and any prospects for economic recovery."
    },
    {
        "url": "https://www.irishnews.com/news/uk/david-cameron-hints-britain-could-strike-again-if-houthis-continue-attacking-POSPZJAQXVIHZDNZ5RGKQRVTVM/",
        "title": "David Cameron hints Britain could strike again if Houthis continue attacking",
        "description": "Britain could strike Houthi targets in Yemen again if the rebel group continues to attack ships in the Red Sea, Foreign Secretary Lord David Cameron has suggested. Lord Cameron warned that the Iran-linked militants could force up prices in Britain if they are allowed to block the passage of container ships in the busy trade route."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12959205/Pension-black-hole-rocks-Horizon-firm-Fujitsu.html",
        "title": "Pension black hole rocks Horizon IT firm Fujitsu",
        "description": "Ministers have urged Fujitsu to repay taxpayers for the &#39;fortune&#39; the scandal has already cost the public purse. Prime Minister <b>Rishi Sunak</b> faces calls to bar it from securing government contracts. Fujitsu bought ICL in 1998 just before the Horizon system ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/post-office-belfast-solicitor-says-28438224",
        "title": "Post Office: Belfast solicitor says ITV drama has doubled clients hit by the scandal",
        "description": "&quot;Women were saying they went out and raided their kids piggy banks to try and find money to pay these shortfalls&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12960311/Rishi-Sunak-world-volatile-attacks-Red-Sea-war-Gaza-Ukraine-conflict.html",
        "title": "<b>Rishi Sunak</b> warns the world is facing the most volatile time in years with attacks in the Red Sea, war in Gaza and Ukraine conflict",
        "description": "The Prime Minister warned The Mail on Sunday that the world is facing its most volatile period for decades after the attacks in the Red Sea, the Gaza war and the conflict in Ukraine."
    },
    {
        "url": "https://www.thesun.co.uk/news/25353092/rishi-sunak-election-hopes-rwanda-vote/",
        "title": "<b>Rishi Sunak</b>’s election hopes rest on Rwanda vote this week &amp; Tories must rally together",
        "description": "Tory MPs need to rally over Rwanda RISHI Sunak’s election hopes are resting on a knife-edge vote this week. The PM knows his party’s future depends on steering the Rwanda legislation through the"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25352661/robert-jenrick-30m-cost-channel-boat-rwanda-bill-rebellion/",
        "title": "Every Channel boat crossing costs taxpayers around £30m Robert Jenrick warns – as he urges PM to toughen up Rwanda Bill",
        "description": "ROBERT Jenrick today warns every Channel boat crossing costs Brits about £30 million – as he launches a final appeal to the PM to toughen up his Rwanda Bill. He said the migration crisis has"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/13/rwanda-bill-must-be-strengthened-tory-spartans-warn-sunak/",
        "title": "Rwanda Bill must be strengthened or we’ll kill it off, Tory ‘Spartans’ warn <b>Sunak</b>",
        "description": "Writing for The Telegraph, Danny Kruger, Sir John Hayes and Mark Francois compare themselves to rebels who sank May’s Brexit deal"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1855442/grant-shapps-houthi-americans",
        "title": "Grant Shapps in firing line after one comment left Americans completely &#39;p***** off&#39;",
        "description": "Grant Shapps reportedly “p***** off” American diplomats with a remark he made in the lead-up to joint US and UK strikes on Houthi targets in Yemen."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-wife-line-bumper-31875676",
        "title": "<b>Rishi Sunak</b>&#39;s wife in line for bumper tax break after donating shares to charity",
        "description": "<b>Rishi Sunak</b>’s wife Akshata Murty is in line for a bumper tax break after donating her shares in a childcare firm to charity. Mrs Murty donated her stake in Koru Kids to charity after her involvement became an &quot;unfair distraction&quot; for the charity ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nhs-nurses-could-launch-more-31875836",
        "title": "NHS nurses could launch more strikes as <b>Rishi Sunak</b> has &#39;lost touch with reality&#39;",
        "description": "Pat Cullen, General Secretary of the Royal College of Nursing warned the Prime Minister: &quot;Every option – including strike action – is on the table.&quot;"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-post-office-horizon-computer-28428537",
        "title": "How the Post Office Horizon computer system destroyed lives and became &#39;one of the greatest miscarriages of justice in history&#39;",
        "description": "The Post Office Scandal has been thrust to the forefront of the news agenda by ITV drama Mr Bates vs the Post Office - here&#39;s everything you need to know"
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/13/red-sea-crisis-could-shatter-hopes-of-economic-recovery?ref=biztoc.com",
        "title": "Red Sea crisis could shatter hopes of global economic recovery",
        "description": "World Bank warns of surging energy prices, slower growth and higher inflation as threat rises of disruption to world trade"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-accused-of-trying-to-take-glory-with-new-post-office-law-12593360?postid=7050851",
        "title": "Politics latest: <b>Sunak</b> and Zelenskyy sign security deal; &#39;biggest attack on UK navy in decades&#39; one reason for Yemen strikes - PM",
        "description": "Mr Jackson replied that they are &quot;keeping it under test&quot;. Pledge tracker: Is <b>Sunak</b> keeping his promises? One year ago, <b>Rishi Sunak</b> made five pledges for voters to judge him on. The prime minister met his pledge to halve inflation by the end of 2023 ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1855409/tory-rebels-rishi-sunak-rwanda",
        "title": "Tory rebels warned &#39;back <b>Rishi</b> over Rwanda&#39; as fears of election wipeout mount",
        "description": "Threats to derail Rishi Sunak&#39;s Rwanda plan should be ditched in this vital election year, says an angry senior Tory."
    },
    {
        "url": "https://www.thetimes.co.uk/article/us-uk-strikes-yemen-relationship-election-year-25qx7rvz0?ilc=timesradio:morefromthetimes",
        "title": "<b>Rishi Sunak</b> stops dithering to become Joe Biden’s man of action",
        "description": "The PM is positioning himself as a serious global leader but with elections looming for both him and President Biden, problems continue to pile up"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/13/us-uk-houthi-yemen-airstrikes-may-have-begun-unwinnable-war",
        "title": "The Observer view on Yemen: airstrikes may have begun an unwinnable war",
        "description": "By their military intervention, Rishi Sunak and Joe Biden have started something they may not be able to finish"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12959671/war-inside-Rishi-Sunak-airstrikes-Yemen-Houthi-rebels-trip-Ukraine.html",
        "title": "The inside story of how <b>Rishi Sunak</b> made the call on airstrikes in Yemen on Houthi rebels during a trip to Ukraine",
        "description": "When the RAF &#39;s bombs started falling on Houthi rebel positions in the early hours of Friday morning, the Prime Minister was preparing for bed in a blacked-out train in Ukraine."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/c2eym6qm6ejo.amp",
        "title": "Horizon scandal victim says Post Office &#39;must pay&#39;",
        "description": "The husband of a sub-postmistress who was wrongly convicted and jailed while pregnant has said those responsible for the Horizon scandal &quot;must pay&quot; for the &quot;dreams they took away from us&quot;. Seema Misra,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/starmer-yemen-bombing-iran-britain-b2478179.html",
        "title": "Keir Starmer backs Yemen bombing and issues stern warning to ’terror sponsors’ Iran",
        "description": "Exclusive: In an article for The Independent, the Labour leader doubles down on support for UK and US action and demands Iran-backed rebels stop Red Sea attacks -as new missile strike turns up heat in"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-must-now-compensate-154457433.html",
        "title": "<b>Rishi Sunak</b> must now compensate infected blood scandal victims, politicians demand",
        "description": "After the prime minister acted to help hundreds of postmasters wrongly-prosecuted by the Post Office, he has been told to roll out compensation to victims of the infected blood scandal"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67843756?at_medium=RSS&at_campaign=KARANGA",
        "title": "Kuenssberg: The thorny politics of Houthi strikes for <b>Sunak</b> and Starmer",
        "description": "The military action is instinctively trickier territory for Labour leader Sir Keir Starmer. Sir Keir Starmer says Labour backs the western military operation against Houthi rebels in the Red Sea. Labour nerves still jangle over what went so terribly wrong in Iraq, even after all these years."
    },
    {
        "url": "https://uk.news.yahoo.com/suella-braverman-attacks-rishi-sunak-122858499.html",
        "title": "Suella Braverman attacks <b>Rishi Sunak</b> for relying on ‘bad weather’ to stop small boat crossings",
        "description": "The former home secretary lashed out at the PM after Britain saw its first arrivals cross the channel this year"
    },
    {
        "url": "https://news.sky.com/story/migrants-cross-english-channel-to-uk-for-first-time-in-2024-13047293",
        "title": "Migrants cross English Channel to UK for first time in 2024",
        "description": "Migrants crossing the English Channel to the UK have been reported for the first time in 2024. Arrivals had not been recorded since 16 December, according to Home Office figures, with poor weather conditions potentially contributing to the lack of activity at sea. It means there had been 27 days of no crossings until today."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-zelensky-kyiv-sunak-latest-b2478050.html?page=5",
        "title": "Russia-Ukraine war - live: Moscow launches hypersonic missile attack as UK pledges to send more drones",
        "description": "The renewed funding will help Ukraine purchase new military drones including surveillance, long-range and sea drones"
    },
    {
        "url": "https://metro.co.uk/2024/01/13/xl-bully-owner-punched-vet-sick-dog-died-jailed-20108941/?ico=metro-posts_home_whats-trending-now",
        "title": "XL Bully owner who punched vet after sick dog died is jailed",
        "description": "Prime Minister <b>Rishi Sunak</b> announcedin September, XL Bully dogs would be banned in England and Wales by the beginning of this year, following a spate of serious attacks on people and other dogs. It became illegal to sell, advertise, rehome or breed XL ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-bill-house-of-lords-2852155?ico=more_from_this_author",
        "title": "<b>Rishi Sunak</b>’s Rwanda plan faces ‘mauling’ in the Lords, Tory peer warns",
        "description": "Flagship laws to save the Rwanda deportation deal face a “mauling” in the House of Lords which will only get worse if <b>Rishi Sunak</b> offers concessions to right-wingers, peers have warned. Former immigration minister Lord Kirkhope told i peers were likely ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/13/mps-like-betrayed-rishi-yemen-vote-20107245/?ico=just-in_tag_must-read",
        "title": "MPs like me have been betrayed by <b>Rishi</b> on Yemen – where was our vote?",
        "description": "<b>Rishi Sunak</b> (left) risks destabilising the region even further (Picture: EFP/Getty) This week the government made the decision to embark on military action, without so much as informing Parliament. As the UK joined the US in striking targets connected to ..."
    },
    {
        "url": "https://leftfootforward.org/2024/01/nhs-waiting-lists-increase-by-400000-after-rishi-sunaks-pledge-to-bring-them-down/",
        "title": "NHS waiting lists increase by 400,000 after <b>Rishi Sunak</b>’s pledge to bring them down",
        "description": "Patients, staff and the public deserve better.” <b>Rishi Sunak</b> has broken yet another pledge, after new data this morning revealed that NHS waiting lists have soared by 400,000, a year after the Prime Minister pledged to bring them down as one of his five ..."
    },
    {
        "url": "https://inews.co.uk/opinion/the-vinted-tax-just-start-2843039?ico=most_read_by_subscribers",
        "title": "The Vinted tax is just the start",
        "description": "The “side hustle tax” is the first snowflake in that avalanche. Most immediately, it means that <b>Rishi Sunak</b>’s government has started an election year by signalling to quite a lot of entrepreneurial people that it wants a slice from their handy extra ..."
    }
]