[
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/15/rishi-sunak-accused-of-using-islamophobic-trope-in-the-commons/",
        "title": "<b>Rishi Sunak</b> accused of using ‘Islamophobic trope’ in the Commons",
        "description": "Rishi Sunak has been accused of using an “Islamophobic trope” after he asked Labour’s Zarah Sultana to “call on Hamas and the Houthis to de-escalate the situation”. Labour MP Naz Shah said it was a “painful blow” by the Prime Minister and called on him to apologise."
    },
    {
        "url": "https://www.thenational.scot/news/24051145.rishi-sunak-faces-commons-grilling-yemen-airstrikes/",
        "title": "<b>Rishi Sunak</b> faces Commons grilling on Yemen airstrikes",
        "description": "RISHI Sunak defended failing to consult the Commons before launching airstrikes on Houthi rebels in Yemen as he faced MPs for the first time"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-accused-using-islamophobic-184658797.html",
        "title": "<b>Rishi Sunak</b> accused of using ‘Islamophobic trope’ against Labour MP",
        "description": "Rishi Sunak has been accused of using an ‘Islamophobic trope’ after he asked Labour ’s Zarah Sultana to “call on Hamas and the Houthis to de-escalate the situation”. Labour MP Naz Shah said it was a “painful blow” by the Prime Minister and called on him to apologise."
    },
    {
        "url": "https://www.techradar.com/pro/hundreds-of-ads-featuring-a-deep-faked-rishi-sunak-went-up-on-facebook-and-its-only-going-to-get-worse",
        "title": "Hundreds of ads featuring a deep faked <b>Rishi Sunak</b> went up on Facebook - and it&#39;s only going to get worse",
        "description": "The research found that 143 different adverts using Rishi Sunaks deep fake likeness were shown to over 400,000 people on Facebook. Luckily, of this 400,000, the adverts were shown to “less than 0.5 percent of UK users”, according to a spokesperson speaking to The Guardian."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-face-uk-lawmakers-131411755.html",
        "title": "<b>Rishi Sunak</b> will face UK lawmakers over his decision to join US strikes on Yemen&#39;s Houthis",
        "description": "Prime Minister Rishi Sunak was due to face Parliament Monday to explain why the U.K. joined the U.S. in striking Houthi targets in Yemen — and why British lawmakers did not get a say on the military action."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-robert-jenrick-rwanda-government-kemi-badenoch-b1132521.html",
        "title": "<b>Sunak</b> suffers blow as two Tory deputy chairmen vow to rebel over Rwanda Bill",
        "description": "The Prime Minister is preparing to face down a rebellion of more than 60 right-wingers who want the Bill toughened up. <b>Rishi Sunak</b> has suffered a major blow ahead of a Commons showdown over his flagship Rwanda Bill as two Conservative deputy chairmen said ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/largest-uk-deployment-nato-since-cold-war-announced-1722743",
        "title": "The Largest UK Deployment To NATO Since the Cold War Announced",
        "description": "Defence Secretary Grant Shapps announces the largest UK deployment to NATO since the Cold War which adds 2000 sailors, 400 royal marines, and 16000 British troops to the NATO forces."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/houthi-missile-hit-container-red-31889027",
        "title": "&#39;Houthi missile that hit US container in the Red Sea explosive proof conflict not over&#39;",
        "description": "The danger of escalation across the region, and Hamas-backing Houthi leaders citing the Israeli slaughter of Palestinians in Gaza for their own attacks, is a genuine concern"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12966741/Rishi-Sunak-European-judges-Rwanda-Tory-vice-chairmen-revolt-migrants-bill.html",
        "title": "<b>Rishi Sunak</b> vows to defy European judges on Rwanda flights as two Tory vice-chairmen join the revolt over the migrants bill",
        "description": "The Prime Minister, who faces a rebellion by dozens of Tory MPs today, said he was determined to end the &#39;legal merry-go-round&#39; that has prevented any migrants being sent to the east African state."
    },
    {
        "url": "https://www.thesun.co.uk/news/25372068/grant-shapps-grow-army-ww3-threat/",
        "title": "Britain has no plans to grow the Army despite World War Three threat, says Grant Shapps",
        "description": "BRITAIN is facing wars in Russia, China, Iran and North Korea in five years but there are still no plans to grow the Army, Grant Shapps said today. The world is now in a ­“pre-war” phase, ahead of"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12966673/QUENTIN-LETTS-martial-patriotism-emotion-north-London-socialist-Keir-Starmer.html",
        "title": "QUENTIN LETTS: Why martial patriotism is just an alien emotion to north London socialist Keir Starmer",
        "description": "There is a sound the Conservative benches make when our armed forces are in action. It is quite low - baritone, not basso profundo - and something between a grunt and a growl."
    },
    {
        "url": "https://www.politicshome.com/news/article/defence-secretary-grant-shapps-says-world-dangerous",
        "title": "<b>Rishi Sunak</b> Says UK Strikes Against Houthis Were Self Defence",
        "description": "Prime Minister Rishi Sunak urged people to not &#39;fall for the malign narrative&#39; that the UK strikes on the Houthis in Yemen were concerning the"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-rwanda-bill-commons-lee-anderson-rebellion-tory-b1132516.html",
        "title": "<b>Sunak</b> faces mounting pressure from Tory right over Rwanda bill as deputy party chairmen join rebellion",
        "description": "Lee Anderson and Brendan Clarke-Smith have signalled they will defy the PM to vote for amendments to harden controversial bill which returns to Commons on Tuesday"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/14/jeremy-hunt-cabinet-mps-lose-seats-general-election-tories/",
        "title": "Jeremy Hunt among 14 Tory big beasts on course to lose their seats",
        "description": "Eleven of Cabinet set to go as more than half the Conservative seats won in 2019 could be lost, according to YouGov poll"
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-rwanda-bill-migrants-appeals-judges-rswgspmd0",
        "title": "<b>Sunak</b> to draft 150 judges to fast-track Rwanda migrant appeals",
        "description": "The judges will be recruited from the first-tier tribunal, given additional training and paid more to work on evenings or weekends"
    },
    {
        "url": "https://news.sky.com/story/beth-rigby-pm-might-win-this-rwanda-battle-but-has-he-already-lost-the-war-13049183",
        "title": "Beth Rigby: PM might win this Rwanda battle, but has he already lost the war?",
        "description": "The prime minister&#39;s best hope is that steady progress - on the boats, the economy, NHS waiting lists - can slowly turn the tide. But his prospects don&#39;t look good."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h55n69",
        "title": "Race for the Whitehouse, a Don Deal for Trump?",
        "description": "Adam is wished a ‘happy caucus day’ by Mick Mulvaney, former White House Chief of Staff to Donald Trump, who tells us why the former president wants to run again. And there’s a special report from Iowa with Americast’s Justin Webb and Marianna Spring."
    },
    {
        "url": "https://www.ibtimes.co.uk/banking-watchdog-issues-ai-warning-world-leaders-gather-davos-1722738",
        "title": "Banking Watchdog Issues AI Warning As World Leaders Gather In Davos",
        "description": "Although the conference in Davos maintains a focus on the economy, AI is likely to play a big role in the discussions."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/15/tories-lose-more-than-half-2019-support-poll/",
        "title": "Tories have lost more than half of their 2019 support, poll suggests",
        "description": "Only 38 pc of the 13.9m people who backed Conservatives when Boris Johnson was leader will definitely vote for them again"
    },
    {
        "url": "https://news.sky.com/story/lee-anderson-says-he-will-back-rebels-changes-to-rwanda-bill-13049147",
        "title": "Lee Anderson says he will back rebels&#39; changes to Rwanda bill",
        "description": "The move could mean Mr Anderson, deputy chair of the Tory party, is forced to resign or could be sacked by the prime minister."
    },
    {
        "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-01-15-24/h_67387d963daf09df135a19f90835e6bd",
        "title": "The latest on Israel&#39;s war in Gaza",
        "description": "Israel&#39;s Prime Minister Benjamin Netanyahu said &quot;nobody will stop us&quot; from destroying Hamas as the war in Gaza passed the 100-day mark. Follow live updates."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856047/rishi-sunak-48-hours-save-job-pm-comment",
        "title": "<b>Rishi Sunak</b> has 48 hours to save his job as Prime Minister with Rwanda Bill rebellion",
        "description": "ANALYSIS: Rishi Sunak thought he had seen off the threat in December when he won the first Rwanda Bill vote but now he is in more danger than ever before."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/prime-minister-robert-jenrick-rwanda-government-conservative-mps-b2479094.html",
        "title": "<b>Sunak</b> suffers blow as two Tory deputy chairmen vow to rebel over Rwanda Bill",
        "description": "The Prime Minister is preparing to face down a rebellion of more than 60 right-wingers who want the Bill toughened up."
    },
    {
        "url": "https://www.thetimes.co.uk/article/what-yougov-poll-means-tories-general-election-2024-xnhcfqdz8",
        "title": "What the latest poll means for Tory chances in general election",
        "description": "YouGov’s seat-by-seat survey of 14,000 would-be voters makes difficult reading for Rishi Sunak’s Conservative party"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24051617.tory-mps-told-ignore-dire-polling-amid-warnings-election-wipeout/",
        "title": "Tory MPs told to ignore dire polling amid warnings of election wipeout",
        "description": "Tory MPs have been told by the party’s elections guru to ignore dire polling aimed at “undermining this Government” and warned that “divided parties fail”."
    }
]