[
    {
        "url": "https://uk.news.yahoo.com/two-arrested-red-paint-thrown-145650507.html",
        "title": "Two arrested as red paint thrown at Downing Street gates – as <b>Sunak</b> exits No 10 out of back door",
        "description": "Two people have been arrested on suspicion of criminal damage after red paint was thrown over the front gates outside Downing Street. The arrests are understood to have followed a protest in London calling for a ceasefire in the conflict between Israel and Hamas."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/xl-bully-seen-status-symbol-28362833",
        "title": "XL bully seen as a &#39;status symbol&#39; as police to clamp down on illegal breeding",
        "description": "Merseyside Police urged XL bully owners to register their dogs before the breed is banned under the Dangerous Dogs Act next year"
    },
    {
        "url": "https://inews.co.uk/news/politics/10000-well-patients-stuck-hospital-christmas-day-lack-nhs-care-2829244?ico=related_article_inline",
        "title": "10,000 healthy patients stuck in hospital on Christmas Day due to lack of NHS care",
        "description": "Wes Streeting, the shadow Health Secretary, claimed the Tories were &#39;the grinches who literally stole Christmas from these people&#39;"
    },
    {
        "url": "https://www.gg2.net/british-indian-doctors-indie-band-gains-popularity/",
        "title": "British Indian doctor’s Indie band gains popularity",
        "description": "A British Indian doctor with the NHS decided to get musical during the Covid-19 pandemic lockdown, but what started as a one-man bedroom project has been"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/xl-bully-dogs-being-abandoned-31766747.amp",
        "title": "XL Bully dogs being abandoned or &#39;left on death row&#39; in animal homes as breed ban looms",
        "description": "Under Prime Minister <b>Rishi Sunak</b>&#39;s plans, people who want to keep their pets until the end of January will need to list them with the exemption scheme. Alternatively, they can have their dog euthanised and apply for compensation. Owners must adhere to ..."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/national/24017757.yousaf-isle-mull-migrants-plan-divisive-disparaging-scotland/",
        "title": "Yousaf: Isle of Mull migrants plan was ‘divisive’ and ‘disparaging’ to Scotland",
        "description": "The First Minister has responded to records revealing plans mooted by aides to former prime minister Tony Blair in 2002."
    },
    {
        "url": "https://leftfootforward.org/2023/12/rishi-sunaks-rating-among-tory-members-reaches-its-lowest-point-ever/",
        "title": "<b>Rishi Sunak</b>’s rating among Tory members reaches its lowest point ever",
        "description": "Kemi Badenoch had the highest net rating among the Tory grassroots at +63.9, with Johnny Mercer and Penny Mordaunt in joint second place with 47.5. At bottom place is Michael Tomlinson, the minister for countering illegal migration, who has only been in the role since December 7."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/rishi-sunak-ratings-among-conservative-members_uk_658e866ee4b0cd3cf0e4fdbb/",
        "title": "<b>Rishi Sunak</b>&#39;s Ratings Among Tory Members Just Reached A New Low",
        "description": "<b>Rishi Sunak</b>’s net ratings among Conservative Party members reached its lowest point ever, according to a new survey. In ConservativeHome’s monthly league table assessing the popularity of each cabinet member, the prime minister secured a sorry second ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12909361/Rishi-Sunak-Tory-activists-Cabinet-poll-Kemi-Badenoch.html",
        "title": "<b>Rishi Sunak</b>&#39;s popularity with Tory activists hits record low as Cabinet suffers backlash - with Kemi Badenoch the darling of the grass roots",
        "description": "Rishi Sunak was given an unwanted New Year message today as a survey showed his popularity with Tory activists plumbing record lows. The PM had a dire net rating of minus 26.5 in the closely-watched ConservativeHome Cabinet rankings."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1850106/best-tory-prime-minister-boris-johnson-margaret-thatcher",
        "title": "Boris Johnson is beaten by two huge names in poll on your favourite Tory Prime Minister",
        "description": "<b>Rishi Sunak</b>, Liz Truss, Theresa May, Lord Cameron and Sir Edward Health were all on one per cent. A further two per cent of voters said they did not know. The poll is still open and you can vote below or by clicking here"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/humza-yousaf-tony-blair-scotland-labour-first-minister-b1129500.html",
        "title": "Yousaf: Isle of Mull migrants plan was ‘divisive’ and ‘disparaging’ to Scotland",
        "description": "The First Minister has responded to records revealing plans mooted by aides to former prime minister Tony Blair in 2002."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-says-isle-mull-31769000",
        "title": "Humza Yousaf says Isle of Mull migrants plan was ‘divisive’ and ‘disparaging’ to Scotland",
        "description": "Humza Yousaf has condemned plans considered by Tony Blair ’s former Labour government to hold refugees on a Scottish island as “disparaging and divisive”. The First Minister reacted to the proposals, released in files by the National Archives in London, first mooted by the former prime minister’s aides more than two decades ago."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/russia-releases-suspected-largest-attack-on-ukraine-yet-vladimir-putin_uk_658ea147e4b0b01d3e3f86ac",
        "title": "Russia Released Suspected Largest Attack On Ukraine Yet After Warship Strike Left Putin &#39;Furious&#39;",
        "description": "PM <b>Rishi Sunak</b> responded to Zelenskyy’s post, saying the “widespread attacks on Ukraine’s cities show Putin will stop at nothing to achieve his aim of eradicating freedom and democracy”. <b>Sunak</b> added: “We will not let him win. We must continue to ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1850082/rishi-sunak-vladimir-putin-russia-attack-ukraine",
        "title": "<b>Rishi Sunak</b> sends Russia blunt warning after Putin&#39;s latest merciless barrage on Ukraine",
        "description": "Ukraine must be given &quot;what it needs to win, not just survive&quot;, said Alicia Kearns, chairwoman of Parliament&#39;s Foreign Affairs committee."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/downing-street-gates-arrest-red-paint-b2470901.html",
        "title": "Two arrested as red paint thrown at Downing Street gates – as <b>Sunak</b> exits No 10 out of back door",
        "description": "Two people have been arrested on suspicion of criminal damage after red paint was thrown over the front gates outside Downing Street. The arrests are understood to have followed a protest in London calling for a ceasefire in the conflict between Israel and Hamas."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11719925/nicola-sturgeon-snp-year-scottish-politics/",
        "title": "Nicola Sturgeon’s arrest, the iPad scandal &amp; failed gender bill – A look back at a shock year in Scottish Politics",
        "description": "AS 2023 began, Nicola Sturgeon was still First Minister and while the SNP were sliding in the polls, they were still on top. The 12 months that have followed saw the resignation of the dominant"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-condemns-putin-after-biggest-aerial-barrage-against-ukraine-106958/",
        "title": "<b>Sunak</b> condemns Putin after ‘biggest aerial barrage’ against Ukraine",
        "description": "Rishi Sunak joined international condemnation of Vladimir Putin, after Russia launched a massive aerial barrage against Ukraine. Russia launched 122 missiles and 36 drones against Ukrainian targets, killing at least 13 civilians in what military officials said was the biggest aerial barrage of the war so far."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-labour-sue-gray-john-glen-civil-service-b1129451.html",
        "title": "Starmer wants to tackle civil service ‘churn’ – report",
        "description": "Sir Keir Starmer will seek to bring stability among senior civil servants if Labour wins the next general election, according to reports."
    }
]