[
    {
        "url": "https://www.newsletter.co.uk/news/politics/key-report-the-uk-should-increase-its-naval-and-air-presence-in-northern-ireland-and-reclaim-its-strategic-interest-in-the-province-4504747",
        "title": "Key report: The UK should increase its naval and air presence in Northern Ireland and reclaim its strategic interest in the province",
        "description": "The UK should increase its naval and air presence in Northern Ireland to reclaim its strategic interest in Northern Ireland, a Westminster think-tank says today."
    },
    {
        "url": "https://bmmagazine.co.uk/news/uk-government-contemplating-reversal-of-boiler-tax-amidst-price-surge/",
        "title": "UK government contemplating reversal of “Boiler Tax” amidst price surge",
        "description": "In a potential shift in the UK&#39;s clean energy landscape, the government is considering scrapping the controversial &quot;boiler tax&quot; following manufacturers&#39; price hikes on new gas boilers."
    },
    {
        "url": "https://bmmagazine.co.uk/news/jeremy-hunt-orders-review-to-end-tourist-tax-costing-retailers-11m/",
        "title": "Jeremy Hunt orders review ‘to end tourist tax’ costing retailers £11M",
        "description": "Jeremy Hunt has ordered a review into the controversial &quot;tourist tax,&quot; signalling a potential policy shift by the Treasury that could benefit the UK&#39;s retail and leisure sectors."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/grammys-2024-red-carpet-the-best-celebrity-outfits/",
        "title": "Grammys 2024 red carpet: The best celebrity outfits",
        "description": "Women are dominating the 66th annual Grammys, with the star-studded ceremony set to reveal the successful stars."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/rishi-sunak-uk-government-stormont-prime-minister-government-b1136981.html",
        "title": "New Executive calls for urgent discussions on funding for public services",
        "description": "Northern Ireland’s newly formed Executive has written to Prime Minister Rishi Sunak calling for urgent discussions on long-term funding stability to deliver public services."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-kings-equerry-was-he-just-too-hot-sbws8bctj",
        "title": "The King’s equerry. Was he just too hot?",
        "description": "The sight of Lieutenant Colonel Jonathan Thompson in his kilt will no longer be a public distraction. The King’s new right-hand man is a woman: Captain Kat Anderson"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68199790?at_medium=RSS&at_campaign=KARANGA",
        "title": "<b>Rishi Sunak</b> hails &#39;special opportunity&#39; as he starts Northern Ireland visit",
        "description": "Prime Minister Rishi Sunak has arrived in Northern Ireland for a visit to mark the return of power-sharing government. He is due to attend Stormont on Monday to meet ministers, including First Minister Michelle O&#39;Neill and Deputy First Minister Emma Little-Pengelly. Mr Sunak will also make a number of community engagements."
    },
    {
        "url": "https://www.thesun.co.uk/health/25715572/rishi-sunak-piers-morgan-nhs-crisis/",
        "title": "<b>Rishi Sunak</b> admits failing to cut NHS waiting lists and blames striking doctors in exclusive Piers Morgan interview",
        "description": "RISHI Sunak has admitted the Government have failed on their pledge to get NHS waiting lists down – but sought to blame strikers for making it worse. Confronted by Piers Morgan, the PM"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/04/rishi-sunak-heads-to-northern-ireland-to-meet-new-power-sharing-executive?ref=mc.news",
        "title": "<b>Rishi Sunak</b> visits Northern Ireland to meet new power-sharing executive",
        "description": "PM hails ‘fantastic cause for optimism’ as he seeks to put his stamp on success of Stormont reconvening"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68199790?at_campaign=KARANGA&at_medium=RSS",
        "title": "<b>Rishi Sunak</b> begins Northern Ireland visit marking power-sharing&#39;s return",
        "description": "Prime Minister Rishi Sunak has arrived in Northern Ireland for a visit to mark the return of power-sharing government. He is due to attend Stormont on Monday to meet ministers, including First Minister Michelle O&#39;Neill and Deputy First Minister Emma Little-Pengelly. Mr Sunak will also make a number of community engagements."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13044033/Rishi-Sunak-heads-Northern-Ireland-TONIGHT-talks-new-Sinn-Fein-Minister-DUP-deputy-powersharing-finally-restored.html",
        "title": "<b>Rishi Sunak</b> heads for Northern Ireland TONIGHT for talks with new Sinn Fein First Minister and DUP deputy after powersharing was finally restored",
        "description": "Rishi Sunak is heading for Northern Ireland tonight after powersharing was finally restored. The PM will travel to Belfast after Stormont resumed work in the wake of the deal struck with the DUP. He is expected to meet public service workers this evening before talks with leading politicians tomorrow."
    },
    {
        "url": "https://morningstaronline.co.uk/article/new-coin-celebrating-200-years-rnli-should-focus-minds",
        "title": "New coin celebrating 200 years of RNLI should focus minds on refugees&#39; plight, says anti-racist leader",
        "description": "A 50P coin celebrating the 200th anniversary of the Royal National Lifeboat Institution (RNLI) should prompt reflection on the human cost of Britain’s anti-refugee hysteria, a leading anti-racist said yesterday."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68200997",
        "title": "Chris Mason: NI power-sharing affords <b>Rishi Sunak</b> chance for a victory lap",
        "description": "BBC political editor Chris Mason looks ahead to Rishi Sunak&#39;s trip to Belfast as Northern Ireland&#39;s executive returns."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/warning-over-ireland-threat-uk-as-sunak-visits-ulster/",
        "title": "Warning over Ireland’s threat to UK as <b>Sunak</b> visit Ulster",
        "description": "Ireland would be “no friend” to the UK under Sinn Fein, a report backed by two former defence secretaries warned as Rishi Sunak visited Northern Ireland to mark the restoration of power to Stormont."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/we-now-have-the-opportunity-means-and-responsibility-to-deliver-a-better-future-for-all-the-people-of-ni/a1111393149.html",
        "title": "‘We now have the opportunity, means and responsibility to deliver a better future for all the people of NI’",
        "description": "Yes, the challenges ahead are significant. But with the Assembly and Executive back up and running, with new powers and more funding, we now have the opportunity, the means and the responsibility to deliver that vision of a better future for all the people of Northern Ireland. The time for talking is over. Now it’s time for the real work to begin."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/04/houthis-vow-more-red-sea-attacks-after-third-wave-of-us-uk-strikes-on-yemen?ref=themilsource.com",
        "title": "US says strikes on Iran-linked militias just ‘the beginning’ of its response",
        "description": "National security adviser refuses to rule out targeting Iran after 85 sites were attacked in Iraq and Syria"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13044713/MARK-ALMOND-Attacks-weakness-West.html",
        "title": "MARK ALMOND: Attacks a test for weakness in the West&#39;s defences and we&#39;ve failed it",
        "description": "The Iranian-backed drone attack on US army outpost Tower 22 has echoes of long forgotten colonial conflicts which helped to lay the gunpowder trail to World War I."
    },
    {
        "url": "https://www.lbc.co.uk/news/labour-apprenticeships-week-tories/",
        "title": "Labour slam Tories for &quot;stealing opportunities&quot; on apprenticeships as enrolments down a quarter",
        "description": "At a PM Connect event in June, an attendee told Prime Minister <b>Rishi Sunak</b> that their firm, which they said had around 335 people signed up to apprenticeships, was only able to utilise around 54% of its levy. Picture: Getty Ms Phillipson said: &quot;Labour will ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/long-waits-to-see-doctors-creating-mental-health-epidemic-lib-dems-say-7ZDW2MX5LBPDTB4NVEPS6EVG2Q/",
        "title": "Long waits to see doctors ‘creating mental health epidemic’, Lib Dems say",
        "description": "However, analysis by the PA news agency found that waiting lists were still higher than when Prime Minister <b>Rishi Sunak</b> pledged it would fall. Mr <b>Sunak</b> made cutting waiting lists one of his top priorities at the start of 2023 when lists stood at 7.21 million."
    },
    {
        "url": "https://inews.co.uk/news/rishi-sunak-says-houthi-red-sea-attacks-is-having-economic-consequences-2889724?ITO=msn",
        "title": "<b>Rishi Sunak</b> says Houthi Red Sea attacks is having ‘economic consequences’",
        "description": "<b>Rishi Sunak</b> said the Houthis’ “illegal” harassment campaign in the Red Sea is having “economic consequences”, as he defended the UK taking part in a third wave of air strikes. There have been fears that the attacks on commercial ships in the ..."
    },
    {
        "url": "https://www.ft.com/content/25176b46-d875-4ac4-a819-f4db1db567f0?sharetype=gift",
        "title": "<b>Sunak</b> to drop heat pump targets in fresh retreat from Net Zero",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. <b>Rishi Sunak</b> is poised to drop plans to fine boiler makers who fail to meet strict production targets for heat pumps in the UK prime minister’s latest retreat from ..."
    },
    {
        "url": "https://www.retailgazette.co.uk/blog/2024/02/tourist-tax-review/",
        "title": "Tourist tax: Jeremy Hunt orders review ahead of the Budget",
        "description": "Hunt has asked the OBR to “examine the costs and benefits” of the scheme, which <b>Rishi Sunak</b> decided to end in 2020. The results of the review are set to be unveiled alongside next month’s Budget, The Sunday Times reports. Retail leaders have blasted ..."
    }
]