[
    {
        "url": "https://news.sky.com/story/rwanda-vote-is-a-win-for-sunak-but-it-has-come-at-a-cost-13050555",
        "title": "Rwanda vote is a win for <b>Sunak</b>, but it has come at a cost",
        "description": "Even as they prepared to walk through the voting lobbies with <b>Rishi Sunak</b>, there was talk about being angry and disappointed in how the government had handled the rebels, but sources in the room tell me that the majority of potential rebels in the end ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/peers-urged-to-get-on-and-pass-rwanda-bill-after-tory-rebellion-fizzles-out-HI6SH2ERPBI7LPS6XNGZ676XEU/",
        "title": "Peers urged to ‘get on’ and pass Rwanda Bill after Tory rebellion fizzles out",
        "description": "Peers are being urged to “get on” and pass the Rwanda Bill after <b>Rishi Sunak</b> saw off the prospect of a defeat at the hands of right-wing Conservative MPs. The Safety of Rwanda Bill passed its third reading in the Commons unamended with a majority of 44 ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856939/tory-wimps-rishi-sunak-rwanda-comment",
        "title": "How <b>Rishi Sunak</b> beat the Tory right with Priti Patel&#39;s deal, Starmer&#39;s PMQs and MP &#39;wimps&#39;",
        "description": "ANALYSIS: Rishi Sunak has won a major victory and defeated the right of his party meaning he now will almost certainly lead the Tories into the next election."
    },
    {
        "url": "https://www.thenational.scot/news/24055740.rishi-sunak-told-off-speaker-prop-stunt-pmqs/",
        "title": "<b>Rishi Sunak</b> told off by Speaker after prop stunt at PMQs",
        "description": "RISHI Sunak was admonished by the Speaker at Prime Minister’s Questions after brandishing a book Keir Starmer had written on human rights."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-rishi-sunak-little-left-162041016.html",
        "title": "OPINION - <b>Rishi Sunak</b> has little left to offer demoralised Tory MPs",
        "description": "But when that power slips away, participants often conclude that unity is no longer worth the hassle. Case in point: earlier week, <b>Rishi Sunak</b>&#39;s campaign director Isaac Levido addressed Conservative MPs, during which he urged them to unify and direct their ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sit-down-speaker-tells-off-124303499.html",
        "title": "&#39;Sit down&#39;: Speaker tells off <b>Rishi Sunak</b> after prop stunt at PMQs",
        "description": "RISHI Sunak was admonished by the Speaker at Prime Minister’s Questions after brandishing a book Keir Starmer had written on human rights."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/article-12976535/Jeremy-Hunt-bang-drum-investment-UK-World-Economic-Forum-Davos.html",
        "title": "Jeremy Hunt will &#39;bang the drum&#39; for investment in the UK at the World Economic Forum in Davos",
        "description": "The Chancellor is arriving at the annual meeting of the World Economic Forum in the wake of his Labour rival Rachel Reeves, who has been on a charm offensive."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-downing-street-rwanda-house-of-lords-suella-braverman-b1133116.html",
        "title": "Peers urged to ‘get on’ and pass Rwanda Bill after Tory rebellion fizzles out",
        "description": "No 10 described the passing of <b>Rishi Sunak</b>’s Rwanda Bill as a ‘major step’ towards stopping the boats (UK Parliament/Jessica Taylor/PA) The Safety of Rwanda Bill passed its third reading in the Commons unamended with a majority of 44 after only 11 ..."
    },
    {
        "url": "https://uk.news.yahoo.com/lee-anderson-dropped-rwanda-bill-003035714.html",
        "title": "Lee Anderson Dropped Rwanda Bill Rebellion As Labour MPs Were &#39;Giggling And Taking The Mick&#39;",
        "description": "Lee Anderson has revealed he did not follow through with his revolt against <b>Rishi Sunak</b> and his Rwanda asylum plan because Labour MPs were “giggling and laughing and taking the mick”. Anderson helped undermine the prime minister’s authority on ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/18/electric-car-price-war-expected-this-year--report/",
        "title": "Electric car price war expected this year – report",
        "description": "In September last year, Prime Minister <b>Rishi Sunak</b> delayed the ban on the sale of new petrol and diesel cars and vans in the UK from 2030 to 2035. Auto Trader commercial director Ian Plummer said: “Drivers considering taking the first step on their ..."
    }
]