[
    {
        "url": "https://www.kentonline.co.uk/news/national/i-understand-voters-frustrations-sunak-says-in-live-tv-grilling-110376/",
        "title": "I understand voters’ frustrations, <b>Sunak</b> says in live TV grilling",
        "description": "As peers in the House of Lords debated draft legislation aimed at sending asylum seekers to Kigali, one voter asked Mr Sunak why he was “so adamant” about the Rwanda policy “when public documentation shows it isn’t working and that it’s not going to work”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/sunak-warns-reform-voters-put-starmer-number-10/",
        "title": "You will put Starmer in No 10, <b>Sunak</b> warns Reform voters",
        "description": "<b>Rishi Sunak</b> asked one voter: ‘Who do you want to see in government after the next election?’ Credit: Matt Pover/GB News <b>Rishi Sunak</b> has told Reform UK supporters that they will put Sir Keir Starmer’s Labour Party into Number 10 unless they vote ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?page=with:block-65c9fa818f08dd3abaaef92b",
        "title": "<b>Rishi Sunak</b> prepares for live public Q&amp;A on GB News",
        "description": "Prime minister faces one-hour grilling from voters following day of campaigning in Yorkshire"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gb-news-today-updates-b2494979.html?page=5",
        "title": "<b>Rishi Sunak</b> GB News – live: Prime minister set to be grilled by UK public as pressure mounts",
        "description": "Rishi Sunak is set to be grilled by the UK public as pressure continues to mount on the prime minister in one of the most challenging weeks of his premiership. Mr Sunak is facing questions from undecided and swing voters in County Durham during the People&#39;s Forum event,"
    },
    {
        "url": "https://www.hambletontoday.co.uk/rishi-sunak-talks-to-school-about-democracy-and-parliament/",
        "title": "<b>Rishi Sunak</b> talks to school about democracy and Parliament",
        "description": "Rishi Sunak spoke about the importance of Parliament and democracy during a visit to a North Yorkshire primary school. In an illustrated presentation to Appleton Wiske Community Primary School, the MP described how our system"
    },
    {
        "url": "https://global.chinadaily.com.cn/a/202402/13/WS65ca8d1da3104efcbdaeaba8_4.html",
        "title": "Grand Chinese New Year celebration held in London",
        "description": "A congratulatory letter from UK Prime Minister Rishi Sunak was read out at the event. &quot;I applaud the work the LCCA does to support the Chinese business community in London…I am grateful for the continued contributions of the British Chinese Community and their achievements across the country,&quot; Sunak wrote."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-nhs-prime-minister-rwanda-labour-b1138739.html",
        "title": "I understand voters’ frustrations, <b>Sunak</b> says in live TV grilling",
        "description": "As peers in the House of Lords debated draft legislation aimed at sending asylum seekers to Kigali, one voter asked Mr Sunak why he was “so adamant” about the Rwanda policy “when public documentation shows it isn’t working and that it’s not going to work”."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/rochdale-by-election-labour-received-new-information-about-azhar-ali-before-withdrawing-support/",
        "title": "Rochdale by-election: Labour received &#39;new information&#39; about Azhar Ali before withdrawing support",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving new information about comments he is alleged to have made."
    },
    {
        "url": "https://www.thesun.co.uk/health/25892533/hypnotherapy-kick-vaping-habit/",
        "title": "I tested hypnotherapy to kick my disgusting vaping habit after demolishing one Elf Bar disposable per day – did it work?",
        "description": "Just last month, <b>Rishi Sunak</b> announced new plans to ban disposable vapes after alarming research showed they can be seriously damaging to children’s health. Five million of the e-cigs are thrown away each week in the UK, leading to an environmental disaster."
    },
    {
        "url": "https://www.ft.com/content/4f24d958-7f73-430d-b069-2acc760b8842",
        "title": "Bank of England’s Andrew Bailey sees signs of ‘somewhat stronger ’ UK growth",
        "description": "Governor plays down upcoming economic data that is feared to show technical recession and deliver blow to Sunak"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-nottinghamshire-68279806?at_link_type=web_link&at_link_origin=BBC_East_Midlands&at_bbc_team=editorial&at_link_id=81E90240-C9D4-11EE-8AA7-0A498161DE7E&at_format=link&at_campaign=Social_Flow&at_medium=social&at_campaign_type=owned&at_ptr_name=facebook_page",
        "title": "Nottingham attacks: Second police force investigated over contact with killer",
        "description": "The police watchdog has started an investigation into a force&#39;s contact with Valdo Calocane before he killed three people in Nottingham. The Independent Office for Police Conduct (IOPC) review follows a voluntary referral by Nottinghamshire Police of complaints it has received from the victims&#39; families."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13075883/Rishi-Sunak-Covid-vaccine-fiery-exchange-GB-News-Q-sessions.html",
        "title": "Moment <b>Rishi Sunak</b> is confronted over the Covid vaccine as man who suffered drastic side effects tells him &#39;to look into his eyes and see his pain&#39; in fiery exchange on GB News ...",
        "description": "This is the moment Rishi Sunak was confronted by a furious man on GB News who demanded that he look him in the eye and give him a straight answer over harm caused by the Covid-19 vacine"
    },
    {
        "url": "https://socialistworker.co.uk/news/tory-part-crisis-unfolds/",
        "title": "<b>Rishi Sunak</b>’s week from hell",
        "description": "Possibility of rising inflation, drop in production, by-election defeats and opposition to Rwanda bill shows depth of Tory party crisis"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865978/rishi-sunak-keir-stamer-labour-conservatives-general-election",
        "title": "<b>Rishi Sunak</b> issues warning over Labour as Brits urged not to fall for Keir Starmer&#39;s &#39;con&#39;",
        "description": "Rishi Sunak vowed to fix the social care system, slash NHS waiting lists and continue to ease the cost of living crisis if the Tories win the next general election."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?page=with:block-65ca86678f08e47ce3f316cc",
        "title": "<b>Rishi Sunak</b> tells voters he is ‘absolutely’ committed to Rwanda during Q&amp;A on GB News – live updates",
        "description": "Prime minister faces one-hour grilling from voters following day of campaigning in Yorkshire"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865975/rishi-sunak-covid-vaccine-campaigner-scotland",
        "title": "&#39;Look me in the eye&#39;: <b>Rishi Sunak</b> confronted by furious Covid vaccine campaginer",
        "description": "The visibly angry audience member pointed at the Prime Minister and raised his voice during the tense exchange on GB News"
    },
    {
        "url": "https://news.sky.com/story/matt-hancock-defends-use-of-taxpayer-funded-jaguar-for-covid-inquiry-appearances-13070286",
        "title": "Matt Hancock defends use of taxpayer-funded Jaguar for COVID Inquiry appearances",
        "description": "A spokesperson for the former health secretary said it was &quot;entirely reasonable that the government should take care of his travel and security arrangements&quot;."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/house-of-lords-rwanda-tugendhat_uk_65ca6e9de4b01f4a8b01cdb4",
        "title": "Tory Peer Says Government Behaving Like &#39;Despots&#39; Over Rwanda Bill",
        "description": "Lord Tugendhat says parliament &quot;should not even be asked to confront, let alone pass” Rishi Sunak&#39;s controversial legislation."
    },
    {
        "url": "https://www.politicshome.com/news/article/government-taking-unreasonable-risk-sending-people-rwanda-without-safety-advice-says-bishop",
        "title": "Government Could Need UN Nod On Rwanda Flights In New Lords Proposal",
        "description": "The House of Lords is exploring whether Government could need to seek UN advice on whether Rwanda is a safe country in order to deport asylum"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gb-news-today-updates-b2494979.html",
        "title": "<b>Rishi Sunak</b> GB News – live: Rwanda scheme is ‘right thing to do’ insists Prime Minister in live TV grilling",
        "description": "Rishi Sunak is set to be grilled by the UK public as pressure continues to mount on the prime minister in one of the most challenging weeks of his premiership. Mr Sunak is facing questions from undecided and swing voters in County Durham during the People&#39;s Forum event, which kicks off at 8pm on GB News."
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-shrug-bad-economic-news-obr-forecast-tax-cuts-2902707?ITO=msn",
        "title": "<b>Sunak</b> hopes to shrug off bad economic news with OBR forecast allowing tax cuts",
        "description": "The Treasury is braced for a double blow this week, with the ONS expected to confirm a slight increase in inflation on Wednesday due to a rise in the energy price cap which took effect in January, although it is expected to fall back to its target of 2 per cent this year."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-rwanda-bill-comes-180935010.html",
        "title": "<b>Rishi Sunak</b>’s Rwanda bill comes under fire from Tory and Labour peers",
        "description": "Tory and Labour peers warned of their belief that the Safety of Rwanda Bill would set a dangerous precedent for Britain"
    },
    {
        "url": "https://www.itv.com/news/2024-02-12/at-least-50-killed-in-gaza-airstrikes-as-israeli-rescues-two-hostages",
        "title": "&#39;Safe zones are fiction&#39;: Dozens of Palestinians killed in Rafah raid to rescue Israeli hostages",
        "description": "At least 50 Palestinians were killed in airstrikes which were part of the operation, according to Palestinian hospital officials. | ITV National News"
    },
    {
        "url": "https://www.middleeasteye.net/news/war-gaza-aid-organisations-write-uk-prime-minister-humanitarian-situation-rafah",
        "title": "War on Gaza: Aid organisations write to UK prime minister on humanitarian situation in Rafah",
        "description": "The letter expresses urgent concern over Israeli attacks on Rafah, where around 1.3 million forcibly displaced Palestinians currently live"
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/transport/harrogate-bus-boss-says-town-is-to-get-the-most-modern-and-passenger-oriented-network-in-britain-4515461",
        "title": "Harrogate bus boss says town is to get the &#39;most modern and passenger oriented network in Britain&#39;",
        "description": "The comments by Transdev’s Managing Director Henri Rohard followed a visit in person to Harrogate Bus Company’s depot in Starbeck by Prime Minister <b>Rishi Sunak</b>. Accompanied by Harrogate and Knaresborough MP Andrew Jones, the PM spoke with engineering ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/tech-secretary-working-ease-uk-172037433.html",
        "title": "Tech secretary working to ease UK access to Horizon Europe funding",
        "description": "Tech secretary Michelle Donelan has said she is working to make it easier for British companies to access Horizon Europe funding as the UK looks to secure its science &#39;superpower&#39; status."
    },
    {
        "url": "https://www.politicshome.com/news/article/rural-tory-mps-worried-about-mobile-merger-impact",
        "title": "Tories Fear Slower 4G Rollout Would Be Nail In The Coffin For Ailing Rural Voters",
        "description": "Conservative MPs have expressed concern that a proposed merger of two of the country&#39;s four mobile networks could result in bigger phone bills and"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/migrants-found-coach-hounsdown-school-france-trip-b1138686.html",
        "title": "Two suspected migrants found in luggage compartment of school coach after France trip",
        "description": "Parents have told of their shock after two suspected migrants were discovered in the luggage compartment of a school coach as it returned to Hampshire from France. Officers were called to Hounsdown School in Totton on Saturday evening following reports that two young men were found lying inside the hold of the vehicle."
    },
    {
        "url": "https://www.hambletontoday.co.uk/prime-minister-defends-council-funding-amid-40m-black-hole-in-north-yorkshires-budget/",
        "title": "Prime Minister defends council funding amid £40m black hole in North Yorkshire’s budget",
        "description": "Prime Minister Rishi Sunak has defended the financial support available to councils in the face of a mounting black hole in North Yorkshire Council’s budget. Mr Sunak was speaking at Harrogate Bus Company’s headquarters in"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/firm-part-owned-rishi-sunaks-32108820",
        "title": "Firm part-owned by <b>Rishi Sunak</b>&#39;s wife got millions of pounds in Government contracts",
        "description": "Prime Minister Rishi Sunak’s wife Akshata Murty holds a £619million stake in Infosys, which saw an almost 50% increase in its public sector work last year, figures have releaved"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13074859/Tories-slump-lowest-poll-rating-Rishi-PM-Labour-lead-surging-25-points-start-one-Sunaks-worst-weeks-No10.html",
        "title": "Tories slump to their lowest poll rating with <b>Rishi</b> as PM with Labour lead surging to 25 points at start of what could be one of <b>Sunak</b>&#39;s worst weeks in No10",
        "description": "The latest Redfield &amp; Wilton Strategies survey showed the Conservatives on just 21 per cent support among voters, which is down three points since last week."
    },
    {
        "url": "https://thestrayferret.co.uk/gallery-prime-minister-rishi-sunak-visits-harrogate/",
        "title": "GALLERY: Prime Minister <b>Rishi Sunak</b> visits Harrogate",
        "description": "Mr Sunak, on his first engagement of the week, visited the Harrogate Bus Company ‘s depot in Starbeck to show support for Conservative MP Andrew Jones, who will attempt to win the Harrogate and Knaresborough seat for a fifth time at the next general election."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-withdraws-support-candidate-antisemitism-205602226.html",
        "title": "Labour Withdraws Support for Candidate in Antisemitism Scandal",
        "description": "The Labour Party withdrew support from its candidate to fill a vacant Parliament seat in northern England, caving to pressure to cut ties with Azhar Ali over antisemitic remarks he was reported to have made last year."
    },
    {
        "url": "https://inews.co.uk/news/politics/unlikely-lord-cameron-pm-again-tory-plots-oust-sunak-2902018?ITO=msn",
        "title": "Why it’s unlikely Lord Cameron would become PM again despite Tory plots to oust <b>Sunak</b>",
        "description": "One MP tells i the Foreign Secretary is being floated by some Tory plotters as a potential &#39;unity candidate&#39; before the election"
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/prime-minister-rishi-sunak-defends-council-funding-amid-ps40m-black-hole-in-north-yorkshires-budget-4515156",
        "title": "Prime Minister <b>Rishi Sunak</b> defends council funding amid £40m black hole in North Yorkshire’s budget",
        "description": "Prime Minister Rishi Sunak has defended the financial support available to councils in the face of a mounting black hole in North Yorkshire Council’s budget."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/conservatives-labour-party-countryside-seats-election/",
        "title": "Tories ‘could lose more than half of England’s 100 most rural seats’",
        "description": "The Conservatives could lose more than half of the 100 most rural seats in England at the election, according to a poll that has dealt another blow to Rishi Sunak. The Survation survey showed that Labour holds a lead in the polls in the seats, which have traditionally formed Conservative heartlands."
    },
    {
        "url": "https://www.gg2.net/british-american-tobacco-to-cut-stake-in-itc-amid-losses/",
        "title": "British American Tobacco to cut stake in ITC amid losses",
        "description": "Tobacco major British American Tobacco is looking to trim its £15 billion stake in the Indian cigarettes-to-hotel conglomerate ITC, according to media reports."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24114303.pm-defends-council-funding-amid-40m-black-hole-budget/",
        "title": "PM defends council funding amid £40m black hole in budget",
        "description": "Prime Minister Rishi Sunak has defended the financial support available to councils in the face of a mounting black hole in North"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-york-north-yorkshire-68274710",
        "title": "<b>Rishi Sunak</b> avoids saying when he last caught a bus in Yorkshire",
        "description": "Rishi Sunak was unable to recall when he last caught a bus as he talked about how services in the north are benefitting from HS2 being scrapped. The prime minister dodged the question from BBC Look North while visiting a bus depot in Harrogate on Monday."
    },
    {
        "url": "https://www.scotsman.com/news/politics/why-rishi-sunak-is-still-facing-a-nightmare-week-despite-parliament-in-recess-as-inflation-figures-by-elections-and-rwanda-debate-looms-4515040",
        "title": "Why <b>Rishi Sunak</b> is still facing a nightmare week despite Parliament in recess, as inflation figures, by-elections and Rwanda debate looms",
        "description": "Labour’s shock wins in Tamworth and Mid Bedfordshire last year meant the Tories had not seen such poor by-election results since the run-up to Tony Blair’s 1997 general election landslide. Losing these seats would rattle the many Conservative MPs already worried about their own constituencies."
    },
    {
        "url": "https://www.gg2.net/india-trying-to-push-watered-down-trade-deal-uk/",
        "title": "India trying to push watered-down trade deal: UK",
        "description": "The trade deal talks between India and the UK have run into a deadlock with both sides hardening their stands amid elections scheduled in both the countries."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-call-election-march-32107086",
        "title": "&#39;<b>Rishi Sunak</b> has to call an election in 6 weeks - he has no other choice&#39;",
        "description": "The Prime Minister cannot wait until Autumn to call a vote, says Fleet Street Fox. There&#39;ll be no-one left in Downing Street by then"
    },
    {
        "url": "https://morningstaronline.co.uk/article/a-dangerous-precedent",
        "title": "‘A dangerous precedent’",
        "description": "<b>RISHI SUNAK</b>’S proposed Rwanda asylum legislation sets a dangerous precedent by seeking to put the government above the rule of law, campaigners said today. The warning came as Parliament’s joint committee on human rights cautioned that the Bill ..."
    }
]