[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "Mr Habib finished third behind the Labour and the Conservative candidates, but it represents a victory in Reform&#39;s battle for influence, as they inflicted two very painful statistical wounds on <b>Rishi Sunak</b>&#39;s party. Reform got a 13% share of the vote at ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-63536770?_hsenc=p2ANqtz-_BWDUJGM2wT-SIzzJFbD1FfrllBdnWg6RYoHueJ8k3ErJFM57fLrVkgR2IANNyqCbY-Ipm",
        "title": "COP27: <b>Rishi Sunak</b> urges global push on &#39;clean growth&#39;",
        "description": "The fight against climate change can become &quot;a global mission for new jobs and clean growth&quot;, <b>Rishi Sunak</b> will tell world leaders at the COP27 summit. The prime minister will also say it is essential nations stick to commitments made at COP26 in Glasgow a ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-reportedly-considering-calling-28654450",
        "title": "<b>Rishi Sunak</b> reportedly considering calling General election in May",
        "description": "MPs are considering a May election to &#39;stop the bleeding&#39; and ensure <b>Rishi Sunak</b> makes it to the election without a rival launching a leadership bid, the Mirror reported. The paper claims that the latest by-election defeats have hit morale within the Tory ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13094795/Housebuilders-call-urgent-stamp-duty-cut.html",
        "title": "Housebuilders call for urgent stamp duty cut",
        "description": "Taylor Wimpey&#39;s Jennie Daly said that there was a &#39;real case&#39; for reducing the levy on lower-priced properties and for sellers over the age of 60 who were looking to downsize."
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "General election is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the party must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867906/keir-starmer-almost-quit-labour-leader-hartlepool",
        "title": "Keir Starmer almost quit as Labour leader after Hartlepool by-election loss – claim",
        "description": "Sir Keir Starmer allegedly said the result showed the party was going backwards and believed it to to be a personal rejection."
    },
    {
        "url": "https://www.thesun.co.uk/news/26010435/sir-john-hayes-crystal-ball-damage-labour/",
        "title": "We don’t need a crystal ball to know what damage Labour would do… past shows a clear enough picture",
        "description": "THIS week has revealed a face of Labour they have tried desperately to disguise. The truth is that you cannot trust Sir Keir Starmer when he says he has changed his party when he was forced to"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-nearly-quit-hartlepool-195001350.html",
        "title": "Keir Starmer nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir Starmer and his top team."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/starmer-nearly-quit-after-hartlepool-by-election-defeat-says-new-biography-100276/",
        "title": "Starmer nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "Nearly two and a half years later, Sir Keir is now tipped to become the next prime minister with a poll lead far ahead of <b>Rishi Sunak</b>’s Tories. But the by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir and his top ..."
    },
    {
        "url": "https://www.cornwalllive.com/news/news-opinion/rishi-sunaks-visit-cornwall-certainly-9098425",
        "title": "&#39;<b>Rishi Sunak</b>&#39;s visit to Cornwall certainly told a story&#39;",
        "description": "The inconvenient facts presented by the media were stonewalled with a bland: “I respectfully disagree with your characterisation of what we’ve been doing.”"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-desperate-call-british-094329930.html",
        "title": "<b>Rishi Sunak</b> in desperate call to British conservatives after by-election losses",
        "description": "Rishi Sunak has called on all those on the right of politics to &quot;come together&quot; – over him - after disastrous double defeats in the Wellingborough and Kingswood by-elections. The Tories lost votes to Labour and a strengthened Reform UK, the successor to Nigel Farage ’s Brexit Party."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-hartlepool-labour-the-times-holborn-b1139825.html",
        "title": "Starmer nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir Starmer and his top team."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunaks-premiership-now-accounts-32150650",
        "title": "<b>Rishi Sunak</b>&#39;s premiership now accounts for a third of all small boat arrivals since 2018",
        "description": "New analysis found the total number of arrivals since Sunak took office had risen to 38,668 - over a third of the 115,927 who have crossed the Channel since the crisis began"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867891/laura-kuenssberg-reform-uk-nigel-farage-election",
        "title": "Laura Kuenssberg pinpoints &#39;important evidence&#39; over threat of Nigel Farage and Reform UK",
        "description": "While recent by-elections may on the surface appear to be Labour victories, the specifics of the votes reveal Reform UK could be increasing their hold over British politics."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-eye-up-election-stop-32150575",
        "title": "Tories eye up May election to &#39;stop the bleeding&#39; and head off mutiny against <b>Rishi Sunak</b>",
        "description": "Senior Tory source says May election might be necessary after Labour battering in by-elections and polls suggesting the party will be &#39;obliterated&#39; with announcement potentially soon"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/picture/2024/feb/17/jeremy-hunt-leads-rishi-sunak-towards-electoral-extinction-cartoon",
        "title": "Jeremy Hunt leads <b>Rishi Sunak</b> towards electoral extinction – cartoon",
        "description": "The economy is turning a corner, claims the chancellor. But look what’s lurking in the shadows"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/17/rishi-sunak-tories-traditional-values-win-election-poll/",
        "title": "<b>Sunak</b> must embrace traditional Conservative values for Tories to win election, poll suggests",
        "description": "Poll likely to fuel concerns over Rishi Sunak’s leadership as Labour leads with 22 percentage points over Conservatives"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-biography-extracts-highlights-b2498023.html",
        "title": "Keir Starmer nearly quit after Hartlepool by-election defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir Starmer and his top team."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/17/sunak-quietly-put-eu-style-equality-law-on-statute-book/",
        "title": "<b>Sunak</b> has ‘squandered Brexit freedoms’ by quietly slipping EU-style equality laws on to statue book",
        "description": "Rishi Sunak has been accused of squandering Brexit freedoms after quietly introducing sweeping EU equality rules into British law."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/queen-camillas-support-privately-and-publicly-is-now-more-important-than-ever-for-the-king/",
        "title": "Queen Camilla&#39;s support privately and publicly is now more important than ever for the King",
        "description": "This coming week her diary is again looking busy with receptions. We&#39;re also expecting to see the King&#39;s first meeting with Prime Minister <b>Rishi Sunak</b> in person since his diagnosis. On Tuesday, he surprised guests at one of Camilla&#39;s events at Clarence ..."
    },
    {
        "url": "https://www.theguardian.com/food/2024/feb/17/im-fascinated-by-fasting-but-sorry-rishi-sunak-im-not-about-to-bin-my-morning-toast",
        "title": "I’m fascinated by fasting but, sorry <b>Rishi Sunak</b>, I’m not about to bin my morning toast",
        "description": "I’m suspicious of this fad, and do worry how anyone can run a country on an empty stomach The news that <b>Rishi Sunak</b> likes to begin his week with a 36-hour fast was genuinely alarming to me, a woman raised to believe that without breakfast, no important ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/reform-uk-rishi-sunak-byelection-putin-b2497954.html",
        "title": "<b>Rishi Sunak</b> cannot afford to become consumed by by-election defeats",
        "description": "The Reform UK bandwagon may appear to be picking up speed. In Wellingborough, Ben Habib won 13 per cent of the vote and in Kingswood, Rupert Lowe won 10 per cent. This suggests that national opinion polls, putting the party on an average of 10 per cent, are accurate."
    },
    {
        "url": "https://www.ross-shirejournal.co.uk/news/national/uk-in-a-doom-loop-under-tories-labour-mp-claims-100266/",
        "title": "UK in a ‘doom loop’ under Tories, Labour MP claims",
        "description": "Shadow financial secretary to the Treasury James Murray said public services across the country were ‘on their knees’."
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24126462.labours-ian-murray-challenges-sunak-name-day-general-election/",
        "title": "Labour’s Ian Murray challenges <b>Sunak</b> to name the day for general election",
        "description": "Labour’s shadow Scottish secretary challenged <b>Rishi Sunak</b> to put the country “out of this Tory misery” and call a general election now. Ian Murray said Labour had now set its sights “firmly on first place”. While the party had been in the ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/how-a-recession-and-by-election-misery-sent-rishi-sunak-back-to-square-one_uk_65cf0264e4b043f1c0aaaf9e?d_id=7311830&ncid_tag=fcbklnkukhpmg00000001",
        "title": "How A Recession And By-Election Misery Sent <b>Rishi Sunak</b> Back To Square One",
        "description": "For three days, it looked as though <b>Rishi Sunak</b> was having the rarest of things for him – a good week. Keir Starmer was under the cosh over Labour’s woes in Rochdale and, despite predictions to the contrary by economists, inflation did not go up again ..."
    }
]