[
    {
        "url": "https://www.thetimes.co.uk/article/609a5a2f-e1c1-4c2e-9c5a-e9aeec2f657d?shareToken=d24eba5853aab0588d1194dd548f0fe5",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "<b>Rishi Sunak</b> will allow farmers to open shops, offices and other rural businesses without full planning permission in a Clarkson-inspired pitch to rural voters. The prime minister is also promising more robots to help with planting and harvesting to reduce ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/prince-william-says-too-many-have-been-killed-israel-gaza-conflict-1723566",
        "title": "Prince William Says &#39;Too Many Have Been Killed&#39; In Israel Gaza Conflict",
        "description": "In response to the prince&#39;s statement, a spokesperson for Prime Minister <b>Rishi Sunak</b> said: &quot;We want to see an end to the fighting in Gaza as soon as possible, so it is consistent with the government position.&quot; Israel&#39;s government also responded to Prince ..."
    },
    {
        "url": "https://www.ok.co.uk/royal/meghan-markle-makes-rare-appearance-32191282",
        "title": "Meghan Markle makes rare appearance at UK charity as she pays video tribute to &#39;dear friend&#39;",
        "description": "The Duchess of Sussex, Meghan Markle, has sent a personal video message in memory of an animal behaviourist and &#39;dear friend&#39; to mark the naming of a new rescue wing in his honour"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/22/protest-exclusion-zones-mps-offices-sunak-adviser/",
        "title": "Introduce protest exclusion zones around MPs’ offices, says <b>Sunak</b> adviser",
        "description": "Lord Walney&#39;s recommendation comes as politicians have been targeted by pro-Palestinian protesters in their constituencies"
    },
    {
        "url": "https://www.fool.co.uk/2024/02/22/when-cheap-markets-meet-favourable-conditions-sentiment-flips-very-quickly/",
        "title": "When cheap markets meet favourable conditions, sentiment flips very quickly",
        "description": "Either way, though, the point is that prime minister <b>Rishi Sunak</b>’s promise of economic growth isn’t being met. We’re just flatlining, essentially. A few weeks back, I really wasn’t sure that now was the time to place a bet on the economy ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-accusations-against-starmer-complete-garbage-speaker-probably-safe-in-role-12593360",
        "title": "Politics latest: Accusations against Starmer &#39;complete garbage&#39;; Speaker &#39;probably safe&#39; in role",
        "description": "<b>Rishi Sunak</b> has joined the legion of Tory and SNP MPs who have criticised the Commons Speaker over his handling of votes on a ceasefire in Gaza, but a no confidence motion in him appears to be petering out. Meanwhile, Keir Starmer has denied applying undue ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/22/lindsay-hoyle-rishi-sunak-criticises-speakers-concerning-choice-gaza-vote",
        "title": "Lindsay Hoyle fights back as <b>Sunak</b> criticises speaker’s ‘concerning’ choice",
        "description": "PM says parliamentarians should never be intimidated by ‘extremists’ after furore over Gaza vote Lindsay Hoyle has come out fighting against attempts to oust him as Commons speaker as <b>Rishi Sunak</b> criticised his “very concerning” choice over the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/22/gbnews-ofcom-excessive-intervention-rishi-sunak-row/",
        "title": "GB News accuses Ofcom of ‘excessive intervention’ over <b>Rishi Sunak</b> programme",
        "description": "GB News robustly defended the impartiality of its People&#39;s Forum show in which <b>Rishi Sunak</b> took questions from a panel of voters GB News has accused Ofcom of “excessive intervention” in its affairs as the broadcaster opened a public spat with the ..."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7270872",
        "title": "Politics latest: <b>Sunak</b> criticises Speaker&#39;s &#39;very concerning&#39; handling of Gaza ceasefire votes",
        "description": "Prime Minister <b>Rishi Sunak</b> has joined the legion of Tory and SNP MPs who have criticised the Commons Speaker over his handling of votes on a ceasefire in Gaza, with the motion of no confidence in him attracting dozens of signatories. News is moving fast ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/we-cant-let-extremists-intimidate-us-sunak-says-after-speaker-row-2921659",
        "title": "We can’t let extremists intimidate us, <b>Sunak</b> says after Speaker row",
        "description": "Rishi Sunak also expressed concern that parliament should not be intimidated by extremists after Sir Lindsay Hoyle&#39;s decision to break parliamentary convention to allow a Labour amendment on the Israe"
    },
    {
        "url": "https://www.ft.com/content/a538f364-ac7f-46fb-bc13-f658c8ba0c4a",
        "title": "UK mortgage rates tick up as race towards cheaper deals eases",
        "description": "The changing economic outlook has driven up swap rates in recent weeks, which lenders use to price their mortgage deals. Swap agreements allow two parties to exchange payments, where one pays a fixed rate in exchange for a variable payment pegged to the Bank of England rate."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68368320",
        "title": "Speaker&#39;s handling of Gaza vote very concerning, says <b>Rishi Sunak</b>",
        "description": "Sir Lindsay Hoyle is facing mounting pressure to quit as Commons Speaker over his handling of a vote on Gaza. SNP Westminster leader Stephen Flynn said his decision to pick a Labour motion had seen Parliament &quot;descend into farce&quot;. He added his party no longer had confidence in him, and called for a Commons vote on his future."
    },
    {
        "url": "https://www.itv.com/news/utv/2024-02-22/police-on-high-alert-one-year-after-dci-caldwell-shooting",
        "title": "Police Federation says PSNI officers remain on high alert one year after DCI John Caldwell shooting",
        "description": "Prime Minister <b>Rishi Sunak</b> visited him in hospital. Mr Caldwell made his first public appearance since the shooting at a garden party hosted by the King at Hillsborough Castle in May. A number of people have been arrested and charged in relation to the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68374712?at_medium=RSS&at_campaign=KARANGA",
        "title": "<b>Rishi Sunak</b> attacks Welsh farm subsidy plans",
        "description": "Conservative Prime Minister Rishi Sunak has joined criticism of Welsh government proposals for changes to farm subsidies. Describing them as &quot;damaging&quot; and &quot;shocking&quot;, he accused Welsh Labour of risking UK food supply security. Proposals under consultation for farmers to be asked to plant trees on 10% of their land have sparked protests."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869792/reform-uk-conservative-general-election-polling",
        "title": "Reform UK surge in bombshell poll as gap closes with Tories on brink of landslide defeat",
        "description": "Reform UK has narrowed the gap with the Conservatives in a bombshell new poll, that saw the Tories sink to new lows in the latest voting intention poll. The latest YouGov/Times poll shows the Tories on 20 percent, a four percentage point drop from the last poll on February 14-15."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/commons-chaos-live-speaker-lindsay-32184083",
        "title": "Lindsay Hoyle LIVE: Commons Speaker issues apology as more than 60 MPs call for him to quit",
        "description": "Dozens of MPs have signed a motion of no confidence in Commons Speaker Sir Lindsay Hoyle after he helped Keir Starmer dodge a rebellion over a Gaza ceasefire vote"
    },
    {
        "url": "https://www.thewestmorlandgazette.co.uk/news/national/24138077.sunak-criticises-hoyles-handling-gaza-ceasefire-vote-concerning/",
        "title": "<b>Sunak</b> criticises Hoyle’s handling of Gaza ceasefire vote as ‘concerning’",
        "description": "The Prime Minister said parliamentarians should never be intimidated by ‘extremists’ after Sir Lindsay Hoyle raised concerns about MPs’ safety."
    },
    {
        "url": "https://www.express.co.uk/finance/personalfinance/1869746/jeremy-hunt-personal-allowance-spring-budget",
        "title": "&#39;I&#39;m an economics expert, here&#39;s how Jeremy Hunt can put £250 in Britons&#39; pockets&#39;",
        "description": "It currently stands at £12,750. Then Chancellor <b>Rishi Sunak</b> announced in the 2021 Spring Budget that the personal allowance would be frozen at 2021-22 levels for the four years up to and including 2025-26. In his Autumn Statement in 2022, Mr Hunt extended ..."
    },
    {
        "url": "https://www.hellomagazine.com/royalty/514009/king-charles-life-in-portraits/",
        "title": "King Charles III throughout the years",
        "description": "On 21 February, the King resumed in-person meetings as he met with Prime Minister <b>Rishi Sunak</b> for their weekly audience. Throughout his life, the King has faced many challenges and memorable moments with the monarch&#39;s life often being captured in ..."
    },
    {
        "url": "https://uk.news.yahoo.com/post-office-horizon-scandal-unanswered-185000328.html",
        "title": "Post Office Horizon scandal: The unanswered questions about legislation to overturn wrongful sub-postmaster convictions",
        "description": "Prime Minister <b>Rishi Sunak</b> announced earlier this year there would be blanket legislation to clear their names. Although some details have now been announced by business minister Kevin Hollinrake in the Commons, there&#39;s still a lot to find out, and key ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/22/hundreds-post-office-scandal-victims-cleared-new-law-20328365/?ico=more_text_links",
        "title": "Hundreds of Post Office scandal victims to be cleared under new law",
        "description": "Prime Minister <b>Rishi Sunak</b> earlier this year announced blanket legislation to clear their names after TV drama, Mr Bates vs the Post Office, thrust the saga into the spotlight and sparked public outrage. More than 900 Post Office branch managers around the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/long-deeply-disappointed-ni-excluded-201659087.html",
        "title": "Long ‘deeply disappointed’ as NI excluded from law to exonerate subpostmasters",
        "description": "Details of blanket legislation to exonerate subpostmasters convicted in England and Wales was published on Thursday after Prime Minister <b>Rishi Sunak</b> earlier this year said they were victims of “one of the greatest miscarriages of justice in our nation ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/lindsay-hoyle-speaker-what-happens-quit-145508436.html",
        "title": "What happens if Lindsay Hoyle quits as speaker?",
        "description": "<b>Rishi Sunak</b> also criticised Hoyle&#39;s handling of the Gaza ceasefire vote as “very concerning” and warned that parliamentarians should never be intimidated by “extremists”. The speaker of the House commands authority over all MPs, chairing debates ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?filterKeyEvents=false",
        "title": "Uk politics: <b>Sunak</b> ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – as it happened",
        "description": "PM implies he is willing to draw a line under Gaza ceasefire vote chaos Updated 4h ago <b>Rishi Sunak</b> has thrown a partial lifeline to Sir Lindsay Hoyle, the Commons speaker, giving him credit for his apology for the decision he took last night."
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-sunak-is-becoming-very-unimportant-2918251",
        "title": "<b>Rishi Sunak</b> is becoming very unimportant",
        "description": "Sunak is trying to counter this with his own charm offensive, not with his gloomy party, but with the electorate itself. He is now well into his long run-in to the election, spending a significant proportion of each week on the road campaigning."
    },
    {
        "url": "https://www.walesonline.co.uk/news/rishi-sunak-wales-two-days-28679831",
        "title": "<b>Rishi Sunak</b> is in Wales for two days as part of his &#39;levelling up tour&#39;",
        "description": "Rishi Sunak will be in Wales for two days as part of a so-called &quot;levelling up tour&quot; of the country. The Prime Minister&#39;s visit to north Wales from today coincides with an announcement that one million UK properties had been connected to high-speed broadband."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/post-office-kevin-hollinrake-rishi-sunak-kemi-badenoch-england-b2500753.html",
        "title": "Details of law to exonerate wronged subpostmasters announced",
        "description": "Prime Minister <b>Rishi Sunak</b> earlier this year announced blanket legislation to clear their names after a TV drama thrust the saga into the spotlight and sparked public outrage. More than 700 Post Office branch managers around the UK were prosecuted between ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24131542.labour-call-immediate-humanitarian-ceasefire-gaza/?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "Labour to call for &#39;immediate humanitarian ceasefire&#39; in Gaza",
        "description": "I am therefore urging each and every one of you to vote with your conscience for an immediate ceasefire. &quot;I hope <b>Rishi Sunak</b> and Keir Starmer will find the courage to change their position and do the only right thing but, if they won’t, it falls to us ..."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-22/welsh-government-plans-for-farming-funding-are-shocking-says-pm",
        "title": "Welsh Government plans for farming funding are ‘shocking’ and ‘not the right path&#39; says PM",
        "description": "Rishi Sunak is in North Wales as part of a two-day &#39;Levelling Up&#39; tour and ahead of the Welsh Conservative party conference in Llandudno. | ITV News Wales"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-lancashire-68367696",
        "title": "Paul Maynard: Pensions minister investigated over funding claims",
        "description": "Mr Maynard, pictured with Prime Minister <b>Rishi Sunak</b> at a conference in Blackpool A full investigation has been launched into claims Pensions Minister Paul Maynard used taxpayers&#39; money to fund his campaigning, the parliamentary watchdog said. Mr Maynard ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-22/itv-follows-post-office-drama-with-series-on-infected-blood-scandal",
        "title": "Infected blood scandal drama to follow ITV&#39;s Post Office series",
        "description": "A drama about the infected blood scandal following has been given the go-ahead by ITV. It follows the success of the Mr Bates vs The Post Office drama about what has been called the largest miscarriage of justice in British legal history."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869773/Conservative-Party-polling-young-people-rishi-sunak",
        "title": "Tory turmoil for <b>Rishi Sunak</b> as 66-year-olds are now Conservatives&#39; youngest voters",
        "description": "There&#39;s a double helping of bad polling for Rishi Sunak today, as any gains made during Labour&#39;s Rochdale crisis have now been reversed."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sir-lindsay-hoyle-resign-quit-sacked-speaker-house-commons-nqsch09qt?ilc=timesradio:morefromthetimes",
        "title": "<b>Rishi Sunak</b> says Lindsay Hoyle’s Commons conduct ‘very concerning’",
        "description": "The prime minister accused the Speaker of ‘bending to intimidation by extremists’ on Gaza ceasefire vote as dozens of MPs call for resignation"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68368958",
        "title": "Speaker Hoyle&#39;s amendment decision &#39;concerning,&#39; <b>Sunak</b> says",
        "description": "Rishi Sunak says the “usual ways in which Parliament works were changed” in the Speaker’s handling of an Opposition Day debate and vote."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/commons-chaos-live-speaker-lindsay-32184083.amp",
        "title": "Lindsay Hoyle LIVE: Commons Speaker issues apology as more than 60 MPs call for him to quit",
        "description": "<b>Rishi Sunak</b> has criticised Sir Lindsay Hoyle&#39;s handling of the Gaza ceasefire vote, branding it &quot;very concerning&quot;. He warned MPs should never be intimidated by &quot;extremists&quot;. The PM condemned the way the Commons Speaker had changed the &quot;usual ways in which ..."
    },
    {
        "url": "https://www.thenational.scot/news/24138166.rishi-sunak-criticises-lindsay-hoyles-handling-gaza-vote/?n=@",
        "title": "<b>Rishi Sunak</b> criticises Lindsay Hoyle’s handling of Gaza vote",
        "description": "<b>RISHI Sunak</b> has criticised Lindsay Hoyle’s handling of the Gaza ceasefire vote as “very concerning” and warned parliamentarians should never be intimidated by “extremists”. But <b>Sunak</b> acknowledged that Hoyle had apologised and was “reflecting ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24137503.camilla-presents-universities-colleges-excellence-awards/",
        "title": "Camilla presents universities and colleges with excellence awards",
        "description": "The King was filmed for the first time carrying out his official duties since his shock cancer diagnosis when he was pictured on Wednesday holding his weekly audience with Prime Minister <b>Rishi Sunak</b>. Charles revealed he has been reduced to tears by the ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?filterKeyEvents=false&page=with:block-65d77aa28f0877292bb35baa",
        "title": "<b>Sunak</b> ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – UK politics live",
        "description": "By submitting your message, you are agreeing to share your details with us, which we may use in this blog. <b>Rishi Sunak</b> has thrown a partial lifeline to Sir Lindsay Hoyle, the Commons speaker, giving him credit for his apology for the decision he took last ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-criticises-lindsay-hoyles-165553790.html",
        "title": "<b>Rishi Sunak</b> Criticises Lindsay Hoyle&#39;s &#39;Concerning&#39; Handling Of Gaza Vote",
        "description": "<b>Rishi Sunak</b> has criticised Lindsay Hoyle for how he handled the chaotic Gaza ceasefire vote in parliament, amid pressure on the Speaker to resign. The prime minister said Hoyle should not have upended the “usual processes” of parliament in the face of ..."
    },
    {
        "url": "https://uk.yahoo.com/news/uk-air-drops-life-saving-071622950.html",
        "title": "UK air-drops life-saving aid into Gaza for first time amid Israeli blockade",
        "description": "“The prime minister [<b>Rishi Sunak</b>] welcomed Jordan’s innovative efforts to deliver life-saving aid to Gaza by land and air, and he set out the UK’s work to unblock aid access and alleviate the humanitarian crisis,&quot; a Downing Street spokesperson said ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-mps-prime-minister-gaza-snp-b2500804.html",
        "title": "<b>Sunak</b> criticises Hoyle’s handling of Gaza ceasefire vote as ‘concerning’",
        "description": "<b>Rishi Sunak</b> has criticised Sir Lindsay Hoyle’s handling of the Gaza ceasefire vote as “very concerning” and warned parliamentarians should never be intimidated by “extremists”. The Prime Minister condemned the way the Commons Speaker had changed ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/singer-young-says-i-might-28686319",
        "title": "Singer Will Young says &#39;I might become an MP&#39; after vowing to leave UK if Tories stay in power",
        "description": "The popstar said he felt that <b>Rishi Sunak</b> was taking the country backwards after years of progress on equality and that people are ready for a change with a new leadership. In an interview with Liz Bates on the podcast Pod Save the UK, the musician ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/tv/itv-announces-new-drama-series-28686743",
        "title": "ITV announces new drama series following success of Mr Bates Vs The Post Office",
        "description": "Prime Minister <b>Rishi Sunak</b> made promises last year while at the inquiry, saying he wants payment given to those affected &quot;as swiftly as possible&quot; after being criticised for not acting quickly enough."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-calls-immediate-humanitarian-ceasefire-32167127?int_source=nba",
        "title": "Labour calls for &#39;immediate humanitarian ceasefire&#39; in Gaza ahead of crunch Commons vote",
        "description": "I am therefore urging each and every one of you to vote with your conscience for an immediate ceasefire. I hope <b>Rishi Sunak</b> and Keir Starmer will find the courage to change their position and do the only right thing but, if they won&#39;t, it falls to us ..."
    }
]