[
    {
        "url": "https://www.kentonline.co.uk/news/national/what-the-papers-say-january-19-108430/",
        "title": "What the papers say – January 19",
        "description": "The lead stories for Friday cover various topics, with a number of political pieces making the front page. The Daily Express and the Financial Times both say Jeremy Hunt has signalled significant tax cuts are on the way for Britons, coming in a matter of weeks."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68017310?at_bbc_team=editorial&at_link_type=web_link&at_ptr_name=facebook_page&at_format=link&at_link_origin=BBC_Politics&at_link_id=89E5269C-B5FA-11EE-80FE-682855826ABF&at_campaign_type=owned",
        "title": "<b>Rishi Sunak</b> urges Lords to back Rwanda bill",
        "description": "The prime minister answered questions on the Rwanda bill during Thursday&#39;s press conference Prime Minister <b>Rishi Sunak</b> has urged the House of Lords to pass his flagship Rwanda bill, as he warned peers not to &quot;frustrate the will of the people&quot;. Giving a ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857271/Rishi-Sunak-McDonalds-menu-return",
        "title": "<b>Rishi Sunak</b> &#39;excited&#39; about the return of his &#39;favourite&#39; McDonalds menu item",
        "description": "EXCLUSIVE: The Express understands the Prime Minister has responded enthusiastically to a recent announcement by McDonald&#39;s."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/watchdog-slams-rishi-sunak-over-114328284.html",
        "title": "<b>Rishi Sunak</b> rapped by watchdog over claim to have ‘cleared’ asylum backlog",
        "description": "The UK’s statistics watchdog has slammed Rishi Sunak for his repeated claim to have “cleared” the asylum backlog – and warned that the assertion could erode trust in the government. Sir Robert Chote, the chair of the UK Statistics Authority, also said voters may have felt “misled”."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-stuck-slogan-relentlessly-154600363.html",
        "title": "<b>Rishi Sunak</b> stuck to his new slogan relentlessly - but some MPs believe it backfired spectacularly",
        "description": "Rishi Sunak&#39;s message at his Downing Street news conference was &quot;stick to the plan&quot;. In an appearance in Downing Street behind his &quot;Stop the Boats&quot; podium, lasting just under 27 minutes, Mr Sunak said &quot;stick to the plan&quot; - or very similar - no fewer than 15 times."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-slammed-over-misleading-123549088.html",
        "title": "<b>Rishi Sunak</b> Has Been Slammed Over His &#39;Misleading&#39; Claim To Have Cleared The Asylum Backlog",
        "description": "Rishi Sunak has been criticised by a top watchdog after wrongly claiming to have cleared the asylum backlog. The UK Statistics Authority said “people may feel misled” by the claim, which the prime minister made on X (formerly Twitter) earlier this month. They also said the controversy “may affect public trust” in claims made by the government."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-live-pm-address-31909158",
        "title": "<b>Rishi Sunak</b> LIVE: PM to address nation at Downing Street press conference",
        "description": "<b>Rishi Sunak</b> will address the nation from Downing Street shortly after he survived another day of Tory chaos over his Rwanda policy. The PM is expected to speak just after 10am before taking questions at a press conference - just hours after rebels warned ..."
    },
    {
        "url": "https://www.politics.co.uk/opinion-former/press-release/2024/01/18/rishi-sunak-all-mouth-and-no-trousers-when-it-comes-to-nature-protection/",
        "title": "<b>Rishi Sunak</b> “all mouth and no trousers” when it comes to nature protection",
        "description": "In response to the Office for Environmental Protection’s second annual report, published today, Doug Parr, Chief Scientist at Greenpeace UK, said:  “When it comes to protecting nature, this report proves beyond doubt that Rishi Sunak is all mouth and no trousers."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856939/tory-wimps-rishi-sunak-rwanda-comment",
        "title": "How <b>Rishi Sunak</b> beat Tory right with Priti Patel deal, Keir Starmer&#39;s PMQs and &#39;wimp&#39; MPs",
        "description": "ANALYSIS: Rishi Sunak has won a major victory and defeated the Right of his party meaning he now will almost certainly lead the Tories into the next election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rwanda-vote-rishi-sunak-stop-boats-b2479124.html?page=18",
        "title": "Rwanda bill – latest: <b>Rishi Sunak</b> pushes Tory MPs to back ‘stop the boats’ plan ahead of crunch vote",
        "description": "<b>Rishi Sunak</b> is staging a last-ditch bid to win over right-wing Conservatives MPs threatening to defeat his Rwanda deportation legislation. The PM faces a mounting rebellion over the flagship immigration policy, with Tory deputy chairman Lee Anderson and ..."
    },
    {
        "url": "https://www.fwi.co.uk/news/farm-policy/analysis-how-is-the-political-outlook-for-2024-shaping-up",
        "title": "Analysis: How is the political outlook for 2024 shaping up?",
        "description": "Renowned 16th-century philosopher Nostradamus, who is credited with predicting the rise of Adolf Hitler and the Covid-19 pandemic, had some pretty"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/jeremy-hunt-financial-times-kate-middleton-teachers-benjamin-netanyahu-b1133384.html",
        "title": "What the papers say – January 19",
        "description": "The Daily Express and the Financial Times both say Jeremy Hunt has signalled significant tax cuts are on the way for Britons, coming in a matter of weeks. The Daily Mail splashes with Rishi Sunak’s warning to the House of Lords over his Rwanda asylum legislation."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12981163/Rishi-Sunak-warns-House-Lords-not-defy-people-threatening-block-Rwanda-bill.html",
        "title": "<b>Rishi Sunak</b> warns the House of Lords not to defy the &#39;will of the people&#39; by threatening to block the Rwanda bill",
        "description": "Rishi Sunak yesterday warned the House of Lords to respect the &#39;will of the people&#39; and drop threats to block the Rwanda Bill."
    },
    {
        "url": "https://www.thetimes.co.uk/article/cody-rigsby-peloton-rishi-sunak-trainer-interview-jm05wnsjl",
        "title": "Can <b>Rishi Sunak</b>’s trainer Cody Rigsby make me hot and fit?",
        "description": "He’s the Peloton star with millions of fans — and the man the prime minister turns to for his early-morning endorphin hit. So who is Cody Rigsby? Will Pavia joins his class"
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-to-begin-access-talks-to-prepare-labour-for-government-pdfrstp0l",
        "title": "Keir Starmer to begin ‘access talks’ to prepare Labour for government",
        "description": "The opposition will meet with civil servants at the end of January to lay foundations for a possible victory in the general election"
    },
    {
        "url": "https://www.ibtimes.co.uk/unexpected-surge-uk-inflation-poses-challenges-bank-englands-monetary-policy-1722809",
        "title": "Unexpected Surge in UK Inflation Poses Challenges for Bank of England&#39;s Monetary Policy",
        "description": "The United Kingdom experienced an unexpected rise in inflation to 4.0 per cent in December, marking the first increase in the past 10 months."
    },
    {
        "url": "https://www.bbc.com/news/blogs-the-papers-68026752",
        "title": "Newspaper headlines: Netanyahu &#39;will not accept&#39; Palestinian state and &#39;Nato warns of war&#39;",
        "description": "The papers lead on stories including that the Israeli PM will not accept a Palestinian state after the Gaza war."
    },
    {
        "url": "https://www.thesun.co.uk/news/25413477/rishi-sunak-lords-rwanda-sun-says/",
        "title": "PM is right to warn unelected liberal-left Lords against thwarting Rwanda plan",
        "description": "Uppity house VOTERS overwhelmingly want illegal “small boats” migration ended. Liberal-left peers must not delay or block the only viable plan. Rishi Sunak is right to warn these unelected,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12980991/rishi-sunak-tax-increase-commercial-flights-private-jets.html",
        "title": "<b>Rishi Sunak</b> faces questions after taxes are increased for commercial flights - but not private jets",
        "description": "<b>Rishi Sunak</b> is facing questions over why domestic private jets are to buck a hike in air passenger duty, but commercial passengers will be hit. Details buried in a policy paper show the Government is planning to hike the tax on all domestic flights later ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25414477/rishi-sunak-uk-border-force-officers-sniffer-dogs/",
        "title": "<b>Rishi Sunak</b> meets airport sniffer dog after Border Force stopped record number of drugs entering entering UK",
        "description": "RISHI Sunak meets a team of UK Border Force officers and their sniffer dogs. The PM was seen crouching down and gently stroking an enthusiastic black spaniel as he chatted away with an officer at"
    },
    {
        "url": "https://www.ibtimes.co.uk/sunak-hit-biggest-tory-rebellion-over-rwanda-plan-amendments-1722797",
        "title": "<b>Sunak</b> Hit With Biggest Tory Rebellion Over Rwanda Plan Amendments",
        "description": "Sunak could face a humiliating defeat that could cost the Conservative Party its next general election win if Tory MPs continue to vote for Rwanda policy amendments."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24060182.shipping-chiefs-told-uk-wont-stand-by-red-sea-attacks-continue/",
        "title": "Shipping chiefs told UK ‘won’t stand by’ while Red Sea attacks continue",
        "description": "The UK “won’t stand by” while international shipping is under attack, the Government vowed as Iran-backed Houthi rebels said they would continue targeting vessels – including those from Britain."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/picture/2024/jan/18/ben-jennings-on-rishi-sunaks-plan-to-stop-the-boats-cartoon",
        "title": "Ben Jennings on <b>Rishi Sunak</b>’s plan to ‘stop the boats’ – cartoon",
        "description": "The prime minister is trying to make history, but he’s no Churchill"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/do-not-frustrate-will-of-people-rwanda-rishi-sunak-lords/",
        "title": "Labour leads Lords threat to delay Rwanda treaty",
        "description": "Rishi Sunak has urged the Lords to ‘get on board and do the right thing’ Credit: Chris J Ratcliffe/Bloomberg Peers led by a former Labour attorney general have drawn up a plan that threatens to delay Rishi Sunak’s flagship Rwanda treaty."
    },
    {
        "url": "https://metro.co.uk/2024/01/18/putin-hit-britain-really-hurts-fish-chip-shops-20138896/",
        "title": "Putin to hit Britain where it really hurts – fish and chip shops",
        "description": "Vladimir Putin is preparing to declare a war on Britain’s fishing industry – just days after Rishi Sunak vowed that Ukraine ‘will never be alone’ as he pledged £2.5 billion of military aid. The Kremlin is reported to be ready to terminate a Cold War deal that permits UK boats to fish in the Barents Sea."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/sunak-urges-lords-to-do-the-right-thing-on-rwanda-plan",
        "title": "PM unable to guarantee Rwanda flights will take off before election",
        "description": "Rishi Sunak has urged the House of Lords to approve his Rwanda deportation plan after it was voted through the House of Commons on Wednesday evening. | ITV National News"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/18/low-general-election-turnout-likely-with-dull-as-dishwater-sunak-and-starmer",
        "title": "Low general election turnout likely with ‘dull as dishwater’ <b>Sunak</b> and Starmer",
        "description": "Polling expert says similarity between two main parties and clear Labour lead also likely to suppress voting numbers"
    },
    {
        "url": "https://uk.news.yahoo.com/tobacco-giant-threatened-sunak-legal-210000448.html",
        "title": "Tobacco giant threatened <b>Sunak</b> with legal action over smoking Bill",
        "description": "Tobacco giant Philip Morris threatened legal action in an attempt to block Rishi Sunak’s plans to phase out smoking."
    },
    {
        "url": "https://www.lbc.co.uk/news/jeremy-hunt-hints-at-tax-cuts-ahead-in-march-budget/",
        "title": "Jeremy Hunt hints at tax cuts ahead in March Budget, as he admits voters are &#39;angry&#39;",
        "description": "Jeremy Hunt has hinted that the Budget in March could contain tax cuts, as he said that he would &quot;prioritise economic growth&quot;."
    },
    {
        "url": "https://inews.co.uk/news/home-office-loses-track-of-nearly-6000-asylum-seekers-2862752?ITO=msn",
        "title": "Home Office loses track of nearly 6,000 asylum seekers",
        "description": "Prime Minister <b>Rishi Sunak</b> speaks during a press conference in Downing Street (Photo: Stefan Rousseau/AP) But the ministers confirmed 5,598 (32 per cent) of those asylum seekers “remain in the UK and the Home Office is taking steps to urgently re ..."
    }
]