[
    {
        "url": "https://www.thetimes.co.uk/article/blow-for-sunak-as-turkey-migrant-return-deal-collapses-x9fcjncvz",
        "title": "Blow for <b>Rishi Sunak</b> as Turkey migrant return deal collapses",
        "description": "A key part of Rishi Sunak’s effort to stop the boats has collapsed after Home Office officials declared that Turkey was not a safe country to send migrants back to because of human rights concerns. Ministers hoped to set up a migrant returns deal with Ankara after a surge in the number of Turkish people arriving illegally in Britain by small boat."
    },
    {
        "url": "https://www.ibtimes.co.uk/more-half-undergraduates-use-ai-help-essays-new-study-shows-1723156",
        "title": "More Than Half Of Undergraduates Use AI To Help With Essays, New Study Shows",
        "description": "Many people are excited by its potential to enhance learning and reduce workload, but there is equal concern over a potential epidemic of AI-based cheating."
    },
    {
        "url": "https://www.ibtimes.co.uk/ex-pm-boris-johnson-attacks-rishi-sunaks-new-brexit-deal-1723151",
        "title": "Ex-PM Boris Johnson Attacks <b>Rishi Sunak</b>&#39;s New Brexit Deal",
        "description": "ex-PM Boris Johnson has attacked <b>Rishi Sunak</b>&#39;s new Brexit deal with the DUP, warning that it could force the UK to abide by EU trade rules in the future. This week, <b>Sunak</b> revealed new arrangements to remove routine checks on goods moving from Great Britain ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/former-rochdale-mp-simon-danczuk-28554289",
        "title": "Former Rochdale MP Simon Danczuk is standing in a by-election for his old seat",
        "description": "Former Rochdale MP Simon Danczuk has announced he is seeking to reclaim his old seat in Parliament. The ex-Labour MP will represent Reform UK - the party founded by former UKIP leader Nigel Farage - at the Rochdale by-election later this month."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/government-mps-security-pro-israel-politicians-targeted/",
        "title": "MPs call for protection after being targeted over pro-Israel stance",
        "description": "Rishi Sunak’s parliamentary aide among Conservatives being targeted by pro-Palestinian demonstrators in their constituencies"
    },
    {
        "url": "https://www.thesun.co.uk/news/25664007/harry-cole-imf-bank-of-england/",
        "title": "IMF chief can’t see into future with his broken crystal ball… but he’s far from alone, we have the Bank of England",
        "description": "JEREMY Hunt has gone all Eeyore again on tax cuts. He spent January breaking all usual pre-Budget norms by talking up the prospects of more giveaways in five weeks time – but now the"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-glasgow-west-68172612",
        "title": "Mother of suicide inmate &#39;hopeful&#39; for FAI outcome",
        "description": "The mother of Katie Allan says she has hope for the outcome of the fatal accident inquiry (FAI) into her daughter&#39;s death. Katie Allan, 21, and William Brown, also known as William Lindsay, were both found dead in their cells in separate incidents at Polmont Young Offenders Institution in 2018."
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/01/bank-of-england-keeps-interest-rates-unchanged",
        "title": "Bank of England sticks with 5.25% interest rate but hints at coming cut",
        "description": "Inflation forecast to temporarily fall below 2% in May as policymakers’ vote on base rate splits three ways"
    },
    {
        "url": "https://www.thenational.scot/politics/24091735.alister-jack-deleted-whatsapps---scottish-media-wont-care/",
        "title": "Alister Jack deleted WhatsApps - but the Scottish media won&#39;t care",
        "description": "THE Tories are still obsessed with Nicola Sturgeon&#39;s WhatsApp messages from during the pandemic – anything to deflect attention from the"
    },
    {
        "url": "https://uk.news.yahoo.com/don-t-buy-scottish-secretary-184612890.html",
        "title": "‘I don’t buy it’: Scottish secretary dismisses Sturgeon’s tears at Covid inquiry",
        "description": "A senior Ukrainian Air Force official refused an offer from two Australians to receive 41 of the country’s decommissioned F/A-18 Hornet fighters, bluntly stating that &quot;we do not need your flying trash,&quot; reported the Australian Financial Review on Jan. 30."
    },
    {
        "url": "https://inews.co.uk/opinion/mike-freer-victim-rage-age-2885231?ico=more_from_this_author",
        "title": "Mike Freer is merely another victim of the rage age",
        "description": "Social media is helping to fuel a rise in anxiety, isolation and hate - and young people are especially vulnerable"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/reality-birmingham-under-xl-bully-28550205",
        "title": "Reality in Birmingham under XL Bully ban as people question &#39;is the Government going to kill them now?&#39;",
        "description": "February 1, it is now a crime to own an XL Bully unless exempt - but an estimated 10,000 dogs could be without a certificate across the country"
    },
    {
        "url": "https://inews.co.uk/opinion/business-cant-get-enough-labour-corbyn-2885171?ico=most_popular",
        "title": "Business can’t get enough of Labour – it’s like Corbyn never existed",
        "description": "Smart business leaders don’t want to micromanage every decision; they want political calm, good ministers in post, and to be left alone to run their businesses – this is what Labour offers"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/01/humza-yousaf-scotland-brexit-bonus-northern-ireland-sunak/",
        "title": "Humza Yousaf demands more money for Scotland in wake of Northern Ireland deal",
        "description": "Scotland has questioned the UK Government’s decision to give Northern Ireland £3.3bn in a devolution agreement"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/an-xl-bully-killed-son-32024395",
        "title": "&#39;An XL bully killed my son Jack – <b>Rishi Sunak</b> gave me an award but I&#39;m sceptical about his ban&#39;",
        "description": "The ban on XL Bullies has come into force but a mother whose child Jack Lis was a victim of a brutal dog attack says the rules against dangerous breeds don&#39;t go far enough"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033929/Small-boats-dover-arrivals-soar.html",
        "title": "Number of migrants crossing the Channel is up 13% compared with this time last year, figures show with 1,335 people making journey from France in January",
        "description": "The number of migrants arriving on small boats has jumped by 13 per cent this year compared with 2023, new figures released this afternoon by the Home Office have revealed."
    },
    {
        "url": "https://uk.news.yahoo.com/tory-minister-mike-freer-stand-103941223.html",
        "title": "MPs plead for security help after Tory minister quits over death threats",
        "description": "Justice minister Mike Freer said he had avoided murder “by the skin of my teeth” – as MPs urged the government, their own parties and Commons authorities to do more to ensure proper security protection."
    },
    {
        "url": "https://www.localgov.co.uk/Core-Cities-in-Household-Support-Fund-warning/58785",
        "title": "Core Cities in Household Support Fund warning",
        "description": "Failing to extend the Household Support Fund will be ‘catastrophic for many people in our poorest communities,’ Core Cities has warned Prime Minister Rishi Sunak."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/harriet-harman-urges-party-leaders-to-address-mps-safety",
        "title": "Harriet Harman urges party leaders to address MPs’ safety",
        "description": "Labour MP says Rishi Sunak and Keir Starmer must agree on ensuring election campaign is not marred by threats"
    },
    {
        "url": "https://news.sky.com/story/rachel-reeves-refuses-to-commit-to-labours-28bn-green-investment-pledge-13061410",
        "title": "Rachel Reeves refuses to commit to Labour&#39;s £28bn green investment pledge",
        "description": "Sky News&#39; Beth Rigby asks the shadow chancellor 10 times if the headline policy has been scrapped - but she fails to give a direct answer."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862240/Rachel-Reeves-10-times-28-billion",
        "title": "Rachel Reeves refuses 10 times to say if Labour is sticking with £28 billion green splurge",
        "description": "Rachel Reeves has refused ten times in a single interview to say whether Labour is standing by it’s plan to splurge £28 billion on green investment. The Shadow Chancellor faced a bruising showdown on Sky News, in which Beth Rigby failed to get a firm commitment despite asking again and again."
    },
    {
        "url": "https://www.business-live.co.uk/economic-development/new-plans-electrify-train-lines-28550295",
        "title": "New plans to electrify train lines from Bristol Temple Meads to Parkway, Filton, Bath and Chippenham",
        "description": "New plans to electrify railway lines in the West Country, starting with tracks from Bristol Temple Meads station, have been announced by the region&#39;s metro mayor. Under Dan Norris&#39;s scheme the lines from Bristol Temple Meads from the north via Bristol Parkway and Filton Bank will be electrified."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862202/rishi-sunak-replacement-boris-johnson",
        "title": "<b>Rishi Sunak</b>&#39;s replacement predicted by supercomputer - and its bad news for Boris Johnson",
        "description": "Rishi Sunak’s successor has been predicted by a supercomputer and the result is not good news for the former PM Boris Johnson. In the wake of rumours about internal discord within the Conservative Party, Star Sports has reduced the odds of Kemi Badenoch becoming the party leader to 9/4 from 5/2."
    },
    {
        "url": "https://metro.co.uk/2024/02/01/shoaib-bashir-england-cricketers-visa-denied-20206350/?ico=trending-module_tag_england-cricket_item-3",
        "title": "Shoaib Bashir visa denial explained as England youngster prepares for Test debut against India",
        "description": "Bashir was one of two uncapped spinners in England’s touring party (Picture: Getty) Meanwhile, a spokesperson for Prime Minister <b>Rishi Sunak</b> said the government had been clear that they expect all British citizens to be given fair treatment by India’s ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/reeves-refuses-to-clarify-ps28bn-green-spending-pledge-b1136462.html",
        "title": "Reeves refuses to clarify £28bn green spending pledge",
        "description": "Ms Badenoch, who has been touted by Tory rebels seeking to topple the Prime Minister as a possible successor, added: “By sticking to our plan, <b>Rishi Sunak</b> and the Conservatives are strengthening the economy and the plan is working – with inflation more ..."
    },
    {
        "url": "https://uk.news.yahoo.com/brexit-news-live-boris-johnson-085919411.html",
        "title": "Brexit news - live: Boris Johnson tries to sabotage NI breakthrough as MPs pave way for Stormont return",
        "description": "Former PM – who has repeatedly criticised Mr Sunak since he was kicked out of No 10 – called on his successor to have the ‘courage’ to ditch more Brussels regulations"
    },
    {
        "url": "https://www.thetimes.co.uk/article/unleash-the-royal-buncle-the-princess-of-waless-bad-uncle-gary-is-back-d928c7xzk",
        "title": "Unleash the royal Buncle! The Princess of Wales’s Uncle Gary is back",
        "description": "The Noughties tabloid staple Gary Goldsmith has reportedly been signed for Celebrity Big Brother. Will he go full chaos agent? You better believe it"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13033977/Alarm-bells-Rishi-Sunak-poll-Reform-UK-new-high.html",
        "title": "Alarm bells for <b>Rishi Sunak</b> as poll shows Reform UK hitting new high of 14% support in the Red Wall - and a FIFTH of 2019 Tory voters are backing the Nigel Farage-founded party",
        "description": "Research by Redfield &amp; Wilton Strategies suggested the Nigel Farage-founded party is picking up significant support in the crucial election battleground."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-compares-covid-jab-9071368",
        "title": "Andrew Bridgen compares Covid jab rollout to Post Office scandal",
        "description": "He claimed Prime Minister Tony Blair &#39;misled this house by promoting and endorsing the Post Office Horizon IT system as perfect&#39;"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25661379/rows-of-cabins-set-to-house-migrants-revealed/",
        "title": "Aerial pics show rows of cabins set to house 2,000 asylum seekers on runway at ex-Dambusters HQ once home to Red Arrows",
        "description": "DOZENS of cabins set to house illegal migrants have been erected at a former RAF base in Lincolnshire, once home to the Red Arrows. The cabins at RAF Scampton are set to house 2,000 small boat"
    },
    {
        "url": "https://uk.style.yahoo.com/try-pms-36-hour-fast-161400884.html",
        "title": "Should you try the PM&#39;s 36-hour fast? We ask the experts",
        "description": "PM Rishi Sunak, as well as other celebs such as Jennifer Aniston and Kourtney Kardashian, do intermittent fasting"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68164524",
        "title": "Labour promise not to raise corporation tax if elected",
        "description": "Shadow chancellor Rachel Reeves and party leader Keir Starmer are meeting business leaders at an event in London."
    },
    {
        "url": "https://www.bbc.com/news/business-68164273",
        "title": "Bank of England moving closer to interest rate cut",
        "description": "The Bank of England has held interest rates at 5.25% but has admitted for the first time that it has discussed cutting borrowing costs. It said that it expected inflation - which measures the pace of price rises - to fall much more quickly this year."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/out-area-taxi-working-banned-28552604",
        "title": "Out of area taxi working to be banned if Labour win election, says Andy Burnham",
        "description": "‘Out of area’ taxi working would be banned under Labour, Andy Burnham has said. Mr Burnham, speaking on his regular BBC Radio Manchester ‘in the hot seat’ phone in, also said he had verbal confirmation from Louise Haigh, shadow transport minister, that the practice would be stopped."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13034283/Desmond-Swayne-fly-tippers-garrotted-intestines.html",
        "title": "Ex-minister Sir Desmond Swayne suggests fly-tippers be &#39;garrotted with their own intestines&#39; to cut down on waste dumping",
        "description": "The New Forest West MP told the Common he was not satisfied with the range of financial penalties available and suggested something a little more direct."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/over-one-million-families-to-face-mortgage-hike-ahead-of-november-general-election",
        "title": "Over one million families to face mortgage hike ahead of November General Election",
        "description": "General Election if it is held in November, research commissioned by the Liberal Democrats has revealed. It comes ahead of the Bank of England’s decision on whether to cut interest rates from 5.25% today."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tory-mp-election-threat-mike-freer-b2488691.html",
        "title": "MPs plead for security help after Tory minister quits over death threats",
        "description": "Justice minister Mike Freer said he had avoided murder “by the skin of my teeth” – as MPs urged the government, their own parties and Commons authorities to do more to ensure proper security protection."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/migrants-channel-crossings-uk-asylum-seekers-small-boats-government-migration-b1136406.html",
        "title": "Migrant Channel crossings in January jump 13 per cent compared with 2023",
        "description": "The number of migrants making perilous journeys across the Channel to reach the UK is up by 13 per cent compared to this time last year, new figures show. A total of 1,335 people arrived in the UK after making the journey from France&#39;s shores in January, according to provisional Home Office data. This is compared to 1,180 recorded in January 2023."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/mps-approve-northern-ireland-power-sharing-deal/",
        "title": "MPs approve Northern Ireland power-sharing deal",
        "description": "MPs have approved Rishi Sunak&#39;s plan to revive the power-sharing government in Northern Ireland, despite some unhappiness from unionists in Westminster."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68170566?at_medium=RSS&at_campaign=KARANGA",
        "title": "Has Labour dropped its £28bn green investment plan?",
        "description": "The money is there to fund Labour&#39;s &quot;green prosperity plan&quot;, a suite of their most important plans for government, including a vast programme of retrofitting homes with insulation, battery factories, clean steel plants, and a publicly-owned clean power generation company."
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/health/harrogate-lib-dems-claims-of-gp-services-funding-cuts-spark-new-row-with-towns-mp-4501580",
        "title": "Harrogate Lib Dem&#39;s claims of GP services &#39;funding cuts&#39; spark new row with town&#39;s MP",
        "description": "A bitter row has broken out in Harrogate between the town&#39;s two biggest rivals over pressures on the town&#39;s GP services."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68170890",
        "title": "Badenoch claims media is &#39;trying to fuel gossip&#39;",
        "description": "The business secretary blames the media for reports of a plot for her to replace Rishi Sunak as a “nonsense story”."
    },
    {
        "url": "https://www.standard.co.uk/comment/conscription-uk-army-2024-tik-tok-gen-z-b1136382.html",
        "title": "Conscription for Gen Z? None of us believe enough in the Army, or in the British state, to fight",
        "description": "I’m going to war? For <b>Rishi Sunak</b>? Give yer’ ‘ead a wobble! I’ve got things to do!” So said 23-year-old TikToker Charley Marlowe in a widely shared video she posted to the platform over the weekend. “I’m gay,” she continued, with her ..."
    },
    {
        "url": "https://news.sky.com/video/kemi-badenoch-mp-denies-she-is-in-an-evil-plotters-whatsapp-group-to-topple-rishi-sunak-13061487",
        "title": "Kemi Badenoch MP denies she is in an &#39;evil plotters&#39; WhatsApp group to topple <b>Rishi Sunak</b>",
        "description": "Badenoch says the alleged WhatsApp group is &quot;the media trying to fuel lots of gossip about Westminster&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/be-bold-now-or-risk-a-tory-comeback-starmers-lesson-from-australia-2883214?ITO=msn",
        "title": "Be bold now or risk a Tory comeback – Starmer’s lesson from Australia",
        "description": "Labour&#39;s decision not to risk upsetting bankers by capping their bonuses is the latest example of a safety first pre-election strategy. But Australian politics reveal how that can backfire"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/house-of-commons-government-rishi-sunak-mps-b2488687.html",
        "title": "Fly-tippers should be garrotted with their own intestines, Tory MP says",
        "description": "Fly-tippers should be “garrotted with their own intestines”, a Conservative former minister suggested in the Commons. Sir Desmond Swayne said: “The penalties are insufficient. If offenders were garrotted with their own intestines, there’d be fewer of them.”"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/romesh-ranganathan-trouble-parents-school-153803886.html",
        "title": "Romesh Ranganathan ‘in trouble’ with parents at his children’s school",
        "description": "I do have resting indifferent face, that is the truth.&quot; On Tuesday, This Morning viewers accused Rylan Clark and Rochelle Humes of giving prime minister <b>Rishi Sunak</b> an easy ride when they sat down for a chat with him. Clark and Humes covered topics ranging ..."
    }
]