[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67737116",
        "title": "Laura Kuenssberg: end of year",
        "description": "Rishi Sunak&#39;s hoped for turnaround didn&#39;t happen. Despite several restarts, refreshes, reboots, promises of the &#39;real Rishi&#39; coming out, the prime minister has not been able to shake his party out of the doldrums in the polls."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/shopper-buys-christmas-gifts-rishi-28301715",
        "title": "Shopper buys Christmas gifts for <b>Rishi Sunak</b>&#39;s daughters during PM&#39;s visit to Teesside",
        "description": "Stockton MP Matt Vickers said the gifting happened while the Prime Minister was in Yarm meeting with members of the community on Friday. Mr Sunak visited Strickland and Holt Coffee Shop in Yarm to take questions from business, charities and community leaders in the area."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/rishi-sunak-immigration-laws-uk-365251/",
        "title": "Stop the votes? Just 1 in 10 Brits say <b>Sunak</b> ‘doing a good job’ on immigration",
        "description": "Even 1 in 10 seems high, but nevertheless, these polling figures on immigration are devastating for Rishi Sunak."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/warning-issued-anybody-who-drives-28301802",
        "title": "Warning issued to anybody who drives on smart motorways and it could be fatal",
        "description": "Drivers and motorists have been warned they are THREE TIMES more likely to die or have an injury on smart motorways, which include the likes of the M6 and M1."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12871139/Gary-Lineker-Tucker-Carlson-BBC.html",
        "title": "Gary Lineker is &#39;the Tucker Carlson of the UK&#39; who is &#39;making money out of the gullible&#39;, furious BBC colleagues say after Match of the Day host taunted Grant Shapps and ...",
        "description": "The controversial pundit, 63, has drawn fire from insiders as they claim the broadcaster&#39;s editorial guidelines are fit for purpose."
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-12871223/Millions-waiting-month-GP-patients-heading-overstretched-E-departments-giving-entirely-delays-hit-record-levels-new-figures-show.html",
        "title": "Millions are waiting more than a month to see their GP with many patients heading to overstretched A&amp;E departments or giving up entirely as delays hit record levels, new ...",
        "description": "Some 14.9 million GP appointments took place more than 28 days after being booked in the first ten months of this year."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/rishi-sunak-rome-illegal-migration-093846062.html",
        "title": "<b>Rishi Sunak</b> in Rome for illegal migration talks",
        "description": "Rishi Sunak will hold talks with the leaders of Italy and Albania later during a visit to Rome, where illegal migration is expected to top the agenda."
    },
    {
        "url": "https://www.itv.com/watch/news/rishi-sunak-visits-rome-for-migration-talks-with-far-right-italian-prime-minister/35clg7j",
        "title": "<b>Rishi Sunak</b> visits Rome for migration talks with far-right Italian Prime Minister",
        "description": "Cookie Preferences We use cookies and similar technologies to provide you with our services, measure and improve performance, and customise our marketing campaigns. For more information, see our Cookie Policy."
    },
    {
        "url": "https://leftfootforward.org/2023/12/hilarious-clip-of-rishi-sunaks-lack-of-memory-at-the-covid-inquiry-goes-viral/",
        "title": "Hilarious clip of <b>Rishi Sunak</b>’s lack of memory at the Covid Inquiry goes viral",
        "description": "Rishi Sunak was in the Covid Inquiry hot seat this week, where he was grilled over his controversial ‘Eat Out to Help Out’ discount hospitality scheme. During the six hours of questioning, Sunak insisted the scheme was the ‘right thing to do,’ while arguing his ‘Dr Death’ nickname was not justified."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/rishi-sunak-called-walleys-quarry-8957699",
        "title": "<b>Rishi Sunak</b> called in as &#39;Walleys Quarry smells now stretch as far as two miles&#39;",
        "description": "A council leader has vowed to raise the handling of Walleys Quarry with the Prime Minister - after a recent surge in complaints about foul odours. Simon Tagg is continuing to call for a public inquiry after it emerged hydrogen sulphide emissions had been under-recorded around the Silverdale landfill site."
    },
    {
        "url": "https://www.getsurrey.co.uk/minister-responds-plan-ban-social-28294535",
        "title": "Minister responds on plan to &#39;ban&#39; social media for under 16s",
        "description": "The Government is reported to be considering strict rules that will determine who can use sites like Facebook, TikTok, X and Snapchat"
    },
    {
        "url": "https://www.mirror.co.uk/news/world-news/arm-bosss-chilling-warning-humans-31677945",
        "title": "Arm boss&#39;s chilling warning humans WILL lose control of AI as he demands &#39;override&#39;",
        "description": "Arm Holdings boss Rene Haas has warned humans will lose control of AI as he calls for a &#39;backdoor&#39; to stop the machines taking over the world"
    },
    {
        "url": "https://www.independent.co.uk/voices/rishi-sunak-immigration-small-boats-rwanda-b2464680.html",
        "title": "Think <b>Rishi Sunak</b>’s a moderate, middle of the road Mr Nice Guy? Think again",
        "description": "He masks it with genteel manners and a nice smile, but in any previous Conservative government, even that of Margaret Thatcher, Sunak would have been a token headbanger, writes Sean O’Grady – it’s the party’s lurch to the right that has made the PM seem"
    },
    {
        "url": "https://www.guardian-series.co.uk/news/23972878.rishi-sunaks-plans-phase-cigarette-smoking/",
        "title": "<b>Rishi Sunak</b>&#39;s plans to phase out cigarette smoking",
        "description": "In his column this week, teacher Brett Ellis explains why he against the announcement made by Rishi Sunak to phase out cigarette smoking."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-rome-illegal-migration-albania-b1127380.html",
        "title": "<b>Rishi Sunak</b> in Rome for illegal migration talks with Italy and Albania leaders",
        "description": "The Prime Minister will also make an appearance among at a right-wing political gathering organised by Giorgia Meloni’s party"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0gzx41h",
        "title": "16. <b>Rishi Sunak</b>",
        "description": "Jim Reed takes a look back at this week&#39;s evidence in the Covid Inquiry, as it concludes its second module. The sole witness was Prime Minister Rishi Sunak."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/warning-every-diesel-petrol-car-28301315",
        "title": "Warning to every diesel or petrol car owner over electric vehicle switch",
        "description": "The Guardian newspaper has busted the myths around EVs amid a surge in popularity, and claims motorists and drivers of electric vehicles are finding them cheaper."
    },
    {
        "url": "https://www.politicshome.com/news/article/rishi-sunak-to-take-on-the-right-on-rwanda",
        "title": "<b>Rishi Sunak</b> Realises His &quot;Allies&quot; Are Not To The Right Of Him",
        "description": "Conservative MPs believe Rishi Sunak has decided he can afford to take on the right of his party as he prepares for what is set to be bumpy"
    },
    {
        "url": "https://inews.co.uk/opinion/tory-bad-blood-new-year-still-hope-sunak-2812433?ico=related_stories",
        "title": "Tory bad blood will spill into the new year but there is still hope for <b>Sunak</b>",
        "description": "The sense of relief at having got the Rwanda bill through is palpable, and even this limited win is being seen as victory"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1845992/poll-best-tory-prime-minister",
        "title": "POLL: Who is the best Tory Prime Minister? Vote here",
        "description": "Sir Anthony Eden (1955-1957) - Credited as being a great Foreign Secretary and Churchill&#39;s right-hand man, he is best remembered for the Suez crisis which saw Britain&#39;s influence drop in the world and led to him being replaced as Tory leader and PM while away recovering from health issues."
    },
    {
        "url": "https://inews.co.uk/opinion/johnson-sunak-lost-whatsapps-perhaps-russians-help-2811071",
        "title": "Johnson and <b>Sunak</b> have ‘lost’ their WhatsApps – perhaps the Russians can help",
        "description": "Russian spies have for eight years been making cyber attacks to hack into the emails and other communications of British MPs"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/16/how-rish-sunak-giorgia-meloni-rapport-boost-hard-right-agenda-rome-trip",
        "title": "‘A love-burst’: how <b>Sunak</b> and Meloni’s rapport is boosting hard-right agenda",
        "description": "Rome trip likely to strengthen mutually beneficial relationship forged over views on immigration, defence and Ukraine"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1846039/David-Cameron-Brexit-EU",
        "title": "David Cameron &#39;absolutely cannot be trusted&#39; with Brexit and wants to &#39;drag UK back to EU&#39;",
        "description": "EXCLUSIVE: Lord David Cameron was accused of giving himself a &quot;Brexiteer veneer as thin as varnish&quot; after lavishing praise on the UK&#39;s post-EU trade successes."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-headache-soon-starmer-nightmare-060000903.html",
        "title": "<b>Rishi</b>’s headache will soon be Starmer’s nightmare",
        "description": "It’s no secret that the Labour Party is revelling in the revival of Tory “psychodrama”. They’ve admitted as much."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/23993963.teenage-social-media-ban-considered-rishi-sunak/",
        "title": "Teenage social media ban being considered by <b>Rishi Sunak</b>",
        "description": "The Government wants to review the possible link between social media use and the impact on the mental health of children"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/dups-officer-board-meets-but-hopes-of-a-christmas-deal-fading/a1823330291.html",
        "title": "DUP’s officer board meets but hopes of a Christmas deal fading",
        "description": "The DUP held a secretive crunch meeting of party officers yesterday as hopes of a deal to restore Stormont before Christmas fade."
    },
    {
        "url": "https://www.countytimes.co.uk/news/23991898.opinion-calamitous-month-conservatives/",
        "title": "Opinion: It&#39;s been a calamitous month for the Conservatives",
        "description": "Jane Dodds MS has described the past month as &#39;calamitous&#39; for the Conservatives and Prime Minister Rishi Sunak."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/opinion/columnists/voters-care-about-opportunity-not-pathetic-division-politics-and-culture-wars-justine-greening-4445775",
        "title": "Voters care about opportunity, not pathetic division politics and culture wars - Justine Greening",
        "description": "As we roll the clock forward further, we have a Prime Minister, <b>Rishi Sunak</b>, who failed to even mention levelling up in his October Conference speech. With some opinion polls showing the Conservatives at just 19 per cent, and <b>Rishi Sunak</b>’s personal ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/23992452.darlington-gp-prof-ahmet-fuats-insiders-view-covid-inquiry/",
        "title": "Darlington GP Prof Ahmet Fuat&#39;s insider&#39;s view on the Covid inquiry",
        "description": "AS the Covid inquiry progresses, we are finally hearing much of the truth that was hidden behind government and right wing media lies"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-tory-campaign-questionnaire-b2464963.html",
        "title": "<b>Rishi Sunak</b> accused of misleading public over Tory campaign questionnaire landing on doorsteps",
        "description": "The leaflets, branded potentially misleading and “routine party propaganda”, asks who voters backed at the last election and who they would prefer as prime minister - Sunak or Starmer. It is delivered alongside a letter headed “Rishi Sunak Prime Minister”, which twice asks: “What are your priorities for Britain? Tell the prime minister”."
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/16/are-electric-cars-too-expensive-to-tempt-motorists-away-from-petrol-and-diesel-vehicles",
        "title": "Are electric cars too expensive to tempt motorists away from petrol and diesel vehicles?",
        "description": "In part four of our series exploring myths surrounding EVs, we weigh up the issue of costs"
    },
    {
        "url": "https://www.plymouthherald.co.uk/news/plymouth-news/plymouths-derriford-hospital-longest-ambulance-8977538",
        "title": "Plymouth&#39;s Derriford Hospital has longest ambulance handover waits in England",
        "description": "Latest figures show Plymouth University Hospitals had the highest percentage of hand overs of more than half an hour in the country last week"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/will-rishi-sunak-survive-his-nightmare-after-christmas_uk_657afe9de4b00e36d2d667ef?d_id=7083891&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Will <b>Rishi Sunak</b> Survive His Nightmare After Christmas?",
        "description": "Rishi Sunak could finally allow himself a smile. After days of yet more Tory infighting, and amid mounting speculation about his own future, the government’s flagship Rwanda bill was comfortably passed by the House of Commons."
    },
    {
        "url": "https://www.itv.com/news/2023-12-16/sunak-in-rome-for-illegal-migration-talks",
        "title": "<b>Rishi Sunak</b> in Rome to hold talks with Italy and Albania leaders over illegal migration",
        "description": "<b>Rishi Sunak</b> will hold talks with the leaders of Italy and Albania later during a visit to Rome, where illegal migration is expected to top the agenda. The prime minister will meet Italian premier Giorgia Meloni and Albania’s Edi Rama during the brief ..."
    },
    {
        "url": "https://www.scotsman.com/news/opinion/letters/readers-letters-maybe-its-time-to-bring-back-the-cottage-hospital-4446439",
        "title": "Readers&#39; Letters: Maybe it&#39;s time to bring back the cottage hospital",
        "description": "For all the criticism aimed at <b>Rishi Sunak</b> for his Rwanda scheme, maybe he just understands the need to be seen to do something about this – the whole issue is potentially explosive! John McLaren sets great store on England’s seemingly better Pisa ..."
    },
    {
        "url": "https://www.theguardian.com/lifeandstyle/audio/2023/dec/16/weekend-podcast-taylor-swift-madonna-beyonce-toby-jones-john-crace-sunak-covid-inquiry",
        "title": "Weekend podcast: actor Toby Jones, John Crace on <b>Sunak</b> at the Covid inquiry, and how Taylor Swift gets in shape for her shows",
        "description": "Actor Toby Jones on class, character and the cost of fame; John Crace on Rishi Sunak’s appearance at the Covid inquiry; and the weird world of celebrity training – how Taylor Swift, Beyoncé and Madonn"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-rome-illegal-migration-083529344.html",
        "title": "<b>Rishi Sunak</b> in Rome for illegal migration talks with Italy and Albania leaders",
        "description": "The Prime Minister will also make an appearance among at a right-wing political gathering organised by Giorgia Meloni’s party"
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-falling-short-five-060000250.html",
        "title": "<b>Rishi Sunak</b> Is Falling Short on His Five Pledges to British Voters",
        "description": "Rishi Sunak began 2023 asking UK voters to judge him by five pledges. As the year ends, the prime minister can only claim victory on one, leaving him an uphill battle to deliver ahead of a general election due within 14 months."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-next-general-election-uk-campaign-jn3tgcqk2",
        "title": "<b>Rishi Sunak</b>’s general election campaign will be trial for Starmer",
        "description": "With Labour’s lead in the polls refusing to budge, the prime minister has no choice but to take risks in the hope that something sticks"
    },
    {
        "url": "https://www.thetimes.co.uk/article/airbus-signs-momentous-turkish-airlines-deal-tzjx66bgn",
        "title": "Airbus signs ‘momentous’ Turkish Airlines deal",
        "description": "Rishi Sunak has described an order for 220 Airbus aircraft from Turkish Airlines as a “momentous” deal that could be worth billions of pounds to the UK. The deal, confirmed by the companies on Friday"
    },
    {
        "url": "https://morningstaronline.co.uk/article/safe-passage-for-refugees-is-vital",
        "title": "Safe passage for refugees is vital",
        "description": "This week has once again reminded us of the importance of building opposition to the Tories’ racist offensive, writes Stand Up to Racism’s SAMIRA ALI ahead of Monday’s demo"
    },
    {
        "url": "https://www.thesun.co.uk/news/25072718/rishi-sunak-court-coffee-shop-migration/",
        "title": "<b>Rishi Sunak</b> holds court in coffee shop in North Yorks as he prepares for talks on tackling migration",
        "description": "RISHI Sunak holds court in a coffee shop — as he prepares for talks on tackling migration. The PM was chatting to customers on a visit to Yarm, North Yorks. Today he flies to Rome for meetings"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12870041/Rwanda-Rishi-Sunak-deal-illegal-migrants-Albania.html",
        "title": "After his Rwanda win... is <b>Rishi Sunak</b> now seeking a deal over illegal migrants with Albania?",
        "description": "Rishi Sunak will travel to Rome tomorrow morning for a mini summit on illegal migration with Italian prime minister Giorgia Meloni and her Albanian counterpart Edi Rama."
    },
    {
        "url": "https://www.thesun.co.uk/news/25072603/rishi-sunak-planes-deal-jobs/",
        "title": "<b>Rishi Sunak</b> hails multi-billion pound planes deal that will support thousands of jobs",
        "description": "THE PM yesterday hailed a multi-billion pound planes deal that will support thousands of jobs. The agreement will see Airbus supplying 220 aircraft to Turkish Airlines, with 70 of these planes"
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-67724900",
        "title": "Stormont: DUP officers meet to consider Stormont deal",
        "description": "A meeting of the Democratic Unionist Party&#39;s (DUP) officers took place on Friday as the party considers a potential return to Stormont. The party collapsed the executive 22 months ago in protest against post-Brexit trade arrangements. The DUP has been asking for new legislation to address its concerns."
    },
    {
        "url": "https://metro.co.uk/2023/12/15/kirsty-young-hignfy-panels-stitches-cheeky-innuendo-19983559/?ico=trending-module_author_emily-bashforth_item-6",
        "title": "Kirsty Young has HIGNFY panels in stitches with very cheeky innuendo",
        "description": "Kirsty Young couldn’t resist a racy gag on Have I Got News For You (Picture: BBC) If there’s one TV show where comedy is allowed to push the boundaries, it’s Have I Got News For You. So, Kirsty Young treated viewers to one of her own risqué jokes when she returned as a host on Friday night’s show."
    },
    {
        "url": "https://www.getsurrey.co.uk/news/surrey-news/live-updates-thames-water-faces-28298243",
        "title": "Thames Water faces questions by Surrey locals for first time after thousands left without water - recapped",
        "description": "Thames Water have faced questions from the public after the major incident in November in Guildford and Godalming"
    },
    {
        "url": "https://www.irishnews.com/opinion/message-not-getting-through-at-stormont-newton-emerson-LAUH2JRGD5ETPPVJ6UYJLZOVGQ/",
        "title": "The message doesn’t seem to be getting through at Stormont",
        "description": "The inquiry’s Northern Ireland module also appears to have a predetermined view that Stormont spurned coordination with the Republic. No WhatsApp messages are required to show this is nonsense. Stormont ministers are on public record repeatedly pleading with Dublin for coordination. Irish ministers are on public record repeatedly refusing."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/broken-britain-lost-essential-services-31667904.amp",
        "title": "EXCLUSIVE: &#39;Broken Britain&#39; of lost essential services revealed - how does your area fare?",
        "description": "But the New Britain Project says its findings have exposed those commitments to be a farce, and that <b>Rishi Sunak</b>&#39;s current government doesn&#39;t understand the scale or urgency of the problem. &quot;Despite the psychodrama engulfing the Tory party over Rwanda our ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/labour-enjoys-twice-as-much-support-among-voters-as-the-tories-new-poll-reveals_uk_657c0af8e4b036ecab448944/",
        "title": "Labour Has Twice As Much Support Among Voters As The Tories, New Poll Reveals",
        "description": "Significantly, the poll was carried out in the past week, meaning <b>Rishi Sunak</b> has failed to receive any boost for winning MPs’ support for the general principles of his flagship Rwanda bill. It also shows that the PM’s multiple attempts over the past ..."
    }
]