[
    {
        "url": "https://www.dailymail.co.uk/news/article-13049075/catholic-baptist-church-help-clapham-chemical-attack-abdul-ezedi-asylum-claim.html",
        "title": "Catholic AND Baptist churches helped Clapham chemical attack suspect Abdul Ezedi&#39;s asylum claim - despite him being a convicted sex attacker",
        "description": "Yesterday, asked whether the Government would review how asylum seekers were allowed to stay in Britain after converting to Christianity, Prime Minister <b>Rishi Sunak</b> said: ‘I’ve been very clear that, when it comes to illegal migrants, we need to have a ..."
    },
    {
        "url": "https://www.itv.com/watch/itv-news-at-ten/2a4409/2a4409a2129",
        "title": "Series 8",
        "description": "Family left &#39;devastated&#39; after grandmother killed in Essex dog attack 57 mins ago • <b>Rishi Sunak</b> meets ministers at Stormont as powersharing returns 57 mins ago • <b>Rishi Sunak</b> meets ministers at Stormont as powersharing returns 55 mins ago • Sub ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-looks-shaky-as-he-takes-a-punt-on-rwanda-8nxz8zshf",
        "title": "<b>Rishi Sunak</b> looks shaky as he takes a punt on Rwanda",
        "description": "Repeating a non-answer over and over again until the interviewer just cannot face asking the question any more is the sort of thing they teach you on your first day at Politician School. If, for example, you’re the prime minister, you’re sitting ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68208157?at_campaign_type=owned&at_ptr_name=facebook_page&at_medium=social&at_format=link&at_campaign=Social_Flow&at_bbc_team=editorial&at_link_id=15BE6812-C452-11EE-8386-B3538161DE7E&at_link_type=web_link&at_link_origin=BBC_South",
        "title": "King Charles III diagnosed with cancer, Buckingham Palace says",
        "description": "It is understood his weekly audiences with Prime Minister <b>Rishi Sunak</b> will continue and will be in person, unless doctors advise that he limits such contact. There is a constitutional mechanism for when the head of state is unable to carry out official ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-wished-king-charles-223000473.html",
        "title": "<b>Rishi Sunak</b> has wished King Charles a &#39;full and speedy recovery&#39; from cancer",
        "description": "Fresh off of winning her first-ever Grammy for “Flowers,” Miley Cyrus delivered a spicy performance of the No. 1 hit song during the live telecast. As she danced around the stage Tina Turner style, wearing a sparkling silver dress, Cyrus urged the Grammys audience to show some enthusiasm, saying in between lyrics, “Why are you …"
    },
    {
        "url": "https://www.ibtimes.co.uk/rishi-sunak-accused-giving-vip-access-indian-it-firm-infosys-1723239",
        "title": "<b>Rishi Sunak</b> Accused of Giving &#39;VIP Access&#39; To Indian IT Firm Infosys",
        "description": "A new report has emerged which reveals that the UK trade minister helped Rishi Sunak&#39;s wife-linked Indian IT firm Infosys get better access to trade deals for ease of business in the UK."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24099608.north-east-politicians-react-king-charles-diagnoses/",
        "title": "North East politicians react to King Charles diagnoses",
        "description": "Politicians across the North East have been expressing their good wishes for King Charles after news of his cancer diagnoses. Following treatment for an enlarged prostate, it was discovered that he had cancer."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/rishi-sunak-keir-starmer-hizb-ut-tahrir-proscribe-islam/",
        "title": "<b>Sunak</b> suggests Starmer ‘on side’ of Islamist group and ‘terrorist sympathiser’",
        "description": "Rishi Sunak has said Sir Keir Starmer was “on the side” of a major Islamist group and suggested he was a “terrorist sympathiser”. Asked whether he thought the Labour leade"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/king-charles-cancer-diagnosis-rishi-sunak-wishes-monarch-full-and-speedy-recovery/",
        "title": "King Charles cancer diagnosis: <b>Rishi Sunak</b> wishes monarch &#39;full and speedy recovery&#39;",
        "description": "Rishi Sunak has wished the King a speedy recovery after Buckingham Palace announced he was diagnosed with a form of cancer."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/king-charles-diagnosed-with-cancer-and-has-started-treatment-buckingham-palace-says/",
        "title": "King Charles diagnosed with cancer and has started treatment, Buckingham Palace says",
        "description": "The King has been diagnosed with cancer and has started treatment today, Buckingham Palace has announced. His diagnosis comes following treatment in hospital for an enlarged prostate, although the palace said he does not have prostate cancer. The palace has not confirmed what type of cancer the 75-year-old monarch has."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13048919/why-rishi-sunak-maths-plan-dame-darcey-bussell.html",
        "title": "EDEN CONFIDENTIAL: Why <b>Rishi Sunak</b>&#39;s maths plan is tutu much for Dame Darcey Bussell",
        "description": "Former Strictly Come Dancing judge Dame Darcey Bussell believes children need to study less mathematics, not more."
    },
    {
        "url": "https://www.ibtimes.co.uk/green-party-overtakes-tories-second-most-popular-voters-under-30-1723235",
        "title": "The Green Party Overtakes The Tories As The Second Most Popular For Voters Under 30",
        "description": "A YouGov poll revealed that for voters aged 18 to 24, the Green Party is nine per cent more popular than the Conservative Party and 12 per cent ahead of the Liberal Democrats."
    },
    {
        "url": "https://www.thesun.co.uk/news/25739044/turkey-earthquake-red-crescent-aid-help/",
        "title": "My entire family was wiped out by Turkish earthquake, but thanks to Sun readers I have something to live for",
        "description": "You raised an incredible £1.9million for our emergency appeal for the British Red Cross, backed by the Prince and Princess of Wales and Prime Minister <b>Rishi Sunak</b>. We could hear the screams and tears of the children At a so-called “container city” of ..."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25741289/rishi-sunak-king-charles-cancer-diagnosis/",
        "title": "<b>Rishi Sunak</b> wishes King Charles a ‘full and speedy recovery’ after his cancer diagnosis",
        "description": "RISHI Sunak wished the King “a full and speedy recovery” tonight. The Prime Minister said: “I have no doubt he’ll be back to full strength in no time and I know the whole"
    },
    {
        "url": "https://metro.co.uk/2024/02/05/king-charles-continuing-royal-duties-revealed-amid-cancer-treatment-20229320/?ico=trending-module_tag_cancer_item-1",
        "title": "King Charles has been diagnosed with cancer. How will this affect his royal duties?",
        "description": "Following the breaking news, public figures, celebrities, and politicians sent well wishes to the King. Prime Minister <b>Rishi Sunak</b> said on X: ‘Wishing His Majesty a full and speedy recovery. Charles is remaining ‘wholly positive’ about his treatment ..."
    },
    {
        "url": "https://uk.news.yahoo.com/world-leaders-wish-king-speedy-231121510.html",
        "title": "World leaders wish King speedy recovery as well wishes pour in from politicians",
        "description": "Canadian Prime Minister Justin Trudeau and <b>Rishi Sunak</b> wished Charles well on X. The King has become one of hundreds of thousands of Britons diagnosed with cancer every year."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/out-touch-rishi-sunak-blasted-32052744?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "&#39;Out of touch&#39; <b>Rishi Sunak</b> blasted for £1,000 Rwanda deportations bet with Piers Morgan",
        "description": "<b>Rishi Sunak</b> has been branded &quot;out of touch&quot; for agreeing to a £1,000 bet on whether deportation flights to Rwanda will get going before the election. The Prime Minister shook on the wager after being challenged by Piers Morgan over his crisis-hit plan to ship some asylum seekers to the African country."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-dismisses-calls-referendum-32051208",
        "title": "<b>Rishi Sunak</b> dismisses calls for referendum on united Ireland",
        "description": "Rishi Sunak said delivering &#39;day-to-day things&#39; matter to the public, not &#39;constitutional change&#39; as he was quizzed on remarks by First Minister Michelle O&#39;Neill"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/rishi-sunak-latest-news-rwanda-piers-morgan-stormont/",
        "title": "Politics latest news: <b>Sunak</b> insists Britain could defend itself against Russian attack",
        "description": "Rishi Sunak has shaken hands on a £1,000 bet with Piers Morgan that Rwanda migrant deportation flights will take off before the next general election. Mr Morgan bet the Prime Minister £1,000 to a refugee charity that “you don’t get anybody on those planes before the election”."
    },
    {
        "url": "https://www.newstatesman.com/politics/northern-ireland/2024/02/rishi-sunaks-northern-ireland-victory-rings-hollow",
        "title": "Why Labour should fear a Lib Dem collapse",
        "description": "The Prime Minister has merely resolved problems created by his own party."
    },
    {
        "url": "https://www.itv.com/news/2024-02-05/rishi-sunak-admits-hes-failed-on-promise-to-cut-nhs-waiting-lists",
        "title": "<b>Rishi Sunak</b> admits he has failed on promise to cut NHS waiting lists",
        "description": "The prime minister suggested industrial action had hindered his ability to deliver on the commitment. | ITV National News"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/real-work-starts-now-rishi-sunak-tells-stormont-leaders-99302/",
        "title": "Real work starts now, <b>Rishi Sunak</b> tells Stormont leaders",
        "description": "Prime Minister Rishi Sunak has told Stormont’s leaders the “real work starts now” as he held talks in Belfast after powersharing returned to Northern Ireland. Taoiseach Leo Varadkar, who is also at Stormont to mark the restoration of devolution, said it was a “very positive day”."
    },
    {
        "url": "https://www.thecomet.net/news/national/24096827.northern-ireland-secretary-says-stormont-funding-ample-amid-calls/",
        "title": "Northern Ireland Secretary says Stormont funding is ‘ample’ amid calls for more",
        "description": "Mr Heaton-Harris is joining <b>Rishi Sunak</b> and Irish premier Leo Varadkar in Belfast on Monday to mark the restoration of devolved government. But the newly-formed Executive has already written to the Prime Minister calling for urgent discussions on long-term ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/king-rishi-sunak-privy-council-charles-queen-b1137280.html",
        "title": "Will the King’s state duties change while he is treated for cancer?",
        "description": "He holds a regular audience with the Prime Minister, usually on a Wednesday at Buckingham Palace. This private weekly meeting with <b>Rishi Sunak</b> is expected to continue, and may happen remotely if medics advise the King to reduce in-person contact."
    },
    {
        "url": "https://www.bbc.com/news/live/world-africa-67977510?pinned_post_locator=urn:asset:cf22cdee-6fa1-4dab-bd1a-d3abcb4b3f2d&pinned_post_asset_id=65c0a77057c60b5283ad17dd&pinned_post_type=share",
        "title": "Africa Live: Internet cut amid Senegal protests over poll delay",
        "description": "This is an automated feed overnight and at weekends All times stated are UK By Becky Morton Political reporter Labour and SNP accuse <b>Rishi Sunak</b> of being out of touch, after he appears to accept bet on his Rwanda policy. We&#39;ll be back on Wednesday"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/the-longest-hour-piers-morgans-excruciating-interview-with-rishi-sunak?ref=biztoc.com",
        "title": "The longest hour: Piers Morgan’s excruciating ‘interview’ with <b>Rishi Sunak</b>",
        "description": "Prime minister joined UK Sun God for an exchange of awkward blokey bants, unbased claims and bonfire of vanities"
    },
    {
        "url": "https://www.thedrum.com/tv/video/best-for-britains-naomi-smith-on-modern-campaigns-social-media-shifts-and-the-urgency-of-electoral-reform",
        "title": "Best for Britain&#39;s Naomi Smith on modern campaigns, social media shifts, and the urgency of electoral reform",
        "description": "From her corporate career to leading Best for Britain, Naomi discusses tackling the aftermath of the Brexit referendum and Rishi Sunak&#39;s surprising ranking in an eye-opening Sunday Times Poll"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/warm-relations-among-executive-as-stormont-gets-back-to-business/a1808103318.html",
        "title": "Warm relations among Executive as Stormont gets back to business",
        "description": "It may have been blustery weather up on the hill for the press pack awaiting the politicians’ arrival, but it didn’t match the cordial calmness among the meeting Executive."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68208157",
        "title": "King Charles III diagnosed with cancer, Buckingham Palace says",
        "description": "King Charles has been diagnosed with a form of cancer, says Buckingham Palace. It is not prostate cancer, but was discovered during his recent treatment for an enlarged prostate. The type of cancer has not been revealed, but the palace said the King began &quot;regular treatments&quot; on Monday."
    },
    {
        "url": "https://inews.co.uk/news/king-charles-diagnosed-cancer-2891290?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "King Charles diagnosed with cancer, Buckingham Palace announces",
        "description": "<b>Rishi Sunak</b> posted on X, formerly known as Twitter: “Wishing His Majesty a full and speedy recovery. “I have no doubt he’ll be back to full strength in no time and I know the whole country will be wishing him well.” Labour leader Sir Keir Starmer ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-king-and-pm-to-continue-weekly-audiences-as-concerned-biden-reveals-plans-to-call-12593360",
        "title": "Politics latest: King and PM to continue weekly audiences - as &#39;concerned&#39; Biden reveals plans to call",
        "description": "Our royal correspondent Laura Bundock says he will continue to manage his red boxes and will continue to hold his weekly audiences with Prime Minister <b>Rishi Sunak</b> while undergoing treatment for cancer. Laura also says the King will not be appointing ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/gillian-keegan-declines-to-give-tories-outstanding-ofsted-rating-ffghlhgq7",
        "title": "Gillian Keegan declines to give Tories ‘outstanding’ Ofsted rating",
        "description": "When asked about how she thinks Rishi Sunak’s government is performing the education secretary said that her overall grade for its performance was ‘good’ not ‘inadequate’"
    },
    {
        "url": "https://metro.co.uk/2024/02/05/royals-stand-king-charles-cancer-diagnosis-20229862/?ico=mosaic_tag",
        "title": "Royals who could stand in for King Charles after cancer diagnosis",
        "description": "It is yet unclear if the monarch will entrust anyone with his duties, like his weekly meeting with prime minister <b>Rishi Sunak</b>. There are five ‘counsellors of state’ – Queen Camilla, the Prince of Wales, the Duke of Sussex, the Duke of York and ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863436/rishi-sunak-rwanda-bet-piers-morgan-talk-tv",
        "title": "<b>Rishi Sunak</b> branded a &#39;hypocrite&#39; as he seals £1k Rwanda bet with Piers Morgan on TV",
        "description": "The Prime Minister has shook hands with Piers Morgan - betting £1,000 that Rwanda deportations will begin before the next election."
    },
    {
        "url": "https://news.sky.com/story/king-cancer-diagnosis-latest-he-chose-to-share-diagnosis-to-prevent-speculation-13064923?postid=7186951",
        "title": "King cancer diagnosis latest: He chose to share news to &#39;prevent speculation&#39;; Prince Harry to travel to UK to see father",
        "description": "The King has cancer, Buckingham Palace has disclosed. His diagnosis was made after he was treated at a London hospital for an enlarged prostate, a statement says. The Duke of Sussex is to travel to the UK &quot;in the coming days&quot; to see his father."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24099467.king-diagnosed-cancer-palace-announces/",
        "title": "King diagnosed with cancer, Palace announces",
        "description": "The King has been diagnosed with a form of cancer, Buckingham Palace has announced. The Palace confirmed the disease, which is not prostate cancer, was discovered while the King was being treated in hospital for an enlarged prostate."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/opinion/columnists/sam-mcbride/behind-the-smiling-photos-hints-of-stormonts-continued-dysfunctionality-are-everywhere/a1302481080.html",
        "title": "Behind the smiling photos, hints of Stormont’s continued dysfunctionality are everywhere",
        "description": "On a day like yesterday, Northern Ireland’s problems seemed far away. Smiling photos of Michelle O’Neill, Emma Little Pengelly, Rishi Sunak and Leo Varadkar — and even a warm hug between the new First Minister and the Prime Minister — gave the impression that where once all was broken,"
    },
    {
        "url": "https://www.heraldscotland.com/politics/westminster/24099594.new-stormont-leaders-unite-demand-ni-funding-treasury/?ref=rss",
        "title": "New Stormont leaders unite to demand more NI funding from Treasury",
        "description": "Sinn Fein First Minister Michelle O’Neill and her DUP deputy Emma Little-Pengelly spoke after meeting <b>Rishi Sunak</b> and Irish premier Leo Varadkar at Stormont. The powersharing institutions restarted on Saturday after a two-year suspension caused by the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-keep-bombing-houthis-rules-out-regime-change-war-iran-2891560?ico=related_stories",
        "title": "UK will keep bombing Houthis but rules out regime change or war with Iran",
        "description": "<b>Rishi Sunak</b> denied on Monday that the UK was shifting its position on the Middle East to consider granting recognition to the Palestinian state before a long-term peace deal has been agreed with Israel. Foreign Secretary David Cameron suggested last week ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-wishes-king-speedy-recovery-as-well-wishes-pour-in-from-politicians-109846/",
        "title": "<b>Sunak</b> wishes King ‘speedy recovery’ as well wishes pour in from politicians",
        "description": "Charles has begun a schedule of regular treatments and has been advised to postpone his public-facing duties. Prime Minister <b>Rishi Sunak</b> said on X: “Wishing His Majesty a full and speedy recovery. “I have no doubt he’ll be back to full strength in no ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/king-charles-cancer-buckingham-palace_uk_65c125a2e4b093b2e780825f?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "King Charles Diagnosed With Cancer, Buckingham Palace Says",
        "description": "Prime minister <b>Rishi Sunak</b> tweeted: “Wishing His Majesty a full and speedy recovery. I have no doubt he’ll be back to full strength in no time and I know the whole country will be wishing him well.” Charles departed from royal tradition with his ..."
    },
    {
        "url": "https://leftfootforward.org/2024/02/rishi-sunak-admits-he-has-failed-on-pledge-to-cut-nhs-waiting-lists/",
        "title": "<b>Rishi Sunak</b> admits he has failed on pledge to cut NHS waiting lists",
        "description": "Prime Minister Rishi Sunak has been forced to admit that he has failed to meet his key pledge of cutting NHS waiting lists, as the Tory record of failure continues to grow."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-absolutely-rinsed-tasteless-154707105.html",
        "title": "<b>Rishi Sunak</b> Absolutely Rinsed After &#39;Tasteless Stunt&#39; With Piers Morgan Over Rwanda",
        "description": "Fresh off of winning her first-ever Grammy for “Flowers,” Miley Cyrus delivered a spicy performance of the No. 1 hit song during the live telecast. As she danced around the stage Tina Turner style, wearing a sparkling silver dress, Cyrus urged the Grammys audience to show some enthusiasm, saying in between lyrics, “Why are you …"
    }
]