[
    {
        "url": "https://www.express.co.uk/news/politics/1848541/rishi-sunak-mince-pies-kings-cross-london",
        "title": "<b>Rishi Sunak</b> blasted for buying six boxes of &#39;p***&#39; mince pies for frontline workers",
        "description": "Prime Minister <b>Rishi Sunak</b> was spotted buying boxes of mince pies for frontline workers today in a move which has been branded a &quot;PR stunt.&quot; Mr <b>Sunak</b> was filmed in M&amp;S Food in King’s Cross Station today, where he was seen walking the aisles. He picked ..."
    },
    {
        "url": "https://news.sky.com/story/christmas-travel-latest-heathrow-flights-cancelled-drivers-urged-to-travel-at-specific-times-motorway-pinch-points-revealed-13035524?postid=6961655",
        "title": "Christmas travel latest: &#39;Wet and windy&#39; weather poses further disruption; <b>Rishi Sunak</b> spotted shopping at London station",
        "description": "Prime Minister <b>Rishi Sunak</b> was spotted buying mince pies &#39;for key workers&#39; from an M&amp;S store in Kings Cross station in London; An estimated 13.5 million journeys by car are expected to take place across the UK between today and Christmas Eve on Sunday ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12895363/Falling-inflation-rising-sales-fuel-hope-brighter-year.html",
        "title": "Falling inflation and rising sales fuel hope for a brighter 2024 as experts predict the UK will avoid a recession despite grim figures showing the economy shrank by 0.1% this ...",
        "description": "Revised official data this week showed the UK&#39;s gross domestic product fell 0.1 per cent between July and September, putting the country on the brink of recession."
    },
    {
        "url": "https://www.thetimes.co.uk/article/net-migration-likely-to-rise-before-next-election-7zfvnmg96?ilc=timesradio:morefromthetimes",
        "title": "Net migration likely to rise before next election",
        "description": "Rishi Sunak was warned that net migration is likely to increase before the next election because of a surge in visa applications before the government’s restrictions come into effect in the spring. The Home Office revealed details of the plans to cut immigration by 300,"
    },
    {
        "url": "https://www.thesun.co.uk/news/25147019/rishi-sunak-salary-threshold-uk-family-visa/",
        "title": "The £38,000 salary cap will not come into force until 2025, admits <b>Rishi Sunak</b>",
        "description": "THE £38,000 salary cap will not come into force until 2025, the PM admitted last night. Ministers quietly watered down the hike from £18,000 on Wednesday – sparking anger from Tory MPs. In"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12895099/rishi-sunak-weak-watering-plans-earn.html",
        "title": "<b>Rishi Sunak</b> accused of being &#39;weak&#39; by Tory MPs after watering down plans to crack down on requirements for workers bringing family into Britain",
        "description": "The Prime Minister, who was branded &#39;weak&#39; by his own MPs after the Home Office appeared to water down the policy, said his Government were &#39;doing exactly as we said we were doing it&#39;."
    },
    {
        "url": "https://www.thesun.co.uk/news/25146575/rishi-sunak-challenges-2024-next-election/",
        "title": "From cutting taxes to securing our borders, five missions facing <b>Rishi Sunak</b> in 2024",
        "description": "JUST over 16 years ago a Prime Minister let election speculation get out of control. In summer 2007, the only chat in Westminster was would Gordon Brown go to the country early to wrong-foot the"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/mps-john-hayes-tory-mps-david-jones-prime-minister-b2468560.html",
        "title": "Family visa earnings threshold will not be imposed in full until 2025 – <b>Sunak</b>",
        "description": "Rishi Sunak has said plans to hike the earnings threshold for Britons bringing family members to Britain will not be fully imposed until 2025 after the announcement came under fire."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/22/james-dyson-brexit-sunak-inflation-inflation-growth-economy/",
        "title": "James Dyson: UK must focus on growth not inflation",
        "description": "Businessman praises the policies of Truss and Kwarteng in interview with The Telegraph, as Britain teeters on the brink of recession"
    },
    {
        "url": "https://www.channel4.com/news/uk-could-be-in-recession-after-economy-shrinks",
        "title": "UK could be in recession after economy shrinks",
        "description": "The UK just got closer to falling into an official recession – after new figures showed the economy shrank in the third quarter of the year. Rishi Sunak insisted the country had done better than some European neighbours – but he admitted “of course we want to see more growth”."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/manchester-city-beat-fluminense-4-0-to-win-fifa-club-world-cup/",
        "title": "Manchester City beat Fluminense 4-0 to win FIFA Club World Cup",
        "description": "Manchester City have become the fourth English team to win FIFA&#39;s Club World Cup after a 4-0 win over Brazilian side Fluminense in Saudi Arabia."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-baroness-mone-ppe-labour-government-pandemic-transparency-12593360?postid=6959916",
        "title": "Politics latest: <b>Rishi Sunak</b> questioned about family visa changes after Home Office climbdown",
        "description": "Labour: <b>Sunak</b> backtrack on family visa salary threshold &#39;another example of the tail wagging the dog&#39; Labour&#39;s Lisa Nandy was also asked about <b>Rishi Sunak</b> backtracking on plans to hike the minimum salary requirement for family visas. It emerged last night ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/rishi-sunak-says-family-visa-salary-threshold-will-rise-in-2025-following-anger-from-tory-mps/",
        "title": "<b>Rishi Sunak</b> says family visa salary threshold will rise in 2025 following anger from Tory MPs",
        "description": "Rishi Sunak has said the higher threshold for a family visa will rise in 2025 after he came under fire from Tory MPs for rowing back on plans to introduce it next spring."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/bloke-due-unemployed-this-time-next-year-seen-building-favours-20018452/?ico=trending-post-strip_item_2",
        "title": "Bloke due to be unemployed this time next year spotted building up favours",
        "description": "<b>Rishi Sunak</b> bought a load of mince pies… apparently to hand out to key workers (Picture: PA) There’s nothing like getting yourself in people’s good books when your job is at risk. After all, who knows when you might need to cash in your gestures of ..."
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/22/uk-at-risk-of-recession-after-economy-shrinks-in-third-quarter?ref=upstract.com",
        "title": "New pressure to cut interest rates as UK economy falters and US inflation dips",
        "description": "An assessment that gross domestic product (GDP) fell by 0.1% in the third quarter – down from the previous estimate of no growth – will be a blow to <b>Rishi Sunak</b>, who has promised to get the economy growing as one of his fives pledges to voters before ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/rishi-sunak-announces-earning-threshold-31738183",
        "title": "<b>Rishi Sunak</b> announces earning threshold hike will not come into place until 2025",
        "description": "<b>Rishi Sunak</b> has announced that plans to hike the earnings threshold for bringing family members to Britain will not be fully imposed until 2025 after the announcement came under fire. The Prime Minister said the minimum salary requirement would still be raised to £38,700, but conceded the hike would be &quot;phased&quot; in over the next year, despite anger from some Tory MPs about the rowback."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/michelle-mone-should-be-kicked-out-of-the-house-of-lords-for-good-says-keir-starmer_uk_658042a5e4b0e142c0be99f4?d_id=7105147&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Michelle Mone Should Be Kicked Out Of The House Of Lords, Says Keir Starmer",
        "description": "<b>Rishi Sunak</b> today refused to be drawn on the specifics of the row. He said: “We take all of these things incredibly seriously and that’s why the government is taking legal action. “And because there’s a criminal investigation ongoing I can’t ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/steve-backshall-green-policy-delays-conservative-party-rishi-sunak-0s59qmcqt",
        "title": "Steve Backshall: Green policy delays are a real concern’",
        "description": "The naturalist, best known for presenting Springwatch and Blue Planet Live, said he felt ‘hugely let down’ by Rishi Sunak’s move to postpone policies"
    },
    {
        "url": "https://www.itv.com/news/2023-12-22/mps-are-hopping-mad-anger-from-tory-right-over-family-visa-u-turn",
        "title": "&#39;Lots of MPs are hopping mad&#39;: Anger from Tory right over <b>Sunak</b>&#39;s family visa climbdown",
        "description": "In many ways, this latest u-turn was inevitable. <b>Rishi Sunak</b> admitted last week that the government was looking at &quot;transitional arrangements&quot; following the widespread concern from charities and unions over the impact of the salary changes on British ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0gwfmc6",
        "title": "Dead Ringers - 22nd December",
        "description": "Topical satire, featuring all the people you’d least like to have Christmas dinner with. There are debut appearances from Baroness Mone, Katherine Jenkins and the new Doctor Who, Ncuti Gatwa. Sunak and King Charles give their end of year speeches, and there is a surprise guest on Naked Attraction."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-lancashire-67803952?at_medium=RSS&at_campaign=KARANGA",
        "title": "Huge Lancaster fire burning for weeks finally put out",
        "description": "Earlier this month Prime Minister <b>Rishi Sunak</b> had promised to arrange an urgent meeting after MP Cat Smith said Lancaster County Council had spent £262,000 tackling the blaze. Local officials later agreed fund further emergency works of up to £650,000 to ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/scottish-skipper-among-three-britons-arrested-after-and16396m-of-cocaine-seized-on-boat/",
        "title": "Scottish skipper among three Britons arrested after £96m of cocaine seized on boat",
        "description": "Three Britons, including a skipper from Stornoway, have been arrested after the French navy intercepted a boat where they seized 1.2 tonnes of cocaine worth £96m."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/bloke-due-unemployed-this-time-next-year-seen-building-favours-20018452/?ico=mosaic_home",
        "title": "Bloke due to be unemployed this time next year spotted building up favours",
        "description": "The Labour Party is currently odds-on favourites with the bookies to win the next general election, which is due to take place in 2024, at an average of 1/8."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848508/jeremy-hunt-economy-recession",
        "title": "Jeremy Hunt remains optimistic amid looming economic recession",
        "description": "Revised figures show gross domestic product shrank by 0.1% for July to September after previous estimates indicated growth had flatlined, the Office for National Statistics found."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-refugees-afghan-richmond-prime-minister-mod-north-yorkshire-b1128783.html",
        "title": "<b>Rishi Sunak</b> says Richmond barracks could be used to house Afghan refugees",
        "description": "Rishi Sunak said he hopes to use a military base in his North Yorksire constituency to house Afghan refugees. The Prime Minister on Friday confirmed the Home Office had assessed Catterick Garrison in Richmond as unsuitable for a large asylum facility, following reports first published by the Times."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/22/eat-out-to-help-out-was-bad-for-our-health",
        "title": "‘Eat out to help out’ was bad for our health",
        "description": "We know pandemics are bad for the economy, but <b>Rishi Sunak</b>’s plan to boost spending ignored medical advice, says Michael Clerx. Also letters from Angelique Fairbrass and Bridget MacDonald I was astounded to read Larry Elliott’s suggestion that “Eat ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/22/queen-elizabeth-ii-feared-dying-balmoral-complicate-funeral-20013759/?ico=mosaic_news",
        "title": "Princess Anne reveals the Queen’s fears about dying",
        "description": "Prime Minister <b>Rishi Sunak</b> and close friends, and gives a behind-the-scenes look at rehearsals for the coronation. The past 12 months have been a period of momentous change for Charles who has completed a number of firsts – from carrying out his first ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-says-family-visa-162200462.html",
        "title": "<b>Rishi Sunak</b> says family visa salary threshold will rise in 2025 following anger from Tory MPs",
        "description": "<b>Rishi Sunak</b> paid a visit to the headquarters of Lincolnshire and Nottinghamshire Air Ambulance where he met with emergency workers. It comes as the prime minister said he hopes to use a military base in his constituency to house Afghan refugees after it was reported he had scrapped plans to accommodate asylum seekers on the site."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/23994660.sunak-warns-migrant-threat-uk-italy-agree-fund-tunisia-plan/",
        "title": "<b>Sunak</b> warns of migrant threat as UK and Italy agree to fund Tunisia plan",
        "description": "The UK and Italy will jointly finance a plan to return migrants in Tunisia to their home countries, as Prime Minister <b>Rishi Sunak</b> warned of the threat of migration to “overwhelm” European states. Mr <b>Sunak</b> used a gathering of Italian conservatives and ..."
    }
]