[
    {
        "url": "https://www.mirror.co.uk/news/uk-news/the-loss-young-lives-scourge-31828804",
        "title": "&#39;The loss of young lives is a scourge on society, it will take all of us to win&#39;",
        "description": "Idris Elba has launched the new Don&#39;t Stop Your Future campaign in today&#39;s newspaper and the country could come together to say enough is enough"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12936663/Post-Office-scandal-Prime-Minister-wrongly-accused-postmasters-exonerated.html",
        "title": "Pressure mounts on government to FINALLY compensate victims of Post Office scandal - as Prime Minister hints ALL wrongly accused postmasters will be exonerated",
        "description": "Prime Minister <b>Rishi Sunak</b> raised hopes of a significant breakthrough as he hinted that all sub-postmasters convicted in the fiasco could soon be exonerated. So far, only a fraction have been formally cleared. Justice Secretary Alex Chalk said last night ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/pm-urged-to-order-probe-into-whether-mps-expenses-broke-ministerial-code-K3P65ZQRPFL2TE3ZSK33N6IVLA/",
        "title": "PM urged to order probe into whether MP’s expenses broke ministerial code",
        "description": "Labour said Rishi Sunak’s ethics adviser should look into claims Paul Maynard used his taxpayer-funded constituency office for political campaigning."
    },
    {
        "url": "https://www.thesun.co.uk/news/25278920/rishi-sunak-keir-starmer-no-plan-general-election/",
        "title": "<b>Rishi Sunak</b> slams Keir Starmer as having ‘no plan’ as he kicks off months of general election campaigning",
        "description": "RISHI Sunak will today warn Britain to “stick to the plan” as he kicks off months of general election campaigning. The PM will say Labour leader Sir Keir Starmer will “go back to square one”, with"
    },
    {
        "url": "https://www.newsandstar.co.uk/news/24033244.rishi-sunak-crackdown-numbers-eligible-benefits/",
        "title": "<b>Rishi Sunak</b> to crackdown on numbers eligible for benefits",
        "description": "Prime Minister Rishi Sunak has spoken about cracking down on number of people eligible for benefits while on BBC&#39;s Sunday with Laura Kuenssberg."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-transforms-into-irritable-can-i-finish-jeremy-corbyn-xdkxb0x9h?ilc=timesradio:morefromthetimes",
        "title": "<b>Rishi Sunak</b> transforms into irritable, can-I-finish Corbyn",
        "description": "The prime minister became increasingly annoyed as he was questioned over leaked correspondence about the Rwanda scheme"
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/rishi-sunak-says-government-looking-28405575",
        "title": "<b>Rishi Sunak</b> says government &#39;looking at&#39; exonerating subpostmasters in Horizon scandal",
        "description": "Scotland Yard said on Friday evening that officers are &#39;investigating potential fraud offences arising out of these prosecutions&#39;"
    },
    {
        "url": "https://www.heraldscotland.com/news/24033000.rishi-sunak-says-wants-cut-benefits-pay-tax-cuts/",
        "title": "<b>Rishi Sunak</b> says he wants to cut benefits to pay for tax cuts",
        "description": "Rishi Sunak has been criticised after saying he wants to reduce the eligibility for welfare benefits and shrink the public sector to pay for"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24032989.rishi-sunak-meets-residents-visit-flood-hit-oxford/",
        "title": "<b>Rishi Sunak</b> meets residents during visit to flood-hit Oxford",
        "description": "Rishi Sunak spoke to residents on their doorsteps in Oxford on Sunday before telling Environment Agency (EA) workers during a visit at their depot on Osney Island that “touch wood, we’re past the worst of it”."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/paul-maynard-rishi-sunak-the-sunday-times-ipsa-labour-b1130807.html",
        "title": "PM urged to order probe into whether MP’s expenses broke ministerial code",
        "description": "Labour said Rishi Sunak’s ethics adviser should look into claims Paul Maynard used his taxpayer-funded constituency office for political campaigning."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/parliament-keir-starmer-prime-minister-mps-downing-street-b1130806.html",
        "title": "<b>Sunak</b> vows to ‘continue to confront difficult challenges’ as Parliament returns",
        "description": "A Downing Street source said the Prime Minister was determined to ‘not take the easy way out’ in a year that is likely to see a general election."
    },
    {
        "url": "https://inews.co.uk/news/politics/ministers-flying-blind-economy-sunak-hunt-promise-cut-taxes-2841895",
        "title": "Ministers ‘flying blind’ over economy as <b>Sunak</b> and Hunt promise tax cuts",
        "description": "The Treasury has not received the first draft of the Office for Budget Responsibility&#39;s updated fiscal forecast"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24032989.rishi-sunak-meets-residents-visit-flood-hit-oxford/",
        "title": "<b>Rishi Sunak</b> meets residents during visit to flood-hit Oxford",
        "description": "Rishi Sunak spoke to residents on their doorsteps in Oxford on Sunday before telling Environment Agency (EA) workers during a visit at their depot on Osney Island that “touch wood, we’re past the worst of it”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12935653/Rishi-Sunak-insists-hell-meet-pledge-cut-NHS-waiting-lists-no-strikes-junior-doctors-continue-six-day-walkout.html",
        "title": "<b>Rishi Sunak</b> insists he&#39;ll meet his pledge to cut NHS waiting lists when there are no more strikes as junior doctors continue their six-day walkout",
        "description": "The Prime Minister said he had &#39;confidence&#39; that an end to industrial action would allow him to meet one of his five key promises to voters."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-blasted-selling-nonsense-122124383.html",
        "title": "<b>Rishi Sunak</b> Blasted For &#39;Selling Nonsense&#39; By Former Top Government Adviser",
        "description": "Rishi Sunak has been accused of “selling nonsense” to voters by a former top government adviser. Baronness Casey - who served as the UK’s first Victims Commissioner - said she was “angry and upset” at the prime minister. It came after Sunak gave an interview to BBC’s Sunday with Laura Kuenssberg programme."
    },
    {
        "url": "https://uk.news.yahoo.com/5-key-moments-from-rishi-sunaks-interview-with-laura-kuenssberg-115941721.html",
        "title": "5 key moments from <b>Rishi Sunak</b>&#39;s interview with Laura Kuenssberg",
        "description": "From NHS waiting lists to a potential exodus of Tory MPs, here are the key moments from Rishi Sunak&#39;s BBC interview on Sunday."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-gets-flap-hes-31825344.amp",
        "title": "<b>Rishi Sunak</b> gets in flap as he&#39;s taunted by Mirror Chicken for chickening out of election",
        "description": "The Prime Minister tried to dodge our feathered friend as he arrived at the BBC for an interview with Laura Kuennsberg just days after he chickened out of a general election"
    }
]