[
    {
        "url": "https://inews.co.uk/news/world/uk-us-launch-fresh-missile-strikes-houthis-yemen-2868111?ITO=msn",
        "title": "UK and US forces launch fresh missile strikes on Houthis in Yemen",
        "description": "The strikes were launched in response to an ongoing campaign of Houthi drone and missile attacks on commercial ships in the Red Sea"
    },
    {
        "url": "https://metro.co.uk/2024/01/22/uk-launches-new-round-strikes-houthis-yemen-alongside-us-20156101/?ico=trending-post-strip_item_1",
        "title": "UK launches new round of strikes at Houthis in Yemen alongside US",
        "description": "The US and UK have ramped up joint air strikes against Houthi targets in Yemen, American officials have said. It comes a week after the US and UK launched their first airstrikes on military facilities used by Houthi rebels in Yemen after their attacks on ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/storm-isha-ravages-uk-leaving-thousands-without-power-two-dead-1722910",
        "title": "Storm Isha Ravages UK, Leaving Thousands Without Power And Two Dead",
        "description": "Scotland, Northern Ireland, north-west England, and Wales were particularly hard-hit, with remote areas warned of potential power outages until Tuesday."
    },
    {
        "url": "https://inews.co.uk/news/politics/nhs-bill-cut-10bn-crack-down-waste-labour-2867919",
        "title": "NHS could save £10bn by cracking down on waste Labour claim",
        "description": "Billions of pounds of taxpayers’ money is being wasted or poorly spent by the NHS each year on recruitment agencies, management consultants and archaic pagers, Labour has claimed. Shadow Health Secretary Wes Streeting believes the health service is throwing away around £10bn as a result of poor governance under the Conservatives."
    },
    {
        "url": "https://uk.movies.yahoo.com/us-uk-stage-multiple-airstrikes-213400223.html",
        "title": "US, UK stage multiple airstrikes against Iran-backed Houthi militants in Yemen",
        "description": "The U.S. and U.K. on Monday staged airstrikes against eight targets in Yemen aimed at stopping Iran-backed Houthi militants from attacking ships in the Red Sea. The White House has insisted the retaliatory airstrikes -- seven rounds so far -- have been effective despite repeated Houthi attacks."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/fresh-uk-and-us-airstrikes-on-houthi-targets-deal-another-blow-to-militants-108681/",
        "title": "Fresh UK and US airstrikes on Houthi targets to ‘deal another blow’ to militants",
        "description": "<b>Rishi Sunak</b> and US President Joe Biden spoke on Monday evening, with the two leaders undertaking to “continue efforts alongside international partners to deter and disrupt” attacks by Houthis. In recent days, the US launched seven rounds of airstrikes ..."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/22/middle-east-crisis-live-updates-news-airstrikes-houthi-missile-yemen-biden-sunak-red-sea?page=with:block-65aeef078f0835e980a41a17",
        "title": "Middle East crisis live: UK says airstrikes are in ‘self-defence’ as Pentagon says bombing targeted Houthi underground missile sites",
        "description": "Mohammed Al-Bukhaiti accused the UK and US of neing “perpetrators” to “genocide” in Gaza. UK prime minister <b>Rishi Sunak</b> did not brief Labour leader Keir Starmer or House or Commons speaker Sir Lindsay Hoyle ahead of the strikes. <b>Sunak</b> recieved flak ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/people-tories-conservatives-government-rishi-sunak-b2482632.html",
        "title": "Starmer accuses Tories of ‘waging war on proud spirit of service in country’",
        "description": "The Labour leader said Rishi Sunak’s Conservatives were ‘waging a war on the proud spirit of service in this country’."
    },
    {
        "url": "https://www.cityam.com/rishi-sunaks-former-hedge-fund-sails-past-peers-with-10bn-returns/",
        "title": "<b>Rishi Sunak</b>’s former hedge fund sails past peers with £10bn returns",
        "description": "Billionaire Sir Chris Hohn’s hedge fund TCI, which employed <b>Rishi Sunak</b> in the 2000s, made $12.9bn for investors <b>Rishi Sunak</b>’s former employer The Children’s Investment Fund raked in the biggest returns of any hedge fund globally in 2023 with $12.9bn ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/grant-shapps-houthi-yemen-mod-ministry-of-defence-b1134062.html",
        "title": "Fresh UK and US airstrikes on Houthi targets ‘deal another blow’ to militants",
        "description": "<b>Rishi Sunak</b> and US President Joe Biden had spoken earlier on Monday evening, with a Number 10 readout stating that the two leaders had agreed “continue efforts alongside international partners to deter and disrupt” attacks by the Houthis. A joint ..."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/jan/21/rishi-sunak-facing-renewed-pressure-over-plans-to-max-out-north-sea-oil?share=facebook",
        "title": "<b>Rishi Sunak</b> facing renewed pressure over plans to ‘max out’ North Sea oil",
        "description": "Dithering on renewable energy and insulation will leave people in Britain ‘colder and poorer’, campaigners warn <b>Rishi Sunak</b> is facing further attacks on his plans to expand oil and gas exploration in the North Sea this week. The Offshore Petroleum ..."
    },
    {
        "url": "https://news.sky.com/story/middle-east-crisis-us-uk-launch-strikes-houthi-targets-israel-gaza-hamas-12978800?postid=7111582",
        "title": "Middle East latest: &#39;Multiple&#39; Houthi missile sites targeted in new UK-US attacks; Grant Shapps says strikes launched &#39;in self-defence&#39;",
        "description": "It wasn&#39;t to be so. The Houthis have continued targeting shipping, albeit it at a lower rate than before. Joe Biden and <b>Rishi Sunak</b> spoke on the phone on Monday evening, but the readout gave few clues about the imminent action. The risk has always been ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/houthi-ministry-of-defence-grant-shapps-yemen-joe-biden-b1134062.html",
        "title": "Fresh UK and US airstrikes on Houthi targets to ‘deal another blow’ to militants",
        "description": "Fresh UK and US joint airstrikes against Houthi targets in Yemen have been carried out, the Ministry of Defence has said."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68064422",
        "title": "US and UK launch fresh strikes on Houthis in Yemen",
        "description": "The US and UK have begun joint air strikes against Houthi targets in Yemen, two US defence officials told the BBC&#39;s US partner, CBS News. US fighter jets from the carrier Eisenhower are involved in the strikes, the officials said. US President Joe Biden and UK Prime Minister Rishi Sunak spoke earlier on Monday."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68064422.amp",
        "title": "US and UK launch fresh strikes on Houthis",
        "description": "The US and UK have conducted a fresh series of joint air strikes against eight Houthi targets in Yemen, the Pentagon said. The strikes targeted an underground storage site and Houthi missile and surveillance capability, it said."
    },
    {
        "url": "https://uk.news.yahoo.com/britains-labour-aims-save-billions-223604837.html",
        "title": "Britain&#39;s Labour aims to save billions of pounds with planned health reforms",
        "description": "Britain&#39;s main opposition Labour Party said it would aim to save 10 billion pounds ($12.71 billion) by cutting waste and reforming the health service if in power, saying this could free up cash to spend on frontline care."
    },
    {
        "url": "https://news.sky.com/story/blow-for-rishi-sunak-as-rwanda-plan-suffers-first-defeat-in-house-of-lords-13054210",
        "title": "Blow for <b>Rishi Sunak</b> as Rwanda plan suffers first defeat in House of Lords",
        "description": "Peers voted by 214 to 171 to not ratify the agreement. It is thought to be the first time the Lords has voted against the ratification of a treaty."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/22/us-uk-airstrikes-houthi-yemen-what-we-know-so-far-explainer",
        "title": "US-UK airstrikes on Houthi military sites in Yemen – what we know so far",
        "description": "UK and US military officials say bombing was carried out ‘in self-defence’ and to &quot;‘disrupt and degrade’ group’s capabilities to hit ships in Red Sea"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/22/british-public-paying-more-but-getting-less-nhs-labour/",
        "title": "British public are ‘paying more but getting less’ as NHS ‘wastes £10 billion a year’",
        "description": "“By sticking to the plan that <b>Rishi Sunak</b> has set out, we will strengthen the economy, that’s how you pay for a strong NHS.” Describing Labour’s 2030 energy plan as an “unfunded £28 billion spending spree” which would take the country “right ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/united-states-britain-red-sea-houthis_uk_65aef204e4b09e7f5b9cb822",
        "title": "US And UK Military Launch Fresh Strikes On Houthis In Yemen",
        "description": "WASHINGTON (AP) — The US and British militaries bombed eight locations used by the Iranian-backed Houthis in Yemen on Monday night, the second time the two allies have conducted coordinated retaliatory strikes on an array of the rebels’ missile-launching capabilities."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68059862?at_bbc_team=editorial&at_campaign_type=owned&at_format=link&at_link_id=E1EBB400-B974-11EE-B1B5-CB8ED0B4AF07&at_link_origin=BBCWorld&at_link_type=web_link&at_ptr_na",
        "title": "Rwanda asylum scheme: Peers vote against approving Rwanda treaty",
        "description": "Peers backed a motion calling the government not to ratify the treaty by 214 votes to 171. The motion is not binding on the government. The treaty, signed in December, is central to Rishi Sunak&#39;s scheme to deport asylum seekers to Rwanda but is separate to the Rwanda Safety Bill."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/yemen-mps-rishi-sunak-houthi-joe-biden-b2482942.html",
        "title": "US and UK carry out fresh strikes on Houthis",
        "description": "<b>Rishi Sunak</b> and US President Joe Biden spoke on Monday evening, with the two leaders undertaking to “continue efforts alongside international partners to deter and disrupt” attacks by Houthis. A White House readout of the call said the two leaders ..."
    }
]