[
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/04/british-workers-missing-out-on-10700-a-year-as-living-standards-fall?ref=biztoc.com",
        "title": "British workers missing out on £10,700 a year as living standards fall",
        "description": "<b>Rishi Sunak</b> is preparing for a general election campaign next year with households continuing to come under strain from the cost of living crisis, and the Conservatives facing heavy fire over their economic record after 13 years in government. With the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/chris-packham-challenges-government-net-001154316.html",
        "title": "Chris Packham challenges government for net zero policy delays",
        "description": "The broadcaster Chris Packham has filed a High Court legal challenge to the government against a decision to weaken key climate policies."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/national/23965176.government-pledges-almost-4-billion-improve-rail-links-northern-england/",
        "title": "Government pledges almost £4 billion to improve rail links in northern England",
        "description": "Rail minister Huw Merriman (David Woolfall/UK Parliament) In November, Prime Minister <b>Rishi Sunak</b> said he would “repurpose” the money for the proposed HS2 route to deliver mass transit in Leeds. Rail Minister Huw Merriman said: “The Transpennine ..."
    },
    {
        "url": "https://uk.news.yahoo.com/chris-packham-legal-challenge-against-000100278.html",
        "title": "Chris Packham in legal challenge against Government for weakening green policy",
        "description": "In September, <b>Rishi Sunak</b> announced he would delay the ban on selling new diesel and petrol cars from 2030 to 2035 and that 20% of households will be exempt from a new gas boiler ban among other changes, arguing that he does not want to burden ordinary ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunaks-popularity-plummets-among-tory-party-members_uk_656cf6e6e4b066e398b7d08c?d_id=6938569&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b>&#39;s Popularity Plummets Among Tory Party Members",
        "description": "<b>Rishi</b> Suank’s popularity has plummeted among Tory Party members ... ahead of Penny Mordaunt on 49.8 and Johnny Mercer on 45.4. It means <b>Sunak</b> is currently the least popular member of the cabinet among the Conservative rank-and-file."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1840563/rishi-sunak-david-cameron-body-language",
        "title": "Body language expert on how <b>Rishi Sunak</b> is being upstaged by David Cameron",
        "description": "A body language expert has explained how Prime Minister Rishi Sunak is being upstaged by Foreign Secretary and former Prime Minister David Cameron. Judi James explained how Lord Cameron’s surprise appointment will impact the dynamic between himself and Mr Sunak."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-right-wing-rebellion-smoking-ban-2788175?ico=more_from_News",
        "title": "<b>Rishi Sunak</b> faces a right-wing rebellion over his smoking ban",
        "description": "When <b>Rishi Sunak</b> announced his intention to ban the sale of cigarettes to future generations at the Conservative Party conference, it was immediately attacked by those on his own side. One of the first out of the traps to criticise the proposals was his ..."
    },
    {
        "url": "https://www.theguardian.com/environment/2023/dec/02/rishi-sunak-accused-of-hypocrisy-after-backing-phase-out-of-fossil-fuels-at-cop28",
        "title": "<b>Rishi Sunak</b> accused of hypocrisy after backing phase-out of fossil fuels at Cop28",
        "description": "UK prime minister attacked for inconsistency after allowing more gas and oil exploration in the North Sea <b>Rishi Sunak</b> has been accused of hypocrisy on the international stage after pushing for a phase-out of fossil fuels at the UN Cop28 climate summit in ..."
    },
    {
        "url": "https://www.standard.co.uk/news/environment/chris-packham-government-high-court-uk-government-parliament-b1124507.html",
        "title": "Chris Packham in legal challenge against Government for weakening green policy",
        "description": "Chris Packham has filed a High Court legal challenge to the UK Government for a decision to weaken key climate policies."
    },
    {
        "url": "https://www.thetimes.co.uk/article/your-three-minute-digest-g6b3lmm73",
        "title": "Your three-minute digest",
        "description": "Britain’s weight problem is costing almost £100 billion a year and will scupper Rishi Sunak’s plans to get the sick back to work"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/manchester-government-huw-merriman-england-leeds-b2457800.html",
        "title": "Government pledges almost £4 billion to improve rail links in northern England",
        "description": "In November, Prime Minister <b>Rishi Sunak</b> said he would “repurpose” the money for the proposed HS2 route to deliver mass transit in Leeds. Rail Minister Huw Merriman said: “The Transpennine Route Upgrade represents the first major step in delivering ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/sunak-licence-fee/",
        "title": "<b>Sunak</b> says licence fee may not rise with inflation as he urges more cuts must be made",
        "description": "<b>RIshi Sunak</b> refused to commit to letting the licence fee rise with inflation - as he urged more cuts following a two-year free to the cost of watching TV in the UK. <b>Sunak</b> has said the BBC should be looking to &quot;cut its cloth appropriately&quot; as the country ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/obesity-epidemic-sunak-dimbleby/",
        "title": "Obesity epidemic costs Britain nearly £100bn and will scupper back-to-work push for <b>Sunak</b>",
        "description": "Read More: ‘King Kong’ of weight loss jabs given go-ahead for use in UK in bid to tackle obesity Read More: Millions of unemployed Brits &#39;coasting on the hard work of taxpayers&#39; to lose benefits in back to work shake-up Prime Minister <b>Rishi Sunak</b> plans ..."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-england-leeds-51378137",
        "title": "TV chef Tim <b>Bilton on living with terminal</b> cancer",
        "description": "Yorkshire chef Tim Bilton was making regular TV appearances, including the BBC&#39;s Great British Menu, when he was diagnosed with eye cancer in 2013. He found out the disease was terminal in 2019 after years of treatment."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/04/british-workers-missing-out-on-10700-a-year-as-living-standards-fall",
        "title": "British workers missing out on £10,700 a year as living standards fall",
        "description": "Report by Resolution Foundation and LSE calls for economic strategy rethink after 15 years of relative decline"
    },
    {
        "url": "https://metro.co.uk/2023/12/04/chris-packham-court-challenge-government-weakening-green-policy-19919269/?ico=mosaic_uk",
        "title": "Chris Packham in court to challenge government weakening green policy",
        "description": "He has applied for a judicial review of the government&#39;s decision to ditch the timetable for a number of green policies."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/03/labour-more-trusted-than-tories-to-grow-the-economy/?n=@",
        "title": "Labour more trusted than Tories to grow the economy",
        "description": "Poll findings will come as a major boost to Sir Keir Starmer as he prepares to set out plan to increase national wealth"
    },
    {
        "url": "https://www.thetimes.co.uk/article/sunak-leaves-door-open-to-nigel-farage-joining-tories-3znkb6hfd",
        "title": "<b>Sunak</b> leaves door open to Nigel Farage to join the Tories",
        "description": "<b>Rishi Sunak</b> said his party had “always been a broad church” when asked if he agreed with Stanley Johnson that it was time to let Farage join. Boris Johnson’s father said the Conservatives should “open their arms” to the former Brexit Party leader ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/23965147.sunak-starmer-refuse-commit-pensions-triple-lock-beyond-election/",
        "title": "<b>Sunak</b> and Starmer refuse to commit to pensions triple lock beyond election",
        "description": "<b>Rishi Sunak</b> and Sir Keir Starmer have both refused to commit to maintaining the pensions triple lock beyond the next election, amid growing scepticism over the long-term sustainability of the policy. The Prime Minister stressed that his Government has ..."
    },
    {
        "url": "https://www.thecomet.net/news/national/23965146.bbc-needs-cut-cloth-appropriately-amid-higher-cost-living---sunak/",
        "title": "BBC needs to ‘cut its cloth appropriately’ amid higher cost of living – <b>Sunak</b>",
        "description": "<b>Rishi Sunak</b> has said the BBC should be looking to “cut its cloth appropriately” as the country continues to deal with the heightened cost of living. The corporation is seeking to make £500 million of savings in the face of high inflation and a two ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-tells-bbc-make-cuts-hints-smaller-licence-free-increase-2789598?ITO=msn",
        "title": "<b>Rishi Sunak</b> tells BBC to make cuts as he hints at smaller licence free increase",
        "description": "The BBC must make further cuts and cannot expect a major increase to the licence fee, <b>Rishi Sunak</b> has warned ahead of a review of how much viewers pay. The national broadcaster has announced it is slimming down Newsnight, its flagship TV news show ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rishi-sunak-suggests-more-tax-cuts-are-on-the-way-but-refuses-to-commit-to-triple-lock-manifesto-pledge/",
        "title": "<b>Rishi Sunak</b> suggests more tax cuts are on the way - but refuses to commit to triple lock manifesto pledge",
        "description": "<b>Rishi Sunak</b> has suggested more tax cuts are on the way because the economy has &quot;turned a corner&quot;. The prime minister told reporters that while he would not comment on specifics, trimming taxes was &quot;the direction of travel from this government&quot;. But it came ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/03/ant-dec-dont-want-politicians-im-a-celebrity-19919448/?ico=mosaic_tag",
        "title": "Ant and Dec don’t want any more politicians on I’m a Celebrity",
        "description": "The hosting duo – full names Anthony McPartlin and Declan Donnelly – took part in a fan Q&amp;A on Saturday when they were asked whether fans of the ITV show could ever expect to see Prime Minister <b>Rishi Sunak</b> in the jungle. This year, former MEP Nigel ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/sunak-considers-spending-restraint-allow-220000312.html",
        "title": "<b>Sunak</b> Considers Spending Restraint to Allow for More UK Tax Cuts",
        "description": "(Bloomberg) -- Prime Minister <b>Rishi Sunak</b> linked spending cuts and tax reductions for the first time, making clear the UK government hoped to pay for further tax cuts by controlling its outlays on state services and welfare. Most Read from Bloomberg Alaska ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-britain-labour-andrew-bailey-margaret-thatcher-b1124494.html",
        "title": "Starmer: Labour must be obsessed with growth to turn economy around",
        "description": "Following a cost-of-living crisis and stagnant growth, Sir Keir will use his speech to put forward the argument that “Britain is going backwards” under Prime Minister <b>Rishi Sunak</b>’s stewardship. Growth will have to become Labour’s obsession if we ..."
    }
]