[
    {
        "url": "https://www.dailymail.co.uk/news/article-12987145/Lady-Lola-gets-Covid-clear.html",
        "title": "Lady Lola gets the Covid all-clear",
        "description": "Although the intervening three years have seen a number of fines for lockdown breaches issued to public figures – including Boris Johnson and <b>Rishi Sunak</b> – prosecutors have now decided not to take action against Lady Lola. At the time of the alleged ..."
    },
    {
        "url": "https://www.watfordobserver.co.uk/news/national/24063838.jeremy-hunt-compares-nigel-lawson-promises-tax-cuts/",
        "title": "Jeremy Hunt compares himself to Nigel Lawson as he promises more tax cuts",
        "description": "The Chancellor said he will use his spring Budget to slash taxes in a way that is ‘both affordable and boosts our growth’."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12987315/teacher-illness-switzerland-assisted-suicide-lethal-injection.html",
        "title": "Teacher, 47, with no-diagnosed illness told his family he was visiting a friend but secretly went to Switzerland and paid a clinic £10k to help him kill himself by lethal ...",
        "description": "Labour leader Sir Keir Starmer recently called for MPs to be given a vote on the issue, and Prime Minister <b>Rishi Sunak</b>&#39;s official spokesman said it was &#39;an issue of conscience for individual parliamentarians&#39; to decide on. An investigation by this ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/24062941.rishi-sunak-slams-eastleigh-councils-excessive-debt/",
        "title": "<b>Rishi Sunak</b>&#39;s visit to Hampshire as it happened",
        "description": "Prime Minister <b>Rishi Sunak</b> visited Eastleigh and Winchester during a tour of Hampshire as part of a pre-election campaign. The PM told the Echo that the Liberal Democrat-led Eastleigh Borough Council&#39;s financial state was &quot;very concerning&quot;. It comes ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-addresses-sewage-post-050000589.html",
        "title": "<b>Rishi Sunak</b> addresses sewage, Post Office scandal and council debt in Sussex visit",
        "description": "<b>Rishi Sunak</b> was grilled on issues from sewage spills to the state of council debt during a visit to Sussex. The Prime Minister told The Argus it was “great” to be in Sussex, where he visited Sea Scouts at Shoreham Port and Border Force officers at ..."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-says-more-to-come-on-tax-cuts-in-fresh-hint-at-pre-election-giveaway-13051537?trk=public_post_comment-text",
        "title": "<b>Rishi Sunak</b> says &#39;more to come&#39; on tax cuts in fresh hint at pre-election giveaway",
        "description": "<b>Rishi Sunak</b> said there is &quot;more to come&quot; in terms of tax cuts, in a fresh hint the Tories could offer a pre-election giveaway. The prime minister said he wanted to slash taxes &quot;when we can responsibly do so&quot;, echoing comments made by the chancellor this week."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-67993276.amp?trk=public_post_comment-text",
        "title": "Interest rate cuts still expected despite UK inflation uptick",
        "description": "&quot;Prices are still rising in the shops, with the average weekly shop £110 more than it was before the last general election, and the average family set to be £1,200 worse off under <b>Rishi Sunak</b>&#39;s tax plan,&quot; she said. 1. Make overpayments. If you still have ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/20/horizon-post-office-story-scandal-crisis-fujitsu?ref=biztoc.com",
        "title": "If the Horizon Post Office story is treated as a scandal, nothing will change",
        "description": "So you can perhaps see why <b>Rishi Sunak</b> might be reluctant to sue Fujitsu for compensation for the sub-postmasters whose lives have been wrecked by their flawed system. The truth is that the British state has been hollowed out to the point where it is so ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/jeremy-hunt-compares-himself-to-nigel-lawson-as-he-promises-more-tax-cuts-b1133696.html",
        "title": "Jeremy Hunt compares himself to Nigel Lawson as he promises more tax cuts",
        "description": "The Chancellor said he will use his spring Budget to slash taxes in a way that is ‘both affordable and boosts our growth’."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1858019/HS2-revived-private-finance",
        "title": "Axed HS2 could be brought back to life as secret talks take place",
        "description": "A high-speed network known as Northern Powerhouse Rail is due to reach Stockport, with stops in central Manchester as well as a planned station at the city’s airport. A revived northern leg would be likely to connect these two sections, with track between Stockport and Handsacre."
    },
    {
        "url": "https://www.thesun.co.uk/news/25432820/rishi-sunak-voters-tax-cuts-starmer/",
        "title": "<b>Rishi Sunak</b> warns voters ‘tax cuts with me or tax rises with Keir Starmer’",
        "description": "RISHI Sunak today warns voters that the next election will be a stark choice: “Tax cuts with me or tax rises with Starmer.” The PM and his Chancellor Jeremy Hunt will this week start drawing up"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25432530/tory-mps-defection-talks-reform-uk-richard-tice/",
        "title": "Tory MPs are in secret backchannel talks to switch to Reform, party leader Richard Tice claims",
        "description": "The claims come after a stormy week for <b>Rishi Sunak</b> He suffered his worst rebellion yet over the Rwanda plan and slipped further down in the polls. Mr Tice told The Sun on Sunday: “There is increasing desperation in the Red Wall. “Some Red Wall Tories ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/20/uk-lobbied-white-house-to-lift-houthis-ban/",
        "title": "UK lobbied White House to lift Houthis ban shortly after Joe Biden elected",
        "description": "The Foreign Office joined the United Nations in pressuring Washington to lift severe penalties imposed on the Iran-backed militant group"
    },
    {
        "url": "https://www.thetimes.co.uk/article/lord-advocate-resists-push-to-quash-all-postmaster-convictions-t85c8cwrq",
        "title": "Lord advocate resists push to quash all postmaster convictions",
        "description": "<b>Rishi Sunak</b>, the prime minister, said this month that he would introduce new legislation to exonerate most of the more than 700 people affected by the scandal across the UK. Fergus Ewing, the SNP MSP, has said that Bain should follow the advice of a ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-ministers-block-30m-cash-31928642",
        "title": "Tory ministers block £30m cash that could help Labour mayor reopen northern airport",
        "description": "Local Labour leaders have been working to revive the scuppered Doncaster Sheffield Airport, providing transport in the north a much-needed boost after <b>Rishi Sunak</b> ’s scrapping of HS2. They hoped to use a £30 million cash pot - originally earmarked in ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857953/NHS-poll-redfield-and-wilton-strategies",
        "title": "Shock poll reveals that just one in 10 give the NHS a glowing endorsement",
        "description": "The days when Britons considered the NHS the envy of the world are long gone, according to devastating new polling."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/picture/2024/jan/20/the-rwanda-scheme-falls-into-a-trap-set-by-the-lords-cartoon",
        "title": "The Rwanda scheme falls into a trap set by the Lords – cartoon",
        "description": "The £240m white elephant is halted as peers approve a two-month timetable to scrutinise Rishi Sunak’s bill"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12986647/Jeremy-Hunt-slash-taxes-March-Budget.html",
        "title": "Jeremy Hunt vows to slash taxes in his March 6 Budget to help propel a Conservative election victory - just like did Nigel Lawson in the 1980s",
        "description": "Prime Minister <b>Rishi Sunak</b> has also hailed Lord Lawson as an inspiration for super-charging the country’s entrepreneurial forces. Mr <b>Sunak</b> said on Friday that there would be ‘more to come’ in terms of tax cuts. The FT said that economists estimated ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-boris-tories-labour-poll-election-b2481977.html",
        "title": "<b>Rishi Sunak</b> now more unpopular than Boris Johnson and Jeremy Corbyn",
        "description": "Rishi Sunak is now more unpopular than both Boris Johnson and Jeremy Corbyn at the peak of their unpopularity, a new survey shows. The Conservative PM is struggling to reverse his party’s dire polling fortunes, and his own personal standing with the British public has a hit a new low."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/why-do-we-have-to-fight-life-on-the-israel-lebanon-border-as-missiles-are-sent-back-and-forth/",
        "title": "&#39;Why do we have to fight?&#39;: Life on the Israel-Lebanon border as missiles are sent back and forth",
        "description": "The two Israeli soldiers standing guard at the entrance wave us through the large yellow gates so familiar to Israel&#39;s kibbutzim, and we drive into Sasa, a village high in the western Galilee and a microcosm of Israel&#39;s north."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/20/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next general election? The dates <b>Rishi Sunak</b> is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-hunt-budget-mortgages-deposits-b2481536.html",
        "title": "<b>Sunak</b> considers radical plan for 99% mortgages to help first-time buyers",
        "description": "Exclusive: Treasury discussing bold move to help young Britons onto property ladder with only 1% deposits – but experts warn ‘short-term political fix’ could backfire"
    },
    {
        "url": "https://inews.co.uk/news/sunak-rwanda-bill-dead-cat-sadiq-khan-2865297?ITO=msn",
        "title": "<b>Sunak</b>’s Rwanda bill a ‘dead cat’ distraction strategy, says Sadiq Khan",
        "description": "London Mayor Sadiq Khan has labelled <b>Rishi Sunak</b>’s flagship Rwanda policy a “dead cat” distraction strategy, and said the Labour Party should extoll the benefits of immigration. In comments made at the Fabian Society conference in London on Saturday ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/nigel-farage-could-ambassador-us-113039802.html",
        "title": "Nigel Farage could be ambassador to US if Trump wins, says ex-foreign secretary",
        "description": "Meanwhile, Lord Owen criticised <b>Rishi Sunak</b>’s Rwanda deportation plan – but predicted that the UK would leave the European Convention on Human Rights (ECHR) and the Strasbourg court which oversees the agreement. Asked whether he believes that the UK ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/palestine-protests-across-britain-20-jan/",
        "title": "Rage and radicalism on Britain’s streets as thousands join actions for Palestine",
        "description": "As they marched, people chanted, “Ceasefire now,” and, “Shame on you <b>Rishi Sunak</b>,” “Shame on you Keir Starmer”. Hamza, a Palestinian, told the rally at the end of the march, “We must never lose hope. Every retweet, every post and protest helps."
    },
    {
        "url": "https://www.ft.com/content/beea7f8a-2fa9-4b63-a542-88be231b0266?sharetype=gift",
        "title": "AI heralds the next generation of financial scams",
        "description": "Some of the videos, aimed at a British audience, featured apparent BBC broadcasts, which were deepfakes of prime minister <b>Rishi Sunak</b> extolling the benefits of Quantum AI. While a number of the videos have been removed or are inactive, other accounts ..."
    },
    {
        "url": "https://www.camdennewjournal.co.uk/article/why-is-the-post-office-able-to-bring-criminal-prosecutions",
        "title": "‘Why is the Post Office able to bring criminal prosecutions?&#39;",
        "description": "This week Prime Minister <b>Rishi Sunak</b> said a new law would be introduced so people wrongly convicted in the scandal are “swiftly exonerated and compensation”. Mr Ashraf said: “One of the main problems we have gone through in all of this is that the ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/when-i-stand-up-you-sit-down-commons-speaker-brutally-slaps-down-rishi-sunak_uk_65a7ddfbe4b076abd7a9e0dd?d_id=7196809&ncid_tag=fcbklnkukhpmg00000001",
        "title": "&#39;When I Stand Up, You Sit Down&#39;: Commons Speaker Brutally Slaps Down <b>Rishi Sunak</b>",
        "description": "<b>Rishi Sunak</b> was slapped down by the Commons Speaker on Wednesday after he brandished a “prop” attacking Keir Starmer during PMQs. Lindsay Hoyle told the PM: “When I stand up, please sit down.” The clash came during feisty exchanges between <b>Sunak</b> ..."
    }
]