[
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/06/nottingham-killer-valdo-calocane-entitled-benefits-hospital/",
        "title": "Nottingham killer Valdo Calocane entitled to benefits as he is not in prison",
        "description": "The paranoid schizophrenic can claim up £360 a month after being sent to high-security hospital rather than jail"
    },
    {
        "url": "https://www.huffpost.com/entry/prince-harry-arrives-in-london-after-father-king-charles-iiis-cancer-diagnosis_n_65c250bde4b069b665dceecd",
        "title": "Prince Harry Arrives In London After Father King Charles&#39; Cancer Diagnosis",
        "description": "Buckingham Palace announced Monday evening that the king has begun outpatient treatment for an undisclosed form of cancer."
    },
    {
        "url": "https://www.echo-news.co.uk/news/24101522.leigh-fishmongers-star-michel-roux-discovery-plus-show-thames/",
        "title": "Leigh fishmongers to star in Michel Roux Discovery Plus show on Thames",
        "description": "A FAMILY business will star in a celebrity chef’s new TV show chronicling the food and “fascinating people” along the River Thames,"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863854/inside-king-charles-meeting-prince-harry",
        "title": "Inside King Charles&#39;s chat with Prince Harry as source hails &#39;cause for optimism&#39;",
        "description": "EXCLUSIVE: King Charles and Prince Harry met for a brief 45-minute chat following the monarch&#39;s cancer diagnosis."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/stormont-in-unified-call-for-fair-funding-for-northern-ireland-oneill-4508062",
        "title": "Stormont in unified call for fair funding for Northern Ireland – O’Neill",
        "description": "Stormont has sent a clear, unified call to the Government for fair funding for Northern Ireland, First Minister Michelle O’Neill said."
    },
    {
        "url": "https://inews.co.uk/news/william-take-on-foreign-visits-king-cancer-2893566?ico=most_popular",
        "title": "William could take on key foreign visits as King receives cancer treatment",
        "description": "King Charles returns to Sandringham on Tuesday after a &#39;brief&#39; meeting with Prince Harry after his 11-hour transatlantic dash"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863819/Who-is-mhairi-fraser-tory-candidate-epsom",
        "title": "Mhairi Fraser: Rising star with key role at Liz Truss’s &#39;Popular Conservatives&#39; launch",
        "description": "While well-known MPs spoke at the launch of Liz Truss&#39;s Popular Conservatism event, there was one unknown rising star among the line-up: Mhairi Fraser."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/first-ministers-embrace-of-rishi-sunak-said-to-have-sparked-criticism-of-pm-from-conservative-colleagues-27DSBDFOBJDG5CT5KB5KSZCIAQ/",
        "title": "First minister’s embrace of <b>Rishi Sunak</b> said to have sparked criticism of PM from Conservative colleagues",
        "description": "Former Daily Telegraph assistant editor and chief political correspondent Christopher Hope, who now works as political editor for right wing channel GB News, posted an image to X (formerly Twitter) platform of the two leaders hugging, with the embrace watched by smiling Sinn Féin president Mary Lou McDonald."
    },
    {
        "url": "https://news.sky.com/story/popcons-seek-to-rally-tory-base-as-they-look-to-a-post-election-future-13065575",
        "title": "PopCons seek to rally Tory base as they look to a post-election future",
        "description": "Liz Truss may have been ousted from Number 10 after just 49 days. But she has support from certain Conservative MPs for her ideas to live on."
    },
    {
        "url": "https://www.thenational.scot/politics/24102390.supine-distasteful-rishi-sunak-believes-human-life-cheap/",
        "title": "Supine and distasteful <b>Rishi Sunak</b> believes human life is cheap",
        "description": "And now, the present incumbent Mr <b>Sunak</b> has decided that anything his predecessors can do, he can outdo them in terms of inhumanity and insensitivity laced with a callous lack of genuine empathy. READ MORE: <b>Rishi Sunak</b> responds after £1000 Rwanda bet ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/bury-north-mp-james-daly-28582623",
        "title": "Bury North MP James Daly appointed deputy chair of Conservative Party",
        "description": "Bury North MP James Daly has been appointed a deputy chair of the Conservative Party. The role will focus on ‘campaigning’ as the country prepares for a general election later this year and his party faltering in opinion polls."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-block-labours-bid-scrap-32062701",
        "title": "Tories block Labour&#39;s bid to scrap severance pay-offs for ministers who quit in disgrace",
        "description": "Labour sought to reform the rules after it emerged last month nearly £1million was paid out during the ministerial churn of Boris Johnson and Liz Truss&#39;s chaotic governments"
    },
    {
        "url": "https://www.newsletter.co.uk/news/people/king-charles-seen-in-public-for-first-time-since-cancer-diagnosis-harry-reunited-with-his-father-after-making-transatlantic-dash-4508041",
        "title": "King Charles seen in public for first time since cancer diagnosis; Harry reunited with his father after making transatlantic dash",
        "description": "The King has been seen in public for the first time since his cancer diagnosis as he left Clarence House the day after starting his treatment."
    },
    {
        "url": "https://www.gg2.net/truss-launches-grouping-to-take-tories-more-rightward/",
        "title": "Truss launches grouping to take Tories more rightward",
        "description": "Despite her shortcomings as the prime minister, Liz Truss continues to maintain her presence on the political stage. On Tuesday (6) she launched a new"
    },
    {
        "url": "https://fortune.com/2024/02/06/eu-ai-act-uk-ai-regulation-diverge/",
        "title": "On AI regulation, the EU and the U.K. set wildly divergent courses",
        "description": "British Prime Minister <b>Rishi Sunak</b>, seen here talking to OpenAI CEO Sam Altman, is taking a laid back approach to regulating AI—except when it comes to the one AI danger that doesn&#39;t yet exist. Alastair Grant—WPA Pool/Getty Images Hello and welcome to ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/06/rishi-sunak-accused-of-personally-holding-up-deal-to-end-doctors-strikes",
        "title": "<b>Rishi Sunak</b> accused of personally holding up deal to end doctors’ strikes",
        "description": "Exclusive: Sources say PM has blocked talks due to concerns about knock-on effect of more generous pay offer"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13052059/king-charles-leaves-clarence-house-queen-camilla-return-sandringham.html",
        "title": "Charles arrives at Sandringham after meeting Harry for less than an hour: Smiling King and Camilla leave London for Norfolk by helicopter after monarch spoke to son for 45 ...",
        "description": "Charles and Queen Camilla were seen waving to crowds as they left the royal residence in London in the back of an official car."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/how-greater-manchester-meeting-cancer-28581272",
        "title": "How Greater Manchester is meeting its cancer targets after King&#39;s shock diagnosis",
        "description": "King Charles, who has stepped back from public duties, has started his treatment, Buckingham Palace says, with the cancer having been &#39;caught early&#39; according to the Prime Minister Rishi Sunak."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7191146",
        "title": "Politics latest: Liz Truss &#39;should lose whip&#39; if she doesn&#39;t apologise for &#39;offensive nonsense&#39;",
        "description": "That&#39;s going well then. Of course, I&#39;m sure all these groups would say they&#39;re just trying to help <b>Rishi Sunak</b>, and point him in the right direction. They&#39;ve got his best interests at heart. If you believe that, you&#39;ll believe anything. The race to succeed ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24102185.high-wycombe-residents-react-king-charles-iii-cancer-news/",
        "title": "High Wycombe residents react to King Charles III cancer news",
        "description": "Shoppers in a Buckinghamshire town have expressed their support and solidarity with King Charles III following news of his cancer diagnosis."
    },
    {
        "url": "https://www.bbc.com/news/uk-68219415",
        "title": "Prince William can show his own version of royalty",
        "description": "Prince William seems to promise a modern, relaxed version of royalty. He&#39;s as comfortable with a tie-less monarchy as with ceremonial outfits. Perhaps more so. On visits he can look like a dad at a private-school charity event - wealthy but progressive, driven by a social conscience, with good jeans as well as good genes."
    },
    {
        "url": "https://www.mirror.co.uk/news/royals/king-charles-cancer-health-live-32053891",
        "title": "King Charles LIVE: Monarch seen in public for first time since bombshell cancer diagnosis",
        "description": "King Charles has been seen for the first time since his cancer diagnosis as he waved to crowds in central London. Prince Harry was also pictured back in the UK and on his way to visit his father"
    },
    {
        "url": "https://www.cityam.com/rishi-sunak-appeared-in-deleted-top-jaw-video/",
        "title": "<b>Rishi Sunak</b> appeared in deleted Top Jaw video",
        "description": "Rishi Sunak appeared in a video by social media foodies Top Jaw which was reportedly deleted “within minutes” after a backlash by followers."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/rishi-sunak-crassly-flashed-cash-now-refugees-worse-off-20234793/?ico=metro-posts_housing_whats-trending-now",
        "title": "<b>Rishi Sunak</b> crassly flashed his cash again. Now refugees are worse off",
        "description": "This Government has got so used to gambling with people’s lives that it is now openly doing it on television (Picture: Simon Dawson / No 10 Downing Street) Watching Prime Minister <b>Rishi Sunak</b> shake hands with Piers Morgan on a bet yesterday left me ..."
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24099945.sunak-admits-not-betting-person-amid-criticism-rwanda-wager/",
        "title": "<b>Sunak</b> admits he is ‘not a betting person’ amid criticism over Rwanda wager",
        "description": "<b>Rishi Sunak</b> said he was taken by surprise when he appeared to accept a £1,000 bet over the success of the Government’s Rwanda asylum scheme. The Prime Minister has been criticised over the “depraved” wager with broadcaster Piers Morgan. Mr <b>Sunak</b> ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/susanna-reid-praised-skewering-mel-stride-20231895/?ico=read_full_story_videopage",
        "title": "Susanna Reid praised for ‘skewering’ Tory MP after <b>Rishi Sunak</b>’s Rwanda ‘bet’",
        "description": "Susanna Reid called out Mel Stride (Picture: ITV) Prime Minister <b>Rishi Sunak</b> seemed to take on Piers Morgan’s £1000 bet (Picture: TalkTV) ‘Mr <b>Sunak</b> says he’s not a gambling man either but he shook hands,’ Reid added. That wasn’t all Reid grilled ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-says-hes-not-a-betting-person-he-said-otherwise-just-last-year_uk_65c2071fe4b069b665dcc3bb?d_id=7268691&ncid_tag=fcbklnkukhpmg00000001",
        "title": "<b>Rishi Sunak</b> Says He&#39;s Not A Betting Person – He Said Otherwise Just Last Year",
        "description": "<b>Rishi Sunak</b>’s claim that he is “not a betting person” has been blown apart after comments he previously made about his love of gambling emerged. The prime minister made the claim as he tried to defuse the furious row over his decision to agree a £ ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68214641?at_bbc_team=editorial&at_campaign_type=owned&at_format=link&at_link_id=1829FC18-C4CC-11EE-8313-0D6AD0B4AF07&at_link_origin=BBCWorld&at_link_type=web_link&at_ptr_na",
        "title": "<b>Rishi Sunak</b> says he was taken by surprise on £1,000 Rwanda bet",
        "description": "<b>Rishi Sunak</b> said he was &quot;not a betting person&quot;, but denied it was a mistake after shaking hands with TalkTV&#39;s Piers Morgan that deportation flights would take off before the next election. Speaking on BBC Radio 5 Live, Mr <b>Sunak</b> said he was trying to convey ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/06/rishi-sunak-rows-back-rwanda-bet-piers-morgan?ref=biztoc.com",
        "title": "‘Not a betting person’: <b>Rishi Sunak</b> rows back on £1,000 Rwanda bet",
        "description": "PM says he was ‘taken by surprise’ by Piers Morgan wager, yet he has previously spoken about betting online <b>Rishi Sunak</b> has rowed back on a £1,000 bet with the broadcaster Piers Morgan on whether deportation flights to Rwanda would take off before the ..."
    },
    {
        "url": "https://uk.yahoo.com/news/rishi-sunak-responds-backlash-1000-082406412.html",
        "title": "<b>Rishi Sunak</b> responds after backlash to £1000 Rwanda bet with Piers Morgan",
        "description": "Rishi Sunak has responded after a huge backlash after taking a bet to the Rwanda deportation scheme. The Prime Minister appeared to shake hands on a £1000 wager with TV presenter Piers Morgan about flights carrying asylum seekers to Rwanda taking off before the general election."
    },
    {
        "url": "https://www.thenational.scot/news/24099835.rishi-sunak-responds-1000-rwanda-bet-backlash/",
        "title": "<b>Rishi Sunak</b> responds after £1000 Rwanda bet backlash",
        "description": "Rishi Sunak has responded after a huge backlash after taking a bet to the Rwanda deportation scheme. The Prime Minister appeared to shake hands on a £1000 wager with TV presenter Piers Morgan about flights carrying asylum seekers to Rwanda taking off before the general election."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25741289/rishi-sunak-king-charles-cancer-diagnosis/",
        "title": "<b>Rishi Sunak</b> wishes King Charles a ‘full and speedy recovery’ after his cancer diagnosis",
        "description": "RISHI Sunak wished the King “a full and speedy recovery” tonight. The Prime Minister said: “I have no doubt he’ll be back to full strength in no time and I know the whole"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13050407/Rishi-Sunak-bet-Piers-Morgan-Rwanda-flights-BBC.html",
        "title": "<b>Rishi Sunak</b> squirms over &#39;grotesque&#39; and &#39;out of touch&#39; £1,000 wager with Piers Morgan that Rwanda flights WILL take off before election saying he is &#39;not a betting man&#39; and ...",
        "description": "Rishi Sunak insisted he was &#39;not a betting person&#39; and had been &#39;taken by surprise&#39; when he shook hands with the TalkTV host during an interview."
    },
    {
        "url": "https://uk.yahoo.com/news/rishi-sunak-criticised-making-1-160602528.html",
        "title": "<b>Rishi Sunak</b> says was taken &#39;totally by surprise&#39; when Piers Morgan offered him bet on small boats",
        "description": "<b>Rishi Sunak</b> shook hands on the bet during an interview with the TalkTV host, provoking renewed criticism that the PM is too rich to understand ordinary people&#39;s concerns. &quot;I&#39;m not a betting person and I was taken totally by surprise in the middle of that ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-slammed-underwhelming-response-103439296.html",
        "title": "<b>Rishi Sunak</b> Slammed After Underwhelming Response To Mums Struggling In Cost Of Living Crisis",
        "description": "<b>Rishi Sunak</b>’s response to real-life accounts of poverty was attacked for being too lacklustre on Tuesday. The prime minister was questioned by BBC Radio 5 Live’s Rachel Burden over the ongoing cost of living crisis when his reply to one particular ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/clarence-house-charles-rishi-sunak-buckingham-palace-norfolk-b2491562.html",
        "title": "King seen in public for first time since cancer diagnosis after Harry reunion",
        "description": "He usually has a weekly audience with Prime Minister <b>Rishi Sunak</b> on Wednesday. Mr <b>Sunak</b> has revealed more of Charles’s condition, saying he was thankful the King’s cancer has been “caught early” as he wished him a full recovery. Asked what the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/liz-truss-popcon-popular-conservatism-tories-b2491669.html",
        "title": "What does the launch of Liz Truss’s Popular Conservatism group tell us about the future Tory party?",
        "description": "It is a further blow to <b>Rishi Sunak</b>’s efforts to unite his party ahead of the general election. Popular Conservatism, or PopCon for short, aims to influence the debate on what should be included in the Tory election manifesto. But it will also put down a ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-wished-king-charles-223000473.html",
        "title": "<b>Rishi Sunak</b> has wished King Charles a &#39;full and speedy recovery&#39; from cancer",
        "description": "Fresh off of winning her first-ever Grammy for “Flowers,” Miley Cyrus delivered a spicy performance of the No. 1 hit song during the live telecast. As she danced around the stage Tina Turner style, wearing a sparkling silver dress, Cyrus urged the Grammys audience to show some enthusiasm, saying in between lyrics, “Why are you …"
    },
    {
        "url": "https://www.ft.com/content/26ec70e8-38e6-453e-bc84-6737719b7b6b?sharetype=blocked",
        "title": "Post Office scandal sounds warning on diversity backlash",
        "description": "UK Prime Minister <b>Rishi Sunak</b> has described the decades-long sub-postmaster scandal as one of the “greatest miscarriages of justice” in modern British history. Financial shortfalls in local branches resulted in individuals losing their jobs ..."
    },
    {
        "url": "https://uk.news.yahoo.com/king-charles-spotted-smiling-amid-200000189.html",
        "title": "King Charles spotted smiling amid cancer battle after meeting with Prince Harry",
        "description": "After it was revealed the monarch is battling an undisclosed form of cancer, King Charles was spotted smiling amid his health woes after a short meeting with his son Prince Harry."
    },
    {
        "url": "https://news.sky.com/story/middle-east-israel-gaza-hamas-latest-blog-live-updates-12978800?postid=7191387",
        "title": "Middle East latest: Hamas submit response to proposed ceasefire; Iraq &#39;on a knife edge&#39;",
        "description": "PM meets British families whose loved ones have been taken hostage <b>Rishi Sunak</b> has met with British families whose loved ones have been taken hostage by Hamas. In a statement on X, the prime minister said they were going through &quot;an unthinkable horror&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-68214982",
        "title": "King Charles seen for first time since diagnosis as Prince Harry arrives in the UK",
        "description": "King Charles has been pictured for the first time since his cancer diagnosis was made public as the Duke of Sussex arrived in the UK to visit his father. The King and Queen Camilla were pictured in a car and are now at the royal estate in Sandringham. Prince Harry arrived in London on Tuesday from the US."
    },
    {
        "url": "https://www.lbc.co.uk/news/by-election-tripping-point-tory-disaster-nadine-dorries/",
        "title": "Tories losing next week&#39;s by-election will be &#39;tipping point&#39; for &#39;seismic&#39; election defeat, Nadine Dorries tells LBC",
        "description": "The Tories losing next week&#39;s by-election in Wellingborough will act as a &#39;tipping point&#39; before the party faces a &#39;seismic&#39; electoral wipeout, Nadine Dorries has told LBC."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1863807/Esther-Rantzen-assisted-dying-petition",
        "title": "My assisted dying petition proves Brits are compassionate - now <b>Rishi Sunak</b> must act",
        "description": "If anyone doubts the strength of feeling in our wonderful, compassionate country that the current law on assisted dying is cruel and must be changed, the extraordinary success of our petition is undeniable proof. Some 112,000 signatures in only four weeks ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-believes-government-doing-32062230",
        "title": "<b>Rishi Sunak</b> believes Government doing &#39;outstanding&#39; job even if no one else does",
        "description": "Downing Street says Rishi Sunak believes the Government is doing an &#39;outstanding&#39; job, a day after Education Secretary Gillian Keegan said she&#39;s only rate it as &#39;good&#39;"
    },
    {
        "url": "https://www.cityam.com/truss-warns-of-left-wing-extremists-as-she-seeks-to-galvanise-secret-tories/",
        "title": "Truss warns of ‘left-wing extremists’ as she seeks to galvanise ‘secret Tories’",
        "description": "Liz Truss has hit out at Rishi Sunak for failing to take on “left-wing extremists” she said had gained control of UK institutions."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24101383.barney-norris-named-green-party-candidate-salisbury/",
        "title": "Barney Norris named Green Party candidate for Salisbury",
        "description": "Award-winning writer Barney Norris has been selected as the Green Party’s candidate for Salisbury at the coming General Election."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/a-look-king-charles-health-history-following-cancer-diagnosis-20230895/?ico=trending-module_author_katie-boyden_item-2",
        "title": "King Charles’ health history following news of his cancer diagnosis",
        "description": "Charles, 75, spent the night at home in London on Monday as both he and his doctors remain ‘hugely positive’ over his outlook – as prime minister <b>Rishi Sunak</b> commented that the condition had been ‘caught early’. The king is set to step back from ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/hamas-prime-minister-gaza-rishi-sunak-british-b1137492.html",
        "title": "Prime Minister meets families of Hamas-held hostages",
        "description": "<b>Rishi Sunak</b> has met with families of hostages held by Hamas as he promised to do “all we can” to get the captives held in Gaza released. The Prime Minister met with the sister of one British citizen still being held by Hamas as well as the aunt of ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=true&page=with:block-65c0dd0a8f0887442867e4c5",
        "title": "Labour says <b>Sunak</b>’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "SNP condemns <b>Sunak</b>’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’. This live blog is closed <b>Rishi Sunak</b> has been widely criticised for accepting a £1,000 bet with TalkTV presenter Piers Morgan relating to whether he will manage to ..."
    },
    {
        "url": "https://inews.co.uk/news/william-take-on-foreign-visits-king-cancer-2893566?ico=related_stories",
        "title": "William could take on key foreign visits as King receives cancer treatment",
        "description": "<b>Rishi Sunak</b> had said in an earlier interview that the King’s illness, which has not been specified but is not prostate cancer, had been “caught earl y”. A smiling monarch and his wife left Clarence House some 50 minutes after the Duke of Sussex was ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/almost-20-000-households-in-aberdeenshire-to-receive-final-c-341438/",
        "title": "Almost 20,000 households in Aberdeenshire to receive final cost of living payment",
        "description": "“This payment will be hugely beneficial in helping to support those who need it most. “Prime Minister <b>Rishi Sunak</b> continues to protect the most vulnerable and has delivered on his promise to halve inflation, putting money back in people’s pockets."
    },
    {
        "url": "https://www.irishnews.com/news/uk/prime-minister-meets-families-of-hamas-held-hostages-MUNP22GHUVIKFA6HWIRA5WQVWY/",
        "title": "Prime Minister meets families of Hamas-held hostages",
        "description": "<b>Rishi Sunak</b> has met with families of hostages held by Hamas as he promised to do “all we can” to get the captives held in Gaza released. The Prime Minister met with the sister of one British citizen still being held by Hamas as well as the aunt of ..."
    },
    {
        "url": "https://uk.style.yahoo.com/happen-king-charles-iii-too-164300934.html",
        "title": "What Will Happen If King Charles III Is Too Ill To Work?",
        "description": "Although the specific type of cancer has not yet been announced, the King is reportedly in good spirits and the cancer has been &#39;caught earlier&#39;, according to Prime Minister <b>Rishi Sunak</b>. Naturally, however, there are questions relating to how the royal ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/susanna-reid-praised-skewering-mel-stride-20231895/?ico=more_text_links",
        "title": "Susanna Reid praised for ‘skewering’ Tory MP after <b>Rishi Sunak</b>’s Rwanda ‘bet’",
        "description": "Susanna Reid called out Mel Stride (Picture: ITV) Prime Minister <b>Rishi Sunak</b> seemed to take on Piers Morgan’s £1000 bet (Picture: TalkTV) ‘Mr <b>Sunak</b> says he’s not a gambling man either but he shook hands,’ Reid added. That wasn’t all Reid grilled ..."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/05/electric-cars-ev-demand-tumbles-backlash-high-prices/?utmsource=email",
        "title": "Inside the battle to recharge Britain’s slowing electric car market",
        "description": "When <b>Rishi Sunak</b> delayed the UK’s ban on new petrol car sales, he was at pains to stress it should be consumers, not the Government, who drive the switch to electric vehicles. Yet since his remarks, car industry insiders have become increasingly ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/a-day-of-stops-and-starts-and-clocks-as-stormont-finally-gets-down-to-business/a1723724965.html",
        "title": "A day of stops and starts- and clocks - as Stormont finally gets down to business",
        "description": "Members met to appoint committee chairs, elect the principal deputy speaker and debate the motion around finances, seeking to “endorse” a letter sent to Prime Minister <b>Rishi Sunak</b>. First Minister Michelle O’Neill said Stormont sent a clear and ..."
    },
    {
        "url": "https://royalcentral.co.uk/uk/prime-minister-confirms-that-king-charles-iiis-cancer-was-caught-early-196906/",
        "title": "Prime Minister confirms that King Charles III’s cancer was caught early",
        "description": "The King’s cancer diagnosis caught his illness in the very early stages. As further details of His Majesty’s condition emerged, it was the Prime Minister, <b>Rishi Sunak</b>, who confirmed that Charles III’s cancer was caught very early on. Just hours after ..."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/billionaire-john-caudwell-71-vows-9082437",
        "title": "Billionaire John Caudwell, 71, vows to sign up to Army if UK invaded",
        "description": "National service ended in 1960. <b>Rishi Sunak</b> yesterday insisted the UK would be able to defend itself properly if ussia attacked. On Piers Morgan Uncensored, the PM said his job is &#39;to put the right investment in – which I have done. I did that first as ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/school-and-university-students-walk-out-day-action-gaza-ceasefire",
        "title": "School and university students to walk out in day of action for Gaza ceasefire",
        "description": "“It will be absolutely devastating to those reliant on UNRWA as famine grips Gaza and it&#39;s absolutely impossible to comprehend the cruelty of <b>Rishi Sunak</b> and his ministers.” The school and workers’ strike also coincide with an 18-year-old trapped in ..."
    }
]