[
    {
        "url": "https://www.thisislocallondon.co.uk/indepth/features/24102452.young-reporter-britpop-30-years-wilfred-sutton-mtsn/",
        "title": "Young Reporter Britpop 30 Years On Wilfred Sutton MTSN",
        "description": "Britpop was a 90&#39;s musical movement, centred on Britishness, and producing some of the best alternative rock bands. Britpop was built of the"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/06/marxist-terror-group-kills-one-in-attack-on-istanbul-courth/",
        "title": "Marxist terror group kills one in attack on Istanbul courthouse",
        "description": "Its predecessor, Dev Sol, also attacked a number of US and <b>UK</b> targets in Turkey in the early 1990s ... notes that the organisation has an office in London “engaged in overt <b>political</b> activity.” Authorities say it is unclear why the group decided ..."
    },
    {
        "url": "https://news.sky.com/story/dentists-to-be-offered-cash-incentives-to-treat-nhs-patients-and-work-in-under-served-areas-13065527",
        "title": "Dentists to be offered cash incentives to treat NHS patients and work in under-served areas",
        "description": "<b>Politics</b> Live: Liz Truss accused of &#39;offensive nonsense&#39; However ... The government has been under pressure to publish its NHS dentistry plan amid reports that people in the <b>UK</b> have had to resort to pulling out their own teeth because of a crisis in ..."
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/07/australia-politics-live-army-to-hire-uk-military-helicopters-to-fill-retired-taipan-gap-png-pm-coming-to-canberra?filterKeyEvents=false&page=with:block-65c253838f085a8182392b32",
        "title": "Australia <b>politics</b> live: army to hire <b>UK</b> military helicopters to fill retired Taipan gap; PNG PM coming to Canberra",
        "description": "Follow live"
    },
    {
        "url": "https://inews.co.uk/news/politics/gove-inflation-housebuilding-migration-2893671?ico=most_popular",
        "title": "Gove blames inflation for housebuilding failure and migration for high demand",
        "description": "Mr Gove said that, from 2016, the <b>UK</b> was building more than 200,000 each year and pointed out that “it is important to recognise that we were on an upward curve before the Covid pandemic and the war in Ukraine and the other factors that have hit ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24102421.alister-jacks-conduct-covid-inquiry-came-no-surprise/",
        "title": "Alister Jack&#39;s conduct at the Covid inquiry came as no surprise",
        "description": "Is that what he wanted? Indeed, by all accounts it appears that Mr Jack was an uninspiring, useless specimen of a supportive <b>UK</b> Government politician, and that ties in nicely with his short <b>political</b> career – a little-known financial donor to the ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863819/Who-is-mhairi-fraser-tory-candidate-epsom",
        "title": "Mhairi Fraser: Rising star with key role at Liz Truss’s &#39;Popular Conservatives&#39; launch",
        "description": "While well-known MPs spoke at the launch of Liz Truss&#39;s Popular Conservatism event, there was one unknown rising star among the line-up: Mhairi Fraser."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/national/24102399.us-senate-deal-border-security-ukraine-aid-facing-defeat/",
        "title": "US Senate deal on border security and Ukraine aid facing defeat",
        "description": "A bipartisan Senate deal intended to curb illegal crossings at the US border with Mexico faced almost certain defeat on Tuesday as Senate Republicans signalled their opposition. It will strand US President Joe Biden with no clear way to advance aid for Ukraine through Congress."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/bury-north-mp-james-daly-28582623",
        "title": "Bury North MP James Daly appointed deputy chair of Conservative Party",
        "description": "Bury North MP James Daly has been appointed a deputy chair of the Conservative Party. The role will focus on ‘campaigning’ as the country prepares for a general election later this year and his party faltering in opinion polls."
    },
    {
        "url": "https://www.gg2.net/truss-launches-grouping-to-take-tories-more-rightward/",
        "title": "Truss launches grouping to take Tories more rightward",
        "description": "Despite her shortcomings as the prime minister, Liz Truss continues to maintain her presence on the political stage. On Tuesday (6) she launched a new"
    },
    {
        "url": "https://www.tivysideadvertiser.co.uk/news/national/24102348.government-review-ministers-severance-payouts-rejects-immediate-reform/",
        "title": "Government to review ministers’ severance payouts but rejects immediate reform",
        "description": "The Government has said it will consider reviewing the rules for taxpayer-funded ministerial severance pay, but rejected calls for immediate reform. Cabinet Office minister Esther McVey said the principle of making “reasonable” payments “remains sound” given ministers can be removed at any time,"
    },
    {
        "url": "https://www.itv.com/news/meridian/2024-02-06/you-havent-broken-me-mans-relief-as-sex-offender-who-abused-him-jailed",
        "title": "&#39;You haven&#39;t broken me&#39; - Sussex man&#39;s relief as sex offender who abused him as a child jailed",
        "description": "In 2023, Langrish was arrested after travelling to Poland and brought back to the <b>UK</b>. Last week at Hove Crown Court he was ... Have you heard our new podcast Talking <b>Politics</b>? Every week Tom, Robert and Anushka dig into the biggest issues dominating ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/12008837.women-need-tarzan-touch-in-business-jungle/",
        "title": "Women need Tarzan touch in business jungle",
        "description": "WOMEN managers have to be more macho than their male counterparts to be successful, according to a study which shows that &#39;&#39;caring and"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68217946",
        "title": "Drugs minister Elena Whitham quits due to post-traumatic stress",
        "description": "Drugs and Alcohol Policy Minister Elena Whitham has resigned from the Scottish government for health reasons. The SNP MSP for Carrick, Cumnock and Doon Valley said she was receiving treatment for post-traumatic stress. She said the condition had &quot;greatly&quot; affected her wellbeing."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24100243.former-irish-premier-john-bruton-dies-aged-76/",
        "title": "Former Irish premier John Bruton dies aged 76",
        "description": "Former Irish premier John Bruton has died aged 76 following a long illness, his family has confirmed. Former Irish premier John Bruton has died aged 76 following a long illness, his family has confirmed. Mr Bruton was taoiseach from 1994 until 1997, and the leader of Fine Gael from 1990 to 2001."
    },
    {
        "url": "https://www.irishnews.com/news/ireland/former-taoiseach-john-bruton-remembered-for-sensitivity-and-generous-approach-42U5RONM65GL7CHBAAPAQBEUPI/",
        "title": "Former taoiseach John Bruton remembered for ‘sensitivity and generous approach’",
        "description": "Former taoiseach John Bruton, who has died aged 76, has been remembered for bringing a “particular sensitivity and a generous approach” to the peace process. President Michael D Higgins, who served alongside the former Fine Gael leader in the Dáil and in cabinet, described him as a “deeply committed politician”."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-africa-68214750.amp",
        "title": "Ethiopia&#39;s PM Abiy Ahmed says his country does not wish harm on Somalia",
        "description": "His comments in parliament came after Somalia accused landlocked Ethiopia of trying to annex part of its territory to gain access to the sea. Last month, Ethiopia struck a controversial deal with the breakaway republic of Somaliland."
    },
    {
        "url": "https://www.journalism.co.uk/news/building-trust-during-2024-elections-with-liveblogging-and-fact-checking/s2/a1112971/",
        "title": "Building trust during 2024 elections with live-blogging and fact-checking",
        "description": "Voters are heading to the ballot box at a time when they are turning away from the news. How do publishers give them reliable and accurate information?"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1863825/esther-rantzen-assisted-dying-huge-victory",
        "title": "Dame Esther Rantzen hails &#39;undeniable proof&#39; Brits back assisted dying after huge victory",
        "description": "Since revealing she had signed up to Swiss suicide clinic Dignitas, Dame Esther has been inundated with messages from tens of thousands of people, some who lost sick loved ones in unimaginably cruel ways and others who, like her, simply want the right to end their lives as they see fit."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24092646.new-local-bobbies-romsey/",
        "title": "Who are your new local bobbies in Romsey?",
        "description": "Romsey and surrounding areas have been assigned new neighbourhood police officers - who are your local bobbies?"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/scottish-government-drugs-minister-elena-32062744",
        "title": "Scottish Government drugs minister Elena Whitham resigns for health reasons",
        "description": "The Scottish Government’s drugs and alcohol policy minister Elena Whitham has resigned for health reasons. The SNP minister said that over the last year she had “experienced a series of events leading to post traumatic stress”. She was appointed to her current role in Humza Yousaf’s Government in March last year."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/operation-menai-bridge-what-happens-9081871",
        "title": "Operation Menai Bridge: What happens when King Charles III dies?",
        "description": "The same protocol is now in place for King Charles III, who was the oldest British monarch at a coronation. Codenamed Operation Menai Bridge, the protocol for when Charles dies outlines the steps to be taken during the official period of mourning, the way his death will be announced publicly and the details of his funeral."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/dads-shock-diagnosis-mended-relationship-hope-happens-harry-charles-20234556/?ico=mosaic_health",
        "title": "My dad’s shock diagnosis mended our relationship. I hope the same happens for Harry and Charles",
        "description": "But Harry is also simply a son who has pursued a life that his father can’t really understand, and their very human generational differences, tricky in-law <b>politics</b> and awkward ... by emailing jess.austin@metro.co.<b>uk</b>."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24099945.sunak-admits-not-betting-person-amid-criticism-rwanda-wager/",
        "title": "Sunak admits he is ‘not a betting person’ amid criticism over Rwanda wager",
        "description": "Rishi Sunak shook hands on a £1,000 wager with broadcaster Piers Morgan about flights to Rwanda leaving before the election."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-rumoured-new-book-32060961",
        "title": "Prince Harry&#39;s rumoured new book will cast a shadow over already dark family reunion",
        "description": "Prince Harry released his explosive memoir Spare last year, and there have been reports of a follow-up to the controversial book, which made allegations against his estranged family"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?page=with:block-65c267948f085a8182392c71",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – <b>UK politics</b> live",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://metro.co.uk/2024/02/06/taylor-swift-dont-understand-hype-missing-20234354/?ico=trending-post-strip_item_2",
        "title": "I don’t understand the extreme Taylor Swift hype",
        "description": "It’s impressive that one popstar yields that much power over the world but, out of all the singers out there, is Taylor really the one who warrants the level of obsession that swamps her to the point that presidents, embassies and entire football leagues are brought into the conversation?"
    },
    {
        "url": "https://www.scotsman.com/news/politics/popular-conservatives-who-are-the-new-tory-group-launched-by-liz-truss-what-do-the-popcons-stand-for-key-figures-including-jacob-rees-mogg-4507479",
        "title": "Popular Conservatives: Who are the new Tory group launched by Liz Truss? What do the &#39;PopCons&#39; stand for? Key figures, including Jacob Rees-Mogg",
        "description": "Led by former prime minister Liz Truss, the Popular Conservatives group is hoping to influence Government policy."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68219261",
        "title": "Britain ‘full of secret Conservatives’ - Liz Truss",
        "description": "Launching the Popular Conservative (PopCon) group, the former PM says that &quot;democracy has become unfashionable&quot;."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-concerns-over-stay-32057389.amp",
        "title": "Prince Harry concerns over where to stay after King Charles denied use of Windsor Castle",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA ... Harry suffered embarrassment in September last year when he travelled to the <b>UK</b> to attend the Well Child Awards, and reportedly asked his father if he could stay at Windsor Castle ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/whats-on/food-drink-news/michelin-star-success-north-east-28579387",
        "title": "Michelin star success for North East restaurants as awards are announced",
        "description": "For the full list of Michelin star awards across the <b>UK</b> and Ireland see the Michelin Guide website here. ChronicleLive is now on WhatsApp and we want you to join our communities. We have a number of communities to join, so you can choose which one you want ..."
    },
    {
        "url": "https://www.lbc.co.uk/opinion/views/government-needs-a-buoyant-private-sector-to-improve-public-services/",
        "title": "The government needs a buoyant private sector to improve public services and fix the NHS",
        "description": "Most people in the UK will be very surprised if a Labour administration is not returned at the next General Election, whenever it is held."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/welcome-week-peak-taylor-swift-162057862.html",
        "title": "Welcome to the week of peak Taylor Swift, from the Grammys to Tokyo shows to the Super Bowl",
        "description": "This is Taylor Swift&#39;s week. It&#39;s hard to remember a star of Swift &#39;s stature straddling so many roles, spanning so much of the globe, covering so many corners of the culture and doing so much of it in the spotlight she will have between Sunday&#39;s Grammy Awards and the coming Sunday&#39;s Super Bowl — with four Tokyo concerts in between."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863801/lee-anderson-popular-conservatism-liz-truss-tory-party-latest",
        "title": "Lee Anderson got &#39;a two-word answer&#39; when he explained how to reduce energy bills",
        "description": "Lee Anderson raged about how politicians in Westminster do not lie awake about the things which give ordinary voters sleepless nights."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24101022.truss-warns-left-wing-extremists-seeks-galvanise-secret-tories/",
        "title": "Truss warns of ‘left-wing extremists’ as she seeks to galvanise ‘secret Tories’",
        "description": "The former prime minister told the Popular Conservatism launch event that ordinary Britons thought ‘the wokery that’s going on is nonsense’."
    },
    {
        "url": "https://news.sky.com/story/nigel-farage-conservatives-facing-extinction-event-and-hes-aiming-to-replace-them-13065400",
        "title": "Nigel Farage: Conservatives facing &#39;extinction event&#39; and he&#39;s aiming to replace them",
        "description": "The Reform Party politician spoke at the Conservatives&#39; PopCon event about what he thinks will happen after the next election and ruled out joining the Tories. Sir Jacob Rees-Mogg, meanwhile, described his party as the &quot;Duracell bunny of political life&quot;."
    },
    {
        "url": "https://www.mirror.co.uk/money/new-home-registrations-fell-44-32061711",
        "title": "New home registrations fell by 44% last year, according to latest industry data",
        "description": "Industry figures reveal that new home registrations saw a steep drop of 44% in 2023 compared to the previous year."
    },
    {
        "url": "https://uk.news.yahoo.com/fuel-poverty-government-support-dries-155110916.html",
        "title": "Fuel poverty: as government support dries up, communities are taking action",
        "description": "Soaring heating expenses, stagnating or declining wages and poorly maintained housing have marred millions of lives with debt and poor health. Estimates suggest that 10% of excess winter deaths are directly attributable to fuel poverty and 21.5% to cold homes."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68218299",
        "title": "Liz Truss targets &#39;secret Tories&#39; with new campaign",
        "description": "Liz Truss is back. The former prime minister has launched a campaign to &quot;galvanize&quot; Britain&#39;s &quot;secret Conservatives&quot; and fight back against the &quot;left wing extremists&quot; she claims have taken over Britain&#39;s institutions."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/pro-growth-chancellor-kwasi-kwarteng-154502743.html",
        "title": "What is ‘pro-growth’ chancellor Kwasi Kwarteng’s legacy?",
        "description": "Prime Minister Liz Truss and Chancellor Kwasi Kwarteng – her long-time acolyte – and their cataclysmic mini-budget still cast a long shadow from Westminster to Threadneedle Street."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/dads-shock-diagnosis-mended-relationship-hope-happens-harry-charles-20234556/?ico=trending-module_tag_cancer_item-0",
        "title": "My dad’s shock diagnosis mended our relationship. I hope the same happens for Harry and Charles",
        "description": "And although I don’t know him, I can well imagine some of the thoughts that might be tormenting him as he reflects on his strained relationship with King Charles.  Regrets over past spats. Fears for what lies ahead for his dad."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/seven-takeways-popular-conservatives-truss-b2491549.html",
        "title": "The seven most bizarre takeaways from Liz Truss’s Popular Conservatism launch",
        "description": "The new conservative faction has called for a smaller state, lower taxes, net-zero rollbacks and a tougher stance on immigration"
    },
    {
        "url": "https://www.eta.co.uk/2024/02/06/over-3-7m-uk-adults-have-never-cycled/",
        "title": "Over 3.7m <b>UK</b> adults have never cycled",
        "description": "Seven out of 10 people never ride a bicycle. And over 3,700,000 UK adults have never ridden a bicycle. Not once. The government&#39;s latest National Travel"
    },
    {
        "url": "https://www.wharfedaleobserver.co.uk/news/national/24101671.trump-not-immune-prosecution-2020-election-case-us-appeals-court-says/",
        "title": "Trump not immune from prosecution in 2020 election case, US appeals court says",
        "description": "A federal appeals panel ruled on Tuesday that Donald Trump can face trial on charges that he plotted to overturn the results of the 2020 election, rejecting the former president’s claims that he is immune from prosecution."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/national/24101545.manhunt-clapham-chemical-attack-suspect-abdul-ezedi-continues-sixth-day/",
        "title": "Manhunt for Clapham chemical attack suspect Abdul Ezedi continues for sixth day",
        "description": "Fresh details have emerged about the sex crimes which led to Abdul Ezedi’s conviction as the manhunt for the suspect in a chemical attack continued for a sixth day. Police have offered a £20,000 reward to anyone with information leading to the 35-year-old’s arrest."
    },
    {
        "url": "https://www.politico.eu/article/uk-france-pitch-rules-to-curb-spyware-abuse/",
        "title": "<b>UK</b>, France pitch rules to curb spyware abuse",
        "description": "The United Kingdom, France and allied countries on Tuesday called for international guidelines for the responsible use of spyware, in an effort to stop the hacking tools from running rampant."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/welsh-government-intervenes-south-wales-28578679",
        "title": "The body overseeing South Wales Fire Service has been stripped of its responsibilities",
        "description": "The Welsh Government has intervened to hand oversight of South Wales&#39; troubled fire service to four independent commissioners"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24101499.harry-back-uk-reunite-king-charless-cancer-diagnosis/",
        "title": "Harry back in <b>UK</b> to reunite with the King after Charles’s cancer diagnosis",
        "description": "The Duke of Sussex has returned to the UK after making an emergency dash from the US to see the King following his cancer diagnosis. Harry flew in on Tuesday afternoon ready to be reunited with his father, despite the pair’s troubled relationship."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/rishi-sunak-latest-news-rwanda-bet-starmer-green-dup/",
        "title": "‘We’ve failed to take on Left-wing extremists,’ Truss tells Popular Conservatism group launch – live updates",
        "description": "Rishi Sunak said he was “taken totally by surprise” by a £1,000 bet with Piers Morgan on the Government’s Rwanda policy. Mr Morgan bet the Prime Minister £1,000 to a refugee charity that Rwanda migrant deportation flights would not take off before the next general election."
    },
    {
        "url": "https://inews.co.uk/news/politics/farage-right-popcon-2892591?ico=above_article_ticker",
        "title": "Tories and Reform could merge after the election, Nigel Farage hints at PopCon",
        "description": "In an interview with i, Reform UK leader Richard Tice hinted that Mr Farage would not stand at the election, claiming it was his “gut instinct” that his party’s founder and honorary president would “campaign nationally” rather than seek to become an MP."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24096739.hundreds-post-offices-ditch-national-lottery-sales-new-licence/",
        "title": "Hundreds of post offices ditch National Lottery sales under new licence",
        "description": "The National Lottery’s new operator has revealed that around 900 post offices across the UK will no longer sell draw tickets and scratchcards under the new 10-year licence."
    },
    {
        "url": "https://faroutmagazine.co.uk/?p=465951",
        "title": "The story of The Specials",
        "description": "Chroniclling the story of The Specials, the Coventry band that sparked the 2 Tone revolution by blending Jamaican ska with English punk rock in the late 1970s"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24101273.boltons-helen-flanagan-quits-cluedo-2-medical-reasons/",
        "title": "Bolton&#39;s Helen Flanagan quits Cluedo 2 for medical reasons",
        "description": "Bolton actress Helen Flanagan has stepped down from the UK tour of murder mystery play Cluedo 2. Helen, who was set to play Miss Scarlett in the play, was “advised to withdraw” from the play due to medical reasons."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-visit-holds-importance-32059346?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "Prince Harry&#39;s visit holds &#39;importance&#39; for King Charles as he starts cancer treatment",
        "description": "Harry is flying to London after Charles phoned him and Prince William to inform them about his health. For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. Others also seem to agree. Socialite and television ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-macron-mitterrand-speech-las-vegas-b2491422.html",
        "title": "Biden confuses Macron with dead French president Mitterrand in campaign speech",
        "description": "Meanwhile, the president had another gaffe in June last year when he met with <b>UK</b> Prime Minister Rishi Sunak and accidentally called him by his own moniker: “Mr President.” Mr Biden’s many gaffes have been capitalised on by his <b>political</b> rivals ..."
    }
]