[
    {
        "url": "https://www.standard.co.uk/culture/tvfilm/the-way-bbc-one-review-michael-sheen-b1139373.html?itm_source=Internal&itm_channel=section_trending_article_component&itm_campaign=trending_section&itm_content=3",
        "title": "The Way on BBC One review: Michael Sheen&#39;s directing debut ruins a good idea with cliché and stereotype",
        "description": "With only three hours to play with, the level of gratuitous referentiality is almost overwhelming. We get the symbols of <b>political</b> struggle rammed home within seconds: a demonic Margaret Thatcher mask; the Miners’ Strike, historic Welsh resistance ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/science-environment-68342314?at_campaign=KARANGA&at_medium=RSS",
        "title": "PM announces support for farming amid industry &#39;crisis&#39;",
        "description": "The prime minister will announce a package of measures on Tuesday to help farmers - but many say more is needed to support an industry &quot;in crisis&quot;. Rishi Sunak will use a speech at Tuesday&#39;s National Farmers Union annual conference to outline government plans to boost the UK&#39;s food security."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24130233.lord-cameron-hopes-people-falkland-islands-want-stay-british-forever/",
        "title": "Lord Cameron hopes people of Falkland Islands want to stay British ‘forever’",
        "description": "Foreign Secretary Lord Cameron said he hoped the people of the Falkland Islands would want to stay British “forever” as he insisted a drive to improve relations with Argentina would not come at their expense."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/home-office-launches-investigation-after-babys-birth-certificate-had-israel-scribbled-out/",
        "title": "Home Office launches investigation after baby&#39;s birth certificate &#39;had Israel scribbled out&#39;",
        "description": "The Home Office is launching an investigation after a baby&#39;s birth certificate was returned to her parents with the word Israel scribbled out."
    },
    {
        "url": "https://news.sky.com/story/well-never-take-food-security-for-granted-promises-sunak-as-farming-chief-warns-it-risks-becoming-poor-relation-to-other-priorities-13075775",
        "title": "&#39;We&#39;ll never take food security for granted&#39; promises Sunak, as farming chief warns it risks becoming &#39;poor relation&#39; to other priorities",
        "description": "NFU chief Minette Batters says the next government needs to treat farming &quot;as one vital part of our national infrastructure&quot;. Political parties are attending the NFU conference as they seek to win the rural vote ahead of the general election."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24130226.pm-tell-farming-conference-government-by-side/",
        "title": "PM to tell farming conference Government is ‘by their side’",
        "description": "The Government will also publish an annual food security index in the spring, monitoring the <b>UK</b>’s current level of food security and how it can be maintained. Shadow environment secretary Steve Reed accused the Conservative government of undermining ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13101769/GRAHAM-GRANT-trust-SNP-loopy-Green-bedfellows-country-safe.html",
        "title": "GRAHAM GRANT: Would you trust the SNP and their loopy Green bedfellows to keep our country safe?",
        "description": "The North Sea oil and gas industry faces existential threats from numerous sources, not least Humza Yousaf&#39;s SNP Government and its Green partners."
    },
    {
        "url": "https://news.stv.tv/politics/alex-salmond-tony-blair-was-responsible-for-breakdown-in-scottish-and-uk-government-relations",
        "title": "Salmond: Blair was responsible for breakdown in Scottish-<b>UK</b> relations",
        "description": "The former first minister accuses Tony Blair of &#39;contempt&#39; for devolution and Scots law ahead of his appearance before a Westminster inquiry on Tuesday."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/andrew-murrison-defend-militarys-woke-policies-lgbtq/",
        "title": "Defence minister defends military’s ‘woke’ policies as necessary to represent modern society",
        "description": "Andrew Murrison told MPs that he was &#39;guilty as charged&#39; if he believed in making the military a more inclusive and diverse workspace"
    },
    {
        "url": "https://impactnottingham.com/2024/02/insights-from-the-frontlines-matt-freis-journalistic-odyssey-and-guidance-for-aspiring-reporters/",
        "title": "Insights from the Frontlines: Matt Frei’s Journalistic Odyssey and Guidance for Aspiring Reporters",
        "description": "Alfie Johnson The origins of this interview with Channel 4’s Presenter and European Editor, Matt Frei, begins in a rather unconventional manner. As I was doing some Christmas shopping with my family in London,"
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1868482/alastair-stewart-countryfile-slammed-bbc-woke",
        "title": "GB News host fears for BBC&#39;s Countryfile after viewers slam &#39;woke&#39; show - &#39;Lost its way&#39;",
        "description": "Alastair Stewart sparked a social media divide as the GB News presenter claimed Countryfile has become too &quot;politically correct&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/sport/football/swpl-disappointed-rangers-women-ticket-32164048.amp",
        "title": "SWPL &#39;disappointed&#39; by Rangers Women ticket cancellation as Celtic ticket row receives firm address",
        "description": "The Scottish Women&#39;s Premier League has expressed disappointment over Rangers&#39; decision to cancel all Celtic fan tickets for the Old Firm match at Ibrox. The Ibrox side released a statement on Saturday afternoon saying that following consultation with both ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/negativity-around-scottish-and-uk-governmental-relations-committee-told-4525031",
        "title": "‘Negativity’ around Scottish and <b>UK</b> governmental relations, committee told",
        "description": "There has been a “negativity” surrounding the relationship between the Scottish and UK governments in recent years, the Scottish Affairs Committee (SAC) has heard. On Monday, three former secretaries of state for Scotland spoke to the SAC on intergovernmental relations between both governments during their time in office."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/celebs-tv/esther-rantzens-dream-final-meal-9110772",
        "title": "Esther Rantzen&#39;s dream final meal before she ends her life through assisted dying",
        "description": "Dame Esther Rantzen has been diagnosed with terminal cancer and has been campaigning to make assisted suicide legal in the UK"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/over-7000-cancer-operations-delayed-junior-doctors-strike/",
        "title": "More than 7,000 cancer operations delayed by junior doctors’ strikes",
        "description": "Leaked NHS data shows fall of 27pc in surgeries as officials plea with BMA to protect patients from further walkouts"
    },
    {
        "url": "https://news.sky.com/story/henry-staunton-former-post-office-chairman-investigated-over-bullying-before-dismissal-kemi-badenoch-claims-13075749",
        "title": "Henry Staunton: Former Post Office chairman investigated over bullying before dismissal, Kemi Badenoch claims",
        "description": "<b>Politics</b> Live: Army applications soar after warnings of possible ... in what has been called the biggest miscarriage of justice in <b>UK</b> history. The airing of Mr Bates Vs The Post Office last month led to widespread outrage and promises from the government ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/19/donald-trump-gold-high-top-sneakers-20309414/?ico=trending-post-strip_item_4",
        "title": "Trump unveils $399 gold high-top sneakers after being ordered to pay millions",
        "description": "‘You know that it’s a slightly different audience than I’m used to, but I love this audience.’ Get in touch with our news team by emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check our news page."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1868424/julian-assange-extradition-latest-wikileaks",
        "title": "Julian Assange: Extradition latest, wife, children and secrets Wikileaks revealed",
        "description": "Julian Assange is currently in prison in the <b>UK</b> but could be extradited to the US ... He was granted asylum by Ecuador in August 2012 on the grounds of <b>political</b> persecution and fears he might be extradited to the United States."
    },
    {
        "url": "https://metro.co.uk/2024/02/19/real-doctor-behind-itv-covid-drama-breathtaking-full-rage-20234651/?ico=trending-post-strip_item_1",
        "title": "Doctor behind brilliant new Covid drama reveals why she’s burning with rage",
        "description": "Prasanna was unafraid of making the episodes <b>political</b> and called it a ‘public interest show ... and a Zoom phone call from an Italian doctor who warned <b>UK</b> medical staff that they were going to need a lot more ventilators. Jed worked on the ..."
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/itv-love-island-star-fans-32164528?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "ITV Love Island All Star fans spot star fuming during final after Maya Jama drops huge news",
        "description": "Love Island All Star viewers have called out Georgia Harrison for looking &#39;absolutely fuming&#39; during the final of the ITV show. The final saw Georgia and Anton finish in fifth place, and viewers were left convinced that the new couple were livid to have ..."
    },
    {
        "url": "https://news.stv.tv/politics/negativity-around-scottish-and-uk-governmental-relations-westminster-committee-told",
        "title": "‘Negativity’ around Scottish and <b>UK</b> governmental relations, MPs told",
        "description": "One former Scottish secretary of state said the relationship between both governments was ‘broadly very good’, but says this is no longer the case."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7256770",
        "title": "<b>Politics</b> live: Possible move against Russia would send &#39;very powerful signal&#39;",
        "description": "Our first guest on <b>Politics</b> Hub With Sophy Ridge this evening is Lord Peter Ricketts, former <b>UK</b> national security adviser. Asked directly if Putin assassinated Alexei Navalny, he says he was in a state prison, and therefore: &quot;It seems very, very odd that ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-68337790.amp",
        "title": "Alexei Navalny&#39;s widow Yulia Navalnaya vows to continue his work",
        "description": "In a video message, Yulia Navalnaya also accused the Kremlin of being behind her husband&#39;s death in a Siberian jail."
    },
    {
        "url": "https://www.thesun.co.uk/news/26047040/how-putins-critics-like-navalny-met-grisly-ends/",
        "title": "From mystery window falls to poisoned cup of tea and killer door handle, how Putin’s critics met their grisly ends",
        "description": "LANGUISHING in a bone-chilling gulag in the Arctic Circle, opposition leader Alexei Navalny bore no possible threat to tyrant Vladimir Putin. Yet — riddled with dictators’ paranoia ­ many believe"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/michael-shanks-believes-gaza-ceasefire-32160852",
        "title": "Michael Shanks believes Gaza ceasefire ‘is an essential next step’ as Scottish Labour motion passes",
        "description": "This comes after the Scottish Labour Party&#39;s conference passed a motion calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.mirror.co.uk/news/itv-breathtakings-covid-care-home-32158442",
        "title": "ITV Breathtaking&#39;s Covid care home scandal explained - what happened and who was to blame",
        "description": "ITV&#39;s Breathtaking exposes the sacrifices made by NHS staff during the Covid-19 pandemic. As the number of people needing hospital care for the virus soared, hospital patients were discharged to care homes to free up vital beds,"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7256732",
        "title": "<b>Politics</b> live: Army applications soar after warnings of possible war conscription",
        "description": "Tune in to watch on Sky News from 7pm, with live updates right here in the <b>Politics</b> Hub. Shadow home secretary Yvette Cooper has given Labour&#39;s response to the vast rise in antisemitism across the <b>UK</b>. Figures published by the Community Security Trust (CST ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24130129.bbc-chief-pledges-keep-all-local-radio-services-amid-500m-cost-cutting/",
        "title": "BBC chief pledges to keep ‘all local radio services’ amid £500m cost-cutting",
        "description": "On Monday, the BBC boss addressed questions by the Commons’ Public Accounts Committee (PAC) about the future of its radio and TV services while he provided an update on the corporation’s plans to spend least an extra £700 million outside London between March 2021 and March 2028 to “strengthen” UK delivery."
    },
    {
        "url": "https://metro.co.uk/2024/02/19/donald-trump-gold-high-top-sneakers-20309414/",
        "title": "Trump unveils $399 gold high-top sneakers after being ordered to pay millions",
        "description": "‘You know that it’s a slightly different audience than I’m used to, but I love this audience.’ Get in touch with our news team by emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check our news page."
    },
    {
        "url": "https://www.thenational.scot/politics/24129455.seeing-low-petty-blows-westminster/",
        "title": "We are seeing some very low and petty blows from Westminster",
        "description": "They will be able to get away with it without too serious a <b>political</b> consequence ... They plan to work together to pressure the <b>UK</b> Government to curb the SNP-Green administration&#39;s spending in reserved areas. Arch Tory Michael Forsythe is missing from ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24127721.houthis-claim-attack-damaged-uk-registered-cargo-ship/",
        "title": "Houthis claim attack which damaged <b>UK</b>-registered cargo ship",
        "description": "A missile attack by Yemen’s Houthi rebels that damaged a UK-registered, Belize-flagged ship travelling through the Bab el-Mandeb Strait that connects the Red Sea and the Gulf of Aden has forced the crew to abandon the vessel, authorities said."
    },
    {
        "url": "https://www.irishnews.com/news/uk/right-to-describe-navalnys-death-as-murder-minister-says-6W52CRNFKRPJNCOK3OLPN4VF3Q/",
        "title": "Right to describe Navalny’s death as ‘murder’, minister says",
        "description": "Alicia Kearns, the Foreign Affairs Committee chairwoman, had urged MPs to call out Russian opposition leader Alexei Navalny’s death as murder."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/19/kemi-badenoch-post-office-scandal-alexei-navalny-uk-politics-live?page=with:block-65d384178f087eed1e9954c9&filterKeyEvents=false",
        "title": "Minister says government working on sanction options for those involved in Alexei Navalny’s death – <b>UK politics</b> live",
        "description": "Leo Docherty, Foreign Office minister, says government ‘working at pace’ to hold those responsible for Russian opposition leader’s death to account"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24127185.esh-winning-teacher-wins-houses-parliament-experience/",
        "title": "Esh Winning teacher wins Houses of Parliament experience",
        "description": "Selected from hundreds of applicants Kaye Burns, a teacher from Esh Winning Primary School in County Durham, was chosen to be part of the"
    },
    {
        "url": "https://inews.co.uk/news/politics/navalny-uk-sanctions-russia-2914573?ico=related_article_inline",
        "title": "<b>UK</b> Government working ‘at pace’ on new Russia sanctions after Navalny death",
        "description": "Foreign Office minister Leo Docherty told the House of Commons it was right to say the Russian opposition leader had been &#39;murdered&#39;"
    },
    {
        "url": "https://www.thenational.scot/politics/24129159.clarity-needed-now-snps-strategy-independence/",
        "title": "Clarity is needed now on the SNP’s strategy for independence",
        "description": "KARL Rosie is absolutely right about the “incoherence” of the SNP independence strategy (SNP councillor quits party over"
    },
    {
        "url": "https://www.heraldscotland.com/news/24129887.former-scottish-secretary-questions-yousafs-meeting-erdogan/?ref=rss",
        "title": "Former Scottish secretary questions Yousaf&#39;s meeting with Erdoğan",
        "description": "The First Minister met with Recep Tayyip Erdoğan without a Foreign, Commonwealth and Development Office (FCDO) representative, triggering a diplomatic row with the <b>UK</b> Government ... overlaying of this onto our <b>politics</b>&quot;. He said the First Minister ..."
    },
    {
        "url": "https://www.leisureopportunities.co.uk/news/UKActive-and-Myzone-launch-physical-activity-challenge-for-MPs-Fit-for-Office-politicians-lifestyle-disease-Liz-Terry-Huw-Edwards-Kim%20Leadbeater/352671",
        "title": "New campaign challenges politicians to prove they&#39;re &#39;Fit for Office&#39; by engaging in physical activity",
        "description": "In a soft power exercise, politicians in the UK have been invited to take part in a challenge which encourages them to be more active, while raising awareness of the benefits of physical activity."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1868131/Reform-UK-Ben-Habib-by-election",
        "title": "Only Reform <b>UK</b> can save Britain from growing existential threat it faces, says Ben Habib",
        "description": "Reform <b>UK</b> will deliver Britain’s future as a proud ... Only 5% in the polls three months ago; now more often than not over 10% and rising. The <b>political</b> winds are in our sails. The people are waking up to the existential threat created by Sunak and ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-city-council-leader-says-28664395",
        "title": "Birmingham City Council leader says it&#39;s &#39;very difficult’ as cuts affecting city&#39;s young people unveiled",
        "description": "Keep up to date with all the latest <b>politics</b> news with our <b>politics</b> newsletter. You can sign up for free here to get stories delivered straight to your inbox to read at a time convenient to you."
    },
    {
        "url": "https://inews.co.uk/news/politics/navalny-uk-sanctions-russia-2914573?ITO=msn",
        "title": "<b>UK</b> Government working ‘at pace’ on new Russia sanctions after Navalny death",
        "description": "Foreign Office minister Leo Docherty told the House of Commons it was right to say the Russian opposition leader had been &#39;murdered&#39;"
    }
]