[
    {
        "url": "https://www.irishnews.com/news/uk/scottish-labour-mps-should-be-whipped-in-gaza-ceasefire-vote-snp-JNLRTCRAD5K2TIGUPXY6JZLHVI/",
        "title": "Scottish Labour MPs should be whipped in Gaza ceasefire vote – SNP",
        "description": "The SNP is calling on Scottish Labour to whip its two MPs to vote for an immediate ceasefire in Gaza, ahead of a vote in the House of Commons next week. On Saturday, Scottish Labour’s conference is expected to pass a motion calling for an immediate ceasefire in the conflict."
    },
    {
        "url": "https://www.irishnews.com/news/uk/come-together-sunak-tells-conservatives-after-twin-by-election-blow-XF5QDYPHVNNZNOMHYTKU4X6KMY/",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/e4-married-first-sights-tasha-32147187",
        "title": "E4 Married At First Sight&#39;s Tasha Jay hits out over claims she&#39;s &#39;on the rocks&#39; with Paul Liba",
        "description": "Married At First Sight star Tasha Jay has it out at claims she has split with partner Paul Liba after reports claimed the couple had not spent Valentine&#39;s Day together"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867745/Mcvey-lockdown-supports-recession",
        "title": "Esther McVey appears to blame Covid lockdown backers for <b>UK</b> recession",
        "description": "The &quot;minister for common sense&quot; has appeared to blame &quot;everybody who voted for lockdown&quot; for the dip in the economic climate"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24126000.donald-trump-fined-364-million-dollars-civil-fraud-case/",
        "title": "Donald Trump fined 364 million dollars in civil fraud case",
        "description": "The civil trial lasted for two and a half months and Mr Trump’s lawyers have already confirmed they will appeal the decision."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68320288.amp",
        "title": "Democrats relieved as Manchin rules out White House bid",
        "description": "Democrats were concerned that an independent bid could help deliver the White House to the Republicans in November&#39;s election. Mr Manchin finally ended the speculation on Friday, and seemed to acknowledge that the prospect of such unintended consequences was a factor in his decision not to run."
    },
    {
        "url": "https://www.thetimes.co.uk/article/reform-uk-by-election-wellingborough-kingswood-farage-nfzdrl95w",
        "title": "Nigel Farage considers comeback as Reform party leader",
        "description": "Nigel Farage has hinted he could return to frontline politics as leader of Reform UK, after the party’s strongest electoral showing at a by-election. While Labour flipped two seats vacated by Conservative MPs,"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-speaks-out-invictus-32141711",
        "title": "Prince Harry speaks out at Invictus event after addressing Royal Family dynamic",
        "description": "Prince Harry and Meghan Markle travelled to Canada this week and while there, the Duke of Sussex spoke at the closing event of the One Year to Go activities for the Invictus Games"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13093697/Russian-diplomats-UK-Foreign-Office-murder-Alexei-Navalny.html",
        "title": "Russian diplomats &#39;summoned&#39; by <b>UK</b> Foreign Office over &#39;murder&#39; of Putin opponent Alexei Navalny - as world leaders condemn death of Putin critic",
        "description": "The Foreign Office said today it has &#39;summoned the Russian Embassy to make clear that we hold the Russian authorities fully responsible&#39; for the death of Navalny, 47."
    },
    {
        "url": "https://www.ft.com/content/7dfa734c-0f15-421a-bc24-47fe42e96174",
        "title": "Transcript: Tories reel from by-election blows",
        "description": "Lucy Fisher talks to George Parker, Rafe Uddin, elections guru Professor Sir John Curtice and the FT’s foreign editor Alec Russell"
    },
    {
        "url": "https://news.sky.com/story/biden-contemplating-steps-to-punish-moscow-as-world-leaders-blame-monster-putin-for-navalnys-death-13073243",
        "title": "Biden &#39;contemplating&#39; steps to punish Moscow as world leaders blame &#39;monster&#39; Putin for Navalny&#39;s death",
        "description": "UK Prime Minister Rishi Sunak has described Mr Navalny as the &quot;fiercest advocate for Russian democracy&quot;, while French President Emmanuel Macron said his death shows the &quot;weakness of the Kremlin and their fear of all opponents&quot;."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24126013.lockdown-backers-blame-uk-recession-suggests-minister/",
        "title": "Lockdown backers to blame for <b>UK</b> recession, suggests minister",
        "description": "The Government’s “minister for common sense” has appeared to blame “everybody who voted for lockdown” for the British economy’s dip into recession. Cabinet Office Minister Esther McVey made the claim during an appearance on BBC Radio 4’s Any Questions, as she faced questions about who voters should hold responsible for the lack of growth."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-13092721/MAGGIE-PAGANO-Nigel-Farage-takes-aim-NatWest-again.html?mrn_rm=rta",
        "title": "MAGGIE PAGANO: Nigel Farage takes aim at NatWest again",
        "description": "They have obviously learned nothing from the scandal, which also saw the head of Coutts sacked after it became public that the private bank had compiled a whopping Stasi-style dossier on Farage and his <b>politics</b> ... the <b>UK</b> has been in and out of recession ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/alexei-navalny-russian-cameron-vladimir-putin-foreign-office-b1139749.html",
        "title": "Russian diplomats ‘summoned’ following Alexei Navalny’s death",
        "description": "Foreign Office officials have summoned the Russian Embassy amid anger in Western capitals over the death of jailed opposition leader Alexei Navalny."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/letter-from-scotland-440/",
        "title": "Letter from Scotland",
        "description": "Which is disappointing to those of us who would like to see positive <b>politics</b>. But Labour doesn’t seem to have ... while Sir Keir backs the <b>UK</b> and American call for temporary pauses in the fighting. There is a Scottish rebellion over limits to welfare ..."
    },
    {
        "url": "https://inews.co.uk/news/uk-election-cyber-attack-warning-after-putins-hackers-target-us-2910387?ico=related_article_inline",
        "title": "<b>UK</b> election cyber-attack warning after Putin’s hackers target US",
        "description": "Putin-backed Russian hackers behind a large-scale attack on the US are engaging in a campaign of “cyber warfare” ahead of elections in America and the UK, security sources have warned."
    },
    {
        "url": "https://uk.news.yahoo.com/navalny-likely-killed-crush-dissent-211444795.html",
        "title": "Navalny was likely killed to crush dissent before Russian election, says expert",
        "description": "The <b>UK</b> has joined other western countries in condemning the Kremlin ... Dr Maxim Alyukov, research fellow at the university’s Russia Institute, described Mr Navalny’s death as a “<b>political</b> killing”. He added: “It is likely that he has been ..."
    },
    {
        "url": "https://www.timeout.com/uk/news/the-uk-is-officially-still-one-of-the-most-democratic-countries-in-the-world-021624",
        "title": "The <b>UK</b> is officially (still) one of the most democratic countries in the world",
        "description": "In the report, EIU suggested that the UK has enjoyed a much more politically stable year (congrats to us for keeping the same prime minister for a whole twelve months). It said: ‘There has been a small improvement in the country’s score for social cohesion: divisions over Brexit have receded and support for independence in Scotland has declined."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/alexei-navalnys-last-message-wife-hours-death-revealed-20294534/?ico=trending-module_tag_russia_item-0",
        "title": "Alexei Navalny’s tragic last message to his wife just hours before his death",
        "description": "Navalny, 47, has died in prison in what is likely to be seen as a <b>political</b> assassination by the Kremlin ... Get in touch with our news team by emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check our news page."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68316527",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "And in Kingswood, near Bristol, they got a share of the vote greater than the gap between the victorious Labour candidate and the Tory runner-up. That is a double dose of the heebie-jeebies delivered in one day to nervous Tories."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68314949",
        "title": "Could Reform <b>UK</b> surge sink Tory election hopes?",
        "description": "Reform UK leader Richard Tice has said he wants to &quot;smash&quot; and &quot;destroy&quot; the Tory Party at the general election. He insisted Reform UK would never consider repeating the Brexit Party&#39;s 2019 deal with the Conservatives - which saw it withdraw candidates in 317 constituencies after then-Tory leader Boris Johnson committed to leaving the EU by 2020."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/deepfakes-could-swing-close-uk-election-or-referendum-sadiq-khan-suggests/a952458439.html",
        "title": "Deepfakes could swing close <b>UK</b> election or referendum, Sadiq Khan suggests",
        "description": "Deepfakes could swing a close UK election or referendum in future, the Mayor of London has suggested. Sadiq Khan, who fell victim to a fake AI recording of him supposedly making inflammatory remarks in the run up to Armistice Day protests last year,"
    },
    {
        "url": "https://www.christiantoday.com/article/campaign.launched.to.protect.uk.religious.broadcasting/141388.htm",
        "title": "Campaign launched to protect <b>UK</b> religious broadcasting",
        "description": "A campaign has been launched to protect religious programmes from potential cuts in a new Media Bill going through Parliament."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867322/by-election-results-reform-uk",
        "title": "Pollster offers by-election verdict as Reform <b>UK</b> surges – and it&#39;s bad news for everyone",
        "description": "The Tories have taken a kicking, Labour have two new MPs and Reform are flying high - but Professor Sir John Curtice warns that the real losers were everyone."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/reform-uk-wellingborough-kingswood-by-election-richard-tice/?utmsource=email",
        "title": "Reform <b>UK</b> secures best-ever by-election results",
        "description": "Richard Tice says the votes are a ‘defining moment’ and the party is now a ‘significant force’ in UK politics ahead of the general election"
    },
    {
        "url": "https://www.markpack.org.uk/172548/lib-dem-gain-from-labour-in-hull-by-election/",
        "title": "Lib Dem gain from Labour in Hull by-election",
        "description": "As well as the two Parliamentary by-elections, we had five principal authority council by-elections too. Four out of five had Lib Dems."
    },
    {
        "url": "https://inews.co.uk/news/politics/recession-squeeze-inflation-hunt-believe-2908822?ico=more_from_this_author",
        "title": "Recession squeeze will help cut inflation, Hunt believes",
        "description": "Ministers are confident the economy will start growing again in the run-up to a general election, but Labour has accused the Conservatives of leading the <b>UK</b> into “a spiral of ... reason last year we took a lot of <b>political</b> flak for not cutting taxes."
    },
    {
        "url": "https://www.landlordtoday.co.uk/agent-advice/2024/2/the-rich-embrace-renting-over-selling",
        "title": "The Rich Embrace Renting Over Selling",
        "description": "Deciding on a residence in the bustling city of London is no small feat, especially when faced with the dichotomy of renting versus buying. In today&#39;s intricate economic climate, the pendulum often sw"
    },
    {
        "url": "https://www.thesun.co.uk/news/25996379/rochdale-by-election-candidates-labour/",
        "title": "Anti-Semite, disgraced sexter &amp; smug George Galloway… what have people of Rochdale done to deserve this by-election lot?",
        "description": "THE shutters are drawn and the mail uncollected at what should be Labour’s buzzing campaign HQ on Rochdale’s Oldham Road. For the party’s by-election candidate Azhar Ali, once the red hot"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/reform-uk-richard-tice-rishi-sunak-election-pact-reject/",
        "title": "Reform leader rejects an election pact with Conservatives",
        "description": "Richard Tice rules out a collaboration with Rishi Sunak as Tories fear the general election becoming a ‘slow-moving car crash’"
    },
    {
        "url": "https://www.irishnews.com/news/uk/lockdown-backers-to-blame-for-uk-recession-suggests-minister-44S65DV6DFNM3EWLOXLEQJWDMI/",
        "title": "Lockdown backers to blame for <b>UK</b> recession, suggests minister",
        "description": "The Government’s “minister for common sense” has appeared to blame “everybody who voted for lockdown” for the British economy’s dip into recession. Cabinet Office Minister Esther McVey made the claim during an appearance on BBC Radio 4’s Any Questions, as she faced questions about who voters should hold responsible for the lack of growth."
    },
    {
        "url": "https://www.thenational.scot/politics/24126006.owen-jones-makes-perfect-sense-protest-scottish-labour-conference/",
        "title": "Owen Jones: It makes perfect sense to protest Scottish Labour conference",
        "description": "WHY would those enraged by Israel’s genocidal war against Gaza want to protest against an opposition party in Scotland?"
    },
    {
        "url": "https://www.thetimes.co.uk/article/lexei-navalny-dies-dead-russia-opposition-putin-latest-news-5cxhh8f79?ilc=timesradio:morefromthetimes",
        "title": "Alexei Navalny dies: Joe Biden says Putin is responsible — as it happened",
        "description": "The Russian opposition politician Alexei Navalny has died, according to the prison service. The Federal Penitentiary Service in Yamalo-Nenets said Navalny, 47, “felt unwell” after a walk on Friday and that an ambulance was called but he could not be resuscitated."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68277176?pinned_post_locator=urn:asset:7c0b1431-e480-4fa0-b7d2-460afaef7d36&pinned_post_asset_id=65cf06c86e1cf501ac5dcd87&pinned_post_type=share",
        "title": "Tories suffer two by-election defeats with big swings to Labour",
        "description": "It’s the law. Edited by Sam Hancock All times stated are <b>UK</b> Chris Mason <b>Political</b> editor My phone pinged first thing this morning with a text from a Conservative convinced of the party&#39;s imminent doom unless something radical changes - perhaps getting ..."
    },
    {
        "url": "https://www.burytimes.co.uk/news/national/24125999.lawyer-said-not-contact-police-abuse-allegations-ex-wife-mp-reveals/",
        "title": "Lawyer said not to contact police over abuse allegations, ex-wife of MP reveals",
        "description": "Conservative MP Kate Kniveton has spoken out after a High Court ruling Andrew Griffiths’ contact with his child."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/24125984.ben-shephard-leaving-on-screen-wife-kate-garraway-morning-hard/",
        "title": "Ben Shephard: Leaving ‘on-screen wife’ Kate Garraway for This Morning is hard",
        "description": "Garraway and Mr Draper, a former <b>political</b> lobbyist-turned-psychologist and writer ... who hosted breakfast show GMTV along with ITV’s Tipping Point and Ninja Warrior <b>UK</b>, said he is looking forward to being part of the team on This Morning."
    },
    {
        "url": "https://inews.co.uk/news/politics/wounded-sunak-income-tax-gamble-reform-by-election-2910867?ico=more_from_this_author",
        "title": "Wounded Sunak prepares income tax cut gamble after Reform by-election surge",
        "description": "Cuts would also fit the Prime Minister’s personal <b>political</b> philosophy, according to No 10 aides ... cut and a multi-billion-pound investment tax break for business, the <b>UK</b>’s overall tax burden is heading for a record level in peacetime due to a ..."
    },
    {
        "url": "https://www.kentonline.co.uk/sheerness/news/veteran-mp-tells-podcast-that-brexit-has-gone-well-301852/",
        "title": "Kent <b>Politics</b> Podcast: MP Gordon Henderson on Brexit, the Sheppey academy and opinion polls",
        "description": "An outgoing MP has told the Kent Politics Podcast how he feels Brexit has been a success and how current opinion polls are going to be proved wrong."
    },
    {
        "url": "https://uk.news.yahoo.com/conservative-face-near-wipe-across-050000089.html",
        "title": "Conservatives face near wipe-out across Sussex at general election",
        "description": "The Conservatives are forecast to only win four seats in Sussex at the next general election, according to a recent opinion poll"
    }
]