[
    {
        "url": "https://uk.news.yahoo.com/eu-anti-migrant-deal-help-205542033.html",
        "title": "New EU anti-migrant deal will help Rishi Sunak ‘stop the boats’, claims French politician",
        "description": "French MEP Fabienne Keller, of the Renew Europe group, who led the negotiations, insisted the Geneva Convention will be “fully applied” in the so-called waiting zones, adding: “If I may make a comparison, instead of sending people to Rwanda, we are doing it on European soil.”"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-67769920",
        "title": "Troubles legacy act: Ireland takes human rights case against <b>UK</b>",
        "description": "The UK&#39;s controversial Troubles legacy act became law in September, despite opposition from Dublin and all Northern Ireland&#39;s main political parties. Critics argued the law gave an amnesty and removed access to justice. Northern Ireland Secretary Chris Heaton-Harris said he &quot;profoundly regrets&quot; the Irish decision."
    },
    {
        "url": "https://www.edp24.co.uk/news/24002359.theatre-royal-panto-much-power-community/",
        "title": "Theatre Royal panto has so much power in the community",
        "description": "Panto is many people&#39;s first introduction to the theatre, hopefully igniting a lifelong love of live performance. We cannot know the true effects into the future of this creative experience at this moment, but we are committed to everyone having that opportunity. The theatre industry relies upon it."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847753/rishi-sunak-ireland-court-Leo-Varadkar",
        "title": "Rishi Sunak takes brutal swipe at Ireland after it makes &#39;misguided&#39; decision",
        "description": "The British Government have called Ireland&#39;s attempt to drag the <b>UK</b> before European courts as “unnecessary ... The Legacy Act received royal assent in September despite widespread opposition from <b>political</b> parties, victims&#39; organisations in Northern ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/esther-rantzens-desperate-appeal-mps-31720838",
        "title": "Esther Rantzen&#39;s desperate appeal to MPs as she joins Dignitas after stage four cancer diagnosis",
        "description": "Veteran journalist and presenter Dame Esther Rantzen, 83, urged parliamentarians to think of the elderly people in their lives and whether they&#39;d want them to spend their final days in agony or to offer them a &quot;gentle,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12887083/uk-northern-ireland-amnesty-law-legal-challenge.html",
        "title": "Dublin says it has &#39;no choice&#39; but to take legal action over <b>UK</b>&#39;s Northern Ireland amnesty law - as British government slams the move as &#39;unnecessary&#39;",
        "description": "The new Troubles legacy act became law in September and gives conditional amnesties to former soldiers and militants involved in decades of violence."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24002911.green-ministers-condemned-just-transition-transport-budgets-cut/",
        "title": "Green ministers condemned after just transition and transport budgets cut",
        "description": "The Lib Dems said Scottish Government funding decisions will mean more use of petrol cars, and oil and gas, and ‘more sewage in our rivers’."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/world-news/most-dangerous-holiday-destinations-2024-28326898",
        "title": "Most dangerous holiday destinations in 2024 mapped as tourists warned of &#39;risk&#39;",
        "description": "Tourists have been warned against going to a number of holiday destinations in 2024 amid political unrest and climate change. International SOS has revealed the places most likely to result in issues for travellers due to factors including violence and crime."
    },
    {
        "url": "https://www.thenational.scot/politics/24004145.losing-andrew-bridgen-may-herald-dying-days-reclaim-party/",
        "title": "Losing Andrew Bridgen may herald the dying days of the Reclaim Party",
        "description": "FAR-right conspiracy theorist nutjob MP Andrew Bridgen was thrown out of the Tory party for comparing the vaccine rollout to the Holocaust."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/uk-government-profoundly-regrets-legal-action-by-irish-against-legacy-act-95999/",
        "title": "<b>UK</b> Government ‘profoundly regrets’ legal action by Irish against Legacy Act",
        "description": "Irish premier Leo Varadkar said the ‘strong’ legal advice was that the legislation breached the UN Convention on Human Rights."
    },
    {
        "url": "https://inews.co.uk/opinion/end-tory-party-know-it-2817552?ico=related_stories",
        "title": "It’s the end of the Tory party as we know it",
        "description": "Whether they&#39;ll toe the party line is another story Katy Balls: ‘Several MPs are considering quitting the Commons – including serving ministers’ (Photo: Jessica Taylor/<b>UK</b> Parliament/AFP ... the past decade of British <b>politics</b>. Whether it was jokes ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/20/laurence-foxs-gb-news-rant-complained-tv-moment-2023-20003170/?ico=trending-module_author_pierra-willix_item-2",
        "title": "Most complained about TV moment of the year revealed",
        "description": "Back in September the former actor was appearing on Dan Wootton Tonight when he made a string of misogynistic remarks about <b>political</b> correspondent Ava Evans. In his tirade, he made comments that included ‘no self-respecting man would want to climb into ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/top-30-news-stories-2023-31711252.amp",
        "title": "Most Brits think 2023 was a memorable year for news, study finds",
        "description": "The survey of 2,000 adults revealed that exactly two-thirds would claim they are “up to date” with current affairs – and have most enjoyed following sports (32%) and <b>politics</b> (25%) this year. Meanwhile, for the 24% who have kept a close eye on ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67759768?at_medium=RSS",
        "title": "Statistics watchdog rebukes Rishi Sunak over claim debt falling",
        "description": "Liberal Democrat Treasury spokeswoman Sarah Olney wrote to Sir Robert Chote, chairman of the <b>UK</b> Statistics Authority ... for the Boris Johnson playbook and is undermining trust in <b>politics</b>.&quot;"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-small-boats-eu-deal-latest-b2467498.html",
        "title": "New EU anti-migrant deal will help Rishi Sunak ‘stop the boats’, claims French politician",
        "description": "French MEP Fabienne Keller, of the Renew Europe group, who led the negotiations, insisted the Geneva Convention will be “fully applied” in the so-called waiting zones, adding: “If I may make a comparison, instead of sending people to Rwanda, we are doing it on European soil.”"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/20/wellingborough-byelection-gives-labour-another-chance-to-humiliate-rishi-sunak",
        "title": "Wellingborough byelection gives Labour another chance to humiliate Rishi Sunak",
        "description": "Recall of MP Peter Bone opens up Brexit-leaning former safe seat where defections from Tories in any direction could help Labour win"
    },
    {
        "url": "https://uk.news.yahoo.com/convicted-spy-told-police-filmed-181145827.html",
        "title": "Terror scout caught spying on broadcaster’s London base",
        "description": "A terror scout spied on a dissident Iranian television channel in the UK, a court heard, as counter-terror police revealed they had foiled 15 plots linked to Iran."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gavin-williamson-boris-johnson-alevels-england-gcses-b1128363.html",
        "title": "Gavin Williamson criticises Boris Johnson’s ‘panic’ pandemic school closures",
        "description": "The ex-education secretary said Mr Johnson’s decision to shut schools in January 2021 did not ‘sufficiently take children’s interests into account’."
    },
    {
        "url": "https://www.itv.com/news/utv/2023-12-20/donaldson-asks-what-will-republic-do-after-legacy-bid-launched",
        "title": "DUP questions if Rebublic&#39;s Legacy Act legal action will strain <b>UK</b> relations",
        "description": "Politicians welcome the interstate case challenging Troubles Legacy bill as Sir Jeffrey Donaldson questions it | UTV News"
    },
    {
        "url": "https://inews.co.uk/opinion/2024-housing-crisis-dwarfs-cost-of-living-2818780?ico=related_stories",
        "title": "2024 will be the year the housing crisis dwarfs the cost of living",
        "description": "The real story of 2024 may well be that the cost of living crisis will be replaced by a cost of housing crisis. Even if wages finally outpace inflation, and even if some food and energy prices ease, the sheer difficulty in paying a rent or mortgage may further undermine any sense of security."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/jeffrey-donaldson-slams-dublin-over-attack-on-uk-amnesty-law-ireland-has-had-an-amnesty-for-terrorists-for-years-4453670",
        "title": "Jeffrey Donaldson slams Dublin over attack on <b>UK</b> amnesty law: &#39;Ireland has had an amnesty for terrorists for years&#39;",
        "description": "The Irish Government has been challenged to say what it is doing to deal with Troubles&#39; legacy cases in its jurisdiction by DUP leader Sir Jeffrey Donaldson."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/political-pantomime-must-end-now-that-talks-have-concluded-robbie-butler-4453671",
        "title": "&#39;<b>Political</b> pantomime&#39; must end now that talks have concluded: Robbie Butler",
        "description": "The “political pantomime” in Northern Ireland must end as the legislation governing the post-Brexit trading arrangements is not going to change, Robbie Butler has said."
    },
    {
        "url": "https://www.chroniclelive.co.uk/whats-on/music-nightlife-news/human-league-announce-north-east-28326892",
        "title": "The Human League announce North East date with tickets on sale Friday",
        "description": "The experimental electronic band, who formed in 1977 and are going strong more than 45 years later, are the latest addition to the summer line-up at Herrington Country Park where they will take to the stage in July. Tickets to the show will go on sale this Friday, December 22."
    },
    {
        "url": "https://metro.co.uk/2023/12/20/putin-vows-defend-russia-confront-west-dies-20001486/?ico=read_full_story_videopage",
        "title": "Putin’s chilling promise to the West will send shivers down your spine",
        "description": "He told his security agencies: ‘Of course, we must thwart any attempts by foreign intelligence services to destabilise the social and <b>political</b> situation in Russia ... the world’s top stories? Metro.co.<b>uk</b> is now on WhatsApp sending vital updates ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/leo-varadkar-uk-government-micheal-martin-chris-heatonharris-government-b1128365.html",
        "title": "<b>UK</b> Government ‘profoundly regrets’ legal action by Irish against Legacy Act",
        "description": "The Taoiseach said the “strong” legal advice was that the <b>UK</b> Legacy Act breached the UN Convention on Human Rights. The Act received royal assent in September despite widespread opposition from <b>political</b> parties, victims’ organisations in Northern ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/jeffrey-donaldson-and-ni-secretary-hit-out-at-inconsistent-irish-government-over-troubles-bill-legal-case-against-uk/a1842118595.html",
        "title": "Jeffrey Donaldson accuses Irish Government of ‘double standards’ over Troubles bill legal case against <b>UK</b>",
        "description": "The legislation has been opposed by the five main <b>political</b> parties in Northern Ireland, the Irish Government and victims’ rights groups. The <b>UK</b> government argues the legislation aims to deliver on its pledge to deliver better outcomes for those most ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24004054.donaldson-accuses-irish-government-double-standards-legacy-challenge/",
        "title": "Donaldson accuses Irish Government of double standards over legacy challenge",
        "description": "“I think the <b>UK</b> Government would take a similar view to many who would ... despite the clear opposition and concerns raised by victims and families, all <b>political</b> parties, the Irish Government, the US, UN, the Council of Europe and human rights experts."
    }
]