[
    {
        "url": "https://inews.co.uk/news/grant-shapps-claims-woke-extremist-culture-is-rife-in-the-british-army-2901458?ico=above_article_ticker",
        "title": "Grant Shapps claims woke extremist culture is rife in the British Army",
        "description": "The Defence Secretary claimed the armed forces resources are being &#39;squandered to promote a political agenda&#39;."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24112685.james-norton-nicole-scherzinger-stranger-things-take-top-theatre-gongs/",
        "title": "James Norton, Nicole Scherzinger and Stranger Things take top theatre gongs",
        "description": "Best new musical was won by Second World War comedy Operation Mincemeat, which arrived in the West End last year at the Fortune Theatre, and Sex Education star Aimee Lou Wood won best takeover for her turn as Cabaret’s Sally Bowles at the Kit Cat Club at the Playhouse Theatre."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/grant-shapps-army-resources-squandered-political-agenda/",
        "title": "Army resources being squandered for <b>political</b> agenda, warns Grant Shapps",
        "description": "Defence Secretary says military needs a ‘proper shake-up’ to refocus its core mission of ‘being a lethal fighting force’"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/11/immigration-minister-thinks-rwanda-policy-will-break-law/",
        "title": "Leaked documents show even immigration minister thinks Rwanda policy will break law",
        "description": "When solicitor general, Michael Tomlinson advised that ignoring Strasbourg injunctions blocking flights would put UK in breach of ECHR"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-azhar-ali-rochdale-election-offensive-israel-claims-b1138450.html",
        "title": "Labour Rochdale by-election candidate apologises for ‘deeply offensive’ Israel claims",
        "description": "A Labour by-election candidate has apologised for his “deeply offensive” comments, after he reportedly said Israel allowed Hamas to carry out its October 7 attack to provide grounds to invade Gaza."
    },
    {
        "url": "https://www.irishnews.com/news/politics/dup-extra-cash-for-casement-on-fair-basis-with-other-sports-ERJRNFCE5NEYLFUW4EMPC737WY/",
        "title": "DUP: Extra cash for Casement on ‘fair basis’ with other sports",
        "description": "The new DUP deputy first minister has said any extra money for Casement Park must be on a “fair and equitable basis” with other sports. Emma Little-Pengelly said her party had never opposed the planned upgrade of the west Belfast stadium as part of a funding package alongside soccer’s Windsor Park and rugby’s Ravenhill ground."
    },
    {
        "url": "https://news.sky.com/story/labour-candidate-wrong-to-say-israel-allowed-7-october-attack-13069105",
        "title": "Labour candidate &#39;wrong&#39; to say Israel allowed 7 October attack",
        "description": "Remarks made by Azhar Ali have been branded &quot;warped&quot; and &quot;disgraceful&quot; by the Jewish community, which fears they could further fuel hostility, but with the deadline for nominations closed it is too late for the party to replace him."
    },
    {
        "url": "https://www.derrynow.com/news/northern-ireland/1420551/where-will-antiques-roadshow-value-publics-treasures-in-2024.html",
        "title": "Where will Antiques Roadshow value public’s treasures in 2024?",
        "description": "The Antiques Roadshow team is hitting stately homes and castles throughout the UK this summer to value the public’s hidden treasures for a 47th series. Question Time presenter Fiona Bruce said she is “always drawn in by a moving personal story” ahead of the 59-year-old filming her"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071627/Grant-Shapps-British-Armys-inclusion-policy-security-checks-diversity.html",
        "title": "Furious Grant Shapps orders review into British Army&#39;s &#39;woke nonsense&#39; inclusion policy amid reports chiefs &#39;want to relax security checks for overseas recruits to boost diversity&#39;",
        "description": "Mr Shapps is said to be &#39;genuinely furious about this woke nonsense&#39; and does not believe such policies are the way to address the military&#39;s recruitment crisis."
    },
    {
        "url": "https://uk.news.yahoo.com/europhile-alexander-stubb-returns-finnish-195537942.html",
        "title": "Europhile Alexander Stubb returns to Finnish <b>politics</b> as president",
        "description": "Former prime minister, triathlete and Europhile Alexander Stubb secured a triumphant return to politics Sunday after a seven-year hiatus, winning the Finnish presidency in Sunday&#39;s election.Upon winning the election,"
    },
    {
        "url": "https://www.theguardian.com/australia-news/2024/feb/12/morning-mail-greens-threaten-to-stall-housing-bill-nato-pushes-back-at-trump-bring-back-boris-call-in-uk",
        "title": "Morning Mail: Greens threaten to stall housing bill, Nato pushes back at Trump, ‘Bring back Boris’ call in <b>UK</b>",
        "description": "Greens say they will use balance of power in Senate to compel Labor into action on negative gearing"
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/11/michael-gove-says-no-fault-evictions-will-be-banned-this-year",
        "title": "Michael Gove says no-fault evictions will be banned this year",
        "description": "UK housing minister promises section 21 evictions in England will have ended by time of general election"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68266845.amp",
        "title": "Pakistan election: Pact may shut out Imran Khan supporters",
        "description": "Pakistan&#39;s second and third political blocs have agreed to co-operate after elections in which jailed ex-PM Imran Khan&#39;s supporters came first. Ex-PM Nawaz Sharif&#39;s PMLN and Bilawal Bhutto Zardari&#39;s PPP issued a statement saying they planned to work together to bring political stability."
    },
    {
        "url": "https://www.thenational.scot/politics/24112595.snps-current-policy-general-election-entirely-misconceived/",
        "title": "SNP’s current policy for the General Election is entirely misconceived",
        "description": "I got a letter from Messrs Yousaf and Flynn seeking financial support for the SNP’s Westminster campaign. It says the manifesto"
    },
    {
        "url": "https://www.ft.com/content/e2b5444e-8bf1-4858-99ce-a34e1817f046",
        "title": "Biden hosts Jordan’s King Abdullah and <b>UK</b> holds by-elections",
        "description": "The attempt to find a solution to the Israel-Gaza conflict comes to Washington on Monday with President Joe Biden playing host to King Abdullah of Jordan. The meeting has been billed as an effort to find “an enduring end” to the crisis in Gaza, including “a two-state solution with Israel’s security guaranteed”, according to a White House statement."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/rumblings-within-dup-continue-as-emma-little-pengelly-defends-return-to-stormont/a1889379380.html",
        "title": "Rumblings within DUP continue as Emma Little-Pengelly defends return to Stormont",
        "description": "Deputy First Minister Emma Little-Pengelly has defended the DUP’s return to Stormont after senior party figures said that “there is still a border in the Irish Sea”."
    },
    {
        "url": "https://www.thetimes.co.uk/article/clean-it-up-campaign-one-year-anniversary-935scqps2",
        "title": "Clean It Up campaign one year on: what progress has been made?",
        "description": "As we reach the first anniversary of our fight to tackle water pollution, we review any steps that have been taken to overhaul the damage done to UK waterways"
    },
    {
        "url": "https://www.ft.com/content/22d64199-ed9b-4b2c-a725-e0f22c395ce2",
        "title": "Challenging era puts the traditional MBA under scrutiny",
        "description": "While much of the polemic is focused on undergraduate education, even business schools have not been exempt from a level of criticism and antagonism not seen in more than half a century — since the McCarthy era of the 1950s, or the Vietnam war in the late 1960s and early 1970s."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865547/Defence-Secretary-Grant-Shapps-goes-to-war-on-poisonous-woke-nonsense",
        "title": "Defence Secretary Grant Shapps goes to war on &#39;poisonous&#39; woke nonsense",
        "description": "Exclusive: The Cabinet Minister warned the &quot;drumbeat of those who despise Britain&quot; is failing the army and the public."
    },
    {
        "url": "https://www.independent.co.uk/voices/editorials/brexit-trade-economy-failure-bad-situation-b2494414.html",
        "title": "It’s time to face facts – we are all the poorer for Brexit",
        "description": "Editorial: A full four years after Brexit came into effect, the balance sheet is not looking good, whether it is for trade, investment or standards of living"
    },
    {
        "url": "https://fortune.com/2024/02/11/how-many-seats-election-pakistan-imran-khan-inflation/",
        "title": "Asia’s fastest inflation just got a <b>political</b> crisis as Pakistan’s middle class throws majority to jailed Imran Khan’s party",
        "description": "Khan, in prison, is unlikely to be able take part in <b>politics</b> himself. He still faces more than 170 charges, which he says are politically motivated. The US, <b>UK</b> and the European Union have expressed concerns about polling irregularities. Pakistan’s ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24112569.liz-truss-stands-alone-ridiculous-tory-fringe-figures/",
        "title": "Liz Truss stands alone as the most ridiculous of Tory fringe figures",
        "description": "I’m a connoisseur of the madder corners of the Conservative and Unionist Party. I always have been. I first picked up the"
    },
    {
        "url": "https://uk.yahoo.com/news/top-playwright-blames-boris-johnson-173522632.html",
        "title": "Top playwright blames Boris Johnson and Donald Trump for ‘madness’ in modern <b>politics</b>",
        "description": "Britain’s top political playwright James Graham has accused Boris Johnson and Donald Trump of taking politics to “a new level of madness”. Graham, who wrote the hit TV drama about Brexit, The Uncivil War, starring Benedict Cumberbatch, is renowned for his even-handed approach and for avoiding revealing his own political stance."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24112551.celtic-humza-yousaf-charge-makes-green-around-gills/",
        "title": "Celtic: Humza Yousaf being in charge makes me green around the gills",
        "description": "It showcases ingenuity and a pleasing can-do attitude that doesn’t mess about if you want to access power very quickly."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-inflation-rise-possible-recession-budget-hunt-2901153?ITO=msn",
        "title": "<b>UK</b> set for inflation rise and possible recession in double Budget blow for Hunt",
        "description": "The Office for National Statistics will publish data on inflation and GDP growth in the coming days, ahead of the Budget"
    },
    {
        "url": "https://www.runcornandwidnesworld.co.uk/news/national/24112531.brianna-gheys-mother-tells-vigil-teenager-amazing-unique-joyful/",
        "title": "Brianna Ghey’s mother tells vigil teenager was ‘amazing, unique and joyful’",
        "description": "It marked one year since the 16-year-old was murdered by teenagers Scarlett Jenkinson and Eddie Ratcliffe in a park in Cheshire."
    },
    {
        "url": "https://www.globalgovernmentforum.com/defeating-disinformation-how-to-create-a-healthier-national-conversation/",
        "title": "Defeating disinformation: how to create a healthier national conversation",
        "description": "Meanwhile the threat posed by online disinformation is becoming ever greater, points out security expert Elisabeth Braw, a senior associate fellow at the European Leadership Network and a member of the UK’s National Preparedness Commission."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/i-found-hard-coming-out-32100353",
        "title": "&#39;I found it hard coming out, now I might be about to become <b>UK</b>&#39;s most senior gay politician&#39;",
        "description": "Jeremy Miles, who will become First Minister if elected leader of the Welsh Labour Party, shared how he found it difficult growing up as a child in the 1980s and later coming out"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/taylor-swift-super-bowl-performance-32100129.amp",
        "title": "Taylor Swift Super Bowl performance rumours grow as fans remember previous Usher duet",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. READ MORE: <b>UK</b> NFL Superbowl fans can tap into American coverage with simple 99p pass A clip of the pair has been seen and shared widely on TikTok, which sees ..."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24112505.family-tommy-vance-signs-off-radio-station-recreating-voice-using-ai/",
        "title": "Family of Tommy Vance signs off on radio station recreating his voice using AI",
        "description": "The family of radio DJ Tommy Vance have agreed that his voice can be rebroadcast using artificial intelligence (AI). The former BBC Radio 1 star, who had also been a Top Of The Pops presenter, died at the age of 63 in 2005 after a stroke."
    },
    {
        "url": "https://www.lbc.co.uk/news/brianna-ghey-vigil-esther/",
        "title": "Brianna Ghey&#39;s mum Esther gives tearful tribute to murdered trans teen on first anniversary of killing",
        "description": "Brianna Ghey&#39;s mother Esther joined mourners to mark one year since the transgender teenager was murders by two child killers."
    },
    {
        "url": "https://uk.news.yahoo.com/finns-vote-president-guide-policy-080254371.html",
        "title": "Former PM Alexander Stubb wins Finnish presidency, narrowly defeating ex-top diplomat Pekka Haavisto",
        "description": "Former Prime Minister Alexander Stubb won Finland’s election runoff Sunday against ex-Foreign Minister Pekka Haavisto in a close race for the presidency and the task of steering the Nordic country’s foreign and security policy now that it is a member of NATO,"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/local-news/guide-dog-puppy-raisers-needed-9088516",
        "title": "Guide dog &#39;puppy raisers&#39; are needed in Leicestershire as charity appeals for help",
        "description": "With your support, we can help train more life-changing guide dogs for people in the <b>UK</b> living with sight loss.” The charity is holding a puppy-raising information day for people interested in the role on Saturday, February 24, from 10am until 1pm ..."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24112353.alister-jack-urges-first-minister-give-update-lord-advocate-reforms/",
        "title": "Alister Jack urges First Minister to give update on Lord Advocate reforms",
        "description": "Mr Jack, the Secretary of State for Scotland, asked Humza Yousaf in a letter where the Scottish Government stands on the issue."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/its-time-crown-best-pub-9085958",
        "title": "It&#39;s time to crown the best pub in Cornwall - vote for your favourite",
        "description": "Nothing beats a night at your favourite local pub in Cornwall. Whether you enjoy a pint and some hearty pub grub, or prefer to knock back shots with your mates, we all have our favourite spots."
    },
    {
        "url": "https://www.bbc.co.uk/news/live/uk-politics-68260851/page/2",
        "title": "Gove pledges end of no-fault evictions by election",
        "description": "Housing Secretary Michael Gove pledges that by the next election, the government will have ended no-fault evictions; The practice sees a landlord use Section 21 of the Ho"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/trump-johnson-james-graham-politics-b2493681.html",
        "title": "Top playwright blames Boris Johnson and Donald Trump for ‘madness’ in modern <b>politics</b>",
        "description": "Britain’s top political playwright James Graham has accused Boris Johnson and Donald Trump of taking politics to “a new level of madness”. Graham, who wrote the hit TV drama about Brexit, The Uncivil War, starring Benedict Cumberbatch, is renowned for his even-handed approach and for avoiding revealing his own political stance."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865534/nigel-farage-house-of-lords-reform-plaid-carmen-smith-comment",
        "title": "Nigel Farage cannot get in the Lords but a 27-year-old Welsh nationalist can",
        "description": "Plaid Cymru activist Carmen Smith has just been nominated as the UK&#39;s youngest peer aged just 27, but does her arrival suggest the Lords is not fit for purpose?"
    },
    {
        "url": "https://news.sky.com/story/natwest-to-pay-out-163350m-bonus-pot-as-ministers-prepare-share-sale-13069270?dcmp=snt-sf-twitter",
        "title": "NatWest to pay out £350m bonus pot as ministers prepare share sale",
        "description": "The taxpayer-backed lender&#39;s bonus pool will be marginally lower than the £367m awarded a year ago, Sky News learns."
    },
    {
        "url": "https://www.itv.com/news/2024-02-11/shapps-orders-mod-diversity-policy-review-as-hes-furious-with-woke-nonsense",
        "title": "Grant Shapps orders MoD diversity policy review as he&#39;s &#39;furious with woke nonsense&#39;",
        "description": "The defence secretary is responding to reports that the Army wants to ease security checks for overseas recruits. | ITV National News"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24112383.uk-deeply-concerned-planned-israeli-offensive-rafah/",
        "title": "<b>UK</b> ‘deeply concerned’ about planned Israeli offensive in Rafah",
        "description": "Warnings against a planned Israeli invasion of the southern Gaza city of Rafah are mounting, with UK politicians saying it would be “catastrophic” for civilians. Rafah, on the border with Egypt, is one of the only regions not yet targeted by an Israeli ground offensive and is providing refuge to more than half of Gaza’s 2."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/by-election-rules-azhar-ali-b2494375.html",
        "title": "Why a parliamentary candidate can’t be removed by a party in the weeks up to an election",
        "description": "The withdrawal notice must be signed by the candidate, attested by a witness and delivered by 4pm on the 19th working day before the poll. In this instance, since the by-election is on the 29 Feburary, the notice would have to have been delivered by 2 February. The short answer is you can’t."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68262751",
        "title": "Clare Rewcastle Brown: <b>UK</b> journalist says Malaysia sentence is &#39;<b>political</b> revenge&#39;",
        "description": "UK journalist Clare Rewcastle Brown has accused Malaysia of seeking &quot;political revenge&quot; for her reporting after a court jailed her in absentia. The 64-year-old is appealing a surprise conviction for criminal defamation of a Malaysian royal handed down this week."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24112352.allies-ex-pm-khan-win-biggest-share-seats-final-pakistan-election-tally/",
        "title": "Allies of ex-PM Khan win biggest share of seats in final Pakistan election tally",
        "description": "People from his PTI party ran as independents because of moves by the Election Commission and Supreme Court to cripple their participation."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865510/124-migrants-make-dangerous-Channel-crossing-on-Saturday",
        "title": "Three boats loaded with 124 migrants make dangerous Channel crossing on Saturday",
        "description": "The latest arrivals brings the total for the year to 1,506 which is down from the 2,072 by the same point in 2023 but up from 1,339 in 2022."
    },
    {
        "url": "https://www.thenational.scot/politics/24111507.scotland-weeks-seize-independence-opportunity/",
        "title": "Scotland has only a few weeks to seize this independence opportunity",
        "description": "They need to demonstrate both national self-respect and <b>political</b> self-preservation in this fag-end of ... the opportunities with which to rid ourselves of the worst period of <b>UK</b> Government this century before the next worst comes to power with equally ..."
    }
]