[
    {
        "url": "https://www.independent.co.uk/business/hunt-to-tell-davos-summit-britain-is-on-the-up-and-open-for-business-b2480543.html",
        "title": "Hunt to tell Davos summit: Britain is on the up and open for business",
        "description": "Chancellor Jeremy Hunt will tell <b>political</b> and business leaders at the World Economic Forum that the <b>UK</b> is “on the up and open for business”. Mr Hunt’s trip to the exclusive Swiss ski resort of Davos to join the annual gathering of international ..."
    },
    {
        "url": "https://uk.news.yahoo.com/congress-hunts-rarest-beast-bipartisan-004454483.html",
        "title": "Congress Hunts The Rarest Beast: Bipartisan Election-Year Deals",
        "description": "Landing even one deal would be considered a win before lawmakers depart for the campaign trail this summer, when partisan presidential <b>politics</b> kicks into high gear and action on Capitol Hill hits a standstill. House and Senate leaders have made some ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/political-deepfakes-fool-voters-2857811?ico=most_popular",
        "title": "<b>Political</b> deepfakes can fool 42% of voters, study finds",
        "description": "Research finds widespread public fears about integrity of UK elections and a vulnerability to false statements on social media"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/17/british-politics-chaos-red-wall-voters-world",
        "title": "Forget everything you thought you knew about British <b>politics</b>. In 2024, we’re in the age of chaos",
        "description": "Essex man’, ‘Stevenage woman’, ‘red wall’ – labelling voters like this is completely misguided, says author Dan Evans"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/stephen-colbet-ugly-truth-republicans-party-late-show-monologue_uk_65a7842de4b076abd7a99a7e",
        "title": "Stephen Colbert Gives Republican Voters The Ugliest Truth About Their Own Party",
        "description": "US talk show host Stephen Colbert used an awful case in Florida to confront Republican voters about their support for Donald Trump. The Florida Republican Party last week ousted Christian Ziegler as chair when it was revealed he is under a police investigation for alleged sexual assault."
    },
    {
        "url": "https://www.edp24.co.uk/news/24053230.major-poll-put-conservatives-narrowly-ahead-norfolk/",
        "title": "Major poll put Conservatives narrowly ahead in Norfolk",
        "description": "A major new poll has suggested that the Conservatives’ grip on Norfolk teeters in the balance, with several seats within grasping distance"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/labour-keir-starmer-policy-manifesto-election-b2480356.html",
        "title": "What does Labour’s new ‘campaign guide’ tell us about its policies?",
        "description": "S ome decades ago, the Conservatives and then New Labour used to produce thick compendiums for their candidates and party workers at general election time. The Conservative Campaign Guide was the model – a volume containing killer stats, quotes, boasts, and attacks on opposition parties and personalities of a kind that would be unlikely to pass a present-day fact check, but proved useful on ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-67981000",
        "title": "NI strike: Thousands of public sector workers stage 24-hour stoppage",
        "description": "The strikes are happening due to escalating pay disputes, with many public sector workers in Northern Ireland paid less than counterparts in the rest of the <b>UK</b>. This, combined with the cost-of-living crisis and the ongoing <b>political</b> crisis which has seen ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24057449.tiny-treasures-queen-marys-dolls-house-go-show-windsor-castle/",
        "title": "Tiny treasures from Queen Mary’s Dolls’ House go on show at Windsor Castle",
        "description": "King George V and Queen Mary in their coronation robes in 1911 (PA) Tickets and visitor information is available at www.rct.<b>uk</b> or +44 (0)303 123 7304."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24057443.government-must-address-weaknesses-led-student-loan-fraud---nao/",
        "title": "Government must address ‘weaknesses’ that led to student loan fraud – NAO",
        "description": "A Universities <b>UK</b> (UUK) spokeswoman said: “Franchise provision makes an important contribution to widening participation and promoting access to higher education, and this report highlights the importance of careful management of franchise partnerships ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/ni-secretary-voices-dismay-at-stormont-stalemate-as-public-sector-workers-strike-b1133105.html",
        "title": "NI Secretary voices dismay at Stormont stalemate as public sector workers strike",
        "description": "“The people of Northern Ireland deserve local <b>political</b> leadership from representatives they have elected to govern on their behalf. “The <b>UK</b> Government has made a significant offer that would help address the challenges facing public sector pay and ..."
    }
]