[
    {
        "url": "https://www.bbc.com/mediacentre/2024/annita-ben-geeta-appointed-chief-presenters-bbc-news-channel",
        "title": "Annita McVeigh, Ben Brown and Geeta Guru-Murthy appointed as chief presenters for BBC News Channel",
        "description": "Annita McVeigh, Ben Brown and Geeta Guru-Murthy will take up chief presenting roles on the BBC’s news channel – BBC News – which is broadcast in the UK and around the world."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/bbc-strictly-come-dancings-nikita-32026295",
        "title": "BBC Strictly Come Dancing&#39;s Nikita Kuzmin brutally booed by audience during live show",
        "description": "Strictly Come Dancing pro Nikita Kuzmin was booed by the audience during the show&#39;s live tour, after a secret was spilled by fellow dancer Kai Widdrington"
    },
    {
        "url": "https://www.ibtimes.co.uk/repercussions-affect-us-most-youngsters-say-what-they-really-think-about-brexit-1723157",
        "title": "&#39;The Repercussions Affect Us The Most&#39;: Youngsters Say What They Really Think About Brexit",
        "description": "Those who were unable to vote when the Brexit referendum was held in 2016, now aged 19 to 21 years old, revealed to International Business Times UK how the independence scheme has changed their lives."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-68155422?at_link_type=web_link&at_link_origin=BBCPolitics&at_link_id=3AC56916-C12E-11EE-AB2C-201587A28522&at_campaign_type=owned&at_medium=social&at_campaign=Social_Flow&at_format=link&at_bbc_team=editorial&at_ptr_name=twitter",
        "title": "Stormont: Assembly to sit on Saturday as DUP boycott ends",
        "description": "The Northern Ireland Assembly is to sit on Saturday after the Democratic Unionist Party (DUP) ended its boycott of the power-sharing institutions. The DUP leader Sir Jeffrey Donaldson wrote to the Speaker following the passage of legislation in the House of Commons on Thursday."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/latest-northern-ireland-wide-public-transport-strike-causes-considerable-disruption-laments-business-chief-4502238",
        "title": "Latest Northern Ireland-wide public transport strike causes &#39;considerable disruption&#39; laments business chief",
        "description": "Another Northern Ireland-wide public transport strike has caused “considerable disruption” to commerce, and further planned action should be frozen in light of political progress, a business chief has said."
    },
    {
        "url": "https://metro.co.uk/2024/02/01/holocaust-film-zone-interest-a-warning-us-20211256/?ico=trending-post-strip_item_3",
        "title": "Why Holocaust film The Zone of Interest is a warning to us all",
        "description": "The Zone of Interest, which has been nominated for five Academy Awards including Best Picture, follows a family living in a house next door to Auschwitz. Directed by British filmmaker Jonathan Glazer, who is also nominated for Best Director, it stars German actor Christian Friedel as Auschwitz commandant Rudolf Hoss."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68166050.amp",
        "title": "Christopher Steele: Orbis welcomes High Court victory over Trump",
        "description": "A British consultancy that compiled a salacious dossier linking Donald Trump to Russia has welcomed a UK High Court decision to throw out a lawsuit by the former US president. Orbis Business Intelligence - run by ex-MI6 officer Christopher Steele - said it was &quot;delighted&quot; by the ruling."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/public-transport-strike-4502238",
        "title": "Public transport strike",
        "description": "Another Northern Ireland-wide public transport strike has caused “considerable disruption” to commerce, and further planned action should be frozen in light of political progress, a business chief has said."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rishi-sunak-latest-news-hunt-frost-farage-blair/?utmsource=email",
        "title": "Starmer to press ahead with Labour plans to ‘level-up workers’ rights’",
        "description": "Rachel Reeves has refused to give a commitment to lift income tax thresholds. The shadow chancellor said the tax burden is the “highest it has been in 70 years” but it would be “damaging” to promise tax cuts without knowing how they would be paid for."
    },
    {
        "url": "https://www.ibtimes.co.uk/ex-pm-boris-johnson-attacks-rishi-sunaks-new-brexit-deal-1723151",
        "title": "Ex-PM Boris Johnson Attacks Rishi Sunak&#39;s New Brexit Deal",
        "description": "ex-PM Boris Johnson has attacked Rishi Sunak&#39;s new Brexit deal with the DUP, warning that it could force the <b>UK</b> to abide by EU trade rules in the future. This week, Sunak revealed new arrangements to remove routine checks on goods moving from Great Britain ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/former-rochdale-mp-simon-danczuk-28554289",
        "title": "Former Rochdale MP Simon Danczuk is standing in a by-election for his old seat",
        "description": "Former Rochdale MP Simon Danczuk has announced he is seeking to reclaim his old seat in Parliament. The ex-Labour MP will represent Reform UK - the party founded by former UKIP leader Nigel Farage - at the Rochdale by-election later this month."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24092205.irish-sea-border-remains-stormont-deal-claims-loyalist-jamie-bryson/",
        "title": "Irish Sea border remains after Stormont deal, claims loyalist Jamie Bryson",
        "description": "The move comes after the DUP agreed a package of measures with the UK Government that party leader Sir Jeffrey Donaldson says has effectively removed the trading border for goods moving from Great Britain to, and staying in, Northern Ireland."
    },
    {
        "url": "https://www.cambridgeindependent.co.uk/news/from-cambourne-to-cambridge-residents-walk-to-join-gaza-mar-9351226/",
        "title": "Cambourne residents walk to Cambridge to fundraise for Gaza charity",
        "description": "A group of Cambourne residents walked into Cambridge at the weekend as a fundraiser for a charity caring for Gazan residents caught up in the turmoil in Palestine. The walk, which went along St Neots Road, through Madingley and into the centre of Cambridge, joined up with a pro-Palestine march taking place in the city on Saturday afternoon."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/24091924.george-freeman-constituents-feel-short-changed/",
        "title": "George Freeman: Constituents should feel short-changed",
        "description": "Who would have expected telling the truth about life in broken Britain would come from one of the Government’s own?"
    },
    {
        "url": "https://www.thesun.co.uk/news/25664007/harry-cole-imf-bank-of-england/",
        "title": "IMF chief can’t see into future with his broken crystal ball… but he’s far from alone, we have the Bank of England",
        "description": "JEREMY Hunt has gone all Eeyore again on tax cuts. He spent January breaking all usual pre-Budget norms by talking up the prospects of more giveaways in five weeks time – but now the"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68174557",
        "title": "<b>UK</b> Covid inquiry in Scotland: Three weeks in 90 seconds",
        "description": "The UK Covid 19 inquiry has spent three weeks in Edinburgh looking at the decisions made in Scotland during the pandemic."
    },
    {
        "url": "https://www.standard.co.uk/comment/russia-ukraine-world-war-three-vladimir-putin-b1136411.html",
        "title": "Nato analysts fear Vladimir Putin has a 10-year-war plan aimed at dominating Europe",
        "description": "This chimes with warnings from Defence Secretary Grant Shapps and the head of the <b>UK</b> Army, General Sir Patrick Sanders ... Russia and Ukraine’s mutual and intertwined destinies, seem <b>political</b> science fiction. But the dreaming is matched with some ..."
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-nato-analysts-fear-vladimir-192223828.html",
        "title": "OPINION - Nato analysts fear Vladimir Putin has a 10-year-war plan aimed at dominating Europe",
        "description": "Senior Nato analysts have advised the Supreme Commander of the alliance, General Christopher Cavoli, that Vladimir Putin is already carrying out a 10-year offensive to expand Russia’s power across Europe."
    },
    {
        "url": "https://inews.co.uk/news/politics/millions-to-face-stealth-tax-squeeze-but-hunt-moves-away-from-inheritance-tax-cut-2885389?ico=related_article_inline",
        "title": "Millions to face ‘stealth tax’ squeeze but Hunt moves away from inheritance tax cut",
        "description": "Jeremy Hunt will be unable to fully reverse the ‘fiscal drag’ stealth tax that drags millions of earners into higher tax thresholds in the Budget – meaning despite any tax cuts the Conservatives will still have presided over the biggest tax-raising parliament on record."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7165757",
        "title": "<b>Politics</b> latest: MP once targeted with axe warns &#39;horrific&#39; death threats are getting worse",
        "description": "Watch live in the stream at the top of this page, and follow all the latest updates and key moments right here in the <b>Politics</b> Hub. Northern Ireland has a different type of governance from the rest of the <b>UK</b> in response to decades of conflict within the ..."
    },
    {
        "url": "https://news.sky.com/story/bleak-economic-backdrop-and-raw-politics-explain-labours-looming-climbdown-on-green-investment-pledge-13061618",
        "title": "Bleak economic backdrop and raw <b>politics</b> explain Labour&#39;s looming climbdown on green investment pledge",
        "description": "With the prospect of an election win within Labour&#39;s grasp, Rachel Reeves doesn&#39;t seem to want to take the risk of sticking to Labour&#39;s green investment pledge. New economic forecasts in the March budget could well be her escape route."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24091391.middlesbrough-residents-back-unite-support-uk-steel-campaign/",
        "title": "Middlesbrough residents back Unite Support <b>UK</b> Steel campaign",
        "description": "Residents of Grisedale Crescent in Middlesbrough came out in solidarity today to support the Support UK Steel campaign organised by Unite"
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-01/dolphin-found-dead-hours-after-being-rescued-from-beach",
        "title": "Dolphin found dead hours after being rescued from Ynys Môn beach",
        "description": "The dolphin appeared to successfully swim back into open water after being beached, but was found dead hours later. | ITV News Wales"
    },
    {
        "url": "https://www.ft.com/content/6660f1ec-ff38-4904-9cf6-f99f1d61d2c9",
        "title": "Reform <b>UK</b> accepted donations from Crispin Odey despite sexual assault allegations",
        "description": "The right-wing party Reform UK accepted a political donation from disgraced financier Crispin Odey two months after he was accused of sexual misconduct."
    },
    {
        "url": "https://www.counterfire.org/article/shattered-nation-inequality-and-the-geography-of-a-failing-state-book-review/",
        "title": "Shattered Nation: Inequality and the Geography of A Failing State – book review",
        "description": "Danny Dorling’s new book, Shattered Nation, contains a wealth of data on the impact of inequality on British society over the last fifty years, finds Graham Kirkwood Britain is a failing state."
    },
    {
        "url": "https://www.thenational.scot/politics/24091812.note-contrast-treatment-nicola-sturgeon-alister-jack/",
        "title": "Note the contrast in treatment of Nicola Sturgeon and Alister Jack",
        "description": "ALISTER Jack at Covid inquiry was treated with deference and allowed to make political points without interruption – contrast with the way"
    },
    {
        "url": "https://www.heraldscotland.com/news/24092043.alex-salmond-labelled-embarrassment-show-turkish-state-tv/",
        "title": "Alex Salmond labelled &#39;embarrassment&#39; over show for Turkish state TV",
        "description": "Alex Salmond has been criticised after getting a television job courtesy of another autocratic regime. The Alba party leader, who in 2017 agreed to make a show for the Kremlin-funded RT channel, will now appear weekly on the network of Turkey’s state broadcaster."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/sinn-fein-michelle-oneill-first-minister-republicans-northern-ireland?ref=upstract.com",
        "title": "With Sinn Féin in first minister post, will republicans’ day have come at last?",
        "description": "Michelle O’Neill is poised for top job but Irish unity is unlikely to be, as she says, ‘within touching distance’"
    },
    {
        "url": "https://www.thenational.scot/news/24091798.tories-accused-using-covid-funds-michael-goves-union-paper/",
        "title": "Tories accused of using Covid funds for Michael Gove&#39;s Union paper",
        "description": "THE UK Government is facing allegations it may have “siphoned off Covid funds for its own political party ends” in order to work on"
    },
    {
        "url": "https://www.thesun.ie/news/976722/simon-danczuk-rochdale-mp-accused-rape-ex-husband-selfie-queen-karen-dumped-fiance/",
        "title": "Who is Simon Danczuk?",
        "description": "FORMER MP Simon Danczuk has been plagued by controversial moments over the last few years. He represented the constituency of Rochdale from 2010 and 2017. Here’s what else we know about him. Who"
    },
    {
        "url": "https://edition.cnn.com/2024/02/01/politics/uk-judge-dismissed-trumps-suit-against-ex-spy-who-wrote-russia-dossier/index.html",
        "title": "<b>UK</b> judge dismisses Trump’s suit against ex-spy behind controversial Russia dossier",
        "description": "A London judge has dismissed Donald Trump’s lawsuit against retired British spy Christopher Steele over his controversial 2016 dossier that contained unverified and salacious allegations about Trump’s ties to Russia."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24092022.100th-horizon-scandal-conviction-overturned-appeal-court/",
        "title": "100th Horizon scandal conviction overturned by appeal court",
        "description": "Three former subpostmasters were cleared of their convictions on Thursday, taking the total number of quashed convictions due to the scandal to 100."
    },
    {
        "url": "https://www.fool.co.uk/2024/02/01/3-ftse-100-and-ftse-250-value-stocks-id-buy-for-my-isa-today/",
        "title": "3 FTSE 100 and FTSE 250 value stocks I’d buy for my ISA today!",
        "description": "These hot stocks are currently on sale! Royston Wild explains why he thinks they are too cheap to miss for investors seeking a large passive income."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/dark-day-politics-mp-mike-freer-constituents-shock-decision-to-quit?ref=mc.news",
        "title": "‘Dark day for <b>politics</b>’: MP Mike Freer’s constituents’ shock at decision to quit",
        "description": "Justice minister Mike Freer is stepping down as MP for Finchley and Golders Green after death threats, abuse and intimidation"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-government-cap-corporation-tax-124529142.html",
        "title": "Labour government will cap corporation tax for five years, says Rachel Reeves",
        "description": "Shadow chancellor also defends move to allow unlimited bonuses for bankers and Labour’s apparent retreat on £28bn green spending pledge"
    },
    {
        "url": "https://metro.co.uk/2024/02/01/tv-stars-cancer-fears-drastic-weight-loss-hospital-dash-20209838/?ico=mosaic_tag",
        "title": "TV star’s cancer fears after drastic weight loss and hospital dash",
        "description": "A former Big Brother and Dragon’s Den star has revealed she is waiting to find out if she has cancer after being rushed to hospital twice. Rebecca Jane, 38, previously owned private investigation company The Lady Detective Agency, before appearing on Dragon’s Den in 2012 and going on to become a Big Brother housemate in 2017."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/01/political-parties-told-insulting-fake-campaign-newspapers-are-damaging-democracy/",
        "title": "<b>Political</b> parties told ‘insulting’ fake campaign newspapers are ‘damaging democracy’",
        "description": "The opinions in <b>Politics</b>.co.<b>uk</b>&#39;s Comment section are those of the author. The Society of Editors, an industry body representing around 400 <b>UK</b> national and regional media editors, has vowed to “name and shame” candidates and <b>political</b> parties who use ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/fake-newspapers-political-parties-election-2024-uk-editors/",
        "title": "Stop using ‘absurd’ fake newspapers, <b>political</b> parties told",
        "description": "The Society of Editors has vowed to name and shame political parties using “absurd” fake local newspapers as campaign material."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/boutique-hotels-bankruptcy-things-went-28550774",
        "title": "Boutique hotels to bankruptcy, where things went wrong for Lawrence Kenwright",
        "description": "When the <b>UK</b> economy began to feel the initial effects in March 2020 ... The Dixie Dean Hotel remains open and accepting bookings today. Council rows and <b>political</b> movements After enjoying a seemingly positive relationship with Liverpool City Council ..."
    },
    {
        "url": "https://uk.news.yahoo.com/wall-street-journal-slashes-d-234543572.html",
        "title": "The Wall Street Journal Slashes D.C. Staff in Newsroom Shake Up",
        "description": "Frederic J. Brown/AFP via GettyThe Wall Street Journal sharply cut its Washington, D.C. bureau staff on Thursday, letting nearly 20 reporters and various editors go as the paper re-envisions the bureau’s reporting structure."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/national/24091896.dup-gives-green-light-restoration-stormont-devolution-saturday/",
        "title": "DUP gives green light for restoration of Stormont devolution on Saturday",
        "description": "It comes after two pieces of legislation contained in the deal the party struck with the Government passed through the House of Commons."
    },
    {
        "url": "https://www.heraldscotland.com/news/24091815.uk-covid-inquiry-winners-losers-created/?ref=yahoo",
        "title": "<b>UK</b> Covid Inquiry: Have winners and losers been created?",
        "description": "Given the raw emotions around the UK Covid-19 Inquiry, it’s unlikely any of our politicians would talk openly about it creating winners and losers."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/01/jeremy-hunt-tax-cuts-conservatives-labour-uk-politics?filterKeyEvents=false&page=with:block-65bbcc818f080c2035dbcd89",
        "title": "Starmer says Labour would level up workers’ rights in way not attempted for decades – <b>UK politics</b> live",
        "description": "Labour leader tells conference that reforms ‘may not please everyone in room’"
    },
    {
        "url": "https://www.ft.com/content/78d3611e-a75f-4cf9-aa74-a6ac829d93b2",
        "title": "Four years on and Brexit still isn’t ‘done’",
        "description": "As for this week, the news agenda confirmed that Brexit isn’t “done” and — for European businesses at least — it’s only just getting started, with the introduction of new paperwork on products of plant and animal origin. Border inspections will start in May."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-covid-inquiry-created-winners-170346445.html",
        "title": "Has the <b>UK</b> Covid Inquiry created winners and losers?",
        "description": "Given the raw emotions around the UK Covid-19 Inquiry, it’s unlikely any of our politicians would talk openly about it creating winners and losers."
    },
    {
        "url": "https://inews.co.uk/culture/television/cheeky-chappy-traitors-harry-2884870?ico=related_article_inline",
        "title": "The reign of the lad is over – the cheeky chappy has taken over TV",
        "description": "From I&#39;m a Celebrity to The Traitors, a new male archetype - a clean-cut &#39;team player&#39; with a twinkle in his eye - is everywhere"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/24087943.test-valley-borough-council-local-plan-public-consultation-start/",
        "title": "Test Valley Borough Council local plan public consultation to start",
        "description": "TEST Valley Borough Council&#39;s new draft local plan will go out to public consultation for eight weeks. The local plan sets out the policies and principles that will guide development across the borough. It covers the period it 2040 and pubic consultation will start on February 6."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155026/rochdale-byelection-former-labour-mp-simon-danczuk-bids-to-become-rochdales-first-reform-mp",
        "title": "Rochdale by-election: former Labour MP Simon Danczuk bids to become Rochdale&#39;s first Reform MP",
        "description": "Former Rochdale MP Simon Danczuk is trying his hand at becoming the town’s MP again, by standing for Reform UK."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13034479/Sexting-shame-MP-Simon-Danczuk-exited-Commons-amid-explicit-messages-scandal-plots-return-Parliament-Reform-UKs-candidate-Rochdale-election.html",
        "title": "Sexting shame MP Simon Danczuk - who exited the Commons amid an explicit messages scandal - plots return to Parliament as Reform <b>UK</b>&#39;s candidate at Rochdale by-election",
        "description": "The 57-year-old is hoping to be re-elected to the seat he held for Labour between 2010 and 2017 when local voters go to the polls at the end of this month."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/andrew-bailey-jeremy-hunt-bank-houthi-red-sea-b1136460.html",
        "title": "Bank holds <b>UK</b> interest rates but signals cuts could be on the way",
        "description": "Policymakers at the Bank voted to keep interest rates on hold for the fourth time in a row but are keeping the level ‘under review’."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/americans-think-democracy-peril-2024-215154933.html",
        "title": "Americans think democracy is in peril in the 2024 election",
        "description": "It&#39;s a message both Trump and President Joe Biden are echoing as they gear up for a likely rematch in November. This is perhaps unsurprising in light of the lack of faith in elections that helped provoke the Jan."
    },
    {
        "url": "https://www.politics.co.uk/opinion-former/press-release/2024/02/01/make-uk-comment-on-pmi-data-11/",
        "title": "Make <b>UK</b> comment on PMI data",
        "description": "Commenting on today’s PMI data, James Brougham, Senior Economist at Make UK, said: “We’ve known for a while that this year was going to be tough with weak demand in major markets and continued supply chain disruptions."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/henry-smith-mp-signs-holocaust-educational-trust-book-of-commitment-4501876",
        "title": "Henry Smith MP signs Holocaust Educational Trust Book of Commitment",
        "description": "MP signs Holocaust Educational Trust Book of Commitment marking 79 years since the liberation of the concentration camps"
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/breaking-president-joe-biden-authorises-31999870.amp",
        "title": "President Joe Biden approves Iran revenge plan as US to strike targets in Iraq and Syria",
        "description": "Joe Biden previously vowed the US &quot;will respond&quot; after three American troops and dozens more were injured at a base near the Syrian border. He blamed the attack on the same Iran-backed militias which"
    },
    {
        "url": "https://www.mirror.co.uk/sport/football/transfer-news/duncan-mcguire-blackburn-sheffield-wednesday-32021661",
        "title": "Blackburn&#39;s Duncan McGuire deal back on after pulling plug while MLS star was on flight",
        "description": "Orlando City striker Duncan McGuire is set to join Blackburn Rovers on transfer deadline day - despite the Championship side initially cancelling the £3.2million deal"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rishi-sunak-latest-news-hunt-frost-farage-blair/",
        "title": "Starmer warns businesses he will &#39;level up&#39; workers&#39; rights",
        "description": "Jeremy Hunt has rebuked the boss of the UK’s economic watchdog after he appeared to liken last year’s public finance forecasts to a “work of fiction”. The Chancellor said Richard Hughes, the chairman of the Office for Budget Responsibility, was “wrong” and the comment “shouldn’t have been said”."
    },
    {
        "url": "https://www.walesonline.co.uk/news/health/string-health-board-scandals-prompt-28549259",
        "title": "String of health board scandals prompt call for NHS managers to be regulated",
        "description": "Calls have been made for a regulatory body overseeing the work of managers in the NHS following a string of scandals"
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24091525.mps-support-legislation-paving-way-return-stormont-powersharing/",
        "title": "MPs support legislation paving way for return of Stormont powersharing",
        "description": "Northern Ireland Secretary Chris Heaton-Harris sought to reassure MPs that the measures will not reduce the UK’s ability to diverge from EU rules."
    },
    {
        "url": "https://www.irishnews.com/entertainment/the-zone-of-interest-star-oscar-nominated-holocaust-film-is-a-warning-to-us-all-XXEABP2P55M4HFX4FNMV6JSRB4/",
        "title": "The Zone Of Interest star: Oscar-nominated Holocaust film is a warning to us all",
        "description": "Oscar nominee Sandra Huller has said her harrowing new Holocaust film The Zone Of Interest highlights behaviour that is not so far away from our current global political climate. The film, which is nominated for five Academy Awards including Best Picture, is a slice of life drama about a family living in a house and garden next to Auschwitz."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fraud-trial-verdict-2024-election-news-b2488627.html?page=2",
        "title": "Trump news live: Late-night hosts weigh in on ‘holy war’ between ex-president and Taylor Swift",
        "description": "Republican faces another financial blow in the courts as Judge Arthur Engoron’s decision in civil fraud trial looms"
    },
    {
        "url": "https://www.idealhome.co.uk/bedroom/bedroom-decor/bedroom-colour-mistakes",
        "title": "Don&#39;t fall for these mistakes when choosing a bedroom colour, warn design experts",
        "description": "‘While a paint card can give you a rough idea of the colour they aren’t an exact match,’ reveals Grazzie Wilson, Head of Creative at Ca’ Pietra and Proper Good Paint. ‘Test samples will give you a true idea of the colour in situ.’"
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/opinion/24090180.euro-notebook---farm-protests-anger-brussels-spreads/",
        "title": "Euro Notebook - Farm protests and anger against Brussels spreads",
        "description": "French farmers, renowned for their resilience, were unsurprisingly not going to be out-performed when it came to the art of protesting."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24091487.flat-faced-dogs-have-40-higher-risk-shorter-lives-breeds/",
        "title": "Flat-faced dogs ‘have 40% higher risk of shorter lives than other breeds’",
        "description": "Flat-faced dogs such as pugs and French bulldogs have a 40% increased risk of living shorter lives than other breeds, researchers have said. New study suggests the average life expectancy of all dogs in the UK is around 12.5 years, with the Lancashire heeler expected to live the longest at 15.4 years."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862204/Reform-UK-labour-party-Rochdale-byelection",
        "title": "Reform <b>UK</b> unveil ex-Labour MP as their candidate in Rochdale by-election",
        "description": "Reform UK has pulled off a shock coup after announcing their candidate for the upcoming Rochdale by-election will be none other than the constituency’s former Labour MP. Simon Danczuk will stand for Richard Tice’s party, after a by-election was called following the passing of incumbent MP Sir Tony Loyd a fortnight ago."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11898113/humza-yousaf-ridiculed-douglas-ross-embarrassing-admission-covid-whatsapps/",
        "title": "Humza Yousaf ridiculed by Douglas Ross after ’embarrassing admission’ unearthed in Covid WhatsApps",
        "description": "HUMZA Yousaf was wound up by his Tory rival at Holyrood today following the disclosure of his WhatsApps admission that he was “winging it” when he became Health Secretary. Scottish Conservative"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-corporation-tax-pledge-rachel-reeves-business-city-starmer-b1136292.html",
        "title": "Labour makes surprise 25% corporation tax pledge in new City charm offensive",
        "description": "Party also vows to get more women into boardrooms, saying financial services can&#39;t thrive by &#39;ignoring the talents of half of the workforce&#39;"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tory-mp-election-threat-mike-freer-b2488691.html",
        "title": "MPs plead for security help after Tory minister quits over death threats",
        "description": "Justice minister Mike Freer said he had avoided murder “by the skin of my teeth” – as MPs urged the government, their own parties and Commons authorities to do more to ensure proper security protection."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24088429.uk-covid-inquiry-shows-snp-greens-tarnished-civil-service/",
        "title": "<b>UK</b> Covid Inquiry shows SNP/Greens have tarnished civil service",
        "description": "Fighting back tears at the UK Covid Inquiry today, an emotional Nicola Sturgeon said she had felt “overwhelmed by the scale” of what she had"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/scottish-news/24088818.union-enters-formal-dispute-glasgow-nhs-job-cuts/",
        "title": "Union enters formal dispute with Glasgow NHS over job cuts",
        "description": "UNISON is leading a coalition of trade unions to &#39;raise the alarm&#39; over the looming budget crisis affecting Glasgow&#39;s health and social"
    },
    {
        "url": "https://www.thesun.co.uk/news/25660991/pro-hamas-bomber-gunman-procter-gamble-factory-turkey/",
        "title": "Pro-Hamas ‘suicide bomber’ poses with ‘explosive vest’ in chilling pic after storming US-owned factory &amp; taking hostages",
        "description": "A PRO-HAMAS alleged suicide bomber took staff hostage at a Procter &amp; Gamble factory as a protest against Israel’s attacks on Gaza. It was not immediately clear how many people were being"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032565/Donald-Trumps-data-protection-lawsuit-steele-dossier-dismissed.html",
        "title": "Breaking: Donald Trump&#39;s data protection lawsuit against <b>UK</b> firm Orbis over &#39;false and phoney&#39; allegations he took part in &#39;perverted&#39; sex acts and gave bribes to Russian ...",
        "description": "Trump&#39;s suit against a UK company responsible for a dossier which included unproven allegations that the ex-president took part in &#39;perverted sex parties&#39; has been thrown out ."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24090369.speaker-urges-mps-turn-heat-minister-quits-safety-concerns/",
        "title": "Speaker urges MPs to ‘turn down the heat’ as minister quits over safety concerns",
        "description": "Sir Lindsey Hoyle said Commons authorities “never stop looking ahead to see what else we can do to protect MPs” and insisted Parliament would “never give in to terrorism” or threats. In an interview with Sky News, he also urged MPs to “turn down the heat” in Parliament itself and set a better example for the public."
    },
    {
        "url": "https://www.countytimes.co.uk/news/24090701.urdd-eisteddfod-visitors-need-places-stay-powys/",
        "title": "Urdd Eisteddfod visitors need places to stay in Powys",
        "description": "self-catering or other types of tourist accommodation businesses who would like to be included on the Urdd Eisteddfod accommodation list for visitors are asked to send an email to Powys County Council at tourism@powys.gov.<b>uk</b> with their contact information ..."
    }
]