[
    {
        "url": "https://www.countytimes.co.uk/news/national/uk-today/24030308.uk-drivers-warned-5-000-fine-splashing-pedestrians/",
        "title": "<b>UK</b> drivers warned of £5,000 fine for splashing pedestrians",
        "description": "UK motorists have been warned that an immature driving act could land them with a £5,000 fine and three points on their licence. Amid heavy rain across the UK in recent months, and with more rain expected in the weeks ahead, drivers are being warned of a rule involving driving in puddles."
    },
    {
        "url": "https://www.northumberlandgazette.co.uk/news/politics/lib-dems-choose-two-new-prospective-parliamentary-candidates-for-seats-in-northumberland-4467856",
        "title": "Lib Dems choose two new Prospective Parliamentary Candidates for seats in Northumberland",
        "description": "Northumberland Liberal Democrats has confirmed two new appointments in its line-up of Prospective Parliamentary Candidates (PPCs) for the forthcoming General Election."
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042?ico=related_stories",
        "title": "The general election will be swayed by foreign policy – good news for Sunak",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/derek-draper-death-covid-garraway-28395767",
        "title": "Derek Draper life and death: From New Labour stalwart to Kate Garraway marriage and tragic Covid battle",
        "description": "Derek Draper has died at the age of 56, almost four years after becoming one of the first people to become seriously ill with Coronavirus. His wife, TV presenter Kate Garraway, confirmed the tragic news in an Instagram post on Friday (January 5)."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/no-one-should-grow-up-poor-sunak-says-after-tory-mp-s-crap-parenting-remark-107382/",
        "title": "No one should grow up poor, Sunak says after Tory MP’s ‘crap parenting’ remark",
        "description": "Bury North MP James Daly faced criticism over Christmas for suggesting most children who struggle in the town are ‘products of crap parents’."
    },
    {
        "url": "https://inews.co.uk/opinion/general-election-decided-foreign-policy-good-sunak-2839042",
        "title": "The general election will be decided by foreign policy – good news for Sunak",
        "description": "Sunak and Starmer are yet to be properly put to the test as international statesmen (Photo: Getty) Rishi Sunak’s publicly declared “working assumption” that the general election will be in the second half of this year tells us three things."
    },
    {
        "url": "https://www.heraldscotland.com/news/24030186.taking-time-snp-ministers-slated-xl-bully-complacency/",
        "title": "&#39;Taking our time&#39;: SNP ministers slated for XL Bully &#39;complacency&#39;",
        "description": "SNP ministers have been accused of “extraordinary complacency” after saying they were taking their time to decide whether to ban XL Bully"
    },
    {
        "url": "https://www.nme.com/en_asia/news/music/bob-vylan-share-gritty-new-single-hunger-games-listen-3566197",
        "title": "Bob Vylan share gritty new single ‘Hunger Games’",
        "description": "Bob Vylan have shared the latest track from their upcoming album – a defiant new single called ‘Hunger Games’. Check it out here."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24027161.improve-holyrood-double-salaries-msps/?ref=rss",
        "title": "How to improve Holyrood: double the salaries of MSPs",
        "description": "During the week before Christmas, I attended the memorial service for Alistair Darling, the former Chancellor and leader of the Better"
    },
    {
        "url": "https://www.hexham-courant.co.uk/news/24028848.reform-uk-party-contest-every-parliamentary-seat-uk/",
        "title": "Reform <b>UK</b> party to contest every parliamentary seat in <b>UK</b>",
        "description": "A pledge by the leader of Reform UK to contest every seat in England could spell difficulty for the Conservatives in Northumberland."
    },
    {
        "url": "https://www.thetimes.co.uk/article/this-is-what-business-needs-from-our-political-leaders-5908c9fzq",
        "title": "What politicians must do to get business on board",
        "description": "It was in the early 1990s when one of Bill Clinton’s strategists coined the phrase: “It’s the economy, stupid.” With a general election looming on this side of the Atlantic and the economy"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24030304.ukraine-unleashes-drones-missiles-russian-areas/",
        "title": "Ukraine unleashes more drones and missiles at Russian areas",
        "description": "Both sides are raising the stakes of their long-range warfare as soldiers remain bogged down on the wintry battlefield. The <b>UK</b>’s Ministry of Defence said “ground combat has continued to be characterised by either a static front line or very gradual ..."
    },
    {
        "url": "https://www.leeds-live.co.uk/news/celebs-tv/derek-drapers-life-career-marriage-28395771",
        "title": "Derek Draper&#39;s life, career, marriage to Kate Garraway and tragic battle with Covid",
        "description": "Derek Draper married Good Morning Britain presenter Kate Garraway in September 2005, in Camden, London. They lived in north London and had two children together, a son, William, and a daughter, Darcey. They were once described as one of Britain&#39;s most prominent media power couples, reports WalesOnline."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/hamas-might-have-already-won-battle-gaza",
        "title": "War on Gaza: Why Hamas might have already won",
        "description": "Hamas is not only a military entity - it presents itself as a movement synonymous with the Palestinian struggle. That movement can never be killed"
    },
    {
        "url": "https://www.asianimage.co.uk/news/national/24030126.yousaf-israels-action-gaza-way-beyond-legitimate-response-hamas-attack/",
        "title": "Yousaf: Israel’s action in Gaza ‘way beyond legitimate response’ to Hamas attack",
        "description": "The First Minister has urged the UK Government to make clear Israeli officials will be held responsible if ‘indiscriminate attacks’ do not cease."
    },
    {
        "url": "https://www.ok.co.uk/tv/morning-stars-halt-live-shows-31814205",
        "title": "This Morning stars halt live shows to pay tribute to Derek Draper",
        "description": "Good Morning Britain star Kate Garraway&#39;s husband Derek Draper has died at the age of 56 after a lengthy battle with Covid-19, and stars of This Morning have paid a special tribute"
    },
    {
        "url": "https://www.cityam.com/shellfish-and-shit-sewage-is-soiling-the-pleasures-of-seaside-havens-like-whitstable/",
        "title": "Shellfish and shit: Sewage is soiling the pleasures of seaside havens like Whitstable",
        "description": "As water companies wash their hands of responsibility for sewage spillages, a swimmers’ coalition SOS Whitstable is fighting"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/05/latest-uk-politics-news-general-election-keir-starmer-rishi-sunak-labour-tories-live?page=with:block-659803748f08640ae963a74d",
        "title": "Rishi Sunak refuses to criticise Tory MP who said struggling children in his town were ‘products of crap parents’ – <b>UK politics</b> live",
        "description": "Asked if he agreed with MP for Bury North’s comments, PM says it’s important children grow up in household where parents work"
    },
    {
        "url": "https://www.thestage.co.uk/reviews/1979-review-finborough-theatre-london-michael-healey-jimmy-walters",
        "title": "1979 review",
        "description": "European premiere of Michael Healey’s stilted 2017 political character sketch lacks clarity and dramatic drive"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/natwest-boss-763k-salary-claims-28395048",
        "title": "NatWest boss on £763k salary claims it&#39;s &#39;not that difficult&#39; for first-time buyers to get on property ladder",
        "description": "The chairman of NatWest has come under fire after claiming it is &#39;not that difficult&#39; for first-time buyers to get on the property ladder in the UK. Sir Howard Davies, who earns £763,000 a year according to MyLondon, sparked fury after saying prospective buyers have to save, and that “is the way it always used to be”."
    },
    {
        "url": "https://metro.co.uk/2024/01/05/derek-drapers-career-work-life-politics-psychotherapy-20069569/",
        "title": "Inside Derek Draper’s career and professional life – from <b>politics</b> to psychotherapy",
        "description": "After leaving politics, Draper went to California, US, where he obtained an MA in clinical psychology and became a psychotherapist. Back in the UK, he practised as a therapist and also wrote an occasional column for the Mail on Sunday newspaper on psychotherapy issues and monthly columns in the magazines’ Psychologies and Therapy Today."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/uk-today/24029943.alistair-campbell-leads-heartfelt-tributes-derek-draper/",
        "title": "Derek Draper: Carol Vorderman &amp; Tony Blair lead tributes",
        "description": "Tributes have been pouring in since the news Kate Garraway&#39;s husband, Derek Draper, 56, has passed away following a long health battle."
    },
    {
        "url": "https://www.thenational.scot/news/24030028.xl-bully-dogs-minister-concerned-dogs-rehomed-scotland/",
        "title": "XL Bully dogs: Minister &#39;concerned&#39; of dogs being rehomed in Scotland",
        "description": "A SCOTTISH Government minister has said she is “concerned” amid reports of XL Bully dogs being rehomed in Scotland."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12930191/kate-garraway-derek-draper-covid-health-struggle-tragic-death-devotion.html",
        "title": "The heartbreaking Covid battle that touched the nation: How Kate Garraway&#39;s love and tireless devotion saw Derek Draper defy the odds for nearly four years before his tragic ...",
        "description": "The former political adviser and businessman survived a devastating bout of Covid at the beginning of the pandemic, and kept battling through months of therapy until he was able to be nursed at home."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/doctor-kate-garraways-husband-derek-31813652",
        "title": "Doctor on why Kate Garraway&#39;s husband Derek Draper became so ill with Covid that led to sad death",
        "description": "Former political advisor Derek Draper, the husband of broadcaster Kate Garraway, has passed away at the age of 56 after having suffered from severe complications from Covid"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12930115/Kate-Garraway-Derek-Drapers-outing-GMB-star-seriously-ill-husband-attended-wedding-ex-boss-Peter-Mandelson-two-months-tragically-lost-Covid-battle.html",
        "title": "Kate Garraway and Derek Draper&#39;s last outing together: GMB star and her seriously ill husband attended wedding of his ex-boss Peter Mandelson two months before he tragically ...",
        "description": "The former political aide, who has died aged 56 following a long battle with Covid, was seen sitting in a wheelchair next to his wife as he clasped Lord Mandelson&#39;s hand."
    },
    {
        "url": "https://metro.co.uk/2024/01/05/kate-garraways-children-late-husband-derek-draper-20069594/",
        "title": "Who are Kate Garraway’s children with late husband Derek Draper?",
        "description": "Kate Garraway and Derek Draper had two children together after tying the knot back in September 2005, having first met each other in autumn 2004. In March 2006, Kate gave birth to Darcey Mary Draper. Darcy, now 17, has attended several red carpet events with her TV personality mum down the years."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24029849.kate-garraway-announces-death-darling-husband-derek-draper-aged-56/",
        "title": "Kate Garraway announces death of ‘darling husband’ Derek Draper aged 56",
        "description": "Former lobbyist and political adviser Derek Draper, who was married to TV presenter Kate Garraway, has died aged 56 after suffering long-lasting symptoms from coronavirus. A statement from Garraway on Instagram said: “I’m sad to have to tell you all that my darling husband Derek has passed away."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/obituary-derek-draper-kate-garraway-9016131",
        "title": "Obituary: Derek Draper and Kate Garraway were &#39;media power couple&#39;",
        "description": "Former lobbyist and political adviser Derek Draper was part of one of Britain&#39;s most prominent media power couples with his marriage to TV presenter Kate Garraway. The New Labour spin doctor reached great heights of influence in the 1990s but became best known for his involvement in the &quot;lobbygate&quot; scandal."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/combination-of-strikes-and-rise-in-flu-and-covid-a-perfect-storm-for-the-nhs-107375/",
        "title": "Combination of strikes and rise in flu and Covid ‘a perfect storm for the NHS’",
        "description": "Figures published by NHS England on Friday show the number of flu patients jumped by more than a third over Christmas."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24017620.community-news-alresford-area-including-cheriton/",
        "title": "Community news from the Alresford area, including Cheriton",
        "description": "SEND us local news of community events from the Alresford area. The patch stretches from the Candovers to Kilmeston and Tichborne to West Meon. Email newsdesk@hampshirechronicle.co.ukor call 01962 861860 (choose option 1)."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-prime-minister-north-west-david-lynch-mps-b1130566.html",
        "title": "No one should grow up poor, Sunak says after Tory MP’s ‘crap parenting’ remark",
        "description": "He faced criticism from his <b>political</b> rival James Frith ... protect our public services or provide opportunities for young people in Bury and across the <b>UK</b>.” £100 off all bookings over £1000 - TUI discount code 15% off first orders over £20 with ..."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/derek-draper-kate-garraway-new-labour-liam-byrne-peter-mandelson-b1130535.html",
        "title": "New Labour spin doctor Derek Draper was part of media power couple",
        "description": "Former lobbyist and <b>political</b> adviser Derek Draper was part of one of Britain ... Mr Draper was among the first in the <b>UK</b> to fall seriously ill with Covid-19 and was admitted to an intensive care unit as the country entered lockdown in March 2020."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/national/24029957.combination-strikes-rise-flu-covid-a-perfect-storm-nhs/",
        "title": "Combination of strikes and rise in flu and Covid ‘a perfect storm for the NHS’",
        "description": "Figures published by NHS England on Friday show the number of flu patients jumped by more than a third over Christmas."
    }
]