[
    {
        "url": "https://www.mirror.co.uk/news/politics/top-tory-accused-offering-vip-32040731",
        "title": "Top Tory accused of offering &#39;VIP lane&#39; for Rishi Sunak&#39;s wife&#39;s firm in <b>UK</b>",
        "description": "A Mirror Investigation has revealed details of a meeting between a top Conservative operator and the tech company in which Prime Minister Rishi Sunak&#39;s wife Akshata has £624m in shares"
    },
    {
        "url": "https://edition.cnn.com/2024/02/03/politics/strikes-us-uk-houthi-yemen/index.html?Date=20240203&Profile=cnni",
        "title": "US and <b>UK</b> strike Houthi targets in Yemen one day after US strikes in Iraq and Syria",
        "description": "The US and <b>UK</b> have conducted strikes on Houthi targets in Yemen from air and surface platforms — including F/A-18s. At least 30 targets were struck across at least 10 locations, according to two US officials. The targets include command and control ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24095461.ruth-wishart-covid-inquiry-missing-point---starmers-labour/",
        "title": "Ruth Wishart: Covid Inquiry is missing the point - as is Starmer&#39;s Labour",
        "description": "THINK back, if you can bear it. Think about the earliest days of the Covid crisis and that first lockdown in March 2020. Most of us were"
    },
    {
        "url": "https://www.thesun.co.uk/news/25704604/nigel-farage-general-election-reform-uk/",
        "title": "Nigel Farage ‘not getting involved in general election battle for Reform’",
        "description": "NIGEL Farage has told colleagues he is not getting involved in the general election battle for Reform UK, sources told The Sun on Sunday. The Brexit supremo is thought to have privately decided to"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041299/Rishi-Sunak-vaping-gang-warfare.html",
        "title": "Rishi Sunak&#39;s warned disposable ban could lead to &#39;turf wars&#39; by doctors as Australia&#39;s anti-vaping laws leads to rise in smoking and gang violence",
        "description": "The package of proposals, unveiled by Prime Minister Rishi Sunak last week, came after reports the number of children vaping has tripled in three years."
    },
    {
        "url": "https://www.itv.com/news/utv/2024-02-03/first-minister-oneill-pledges-to-work-for-better-future-for-ni",
        "title": "Sinn Fein’s Michelle O’Neill appointed Northern Ireland’s first nationalist First Minister",
        "description": "Stormont’s first nationalist First Minister Michelle O’Neill has pledged to work with unionists to build a better future for Northern Ireland. The appointment of the Sinn Fein vice president provided a moment of history on the day the powersharing institutions returned after a two-year hiatus."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68161268?at_format=link&at_bbc_team=editorial&at_ptr_name=twitter&at_campaign_type=owned&at_link_type=web_link&at_link_origin=BBCPolitics&at_link_id=19B431B2-C06B-11EE-AD3E-B4B2D0B4AF07",
        "title": "The awkward Covid questions Nicola Sturgeon faced",
        "description": "But there were awkward areas that she had to address. Nicola Sturgeon denies Covid decisions were <b>political</b> Nicola Sturgeon&#39;s reputation on the line at <b>UK</b> Covid inquiry Was Sturgeon just following WhatsApp guidelines by hitting delete? First up - WhatsApps."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13041353/City-Minister-BIM-AFOLAMI-says-Lets-make-stock-market-great-again.html?mrn_rm=rta",
        "title": "City Minister BIM AFOLAMI says: &#39;Let&#39;s make the stock market great again!&#39;",
        "description": "His latest plan to fire up the economic engine involves the sale of part of the government&#39;s remaining stake in banking giant NatWest."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25702689/kate-garraway-interview-gmb-derek-draper-funeral/",
        "title": "Brave Kate Garraway returning to work for emotional interview on GMB just 3 days after beloved husband Derek’s funeral",
        "description": "BRAVE Kate Garraway will be back on TV screens tomorrow — just three days after hubby Derek Draper’s funeral. The Good Morning Britain star, 56, will give a live interview to the show from her"
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/feb/02/us-begins-wave-of-airstrikes-retaliating-for-drone-attack-that-killed-three-american-soldiers-live?page=with:block-65be823d8f087d8b7094f2ed&filterKeyEvents=false",
        "title": "Middle East crisis live: fears of ‘disastrous consequences’ for region after US strikes",
        "description": "Iraq says consequences for the Middle East could be dire after the US hit more than 80 Iran-linked targets in Iraq and Syria"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "Labour vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/rishi-sunak-says-his-parents-wanted-him-to-speak-without-an-accent-to-fit-in?trk=public_post_comment-text",
        "title": "Rishi Sunak says his parents wanted him to speak without an accent to ‘fit in’",
        "description": "“You are conscious of being different,” he told the deputy <b>political</b> editor of ITV News ... “most people look to the <b>UK</b> as an example of how to get this right”. Sunak admitted that he never dreamed there might one day be an ethnic minority prime ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-68188517?at_medium=social&at_campaign=Social_Flow&at_campaign_type=owned&at_format=link&at_link_id=36062FC6-C220-11EE-9232-20B2D0B4AF07&at_bbc_team=editorial&at_link_origin=BBC_Scotland_News&at_link_type=web_link&at_ptr_name=facebook_page",
        "title": "Could the Covid inquiry reshape the <b>UK</b>?",
        "description": "Paul Cairney, professor of <b>politics</b> and public policy at Stirling University, agrees that existing &quot;mechanisms for cooperation&quot; between the <b>UK</b> and Scottish governments are inadequate. &quot;The agreements and procedures are neither legally binding nor useful in ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/uk-weather-met-office-issues-32039665",
        "title": "<b>UK</b> weather: Met Office issues latest snow forecast as cold weather set to ravage Britain",
        "description": "The Met Office, the UK&#39;s national weather service, has forecast snow for some places already this month - but the country will first enjoy a mild spell with highs of 13C"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041845/jeremy-corbyn-leads-protesters-london-ceasefire-gaza.html",
        "title": "Jeremy Corbyn leads protesters in London calling for a ceasefire in Gaza - with 20,000 joining march, despite organisers claiming &#39;hundreds of thousands&#39; would be demonstrating",
        "description": "Jeremy Corbyn (pictured) was seen at the front of the London protest surrounded by signs calling for peace before he made a speech imploring Rishi Sunak to call for a ceasefire."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/100-mps-and-peers-join-call-ban-iranian-group/",
        "title": "More than 100 MPs and peers join call to ban Iranian ‘terrorist’ group",
        "description": "More than 100 parliamentarians have urged Rishi Sunak to stand up to the Iranian regime’s “belligerence” by proscribing its Islamic Revolutionary Guard Corps (IRGC) as terrorists, as Conservative MPs warned the Prime Minister: “We need a new strategy.”"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68192206.amp",
        "title": "Laura Kuenssberg: When will politicians make their minds up on key plans?",
        "description": "No wonder voters are unconvinced when politicians may seem unclear on economic plans, writes Laura Kuenssberg."
    },
    {
        "url": "https://news.sky.com/story/amp/michelle-oneill-appointed-northern-irelands-first-nationalist-first-minister-in-historic-moment-13062780",
        "title": "Michelle O&#39;Neill appointed Northern Ireland&#39;s first nationalist first minister in historic moment",
        "description": "&quot;As a child, I didn&#39;t understand the <b>politics</b> of it - but I will never forget the fear ... a trade border in the Irish Sea between Northern Ireland and the rest of the <b>UK</b>. An agreement a year ago between the <b>UK</b> and the EU, known as the Windsor Framework ..."
    },
    {
        "url": "https://uk.news.yahoo.com/cameron-stands-firm-palestinian-state-221338118.html",
        "title": "Cameron stands firm on Palestinian state recognition after Tory backlash",
        "description": "The Foreign Secretary said Gaza and the West Bank needed a workable government from ‘day one’ of any peace deal with Israel."
    },
    {
        "url": "https://uk.news.yahoo.com/government-hold-talks-giving-uk-131832205.html",
        "title": "Government to Hold Talks On Giving <b>UK</b> Post Office to Workers",
        "description": "The government will meet Post Office workers to discuss handing them ownership of the network in a bid to move on from its historic scandals and to set out a firmer footing for the future.Most Read from BloombergMeta’s $197 Billion Surge Is Biggest in Stock-Market HistoryUS Hits Iran’s Militias in Syria,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/israel-edinburgh-scottish-parliament-unrwa-hamas-b2490049.html",
        "title": "Thousands gather in Edinburgh to call for immediate ceasefire in Gaza",
        "description": "Mr Sheppard said the pausing of <b>UK</b> funding for the United Nations Relief and Works ... “We demand the release of all prisoners and hostages and we demand the beginning of a new <b>political</b> process to ensure the Palestinian people have recognition and ..."
    },
    {
        "url": "https://news.sky.com/story/amp/system-is-not-working-and-is-collapsing-says-immigration-lawyer-as-questions-raised-over-clapham-attack-suspects-uk-status-13062199",
        "title": "&#39;System is not working and is collapsing&#39; says immigration lawyer - as questions raised over Clapham attack suspect&#39;s <b>UK</b> status",
        "description": "<b>UK</b> law on deporting foreign criminals applies to individuals ... and he could not be returned to Iran because of his fear of persecution on his own grounds which were religious and <b>political</b>. &quot;He&#39;s still in the United Kingdom&quot; she says."
    },
    {
        "url": "https://www.heraldscotland.com/news/13179881.ukip-robertson-narrow-yes-vote-may-not-mean-independence/",
        "title": "Ukip and Robertson: &#39;narrow Yes vote may not mean independence&#39;",
        "description": "Speaking to the Sunday Herald, Coburn said a tight win for Yes this week should not mean Scotland leaving the <b>UK</b>. &quot;I don&#39;t think they have a mandate, to be frank, because you are taking an an awful lot of people out of the United Kingdom who don&#39;t even ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/israel-edinburgh-scottish-parliament-hamas-rishi-b1136844.html",
        "title": "Thousands gather in Edinburgh to call for immediate ceasefire in Gaza",
        "description": "Thousands of pro-Palestine supporters gathered in Edinburgh on Saturday in support of an immediate ceasefire in Gaza. Carrying Palestinian flags and placards, they marched from Edinburgh Castle down the Royal Mile to the Scottish Parliament, shouting slogans such as: “No Justice, No Peace”, and: “Ceasefire now!”"
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24095676.irish-leader-hails-special-day-people-northern-ireland/",
        "title": "Irish leader hails ‘special day for people of Northern Ireland’",
        "description": "Irish president Michael D Higgins and Tanaiste Micheal Martin sent their congratulations following the restoration of devolved government."
    },
    {
        "url": "https://inews.co.uk/news/michelle-oneill-first-nationalist-leader-stormont-2888356",
        "title": "‘Historic day’ as Michelle O’Neill becomes first nationalist leader of Stormont",
        "description": "Northern Ireland ‘s Stormont Assembly returned on Saturday after a two-year hiatus with Sinn Fein vice president Michelle O’Neill becoming the country’s first nationalist first minister."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/24095616.hundreds-attend-archbishops-service-worcester-cathedral/",
        "title": "Hundreds attend Archbishop&#39;s service at Worcester Cathedral",
        "description": "Justin Welby, the Archbishop of Canterbury, toured across Worcestershire to meet residents and school children."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/in-full-all-the-names-of-new-stormont-executive-ministers-4504212",
        "title": "IN FULL: all the names of new Stormont executive ministers",
        "description": "The final ministers to be announced were Aisling Reilly (Sinn Fein) and Pam Cameron (DUP), who will serve as junior ministers in the Executive Office. Meanwhile SDLP MLA Matthew O’Toole will be leader of the Opposition."
    },
    {
        "url": "https://www.thenational.scot/politics/24095426.must-recognise-palestine-ensure-uk-not-complicit-genocide/",
        "title": "Why we must recognise Palestine and ensure <b>UK</b> is not complicit in genocide",
        "description": "LAST week, we witnessed another act in the ongoing pantomime of elected members of parliament trying to hold the UK Government to account for"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/03/generations-watch-on-as-oneill-reaches-out-across-divide-on-day-of-history/",
        "title": "Generations watch on as O’Neill reaches out across divide on day of history",
        "description": "Gerry Adams and Martin McGuiness’s son were among those watching in the public gallery. As she rose to speak just before 2:30pm, Michelle O’Neill glanced briefly up at the public viewing gallery high on the other side of Stormont’s grand debating chamber."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-politics-67764370",
        "title": "Who is Emma-Little Pengelly, NI&#39;s new deputy first minister",
        "description": "The new Northern Ireland Deputy First Minister, Emma Little-Pengelly, represents another first for power-sharing government at Stormont. The Democratic Unionist Party (DUP) assembly member is the first unionist to hold the position."
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/your-views-backing-for-car-park-charges-at-glenmore-341182/",
        "title": "YOUR VIEWS: Backing for car park charges at Glenmore",
        "description": "The outrage about suggested parking charges is all too predictable and exaggerated but ignores the strong case for parking management"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/stormont-returns-assembly-meets-to-install-new-executive-and-select-ministers/a563476334.html",
        "title": "Stormont returns: All ministers appointed as Michelle O’Neill and Emma Little-Pengelly elected First and Deputy First Minister",
        "description": "It’s an historic day at Stormont as the Assembly meets to install a speaker and a new Executive. Following the DUP’s decision to return to Stormont in the aftermath of their deal with the UK Government, outgoing speaker Alex Maskey will preside over the nomination of his replacement before Executive ministers are put in place."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/watch-wales-vs-scotland-live-six-nations-2024-tv-channel-free-today",
        "title": "Wales vs Scotland live: how to watch Six Nations game online, TV streams, kickoff time, team news",
        "description": "The Six Nations continues this afternoon with a clash between Wales and Scotland. It&#39;s been 22 years since Scotland beat Wales in Cardiff, and they&#39;ve yet to do it under Warren Gatland. However, they have a golden opportunity to put both hoodoos to bed on Saturday."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25695376/kate-garraway-dances-late-derek-draper-funeral-dead/",
        "title": "Kate Garraway dances with late Derek Draper in heartbreaking video shared by her friend after star buries her husband",
        "description": "KATE Garraway beamed with delight as she danced with husband Derek Draper in a touching video re-posted to Instagram on the day of his funeral. The Good Morning Britain anchor, 56, looked"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/anyone-but-peter-bone-voters-turn-to-labour-and-reform-uk-as-wellingborough-byelection-nears",
        "title": "‘Anyone but Peter Bone’: voters turn to Labour and Reform <b>UK</b> as Wellingborough byelection nears",
        "description": "While Labour is favourite to snatch the Northamptonshire seat from the Tories, Sunak’s party faces a battle even to take second place, if local opinion is anything to go by"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/03/biden-eyes-political-capital-in-grand-bargain-deal-to-transform-middle-east-israel-gaza-war-mohammed-bin-salman",
        "title": "Biden’s grand bargain: can a new Middle East emerge from the turmoil?",
        "description": "In an election year, the US president is seeking political capital by offering diplomatic incentives to rival states in the region – including recognition of Palestine"
    },
    {
        "url": "https://www.itv.com/news/utv/2024-02-03/powersharing-to-return-in-ni-with-michelle-oneill-as-first-minister",
        "title": "‘Historic day’ as Michelle O’Neill becomes Northern Ireland&#39;s first nationalist first minister",
        "description": "Devolved government will return in Northern Ireland, with Sinn Féin’s Michelle O’Neill making history as the first nationalist first minister. MLAs will gather at Parliament buildings at Stormont later for a sitting at which a series of ministers will be appointed to a powersharing executive, and bring an end to a two-year political impasse."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24095447.business-resumes-northern-ireland-assembly-historic-restoration-day/",
        "title": "Business resumes at Northern Ireland Assembly on historic restoration day",
        "description": "Business at the Northern Ireland Assembly has reconvened on a day when Sinn Fein’s Michelle O’Neill is set to become the first nationalist first minister following a two-year political collapse."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24095539.10-000-march-london-support-gaza-ceasefire/",
        "title": "10,000 march through London in support of Gaza ceasefire",
        "description": "More than 10,000 pro-Palestine supporters have marched in central London calling for an immediate ceasefire in Gaza. Hundreds of officers from the Metropolitan Police were on duty with additional dispersal powers as the march started at Portland Place and headed to Whitehall."
    },
    {
        "url": "https://www.independent.co.uk/news/world/middle-east/iran-strikes-biden-syria-jordan-updates-live-b2489907.html?page=3",
        "title": "US airstrikes - live: Iraq warns Middle East on ‘brink of the abyss’ after reports of 40 killed",
        "description": "Three US service personnel were killed and more than 40 were wounded last week after a drone hit a military outpost in Jordan known as Tower 22, on the border between Iraq and Syria. It marked the first time US soldiers have been killed by the attacks since the start of the Israel-Hamas war."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1862651/tony-blair-vandalism-british-constitution-comment",
        "title": "We need a new revolution to undo Tony Blair&#39;s vandalism of <b>UK</b> traditions, says Daniel Pitt",
        "description": "There is a saying that ‘<b>politics</b> is downstream of culture’. Yet, putting culture above <b>politics</b> is mistake as both <b>politics</b> and culture influence each other. To tackle illegal migration - to stop the boats - and the wokism that seem to be awash in our ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041051/sinn-fein-michelle-oneill-northern-ireland-minister.html",
        "title": "Sinn Fein&#39;s Michelle O&#39;Neill says &#39;I&#39;m sorry for all the lives lost during the conflict&#39; as she becomes Northern Ireland&#39;s first-ever nationalist first minister after growing ...",
        "description": "The 47-year-old has vowed to be a first minister for all and hailed a &#39;historic day&#39; as devolved government is expected to return in Northern Ireland following a two-year political collapse."
    },
    {
        "url": "https://uk.news.yahoo.com/meghan-mccain-biden-reportedly-calling-195503726.html",
        "title": "Meghan McCain on Biden reportedly calling Trump a ‘sick f—‘: ‘It’s real, and we need more real from everyone in <b>politics</b>’",
        "description": "Meghan McCain, the daughter of the late Sen. John McCain (R-Ariz.), praised President Biden’s reported choice words behind closed doors for President Trump Friday. “I continue to not understand why Biden’s team keeps him so isolated because him calling Trump a ‘sick f—’ is my favorite thing he’s done in months and months,"
    },
    {
        "url": "https://www.heraldscotland.com/politics/westminster/24095509.michelle-oneill-appointed-nis-first-nationalist-first-minister/?ref=yahoo",
        "title": "Michelle O’Neill appointed as NI’s first nationalist First Minister",
        "description": "Stormont’s first nationalist First Minister Michelle O’Neill has pledged to work with unionists to build a better future for Northern Ireland."
    },
    {
        "url": "https://www.yourthurrock.com/2024/02/03/labour-vows-to-close-severance-loophole-exploited-by-thurrock-mp/",
        "title": "Labour vows to close severance “loophole” exploited by Thurrock MP",
        "description": "Dame Jackie was one of ninety-seven Tory ministers who claimed severance payments during the <b>political</b> chaos of 2022/23 ... severance bill over the course of that financial year cost <b>UK</b> taxpayers £933,086. Since 1991, when John Major was in Downing ..."
    }
]