[
    {
        "url": "https://www.thetimes.co.uk/article/national-living-wage-increase-is-a-political-target-with-risks-ktgfbwn97",
        "title": "National living wage increase is a <b>political</b> target with risks",
        "description": "The <b>UK</b> economy ended last year in a fragile state, with the most recent figures showing quarterly and monthly falls in gross domestic product. There are hopes of better news when figures for November are released on Friday, and that some of the recent ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24038966.calvin-klein-ad-starring-fka-twigs-banned-complaints-objectified-women/",
        "title": "Calvin Klein ad starring FKA twigs banned over complaints it ‘objectified’ women",
        "description": "A poster for Calvin Klein featuring British musician FKA twigs has been banned for being likely to cause serious offence by objectifying women."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24038962.20mph-speed-limits-make-central-london-roads-worlds-slowest---study/",
        "title": "20mph speed limits make central London roads the world’s slowest – study",
        "description": "Journeys of 10km (6.2 miles) in the capital took an average of 37 minutes and 20 seconds last year, location technology company TomTom said."
    },
    {
        "url": "https://www.ft.com/content/93daf3de-c7a4-4ccb-a8d1-60d2a9911b5e",
        "title": "Letter: The <b>UK</b>’s basic problem — people don’t save enough",
        "description": "From Professor Martin Weale, King’s Business School and Department of Political Economy, King’s College, London London WC2, UK"
    },
    {
        "url": "https://www.bournemouthecho.co.uk/news/24034956.mp-tobias-ellwood-suggests-electing-bcp-mayor/",
        "title": "MP Tobias Ellwood suggests electing a &#39;BCP Mayor&#39;",
        "description": "“The process of electing a mayor can increase public interest and engagement in local <b>politics</b> and would likely attract bigger personalities from our community to step forward.”"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24038952.early-menopause-children-linked-rheumatoid-arthritis-risk-women/",
        "title": "Early menopause and more children linked to rheumatoid arthritis risk in women",
        "description": "Researchers identified a number of hormonal and reproductive factors in women who developed the long-term condition."
    },
    {
        "url": "https://news.sky.com/story/taylor-swift-tickets-easier-to-get-than-nhs-dentist-appointments-ministers-told-13044908",
        "title": "Taylor Swift tickets easier to get than NHS dentist appointments, ministers told",
        "description": "<b>Politics</b> Live: Post Office scandal announcement expected from PM The US pop singer&#39;s international Eras tour will see her visit venues across the <b>UK</b> this year in a series of sold out events which were hotly-contested by fans. Speaking in the Commons ..."
    },
    {
        "url": "https://news.sky.com/story/tory-rebels-table-amendments-aimed-at-toughening-sunaks-rwanda-bill-13044936",
        "title": "Tory rebels table amendments aimed at &#39;toughening&#39; Sunak&#39;s Rwanda bill",
        "description": "More than 30 Tory MPs are poised to back amendments aimed at &quot;toughening&quot; Rishi Sunak&#39;s Rwanda bill when it returns to the Commons next week."
    },
    {
        "url": "https://www.creativebrief.com/bite/trend/lead-2024-to-focus-on-responsible-advertising",
        "title": "LEAD 2024 to focus on responsible advertising",
        "description": "The IPA, AA and ISBA have announced the full lineup and agenda for LEAD 2024, the flagship industry conference."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853877/rwanda-bill-doesnt-end-merry-go-round-legal-challenges",
        "title": "The Rwanda Bill &#39;doesn’t end the merry-go-round of legal challenges&#39;, protests Mr Jenrick",
        "description": "The ex-immigration minister warned Sunak the &#39;stakes could not be higher&#39;, after they issued a series of demands to toughen up new Rwanda deportation laws."
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/we-need-banish-cabinet-traitors-31845248",
        "title": "&#39;We need to banish the Cabinet of Traitors in the <b>UK</b> Government&#39;",
        "description": "Liz Truss would have lasted even less time than she did in real life, saving the <b>UK</b> economy in the process ... is that in the end – unlike in <b>politics</b> for the last 14 years – the right people won. Hopefully that would happen in this version too ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12944591/Bond-market-vigilantes-ready-pounce-politicians-make-rash-election-promises.html",
        "title": "Bond market vigilantes ready to pounce if politicians make rash election promises",
        "description": "Vivek Paul, UK chief investment strategist at Blackrock, raised the spectre of a repeat of the carnage seen in UK in September 2022."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/police-brawl-orthodox-jews-synagogue-31845165",
        "title": "Police brawl with worshippers in synagogue after secret tunnel found to &#39;women&#39;s bath&#39;",
        "description": "A large group of worshippers were seen brawling with police inside a historic synagogue in Brooklyn after a secret tunnel was discovered leading to a women&#39;s bath"
    },
    {
        "url": "https://www.ladbible.com/entertainment/film/emma-stone-poor-things-film-scene-edited-uk-law-880490-20240109",
        "title": "Emma Stone sex scene in new movie so controversial it had to be re-edited as part of <b>UK</b> law",
        "description": "Emma Stone&#39;s sex scene in her new movie had to be re-edited due to <b>UK</b> film law. The actor&#39;s latest film - which ... there’s food, there’s <b>politics</b>, there’s the concept of money. “But with sex, with the discovery of pleasure, I think it’s purely ..."
    },
    {
        "url": "https://www.northern-times.co.uk/news/obituary-john-macdonald-rogart-338282/",
        "title": "OBITUARY: John Macdonald, Rogart",
        "description": "John Macdonald was a man of many parts – family man, crofter, railway worker, postie, musician, local historian, author and friend."
    },
    {
        "url": "https://www.newsletter.co.uk/news/crime/nio-dodges-question-of-whether-gerry-kelly-should-be-kicked-off-policing-board-after-high-court-says-he-lost-his-moral-compass-in-the-ira-and-does-not-renounce-his-crimes-4472302",
        "title": "NIO dodges question of whether Gerry Kelly should be kicked off Policing Board",
        "description": "The Northern Ireland Office and most political parties have dodged questions about the future of Gerry Kelly on the Policing Board, after a judgement trashing his reputation was handed down in the High Court."
    },
    {
        "url": "https://www.newsandstar.co.uk/news/national/24038873.polish-police-arrest-two-convicted-politicians-took-refuge-president/",
        "title": "Polish police arrest two convicted politicians who took refuge with president",
        "description": "Polish police have arrested two politicians convicted of abuse of power who had taken refuge in the palace of President Andrzej Duda, in a dramatic escalation of a stand-off between the new and previous governments."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/jan/09/trump-iowa-criminal-charges-presidential-campaign-trail-republicans?ref=mc.news",
        "title": "Trump’s electoral and judicial calendars collide – but it does him little harm",
        "description": "Legal woes that would have buried a candidate have become a feature of Trump’s 2024 run as other candidates hit campaign trail in Iowa"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1853872/ed-davey-paula-vennells-post-office-scandal",
        "title": "Ed Davey and Paula Vennells told to hand earnings to victims over Post Office scandal",
        "description": "EXCLUSIVE: MPs have demanded that large sums of cash paid to Lib Dem leader Ed Davey and former Post Office chief executive Paula Vennells is given to victims."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/electoral-college-trump-biden-2024-b2475958.html",
        "title": "The Electoral College is a ‘bad’ and ‘undemocratic’ system. So why does the US still use it?",
        "description": "In the most powerful democracy in the world, two of its last four leaders have been chosen by a minority of voters. The US’s Electoral College system is now functioning far from how its creators originally intended,"
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24037623.sunak-faces-showdown-rwanda-bill-return-commons-next-week/",
        "title": "Sunak faces showdown over Rwanda Bill on its return to Commons next week",
        "description": "The legislation aimed at reviving the policy to deport some asylum seekers to Kigali has split the Tory left and right."
    },
    {
        "url": "https://www.thenational.scot/politics/24038416.indy-scotland-like-denmark-ireland-says-humza-yousaf/",
        "title": "Indy Scotland like Denmark and Ireland, says Humza Yousaf",
        "description": "Unsurprisingly, the British nationalists are not at all happy about First Minister Humza Yousaf&#39;s speech yesterday, which highlighted the"
    },
    {
        "url": "https://www.thenational.scot/politics/24038820.scottish-government-still-lacks-compelling-story/",
        "title": "The Scottish Government still lacks a compelling story",
        "description": "It was a story of a better future, a new <b>politics</b> (what happened to that?), home rule and a different approach to the whole of the <b>UK</b>. READ MORE: Scottish teen gifted &#39;dream bagpipes&#39; by anonymous benefactor But unfortunately the new Scottish Labour ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/09/jeremy-corbyn-joins-case-against-israel-south-africa-un/",
        "title": "Jeremy Corbyn joins genocide case against Israel",
        "description": "South Africa names former Labour leader among its supporters for International Court of Justice action over alleged targeting of civilians"
    },
    {
        "url": "https://www.peterboroughtoday.co.uk/news/politics/council/councillors-warn-they-could-delay-increase-to-bus-tax-if-they-dont-have-longer-to-scrutinise-the-plan-4472278",
        "title": "Councillors warn they could delay increase to bus tax if they don&#39;t have longer to scrutinise the plan",
        "description": "The Cambridgeshire and Peterborough Combined Authority’s scrutiny committee will have less than a week to look through the details"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/09/britain-borrow-record-206bn-private-investors-2024/",
        "title": "Britain to borrow record £206bn from private investors this year as election looms",
        "description": "Britain is on track to borrow a record £206bn from private investors this year as Rishi Sunak embarks on a debt binge ahead of the general election."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/national/24038800.polish-leader-gives-refuge-convicted-politicians-police-bid-arrest/",
        "title": "Polish leader gives refuge to convicted politicians as police bid to arrest them",
        "description": "Poland’s president has given refuge to two politicians convicted of abuse of power, welcoming the members of the former ruling party into the presidential palace as police went to their homes to arrest them."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24038799.loreal-unveils-smart-hair-dryer-challenge-dyson/",
        "title": "L’Oreal unveils smart hair dryer to challenge Dyson",
        "description": "Beauty giant L’Oreal has unveiled a smart hair dryer which uses infrared light and wind to dry hair using less energy. Called the AirLight Pro, the firm’s first mainstream electronic device will be seen as a competitor to Dyson’s range of high-end hair styling products when it launches in the UK from April in salons and the summer for consumers."
    },
    {
        "url": "https://inews.co.uk/news/politics/fujitsu-could-be-banned-government-after-post-office-scandal-2845535",
        "title": "Fujitsu faces from government contracts if Post Office inquiry finds wrongdoing",
        "description": "Ministers will wait until the conclusion of the public inquiry before coming to a decision on whether to continue using Fujitsu&#39;s systems"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24038773.hunt-bitterly-disappointed-court-ruling-gas-drilling-local-area/",
        "title": "Hunt ‘bitterly disappointed’ at court ruling on gas drilling in local area",
        "description": "Chancellor Jeremy Hunt said he is “bitterly disappointed” after a Court of Appeal ruling gave the green light to a gas drilling project in his Surrey constituency."
    },
    {
        "url": "https://www.bbc.co.uk/news/entertainment-arts-67921673.amp",
        "title": "Post Office scandal: The power of the docudrama to bring about justice",
        "description": "Watched by nine million viewers so far according to ITV figures, the mini-series centres on the story of sub-postmaster Alan Bates, played by actor Toby Jones, who led and won a legal battle paving the way for dozens of convictions to be overturned."
    },
    {
        "url": "https://www.heraldscotland.com/news/24038747.humza-yousaf-indy-economic-speech-fails-carve-path/?ref=rss",
        "title": "Humza Yousaf: Indy economic speech fails to carve path",
        "description": "Given the <b>UK</b> Government has previously granted permission for a vote ... generate higher living standards for the people of this country”. Get Scotland&#39;s top <b>politics</b> newsletter sent directly to your inbox each evening. It is unclear whether voters ..."
    },
    {
        "url": "https://www.politico.eu/article/uk-foreign-secretary-david-cameron-worried-israel-breached-international-law-war-palestine-gaza/",
        "title": "<b>UK</b>’s David Cameron ‘worried’ Israel may have breached international law",
        "description": "LONDON — U.K. Foreign Secretary David Cameron admitted he is “worried” Israel has “taken action that might be in breach of international law” as the conflict in Gaza continues."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24037764.scottish-independence-snp-needs-see-beyond-public-sector/",
        "title": "Scottish independence: SNP needs to see beyond public sector",
        "description": "The engine of the UK economy is centred 400 miles away, leaving Scotland to feed off the scraps – while a disproportionate level of"
    },
    {
        "url": "https://uk.news.yahoo.com/cps-refuses-reveal-starmer-role-215434007.html",
        "title": "CPS refuses to reveal Starmer’s role in wrongful Post Office prosecutions",
        "description": "Richard Tice, the Reform <b>UK</b> leader, said: “The CPS needs to be fully transparent about how many cases it pursued and when. Given the <b>political</b> sensitivity, they also need to confirm what Keir Starmer knew when. So does the Labour leader.” Sir Keir’s ..."
    },
    {
        "url": "https://www.thetimes.co.uk/podcasts/politics-without-the-boring-bits",
        "title": "<b>Politics</b> Without The Boring Bits",
        "description": "Matt Chorley sits down with MPs leaving Parliament at the next election to talk about their highs and lows, their best and worst bosses, and the lessons they&#39;ve learned from <b>politics</b>.Mhairi Black was elected as an SNP MP at the age of 20... This week we&#39;re ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/unprecedented-strike-action-tens-of-thousands-of-public-sector-workers-across-ni-set-to-walk-out-next-week/a1797281962.html",
        "title": "‘Unprecedented strike action’: Tens of thousands of public sector workers across NI set to walk out next week",
        "description": "Around £584m has been offered by the <b>UK</b> government as part of a financial package of more than £3.3bn for the return of a Northern Ireland Executive in order to address pay disputes. However, <b>political</b> talks at Hillsborough Castle collapsed before ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-67929549.amp",
        "title": "Polish police arrest MPs in presidential palace",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... Warsaw in a day of unprecedented <b>political</b> theatre."
    },
    {
        "url": "https://www.leisureopportunities.co.uk/news/Social-care-costs-are-stifling-public-sector-leisure/352421",
        "title": "Fixing the social care crisis is key to success of public sector leisure, says Martyn Allison",
        "description": "Solving the <b>UK</b>&#39;s social care problem is the key to overcoming the financial ... I think we should join forces with others to make a composite demand for all <b>political</b> parties to solve the social care problem once and for all,” he says."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-has-claimed-he-is-making-progress-on-his-5-pledges-to-voters-and-people-arent-convinced_uk_659bdff3e4b0bfe5ff640cdc?d_id=7155395&ncid_tag=fcbklnkukhpmg00000008",
        "title": "Rishi Sunak Has Claimed He Is Making &#39;Progress&#39; On His 5 Pledges To Voters And People Aren&#39;t Convinced",
        "description": "However, revised figures last month showed that the economy actually shrunk by 0.1% between July and September, putting the <b>UK</b> at risk of going into a recession. Sky News <b>political</b> editor Beth Rigby was among those to cast doubt on the PM’s claims of ..."
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/national/24038903.donald-trump-court-judges-express-scepticism-immunity-claims/",
        "title": "Donald Trump in court as judges express scepticism over immunity claims",
        "description": "Donald Trump has attended court in Washington as federal appeal judges expressed deep scepticism that the former president is immune from prosecution on charges that he plotted to overturn the results of the 2020 election."
    },
    {
        "url": "https://www.itv.com/news/2024-01-09/taylor-swift-tickets-easier-to-get-than-nhs-dentist-appointments-labour-says",
        "title": "Taylor Swift tickets easier to get than NHS dentist appointments, Labour says",
        "description": "It’s easier to get your hands on Taylor Swift tickets in 2024, than it is to get an NHS dental appointment.&#39; | ITV National News"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24038675.recipe-box-start-up-hits-150-000-milestone/",
        "title": "Recipe box start-up hits 150,000 milestone",
        "description": "A Chinese recipe box start-up business founded by a Newcastle University graduate has achieved a major milestone - producing its 150,000th"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/cameron-libya-foreign-secretary-benghazi-mps-b1131262.html",
        "title": "Libya intervention criticism ‘bunk’, says Cameron",
        "description": "The Foreign Secretary has robustly defended his decision to intervene in Libya more than a decade ago, while he was prime minister."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24038656.taylor-swift-tickets-easier-get-nhs-dental-appointments-ministers-told/",
        "title": "Taylor Swift tickets easier to get than NHS dental appointments, ministers told",
        "description": "Conservative former health minister Steve Brine said there cannot be any further delay in bringing forward a plan to tackle dental care problems."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/cameron-labour-china-sri-lankan-foreign-secretary-b1131283.html",
        "title": "Cameron: No regrets about support of Sri Lankan port project with China links",
        "description": "following his surprise return to frontline <b>politics</b>. The Intelligence and Security Committee warned last year that it was possible that Lord Cameron’s ties to China-<b>UK</b> investment “were in some part engineered by the Chinese state to lend credibility to ..."
    },
    {
        "url": "https://uk.news.yahoo.com/former-uk-opposition-leader-corbyn-222244411.html",
        "title": "Former <b>UK</b> opposition leader Corbyn to join South Africa&#39;s delegation accusing Israel of genocide",
        "description": "Former U.K. opposition leader Jeremy Corbyn will join a South African delegation for this week’s hearings at the International Court of Justice, where the country accuses Israel of committing genocide against Palestinians in the war in Gaza,"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24036662.letter-ensure-prosecutions-postmasters-quashed/",
        "title": "Letter: &#39;Ensure all prosecutions of postmasters are quashed&#39;",
        "description": "Send letters by email to newsdesk@hampshirechronicle.co.<b>uk</b> or by post to Editor, Hampshire Chronicle, 5 Upper Brook Street, Winchester, Hampshire, SO23 8AL. All letters and e-mails must include full names and addresses (anonymous letters will not be ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/09/post-office-horizon-scandal-fujitsu-rishi-sunak-conservatives-labour-uk-politics-live?page=with:block-659d7f698f087ed727d27d24",
        "title": "Reports PM privately thinks Rwanda plan won’t work are why costs must be published, Yvette Cooper says – <b>UK politics</b> live",
        "description": "Yvette Cooper opens debate that, if passed, would force government to publish confidential documents about costs of Rwanda scheme Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages ..."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/09/middle-east-crisis-live-updates-hamas-israel-gaza-palestine-war-us-antony-blinken-tel-aviv-visit?page=with:block-659d7df08f0869c265cfde85",
        "title": "Middle East crisis live: <b>UK</b> ‘worried’ Israel may have breached international law in Gaza",
        "description": "Yes, of course. My colleague Andrew Sparrow is covering Cameron’s appearance before the foreign affairs committee live on the <b>UK politics</b> blog. Former Post Office boss Paula Vennells to hand back CBE with immediate effect in wake of Horizon scandal ..."
    }
]