[
    {
        "url": "https://www.dailymail.co.uk/debate/article-12920469/online-video-game-avatar-raped.html",
        "title": "SARAH VINE: Who the hell creates an online game in which your avatar can be raped?",
        "description": "After various baffling attempts to block it on &#39;free speech&#39; grounds, we finally have a framework that can protect children and young people from the worst excesses of the internet."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/burger-king-worker-who-insulting-31793586",
        "title": "Burger King worker who got &#39;insulting&#39; gift after never missing a shift buys dream home",
        "description": "Kevin Ford, a cook at a Burger King in Las Vegas, went viral last year after he received a &#39;goody&#39; bag from his managers to celebrate never missing a shift in 27 years"
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/itv-dancing-ice-bosses-bracing-31793257",
        "title": "ITV Dancing On Ice bosses bracing for &#39;clash&#39; as Hannah Spearitt and Rachel Stevens to be &#39;kept apart&#39;",
        "description": "Former S Club star Hannah Spearitt faces competition on ITV Dancing On Ice from professional Brendyn Hattfield - the boyfriend of her ex-bandmate Rachel Stevens"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/01/02/ed-davey-vows-to-tear-down-blue-wall-amid-early-election-campaigning/",
        "title": "Ed Davey vows to ‘tear down blue wall’ amid early election campaigning",
        "description": "Liberal Democrat leader Sir Ed Davey is campaigning in Conservative constituencies held by ministers Jeremy Hunt and Michael Gove."
    },
    {
        "url": "https://www.ft.com/content/553a9d6b-6c8f-4abf-b88b-c3a82ee14f4f",
        "title": "Live news: Trump sues over Maine ballot rejection",
        "description": "Donald Trump has filed a lawsuit to reinstate his name on Maine’s presidential primary ballot. US stocks declined in the first session of the year, while Treasury yields surged as traders moderated expectations for interest rate cuts."
    },
    {
        "url": "https://www.thetimes.co.uk/article/nigel-farage-reform-uk-return-politics-general-election-dwnxngsw0",
        "title": "Nigel Farage is doing a great job, says Tory chief Lee Anderson",
        "description": "As the Brexit champion ponders a return to frontline politics with Reform, the Conservative deputy chairman admits his party could be outflanked on the right"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12920539/Camden-Council-vets-businesses-seeking-contracts-commitment-LGBTQ-values.html",
        "title": "Camden Council vets businesses seeking contracts over their commitment to &#39;LGBTQ+ values&#39;",
        "description": "The Labour-run council will now only work &#39;with businesses whose values align with our own&#39; and which &#39;positively influence&#39; social attitudes within its electoral wards."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12919721/The-accidental-icon-fascinating-history-FTSE-100-created-40-years-ago-today.html",
        "title": "The accidental icon: The fascinating history of how the FTSE 100 was created 40 years ago today",
        "description": "The low-key switch-on of a computer programme on January 3, 1984 heralded the birth of one of the UK&#39;s most recognisable business brands."
    },
    {
        "url": "https://www.thesun.co.uk/money/25229156/store-2024-business-chiefs-help-chart-way-bank-rates/",
        "title": "Whats in store in 2024? Business chiefs help The Sun chart way ahead past bank rates and inflation",
        "description": "SIX business leaders help our resident Ash-trologist, Business Editor Ashley Armstrong, predict the year ahead. This year’s focus will be on how quickly interest rates and inflation will come back"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851265/laurence-fox-ponders-another-run-london-mayor",
        "title": "Laurence Fox issues message as he ponders another run at becoming London Mayor",
        "description": "The anti-woke warrior said he refuses to &quot;stand by and watch the city I live in and love be destroyed before our eyes&quot;."
    },
    {
        "url": "https://metro.co.uk/2024/01/02/senior-hamas-leader-killed-israeli-drone-strike-lebanon-20054552/?ico=trending-module_category_world_item-6",
        "title": "Senior Hamas leader killed in Israeli drone strike on group’s Beirut office",
        "description": "Saleh Arouri was a founder of the group’s military wing and the most senior figure killed since the war with Israel began."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/02/labour-crackdown-on-cronyism-could-send-public-fraudsters-to-jail-for-a-decade",
        "title": "Labour ‘crackdown on cronyism’ could send public fraudsters to jail for a decade",
        "description": "Party considering new offence of fraud against the public purse as Keir Starmer vows to clean up politics after public scandals"
    },
    {
        "url": "https://uk.news.yahoo.com/am-not-racist-says-mp-190000246.html",
        "title": "‘I am not racist’ says MP candidate after backlash over online asylum seeker post",
        "description": "A Reform UK parliamentary candidate for Milton Keynes Central has denied being racist after sharing a post about asylum seekers and child abuse."
    },
    {
        "url": "https://inews.co.uk/news/politics/nigel-farage-comeback-speculation-new-attack-tories-2834218?ico=more_from_this_author",
        "title": "Nigel Farage comeback speculation builds as he launches new attack on the Tories",
        "description": "i understands any imminent return would be unlikely to see him become leader but instead take a role heading the election campaign"
    },
    {
        "url": "https://uk.news.yahoo.com/homeowners-warned-million-1800-mortgage-182505857.html",
        "title": "Homeowners warned of &#39;messy&#39; 2024 as 1.5 million face £1,800 mortgage spike",
        "description": "Homeowners protected by fixed-rate mortgages are in for a big hit in 2024, potentially adding to the Conservative Party&#39;s election challenges."
    },
    {
        "url": "https://www.countytimes.co.uk/news/24022099.400-000-grants-powys-groups---including-community-pub/",
        "title": "£400,000 in grants to Powys groups - including community pub",
        "description": "A total of £420,000 in grant money has been split between seventeen different organisations in Powys as part of the UK Shared Prosperity Fund."
    },
    {
        "url": "https://www.ft.com/content/679c3dcb-d48f-46cf-b6b9-928b408a3d3a",
        "title": "The optimistic case for the British economy",
        "description": "The UK economy shrank in the third quarter of last year, putting it on the cusp of a recession. It is expected to grow by about half a per cent in both 2023 and 2024 as the impact of high interest rates and elevated price levels squeeze households and businesses."
    },
    {
        "url": "https://www.thenational.scot/news/24023426.fears-warning-rotting-nuclear-infrastructure-clyde/",
        "title": "Fears after warning of &#39;rotting&#39; nuclear infrastructure on Clyde",
        "description": "THE UK Government must “urgently” make a statement to parliament on whether Scots living near its nuclear bases remain safe after alarm"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-67866346.amp",
        "title": "Hamas deputy leader Saleh al-Arouri killed in Beirut blast",
        "description": "The deputy head of Hamas, the Palestinian group which rules Gaza, has been killed in a blast in Lebanon, a senior Hamas official has told the BBC. Local media said Saleh al-Arouri was killed in an Israeli drone attack in the south of the capital, Beirut."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/survivors-and-victims-commissioner-directly-links-bereaved-payments-report-to-passage-of-uk-governments-legacy-act-WZQEE3T4SNAHZDZFGTKLBZKNEQ/",
        "title": "Survivors and victims’ commissioner directly links bereaved payments report to passage of <b>UK</b> Government’s legacy act",
        "description": "Outgoing victims’ and survivors commissioner Ian Jeffers on Tuesday directly linked his proposal for payments to all those bereaved during the conflict to the UK Government’s legacy act."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-67861377?at_medium=RSS&at_campaign=KARANGA",
        "title": "Turkey detains 34 on suspicion of spying for Israel",
        "description": "Turkey says it has seized 34 people who are alleged to have been involved in spying and planning abductions for Israel&#39;s Mossad intelligence agency. Officials said 57 addresses were raided in Istanbul and elsewhere and they were still searching for 12 more suspects."
    },
    {
        "url": "https://www.thenational.scot/politics/24023620.latest-scottish-political-polling-tells-us/",
        "title": "Here&#39;s what the latest Scottish <b>political</b> polling tells us",
        "description": "UNIONIST media and politicians have been trumpeting a “major” poll which purported to show Labour leading the SNP by six percentage"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/02/immigration-statistics-row-kicks-off-general-election-year",
        "title": "Immigration statistics row kicks off general election year",
        "description": "Future debates will focus on government promises and use of Home Office statistics"
    },
    {
        "url": "https://pressgazette.co.uk/publishers/broadcast/gb-news-viewing-figures/",
        "title": "GB News claims one million viewer breakthrough on first moments of 2024",
        "description": "More than one million viewers tuned into GB News at once during the early minutes of 2024, according to BARB overnight viewing figures."
    },
    {
        "url": "https://www.independent.co.uk/news/olaf-scholz-ap-germany-berlin-greens-b2472065.html",
        "title": "Members of Germany&#39;s smallest governing party vote to stay in Scholz&#39;s coalition, prompting relief",
        "description": "Members of the smallest party in German Chancellor Olaf Scholz’s unpopular coalition have voted in a low-profile ballot to stay in the troubled government, but the result underlines the three-party al"
    },
    {
        "url": "https://www.politicshome.com/news/article/whatsapp-campaigning-general-election-2024",
        "title": "WhatsApp Could Be The “Secret Battleground” In The Next General Election",
        "description": "WhatsApp is set to play a major part in 2024’s UK general election, with political strategists and parties already preparing to use the ubiquitous"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/government-labour-home-office-yvette-cooper-stephen-kinnock-b1129981.html",
        "title": "Ministers accused of ‘playing fast and loose’ with migration backlog figures",
        "description": "The Government is playing fast and loose with the figures. The public will not be fooled by smoke and mirrors Alp Mehmet, Migration Watch <b>UK</b> Labour, and the think tank Migration Watch <b>UK</b>, meanwhile questioned what had happened to migrants whose claims had ..."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/sport/national/24023871.omelettes-pizza-power-luke-littler-world-championship-final/",
        "title": "Omelettes and pizza power Luke Littler to World Championship final",
        "description": "Teenage star Luke Littler revealed a diet of cheese and ham omelettes and pizza has been behind his incredible journey to the World Championship final."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24023870.trial-man-accused-salman-rushdie-attack-may-delayed-authors-memoir/",
        "title": "Trial of man accused of Salman Rushdie attack may be delayed by author’s memoir",
        "description": "Hadi Matar, who is charged with stabbing the author, is entitled to the manuscript and related material for his trial preparation, a judge said."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24023091.not-racist-mp-candidate-defends-asylum-seeker-post/",
        "title": "&#39;Not racist&#39;: MP candidate defends asylum seeker post",
        "description": "A Reform UK parliamentary candidate for Milton Keynes Central has denied being racist after sharing a post about asylum seekers and child abuse."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24023553.care-home-inquiries-parents-made-daughters-sons/",
        "title": "‘Care home inquiries for parents made by more daughters than sons’",
        "description": "Daughters made more inquiries than sons about care for their parents across an eight-month period last year, according to figures from a care home reviews website. The data also showed that almost 1,000 people visited the website looking for a care home for themselves."
    },
    {
        "url": "https://www.markpack.org.uk/172324/is-there-an-unusually-large-number-of-undecided-voters/",
        "title": "Is there an unusually large number of undecided voters?",
        "description": "How pollsters treat those who say &#39;don&#39;t know&#39; is currently the biggest cause of differences in the results from different firms."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851200/lee-anderson-reform-uk-bigger-threat-than-labour",
        "title": "Lee Anderson warns of &#39;bigger threat than Labour&#39; that could help Keir Starmer win power",
        "description": "The Tory MP laid bare how Nigel Farage and his party had to be careful at the next election as Reform UK&#39;s presence could see Labour emerge victorious."
    },
    {
        "url": "https://www.thetimes.co.uk/article/uk-general-election-snp-scotland-kzfvnvs32",
        "title": "<b>UK</b> general election date will be crucial to Scotland’s future",
        "description": "The timing will have a major influence on the leadership of the SNP, which in turn could reshape politics north of the border for years to come"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24023499.no-current-plans-send-warships-patrol-red-sea-no-10-says/",
        "title": "No current plans to send more warships to patrol Red Sea, No 10 says",
        "description": "Foreign Secretary Lord Cameron meanwhile spoke to his US counterpart about the crisis of Iran-backed Houthi rebels targeting cargo ships."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24023468.suspect-released-investigation-two-women-found-dead-house/",
        "title": "Suspect released under investigation after two women found dead in house",
        "description": "A man suspected of murdering two women in Staffordshire has been released under investigation as police continue their inquiries. The 68-year-old was arrested after the two women were found “unresponsive with significant injuries” at a house in Park ..."
    },
    {
        "url": "https://uk.news.yahoo.com/why-authoritarianism-libertarianism-merged-political-165004516.html",
        "title": "Why have authoritarianism and libertarianism merged? A <b>political</b> psychologist on &#39;the vulnerability of the modern self&#39;",
        "description": "It is now not uncommon to find people supporting leaders like Donald Trump while insisting the state refrains from intervening in their lives."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/national/24023368.police-search-killers-get-away-car-fatal-shooting-outside-pub/",
        "title": "Police search for killer’s get-away car after fatal shooting outside pub",
        "description": "Marc Webley, 38, has been named locally as the victim of the shooting outside the Anchor Inn pub in Granton, Edinburgh."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/football/article-12919121/BBC-Sport-delete-bizarre-tweet-Wayne-Rooney-Peaky-Blinders-Birmingham-City-Gary-Lineker.html",
        "title": "Gary Lineker pressures BBC into DELETING bizarre tweet mocking up Wayne Rooney as a Peaky Blinder after his sacking by Birmingham City",
        "description": "BBC Sport deleted a bizarre tweet mocking Wayne Rooney following his sacking by Birmingham City after prompting from Gary Lineker ."
    },
    {
        "url": "https://fleetworld.co.uk/fleet-trends-for-2024-the-view-from-the-sector-experts/",
        "title": "Fleet trends for 2024: The view from the sector experts",
        "description": "UK’s pre-eminent fleet sector specialists give their views on what the next 12 months have in store for car and van op"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12918273/BUSINESS-LIVE-Shop-price-inflation-flat-Aldi-UK-Lidl-GB-festive-sales-soar.html",
        "title": "BUSINESS LIVE: Shop price inflation flat; Aldi <b>UK</b> and Lidl GB festive sales soar",
        "description": "The FTSE 100 closed down 11.72 points at 7721.52. Among the companies with reports and trading updates today are Aldi UK, Lidl GB and Reckitt Benckiser."
    },
    {
        "url": "https://www.libdemvoice.org/jamie-stone-and-sarah-dyke-share-new-years-resolutions-74442.html",
        "title": "Jamie Stone and Sarah Dyke share New Year’s Resolutions",
        "description": "Politics Home has been asking MPs to share their New Year&#39;s Resolutions. Two Lib Dems responded. Jamie Stone has pledged to offer a second constituency office in the town of Wick:"
    },
    {
        "url": "https://www.lse.co.uk/news/london-market-close-stocks-down-amid-disappointing-manufacturing-data-hdkad9ulc7zlrlo.html",
        "title": "LONDON MARKET CLOSE: Stocks down amid disappointing manufacturing data",
        "description": "The FTSE 100 index closed down 11.72 points, 0.2%, at 7,721.52. The FTSE 250 ended down 177.83 points, 0.9%, at 19,511.80, and the AIM All-Share closed down 1.77 points, or 0.2%, at 761.55."
    },
    {
        "url": "https://www.thesun.co.uk/news/25219443/rwanda-rishi-sunak-james-cleverly-migration/",
        "title": "Rwanda plan is stopping migrants, Cleverly says as PM claims win on clearing asylum backlog despite 98,000 in limbo",
        "description": "THE RWANDA policy is already deterring asylum seekers from coming to the UK, the Home Secretary insisted as the Prime Minister claimed victory over the asylum backlog. James Cleverly said this"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-67861266.amp",
        "title": "What is behind Turkey&#39;s staunch support for Hamas in Gaza?",
        "description": "Turkey has stepped up support for Gaza since 7 October, for example bringing dozens of patients from Gaza to Turkey for treatment. Turkey&#39;s health minister himself accompanied the casualties en route from Egypt."
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/news/people/staveley-council-hopes-chesterfield-mp-will-support-them-instead-of-putting-their-future-in-doubt-4463739",
        "title": "Staveley council hopes Chesterfield MP will support them instead of putting their future in doubt",
        "description": "Financially-troubled Staveley Town Council which has been making ‘significant progress’ with its recovery has urged Chesterfield MP Toby Perkins to ‘join the local community’ in supporting them after he has brought the authority’s future into question."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24023150.political-leaders-set-stall-start-campaigning-ahead-election/",
        "title": "<b>Political</b> leaders to set out stall and start campaigning ahead of election",
        "description": "Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer are both set to make public appearances this week."
    },
    {
        "url": "https://www.bbc.com/news/topics/cp7dzmndm9xt?page=6",
        "title": "James Cleverly",
        "description": "The home secretary says Rwanda is committed to the safety of anyone sent there as part of the government&#39;s migration deal. Ministers want to make their plan to send asylum seekers to Africa work - but nothing is certain."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/02/perilous-and-chaotic-election-officials-nervous-as-sunak-prepares-to-name-date",
        "title": "‘Perilous and chaotic’: why officials are nervy before a likely <b>UK</b> election in 2024",
        "description": "Paper ballots may act as barrier to cyber attacks, but introduction of voter ID could lead to a host of complications"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/elections-2024-guide-global-list-democracy-usa-uk-russia-ukraine-b1129226.html",
        "title": "A guide to all the world elections taking place in 2024, democracy&#39;s biggest year",
        "description": "From the UK and USA to Russia and Ukraine, more than 1.5 billion people will head to the polls this year in a record-breaking number of national elections. Emma Loffhagen unpacks what we can expect fr"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/02/rishi-sunak-latest-news-james-cleverly-asylum-small-boats/",
        "title": "<b>Politics</b> latest news: Number of asylum seekers removed from <b>UK</b> drops by half",
        "description": "James Cleverly has defended the Government over its claim to have delivered on Rishi Sunak’s pledge of clearing a backlog of asylum claims . Mr Sunak pledged in December 2022 to “abolish” the backlog of more than 91,000 outstanding “legacy” asylum cases older than June 2022 by the end of 2023."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24022931.power-outages-basingstoke-hit-storm-henk---live/",
        "title": "Power outages has Basingstoke hit by Storm Henk - live",
        "description": "Homes and businesses are without power has heavy rain and strong winds have hit Basingstoke as Storm Henk sweeps across the UK A number of"
    },
    {
        "url": "https://www.northsomersettimes.co.uk/news/24022851.north-somerset-mp-dr-liam-fox-receives-knighthood/",
        "title": "North Somerset MP Dr Liam Fox receives a Knighthood",
        "description": "NORTH Somerset MP Dr Liam Fox has received a Knighthood. Sir Liam received the award for public and political service. Speaking further about the Knighthood, Sir Liam said: “It has been an honour and privilege to serve the people of North Somerset and I thank them for their support since 1992."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851062/Tony-Blair-funding-backlash-Institute-Global-Change",
        "title": "‘Tony Blair should be behind bars’: New calls to axe knighthood over payments from despots",
        "description": "EXCLUSIVE: The deputy leader of Reform UK accused the former PM of &#39;being in bed with Bahrain and Saudi Arabia&#39;."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24021907.uk-factory-slump-deepens-european-demand-wanes/",
        "title": "<b>UK</b> factory slump deepens as European demand wanes",
        "description": "The UK’s manufacturing downturn deepened further at the end of the year and business confidence sank to a 12 month-low, according to a new survey. The S&amp;P Global/CIPS UK manufacturing PMI survey fell from 47.2 in November to 46.2 in December. The score remains below the 50.0 threshold, which indicates that the sector is contracting."
    },
    {
        "url": "https://www.newsletter.co.uk/business/2024-must-be-the-year-when-we-commit-to-real-progress-and-long-term-transformation-in-northern-ireland-says-chamber-president-4463568",
        "title": "2024 must be the year when we commit to real progress and long-term transformation in Northern Ireland says Chamber president",
        "description": "On behalf of the business community, we urge both party leaders and the Secretary of State to maintain momentum gathered in the most recent talks and reach agreement as early as possible in the New Ye"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/no-job-offer-made-to-dominic-cummings-in-meetings-with-pm-downing-street-says-107180/",
        "title": "No job offer made to Dominic Cummings in meetings with PM, Downing Street says",
        "description": "The Prime Minister’s official spokesman said a ‘private political discussion’ had taken place, but no job offer was made."
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/01/rishi-sunak-when-2024-general-election",
        "title": "The SNP will have nowhere to hide in 2024",
        "description": "It suits the Prime Minister to keep open the option of a May election but he risks being labelled a “bottler”."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/john-pilger-life-telling-truth-power",
        "title": "John Pilger: A life telling truth to power",
        "description": "He wrote in <b>UK</b> papers and magazines across the board from the New Statesman via The Guardian to The Express, and later many more outlets across the world. His dozen books, including his expose of Australia’s <b>political</b> corruption and genocidal history in ..."
    },
    {
        "url": "https://www.bbntimes.com/global-economy/uk-economy-will-remain-gloomy-in-2024",
        "title": "<b>UK</b> Economy Will Remain Gloomy in 2024",
        "description": "The UK economy will enter ‘grey gloom’ until polling day, according to the FT’s annual survey. A majority of the 90 respondents to the FT’s annual poll of leading UK-based economists said despite falling inflation voters would feel little improvement in their living standards before the general election expected this year."
    },
    {
        "url": "https://www.modernghana.com/news/1283115/nearly-30000-migrants-crossed-channel-to-uk-last.html",
        "title": "Nearly 30,000 migrants crossed Channel to <b>UK</b> last year",
        "description": "Nearly 30,000 migrants crossed the Channel from mainland Europe to Britain in small boats in 2023, an annual drop of more than a third, according to government figures released on Monday."
    },
    {
        "url": "https://www.thestage.co.uk/features/the-best-uk-theatre-shows-to-see-in-2024",
        "title": "The best <b>UK</b> theatre shows to see in 2024",
        "description": "As the curtain rises on a new theatrical year, The Stage picks out some of the biggest and most exciting shows set to thrill audiences in 2024"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/mum-raised-monkeys-m-not-180000887.html",
        "title": "‘My mum was raised by monkeys – I’m not worried about snakes in my jungle kitchen’",
        "description": "When the world went into lockdown during the Covid panic of 2020, Vanessa Forero was in Colombia, visiting the mountain village of Minca in the north-east of the country. Back home, she composes music for the advertising industry and had just put in an offer on a flat in Brighton but,"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/02/james-cleverly-home-office-legacy-asylum-backlog-rishi-sunak-uk-politics-live?page=with:block-659412a38f0892175dae5e57",
        "title": "No 10 refuses to follow Cleverly in setting end of 2024 as target date for ending all small boat crossings – <b>UK politics</b> live",
        "description": "Downing Street refuses to endorse home secretary as he says his aim is to reduce number of people crossing Channel on small boats to ‘zero’"
    },
    {
        "url": "https://www.yellowad.co.uk/cctv-appeal-after-disturbance-in-chafford-hundred/",
        "title": "CCTV appeal after disturbance in Chafford Hundred",
        "description": "Police have released CCTV images of three men they want to speak to in connection with a disturbance outside a"
    },
    {
        "url": "https://www.building.co.uk/november-housing-sales-fell-for-third-month-in-a-row-hmrc-says/5127011.article",
        "title": "November housing sales fell for third month in a row, HMRC says",
        "description": "Seasonally adjusted estimates by HMRC also reveal that housing transactions have fallen for the third consecutive month, with 84,600 property transactions recorded in September, and 81,770 and 80,780 in October and November respectively."
    },
    {
        "url": "https://www.lse.co.uk/news/london-market-midday-london-stocks-make-largely-soft-start-to-2024-8k6zej120op2zpi.html",
        "title": "LONDON MARKET MIDDAY: London stocks make largely soft start to 2024",
        "description": "the Cboe <b>UK</b> 250 was down 0.5% at 17,076.23, and the Cboe Small Companies was down 0.4% at 14,939.05 &quot;Markets got off to a cautious start on the first trading day of 2024, perhaps setting the tone for what could be a volatile year jam packed with <b>political</b> ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24020664.caremarks-plan-50-new-redcar-cleveland-jobs/",
        "title": "Caremark&#39;s plan for 50 new Redcar and Cleveland jobs",
        "description": "A HOMECARE company is launching a major recruitment drive after winning a contract to provide care to people living in supported living"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/rishi-sunak-asylum-backlog-cleverly-b2472052.html",
        "title": "Rishi Sunak engulfed by row over ‘false’ asylum statistics as 100,000 migrants still stuck in backlog",
        "description": "Labour accused Mr Sunak of ‘barefaced lie’ after he claimed to have cleared the asylum backlog - despite nearly 100,000 migrants waiting for a decision"
    },
    {
        "url": "https://www.libdems.org.uk/press/release/ed-daveys-new-year-message-beating-the-conservatives-isnt-enough",
        "title": "Ed Davey’s New Year message: “Beating the Conservatives isn’t enough”",
        "description": "In the video message, the Liberal Democrat Leader argues that “neither the Conservatives or Labour are capable of tackling” the “big, deep-rooted challenges in our country”, because neither will change the “broken political system” that underpins them."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/uk-today/24021920.power-cut--contact-prepare/",
        "title": "What to do in a power cut- Who to contact and how to prepare",
        "description": "If you experience a power cut, there are a few things you can do - the Met Office has given advice for what to do and who to contact."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/cameron-gaza-egypt-cyprus-grant-shapps-b1129885.html",
        "title": "First <b>UK</b> maritime shipment of aid for Gaza arrives in Egypt",
        "description": "The first UK maritime shipment of aid for Gaza has arrived in Egypt, carrying almost 90 tonnes of thermal blankets and other essential items. The shipment was delivered from Cyprus by Royal Fleet Auxiliary ship Lyme Bay, carrying thermal blankets, shelter packs and medical supplies provided by the UK and the Republic of Cyprus."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-67861486.amp",
        "title": "Italian outcry as MP Pozzolo&#39;s gun wounds man at New Year&#39;s Eve party",
        "description": "A shot that lightly wounded a man at a New Year&#39;s Eve party has prompted an angry political response after it emerged it was fired from a gun owned by an Italian far-right MP. Emanuele Pozzolo, a member of Prime Minister Georgia Meloni&#39;s Brothers of Italy party, admitted bringing the gun but denied firing the shot."
    },
    {
        "url": "https://www.theargus.co.uk/news/24005071.gatwick-airport-iran-international-terror-scout-convicted/",
        "title": "Gatwick Airport: Iran International terror scout convicted",
        "description": "A man monitored a news channel&#39;s headquarters in a bid to collect information for terrorists after the channel&#39;s reporting of political issues."
    },
    {
        "url": "https://www.ft.com/content/5da52770-b474-4547-8d1b-9c46a3c3bac9",
        "title": "Forget technology — politicians pose the gravest misinformation threat",
        "description": "and probably the <b>UK</b>. People will rightly be on their guard for misinformation, but much of the policy discussion on the topic ignores the most important source: members of the <b>political</b> elite. As a social scientist working on <b>political</b> communication ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/02/2024-lgbtq-anniversaries-milestones/",
        "title": "Key LGBTQ+ anniversaries to remember in 2024, including 10 years of same-sex marriage in the <b>UK</b>",
        "description": "These include dates marking world-changing firsts, the launch of leading LGBTQ+ charities, key <b>political</b> moments and the death of an LGBTQ+ trailblazer. 29 March: Same-sex marriages officially started in England and Wales on this date in 2014, under the ..."
    },
    {
        "url": "https://www.autoexpress.co.uk/tips-advice/361909/car-noise-limits-uk-laws-and-how-report-noisy-car-exhausts-or-engines",
        "title": "Car noise limits: <b>UK</b> laws and how to report noisy car exhausts or engines",
        "description": "In the <b>UK</b>, this legislation amazingly started all the way back in ... it could also be worth speaking to your local council or <b>political</b> representatives and requesting more of a police presence in your area – particularly as loud vehicles often go ..."
    }
]