[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h8rr3v",
        "title": "Why was the Clapham attack suspect&#39;s asylum claim approved?",
        "description": "Abdul Shokoor Ezedi is alleged to have thrown an alkali onto a woman and her two children, injuring them and nine others in the process. James is joined by BBC London reporter, Matt Graveling and immigration lawyer, Jacqueline McKenzie."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24094946.place-sun-presenter-jonnie-irwin-helped-couples-find-dream-homes/",
        "title": "A Place In The Sun presenter Jonnie Irwin helped couples find dream homes",
        "description": "The property expert was also known for appearing in Escape To The Country on the BBC and Dream Lives For Sale on Sky."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24094931.winner-61-7m-euromillions-ticket-comes-forward-claim-prize/",
        "title": "Winner of £61.7m EuroMillions ticket comes forward to claim prize",
        "description": "The UK owner of a £61.7 million-winning EuroMillions ticket has come forward to claim the prize, operator Allwyn has announced. The ticket-holder has won a £61,708,231 share of the £123 million jackpot prize from the draw on Tuesday – with the other winning ticket having been purchased in Spain."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/parties-united-in-tackling-unfinished-business-of-finance-for-ni-donaldson-BKKI5EPOQ5NODLE5ZHC2NDKRE4/",
        "title": "Parties united in tackling unfinished business of finance for NI – Donaldson",
        "description": "Northern Ireland political leaders met at Stormont Castle on Friday ahead of the return of devolved government on Saturday."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862599/lord-cameron-somaliland-recognition-red-sea-crisis",
        "title": "Lord Cameron &#39;sympathetic&#39; to making surprise diplomatic move to fix Red Sea Houthi crisis",
        "description": "Foreign Secretary Lord Cameron has met with a senior Tory MP to discuss the formal recognition of a Somaliland as the Red Sea crisis escalates."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.thenational.scot/politics/24093807.nicola-sturgeons-covid-inquiry-session-showed-scotlands-media/",
        "title": "Nicola Sturgeon&#39;s Covid Inquiry session showed up Scotland&#39;s media",
        "description": "SCOTLAND is very poorly served by its media, the broadcast media is controlled from London and pursues an avowedly British political and"
    },
    {
        "url": "https://www.thenational.scot/politics/24093676.story-tip-offs-cant-believe-true-one/",
        "title": "There are some story tip-offs you can&#39;t believe are true. This was one",
        "description": "The reaction to the news on social media proved what we at The National know all too well: countless people will spout nonsense without even bothering to read the story. How else do you explain those calling it a “lie”, when the Covid Inquiry had even accepted the “error” as factual ."
    },
    {
        "url": "https://www.techuk.org/resource/environmental-audit-committee-meets-to-discuss-outcomes-of-cop28.html",
        "title": "Environmental Audit Committee meets to discuss outcomes of COP28",
        "description": "Last Wednesday, the Environmental Audit Committee met to deliberate on the results of COP28, held at the end of last year in Dubai."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-mayor-hopefuls-urged-28561686",
        "title": "North East mayor hopefuls urged to take action to help region&#39;s one million women and girls",
        "description": "Campaigners are hoping to &quot;seize the moment&quot; and put tackling gender inequality issues at the very heart of the new North East Mayoral Combined Authority"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/business-insight-forget-number-10-alastair-campbell-was-nu-340864/",
        "title": "BUSINESS INSIGHT: Forget Number 10, Alastair Campbell was number one for Highland Business Dinner",
        "description": "The Highland Business Dinner is one of Inverness Chamber of Commerce’s flagship annual events. So, when I was thinking of the guest speaker I wanted for my first dinner as CEO of the chamber, Alastair Campbell was top of my list. I’m delighted that he has agreed to join us on May 17."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-meghan-markle-show-32034172",
        "title": "Prince Harry and Meghan Markle show off unseen underground lair in their Montecito home",
        "description": "Prince Harry and Meghan Markle gave fans a sneak peek at their impressive cellar room in their £14million Montecito property after filming in acceptance speech in the lair"
    },
    {
        "url": "https://www.dailymail.co.uk/health/article-13038239/UN-trans-health-panel-CRONYISM-experts-conflicts-profits-hormones-sex-surgery.html",
        "title": "UN trans health panel accused of CRONYISM: 80% of WHO&#39;s &#39;experts&#39; flagged for conflicts of interest - eyeing profits from hormones and sex-change ops they&#39;re pushing as global ...",
        "description": "A lot of organizations struggle when managing intellectual conflicts of interest, but a financial conflict of interest is kindergarten level,&#39; famed whistleblower Jamie Reed told DailyMail.com."
    },
    {
        "url": "https://inews.co.uk/opinion/rishi-sunak-asylum-turkey-2886998?ico=best_of_opinion",
        "title": "The next asylum headache for Rishi Sunak is from Turkey",
        "description": "The Turkish paradox is one that highlights a central conundrum of asylum policy and one which will also haunt a Labour succession as it seeks to constrain illegal arrivals, while upholding pledges to assist those most in need of refuge."
    },
    {
        "url": "https://www.ft.com/content/e9eec48c-22e2-4ff9-98ef-76f2d90af88c",
        "title": "Northern Ireland revisits the success of ‘constructive ambiguity’",
        "description": "Politics in the province cannot be forced into straight lines — this week’s deal follows the lessons of its history"
    },
    {
        "url": "https://www.standard.co.uk/comment/russia-ukraine-world-war-three-vladimir-putin-b1136411.html",
        "title": "Vladimir Putin has a 10-year-war plan aimed at dominating Europe",
        "description": "This chimes with warnings from Defence Secretary Grant Shapps and the head of the <b>UK</b> Army, General Sir Patrick Sanders ... Russia and Ukraine’s mutual and intertwined destinies, seem <b>political</b> science fiction. But the dreaming is matched with some ..."
    },
    {
        "url": "https://en.abna24.com/story/1434585",
        "title": "US, <b>UK</b> strikes will not change Yemen&#39;s stance: Ansarullah",
        "description": "The leader of Yemen’s Ansarullah movement says US and UK strikes are futile and have no impact on Yemen&#39;s stance, rather they will only cause the country to enhance its military capabilities."
    },
    {
        "url": "https://news.sky.com/story/labour-will-look-for-radicalism-through-reform-13062317?dcmp=snt-sf-twitter",
        "title": "Labour will look for &#39;radicalism&#39; through reform rather than risk fiscal slip-up",
        "description": "In a week of row backs from her party over reinstating the cap on bankers&#39; bonuses and pouring up to £28bn a year into green energy, Angela Rayner is one Labour politician standing her ground. In Scotland to promote her &quot;new deal for workers&quot;, the deputy ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/clapham-alkaline-attack-row-asylum-b2489543.html",
        "title": "Clapham alkaline attack: Immigration row over refugee granted asylum despite sex crimes",
        "description": "Abdul Ezedi, 35, who is on the run after an attack in Clapham, south London, on Wednesday, pleaded guilty to sexual assault and exposure in 2018 but was still granted asylum in Britain in 2021 or 2022."
    },
    {
        "url": "https://ifs.org.uk/journals/financing-uk-democracy-stocktake-20-years-political-donations-disclosure",
        "title": "Financing <b>UK</b> democracy: a stocktake of 20 years of <b>political</b> donations disclosure",
        "description": "We study political donations data disclosed since 2001 to evaluate the role of private and public political finance over time."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/02/andriy-shevchenko-football-ukraine-russia/",
        "title": "Ukraine: The Latest - Is Andriy Shevchenko the man to save Ukrainian football?",
        "description": "Every weekday The Telegraph’s top journalists analyse the invasion from all angles - military, humanitarian, <b>political</b>, economic, historical - and tell you what you need to know to stay updated. With over 70 million listens, our Ukraine: The Latest ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/live-wales-breaking-news-plus-28555434",
        "title": "Live: Wales breaking news plus weather and traffic updates (Friday, February 2)",
        "description": "Hello, and welcome to Wales Online&#39;s live blog for Friday, February 2. We will be bringing you all of the latest news from across Wales - whether you&#39;re on the move, at home or at work - as well as the latest traffic and travel."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/somerset-news/royal-navy-contract-brings-mammoth-9075476",
        "title": "Royal Navy contract brings a mammoth jobs boost to South West",
        "description": "Defence Secretary Grant Shapps in Plymouth to announce £1.85bn deal bringing jobs to Plymouth, Bristol and Somerset"
    },
    {
        "url": "https://www.maidenhead-advertiser.co.uk/gallery/your-views/194354/viewpoint-reaction-to-braywick-park-padel-tennis-land-disposal.html",
        "title": "Viewpoint: Reaction to Braywick Park padel tennis land disposal",
        "description": "The number of bees in <b>UK</b> can only be an estimate ... Mr Wilding’s letter should be seen as alarmist, grossly exaggerated, and written more as a <b>political</b> rant than informed argument for a change in government policy. We should all be aware that the ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/02/keir-starmer-ditching-28bn-climate-plan-cowardly-labour",
        "title": "A message to Starmer from the US: ditching your £28bn climate plan isn’t just cowardly – it’s bad <b>politics</b>",
        "description": "Under present policies, the climate crisis could cost the <b>UK</b> 3.3% of GDP a year by 2050 ... If party top brass can summon even an ounce of <b>political</b> courage they’ll make another U-turn away from disastrous, outdated economic orthodoxy and revive their ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/power-sharing-northern-ireland-set-32033049",
        "title": "Power sharing in Northern Ireland set to be resurrected two years after collapse",
        "description": "In a historic moment Sinn Fein&#39;s Michelle O&#39;Neill will become the first republican First Minister after the DUP ended a two-year political paralysis at Stormont"
    },
    {
        "url": "https://www.bmj.com/content/384/bmj.q290",
        "title": "<b>UK</b>’s progress on cancer survival has slowed in past decade, figures show",
        "description": "Cancer survival in the UK is the highest it has ever been, but the rate of progress has slowed considerably, show new data from Cancer Research UK. On 2 February the charity published its Cancer in the UK report,"
    },
    {
        "url": "https://uk.news.yahoo.com/scottish-mum-anger-enforced-exile-165606625.html",
        "title": "Scottish mum’s anger at &#39;enforced exile&#39; due to migration visa cost hike",
        "description": "A Hawick mum-of-three says she is being blocked from returning home from Italy with her young family because of a proposed hike in the cost of attaining a legal migration work visa."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24094423.remarks-sturgeons-covid-inquiry-tears-unacceptable---scottish-minister/",
        "title": "Remarks about Sturgeon’s Covid inquiry tears ‘unacceptable’ – Scottish minister",
        "description": "Commentary around Nicola Sturgeon’s emotional appearance at the <b>UK</b> Covid-19 Inquiry is “not acceptable ... remarks show women’s emotions are often used as a “sport” in <b>politics</b>. Scottish Culture Secretary Angus Robertson said he would not ..."
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24092880.donaldson-will-hold-governments-feet-fire-stormont-deal/",
        "title": "Donaldson ‘will hold Government’s feet to the fire’ over Stormont deal",
        "description": "I’m not just relying on the <b>UK</b> Government. It has been confirmed that the Assembly ... Sir Jeffrey added: “It (command paper) is a <b>political</b> declaration of what the Government is doing and has, in some instances, already done and will do."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "And I thought the figures were pretty stark. I think it’s in the <b>UK</b>, a 25 percentage point gap between women and men, women being more liberal in their <b>political</b> viewpoint. And you also talk in your piece about the US and Germany having even bigger gaps ..."
    },
    {
        "url": "https://uk.news.yahoo.com/far-politics-predicted-strong-influence-172021529.html",
        "title": "Far-right <b>politics</b> predicted to have strong influence in 2024 European Parliament elections",
        "description": "European Parliament elections, set to take place in June, will see a “surge” in support for far-right and populist parties, according to a new report. The shift is due to far-right politics breaking through into the mainstream in several European countries in recent years and is set to have ample consequences on"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68185611.amp",
        "title": "Alleged migrant attack on NYC police sparks <b>political</b> uproar",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... has sparked a US election-year <b>political</b> furore. At least 12 suspects ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/uk-government-urged-adopt-more-000012399.html",
        "title": "<b>UK</b> government urged to adopt more positive outlook for LLMs to avoid missing &#39;AI goldrush&#39;",
        "description": "which gathered some of the world&#39;s <b>political</b> and corporate leaders into the same room at Bletchley Park back in November. At the same time, a divide is emerging around to what extent we should regulate this new technology. Meta&#39;s chief AI scientist Yann ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/squad-progressive-democrats-controversies-b2489083.html",
        "title": "US House ‘Squad’ faces rocky terrain as controversies pile up",
        "description": "Several members of the progressive ‘Squad’ in the US House of Representatives are facing controversy and ire from House Republicans this week. Katie Hawkinson and Eric Garcia report from Capitol Hill"
    },
    {
        "url": "https://www.heraldscotland.com/sport/13179283.independence-affect-glasgows-2020-euro-bid-say-uefa/",
        "title": "Independence could affect Glasgow&#39;s 2020 Euro bid, say Uefa",
        "description": "&quot;The situation may have to be re-assessed should Scotland become independent of the <b>UK</b> following the referendum ... UEFA&#39;s report also raises concerns about the <b>political</b> situation in Israel and Russia, who are also bidding with Jerusalem and St Petersburg ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/alister-jack-scottish-angus-robertson-government-uk-government-b1136733.html",
        "title": "Remarks about Sturgeon’s Covid inquiry tears ‘unacceptable’ – Scottish minister",
        "description": "Speaking to the inquiry on Thursday, Scottish Secretary Alister Jack said he “didn’t believe for a minute” the evidence Ms Sturgeon provided the day before, and he claimed she could “cry from one eye if she wanted to”."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24094475.tata-steel-begins-formal-45-day-consultation-plans-port-talbot-plant/",
        "title": "Tata Steel begins formal 45-day consultation over plans for Port Talbot plant",
        "description": "“As required, we have submitted the headline numbers of roles that would be impacted at each of our <b>UK</b> sites, and shared these through the <b>UK</b> Steel Committee. “We understand what an unsettling time this is for our people and we are determined to give ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/national/24093919.labour-not-committed-arbitrary-numbers-green-investment---rayner/",
        "title": "Labour not committed to ‘arbitrary’ numbers on green investment – Rayner",
        "description": "which has squandered the <b>UK</b>’s gains on climate and left us far behind in the global race to a zero-carbon economy. “A collective <b>political</b> failure to see the huge economic opportunities of a fair transition would be both short-sighted and deeply ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/02/derek-drapers-funeral-held-church-married-kate-garraway-20213200/?ico=mosaic_entertainment",
        "title": "Kate Garraway says goodbye to Derek Draper at church that meant so much to them",
        "description": "The author and former <b>political</b> advisor was hospitalised last month after suffering ... If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.<b>uk</b> entertainment team by emailing us celebtips@metro.co.<b>uk</b>, calling 020 3615 ..."
    }
]