[
    {
        "url": "https://www.ft.com/content/5050571e-79f9-4cb7-991c-093702ec8833?shareType=nongift",
        "title": "German far-right leader hails Brexit as ‘model for Germany’",
        "description": "Simply sign up to the German <b>politics</b> myFT Digest -- delivered directly to your inbox. The far-right Alternative for Germany will push for a Brexit-style referendum on membership of the EU if it comes to power, its leader Alice Weidel said, hailing the <b>UK</b> ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24067568.houthi-rebels-behind-attacks-ships-red-sea/",
        "title": "Who are the Houthi rebels behind attacks on ships in Red Sea?",
        "description": "The rebels have attacked Saudi Arabia, the UAE and most recently Israel with missiles before the clashes in the Red Sea erupted. The joint operation on Monday comes after US and UK warships and jets hit more than 60 targets in 28 locations on January 11."
    },
    {
        "url": "https://inews.co.uk/news/politics/nhs-bill-cut-10bn-crack-down-waste-labour-2867919?ico=above_article_ticker",
        "title": "NHS bill could be cut by £10bn by cracking down on waste Labour claim",
        "description": "Labour also claimed £1.7bn was being wasted due to beds being blocked by people who are well enough to leave hospital but cannot because of a lack of community care. However, the party does not spell out how it would deal with chronic social care failures in the UK."
    },
    {
        "url": "https://news.sky.com/story/labours-david-lammy-says-he-would-work-with-donald-trump-despite-calling-him-a-neo-nazi-sympathising-sociopath-13054268",
        "title": "Labour&#39;s David Lammy says he would work with Donald Trump - despite calling him a &#39;neo-Nazi-sympathising sociopath&#39;",
        "description": "Mr Lammy, Labour&#39;s shadow foreign secretary, repeatedly criticised Mr Trump during his first presidency but said he would work with him if the pair ended up at either end of the so-called special relationship."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/22/middle-east-crisis-live-updates-news-airstrikes-houthi-missile-yemen-biden-sunak-red-sea?page=with:block-65aef2cf8f0805c892754795",
        "title": "Middle East crisis live: <b>UK</b> says airstrikes are in ‘self-defence’ as Pentagon says bombing targeted Houthi underground missile sites",
        "description": "Pentagon details eight new strikes in joint statement with UK, Australia, Bahrain, Canada and the Netherlands, which supported latest bombing"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/concerns-raised-north-sea-oil-220556499.html",
        "title": "Concerns raised as North Sea oil proposals clear first Commons hurdle",
        "description": "“Scotland has the energy, we just need the power.” Greenpeace <b>UK</b>’s <b>political</b> campaigner Ami McCarth also said: “The Government may have won this vote but the planet and everyone on it has lost as a result. “Literally no-one benefits from this ..."
    },
    {
        "url": "https://www.ilkleygazette.co.uk/news/national/24065364.putin-election-campaign-presents-boxes-filled-petitions-backing-run/",
        "title": "Putin election campaign presents boxes filled with petitions backing his run",
        "description": "Russian President Vladimir Putin’s campaign staff have unveiled scores of boxes filled with signed petitions supporting his run in the March presidential election – a vote he is almost certain to win. Mr Putin, although closely tied to the dominant ..."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/money/bbc-uphill-battle-publics-trust-monumental-year-2866031?ico=more_from_this_author",
        "title": "The BBC faces an uphill battle for public’s trust in a monumental year",
        "description": "“The BBC must be destroyed in order to be saved,” writes the iconoclastic former BBC royal correspondent Michael Cole. He suggests a subscription service for BBC News, including documentaries and Radio 4, with a separate sub charged for the BBC’s music and culture output."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24067571.fresh-uk-us-airstrikes-houthi-targets-deal-another-blow-militants/",
        "title": "Fresh <b>UK</b> and US airstrikes on Houthi targets to ‘deal another blow’ to militants",
        "description": "Fresh <b>UK</b> and US joint airstrikes against Houthi targets in Yemen have been carried out, the Ministry of Defence has said. Defence Secretary Grant Shapps said the latest round of strikes were in “self-defence” as attacks on ships continue in the Red Sea ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13154884.culture-secretary-javid-fire-snp/",
        "title": "Culture Secretary Javid is under fire from SNP",
        "description": "He becomes the first Asian man to be a member of the <b>UK</b> Cabinet. Prior to becoming an MP ... and is said to have amassed £20m during his banking career, but turned to <b>politics</b> to &quot;give something back&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/alok-sharma-government-oil-gas-mps-back-bill-2868081",
        "title": "Ex-climate chief tears into Government’s oil and gas plans as MPs back bill",
        "description": "Sir Alok Sharma, the COP26 president, says bill will signal to world that UK is turning away from tackling climate change"
    },
    {
        "url": "https://www.leighjournal.co.uk/news/national/24067535.norman-jewison-fiddler-roof-moonstruck-director-dies-aged-97/",
        "title": "Norman Jewison, Fiddler On The Roof and Moonstruck director, dies aged 97",
        "description": "Norman Jewison, the Canadian-born director whose Hollywood films ranged from Doris Day comedies and Moonstruck to social dramas such as the Oscar-winning In The Heat Of The Night, has died aged 97."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24067546.us-uk-carry-fresh-strikes-houthis/",
        "title": "US and <b>UK</b> carry out fresh strikes on Houthis",
        "description": "The UK and the US have once again carried out joint airstrikes against Houthi targets in Yemen. Officials say the US and UK took out Houthi missile storage sites and launchers, in the second set of co-ordinated strikes against the Iran-backed militants."
    },
    {
        "url": "https://www.ibtimes.co.uk/chief-whip-warn-tory-mps-who-rebelled-rwanda-1722903",
        "title": "Chief Whip To Warn Tory MPs Who Rebelled On Rwanda",
        "description": "The Conservative Party witnessed its biggest rebellion in years after 60 MPs called on Rishi Sunak to tighten his grip on the Rwanda legislation."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/cricket/article-12993793/LAWRENCE-BOOTH-Indias-petty-muscle-flexing-block-young-Englands-young-Muslim-spinner-Shoaib-Bashir-entering-country-just-makes-look-SMALL-gains-this.html",
        "title": "LAWRENCE BOOTH: India&#39;s petty muscle-flexing to block young England&#39;s young Muslim spinner Shoaib Bashir from entering the country just makes them look SMALL… who gains from ...",
        "description": "Elevated to the Test squad one minute - a call-up that sparked tears of joy - he has been slapped down the next."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/jan/22/oil-and-gas-bill-breaks-uk-promise-phase-out-fossil-fuels-alok-sharma-says?ref=biztoc.com",
        "title": "Alok Sharma condemns government’s oil and gas bill as vote passes first hurdle",
        "description": "Former Cop26 president abstains from vote saying bill breaks UK’s promise to phase out fossil fuels"
    },
    {
        "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-01-22-24/h_bcea34adfb7d01899d1d59278a3a9bfe",
        "title": "The latest on Israel&#39;s war in Gaza",
        "description": "Israeli Prime Minister Netanyahu rejected Hamas&#39; conditions for an end to the war in exchange for the release of hostages held in Gaza as he faces increasing public pressure to bring the captives home."
    },
    {
        "url": "https://www.ft.com/content/7db6f3f7-d1e7-4c2d-871b-b93e14abf0dd",
        "title": "Voter ID rules could be seen to benefit Conservatives, warns elections watchdog",
        "description": "John Pullinger says forcing voters to carry identification could disenfranchise certain groups at the general election"
    },
    {
        "url": "https://www.christiantoday.com/article/calls.for.political.action.to.address.staggering.increase.in.porn.addiction.among.young.people/141298.htm",
        "title": "Calls for <b>political</b> action to address staggering increase in porn addiction among young people",
        "description": "Mental health and addiction clinic, Paracelsus Recovery, has reported a 150 per cent increase in people being treated for porn addiction between 2019 and 2023."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h6j1yk",
        "title": "Measles cases on the rise + Trump&#39;s big week",
        "description": "And in the US, Florida Governor Ron DeSantis has dropped out the race to become the Republican presidential nominee, endorsing Mr Trump. Is the race to challenge Joe Biden effectively over? BBC US Special Correspondent, Katty Kay, brings us the latest from the campaign trail."
    },
    {
        "url": "https://www.independent.co.uk/business/concerns-raised-as-north-sea-oil-proposals-clear-first-commons-hurdle-b2482946.html",
        "title": "Concerns raised as North Sea oil proposals clear first Commons hurdle",
        "description": "A Government bid to maximise North Sea oil and gas production has cleared its first Commons test, amid Tory criticism and warnings of “sleepless nights” over the proposals."
    },
    {
        "url": "https://www.ross-shirejournal.co.uk/news/across-the-pond-unease-grows-as-us-election-year-hype-build-339705/",
        "title": "ACROSS THE POND: Trump-related uneasiness returns as United States election year hype gathers pace",
        "description": "She won&#39;t stay up &#39;but no doubt I’ll be in my bed fretting and wondering if I’ll be able to sleep easy for the next four years&#39;."
    },
    {
        "url": "https://news.sky.com/story/blow-for-rishi-sunak-as-rwanda-bill-suffers-first-defeat-in-house-of-lords-13054210",
        "title": "Blow for Rishi Sunak as Rwanda plan suffers first defeat in House of Lords",
        "description": "The House of Lords has defied Rishi Sunak to vote against the ratification of the UK&#39;s new treaty with Rwanda - in what could prove a damaging development for the Safety of Rwanda Bill. The upper house was voting following a report last week that recommended the treaty not be ratified."
    },
    {
        "url": "https://www.mirror.co.uk/sport/football/aymeric-laporte-saudi-pro-mls-31942378",
        "title": "Ex-Man City star Aymeric Laporte slams Saudi Pro League - &#39;many players are dissatisfied&#39;",
        "description": "Former Premier League star Aymeric Laporte has become the latest high-profile player to speak out about his experiences in the Saudi Pro League in recent times, and his words could help MLS recruitmen"
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/jason-kelce-topless-nfl-swift-31941926",
        "title": "Jason Kelce lets young fan meet Taylor Swift after he goes topless at Chiefs game",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA ... You can report any errors to webhomepage@mirror.co.<b>uk</b>"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1858639/meghan-markle-suits-spin-off-hollywood-career",
        "title": "Meghan Markle would &#39;guarantee headlines&#39; with Suits spin-off role amid speculation",
        "description": "Meghan Markle left the show in season seven when her character Rachel Zane married Mike Ross and moved to Seattle."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24067434.humza-yousaf-warns-disruption-storm-jocelyn/",
        "title": "Humza Yousaf warns of more disruption from Storm Jocelyn",
        "description": "First Minister Humza Yousaf paid tribute to the first victim of Storm Isha as he warned of more disruption due to the amber weather warning for Storm Jocelyn."
    },
    {
        "url": "https://www.thenational.scot/politics/24066363.disgusting-behaviour-drunken-parties-downing-street/",
        "title": "&#39;Disgusting&#39; behaviour is having drunken parties in Downing Street",
        "description": "Television presenter and political campaigner Carol Vorderman has issued a retraction of a tweet she had previously put out criticising former"
    },
    {
        "url": "https://www.heraldscotland.com/news/24067405.general-election-snp-talking-labours-chances/",
        "title": "General Election: Should SNP be talking up Labour&#39;s chances?",
        "description": "The SNP has decided who will win the next general election and, for once, a political party is not boasting about its own chances."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24067379.measles-vaccine-rates-higher-scotland-england/",
        "title": "Measles vaccine rates are higher in Scotland than in England",
        "description": "Some good news for once. Public Health Scotland says no cervical cancer cases have been detected in women who received the human"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/22/ftse-100-markets-latest-news-boeing-jets-airline-inspection/",
        "title": "Nearly 50,000 companies face collapse as ‘debt storm’ hits",
        "description": "Airlines have been told by regulators to inspect the door plugs on another class of Boeing jet following the mid-air blowout on an Alaska Airlines flight earlier this month. The US Federal Aviation Administration (FAA) late Sunday said companies operating Boeing 737-900ER jets should make sure equipment was properly secured."
    },
    {
        "url": "https://www.charitytoday.co.uk/misinformation-a-looming-threat-to-our-sustainable-future/",
        "title": "Misinformation: A Looming Threat to Our Sustainable Future",
        "description": "In our quest to achieve the Paris Climate Agreement and Sustainable Development Goals (SDGs), we face a perilous adversary that has grown exponentially in"
    },
    {
        "url": "https://www.scotsman.com/news/politics/analysis-uk-covid-inquiry-exposes-the-difficulties-thrown-up-by-whatsapp-4488504",
        "title": "Analysis: <b>UK</b> Covid Inquiry exposes the difficulties thrown up by WhatsApp",
        "description": "The UK Covid Inquiry is exposing some of the difficulties thrown up by mobile messaging services such as WhatsApp. Professor Sir Gregor Smith, Scotland’s chief medical officer, told a hearing in Edinburgh that he deleted messages “on a frequent basis”."
    },
    {
        "url": "https://www.sussex.ac.uk/broadcast/read/63202",
        "title": "&quot;There is no more powerful degree than a medical degree&quot;",
        "description": "TV medical doctor and health campaigner Dr Chris van Tulleken is receiving an honorary doctorate at Winter Graduation."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/22/rishi-sunak-rwanda-bbc-conservatives-uk-politics-live?page=with:block-65aeb32d8f081fd80444f550",
        "title": "House of Lords debates Rishi Sunak’s Rwanda treaty – <b>UK politics</b> live",
        "description": "Lords to debate whether it should delay ratification of UK-Rwanda treaty"
    },
    {
        "url": "https://www.itv.com/news/2024-01-22/royal-mail-should-not-ditch-saturday-postal-service-downing-street-says",
        "title": "Royal Mail should not ditch Saturday postal service, Downing Street says",
        "description": "Regulator Ofcom is due to report back this week on its review of the universal postal service provided by. | ITV National News"
    },
    {
        "url": "https://uk.news.yahoo.com/catalan-independence-politician-clara-ponsati-174215182.html",
        "title": "Catalan independence politician Clara Ponsati to meet MPs in Westminster",
        "description": "A KEY figurehead in Catalonia’s struggle for independence will meet MPs in Westminster after a turbulent year in Spanish politics, which saw her pro-independence party thrust back into the spotlight."
    },
    {
        "url": "https://www.thenational.scot/news/24067294.catalan-independence-politician-clara-ponsati-meet-mps/",
        "title": "Catalan independence politician Clara Ponsati to meet MPs",
        "description": "A KEY figurehead in Catalonia’s struggle for independence will meet MPs in Westminster after a turbulent year in Spanish politics, which saw"
    },
    {
        "url": "https://www.itv.com/news/2024-01-22/residents-face-double-whammy-of-council-tax-hikes-and-service-cuts-pm-warned",
        "title": "Residents face &#39;double whammy&#39; of council tax hikes and service cuts, PM warned",
        "description": "More than 40 Tory MPs are threatening Rishi Sunak with rebellion if he does not announce emergency funding for local councils in the UK. | ITV National News"
    },
    {
        "url": "https://edition.cnn.com/2024/01/22/politics/us-uk-strikes-yemen-iraq/index.html",
        "title": "US and <b>UK</b> carry out additional strikes against Houthi targets in Yemen",
        "description": "The US and UK carried out additional strikes against Houthi targets in Yemen on Monday, marking the eighth round of attacks by the US military on the rebels’ infrastructure in just over 10 days, two defense officials told CNN."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/22/two-state-solution-peace-talks-israel-gaza-european-union/",
        "title": "Two-state solution can be drawn up without Israel at the table, says EU diplomat",
        "description": "A plan prepared by Brussels&#39; foreign affairs arm states it is the responsibility of ‘outside actors’ to press ahead with peace talks"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/united-kingdom-solar-panel-recycling-183300951.html",
        "title": "United Kingdom Solar Panel Recycling Market: In-Depth Analysis and Future Prospects Through 2030",
        "description": "Key Report Insights Unveiling the market size and growth factors in the <b>UK</b> solar panel recycling market. Analyzing the competitive landscape and top market players. Understanding the prevalent market trends and future projection. Evaluating opportunities ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1858428/lord-frost-brexit-win-eu-rule-axed?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "Lord Frost pinpoints £300bn Brexit win you probably never noticed as &#39;absurd&#39; EU rule axed",
        "description": "He said: “One of the little commented-upon aspects of the 2020 TCA [The EU–<b>UK</b> Trade and Cooperation Agreement] negotiations ... He added: “It is a post-Brexit reform that has slipped under the <b>political</b> radar because of its rather technical nature ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68064247",
        "title": "Fake Biden robocall tells voters to skip New Hampshire primary election",
        "description": "To recipients, the robocalls falsely appeared to be coming from the personal mobile phone number of a former state Democratic chairwoman, Kathy Sullivan, who helps run a pro-Biden <b>political</b> group in New Hampshire. &quot;This call links back to my personal cell ..."
    },
    {
        "url": "https://www.keighleynews.co.uk/news/national/24065364.putin-election-campaign-presents-boxes-filled-petitions-backing-run/",
        "title": "Putin election campaign presents boxes filled with petitions backing his run",
        "description": "Russian President Vladimir Putin’s campaign staff have unveiled scores of boxes filled with signed petitions supporting his run in the March presidential election – a vote he is almost certain to win."
    },
    {
        "url": "https://schoolsweek.co.uk/ex-government-advisor-tim-leunig/",
        "title": "Ex government advisor Tim Leunig",
        "description": "He is adamant that <b>UK</b> unemployment would have hit four million without it ... Leunig devised the national funding formula in 2014 (although it took another four years to get “<b>political</b> buy-in”). His belief in fair funding stems from his own schooling."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/grant-shapps-houthi-yemen-mod-ministry-of-defence-b1134062.html",
        "title": "Fresh <b>UK</b> and US airstrikes on Houthi targets ‘deal another blow’ to militants",
        "description": "Fresh <b>UK</b> and US joint airstrikes against Houthi targets in Yemen have been carried out, the Ministry of Defence has said. The <b>UK</b> and the US have carried out a fresh set of joint airstrikes in Yemen, in the latest bid to stop Houthi attacks. Defence ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-council-leader-says-child-28493735",
        "title": "Birmingham council leader says child poverty levels show ‘shocking reality&#39;",
        "description": "“And yet, the <b>UK</b> has grown faster than Germany, Italy, France, Spain and Japan,” the government spokesperson continued. Keep up to date with all the latest <b>politics</b> news with our <b>politics</b> newsletter. You can sign up for free here to get stories ..."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24065084.bbc-biased-on-occasion-says-culture-secretary/",
        "title": "The BBC has been biased ‘on occasion’, says Culture Secretary",
        "description": "Culture Secretary Lucy Frazer said she believes the BBC has been biased “on occasion” as she discussed new measures aimed at boosting confidence in the corporation’s impartiality. The reforms, announced as part of the BBC mid-term review, would give ..."
    }
]