[
    {
        "url": "https://www.kentonline.co.uk/news/national/ni-secretary-to-take-pragmatic-approach-after-latest-stormont-deadline-passes-108432/",
        "title": "NI Secretary to take ‘pragmatic’ approach after latest Stormont deadline passes",
        "description": "Chris Heaton-Harris had been placed under an obligation to call a fresh Assembly election if devolved government had not been restored by January 18."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12981361/MICK-HUME-British-voters-elite-democracy-dirty-word.html",
        "title": "MICK HUME: Who rules? British voters or our sneering elite who think democracy is a dirty word",
        "description": "Want to know why so many people in the UK feel ignored, insulted and treated with contempt by powerful elites who appear to live in a different world?"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68017310?at_bbc_team=editorial&at_link_type=web_link&at_ptr_name=facebook_page&at_format=link&at_link_origin=BBC_Politics&at_link_id=89E5269C-B5FA-11EE-80FE-682855826ABF&at_campaign_type=owned",
        "title": "Rishi Sunak urges Lords to back Rwanda bill",
        "description": "What is the <b>UK</b>&#39;s plan to send asylum seekers to Rwanda ... programme many peers would see it as &quot;a step too far&quot; and an &quot;illegitimate interference by <b>politics</b> with the law&quot;. Mr Sunak urged peers to pass the bill unamended to get flights up and running ..."
    },
    {
        "url": "https://bylinetimes.com/2024/01/18/reform-uk-limited-the-political-business-brought-to-you-by-billionaires/",
        "title": "Reform <b>UK</b> Limited: The <b>Political</b> Business Brought to You by Billionaires",
        "description": "Despite its wealthy backers and blanket media coverage, few have peered under the bonnet of Reform UK. It&#39;s time to take a look at its backers."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856834/poll-reform-uk-general-election",
        "title": "POLL: Do you think Reform <b>UK</b> has a chance at the next general election? Vote here",
        "description": "Readers can vote in our online survey on whether you think the Nigel Farage-linked party stands a chance when the country goes to the polls."
    },
    {
        "url": "https://www.ibtimes.co.uk/future-news-inquiry-investigate-effect-ai-uk-news-media-houses-1722847",
        "title": "Future of News Inquiry To Investigate Effect of AI on <b>UK</b> News Media Houses",
        "description": "The Communications and Digital Committee seeking responses from the UK news industry stakeholders for a future of news inquiry to understand the challenges faced by the UK news media houses."
    },
    {
        "url": "https://www.fwi.co.uk/news/farm-policy/analysis-how-is-the-political-outlook-for-2024-shaping-up",
        "title": "Analysis: How is the <b>political</b> outlook for 2024 shaping up?",
        "description": "Renowned 16th-century philosopher Nostradamus, who is credited with predicting the rise of Adolf Hitler and the Covid-19 pandemic, had some pretty"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/economist-says-that-despite-good-intentions-strikers-are-damaging-political-institutions-4484269",
        "title": "Economist says that despite good intentions - strikers are damaging <b>political</b> institutions",
        "description": "Dr Esmond Birnie says strikes could set a dangerous precedent and cause Northern Ireland reputational damage – showing that politicians can be blown with the wind."
    },
    {
        "url": "https://www.varsity.co.uk/interviews/26754",
        "title": "Joe Seddon’s fight to transform <b>UK</b> higher education and beyond",
        "description": "Sophie Denny speaks to Zero Gravity founder Joe Seddon about his time at Oxford, his passion for change and the current state of UK higher education"
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24060303.new-date-uk-wide-day-reflection-died-pandemic/",
        "title": "New date for <b>UK</b>-wide day of reflection for those who died in pandemic",
        "description": "A minute’s silence will be held at midday and Marie Curie said it wants to encourage people to come together to remember and reflect."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24060296.one-third-uk-adults-will-run-money-end-january-survey-says/",
        "title": "One third of <b>UK</b> adults will run out of money by the end of January, survey says",
        "description": "One third of UK adults will run out of money by the end of January due to higher winter bills and financial strain from Christmas expenses, a survey says. Personal finance company Credit Karma found that 56% of those who will run out of money during the month will have spent their entire monthly income by January 20."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24060294.snow-ice-replaced-wind-rain-country-thaws/",
        "title": "Snow and ice to be replaced by wind and rain as country thaws",
        "description": "Snow and ice is set to be replaced by wind and rain as milder air returns to the UK. An amber warning for snow is still in force for northern parts of Scotland, but Arctic air will start to be displaced, the Met Office said."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24060300.ministry-defence-inventory-failures-led-medicines-expiring-tours/",
        "title": "Ministry of Defence inventory failures ‘led to medicines expiring during tours’",
        "description": "A committee said the situation in the Royal Navy, which in 2022 said it represented a ‘significant risk to life’, has yet to be"
    },
    {
        "url": "https://www.legalfutures.co.uk/latest-news/immigration-solicitors-complaints-about-daily-mail-sting-rejected",
        "title": "Immigration solicitor’s complaints about Daily Mail sting rejected",
        "description": "One of the immigration solicitors caught up in a Daily Mail sting last summer has failed in his complaint about it to the Independent Press Standards Organisation."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/bbc-question-time-rwanda-hashi-mohamed_uk_65a99c21e4b041f1ce655679",
        "title": "&#39;The Rhetoric Is Poison&#39;: Hashi Mohamed Demolishes Rwanda Policy On BBC Question Time",
        "description": "Hashi Mohamed featured on the broadcaster’s flagship <b>politics</b> show, which this week came from Peterborough ... peers not to “frustrate the will of the people” as he said the <b>UK</b> should be “taking control of our borders”. Both phrases are an ..."
    },
    {
        "url": "https://cherwell.org/2024/01/18/oxford-union-believes-the-uk-is-failing-immigrants/",
        "title": "Oxford Union believes the <b>UK</b> is failing immigrants",
        "description": "On Thursday night, the Oxford Union voted in favour of the motion “This House Believes the UK is Failing Immigrants.” The final count had 224 members voting for the motion and 46 members voting against."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/chris-heatonharris-stormont-northern-ireland-government-dup-b2481250.html",
        "title": "NI Secretary to take ‘pragmatic’ approach after latest Stormont deadline passes",
        "description": "Chris Heaton-Harris had been placed under an obligation to call a fresh Assembly election if devolved government had not been restored by January 18."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-promises-save-uks-business-reputation-new-age-insecurity-1722806",
        "title": "Labour Promises To Save The <b>UK</b>&#39;s Business Reputation From &#39;A New Age Of Insecurity&#39;",
        "description": "As the next general election approaches, MP Rachel Reeves will introduce JP Morgan investors to Labour&#39;s plan to regrow the British economy."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/c9020kjy51xo?at_medium=RSS&at_campaign=KARANGA",
        "title": "The revolutionary who ‘sacrificed everything for the workers’",
        "description": "John Maclean is a hero of the socialist movement, but he is not a widely known figure in history. As the author of a Maclean biography once put it, we are now a century on from Maclean’s death and he “is remembered by few people outwith the Scottish Left, and the ceilidh bands that play the John Maclean March”."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/britains-dental-health-crisis-exposed-31916816",
        "title": "Britain&#39;s dental health crisis exposed as hundreds of children in hospital with bad teeth",
        "description": "The latest data shows 40% of kids don&#39;t have regular NHS check-ups and that 104,133 children went to hospital with rotten teeth over the past five years. In 2022 alone there were 116 extractions every"
    },
    {
        "url": "https://www.thesun.co.uk/tvandshowbiz/25414209/green-day-billie-joe-armstrong-saviors/",
        "title": "2024 is going to be a big year for Green Day, says Billie Joe Armstrong as new album Saviors is released",
        "description": "THIS is going to be a big year for Green Day and we feel really good about it,” says frontman Billie Joe Armstrong. “We’ve got new album, a 30-year anniversary for Dookie and a 20-year"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24060277.astronauts-head-space-station-chartered-flight/",
        "title": "Astronauts head to space station on chartered flight",
        "description": "Turkey’s first astronaut, a Swede and an Italian have set off for the International Space Station on a chartered SpaceX flight. The Falcon rocket blasted off from Nasa’s Kennedy Space Centre in late afternoon, carrying the three men, all with military pilot experience and representing their homelands."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12980401/Hapless-Humza-triggers-new-diplomatic-row-Erdogan-Scotland-visit.html",
        "title": "Hapless Humza triggers new diplomatic row",
        "description": "Humza Yousaf has sparked a major diplomatic row after inviting the President of Turkey to visit Scotland during secret talks."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/do-not-frustrate-will-of-people-rwanda-rishi-sunak-lords/",
        "title": "Labour leads Lords threat to delay Rwanda treaty",
        "description": "Rishi Sunak has urged the Lords to ‘get on board and do the right thing’ Credit: Chris J Ratcliffe/Bloomberg Peers led by a former Labour attorney general have drawn up a plan that threatens to delay Rishi Sunak’s flagship Rwanda treaty."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/sunak-urges-lords-to-do-the-right-thing-on-rwanda-plan",
        "title": "PM unable to guarantee Rwanda flights will take off before election",
        "description": "Rishi Sunak has urged the House of Lords to approve his Rwanda deportation plan after it was voted through the House of Commons on Wednesday evening. | ITV National News"
    },
    {
        "url": "https://www.middleeasteye.net/news/uk-hizb-ut-tahir-ban-puts-muslim-political-activism-slippery-slope",
        "title": "Analysis: <b>UK</b> Hizb ut-Tahir ban puts Muslim <b>political</b> activism on a &#39;slippery slope&#39;",
        "description": "Often dividing opinion within the Muslim community, many mosques have already banned the group from organising within its premises"
    },
    {
        "url": "https://uk.news.yahoo.com/british-security-deal-ukraine-expect-210000441.html",
        "title": "On the British &quot;security deal.&quot; What Ukraine can expect",
        "description": "Let&#39;s set the record straight about the British &quot;security agreement,&quot; which is destined to be the first of several."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-northern-ireland-winter-of-discontent-2brsmj5h6",
        "title": "The Times view on Northern Ireland: Winter of Discontent",
        "description": "The growing political and economic crisis in Northern Ireland has been too long ignored by the government in Westminster. Solving it will require greater focus"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857353/Keir-Starmer-Nigel-Farage-Labour",
        "title": "Keir Starmer squirms over tough question about Nigel Farage: &#39;He&#39;s not in my head!&#39;",
        "description": "The Labour leader was quizzed about the threat of Nigel Farage and the immigration issue during a wide-ranging ITV interview this evening."
    },
    {
        "url": "https://thetab.com/uk/exeter/2024/01/18/exeter-university-student-and-just-stop-oil-activist-pleads-not-guilty-to-criminal-damage-59748?itm_source=parsely-api",
        "title": "Exeter University student and Just Stop Oil activist pleads not guilty to criminal damage",
        "description": "A University of Exeter student has pleaded not guilty to criminal damage charges after taking part in a Just Stop Oil protest. Edred Ilmari Heath Whittingham deposited orange powder on a snooker table during a match at the World Snooker Championship in April of last year."
    },
    {
        "url": "https://www.newsletter.co.uk/business/union-leader-says-we-fully-understand-brexit-problems-but-the-tories-have-taken-our-money-and-dup-should-not-take-our-hope-4484347",
        "title": "Union leader says &#39;we fully understand Brexit problems but the Tories have taken our money and DUP should not take our hope&#39;",
        "description": "Workplaces across Northern Ireland were deserted today as strike action paralysed public transport, led to cancelled hospital appointments, and reduced ambulance cover."
    },
    {
        "url": "https://www.thenational.scot/politics/24060229.richard-murphy-rachel-reeves-no-idea-scottish-firms-want/",
        "title": "Richard Murphy: Rachel Reeves has no idea what Scottish firms want",
        "description": "I GROANED when I heard Rachel Reeves say that she had gone to Davos to make clear that Labour were going to make the UK a good place to do"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/biggest-strike-in-nis-recent-history-under-way-as-tens-of-thousands-walk-out-JJVXWKQX4VNS3LQPBMMKMHFH74/",
        "title": "‘My members are angry’- biggest strike in Northern Ireland’s recent history as tens of thousands walk out",
        "description": "The biggest strike in Northern Ireland’s recent history is under way. An estimated 150,000 public sector workers are taking part in the walkouts over pay. Northern Ireland Secretary Chris Heaton-Harris has been urged to intervene to release funding to make delayed pay awards in the absence of devolved government."
    },
    {
        "url": "https://www.derehamtimes.co.uk/news/national/24060095.netanyahu-says-told-us-opposes-palestinian-state-postwar-scenario/",
        "title": "Netanyahu says he has told US he opposes Palestinian state in postwar scenario",
        "description": "Israeli Prime Minister Benjamin Netanyahu has rejected US calls to scale back Israel’s military offensive in the Gaza Strip or take steps towards the establishment of a Palestinian state after the war, drawing an immediate scolding from the White House."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/recep-tayyip-erdogan-humza-yousaf-first-minister-cameron-scotland-b1133275.html",
        "title": "Yousaf defends inviting Turkish leader Erdogan to Scotland",
        "description": "The Humanist Society Scotland hit out at the invitation, with chief executive Fraser Sutherland saying: “This is a very short-sighted invite from the First Minister. Under President Erdogan Turkey has seen a sustained attack on civil liberties and human rights."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/chancellor-jeremy-hunt-budget-cut-taxes-b2481163.html",
        "title": "Jeremy Hunt hints at more tax cuts before general election",
        "description": "Chancellor Jeremy Hunt has signalled he wants to cut taxes in the Budget, as the Tories gear up for an election in the face of dire poll ratings. Tory MPs are clamouring for a move that would win votes as the latest opinion poll by YouGov shows support for the Tories is at its lowest level since Liz Truss’s final days as prime minister."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/parliament-approves-ban-on-hizb-ut-tahrir-as-terror-organisation",
        "title": "Parliament approves ban on Islamist group Hizb ut-Tahrir as terror organisation",
        "description": "Hizb ut-Tahrir has organised rallies which took place on the streets of London alongside pro-Palestinian marches in recent months. | ITV National News"
    },
    {
        "url": "https://news.sky.com/story/150-000-public-sector-workers-walk-out-in-northern-irelands-biggest-strike-in-recent-history-13051183",
        "title": "150,000 public sector workers walk out in Northern Ireland&#39;s biggest strike in recent history",
        "description": "From early morning, striking workers braved sub-zero temperatures to gather at picket lines across Northern Ireland. Pay parity with the rest of the UK is the core issue for workers angry at a widening wage gap and political paralysis."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-hikes-tax-domestic-31910697",
        "title": "Rishi Sunak hikes tax on domestic flights - but not private jets or helicopters",
        "description": "Details buried in the Finance Bill show that the luxury flight-loving Prime Minister will raise Air Passenger Duty (APD) on flights within the UK - except for private jets and helicopters"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/18/public-sector-workers-24-hour-strike-northern-ireland",
        "title": "Thousands of public sector workers stage 24-hour strike in Northern Ireland",
        "description": "Combined action by about 150,000 nurses, teachers, cleaners and other sector workers is biggest in living memory"
    },
    {
        "url": "https://news.sky.com/story/david-cameron-dismisses-nadine-dorries-claims-of-plot-for-him-to-return-as-tory-leader-13051172",
        "title": "David Cameron dismisses Nadine Dorries claims of &#39;plot&#39; for him to return as Tory leader",
        "description": "The foreign secretary says Nadine Dorries is a &quot;much better novelist than a political forecaster&quot; after she claimed there was a plan for him to replace Rishi Sunak if Labour defeat the Tories."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/18/tory-donor-post-office-scandal-government-role-pamdemic/",
        "title": "Tory donor embroiled in Post Office scandal given government role",
        "description": "A Tory donor caught up in the Post Office scandal was given a non-executive government role on the Board of the UK Health Security Agency (UKHSA)."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/northern-ireland-strikes-unions-warn-28469842",
        "title": "Northern Ireland strikes: Unions warn of more action to come as tens of thousands take to the streets",
        "description": "More strike action is on the cards across Northern Ireland unless public sector workers receive their long-awaited pay award. That was the rallying cry on Thursday as tens of thousands of public sector workers took to the streets across Northern Ireland in what was billed as the largest strike here in 50 years."
    },
    {
        "url": "https://www.thenational.scot/politics/24059069.lee-anderson-spare-thought-wee-soul/",
        "title": "Lee Anderson: Spare a thought for the wee soul",
        "description": "The Conservative rebellion against the government&#39;s new Rwanda bill evaporated yesterday, with fewer Tory back benchers voting against the bill"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/thousands-take-to-streets-to-back-mass-public-sector-strike-in-northern-ireland-b1133254.html",
        "title": "Thousands take to streets to back mass public sector strike in Northern Ireland",
        "description": "A rally in Belfast heard calls for NI Secretary Chris Heaton-Harris to give a pay rise to public sector workers and for the DUP to return to Stormont."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24060125.us-strikes-houthi-rebels-will-continue-says-biden/",
        "title": "US strikes against Houthi rebels will continue, says Biden",
        "description": "The comments came on the same day the Houthi rebels’ supreme leader vowed that attacks on ships in the Red Sea and the Gulf of Aden will continue."
    },
    {
        "url": "https://www.lbc.co.uk/news/nearly-6000-migrants-missing-failed-asylum-applications/",
        "title": "Nearly 6,000 migrants missing after asylum applications failed, Home Office admits",
        "description": "Close to 6,000 migrants have disappeared after their asylum applications were withdrawn, the Home Office has said."
    },
    {
        "url": "https://www.modernghana.com/news/1286490/uk-pm-says-controversial-rwanda-plan-is-will-of.html",
        "title": "<b>UK</b> PM says controversial Rwanda plan is &#39;will of the people&#39;",
        "description": "Rishi Sunak on Thursday urged members of the UK&#39;s unelected upper chamber of parliament to pass his contentious plan to send migrants to Rwanda, insisting it was the will of the people ."
    },
    {
        "url": "https://www.theguardian.com/business/2024/jan/18/watches-of-switzerland-shares-dive-by-a-third-after-revenues-warning",
        "title": "Watches of Switzerland shares dive by a third after revenues warning",
        "description": "UK’s biggest Rolex and Omega seller becomes latest luxury retailer to be hit by switch in spending by aspirational shoppers"
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-first-rwanda-flight-may-2862597?ico=above_article_ticker",
        "title": "Rishi Sunak targets May for first Rwanda flight",
        "description": "Government privately presents Lords timeline which would see PM&#39;s &quot;emergency&quot; laws to save the policy enacted by Easter"
    },
    {
        "url": "https://www.heraldscotland.com/news/24059997.uk-covid-inquiry-scottish-government-kept-appearances/?ref=yahoo",
        "title": "<b>UK</b> Covid Inquiry: How Scottish Government kept up appearances",
        "description": "raises questions about the intersection of <b>political</b> messaging and crisis governance. Navigating the complexities of pandemic governance, the Scottish Government also encountered challenges similar to those experienced at the <b>UK</b> level. Changes to how ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/xl-bully-dog-ban-confirmed-31910092.amp",
        "title": "XL Bully dog ban confirmed in Scotland as SNP ministers finally support crackdown",
        "description": "Humza Yousaf’s SNP Government has confirmed plans to copy the ban on XL Bully dogs pushed through in England. The action was taken after the killer dogs were transported to Scotland in the wake of the ban south of the border. However no specific date was ..."
    },
    {
        "url": "https://inews.co.uk/opinion/rwanda-bill-fyre-festival-2861331?ico=related_stories",
        "title": "The Rwanda bill has turned into the <b>political</b> equivalent of Fyre Festival",
        "description": "There was widespread opposition but then the <b>UK</b> Supreme Court ruled the scheme was unlawful ... If something feels like it’s morphing into the <b>political</b> equivalent of the famous Fyre Festival, step away. “Something must be done” shouldn’t mean ..."
    },
    {
        "url": "https://uk.news.yahoo.com/emily-ratajkowski-no-longer-cares-200000000.html",
        "title": "Emily Ratajkowski no longer cares about critics of her skimpy outfits",
        "description": "She added in an interview with Glamour <b>UK</b> magazine: “So, if I am in a certain type of mood ... and has “bigger fish to fry than caring about the <b>politics</b> of whether or not I’m appealing to the male gaze in a given moment”. She said: “I guess ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68025945.amp",
        "title": "Netanyahu publicly rejects US push for Palestinian state",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... Netanyahu has spent much of his <b>political</b> career opposing Palestinian ..."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24060254.hunt-says-low-taxes-direction-travel-ahead-election-year-budget/",
        "title": "Hunt says low taxes are ‘direction of travel’ ahead of election-year Budget",
        "description": "The Chancellor said “the direction of travel” was for the <b>UK</b> to emulate successful low-tax economies. Mr Hunt, who will deliver his Budget on March 6, said low-tax countries were “more dynamic” and “more competitive”. Speaking at the World ..."
    },
    {
        "url": "https://www.thepinknews.com/2024/01/15/rupauls-drag-race-uk-vs-the-world-season-two-spill-the-tea/",
        "title": "RuPaul’s Drag Race <b>UK</b> vs. The World queens on their big comebacks: ‘There was definitely some drama’",
        "description": "“But I think sometimes we forget with saying that drag is <b>political</b> is that drag is also fun and joyful, and it brings happiness to people. That is what I loved about [<b>UK</b> vs. The World] – I know we’re gonna bring smiles to people. “There’s so ..."
    },
    {
        "url": "https://www.ft.com/content/eceb77d7-c12e-4d6b-97ad-693a0a4c1f2f?sharetype=gift",
        "title": "Is the tide finally turning for unloved <b>UK</b> stocks?",
        "description": "To say the UK stock market has fallen out of favour in recent years is something of an understatement. At this point, it is looking rather friendless. But some plucky diehards are asking the question one more time with feeling: is it time to buy UK stocks?"
    }
]