[
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24086176.cultural-venues-england-get-15m-boost-new-round-government-funding/",
        "title": "Cultural venues in England to get £15m boost in new round of Government funding",
        "description": "“I encourage applicants to put forward ambitious proposals which will make a real difference to the lives of even more people across the country, and help to preserve the <b>UK</b>’s position on the world stage as a cultural and creative powerhouse."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/roman-abramovich-government-russian-chelsea-uk-government-b1135933.html",
        "title": "Peers criticise Abramovich’s failure to donate Chelsea sale funds to Ukrainians",
        "description": "It is ‘incomprehensible’ that the Government has not ‘resolved the problems’ around the Russian oligarch’s frozen assets, a watchdog said."
    },
    {
        "url": "https://www.thetimes.co.uk/article/women-bringing-new-light-to-up-helly-aa-6x7s8mrwt",
        "title": "Women bringing new light to Up Helly Aa",
        "description": "Shetland’s Viking fire festival featured women for the first time last year — now they are part of the lead group for the procession"
    },
    {
        "url": "https://www.ft.com/content/0c333065-a2f9-42b6-a9ec-c9faa59fce70?shareType=nongift",
        "title": "Sustainable investment can lift Britain out of its slump",
        "description": "The writer is professor of economics at the London School of Economics and <b>Political</b> Science Britain is stuck in a rut ... It is mainly due to a lack of investment. The <b>UK</b> languishes at the bottom of the G7 league table for investment."
    },
    {
        "url": "https://news.sky.com/story/lord-cameron-faces-backlash-after-he-hints-at-move-to-recognise-palestinian-state-13060326",
        "title": "Lord Cameron faces backlash after he hints at move to recognise Palestinian state",
        "description": "<b>Politics</b> live: Sinn Fein leader predicts Irish unification on ... to pursue one with a group that actively seeks its destruction.&quot; Downing Street insisted the <b>UK</b> had not changed its approach, with the prime minister&#39;s official spokesperson saying: &quot;We ..."
    },
    {
        "url": "https://news.sky.com/story/northern-ireland-power-sharing-deal-could-finally-end-brexits-constitutional-chaos-13060415",
        "title": "Northern Ireland power-sharing deal could finally end Brexit&#39;s constitutional chaos",
        "description": "With the power-sharing government set to be restored in Northern Ireland, an end to constitutional chaos thrown up by Brexit may finally be in sight."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68149437?at_medium=RSS&at_campaign=KARANGA",
        "title": "Newspaper headlines: Robbie Williams&#39;s Port Vale bid and &#39;Rise of the cyborgs&#39;",
        "description": "Take That start Robbie Williams is sizing up a &quot;shock bid&quot; to buy his beloved Port Vale Football Club, according to the Sun. The singer was named the club&#39;s president at the weekend and the tabloid says Williams is eyeing a potential Wrexham-style TV deal too."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24086131.uk-deploy-aircraft-carrier-red-sea-suggests-minister/",
        "title": "<b>UK</b> could deploy aircraft carrier to Red Sea, suggests minister",
        "description": "The UK could send an aircraft carrier to the Red Sea as the threat from Iran-backed Houthi rebels continues, the armed forces minister has indicated. James Heappey suggested that a British aircraft carrier could be sent to the region to replace the USS Dwight D Eisenhower when it is returned to America."
    },
    {
        "url": "https://www.cityam.com/rachel-reeves-and-sadiq-khan-tell-city-a-m-readers-when-you-succeed-we-all-succeed/",
        "title": "Rachel Reeves and Sadiq Khan tell City A.M. readers: ‘When you succeed, we all succeed’",
        "description": "Rachel Reeves and Sadiq Khan tell City A.M. that Labour will put the full weight of government behind the City and financial services"
    },
    {
        "url": "https://tellymix.co.uk/discover/689808-the-best-and-worst-american-remakes-of-british-tv-shows.html",
        "title": "The Best and Worst American Remakes of British TV Shows",
        "description": "When it comes to television, the journey across the Atlantic doesn&#39;t always guarantee smooth sailing. American remakes of British TV shows are a unique"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13025959/Sinn-Fein-Stormont-Northern-Ireland-power-sharing-DUP-ends-boycott.html",
        "title": "Sinn Fein set to get top job at Stormont as Northern Ireland returns to power sharing for the first time in two years after the DUP ends its boycott",
        "description": "NORTHERN Ireland is on the brink of a return to power sharing for the first time in two years after the DUP ended its Stormont boycott"
    },
    {
        "url": "https://www.thesun.co.uk/news/25614402/brit-putin-enemy-vladimir-kara-murza-punishment/",
        "title": "Putin’s Brit enemy Vladimir Kara-Murza is moved to Russian ‘punishment block’ prison ‘for not standing up quick enough’",
        "description": "The <b>UK</b> is &quot;deeply concerned&quot; over the fate of Vladimir Kara-Murza ... when Stalin was carrying out a series of repressive show trials and purges of his <b>political</b> opponents. “For me, as a historian, this is cause for reflection,” he said."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/30/iran-on-high-alert-joe-biden-mulls-response-to-killing-of-us-servicemen?ref=biztoc.com",
        "title": "Iran on high alert as Biden mulls response to killing of US servicemen",
        "description": "As tensions rose, the Iranian foreign ministry summoned the British ambassador, Simon Shercliff, on Tuesday to demand the <b>UK</b> ends its allegations that ... He said the White House knew well that “a <b>political</b> solution” was required to end the carnage ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-13024691/IMF-no-business-poking-nose-Britains-domestic-politics-says-ALEX-BRUMMER.html",
        "title": "IMF has no business poking its nose into Britain&#39;s domestic <b>politics</b>, says ALEX BRUMMER",
        "description": "How the Chancellor chooses to use the headroom, surplus resources in the public finances, is a <b>political</b> choice, not simply an economic decision. The intervention by Gourinchas is a grotesque interference in <b>UK</b> domestic affairs in an election year and ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68143888.amp",
        "title": "US lawmakers inch towards impeachment of Alejandro Mayorkas",
        "description": "Republicans have taken another step towards impeaching Homeland Security Secretary Alejandro Mayorkas for his handling of the US-Mexico border. Opponents of the Biden administration have accused Mr Mayorkas of failing to fulfil his duties, leading to record migrant arrivals."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/conservative-partys-lies-exposed-latest-32006431",
        "title": "&#39;Conservative Party&#39;s lies exposed by latest <b>UK</b> economic forecast&#39;",
        "description": "And the <b>UK</b>’s growth this year is likely to remain sluggish. The IMF says it will be the second-slowest of the G7 major economies. The IMF also recognised a truth deliberately hidden by ministers when it said preserving public services and investment ..."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24086063.rock-band-critical-putin-detained-thailand/",
        "title": "Rock band critical of Putin detained in Thailand",
        "description": "“Personally, I would be very happy to see this.” The <b>UK</b> has accused Mr Lugovoi of involvement in the death of former Russian spy Alexander Litvinenko, who died in London in 2006 after being poisoned with tea laced with radioactive polonium-210."
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-india-partnership-could-help-global-conflicts-handling-1723038",
        "title": "<b>UK</b>-India Partnership Could Help in Global Conflicts Handling",
        "description": "The Indian High Commission to the <b>UK</b> and Lord Jitesh Gadhia hosted the <b>UK</b>-India Parliamentary Lunch which had major representatives from the business, finance and <b>political</b> worlds of the two countries, especially Britain. The event was meant to celebrate ..."
    },
    {
        "url": "https://www.itv.com/news/2024-01-30/uk-needs-tax-rises-not-cuts-as-imf-brands-hunts-spending-plans-unrealistic",
        "title": "<b>UK</b> needs tax rises not cuts, says IMF as it brands chancellor&#39;s future spending plans unrealistic",
        "description": "The International Monetary Fund has downgraded its forecast for economic growth in the UK next year and cautions the government against tax cuts. | ITV National News"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1861444/gb-news-guest-children-climate-change",
        "title": "GB News guest branded &#39;miserable old g**&#39; after telling Brits to stop having kids",
        "description": "In his interview this morning, Mr McCarthy said each child born in an industrial nation like the <b>UK</b> goes on to create roughly 500 tonnes ... Four is outstanding. &quot;<b>Politics</b> of abundance yo. Loads of babies, loads of energy, loads of houses, loads of good ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/actor-says-there-nowhere-safe-jewish-after-october-7-restaurant-opens-jordan-1723033",
        "title": "Actor Says There Is &#39;Nowhere Safe To Be Jewish&#39; After October 7 Restaurant Opens In Jordan",
        "description": "A Jordanian restaurant was forced to change its name after it was accused of commemorating Hamas&#39; massacre and capture of Israeli civilians on October 7."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861439/Britain-civil-defence-force-warning-resilient",
        "title": "A civil defence force would make Britain &#39;most resilient nation on Earth&#39;, minister says",
        "description": "He said “regular armies start wars, citizen armies win them”, adding that the people of the <b>UK</b> are part of a “pre-war generation”. Ms Mordaunt, the Leader of the House of Commons and a Royal Navy Reservist, said: “We need to be a resilient nation ..."
    },
    {
        "url": "https://www.thenational.scot/news/24086045.msps-back-motion-saying-scotlands-future-best-served-eu/",
        "title": "MSPs back motion saying Scotland&#39;s future is &#39;best served in EU&#39;",
        "description": "MSPS have backed a motion saying Scotland&#39;s future is “best served” by being part of the EU. External Affairs Secretary Angus Robertson led a Scottish Parliament debate today, in which MSPs backed a motion that affirmed that &quot;Scotland’s economic,"
    },
    {
        "url": "https://www.itv.com/news/2024-01-30/it-would-be-a-shame-could-1p-and-2p-coins-be-on-their-way-out",
        "title": "&#39;It would be a shame&#39;: Could 1p and 2p coins be on their way out?",
        "description": "<b>UK</b> coins are not going anywhere anytime soon ... Have you heard our new podcast Talking <b>Politics</b>? Every week Tom, Robert and Anushka dig into the biggest issues dominating the <b>political</b> agenda…"
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-plotters-rishi-sunak-betrayed-brexit-northern-ireland-deal-2881299",
        "title": "Tory plotters ‘poised to claim Sunak has betrayed Brexit’ with NI deal, sources say",
        "description": "The Democratic Unionist Party (DUP) in the early hours of Tuesday morning dramatically revealed it had agreed a deal with the Government to end its boycott of Stormont institutions over the so-called Irish Sea trade border created by Brexit. The details are not due to be revealed until Wednesday."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68148519",
        "title": "Plans for more Senedd politicians move step closer",
        "description": "Plans for 36 more Senedd politicians cleared their first hurdle on Tuesday night. Senedd members voted to back in princip"
    },
    {
        "url": "https://www.chronicle.gi/donaldson-hails-uk-eu-agreement-on-changes-to-post-brexit-ni-trade-rules/",
        "title": "Donaldson hails <b>UK</b>-EU agreement on changes to post-Brexit NI trade rules",
        "description": "By Dominic McGrath and Patrick Daly, PA Political Staff The UK and EU have agreed a significant change affecting the movement of some goods between Great Britain and Northern Ireland – as politicians in Northern Ireland gear up for a return to"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/mps-uae-bid-telegraph-sale-press-freedom/",
        "title": "What every MP said about the UAE Telegraph takeover bid",
        "description": "He argued: “We need a presumption against sovereign foreign states acquiring strategic <b>UK</b> media assets to further their influence ... landscape” but suggested “legal principles, not <b>politics</b>” should determine if the bid goes ahead."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24085991.caroline-lucas-create-firewall-politicians-fossil-fuel-industry/",
        "title": "Caroline Lucas: Create ‘firewall’ between politicians and fossil fuel industry",
        "description": "She said: “These companies should have no place in our <b>politics</b>, it is undemocratic and it is deeply dangerous for climate action given their priority is putting forward policies that are actively and significantly undermining the <b>UK</b>’s climate ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-france-pledge-closer-cooperation-173400476.html",
        "title": "<b>UK</b> and France pledge &#39;closer cooperation&#39; on tackling illegal migration",
        "description": "<b>Politics</b> live: Sinn Fein leader predicts Irish unification on historic day for Stormont Speaking after the meeting, Mr Cleverly said the cooperation between the <b>UK</b>&#39;s &quot;friends, neighbours and partners&quot; in France was &quot;vital for both countries and Europe&quot; and ..."
    },
    {
        "url": "https://uk.news.yahoo.com/msps-back-motion-saying-scotlands-210352462.html",
        "title": "MSPs back motion saying Scotland&#39;s future is &#39;best served by being part of the EU&#39;",
        "description": "“Today’s debate is an opportunity for this Parliament to affirm that Scotland’s economic, social and <b>political</b> future is best served by being part of the EU. “According to National Institute of Economic and Social Research, the <b>UK</b> economy is 2.5% ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "<b>Politics</b> latest news: Reform <b>UK</b> backing among 2019 Tory voters reaches record high",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://www.politico.eu/article/britains-potty-mouthed-parliament/",
        "title": "‘Shitshow!’ Britain’s potty-mouthed parliament",
        "description": "Britain’s straight-laced opposition leader Keir Starmer — the favorite to become prime minister later this year — added his own expletive to the record last week when he used his appearance at prime minister’s questions to repeat an anonymous briefing to a newspaper which had described the government’s childcare policy as a “shitshow.”"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/leaked-audio-reveals-moment-donaldson-complains-about-dup-meeting-details-getting-out-to-media/a12684304.html",
        "title": "Leaked audio reveals moment Donaldson complains about DUP meeting details ‘getting out’ to media",
        "description": "as a <b>political</b> party at this time… I appreciate so many of you (inaudible).” Sir Jeffrey gathered members of his party on Monday evening to vote on the deal struck by the DUP and the <b>UK</b> Government on changes to previous EU withdrawal agreements."
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/01/30/england-in-a-room-and-england-as-britain/",
        "title": "England in a room – and England as Britain",
        "description": "<b>political</b> and cultural collective amnesia. It is about a certain way of looking at the world and the <b>UK</b>, of seeing the latter from the vantage point of the towers and corridors of Westminster, Whitehall and Millbank, and extrapolating it out into a notion ..."
    },
    {
        "url": "https://www.southwalesguardian.co.uk/news/24086059.principality-stadium-guide-capacity-roof-details/",
        "title": "Principality Stadium guide: capacity, roof details and more",
        "description": "In short, yes, Principality Stadium does have a roof, and yes, it does open. In fact, it was the first stadium in the <b>UK</b> to have a fully-retractable roof. How long does it take to close the roof? The roof takes 20 minutes to fully open, according to the ..."
    },
    {
        "url": "https://www.kentonline.co.uk/dover/news/unsupervised-brexit-border-regime-could-cause-biosecurity-300992/",
        "title": "New Brexit border risks loom as ‘unsupervised’ system involving Dover and Ashford could pose ‘serious biosecurity risks’, MPs warn",
        "description": "But fears have been expressed about disruption to supply chains, with MPs saying the new border regime could present risks to the <b>UK</b>. On the eve of the arrangements, the Environment, Food and Rural Affairs Committee wrote to Secretary of State Steve ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7153842",
        "title": "Northern Ireland latest: Sinn Fein leader predicts Irish unification on historic day for Stormont",
        "description": "The <b>UK</b> government believes &quot;all conditions are in place&quot; for Northern ... says the future of Ireland is a &quot;very exciting conversation&quot;. She tells our <b>Politics</b> Hub presenter Sophy Ridge: &quot;I think the days of partition are numbered. It doesn&#39;t work."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/caroline-lucas-create-firewall-between-politicians-and-fossil-fuel-industry-98863/",
        "title": "Caroline Lucas: Create ‘firewall’ between politicians and fossil fuel industry",
        "description": "She said: “These companies should have no place in our <b>politics</b>, it is undemocratic and it is deeply dangerous for climate action given their priority is putting forward policies that are actively and significantly undermining the <b>UK</b>’s climate ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/david-cameron-did-not-clear-palestinian-statehood-speech-with-no10-2881367?ico=related_article_inline",
        "title": "David Cameron did not clear Palestinian statehood speech with No10",
        "description": "The Palestinian ambassador to the <b>UK</b> described the intervention as “the best shot in ... “We must give the people of the West Bank and Gaza the <b>political</b> perspective of a credible route to a Palestinian state and a new future. And it needs to be ..."
    },
    {
        "url": "https://www.theguardian.com/global-development/2024/jan/30/somalia-to-launch-its-first-current-affairs-tv-show-led-by-women",
        "title": "Somalia to launch its first current affairs TV show led by women",
        "description": "such as a critical shortage of female teachers and the challenges faced by women trying to get into <b>politics</b>, as well as environmental issues. Launching on International Women’s Day, 8 March, the monthly programme will be similar in format to the <b>UK</b>’s ..."
    }
]