[
    {
        "url": "https://uk.sports.yahoo.com/news/bafta-film-awards-ceremony-highlights-212252691.html",
        "title": "BAFTA Film Awards: Ceremony Highlights &amp; Lowlights",
        "description": "After a few years in limbo, the BAFTAs finally found a host to replace the much-missed Stephen Fry in David Tennant. The Doctor Who actor proved an amiable and funny emcee, although much of his humor would have gone way over the non-Brits in the audience,"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/i-call-keir-1001-election-32155887",
        "title": "&#39;I will call Keir at 10.01 on election night to make sure the North gets what it deserves&#39;",
        "description": "He says: “I like him. A couple of years ago he said he wouldn’t have a frontline job in <b>politics</b> again, other than the Metro Mayor of the Liverpool City Region. I sent him a text and I said, ‘Hezza, keep your hands off my job’. “He sent me the ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/sunak-warned-against-playing-footsie-with-farage-and-reform-uk-E6GBKBZVBVM5LJUV3WM336JIII/",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform <b>UK</b>",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform <b>UK</b> following two bruising by-election defeats ... Party it won’t stand a prayer of winning the next election.” <b>POLITICS</b> ByElections (PA Graphics/Press Association Images) Earlier ..."
    },
    {
        "url": "https://uk.news.yahoo.com/history-crisis-detectives-using-maths-202734529.html",
        "title": "History’s crisis detectives: how we’re using maths and data to reveal why societies collapse – and clues about the future",
        "description": "Historian and complexity scientist, Dan Hoyer, examines why past societies collapsed when faced with crisis, while others founds ways to survive and flourish."
    },
    {
        "url": "https://news.sky.com/video/ministers-encourage-police-to-make-robust-use-of-powers-to-protect-politicians-13075290",
        "title": "Ministers encourage police to make &quot;robust use&quot; of powers to protect politicians",
        "description": "The government say they felt compelled to act after pro-Palestinian activists protested outside the Dorset home of the Conservative MP Tobias Ellwood earlier in the week."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/more-people-in-ni-would-vote-to-stay-part-of-uk-if-border-poll-was-called/a1750577562.html",
        "title": "More people in NI would vote to stay part of <b>UK</b> if border poll was called",
        "description": "More people would vote for Northern Ireland to remain part of the UK if a border poll was held now, according to a new poll."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-given-stark-warning-32155433",
        "title": "Prince Harry given stark warning over any future reunion plans with the Royal Family",
        "description": "Prince Harry has voiced his hopes that he can reconcile with his family and support them, yet an expert has urged the Duke of Sussex &#39;actions speak louder than words&#39;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13098085/JK-Rowling-donates-Scottish-feminist-campaigners-help-Supreme-Court-appeal-against-definition-woman.html",
        "title": "JK Rowling donates £70,000 to Scottish feminist campaigners to help their Supreme Court appeal against the definition of &#39;woman&#39;",
        "description": "Harry Potter author JK Rowling has donated £70,000 to a feminist campaign to help their Supreme Court appeal against the definition of a woman."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/tories-think-theyve-spotted-a-labour-weakness-and-are-scouring-for-opportunities/",
        "title": "Tories think they&#39;ve spotted a Labour weakness - and are scouring for opportunities",
        "description": "The Conservative campaign is seeking Labour candidates&#39; comments about Israel and Gaza following the suspension of two MP-hopefuls last week after their comments about the Middle East."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868055/Pollster-john-curtice-Labour-government",
        "title": "Pollster John Curtice predicts &#39;trouble&#39; for Labour within months of getting keys to No10",
        "description": "Reform <b>UK</b> secured an unexpectedly high number of votes ... Mr Tice said the result in Kingswood shows it is now a “significant force in British <b>politics</b>”. The Conservative Party has now lost more by-elections during a single parliament than any ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/drivers-pay-extra-charge-park-28657636",
        "title": "Drivers will have to pay extra charge to park at work under strict new rules",
        "description": "Drivers will soon have to pay charges to park their car at work under radical new changes in Glasgow in Scotland - in a major blow for workers across the city."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24127471.yousaf-urged-house-asylum-seekers-home-office/",
        "title": "Yousaf urged to house more asylum seekers by Home Office",
        "description": "Mr Cleverly said “greater parity” needed to be achieved across the <b>UK</b> regions to provide “fair and equitable” asylum accommodation, and asked to revisit options in Scotland, “such as our plans last summer to use MS Victoria in Edinburgh ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/18/tory-mps-pushing-for-rishi-sunak-to-quit-before-he-is-deposed?ref=mc.news",
        "title": "Rebel Tory MPs pushing for Rishi Sunak to quit before he is deposed",
        "description": "Some said to be lobbying for PM to resign to avoid spectacle of coup, while others are waiting for outcome of May local elections"
    },
    {
        "url": "https://news.sky.com/story/the-week-britain-hits-back-over-navalny-13075041",
        "title": "The week... Britain hits back over Navalny",
        "description": "Two of Westminster&#39;s best-connected journalists, Sky News&#39;s Sam Coates and Politico&#39;s Jack Blanchard, guide us through their predictions of how British <b>politics</b> will play out ... What can the <b>UK</b> actually do? And how is Donald Trump changing the war?"
    },
    {
        "url": "https://inews.co.uk/news/politics/cameron-call-out-putin-ally-g20-navalny-new-sanctions-2912632",
        "title": "Cameron to call out Putin ally at G20 over Navalny’s death",
        "description": "Lord Cameron is expected to call out Vladimir Putin ally Sergei Lavrov over the death of Alexei Navalny at this week’s G20 foreign ministers meeting even if they do not meet face-to-face."
    },
    {
        "url": "https://eveshamobserver.co.uk/news/sadly-a-great-deal-of-uncertainty-and-conflict-exists-around-the-world-nigel-huddleston-mps-westminster-diary/",
        "title": "&#39;Sadly, a great deal of uncertainty and conflict exists around the world&#39; - Nigel Huddleston MP&#39;s Westminster Diary",
        "description": "Balancing my ministerial duties with those as the MP for Mid Worcestershire, I have enjoyed many engagements in the constituency over the last few weeks."
    },
    {
        "url": "https://www.thetimes.co.uk/article/why-i-dont-buy-sarwars-conversion-to-tax-cutting-g6zqsnchk",
        "title": "Why I don’t buy Sarwar’s conversion to tax cutting",
        "description": "Voters don’t follow the ins and outs of fiscal policy, let alone the shifts and turns of election promises, though. And why should they? Much of it is hogwash and spin. People have enough on their minds managing their ever-shrinking family budgets."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68330465",
        "title": "Post Office scandal: Kemi Badenoch hits back at Henry Staunton",
        "description": "The government says it &quot;utterly refutes&quot; claims by the Post Office&#39;s former chairman that he was ordered to delay compensation payments to victims in the Horizon scandal. Henry Staunton told the Sunday Times he was given instructions to &quot;stall&quot; payments ahead of the election."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/rochdale-family-denies-son-dating-future-queen-belgium-20302294/?ico=trending-post-strip_item_2",
        "title": "Rochdale family forced to deny their son is dating the future queen of Belgium",
        "description": "She and Nicholas both study history – but Elisabeth also studies <b>politics</b>. Other royals have met their spouses ... Get in touch with our news team by emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check our news page."
    },
    {
        "url": "https://www.scotsman.com/news/politics/labour-eyes-uk-eu-security-pact-amid-fresh-concerns-over-trump-return-4523173",
        "title": "Labour eyes <b>UK</b>-EU security ‘pact’ amid fresh concerns over Trump return",
        "description": "Starmer sets out ‘unshakeable commitment’ to Nato amid concerns over impact of ex-president’s return to White House"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097719/Alexei-Navalny-Britain-America-ambassadors-Moscow-tribute-putin-critic.html",
        "title": "Alexei Navalny: Britain and America&#39;s ambassadors to Moscow lay flowers for &#39;murdered&#39; Putin critic and &#39;other victims of <b>political</b> repression in Russia&#39; after jailed Russian ...",
        "description": "Alexei Navalny, 47, fell unconscious and died on Friday after a walk at the remote Arctic penal colony where he was serving a three-decade sentence, the prison service said."
    },
    {
        "url": "https://uk.news.yahoo.com/where-do-uk-political-parties-stand-gaza-ceasefire-171714480.html",
        "title": "Where do the <b>UK</b>&#39;s <b>political</b> parties stand on a Gaza ceasefire?",
        "description": "With Labour changing its stance and backing an immediate ceasefire, here&#39;s where the main UK parties stand on the Gaza conflict."
    },
    {
        "url": "https://www.modernghana.com/news/1293459/land-isnt-ours-how-britain-transformed-colonial.html",
        "title": "Land Isn’t Ours: How Britain Transformed Colonial Territories into Financial Enclaves?",
        "description": "A few years ago, during a visit to the city of Jos in northeast Nigeria, someone pointed out a vast, well-maintained area behind a fence: ldquo;This ranch belongs to the Queen of England rdquo; This statement was surprising,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/toby-jones-post-office-horizon-delay-b2498226.html",
        "title": "Call Toby Jones – Post Office drama could be due a sequel",
        "description": "Just as ministers thought the public outcry over the treatment of hundreds subpostmasters was beginning to die down, allegations of a new scandal threaten to engulf the government. Kate Devlin explain"
    },
    {
        "url": "https://www.scotsman.com/news/politics/sunak-defended-after-by-election-defeats-set-against-difficult-backdrop-4523157",
        "title": "Sunak defended after by-election defeats set against ‘difficult backdrop’",
        "description": "A Conservative minister has defended Rishi Sunak and the party after two by-election defeats, saying they were set against a “very difficult backdrop”. The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened Reform UK party, were the latest blow to the Prime Minister."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/defence-row-dup-mp-says-leo-varadkars-comments-lack-credibility-after-taoiseach-asks-when-the-uk-helped-ireland-4523156",
        "title": "Defence row: DUP MP says Leo Varadkar&#39;s comments lack credibility after Taoiseach asks when the <b>UK</b> helped Ireland",
        "description": "“I’m not aware of any particular <b>UK</b> intervention that’s helped us in that regard ... It is foolish not to recognise that the defence of his own nation is under active <b>political</b> consideration in his country by realists who recognise the changing ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/kemi-badenoch-post-office-government-jonathan-reynolds-house-of-commons-b1139888.html",
        "title": "Kemi Badenoch hits out at former Post Office chairman in Horizon row",
        "description": "“This is not about playing party <b>politics</b> – it is about holding the Government to account,” he said on social media. The Post Office and the <b>UK</b> Government Investments (UKGI) body also rejected any suggestion that either organisation had opposed a ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/letters/rishi-sunak-may-election-tax-immigration-b2498219.html",
        "title": "There’s a much bigger vote winner than tax or immigration",
        "description": "That the PM should now be hoping to win the election by pressing the two oldest hot buttons of right-wing demagoguery – tax cuts and immigration – is truly astonishing Your editorial is right that British elections are nearly always won in the centre ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/labour-seeking-snp-deal-to-avoid-new-gaza-ceasefire-rebellion?ref=todayheadlines.live",
        "title": "Labour seeking SNP deal to avoid new Gaza ceasefire rebellion",
        "description": "“If we can send a unified message from the <b>UK</b> parliament then we should take that opportunity and I hope people will engage in good faith in trying to find that unified position. “In the end, that is more important than two <b>political</b> parties having a ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-best-result-rishi-sunak-election-2909342?ico=more_from_this_author",
        "title": "Reform’s best-ever election result is not Sunak’s biggest concern",
        "description": "Richard Tice, the leader of the right-wing party, said it demonstrated that Reform <b>UK</b> is now a “significant force now in British <b>politics</b> and that people have got to take us seriously”. It will compound Tory jitters that Rishi Sunak’s disunited party ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/18/tory-mps-pushing-for-rishi-sunak-to-quit-before-he-is-deposed",
        "title": "Tory MPs pushing for Rishi Sunak to quit before he is deposed",
        "description": "Backbench MPs said to be lobbying for PM to stand down after local elections in May to avoid spectacle of coup"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68331988.amp",
        "title": "Gaza doctors: ‘We leave patients to scream for hours and hours’",
        "description": "An injured man lies on a bed in the Gaza European hospital in late December Doctors across Gaza have described operating on patients without anaesthetic, turning people with chronic conditions away, and treating rotting wounds with limited medical supplies."
    },
    {
        "url": "https://www.express.co.uk/news/world/1867186/putin-russia-nuclear-weapons-space-white-house",
        "title": "Putin red-faced as &#39;plot&#39; to launch nuclear weapon into space doomed - Pentagon insider",
        "description": "All Russia&#39;s military resources are being used in its invasion of Ukraine so it would be impossible for the country to deploy powerful weapons elsewhere, let alone up in space, an ex-Government official said."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24121409.music-romsey-abbey-launches-2024-concert-series/",
        "title": "Music in Romsey Abbey launches 2024 concert series",
        "description": "MUSIC in Romsey Abbey has launched its series of concert events for 2024. The launch, on Saturday, February 10, was attended by guests from across the Test Valley, including the Mayor and Mayoress of Test Valley, Cllr Philip Lashbrook and Cllr Linda Lashbrook, and the Mayor of Romsey, Cllr John Ray."
    },
    {
        "url": "https://www.ft.com/content/4ae05ba9-34bd-4a53-bf6d-8b8b660b64c1?sharetype=gift",
        "title": "Russian victories shake global leaders’ faith in Ukraine war prospects",
        "description": "Statespeople, diplomats, military brass and spies at a defence conference this weekend fear war is tilting in Moscow’s favour"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-special-relationship-starmer-trump-2912536?ico=most_popular",
        "title": "Labour moves to protect ‘special relationship’ after Starmer swipe at Trump",
        "description": "Labour has pledged to work with “whomever is in the White House ” following the next US presidential election after Sir Keir Starmer took a veiled swipe at Donald Trump."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/rochdale-family-denies-son-dating-future-queen-belgium-20302294/",
        "title": "Rochdale family forced to deny their son is dating the future queen of Belgium",
        "description": "A family from the outskirts of Manchester have shut down rumours that their son was dating the future Queen of Belgium."
    },
    {
        "url": "https://www.telegraph.co.uk/obituaries/2024/02/18/robin-herbert-royal-horticultural-society-finance-llanover/",
        "title": "Robin Herbert, banker and landowner who transformed the Royal Horticultural Society as president – obituary",
        "description": "Robin Herbert shows Queen Elizabeth II around the Chelsea Flower Show in 1985 Credit: Alamy He was educated at Eton, did National Service as a 2nd lieutenant in his father’s regiment, the Royal Horse Guards, read philosophy, <b>politics</b> and economics at Chr ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/politics/farmers-welsh-government-currently-loggerheads-28646668",
        "title": "Why farmers and the Welsh Government are currently at loggerheads",
        "description": "There have been go-slow tractor protests, angry meetings with the potential for more to come - but what is the reason for all this fury"
    },
    {
        "url": "https://news.stv.tv/politics/tories-could-still-win-next-uk-election-starmer-warns-in-glasgow-speech",
        "title": "Tories could still win next election, Starmer warns in Glasgow speech",
        "description": "Keir Starmer has warned the Tories could still win the next UK general election – despite the party consistently polling around 20 points ahead of their rivals. Speaking to Scottish Labour members on the last day of the party’s conference in Glasgow, the Labour leader took aim at the SNP for claiming Labour is almost certain to win the next ballot."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/alexei-navalny-body-missing-death-russia-putin-prison-b2498156.html",
        "title": "Alexei Navalny death latest: Putin critic’s ‘bruised body seen in morgue’ as family demands it is returned",
        "description": "Vladamir Putin believes that he is “untouchable” after years of an iron grip on Russia, the wife of jailed opposition figure Vladimir Kara-Murza has said, as she accused the autocrat of murdering Alexei Navalny."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-68332593",
        "title": "Alexei Navalny: US and <b>UK</b> ambassadors to Russia lay tributes",
        "description": "The US and UK ambassadors to Moscow have laid flowers to honour Alexei Navalny, the Russian opposition leader who died in prison on Friday. US ambassador Lynne Tracy and Britain&#39;s Nigel Casey were pictured paying their respects at a memorial in Moscow."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24127254.labour-cant-stop-fighting-second-ahead-general-election---starmer/",
        "title": "Labour ‘can’t stop fighting for a second’ ahead of general election – Starmer",
        "description": "The Labour leader warned his party that the ‘volatile’ nature of politics means the Tories could still win another term in power."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/massey-4-mayor-salfords-mr-28615212",
        "title": "&#39;Massey 4 Mayor&#39;: When Salford&#39;s &#39;Mr Big&#39; Paul Massey traded criminal underworld for <b>politics</b>",
        "description": "Paul Massey, a man suspected of operating at the highest echelons of gangland Salford, launched a bid to take charge of the entire city"
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/18/we-must-help-gp-trainees-from-overseas-stay-in-the-nhs",
        "title": "We must help GP trainees from overseas stay in the NHS",
        "description": "Letter: Prof Kamila Hawthorne of the Royal College of General Practitioners says GPs should not have to face nonsensical visa rules, given the chronic shortage of doctors in the UK"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24127311.no-wonder-criminalising-pet-thefts-attractive-scots-politicians/?ref=rss",
        "title": "No wonder criminalising pet thefts is attractive to Scots politicians",
        "description": "The <b>UK</b> Government has recently smiled on similar pet abduction ... Such is the lot of a powerless opposition or a powerless parliament – but it isn’t good for our <b>politics</b>, which, in the end, ought to be about ideas for how the country is governed ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/18/history-draft-dodgers-britain-consider-conscription-20280487/?ico=trending-module_author_katie-boyden_item-0",
        "title": "The history of ‘draft dodgers’ in war as Britain could consider conscription again",
        "description": "‘The fact that conscription has even been raised reflects the increasingly aggressive militarism of <b>UK politics</b>, with military spending on the rise, escalating tension with Russia and the recent attacks on Yemen.’ The group added that the issue also ..."
    }
]