[
    {
        "url": "https://www.mirror.co.uk/news/royals/nine-words-king-charles-moving-32096843",
        "title": "Nine words in King Charles&#39; moving cancer statement that will worry royal family fans",
        "description": "King Charles has tonight thanked the public following support received after his cancer diagnosis, which has helped promote public understanding of various cancers"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-13067585/KEN-MURPHY-Youth-employment-needs-political-priority.html",
        "title": "KEN MURPHY: Youth employment needs to be a <b>political</b> priority",
        "description": "Their education has been disrupted, good quality jobs are at a premium, and many risk being left behind. Now look at school leavers in some of the <b>UK</b>’s most deprived areas and the barriers intensify. What are we left with? More young people looking for ..."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24111857.dogs-costumes-parade-rio-de-janeiro-pet-lovers-kick-off-carnival/",
        "title": "Dogs in costumes parade in Rio de Janeiro as pet lovers kick off Carnival",
        "description": "As Rio de Janeiro’s Carnival celebrations kicked off on Saturday, dozens of dogs dressed as mermaids, superheroes, butterflies and clowns paraded alongside their owners in one of the city’s most beloved canine street parties."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13069545/charity-report-countryside-racism-Britain.html",
        "title": "Why a charity&#39;s ludicrous report that claimed the countryside is blighted by racism speaks volumes about who REALLY governs Britain, writes ROSS CLARK",
        "description": "Below our increasingly irrelevant elected government lies an infrastructure of quangos, charities and other institutions which push a Left-wing agenda."
    },
    {
        "url": "https://www.thesun.co.uk/news/25856920/king-charles-cancer-royal-future-prince-harry/",
        "title": "King Charles’ cancer is a sign of fragile royal future… with no Prince Harry in it",
        "description": "IT boggles the mind to reflect that if William became King tomorrow, then Harry would be fourth in line to the throne. And the only royals ahead of Harry in the queue for the crown would be"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-13069217/CITY-WHISPERS-Jacob-Rees-Mogg-hits-Davos-man-including-pal-Lord-Dominic-Johnson.html",
        "title": "CITY WHISPERS: Jacob Rees-Mogg hits out at Davos man... including his pal Lord Dominic Johnson",
        "description": "Among the attendees was Somerset MP and ex-Brexit Opportunities Minister Jacob Rees-Mogg, who proudly proclaimed in a speech that &#39;the age of Davos man is over&#39;. He was referring to the gathering of the financial and political elite at the World Economic Forum, held in the Swiss ski destination last month."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/gary-lineker-says-ive-been-28609829",
        "title": "Gary Lineker says &#39;I&#39;ve been silenced&#39; as he pulls out of Match of the Day hosting duties",
        "description": "Gary Lineker has said he will be absent from Match Of The Day this evening (Saturday 10 February) because of illness &quot;silencing&quot; him. The presenter and former England player was briefly absent from the BBC One football highlights show last year amid criticism of his social media remarks. This led to the BBC updating its guidelines for employees."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markles-thoughtful-penmanship-revealed-32097156",
        "title": "Meghan Markle&#39;s thoughtful penmanship revealed in sweet thank you note written to artist",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. Fans of the artist were quick to comment on the post, as one wrote: &quot;Just found you and your work. Truly love your art.&quot; Another commented: &quot;OH MT GOD SO AMAZING!!!!"
    },
    {
        "url": "https://www.thesun.co.uk/news/25856006/war-sanctions-uk-economy-struggles-putins-russia-growing/",
        "title": "Two years of war and sanctions but as the <b>UK</b> economy struggles, tyrant VLadimir Putin’s Russia is GROWING",
        "description": "WHO would have thought when Vladimir Putin’s invasion of Ukraine went off the rails two years ago that Russia’s economy would today be growing faster than any in Europe? Germany has gone from the"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/10/army-challenge-overseas-recruits-security-checks/",
        "title": "Army to relax security checks for recruits in diversity drive",
        "description": "Leaked document describes vetting as ‘primary barrier to non-UK personnel’ being enlisted into the officer corps"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/no-doubt-banning-machetes-zombie-28602860",
        "title": "&#39;No doubt&#39; banning of machetes and zombie knives would save lives, says anti-knife crime charity",
        "description": "Patrick Green, chief executive of The Ben Kinsella Trust, said there had been a lack of urgency and &quot;political will&quot; from the Government to introduce the tougher measures"
    },
    {
        "url": "https://www.lbc.co.uk/news/gove-young-voters-democracy-housing/",
        "title": "Gove warns young will abandon democracy if they cannot afford houses in new bid to win over &#39;Nimbys&#39;",
        "description": "Michael Gove has warned that young people shut out of the UK&#39;s housing market could turn away from democracy, in a new intervention."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/gove-young-people-shut-out-of-housing-market-could-turn-to-authoritarianism-110267/",
        "title": "Gove: Young people shut out of housing market could turn to authoritarianism",
        "description": "Michael Gove has warned that young people shut out of the <b>UK</b>’s housing market could turn to authoritarianism ... or actually no particular <b>political</b> agenda at all, feel that they’re being shut out.” He continued: “If people think that markets ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/10/tories-conservative-byelection-defeats-sunak-leadership-death-spiral",
        "title": "We’ve given up the fight, say top Tories as byelection defeats loom",
        "description": "Chris Bryant, the Labour frontbencher who is the “<b>political</b> lead” in Kingswood, said: “Everybody is assuming that, just because we have won a few byelections recently, that we are going to win here. A lot of people are undecided. We have to fight for ..."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/10/theyre-drowning-us-in-regulations-how-europes-furious-farmers-took-on-brussels-and-won?ref=biztoc.com",
        "title": "‘They’re drowning us in regulations’: how Europe’s furious farmers took on Brussels and won",
        "description": "Brexit border checks and badly planned farm subsidies could plunge the <b>UK</b> into a food crisis If Europe’s farmers ... suddenly, to the top of the <b>political</b> agenda. “Everywhere in Europe, the same questions are coming up,” said France’s prime ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hb68c0",
        "title": "Who will govern Pakistan?",
        "description": "With most of the results now declared in Pakistan&#39;s general election, no political force has a clear majority, as two former PMs are claiming they have the votes to govern. Kate Adie presents stories from Pakistan, Syria, Gaza, Trinidad and Tobago and Ivory Coast."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "The Telegraph’s poll tracker shows that Labour continues to have a dominating lead over the Tories, who were last ahead in late 2021. On Thursday, the Conservative Party will face by-elections in both Kingswood and Wellingborough, which had both been Tory seats."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/the-king-ayesha-hazarika-labour-plaid-cymru-douglas-ross-b1138306.html",
        "title": "Conservative donors and 27-year-old among new peers",
        "description": "Thirteen new life peers have been announced by the Government. Downing Street published the list of political peerages on Friday as MPs were on holiday. The Tories’ eight nominations include Paul Goodman, a former Conservative MP and editor of the influential ConservativeHome website."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/uk-today/24111054.see-13-new-lifetime-peers-announced-government/",
        "title": "See the 13 new lifetime peers announced by the government",
        "description": "From Conservative donors to the youngest member of the House of Lords, here are the 13 political peerages announced by the UK Government this week."
    },
    {
        "url": "https://inews.co.uk/news/politics/all-labour-policies-election-manifesto-green-2899366?ico=above_article_ticker",
        "title": "All of Labour’s policies so far, and whether they’ll make it into the manifesto",
        "description": "With an election on the horizon Sir Keir Starmer&#39;s party has already made dozens of pledges. Here is everything you need to know"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24111825.gary-lineker-skipping-match-day-rotten-cold-silenced/",
        "title": "Gary Lineker on skipping Match Of The Day: ‘Rotten cold’ has silenced me",
        "description": "One requirement means they are not allowed to make attacks on <b>political</b> parties or criticise the character of individual politicians in the <b>UK</b>. Last month, Lineker reportedly misread a tweet by the Palestinian Campaign For The Academic And Cultural Boycott ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=in-line_link",
        "title": "‘Shit <b>politics</b>’ – Starmer allies urge him to get party ready for government",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being ..."
    },
    {
        "url": "https://www.newsandstar.co.uk/news/24110088.political-figures-react-alarming-report-gp-services-cumbria/",
        "title": "<b>Political</b> figures react to &#39;alarming&#39; report on GP services in Cumbria",
        "description": "Political figures have been reacting to a report published by the Lancashire and Cumbria Consortium of Local Medical Committees which said that"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/gary-lineker-england-israel-lord-twitter-b2494171.html",
        "title": "Gary Lineker on skipping Match Of The Day: ‘Rotten cold’ has silenced me",
        "description": "One requirement means they are not allowed to make attacks on <b>political</b> parties or criticise the character of individual politicians in the <b>UK</b>. Last month, Lineker reportedly misread a tweet by the Palestinian Campaign For The Academic And Cultural Boycott ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=more_from_this_author",
        "title": "‘Shit <b>politics</b>’ – Starmer allies urge him to get party ready for government",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being ..."
    }
]