[
    {
        "url": "https://www.dailymail.co.uk/news/article-12878997/Republicans-leading-impeachment-Joe-Biden-question-brother-James-Americore-trustee-sued-allegedly-never-repaying-600K-loans.html",
        "title": "Republicans leading impeachment into Joe Biden question his brother James&#39; Americore trustee - who sued him for allegedly never repaying over $600K in loans",
        "description": "Fox has sued James Biden claiming James made &#39;representations that his last name, &#39;Biden,&#39; could &#39;open doors&#39; and that he could obtain a large investment from the Middle East based on his <b>political</b> connections.&#39; Fox alleged James Biden helped procure &#39;an ..."
    },
    {
        "url": "https://www.london.edu/news/geoeconomic-fragmentation-and-a-disordered-world-2326",
        "title": "Geoeconomic fragmentation and a disordered world",
        "description": "“However, with more than half the world’s population going to the polls in India, <b>UK</b>, Taiwan and the US ... in many instances yet to settle on the terms of their economic and <b>political</b> engagement, Dr Yueh said that the potential for growing economic ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-67750367?at_medium=RSS&at_campaign=KARANGA",
        "title": "How will Scotland plug its £1.5bn budget shortfall?",
        "description": "Finance secretary Shona Robison must explain how she will fill an estimated £1.5bn hole in Scotland&#39;s books when she delivers her £60bn budget later. Options on the table include tax rises for higher earners, spending cuts for government departments, and public sector job losses."
    },
    {
        "url": "https://www.thesun.co.uk/topic/global-politics/page/118/",
        "title": "Global <b>politics</b>",
        "description": "The Minsk agreement was introduced to calm fighting between Russia &amp; Ukraine ©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. &quot;The Sun&quot;, &quot;Sun&quot;, &quot;Sun Online&quot; are registered trademarks or trade ..."
    },
    {
        "url": "https://www.theguardian.com/media/live/2023/dec/19/bruce-lehrmann-defamation-trial-updates-day-19-fiona-brown-evidence-brittany-higgins-lisa-wilkinson-the-project-ntwnfb?page=with:block-6580d3fd8f08a684d3bd9d10",
        "title": "Bruce Lehrmann defamation trial: former chief of staff Fiona Brown continues giving evidence",
        "description": "Lehrmann has sued Lisa Wilkinson and Network Ten for defamation in the federal court of Australia over Brittany Higgins interview on The Project"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/eu-tentacles-mean-that-new-bill-to-end-disgraceful-trade-in-animals-kept-in-terrible-conditions-will-not-apply-in-northern-ireland-sammy-wilson-4450592",
        "title": "&#39;EU tentacles&#39; mean that new bill to end &#39;disgraceful trade in animals kept in terrible conditions&#39; will not apply in Northern Ireland: Sammy Wilson",
        "description": "Live animals could still be sent abroad for slaughter from Northern Ireland despite plans to ban the practice in the rest of the UK, ministers have been warned."
    },
    {
        "url": "https://news.sky.com/story/taxpayer-facing-up-to-2m-redundancies-bill-after-greensill-collapse-13033664",
        "title": "Taxpayer facing up to £2m redundancies bill after Greensill collapse",
        "description": "The controversial finance empire collapsed in 2021 and became the centre of a lobbying scandal after Lord Cameron was found to have contacted members of the government on behalf of founder Lex Greensill."
    },
    {
        "url": "https://inews.co.uk/news/world/tory-mps-dismayed-at-uk-abstaining-on-un-call-for-gaza-ceasefire-2815238?ITO=msn",
        "title": "Immediate ceasefire needed in Gaza, Tory MPs tell Sunak and Cameron",
        "description": "In a letter to Foreign Secretary Lord Cameron, ten Tory MPs called for an immediate ceasefire to forge a &#39;new political reality&#39;"
    },
    {
        "url": "https://www.derrynow.com/news/northern-ireland/1375359/livestock-suffering-will-continue-in-n-ireland-after-gb-export-ban-mp-claims.html",
        "title": "Livestock suffering will continue in N Ireland after GB export ban, MP claims",
        "description": "Live animals could still be sent abroad for slaughter from Northern Ireland despite plans to ban the practice in the rest of the UK, ministers have been warned. DUP MP Sammy Wilson blamed the “tentacles of the European Union” for preventing the Animal Welfare (Livestock Exports) Bill"
    },
    {
        "url": "https://www.bristolpost.co.uk/news/uk-world-news/general-election-will-held-2024-8984314",
        "title": "General Election &#39;will be held in 2024&#39;, Prime Minister confirms",
        "description": "The next UK General Election will be held in 2024, the Prime Minister has confirmed tonight (Monday). There had been reports the polls could be held in January 2025 under the Fixed Term Parliament Act."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/leisure/national/23998652.tolkien-estate-wins-copyright-lawsuit-fellowship-king-author/",
        "title": "Tolkien estate wins copyright lawsuit against The Fellowship Of The King author",
        "description": "It comes after Demetrious Polychron filed a lawsuit against the Tolkien estate and Amazon in April 2023 which was dismissed."
    },
    {
        "url": "https://news.sky.com/story/senior-tories-pile-pressure-on-rishi-sunak-to-back-immediate-gaza-ceasefire-13033693",
        "title": "Senior Tories pile pressure on Rishi Sunak to back immediate Gaza ceasefire",
        "description": "told Sky News&#39;s <b>Politics</b> Hub with Sophy Ridge that on top of the 10 MPs who had written to Lord Cameron, there were &quot;many more behind the scenes&quot; who wanted the <b>UK</b> to push for that outcome. The letter followed an article from former defence secretary Ben ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1846961/new-school-rules-parents-teachers-gender-identity-issues",
        "title": "New school rules empower parents and protect teachers on gender identity issues",
        "description": "Recent school guidelines introduce parental involvement in children&#39;s gender identity choices and offer teachers protection from repercussions."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/exclusive-chris-packham-brands-cop28-wasted-opportunity-365206/",
        "title": "Exclusive: Chris Packham brands Cop28 ‘wasted opportunity’",
        "description": "Chris Packham has branded Cop28 a &#39;wasted opportunity&#39; for world leaders to make progress on solutions to the climate crisis."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/chris-packham-slams-right-wing-media-over-climate-crisis-coverage-365227/",
        "title": "Chris Packham slams ‘right-wing’ media over climate crisis coverage",
        "description": "Chris Packham has slammed &#39;right-wing&#39; media outlets for obscuring facts about the climate crisis in an interview with The London Economic."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/18/dup-rules-out-imminent-deal-to-restore-northern-ireland-power-sharing",
        "title": "DUP rules out imminent deal to restore Northern Ireland power sharing",
        "description": "Spokesperson says party is ‘condition-led, not calendar-led’ after speculation about a deal before Christmas"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/stormont-talks-conglomerate-of-business-lobbyists-calls-for-more-money-for-northern-ireland-and-difficult-decisions-on-how-it-is-spent-4450563",
        "title": "Stormont talks: Conglomerate of business lobbyists calls for more money for Northern Ireland and &#39;difficult decisions&#39; on how it is spent",
        "description": "A conglomerate of Northern Irish business groups has called for what amounts to a funding boost from the London treasury into the Province’s public coffers, coupled with “difficult decisions” on how it is spent."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1846992/miriam-margolyes-bbc-bosses-monstrous",
        "title": "Miriam Margolyes fumes her bosses at BBC are &#39;monstrous for expecting people to shut up&#39;",
        "description": "Miriam Margolyes hit out that her employers at the BBC are &quot;monstrous&quot; for expecting its stars to &quot;shut up&quot; after Gary Lineker was once again accused of breaking the broadcaster&#39;s impartiality rules."
    },
    {
        "url": "https://www.politics.co.uk/news/2023/12/18/rishi-sunak-confirms-election-will-be-next-year-despite-legal-right-to-wait-until-january-2025/",
        "title": "Rishi Sunak confirms election will be next year, despite legal right to wait until January 2025",
        "description": "Rishi Sunak has confirmed this evening that a general election will be held next year in 2024, despite speculation that the prime minister could hold off until January 2025.  Under the Dissolution and Calling of Parliament Act 2022,"
    },
    {
        "url": "https://www.echo-news.co.uk/news/23998325.southend-schoolboy-elected-sir-david-amess-childrens-parliament-pm/",
        "title": "Southend schoolboy elected Sir David Amess Children’s Parliament PM",
        "description": "A LEIGH schoolboy has become the second student from Southend to represent the country’s children at the Sir David Amess Children’s"
    },
    {
        "url": "https://metro.co.uk/2023/12/18/steven-seagal-george-galloway-visit-zoo-pose-a-giant-snake-19993881/?ico=mosaic_entertainment",
        "title": "Steven Seagal and George Galloway go to zoo together for some reason and pose with a massive snake",
        "description": "American actor and producer Seagal, 71, and <b>UK</b> politician Galloway ... Galloway is known for his work in <b>politics</b>, having stood in elections in each of the last five decades. His last bid was in 2021, when he failed to get elected to the Scottish Parliament."
    },
    {
        "url": "https://www.mirror.co.uk/news/health/drones-deliver-nhs-medication-care-31702957",
        "title": "Drones to deliver NHS medication to care homes and GP surgeries in major roll-out",
        "description": "If approved there will be up to 80 drone flights a day going to hospitals and elsewhere in North East England to send frequently-used supplies, from medicines to joint replacement implants"
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-deportation-flights-by-spring-an-heroic-assumption-lords-told-2815160?ico=more_from_this_author",
        "title": "Rwanda deportation flights by spring an ‘heroic assumption’, Lords told",
        "description": "Britain’s former independent reviewer of terrorism legislation suggested there is not enough time to meet Sunak&#39;s target"
    },
    {
        "url": "https://www.edp24.co.uk/news/national/23998582.northern-ireland-business-leaders-urge-deal-fully-funded-stormont/",
        "title": "Northern Ireland business leaders urge a deal for a ‘fully funded’ Stormont",
        "description": "A host of Northern Ireland business leaders have written to political parties urging them to press forward to agree a resumption of a fully funded devolved government. The Northern Ireland Business Alliance described the coming days as “crucial” after multi-party talks around Stormont finances resumed at Hillsborough Castle."
    },
    {
        "url": "https://www.heraldscotland.com/news/23998309.uk-politics-2023-vintage-year-lying-politicians/",
        "title": "<b>UK Politics</b> 2023: A vintage year for lying politicians",
        "description": "Maybe it’s because journalists are trusted so little that politicians feel comfortable lying to us. It’s been a big year for lies. A"
    },
    {
        "url": "https://www.ft.com/content/deb4d0e7-e439-46bd-9cae-9f9da7a4b607/",
        "title": "US set to strengthen international force to protect Red Sea shipping",
        "description": "The <b>UK</b>’s benchmark gas price jumped by more than 8 per cent ... the longer and costlier route around the Cape of Good Hope,” he said. “The heightened <b>political</b> risks will add to underlying uncertainty about the outlook for oil supply and demand ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-67753877",
        "title": "Texas to arrest illegal migrants in challenge to federal govt",
        "description": "Border and immigration issues have become a <b>political</b> headache for President Biden. During the 2022 fiscal year that ended in September, a total of 2.4m migrant &quot;encounters&quot; were registered at the border, a record high. Republicans lawmakers have sought to ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/chris-heatonharris-northern-ireland-stormont-government-dup-b1127789.html",
        "title": "Northern Ireland business leaders urge a deal for a ‘fully funded’ Stormont",
        "description": "They have written to the Secretary of State Chris Heaton-Harris and party leaders urging them to ‘maintain momentum’ in talks."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/breaking-youtube-mum-ruby-franke-31702720.amp",
        "title": "YouTube mum Ruby Franke ADMITS child abuse after boy found with legs tied with duct tape",
        "description": "Ruby Frank, who used to give parenting advice via a once-popular YouTube channel called &#39;8 Passengers&quot;&#39;, pleaded guilty to four felony counts of second-degree aggravated child abuse"
    },
    {
        "url": "https://www.gazette-news.co.uk/news/national/23998553.el-sissi-wins-egypts-presidential-election-secure-third-term-office/",
        "title": "El-Sissi wins Egypt’s presidential election to secure third term in office",
        "description": "Egyptian President Abdel Fattah el-Sissi, who has ruled with an unquestioned grip for the past nine years, won re-election to a third, six-year term in office, election authorities said on Monday. He ran against three virtually unknown opponents."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/china-annemarie-trevelyan-tim-loughton-mps-british-b1127749.html",
        "title": "MPs criticise Jimmy Lai ‘pantomime trial’ as China branded ‘totalitarian’",
        "description": "The UK Government has condemned the ‘politically motivated’ prosecution of British citizen Mr Lai, 76, under a national security law imposed by China."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-increases-pressure-on-israel-over-civilian-death-toll-in-gaza-2814980?ico=more_from_this_author",
        "title": "<b>UK</b> increases pressure on Israel over civilian death toll in Gaza",
        "description": "Rishi Sunak increased the pressure on Israel over the civilian death toll in Gaza by reiterating calls for a “sustainable ceasefire” that were ramped up by Lord Cameron at the weekend."
    },
    {
        "url": "https://metro.co.uk/2023/12/18/steven-seagal-george-galloway-visit-zoo-pose-a-giant-snake-19993881/",
        "title": "Steven Seagal and George Galloway go to zoo together for some reason and pose with a massive snake",
        "description": "American actor and producer Seagal, 71, and UK politician Galloway, 69, got truly hands-on with animals including a giant python, crocodiles, a bear, and lions as they visited Fame Park private zoo in Dubai."
    },
    {
        "url": "https://news.stv.tv/scotland/life-of-alistair-darling-to-be-celebrated-at-memorial-service-in-edinburghs-st-marys-episcopal-cathedral",
        "title": "Life of Alistair Darling to be celebrated at memorial service in Edinburgh",
        "description": "Alistair Darling died on November 30, aged 70, following a stay in hospital where he was being treated for cancer."
    },
    {
        "url": "https://www.thesun.co.uk/royals/25096104/princess-charlotte-pippa-middleton-gift-nappies-silver-rattle/",
        "title": "Princess Charlotte’s £44k gift – and it put the £4.70 nappies aunt Pippa Middleton got her to shame",
        "description": "EVERY little girl should feel like a princess but it is harder to spoil kids who are real-life royalty. Whilst you might expect Princess Charlotte to have received some lavish presents, the little"
    },
    {
        "url": "https://www.heraldscotland.com/news/12052529.outlook-remains-equitable-despite-political-squalls/",
        "title": "Outlook remains equitable despite <b>political</b> squalls",
        "description": "JUST over a week ago there was talk in some quarters of the end of the bull market in both the UK and US. This followed the steep fall in"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/michelle-mone-ppe-contracts-scandal-tory-b2465811.html",
        "title": "Michelle Mone hits back at Rishi Sunak: Ministers knew all along about my involvement with PPE firm",
        "description": "Baroness Mone claims key departments knew about her links to PPE Medpro ‘from the beginning’ after the PM said he was taking allegations against her ‘very seriously’"
    },
    {
        "url": "https://www.grampianonline.co.uk/news/national/sunak-raises-concerns-about-gaza-death-toll-as-senior-tories-push-for-ceasefire-95790/",
        "title": "Sunak raises concerns about Gaza death toll as senior Tories push for ceasefire",
        "description": "Rishi Sunak faced calls from senior Tories to back an immediate ceasefire in the Israel-Hamas war as he acknowledged too many innocent lives had already been lost. A group of Conservative MPs, including three former Cabinet ministers, have written to Foreign Secretary Lord Cameron saying the case for an immediate ceasefire is “unanswerable”."
    },
    {
        "url": "https://www.gov.uk/government/news/hong-kong-national-security-law-arrest-warrants-foreign-secretarys-statement",
        "title": "Hong Kong National Security Law arrest warrants: Foreign Secretary’s statement",
        "description": "harass or harm individuals or communities in the <b>UK</b>. This is a threat to our democracy and fundamental human rights. We call on Beijing to repeal the National Security Law and end its persecution of <b>political</b> activists."
    }
]