[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h14v3c",
        "title": "Chris Mason on 2024: The year of the election campaign",
        "description": "In this episode of the 5 Minutes On podcast, the BBC&#39;s Political Editor Chris Mason considers what is at stake for all the political parties in 2024, the year of the election campaign."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24012120.diana-showed-ignorance-disregard-for-ni-constitutional-state/",
        "title": "Diana showed ‘ignorance of, or disregard for’ NI constitutional state",
        "description": "A briefing note from the Irish ambassador stated that the late princess had referred to Northern Ireland as part of Ireland."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24012118.climate-change-caused-chaos-uk-nature-2023/",
        "title": "Climate change has caused ‘chaos’ for <b>UK</b> nature in 2023",
        "description": "Climate change is causing “chaos” for UK nature because of rising average temperatures, changing seasons and increasingly unpredictable weather, the National Trust has said in its annual review."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24012121.clinton-adams-circular-decommissioning-row-white-house/",
        "title": "Clinton and Adams had ‘circular’ decommissioning row in White House",
        "description": "Despite the encounter being painted as a positive for Sinn Fein at the time, a disagreement ensued about disabling arsenal in Northern Ireland."
    },
    {
        "url": "https://www.thetimes.co.uk/article/donald-trump-will-change-british-politics-in-2024-88dg8xppq",
        "title": "Donald Trump will change British <b>politics</b> in 2024",
        "description": "Rarely do Britons and Americans go to the polls at the same time, and the likely confluence next year will be dramatic"
    },
    {
        "url": "https://www.derrynow.com/news/northern-ireland/1380833/climate-change-has-caused-chaos-for-uk-nature-in-2023.html",
        "title": "Climate change has caused ‘chaos’ for <b>UK</b> nature in 2023",
        "description": "Climate change is causing “chaos” for UK nature because of rising average temperatures, changing seasons and increasingly unpredictable weather, the National Trust has said in its annual review. It is almost certain that 2023 will be the hottest year on record and probably in the last"
    },
    {
        "url": "https://www.standard.co.uk/homesandproperty/luxury/prime-london-suburban-property-house-price-falls-b1128606.html",
        "title": "Prime London property: house prices in most expensive areas close to bottoming out",
        "description": "House prices in London’s most expensive areas could be close to rock bottom and set to rise again after a turbulent year."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12902601/Star-new-Agatha-Christie-adaptation-Murder-Easy-David-Jonsson-reveals-initially-turned-role-not-fan-colour-blind-casting.html",
        "title": "Star of new Agatha Christie adaptation Murder Is Easy David Jonsson reveals he initially turned down the role because he is not a fan of &#39;colour-blind&#39; casting",
        "description": "In the radical reworking of Christie&#39;s book, Luke Fitzwilliam has been changed from a retired white colonial police officer to a black Nigerian, newly arrived in the UK."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/how-to-watch-murder-is-easy-online-from-anywhere",
        "title": "How to watch Murder is Easy online from anywhere",
        "description": "How to watch Murder is Easy. Murder is Easy premieres on BBC One at 9pm GMT on Wednesday, December 27. The second part will air at the same time the following day. Both episodes w"
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/27/diana-apparently-believed-northern-ireland-part-of-the-republic-archive-shows",
        "title": "Diana apparently believed Northern Ireland part of the republic, archive shows",
        "description": "Briefing papers newly released by Ireland’s national archive talk of princess’s ‘obvious ignorance’ of constitutional position"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/dec/27/david-trimble-was-extraordinarily-rude-to-tony-blair-at-good-friday-talks",
        "title": "David Trimble was ‘extraordinarily rude’ to Tony Blair at Good Friday talks",
        "description": "Newly released 1999 briefing by Irish civil servant reveals lack of trust during tense peace negotiations"
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2023/12/27/princess-diana-ignorant-northern-ireland-claims-ambassador/",
        "title": "Princess Diana was ‘ignorant’ about Northern Ireland, said former Irish ambassador",
        "description": "The Irish ambassador described Diana, Princess of Wales, as ignorant after she apparently confused Ulster with the Republic, according to a newly released document."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-67766972.amp",
        "title": "FBI investigate threats against Colorado judges who ruled against Donald Trump",
        "description": "Police in Colorado are investigating threats made against judges who ruled Donald Trump cannot be listed on the state&#39;s presidential primary ballot. Denver Police said they was providing extra patrols around the homes of justices in the city. The Denver FBI office said it was assisting local police."
    },
    {
        "url": "https://metro.co.uk/2023/12/26/maddest-tv-moments-2023-ranked-20027577/?ico=metro-posts_oscars_whats-trending-now",
        "title": "The maddest TV moments of 2023 ranked",
        "description": "Non-attendee Paul made his feelings known as he started tormenting the partygoers and branding them ‘d***heads.’ Trish wasn’t having any of it and shouted ‘bully’ back at Paul. The pair exchanged harsh words, but would made the whole argument slightly bizarre was how Trish continued to do the limbo."
    },
    {
        "url": "https://www.thesun.co.uk/news/25168391/brits-pubs-bars-fancy-dress-boxing-day/",
        "title": "Brits hit pubs and bars across the <b>UK</b> in fancy dress for boozy Boxing Day night out",
        "description": "BRITS have hit pubs and bars across the country in fancy dress for a boozy Boxing Day night out. The masses braved the cold in Wigan for their annual dress-up party, and showed up in all sorts of"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-12901679/UKs-woeful-lack-vision-Politicians-learn-stick-long-term-goals-says-ALEX-BRUMMER.html",
        "title": "<b>UK</b>&#39;s woeful lack of vision: Politicians must learn to stick to long-term goals, says ALEX BRUMMER",
        "description": "Contemporary <b>political</b> leaders fail us with a lack of resolve essential to guiding imaginary projects through to completion. There is much hand-wringing about low productivity and growth in the <b>UK</b>. How much better the output potential of Britain would have ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/diana-charles-irish-president-wedding-b2469695.html",
        "title": "How Irish president refused invite to Charles and Diana’s wedding",
        "description": "Briefing note reveals how Irish government planned to break news that Patrick Hillery would not attend wedding between to royals"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24012067.man-arrested-drink-driving-five-badly-hurt-christmas-day-crash/",
        "title": "Man arrested over drink driving after five badly hurt in Christmas Day crash",
        "description": "A man has been arrested for drink driving after four teenagers and a woman were seriously injured in a car crash on Christmas Day. Three boys aged 13, 15 and 17, a 17-year-old girl and a woman in her 30s all suffered multiple serious injuries from the collision near Blackpool on Monday, Lancashire Police said."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12901751/The-world-awash-cash-invest-make-Britain-better-says-departing-L-G-boss-Nigel-Wilson.html?mrn_rm=rta",
        "title": "&#39;The world is awash with cash - we can invest it to make Britain better&#39;, says departing L&amp;G boss Nigel Wilson",
        "description": "In his 11 years running investment giant Legal &amp; General, Nigel Wilson (pictured) has used his £1.2trillion balance sheet to reshape our cities."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1849315/irish-diplomats-royal-wedding",
        "title": "Irish President Patrick Hillery turned down Princess Diana wedding invite due to tensions",
        "description": "Irish President Patrick Hillery decided he and his wife could not attend the ceremony at St Paul&#39;s Cathedral on July 29, 1981, amid Anglo-Irish tensions."
    },
    {
        "url": "https://www.express.co.uk/news/world/1849307/ukraine-strikes-Novocherkassk-landing-ship",
        "title": "Ukraine strikes key Russian warship in Crimea, &#39;killing dozens&#39;, Kyiv announces",
        "description": "Footage filmed by residents showed a huge explosion and inferno on the Novocherkassk landing vessel, part of Russia&#39;s Black Sea Fleet."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12901341/putin-britain-storm-shadow-sinking-ship-feodosia-crimea.html",
        "title": "Putin&#39;s mouthpiece blames BRITAIN for being behind Kremlin&#39;s Boxing Day humiliation after Russian warship was obliterated by Ukraine strike: &#39;It was not Ukraine, but Britain ...",
        "description": "Pro-Putin political analyst Sergey Markov implied a British-supplied missile attack was responsible for the sinking of an assault ship in Crimea overnight."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-live-news-today-b2469443.html",
        "title": "Ukraine-Russia war – live: Kyiv blows up major warship in Crimea as Putin deploys nuclear weapons to Belarus",
        "description": "Russian president Vladimir Putin is being briefed on a Ukrainian air strike that damaged a warship in occupied Crimea"
    },
    {
        "url": "https://uk.news.yahoo.com/david-trimble-extraordinarily-rude-accused-000100032.html",
        "title": "David Trimble ‘extraordinarily rude’ as he accused Tony Blair of ‘crude trick’",
        "description": "David Trimble was said to have been “extraordinarily rude” during a meeting with Tony Blair and Bertie Ahern in June 1999. The then UK prime minister and the then taoiseach held meetings in Castle Buildings on June 25 1999 with all the Northern Ireland parties, outlining actions to be taken as part of the peace process."
    },
    {
        "url": "https://www.thetimes.co.uk/radio/show/20231226-24787/2023-12-26",
        "title": "2023 Retold: The school concrete crisis",
        "description": "Listen to Times Radio live for the latest breaking news, expert analysis and well-informed discussion covering the biggest stories of the day."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/26/trail-hunts-mod-land-shapps-rejects-ban-call/",
        "title": "Christmas trail hunts go ahead on MoD land after Shapps rebuffs ban demand from campaigners",
        "description": "Defence Secretary tells League Against Cruel Sports that he will maintain decision to deny activists access to monitor hunts"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/woman-abused-after-being-spiked-31751101",
        "title": "Woman &#39;abused after being spiked&#39; says James Cleverly should be sacked",
        "description": "Gina Miller, who heads the True and Fair Party, described Rohypnol spiking as &quot;one of the worst crimes you can possibly imagine&quot;. She said it was &quot;beyond appalling&quot; that the Home Secretary had been he"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/woman-abused-after-being-spiked-31751101.amp",
        "title": "EXCLUSIVE: Woman &#39;abused after being spiked&#39; says James Cleverly should be sacked",
        "description": "A <b>political</b> campaigner who says she was &quot;often drugged&quot; and abused ... I don&#39;t see how any woman in the <b>UK</b> can have confidence in him as a Home Secretary representing them and looking after their safety.&quot; She earlier posted on Twitter: &quot;Some topics are ..."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/24011953.waterfront-norwich-announces-electronic-music-gig-series/",
        "title": "The Waterfront Norwich announces electronic music gig series",
        "description": "Norwich holds a reputation as one of the UK&#39;s top locations for live music and a gig series at a city venue will build on this."
    }
]