[
    {
        "url": "https://www.techrepublic.com/article/google-cloud-ciso-nick-godfrey-interview/",
        "title": "Google Cloud’s Nick Godfrey Talks Security, Budget and AI for CISOs",
        "description": "Google Cloud’s Director of Office of the CISO Nick Godfrey reminds business leaders to integrate security into conversations around financial and business targets."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24115289.understand-voters-frustrations-sunak-says-live-tv-grilling/",
        "title": "I understand voters’ frustrations, Sunak says in live TV grilling",
        "description": "As peers in the House of Lords debated draft legislation aimed at sending asylum seekers to Kigali, one voter asked Mr Sunak why he was “so adamant” about the Rwanda policy “when public documentation shows it isn’t working and that it’s not going to work”."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-plays-up-nfl-32110759",
        "title": "Prince Harry plays up NFL connection in his and Meghan Markle&#39;s new Sussex.com site",
        "description": "Harry and Meghan&#39;s new website has quite a number of changes. For instance, the site used to be titled SussexRoyal.com. The Duke and Duchess of Sussex likely dropped &quot;royal&quot; from their URL after agreeing to no longer use the word. The agreement came after they resigned from their position in the Royal Family in 2020."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-labour-party-withdraws-support-210401159.html",
        "title": "<b>UK</b> Labour Party withdraws support for candidate after Israel conspiracy comments",
        "description": "Britain&#39;s opposition Labour Party has withdrawn support for its candidate to become a member of parliament in a special election after he was recorded espousing conspiracy theories about Israel. Labour announced it had withdrawn support for Azhar Ali,"
    },
    {
        "url": "https://www.ft.com/content/0e365a05-e87e-4cd1-a2b9-09e843e9403a",
        "title": "From banned general to dancing grandpa: how Prabowo became favourite to lead Indonesia",
        "description": "Support from popular president Joko Widodo has lifted the 72-year-old once barred from the US over human rights concerns"
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24115200.boy-critically-injured-texas-megachurch-shooting-son-suspect-police-say/",
        "title": "Boy critically injured in Texas megachurch shooting is ‘son of suspect’, police say",
        "description": "The boy is understood to have entered the megachurch with the attacker before they opened fire with an AR-style rifle."
    },
    {
        "url": "https://www.lep.co.uk/news/politics/azhar-ali-labours-former-rochdale-by-election-candidate-criticised-by-preston-jewish-faith-leader-over-israel-attack-comments-4515431",
        "title": "Azhar Ali: Labour&#39;s former Rochdale by-election candidate criticised by Preston Jewish faith leader over Israel attack comments",
        "description": "A Jewish community leader in Preston says comments made by a senior Lancashire county councillor alleging Israel deliberately allowed the 7th October terrorist attack have given fuel to “demons” on social media spreading other unsubstantiated claims about the state."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/streets-rochdale-labour-problem-28617781",
        "title": "On the streets of Rochdale Labour have a problem",
        "description": "The town has been caught up in controversy after Labour&#39;s former candidate who wants to be the next MP made &#39;deeply offensive&#39; comments about Israel - but there are other things occupying voters&#39; mind"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/government-and-stormont-set-to-clash-over-revenue-raising-after-michelle-oneill-rules-out-water-charges/a478250877.html",
        "title": "Government and Stormont set to clash over revenue raising",
        "description": "The Government and new Stormont Executive are already on a collision course after the First Minister Michelle O’Neill categorically ruled out introducing water charges during her time in office."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68274777.amp",
        "title": "<b>UK</b> sanctions four Israeli settlers accused of violence",
        "description": "The UK has imposed sanctions against four &quot;extremist&quot; Israeli settlers it has accused of attacking Palestinians in the occupied West Bank. The Foreign Office announced financial and travel restrictions against the four who it says have committed human rights abuses against Palestinians."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/suella-braverman-stop-white-guilty-countryside-racism/",
        "title": "Suella Braverman: Stop making people feel guilty for being white",
        "description": "Former home secretary says report suggesting countryside is racist is &#39;wholly disempowering for ethnic minorities&#39;"
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/13/australia-politics-live-indigenous-closing-the-gap-sorry-linda-burney-question-time-anthony-albanese-peter-dutton-amy-macmahon?filterKeyEvents=false&page=with:block-65ca79448f085f0b174e5701",
        "title": "Australia <b>politics</b> live: $707m boost for Indigenous work programs; Greens MP in car crash",
        "description": "Follow live"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/matt-hancock-defends-use-of-taxpayer-funded-jaguar-for-covid-inquiry-appearances/",
        "title": "Matt Hancock defends use of taxpayer-funded Jaguar for COVID inquiry appearances",
        "description": "Matt Hancock has defended using a taxpayer-funded Jaguar to take him to the COVID Inquiry - despite resigning from government more than two years ago."
    },
    {
        "url": "https://www.politicshome.com/news/article/government-taking-unreasonable-risk-sending-people-rwanda-without-safety-advice-says-bishop",
        "title": "Government Could Need UN Nod On Rwanda Flights In New Lords Proposal",
        "description": "The House of Lords is exploring whether Government could need to seek UN advice on whether Rwanda is a safe country in order to deport asylum"
    },
    {
        "url": "https://www.mirror.co.uk/news/health/victorian-disease-warning-symptoms-rare-32109825",
        "title": "Victorian disease warning: Symptoms of rare infections that are surging in <b>UK</b>",
        "description": "Diseases like these were thought to have been consigned to history, with sound science, good public health policy and access to clean water and good food seeing cases dwindle"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gb-news-today-updates-b2494979.html?page=7",
        "title": "Rishi Sunak GB News – live: Rwanda scheme is ‘right thing to do’ insists Prime Minister in live TV grilling",
        "description": "Rishi Sunak has insisted his Rwanda scheme is “the right thing to do” in a live TV grilling by the UK public. The Prime Minister faced questions from undecided and swing voters in County Durham on GB News on Monday evening, including over his flagship deportation policy."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1865953/downing-street-fury-civil-servant-auction-margaret-thatcher-book",
        "title": "Downing Street fury as ex-civil servant auctions off Margaret Thatcher&#39;s visitors’ book",
        "description": "The former government employee claims he rescued the historic item 20 years ago after it was &#39;nearly destroyed&#39;."
    },
    {
        "url": "https://www.itv.com/news/2024-02-12/inside-the-scamming-networks-kidnapping-and-enslaving-victims-in-east-asia",
        "title": "Inside the scamming networks kidnapping and enslaving victims in east Asia",
        "description": "Forced scamming is one of the most complex and fastest-growing forms of modern slavery in the world, writes ITV News Correspondent Lucy Watson. | ITV National News"
    },
    {
        "url": "https://bylinetimes.com/2024/02/12/conservative-donor-who-won-164m-ppe-contracts-admits-deleting-emails/",
        "title": "Conservative Donor Who Won £164m PPE Contracts Admits Deleting Emails",
        "description": "A Government trade advisor and Conservative donor, who won Covid contracts worth £164 million after being referred to the ‘VIP Lane’ by his long-term political ally Michael Gove has admitted deleting emails from the account through which he conducted the deals, a court has been told."
    },
    {
        "url": "https://news.sky.com/story/rochdale-by-election-formal-complaint-filed-against-labour-candidate-after-antisemitic-remarks-13070291",
        "title": "Rochdale by-election: Formal complaint filed against Labour candidate after &#39;antisemitic&#39; remarks",
        "description": "Campaign group Labour Against Antisemitism is demanding that Councillor Azhar Ali be suspended as a party member after he suggested Israel let the 7 October Hamas attack go ahead so it could invade Gaza."
    },
    {
        "url": "https://www.heraldscotland.com/news/24115207.scottish-government-evading-scrutiny-freedom-information/",
        "title": "The Scottish Government, &#39;evading scrutiny&#39; and Freedom of Information",
        "description": "The Scottish Government has found itself tied in knots once again over transparency – but should we be surprised at politicians not being as"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-68278630.amp",
        "title": "Polish state TV host decries past anti-LGBT output",
        "description": "A journalist for the Polish state broadcaster has apologised for his channel&#39;s &quot;shameful&quot; role in spreading anti-LGBT sentiment. Host Wojciech Szelag said that LGBT people had been targeted for &quot;years&quot; by &quot;hateful words&quot;. The channel, TVP Info, was criticised as a mouthpiece of the previous governing Law and Justice (PiS) party."
    },
    {
        "url": "https://inews.co.uk/news/world/biden-dream-peace-middle-east-2902586",
        "title": "How Biden is still hoping to pull off his dream of peace in Middle East",
        "description": "If the Biden administration can pull it off, it would be &#39;the biggest strategic realignment in the region since the 1979 Camp David treaty&#39;, said one analyst"
    },
    {
        "url": "https://www.thenational.scot/politics/24115178.slashing-public-investment-downturn-worst-thing/",
        "title": "Slashing public investment during a downturn is the worst thing to do",
        "description": "ENGLISH Labour’s pledge to spend £28 billion – really £20 billion, since it included £8 billion already spent – is gone in a poof,"
    },
    {
        "url": "https://uk.movies.yahoo.com/long-island-could-see-8-182900611.html",
        "title": "Long Island could see up to 8 inches of snow on Election Day in key House race",
        "description": "New York City will see wintry conditions on Tuesday, which is also Election Day in the race to represent the 3rd Congressional District, a swing seat left vacant after disgraced Republican Rep. George Santos&#39; expulsion."
    },
    {
        "url": "https://www.telegraph.co.uk/us/politics/2024/02/12/bidens-popularity-plummets-in-uk-especially-among-labour/",
        "title": "Joe Biden’s popularity plummets in <b>UK</b>, especially among Labour voters",
        "description": "Joe Biden ’s popularity in the UK has plummeted, with just a fifth of Britons holding a favourable opinion of the US president, according to polling by Ipsos."
    },
    {
        "url": "https://www.heraldscotland.com/news/24115131.cameron-vows-help-scot-facing-death-penalty-india/",
        "title": "Cameron vows to help Scot facing death penalty in India",
        "description": "Foreign Secretary Lord Cameron has vowed to review the UK Government&#39;s involvement in the case of a British man who has been held in an"
    },
    {
        "url": "https://uk.news.yahoo.com/eu-uk-urge-scientists-join-180011225.html",
        "title": "EU, <b>UK</b> urge scientists to join research programme after Brexit concerns",
        "description": "EU and UK science chiefs on Monday launched a push to attract scientists to Europe&#39;s £80 billion Horizon research programme after warnings of high costs and red tape in Britain. At a meeting in London on Monday,"
    },
    {
        "url": "https://socialistworker.co.uk/news/disaster-looms-for-tories-and-labour-in-rochdale/",
        "title": "Disaster looms for Tories and Labour in Rochdale",
        "description": "Labour’s campaign for the Rochdale by-election has collapsed after its candidate managed to enrage both Zionists and pro-Palestine voters. Azhar Ali was already facing potential defeat at the election set for 29 February. Thousands of people in the constituency are enraged by the Labour Party’s support for Israel in Gaza."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?filterKeyEvents=false&page=with%3Ablock-65ca3bd18f081f61f2d805a1",
        "title": "‘Rwanda cares deeply about refugees’, minister tells Lords in debate – <b>UK politics</b> live",
        "description": "Lord Sharpe of Epsom tells peers those sent to the country ‘will be offered safety and protection’ under treaty"
    },
    {
        "url": "https://www.hvnplus.co.uk/features/uk-politicians-warned-against-backtracking-on-low-carbon-heat-12-02-2024/",
        "title": "Heating and Ventilation News",
        "description": "The UK’s two largest political parties are coming under fire over their long-term policy commitments for incentivising lower carbon heat. Both the"
    },
    {
        "url": "https://inews.co.uk/news/jagtar-singh-johal-family-david-cameron-2902328?ico=related_article_inline",
        "title": "Family of Briton jailed in India left ‘frustrated’ after meeting with David Cameron",
        "description": "The Foreign Secretary urged India to &quot;speed up&quot; the case of Jagtar Singh Johal – but did not call for his release. The former Prime Minister met the family of Jagtar Singh Johal, a 37-year-old Sikh activist from Dumbarton in Scotland, on his first visit ..."
    },
    {
        "url": "https://www.hvnplus.co.uk/news/uk-politicians-warned-against-backtracking-on-low-carbon-heat-12-02-2024/",
        "title": "<b>UK</b> politicians warned against ‘backtracking’ on low carbon heat",
        "description": "The UK’s two largest political parties are coming under fire over their long-term policy commitments for incentivising lower carbon heat. Both the"
    },
    {
        "url": "https://www.thenational.scot/news/24115058.anas-sarwar-holyrood-too-focused-social-justice-not-economy/",
        "title": "Anas Sarwar: Holyrood &#39;too focused on social justice, not economy&#39;",
        "description": "ANAS Sarwar has been criticised after he suggested the Scottish Parliament had focused too much on social justice and not the economy"
    },
    {
        "url": "https://www.holyrood.com/inside-politics/view,pat-mcfadden-its-a-myth-that-british-politics-is-a-pendulum-labour-victories-are-rarities",
        "title": "Pat McFadden: It&#39;s a myth that British <b>politics</b> is a pendulum - Labour victories are rarities",
        "description": "I don’t want Scottish voters to send a message, I want them to send a government&#39;. The Labour MP and party strategist"
    },
    {
        "url": "https://metro.co.uk/2024/02/12/housing-harder-half-population-spoiler-not-men-20240668/?ico=metro-posts_home_whats-trending-now",
        "title": "Buying a home is harder for half of the population. Spoiler: it’s not men",
        "description": "She tells Metro.co.<b>uk</b>: ‘I used a Help to Buy scheme ... She explains: ‘We need to make a <b>political</b> choice to build more social housing. The renting market offers no security for long-term letters – they can be evicted quickly."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24112713.labour-takes-lead-tories-among-politically-homeless-rural-voters/",
        "title": "Labour takes lead over Tories among ‘politically homeless’ rural voters",
        "description": "Labour has taken a narrow lead over the Conservatives among England’s rural voters, a poll has found. But while the survey suggests Conservative support has collapsed in the party’s heartlands, the head of a major countryside business association said rural voters were still “politically homeless”."
    },
    {
        "url": "https://www.nme.com/news/music/potter-payper-announces-upcoming-mixtape-thanks-for-hating-mobo-awards-thanks-for-waiting-3584451",
        "title": "Potter Payper announces “straight-talking” mixtape ‘Thanks For Hating’",
        "description": "On both, the 33-year-old told vivid stories from his past life as a drug dealer and the <b>politics</b> he learnt to abide by. The mixtape will be his first full-length project since 2023’s ‘Real Back In Style’ – which made <b>UK</b> chart history when it became ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gb-news-today-updates-b2494979.html?page=5",
        "title": "Rishi Sunak GB News – live: Prime minister set to be grilled by <b>UK</b> public as pressure mounts",
        "description": "Rishi Sunak is set to be grilled by the UK public as pressure continues to mount on the prime minister in one of the most challenging weeks of his premiership. Mr Sunak is facing questions from undecided and swing voters in County Durham during the People&#39;s Forum event,"
    },
    {
        "url": "https://inews.co.uk/news/jagtar-singh-johal-family-david-cameron-2902328",
        "title": "Family of Briton jailed in India left ‘frustrated’ after meeting with David Cameron",
        "description": "The Foreign Secretary urged India to &quot;speed up&quot; the case of Jagtar Singh Johal – but did not call for his release."
    },
    {
        "url": "https://www.middleeasteye.net/news/war-gaza-apartheid-campaigner-andrew-feinstein-challenge-starmer-upcoming-election",
        "title": "<b>UK</b>: Anti-apartheid campaigner Andrew Feinstein set to challenge Starmer in upcoming elections",
        "description": "The former Nelson Mandela advisor is among a wave of independents seeking to unseat Labour candidates who failed to vote for a ceasefire in Gaza"
    },
    {
        "url": "https://leamingtonobserver.co.uk/news/councillors-kicked-off-committee-for-offensive-and-ignorant-comments-about-special-needs-children-48328/",
        "title": "Councillors kicked off committee for ‘offensive and ignorant’ comments about special needs children",
        "description": "But Warwickshire County Councils leader says she will not be removing the whip from the three Conservative councillors ‘at this moment in time’"
    },
    {
        "url": "https://www.churchtimes.co.uk/articles/2024/16-february/news/uk/asylum-seeker-conveyor-belt-conversions-is-a-fiction-says-bishop-of-durham",
        "title": "Asylum-seeker ‘conveyor belt’ conversions is a fiction, says Bishop of Durham",
        "description": "THERE is no evidence to support the “imaginative range of allegations” made by a former C of E priest about the Church’s apparent complicity in a “conveyor belt” of asylum-seeker conversions, the Bishop of Durham, the Rt Revd Paul Butler, has said."
    },
    {
        "url": "https://www.itv.com/news/2024-02-12/lord-cameron-vows-to-review-case-of-briton-tortured-and-detained-in-india",
        "title": "Lord Cameron vows to review case of Briton tortured and detained in India",
        "description": "The brother of Jagtar Singh Johal, who has been imprisoned for six years, told the foreign secretary &#39;his life is in your hands&#39; after they met on Monday. | ITV National News"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13074815/Moscow-slaps-sanctions-Russophobic-British-officials-historians-academics-Lord-Ashcroft.html",
        "title": "Moscow slaps sanctions on 18 &#39;Russophobic&#39; British officials, historians and academics including Lord Ashcroft and Admiral Simon Asquith",
        "description": "The Russian foreign ministry issued &#39;personal sanctions&#39; in response to what it called &#39;London&#39;s ongoing confrontational course&#39; - as the UK continues to support Kyiv as it resists Putin&#39;s forces."
    },
    {
        "url": "https://uk.news.yahoo.com/us-china-tensions-mount-uk-163139971.html",
        "title": "As US-China tensions mount, the <b>UK</b> will need to work closer with Europe in the Indo-Pacific",
        "description": "The UK’s strategy for the Indo-Pacific region is built around its alliance with the US. This was formalised in September 2021 with the announcement of Aukus, a military alliance with the US and Australia. Yet its major interests there – in security, economy, diplomacy and human rights – appear more closely aligned with Brussels than Washington."
    },
    {
        "url": "https://bylinetimes.com/2024/02/12/it-is-no-coincidence-israel-chose-us-super-bowl-to-launch-latest-bombing-spree-on-palestinians/",
        "title": "‘It Is No Coincidence Israel Chose US Super Bowl to Launch Latest Bombing Spree On Palestinians’",
        "description": "The western powers have expressed increasing concern over the conduct of Israel’s campaign in Gaza but applied no consequences in practice, writes former diplomat"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68272820?at_medium=RSS",
        "title": "Azhar Ali: Labour defends standing by Rochdale by-election candidate",
        "description": "Mr Thomas-Symonds confirmed Labour would continue to campaign for Mr Ali in Rochdale, who he said had &quot;fallen for a conspiracy theory&quot; but that there was a need to &quot;do a tremendous amount of work to rebuild trust with the Jewish community&quot;. He pointed to comments from former MP Louise Ellman, who has backed Mr Ali."
    },
    {
        "url": "https://www.express.co.uk/news/world/1865878/vladimir-putin-ukraine-war-poland-nuclear-weapons",
        "title": "Vladimir Putin threats backfire as Russia poised to get new nuclear superpower neighbour",
        "description": "Russia is the only country in Eastern Europe to keep a nuclear arsenal but the ongoing war in Ukraine could change that."
    },
    {
        "url": "https://www.ncl.ac.uk/press/articles/latest/2024/02/ageingdementiaresearch/",
        "title": "ageing dementia research",
        "description": "Newcastle University is collaborating with national experts to understand ageing and dementia-related diseases better in the hope of improving future treatments."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24114633.three-apologies-several-days-mobile-network-issues/",
        "title": "Three apologies after several days of mobile network issues",
        "description": "Mobile operator Three has apologised to customers after an issue hit its network for the fourth day running, leaving thousands of customers without connectivity."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24113884.uk-sanctions-four-israeli-settlers-accused-human-rights-abuses-west-bank/",
        "title": "<b>UK</b> sanctions four Israeli settlers accused of human rights abuses in West Bank",
        "description": "Moshe Sharvit, Yinon Levy, Zvi Bar Yosef and Ely Federman have been made subject to a UK asset freeze, and travel and visa ban."
    },
    {
        "url": "https://www.politicshome.com/thehouse/article/second-trump-presidency-great-britain",
        "title": "A second Trump presidency would be great for Britain",
        "description": "The greatest Tory prime minister, Benjamin Disraeli, served two spells as prime minister, as did Winston Churchill, during and then after the"
    },
    {
        "url": "https://inews.co.uk/news/politics/unlikely-lord-cameron-pm-again-tory-plots-oust-sunak-2902018?ITO=msn",
        "title": "Why it’s unlikely Lord Cameron would become PM again despite Tory plots to oust Sunak",
        "description": "One MP tells i the Foreign Secretary is being floated by some Tory plotters as a potential &#39;unity candidate&#39; before the election"
    },
    {
        "url": "https://www.edp24.co.uk/news/24114361.crowdfunder-launched-norwichs-shoebox-community-hub/",
        "title": "Crowdfunder launched for Norwich&#39;s Shoebox Community Hub",
        "description": "A Crowdfunder appeal has been launched to secure the long-term future of The Shoebox Community Hub in Castle Meadow Norwich - home to a"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24113053.unfair-draw-wider-conclusions-candidates-israel-claims-shadow-minister/",
        "title": "Unfair to draw wider conclusions from candidate’s Israel claims: shadow minister",
        "description": "A shadow minister has insisted it would be “unfair” to conclude there is a problem with Labour in Rochdale amid criticism of remarks about Israel made by the party’s constituency candidate."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/opinion/comment/whatever-the-plan-is-for-childcare-the-status-quo-just-simply-cant-continue/a868709370.html",
        "title": "Whatever the plan is for childcare, the status quo just simply can’t continue",
        "description": "It seemed like something we hardly dared to dream was on the horizon in recent weeks as our <b>political</b> parties appeared to be in agreement on how crucial further childcare support is to parents, with one politician — Alliance’s Kate Nicholl — rightly ..."
    },
    {
        "url": "https://www.business-live.co.uk/opinion-analysis/how-first-minister-contenders-match-28617708",
        "title": "How the First Minister contenders match up on business support and the economy",
        "description": "This means that one of the two candidates vying for this role - Jeremy Miles and Vaughan Gething - will be responsible for the future direction of the nation at a time when the economy is struggling, and Wales remains one of the poorest parts of the <b>UK</b>."
    }
]