[
    {
        "url": "https://www.telegraph.co.uk/films/2023/12/29/maestro-leonard-bernstein-bradley-cooper-truth-facts/",
        "title": "Black Panthers and an affair with a soldier: what Maestro doesn’t tell you about Bernstein",
        "description": "Bradley Cooper’s biopic is magnificent, but the life of Leonard Bernstein was far too colourful – and complicated – for one movie"
    },
    {
        "url": "https://www.mirror.co.uk/sport/horse-racing/william-hill-cheltenham-festival-non-31769046",
        "title": "Cheltenham Festival 2024: Bookmaker becomes first to offer ‘non-runner no bet’ on all races",
        "description": "William Hill will refund stakes on any Cheltenham Fesitval selection which does not run at the meeting in March on bets placed from New Year’s Day"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/29/alex-salmond-scotland-moving-politically-backwards-snp/",
        "title": "Scotland ‘moving politically backwards’ under the SNP, says Alex Salmond",
        "description": "Alba Party leader country had endured a ‘decade of drift’ under the party that has ‘dithered and delayed forging ahead to independence’"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/government-will-not-allow-public-services-to-deteriorate-further-says-chris-heaton-harris-4461119",
        "title": "Government will not allow public services to deteriorate further says Chris Heaton-Harris",
        "description": "The UK Government will not stand by and allow public services to deteriorate in Northern Ireland while Stormont remains suspended, Chris Heaton-Harris has said"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/allister-invokes-ulster-covenant-as-his-new-year-message-calls-for-equal-uk-citizenship-to-be-the-core-aim-of-unionism-4461110",
        "title": "Allister invokes Ulster Covenant as his New Year message calls for equal <b>UK</b> citizenship to be the core aim of unionism",
        "description": "The TUV leader says unionists should be guided by their founding fathers who rallied around a demand for equal citizenship during the Home Rule crisis – and says they must take the political long view and not rush back to Stormont next year."
    },
    {
        "url": "https://www.scotsman.com/news/politics/scotland-is-moving-politically-backwards-says-alex-salmond-4461100",
        "title": "Scotland is ‘moving politically backwards’, says Alex Salmond",
        "description": "Former first minister Alex Salmond has claimed that Scotland is “moving politically backwards” as he hit out at both the Scottish Government and the SNP."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24017643.humza-yousaf-says-snp-can-come-top-general-election/",
        "title": "Humza Yousaf says SNP can ‘come out on top’ in general election",
        "description": "However, elections expert Professor Sir John Curtice said the SNP leader is ‘nothing like as popular’ as his predecessor, Nicola Sturgeon."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24016220.time-politicians-stopped-treating-islanders-contempt/",
        "title": "It&#39;s time our politicians stopped treating islanders with contempt",
        "description": "Over the centuries, some have been depopulated out of necessity, such as St Kilda, some by choice as the islanders moved elsewhere while many, of course, were brutally cleared by landowners and replaced with sheep."
    },
    {
        "url": "https://www.thetimes.co.uk/article/humza-yousaf-nothing-like-as-popular-as-nicola-sturgeon-says-poll-expert-rn8sbrmgh",
        "title": "Humza Yousaf ‘nothing like as popular’ as Nicola Sturgeon, says poll expert",
        "description": "John Curtice said the former first minister’s decision to step down had ‘quite substantial political consequences’ for the SNP"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/uk-government-will-not-allow-public-services-to-deteriorate-further-while-stormont-suspended-2KETNTHFD5OJTFKRKGYHE65PQA/",
        "title": "<b>UK</b> Government ‘will not allow public services to deteriorate further while Stormont suspended’",
        "description": "The UK Government will not stand by and allow public services to deteriorate in Northern Ireland while Stormont remains suspended, Chris Heaton-Harris has said."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24017613.one-death-linked-e-coli-outbreak/",
        "title": "One death linked to E.coli outbreak",
        "description": "One person has died following an outbreak of E.coli, health officials have said. The UK Health Security Agency (UKHSA) said 30 confirmed cases of Shiga toxin-producing E.coli (Stec) have been recorded across England and Scotland since late July in people aged seven to 81."
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/29/ftse-100-up-but-europe-us-uk-wall-street-sp-500",
        "title": "FTSE 100 ends year up 3.8% but trails rival markets in Europe and US",
        "description": "Lack of tech companies leaves UK floundering against Wall Street, where S&amp;P 500 has jumped 25%"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/heaton-harris-government-will-not-allow-public-services-to-deteriorate-further-96481/",
        "title": "Heaton-Harris: Government will not allow public services to deteriorate further",
        "description": "The UK Government will not stand by and allow public services to deteriorate in Northern Ireland while Stormont remains suspended, Chris Heaton-Harris has said."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/29/british-politics-local-councils-ministers-town-hall-democracy",
        "title": "British <b>politics</b> is rotting from the bottom up: pity our crisis-hit local councils",
        "description": "The collapse of town hall democracy is a scandal unfolding in real time, says Guardian columnist Simon Jenkins"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/best-opinion-2023-politics-barbie-060000870.html",
        "title": "Best of opinion 2023: From <b>politics</b> to Barbie, City A.M.’s top comment pieces of the year",
        "description": "As 2023 comes to a close, we take a look back at the best of opinion from City A.M.&#39;s columnists, from office politics to Barbiemania."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/national-archive-secret-papers-30-year-rule-blair-thatcher-b2470893.html",
        "title": "National Archive secrets: whatever happened to the 30-year rule?",
        "description": "There is nothing new in <b>politics</b>. Twenty years ago ... The other is that the Rwanda plan is not for offshore processing of claims for asylum in the <b>UK</b>, but for processing by Rwanda of claims for asylum in Rwanda. There are other controversies that still ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-airport-storm-protocol-after-28363215",
        "title": "Birmingham Airport storm protocol after pilots battle crosswinds and Emirates A380 circles city",
        "description": "Storm Gerrit has seen gusts of up to 70mph hit the <b>UK</b>, causing disruption to airports ... For more stories from across Solihull including BHX, breaking news, <b>politics</b> and what&#39;s on, sign up to our MySolihull newsletter here"
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/in-2024-the-year-of-elections-persuading-young-voters-to-have-faith-in-democracy-will-be-a-vital-task-joyce-mcmillan-4460189",
        "title": "In 2024, the &#39;year of elections&#39;, persuading young voters to have faith in democracy will be a vital task – Joyce McMillan",
        "description": "Young people’s cynicism about party politics must be music to the ears of the wealthy and powerful who oppose interference by democratically elected politicians"
    },
    {
        "url": "https://www.yourthurrock.com/2023/12/29/families-could-use-ev-batteries-to-power-their-homes-and-save-on-bills-as-government-backs-new-charging-technologies/",
        "title": "Families could use EV batteries to power their homes and save on bills as government backs new charging technologies",
        "description": "FAMILIES could soon save hundreds of pounds on energy bills by using electricity stored in their electric vehicles (EVs) to power home appliances such as fridges and washing machines – thanks to new two-way charging technologies being supported with government funding."
    },
    {
        "url": "https://www.mirror.co.uk/news/beautiful-mould-loving-plants-banish-31769209",
        "title": "Beautiful &#39;mould-loving&#39; plants that banish condensation and mildew in your home",
        "description": "Condensation and mould can be a nuisance in your home, particularly in the winter months, but these &#39;mould-loving&#39; plants can help banish the issue for good, whilst being a beautiful addition to any r"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-heatonharris-uk-government-government-stormont-northern-ireland-b1129489.html",
        "title": "Heaton-Harris: Government will not allow public services to deteriorate further",
        "description": "The UK Government will not stand by and allow public services to deteriorate in Northern Ireland while Stormont remains suspended, Chris Heaton-Harris has said."
    },
    {
        "url": "https://www.eadt.co.uk/news/24017500.beast-east-returning-suffolk-2024/",
        "title": "Could Beast from the East be returning to Suffolk in 2024?",
        "description": "The Met Office has said there is an &quot;increased chance&quot; of the weather phenomenon that brought the Beast from the East returning"
    },
    {
        "url": "https://www.edp24.co.uk/news/24017030.beast-east-returning-norfolk-2024/",
        "title": "Could Beast from the East be returning to Norfolk in 2024?",
        "description": "The Met Office has said there is an &quot;increased chance&quot; of the weather phenomenon that brought the Beast from the East returning"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/life/weekend/northern-irelands-top-100-newsmakers-of-2023-no-75-51/a537504302.html",
        "title": "Northern Ireland’s top 100 newsmakers of 2023, No 75-51",
        "description": "A mix of the good, the bad and the bizarre who made the news in Northern Ireland this year, ranked from 75 to 51."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11719925/nicola-sturgeon-snp-year-scottish-politics/",
        "title": "Nicola Sturgeon’s arrest, the iPad scandal &amp; failed gender bill – A look back at a shock year in Scottish <b>Politics</b>",
        "description": "AS 2023 began, Nicola Sturgeon was still First Minister and while the SNP were sliding in the polls, they were still on top. The 12 months that have followed saw the resignation of the dominant"
    },
    {
        "url": "https://www.thenational.scot/news/24017436.bbc-gets-150-complaints-bias-favour-michelle-mone/",
        "title": "BBC gets over 150 complaints about &#39;bias in favour of Michelle Mone&#39;",
        "description": "THE BBC received more than 150 complaints about “bias” in favour of Michelle Mone and her husband Douglas Barrowman after the"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-childcare-plans-cost-billions-20-years-2828174?ico=more_from_this_author",
        "title": "Labour’s childcare plans would cost billions and take 20 years, experts say",
        "description": "Neil Leitch of the Early Years Alliance tells i that Labour’s proposals for an overhaul are &#39;disappointing&#39; and &#39;misguided&#39;"
    },
    {
        "url": "https://www.itv.com/news/anglia/2023-12-29/tory-mp-forced-to-deny-hes-been-paying-for-facebook-likes",
        "title": "Great Yarmouth MP Brandon Lewis forced to deny he&#39;s been paying for Facebook &#39;likes&#39;",
        "description": "The accusation was made by the <b>Politics</b> <b>UK</b> account on X, formerly known as Twitter, who claimed that Great Yarmouth MP Brandon Lewis had suddenly started receiving an unusual number of likes on his recent videos. “Tory MP Brandon Lewis appears to be ..."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/prince-william-kate-middleton-tearful-christmas",
        "title": "Prince William reportedly once left Kate Middleton &quot;tearful&quot; at Christmas",
        "description": "According to a biography by royal expert Katie Nicholl, Prince William once left Kate, his girlfriend at the time, &quot;tearful&quot; back in 2006 when he cancelled his plans to visit her family for Christmas."
    },
    {
        "url": "https://www.thenational.scot/politics/24016225.see-fire-guts-less-weary-wullie-politics/",
        "title": "Let’s see more fire and guts and less of the ‘Weary Wullie’ <b>politics</b>",
        "description": "As I read The National’s letters pages, its independence content reads more and more like the ending of a Q8 sketch with Spike Milligan"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24008469.community-news-alresford-surrounding-villages/",
        "title": "Community news in Alresford and surrounding villages",
        "description": "A NEW Gospel Choir will launch at St. John&#39;s Church in Alresford next month. The Gospel Collective, led by Tim Uffindell, will meet on"
    },
    {
        "url": "https://uk.news.yahoo.com/covid-diaries-common-samuel-pepys-114250677.html",
        "title": "What COVID diaries have in common with Samuel Pepys&#39; 17th-century plague diaries",
        "description": "Diaries written during the Great Plague are not so numerous. Of the few available, the most valuable is that of naval administrator Samuel Pepys (1633-1703), whose exceptionally detailed and candid journals form by far the most comprehensive firsthand account of plague-stricken London."
    },
    {
        "url": "https://metro.co.uk/2023/12/29/first-israeli-teenager-jailed-refusing-fight-gaza-20038103/?ico=trending-post-strip_item_4",
        "title": "First Israeli teenager to be jailed for refusing to fight in Gaza",
        "description": "Israel has jailed an 18-year-old teenager for refusing to enlist in the military during its ongoing war against Hamas. Tal Mitnick is the latest Israeli citizen to object against the killing of thousands of people across Gaza, and he is willing to pay a price for it."
    },
    {
        "url": "https://inews.co.uk/news/politics/crap-parents-why-children-struggle-tories-most-endangered-mp-2817474?ico=related_stories",
        "title": "‘Crap parents’ are why children struggle, claims Conservative MP James Daly",
        "description": "James Daly would lose Bury North if just 53 Tory voters switched to Labour. But the MP has criticised some of his own constituents in an interview with i"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/treatment-of-northern-ireland-crime-victims-falling-behind-rest-of-uk-commissioner-warns-TP4GWBVY7VP6XD2VIELHFT3OZA/",
        "title": "Treatment of Northern Ireland crime victims falling behind rest of <b>UK</b>, commissioner warns",
        "description": "Geraldine Hanna said Stormont needs to return to argue for funding and to provide oversight for criminal justice agencies."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/famous-faces-said-goodbye-northern-28356891",
        "title": "The famous faces we said goodbye to in Northern Ireland in 2023",
        "description": "As another year draws to a close, it&#39;s time to commemorate those we have waved goodbye to over the last 12 months"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24009801.2023-quiz-23-questions-year-barbie-prince-harry/",
        "title": "2023 quiz: 23 questions on the year from Barbie to Prince Harry",
        "description": "Big Brother returned, Eurovision came to the <b>UK</b>, the Beatles released a new song and a new King was crowned. Did Billy Joel write 2023? This year deserves its own &#39;We Didn&#39;t Start The Fire&#39; - from Blockbuster hits to <b>political</b> fallouts, it&#39;s been packed ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/tony-blair-aides-wanted-asylum-holding-camp-on-scottish-island/",
        "title": "Tony Blair aides wanted asylum holding camp on Scottish island",
        "description": "Tony Blair&#39;s government considered setting up a holding camp on the Isle of Mull to drive down the number of asylum seekers entering the UK, according to newly released official papers."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24016879.new-years-eve-revellers-urged-wrap-warm-temperatures-plummet/",
        "title": "New Year’s Eve revellers urged to wrap up warm as temperatures plummet",
        "description": "The weather is expected to remain unsettled with strong winds, heavy rain and ‘close to freezing’ conditions throughout the last weekend of 2023."
    },
    {
        "url": "https://www.politico.eu/article/politico-london-playbook-awards-2023-all-winners-wild-year-uk-politics/",
        "title": "POLITICO London Playbook awards 2023: all the winners from a wild year in <b>UK politics</b>",
        "description": "From minister of the year to the wildest social media storms, POLITICO’s essential Westminster newsletter picks the big hitters."
    }
]