[
    {
        "url": "https://inews.co.uk/news/politics/tory-rebels-defeat-sunak-rwanda-look-weak-theresa-may-2803493?ico=above_article_ticker",
        "title": "If Tory rebels defeat Sunak on Rwanda, he will look as weak as Theresa May",
        "description": "Because this issue cuts to the heart of Rishi Sunak‘s <b>political</b> authority. If he can win over nearly ... anxious to protect their right flank from the threat of Reform <b>UK</b>. But if they feel angry and powerless right now, how will they cope with the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67684785",
        "title": "Rishi Sunak faces crunch Rwanda vote as Tory MPs split",
        "description": "Why does the <b>UK</b> want to send asylum seekers to Rwanda ... against the government in large enough numbers this would be near-apocalyptic for Sunak in <b>political</b> terms. That prospect may be enough for him to withdraw the bill completely."
    },
    {
        "url": "https://news.sky.com/story/showdown-for-sunak-as-tory-mps-in-disarray-over-rwanda-vote-13028258",
        "title": "Showdown for Sunak as Tory MPs in disarray over Rwanda vote",
        "description": "The prime minister has faced calls from the Tory right to scrap the Safety of Rwanda Bill before it faces its first Commons vote on Tuesday because it is not &quot;fit for purpose&quot; - but moderate Tories ha"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/23983163.eat-help-a-mistake-says-son-whose-father-died-covid-19/",
        "title": "Eat Out To Help Out ‘a mistake’, says son whose father died with Covid-19",
        "description": "Stephen Allen said the Eat Out To Help Out scheme was ‘a mistake’ after his father Charles Allen died in hospital with Covid-19 in 2020."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12851619/officials-missed-PSNI-blunder-personal-details-officers-published.html",
        "title": "Six officials missed PSNI blunder that saw personal details of nearly 9,500 officers published online but no one has been sacked or faced disciplinary action, report reveals",
        "description": "This is considered to have been the most significant data breach that has ever occurred in the history of <b>UK</b> policing, not only because of the nature and volume of compromised data, but because of the <b>political</b> history and context that sets the backdrop of ..."
    },
    {
        "url": "https://news.sky.com/story/politics-hub-live-sunak-contradicts-hancocks-claim-at-covid-inquiry-ex-minister-gets-ptsd-thinking-about-brexit-debate-12593360",
        "title": "<b>Politics</b> Hub live: Sunak contradicts Hancock&#39;s claim at COVID inquiry; ex-minister gets &#39;PTSD thinking about Brexit debate&#39;",
        "description": "<b>Politics</b> Hub With Sophy Ridge is live Our weeknight <b>politics</b> ... But the group says it remains concerned about any future amendments that would mean the <b>UK</b> government breaching the rule of law and its international obligations and would oppose such amendments."
    },
    {
        "url": "https://www.middleeasteye.net/news/cop28-uae-slapped-fresh-charges-high-profile-political-prisoners-cop28-held-says-group",
        "title": "Cop28: UAE slapped fresh charges on high-profile <b>political</b> prisoners during summit, says group",
        "description": "As Cop28 was underway, UAE launched mass trial with 87 defendants facing potential life sentences or the death penalty"
    },
    {
        "url": "https://www.readersdigest.co.uk/money/managing-your-money/half-price-news-from-the-financial-times",
        "title": "Enjoy half price news from the Financial Times",
        "description": "We&#39;re offering the Financial Times via their digital app at half price offering an immersive reading experience which is accessible anytime and anywhere."
    },
    {
        "url": "https://inews.co.uk/news/northern-ireland/northern-ireland-leaders-offered-funding-revive-power-sharing-2803389?ico=related_stories",
        "title": "Northern Ireland leaders offered £2.5bn funding in bid to revive power sharing",
        "description": "The UK Government is offering a £2.5bn funding package for Northern Ireland in a bid to restore the Stormont Executive. The package includes funding for public sector pay rises, but it is contingent upon the return of the region’s power-sharing institutions,"
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-met-with-five-foreign-leaders-without-uk-official-present-at-cop28-alister-jack-claims",
        "title": "Yousaf &#39;met with five foreign leaders without <b>UK</b> official present&#39;",
        "description": "Scotland’s First Minister met with five different foreign leaders during COP28 without an official from the UK Government present, Scottish secretary Alister Jack has claimed."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/11/rwanda-bill-star-chamber-tory-lawyers-rishi-sunak-advice/",
        "title": "Rwanda Bill: Five key things the Government and Tory rebels disagree on",
        "description": "A ‘star chamber’ of Conservative lawyers doesn’t think the legislation goes far enough but Rishi Sunak has published his own legal advice"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2023/dec/11/rishi-sunak-covid-inquiry-conservatives-rwanda-asylum-bill-uk-politics-live?page=with:block-65776b498f08635a62431a05",
        "title": "One Nation Tory MPs vow to drop support for Rwanda bill if there are amendments as ERG calls for it to be rewritten – <b>UK politics</b> live",
        "description": "Damian Green says government must ‘stick to guns’ but chair of European Research Group calls for bill to be pulled and rewritten"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/23983118.rishi-sunaks-rwanda-plan-boosted-backing-moderate-group-tory-mps/",
        "title": "Rishi Sunak’s Rwanda plan boosted by backing from moderate group of Tory MPs",
        "description": "The One Nation group has recommended its members back the plan but warned it would oppose amendments that would risk the UK breaching the rule"
    },
    {
        "url": "https://www.ft.com/content/80e9359a-9443-46ac-8dec-f2df7cabfe3d",
        "title": "‘Draconian’ Rwanda bill pushes <b>UK</b> into new legal waters",
        "description": "As Conservative MPs battled over Rishi Sunak’s Rwanda bill ahead of a vote on Tuesday, legal and other experts said the legislation was already the most drastic response to immigration in decades. Sunak’s efforts to restrict appeals by asylum seekers against being sent to Rwanda had echoes of the 1968 Labour government’s overnight decision to prevent Kenyans Asians entering the UK."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12851719/Donald-Tusk-elected-Poland-PM-EU-leader-vows-right-wrongs-eight-years-right-wing.html",
        "title": "Donald Tusk is elected Poland&#39;s new PM: Former EU leader (and David Cameron&#39;s old rival) vows to &#39;right the wrongs&#39; amid return to power after eight years of right-wing rule",
        "description": "The ex-leader of the European Council, who clashed with now-Foreign Minister David Cameron over what he called the &#39;stupid&#39; Brexit vote, has been tasked with forming a new government."
    },
    {
        "url": "https://www.thenational.scot/politics/23982847.wee-ginger-dug-david-cameron-zombie-british-politics/",
        "title": "Wee Ginger Dug: David Cameron is the zombie of British <b>politics</b>",
        "description": "The Foreign Secretary David Cameron is the zombie of British politics. His political career was killed off in 2016, but he was resurrected from"
    },
    {
        "url": "https://www.theguardian.com/politics/video/2023/dec/11/rishi-sunak-gives-evidence-to-uk-covid-inquiry-video-highlights",
        "title": "Rishi Sunak gives evidence to <b>UK</b> Covid inquiry – video highlights",
        "description": "The prime minister gave evidence to the UK Covid inquiry on Monday, where he faced questions on the &#39;eat out to help out scheme&#39; that his ministry launched, as well as other issues relating to the gov"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/im-sick-waking-up-racist-31650686",
        "title": "&#39;I&#39;m sick of waking up to the racist lie that immigrants are our biggest problem&#39;",
        "description": "Darren Lewis is fed up with hearing that stopping the boats is the British people’s biggest priority when most people are more concerned about heating, eating, and the cost of living"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/rishi-sunak-covid-inquiry-eat-out-to-help-out-london-b1126293.html",
        "title": "Rishi Sunak&#39;s evidence to Covid inquiry &#39;pathetic&#39;, bereaved families say",
        "description": "The Prime Minister&#39;s testimony has been &#39;the most pathetic performance&#39; since the start of the inquiry, spokesperson Jean Adamson says"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844442/Rishi-Sunak-Rwanda-Bill-MPs-vote",
        "title": "Boost for Rishi Sunak as moderate MPs back Rwanda Bill ahead of crunch vote tomorrow",
        "description": "The Prime Minister has faced calls from the Tory right to scrap the Safety of Rwanda Bill before it faces its first Commons vote on Tuesday because it is not &quot;fit for purpose&quot;."
    },
    {
        "url": "https://www.dailyecho.co.uk/leisure/national/23983075.white-lotus-will-sharpe-star-new-romantic-comedy-series-lena-dunham/",
        "title": "White Lotus’ Will Sharpe to star in new romantic comedy series by Lena Dunham",
        "description": "The White Lotus star Will Sharpe and Hacks actress Megan Stalter will star in a new romantic comedy by Lena Dunham. The 10-part Netflix series, titled Too Much, will see Stalter play Jessica, a New York workaholic in her mid-thirties who takes a job in London after her relationship breaks down."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23982180.rural-scotland-radical-action-land-housing-can-save/?ref=rss",
        "title": "Rural Scotland: only radical action on land and housing can save it",
        "description": "I caught two stories yesterday about Highland Council. The first was that they face a dire budget shortfall even by the extreme standards which"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/23983073.polands-parliament-elects-donald-tusk-prime-minister/",
        "title": "Poland’s parliament elects Donald Tusk as prime minister",
        "description": "Poland’s parliament elected centrist party leader Donald Tusk as prime minister on Monday, paving the way for a new pro-EU government after eight years of stormy national conservative rule."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/11/donald-tusk-elected-as-polish-prime-minister/",
        "title": "Donald Tusk elected as Polish prime minister",
        "description": "Donald Tusk has been elected as Poland’s next prime minister after the government lost a vote of confidence, bringing an end to the conservative Law and Justice party’s eight years in power. The government lost the vote by 266 to 190, and a few hours later parliament voted to nominate Mr Tusk as the next head of government."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23982503.snp-like-adolescents-crashing-grown-ups-party/",
        "title": "The SNP are like adolescents crashing the grown-ups’ party",
        "description": "THE most enduring criticism of Tories in power is that their wealth and privileges will always insulate them from the effects of their policies."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2023/12/11/bereaved-families-say-sunaks-evidence-to-covid-inquiry-was-pathetic/",
        "title": "Bereaved families say Sunak’s evidence to Covid inquiry was ‘pathetic’",
        "description": "Bereaved families have called the Prime Minister’s evidence to the Covid inquiry “pathetic” and criticised his inability to recall emails sent during the pandemic. Some people hung images of their dead relatives around their necks and when Rishi Sunak left the inquiry room many stood and held up photographs of loved ones who died from the virus."
    },
    {
        "url": "https://uk.style.yahoo.com/essential-guide-taxi-etiquette-age-182107871.html",
        "title": "The essential guide to taxi etiquette in the age of Uber",
        "description": "We’ve all been there. You’re in the back of a taxi, engrossed in Wordle, when suddenly the driver slides back the partition and starts canvassing your views on whether the Elgin Marbles should be on the first flight back to Athens."
    },
    {
        "url": "https://www.libdems.org.uk/vision",
        "title": "What we stand for",
        "description": "1. A fair, prosperous and innovative economy that promotes opportunity and wellbeing."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-covid-inquiry-live-31643920",
        "title": "Covid Inquiry RECAP: Rishi Sunak denies calling free school meal parents &#39;freeloaders&#39;",
        "description": "Rishi Sunak, who was branded &#39;Dr Death&#39; by Government scientists, issued an apology to bereaved families at the start of his Covid Inquiry grilling"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1844438/bbc-licence-fee-ireland-rte-leo-varadkar",
        "title": "BBC licence fee in spotlight as Ireland ponders defunding state broadcaster RTE",
        "description": "RTE has been rocked by recent revelations about what Ray Bassett described as &quot;under-the-counter&quot; payments to some of its top earners."
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/gary-lineker-hits-back-after-28271819",
        "title": "Gary Lineker hits back after being criticised for expressing views on Rwanda scheme",
        "description": "The Match of the Day presenter retaliated after Grant Shapps said Lineker should not be making political statements given his role as a prominent BBC presenter"
    },
    {
        "url": "https://uk.movies.yahoo.com/republicans-putting-vital-aid-ukraine-181057697.html",
        "title": "Republicans are putting vital aid to Ukraine in jeopardy. Without it, Kyiv could lose, war expert says",
        "description": "Republicans have been holding new US aid to Ukraine hostage, hoping to secure political wins while Kyiv struggles in an existential fight against Russia. And as time runs out for a deal, the White House, Ukraine, and experts have all been sounding the alarm, arguing that if the well runs dry, Ukraine will lose the war."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/23982897.woman-arrested-hemlington-raid-drug-dealing-offences/",
        "title": "Woman arrested in Hemlington raid for drug dealing offences",
        "description": "A woman was arrested on suspicion of possession with intent to supply drugs after officers executed a drugs warrant on a Hemlington property."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67681414?at_medium=RSS&at_campaign=KARANGA",
        "title": "How much trouble is PM in over Rwanda bill?",
        "description": "Rwanda law incomplete solution, Tory faction says <b>UK</b> earmarks £700m for small boat arrivals to 2030 ... in large enough numbers this would be near-apocalyptic for Mr Sunak in <b>political</b> terms. That prospect, if the whips tell him it is imminent, may ..."
    },
    {
        "url": "https://www.politico.eu/article/european-parliament-election-cybersecurity-problem/",
        "title": "The European Parliament has an election security problem",
        "description": "EU elections are coming but the institution’s cybersecurity isn’t up to scratch to fight off the imminent deluge of attacks, insiders warn."
    },
    {
        "url": "https://www.thenational.scot/politics/23983099.uk-government-must-stop-facilitating-atrocities-gaza/",
        "title": "The <b>UK</b> Government must stop facilitating atrocities in Gaza",
        "description": "WHY on Earth is the <b>UK</b> Government not calling for a stop to Israel’s horrific ... How wonderful it would be if we could simply declare a country safe after a <b>political</b> debate in London or Edinburgh or Leeds City Council. How simple it would become ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/opinion/columnists/sam-mcbride/is-westminsters-power-sharing-25bn-cash-offer-all-as-it-seems/a1734448915.html",
        "title": "Is Westminster’s power-sharing £2.5bn cash offer all as it seems?",
        "description": "There is a <b>political</b> consensus on substantial pay rises for public servants ... That is based on the understanding that it takes more money to deliver public services in different parts of the <b>UK</b>. Northern Ireland, for instance, cannot avail of the same ..."
    },
    {
        "url": "https://www.ft.com/content/9c2df35f-555a-4c34-84e6-93e125d6c410?trk=public_post_comment-text",
        "title": "Britain won’t rejoin the EU for decades — if ever",
        "description": "There are three decisive reasons: first, it would create a host of new and damaging uncertainties; second, it would tear British <b>politics</b> apart just as they were calming down; third, the deal the <b>UK</b> would get would be quite different from the one it had ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/donald-tusk-poland-prime-minister-t9l665f50",
        "title": "Donald Tusk returns as Poland’s prime minister after forcing vote",
        "description": "Former European Council president who said there was a “special place in hell” for Brexiteers forces a confidence vote that will oust Mateusz Morawiecki"
    },
    {
        "url": "https://www.yellowad.co.uk/peter-brings-brian-to-the-palace/",
        "title": "Peter brings Brian to the Palace",
        "description": "Brian Butterfield’s Call Of Now comes to the Palace Theatre, Westcliff on Wednesday June 12 2024. Initially making his debut"
    },
    {
        "url": "https://www.thesun.co.uk/news/25018956/christmas-shoppers-rush-to-aldi-foodie-stocking-fillers/",
        "title": "Christmas shoppers rush to Aldi to grab foodie stocking fillers scanning for just 19p at tills",
        "description": "CHRISTMAS is just around the corner and shoppers are enjoying steal deals offered by major supermarkets. And festive customers are flocking to Aldi to grab foodie stocking fillers scanning at"
    },
    {
        "url": "https://inews.co.uk/news/media/lineker-tweets-tories-rwanda-bbc-rules-2802569",
        "title": "Lineker’s tweets to Tories over Rwanda may have breached BBC rules, say insiders",
        "description": "Gary Lineker&#39;s fiery responses to Tory MPs who told him to stop talking about politics and stick to football may have breached BBC rules on &#39;civility&#39; which forbid personal attacks on individuals"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/23972533.teesside-international-becomes-ninth-partner-level-campaign/",
        "title": "Teesside International becomes ninth partner in Level Up campaign",
        "description": "The Northern Echo’s Level Up campaign continues to grow as the North East begins one of its most exciting phases - as Teesside"
    },
    {
        "url": "https://epigram.org.uk/2023/12/11/opinion-conservative/",
        "title": "Opinion | Conservative Crossroads: Navigating Policies, Challenges, and the Road to Re-election",
        "description": "On the brink of a general election, the Conservative Party conference of 2023 could not have come at a better time. Discussions of new, supposedly improved, potential policies vividly circulated as the Tory MPs set up for debate at the conference in Manchester last month."
    },
    {
        "url": "https://www.hvnplus.co.uk/news/uk-green-building-council-backs-accelerated-action-on-decarbonisation-11-12-2023/",
        "title": "<b>UK</b> Green Building Council backs accelerated action on decarbonisation",
        "description": "The UK Green Building Council (UKGBC) has released the first update to its Net Zero Whole Life Carbon Roadmap report. The original roadmap  document was"
    },
    {
        "url": "https://www.ft.com/content/1f853f3f-061d-4f06-8e11-a9e56421c2e5",
        "title": "<b>UK</b> government offers £2.5bn to stabilise Northern Ireland finances",
        "description": "Northern Ireland receives a £15bn annual grant from London. Heaton-Harris says the region receives 21 per cent more funding per head than other parts of the UK but spends it inefficiently. He has already launched public consultations on traditionally unpopular ways to raise more revenue, such as introducing water rates."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/23982854.plans-manage-migrant-arrivals-2030-suggests-government-not-confident/",
        "title": "Plans to manage migrant arrivals until 2030 suggests Government ‘not confident’",
        "description": "Fresh plans for a reception centre at Manston for at least six years suggests the Government are “not terribly confident they are going to be able to control illegal migration traffic”, a Kent MP has said."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67681414.amp",
        "title": "How much trouble is PM in over Rwanda bill?",
        "description": "Add into that Rishi Sunak&#39;s own claim that this is the toughest possible bill, and the European Research Group&#39;s (ERG) legal advice which warns that some of the changes they desire may not be possible under the scope of this legislation, and you can see why some Conservatives are now demanding the bill be pulled."
    },
    {
        "url": "https://www.bbc.com/future/article/20231206-the-coloured-stripes-that-explain-climate-change",
        "title": "The coloured stripes that explain climate change",
        "description": "Five years ago a simple design – stripes of colours ranging from dark blue to dark red – started a universal and revolutionary way of communicating global warming."
    },
    {
        "url": "https://www.bbc.com/news/uk-67663888?at_link_type=web_link&at_format=link&at_link_origin=BBC_News&at_link_id=FABC4CF0-97FB-11EE-8576-1BE2A9F30DC0&at_campaign_type=owned&at_ptr_name=facebook_page&at_bbc_team=editorial",
        "title": "Elite Afghan troops face return to Taliban after <b>UK</b> &#39;betrayal&#39;",
        "description": "It is not just former members of Afghan special forces who say they have been left in the cold, but also Afghan civilians who helped the <b>UK</b>. Mohammad Fahim was one of the <b>political</b> faces of the front-line fight against the Taliban, as governor of Helmand&#39;s ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rishi-sunak-faces-crucial-rwanda-vote-as-tory-mps-urge-him-to-abandon-bill-4441920",
        "title": "Rishi Sunak faces crucial Rwanda vote as Tory MPs urge him to abandon bill",
        "description": "Rishi Sunak is facing an uphill battle to pass his updated Rwanda strategy after Tory MPs urged him to abandon the bill. The Tory right believe the legislation doesn’t go far enough, and have now demanded the Prime Minister go back to the drawing board."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/stormont-financial-package-not-touch-28271395",
        "title": "Stormont financial package does not “touch the surface”, Michelle O&#39;Neill says",
        "description": "But Sinn Fein vice president Michelle O’Neill said the offer does not “touch the surface” of what is required in Northern Ireland while DUP leader Sir Jeffrey Donaldson said it does not go far enough."
    },
    {
        "url": "https://www.politics.co.uk/parliament/rwanda-plan-costs-likely-to-surpass-290-million-over-full-five-year-deal-home-office-official-admits/",
        "title": "Rwanda plan cost likely to surpass £290 million over full five year deal, Home Office admits",
        "description": "<b>Politics</b>.co.<b>uk</b> is the <b>UK</b>’s leading digital-only <b>political</b> website, providing comprehensive coverage of <b>UK politics</b>. Subscribe to our daily newsletter here."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844428/Nigel-Farage-Boris-Johnson-Tory-leadership",
        "title": "Nigel Farage hints at return to Tory party if Boris Johnson reaches out to him",
        "description": "Nigel Farage says there is &quot;not a cat&#39;s chance in hell&quot; of him joining Tories under Rishi Sunak - but he could still be tempted under different circumstances."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/northern-ireland-needs-long-term-solutions-not-dangled-baubles-95234/",
        "title": "Northern Ireland ‘needs long term solutions not dangled baubles’",
        "description": "All the parties who met with the Northern Ireland Secretary on Monday said the financial offer was not sufficient."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/23982896.george-charlotte-louis-join-kate-volunteer-baby-bank-charity/",
        "title": "George, Charlotte and Louis join Kate to volunteer at baby bank charity",
        "description": "The young royals also made a rare public outing on Friday when they joined their parents at Kate’s annual Christmas carol concert on Friday."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/gallery/pictures-one-year-anniversary-babbs-28270962",
        "title": "In pictures - One year anniversary of Babbs Mill as flowers and tributes left to boys",
        "description": "Flowers, a Christmas wreath and touching messages were among some of the tributes left to the four young Babbs Mill victims who lost their lives last year. December 11 marks one year since tragedy struck and claimed the lives of brothers Samuel, 6, and Finlay, 8, their older cousin Thomas, 11 and 10-year-old Jack Johnson."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/11/i-will-have-chat-boris-johnson-nigel-farage-conservatives/",
        "title": "I’ll have a chat if Boris Johnson gets in touch, says Nigel Farage",
        "description": "Former Ukip leader says there is ‘not a cat’s chance in hell’ of him joining Tories under Rishi Sunak, but leaves possible return open"
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/23982703.stage-screen-star-shirley-anne-field-dies-aged-87/",
        "title": "Stage and screen star Shirley Anne Field dies aged 87",
        "description": "The actress was brought to prominence in the 1960s following her role in The Entertainer opposite the late Laurence Olivier."
    },
    {
        "url": "https://www.uwe.ac.uk/news/academics-book-named-as-one-of-bbc-history-magazines-books-of-the-year",
        "title": "UWE Bristol academic&#39;s book chosen by BBC History Magazine as one of its Books of the Year",
        "description": "A book written by a UWE Bristol academic has been named as one of the BBC History Magazine’s Books of the Year 2023"
    },
    {
        "url": "https://www.irishnews.com/news/uknews/2023/12/11/news/key_points_from_rishi_sunak_s_evidence_to_the_covid_inquiry-3840573/",
        "title": "Key points from Rishi Sunak&#39;s evidence to the Covid inquiry",
        "description": "The Prime Minister was grilled about his role in the Government&#39;s pandemic response by lead counsel Hugo Keith KC on Monday."
    },
    {
        "url": "https://www.thetimes.co.uk/article/camerons-strop-reveals-post-brexit-uk-is-uncomfortable-in-its-own-skin-g0sh6wc0c",
        "title": "Cameron’s strop reveals post-Brexit <b>UK</b> is uncomfortable in its own skin",
        "description": "The Westminster government needs to learn that the presence of devolved ministers in international talks shows that Britain is a grown-up country"
    },
    {
        "url": "https://uk.movies.yahoo.com/snp-foreign-policy-play-acting-165733988.html",
        "title": "The SNP’s foreign policy play-acting is becoming an Orwellian farce",
        "description": "Pro-Union Scots will have expressed relief that the Foreign Secretary, Lord Cameron, has restated the Government’s opposition to SNP ministers using trips abroad to preach their own, “independent” foreign policy."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/uk-government-minded-seek-legal-31650537",
        "title": "<b>UK</b> Government &#39;minded&#39; to seek legal costs over gender reform court battle, says Alister Jack",
        "description": "Humza Yousaf was dealt a fresh blow on Friday after a judge ruled the UK Government did have the power to block controversial gender reforms."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/secretary-of-states-game-of-hide-and-seek-continues-as-first-day-of-talks-ends-without-agreement/a832015472.html",
        "title": "Secretary of State’s ‘game of hide-and-seek’ continues as first day of talks ends without agreement",
        "description": "The weather was cold and the reception was frosty as the leaders of the main political parties arrived for roundtable talks at Hillsborough Castle aimed at resolving Stormont’s spiralling finances."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12851379/Nigel-Farage-fires-warning-shot-Rishi-Sunak-Rwanda.html",
        "title": "Nigel Farage fires warning shot to Rishi Sunak over Rwanda as he hints at return to frontline <b>politics</b>: Ex-UKIP leader blasts &#39;cop out&#39; deal and urges Tory MPs to vote it down ...",
        "description": "The former Ukip and Brexit Party leader, now a reality TV contestant, lashed out at the plan after finishing third in the latest series of I&#39;m A"
    },
    {
        "url": "https://www.pig-world.co.uk/news/politicians-urged-to-back-uk-farming-policies-in-new-nfu-manifesto.html",
        "title": "Politicians urged to back <b>UK</b> farming policies in new NFU manifesto",
        "description": "An NFU manifesto published ahead of the next general election urges all political parties to back policies supporting British farming, among major asks for more focus on British food, environment, communities,"
    },
    {
        "url": "https://www.itv.com/news/utv/2023-12-11/government-offering-headline-grabbing-financial-package",
        "title": "<b>UK</b> Government offers funding package to help Northern Ireland return to stable financial footing",
        "description": "The UK Government has offered a financial package to help Northern Ireland return to a stable financial footing. | UTV News"
    },
    {
        "url": "https://www.marieclaire.co.uk/news/royal-news/kate-middleton-baby-banks-video",
        "title": "A new video shows Princess Kate donating boxes to Baby Banks with George, Charlotte and Louis",
        "description": "Yes, in a video released by the Prince and Princess of Wales, today, the three young royals can be seen driving with Kate to a baby bank and helping to hand over and sort through the boxes of donations."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/new-financial-package-on-offer-for-stormont-with-no-cut-off-date-but-revenue-raising-is-part-of-the-deal-4441802",
        "title": "New financial package on offer for Stormont - with no cut-off date - but revenue raising is part of the deal",
        "description": "Stormont parties were today offered cash to cover public sector pay rises, a ‘fiscal floor’ for a restored Executive and control over £600m the UK Government would have been spending here anyway – with no cut-off date."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-held-five-meetings-31650224",
        "title": "Humza Yousaf held five meetings at COP28 without <b>UK</b> Government official present, claims Alister Jack",
        "description": "David Cameron wrote to the SNP leader about a breach of protocol after he met Turkish President Recep Tayyip Erdogan last week."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-putin-us-funding-b2462221.html",
        "title": "On Ukraine’s frontline, Kyiv’s troops know US funding is vital to keep them alive",
        "description": "Delays in receiving shells and other weapons because of a political spat in Washington will only benefit Vladimir Putin and Russia, writes Askold Krushelnycky"
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/23982550.harry-told-must-pay-mail-sunday-lawyers-bills/",
        "title": "Harry told he must pay Mail on Sunday lawyers’ bills",
        "description": "Mr Justice Nicklin said the Duke of Sussex should pay Associated Newspapers Limited £48,447 ‘on account’ before the end of the year."
    },
    {
        "url": "https://www.bfi.org.uk/sight-and-sound/2023-year-british-cinema",
        "title": "2023: the year in British cinema",
        "description": "A particularly challenging year for the sector still saw plenty of reasons for optimism, with a host of striking debuts finding audiences alongside big-budget fare from heavyweights like Christopher Nolan and Ridley Scott."
    },
    {
        "url": "https://www.derrynow.com/news/northern-ireland/1369586/government-offers-financial-package-to-support-return-of-stormont-executive.html",
        "title": "Government offers financial package to support return of Stormont Executive",
        "description": "The Government has offered a financial package to help Northern Ireland return to a stable financial footing and support the return of the Stormont Executive. The pledge from Northern Ireland Secretary Chris Heaton-Harris came during talks with the region’s five main parties about"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/gary-lineker-grant-shapps-bbc-rwanda-brian-cox-b2462066.html",
        "title": "Lineker hits back after being criticised for expressing views on Rwanda scheme",
        "description": "Gary Lineker was at the centre of a BBC impartiality row after he voiced criticism of a new Government asylum seeker policy."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1844399/british-nigel-farage-suella-braverman-pact",
        "title": "British people &#39;are crying out for&#39; a Nigel Farage pact with Suella Braverman – pollster",
        "description": "With Nigel Farage expected to make a political comeback, a leading pollster has said that Britain wants him to strike a deal with Suella Braverman."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2023/12/11/psni-breach-wake-up-call-to-all-public-sector-organisations--chief-constable/",
        "title": "PSNI breach ‘wake-up call’ to all public sector organisations – chief constable",
        "description": "Police Service of Northern Ireland Chief Constable Jon Boutcher said every police force and every public sector organisation should read the report."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/national/23981239.tusk-expected-take-polands-pm-conservatives-give-power/",
        "title": "Tusk expected to take over as Poland’s PM as conservatives give up power",
        "description": "Former EU chief Mr Tusk is set to replace outgoing Mateusz Morawiecki months after the country held elections."
    },
    {
        "url": "https://www.ncl.ac.uk/press/articles/latest/2023/12/encounteringpoliticaltexts/",
        "title": "Encountering <b>political</b> texts",
        "description": "A new exhibition will highlight the ways that early political texts tried to influence readers and incite them into action - and the similarities with how political messages are communicated today."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/elon-musk-vows-lobotomize-ai-150156944.html",
        "title": "Elon Musk Vows to Lobotomize His AI So It Stops Being Left Wing",
        "description": "The mercurial CEO&#39;s comments were in response to a chart showing the results of a &quot;<b>Political</b> Compass Test,&quot; shared by research scientist David Rozado, which showed that Grok was even further left-leaning than OpenAI&#39;s ChatGPT. &quot;That chart exaggerates the ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/tusk-wins-vote-become-poland-175045840.html",
        "title": "Tusk Wins Vote to Become Poland’s Prime Minister in Pro-EU Shift",
        "description": "Donald Tusk was appointed to be Poland’s prime minister, kicking off a delayed transfer of power to pro-European Union parties almost two months after they secured a surprise electoral victory. Most Read from BloombergAbu Dhabi Is the World’s Newest Wealth Haven for BillionairesJack Ma’s Biggest E-Commerce Rival Is Coming for AmazonBitcoin’s 2023 Rally Frays During Brief 7."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mark-francois-mps-prime-minister-rwanda-erg-b1126236.html",
        "title": "Threat to Sunak’s authority grows as Tory MPs urge him to abandon Rwanda Bill",
        "description": "In their assessment, the ERG’s lawyers said: “The Prime Minister may well be right when he claims that this is the ‘toughest piece of migration legislation ever put forward by a <b>UK</b> Government’, but we do not believe that it goes far enough to ..."
    }
]