[
    {
        "url": "https://inews.co.uk/news/firm-post-office-scandal-yet-answer-2843812?ico=related_stories",
        "title": "Those responsible for Post Office scandal yet to answer",
        "description": "Anyone who watched ITV’s drama Mr Bates vs The Post Office will now know the extent to which the Horizon IT scandal has ripped up reputations, destroyed lives and inflicted financial ruin."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24036175.government-delays-north-sea-oil-legislation-due-lack-commons-time/",
        "title": "Government delays North Sea oil legislation due to lack of Commons time",
        "description": "Government legislation designed to maximise North Sea oil and gas production has been delayed to avoid it being rushed through its first stage in 45 minutes. The Offshore Petroleum Licensing Bill would require the industry regulator to run annual rounds for new oil and gas licences, subject to stringent new emissions and imports tests."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/michigan-vs-washington-live-stream-how-to-watch-cfp-national-championship-2024-online-from-anywhere",
        "title": "Michigan vs Washington live stream: how to watch CFP National Championship 2024 online from anywhere",
        "description": "You can watch a Michigan vs Washington live stream on Fox in the US. College football fans in Australia can watch CFP National Championship 2024 on Kayo Sports. In Canada, Michigan vs Washington is being shown on TSN, while viewers in the UK can tune in on Sky Sports. Full details below."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1853437/birmingham-homeless-car-Asda",
        "title": "&#39;I&#39;ve been living in my Vauxhall Astra for six months even though I&#39;ve got a job at Asda&#39;",
        "description": "Asked what he would like the authority to do, he replied: &quot;Without going into <b>politics</b>, put me somewhere ... A spokesperson for Birmingham City Council told Express.co.<b>uk</b>: &quot;We have been in contact with Mr Reynolds since July and have been attempting ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/08/serbian-opposition-leader-badly-beaten-after-apology/",
        "title": "Serbian opposition leader ‘savagely beaten by the secret service’",
        "description": "UK must stop &#39;appeasing&#39; hard-line Balkan government, says Tory MP as politician attacked after apologising for crimes against Albanians"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h3tgz7",
        "title": "Derek Draper: The Long Covid Struggle",
        "description": "Today, we look at how Covid-19 continues to affect people’s lives after the death of author and political adviser Derek Draper, husband of Kate Garraway. The TV presenter announced on Friday that the 56-year-old had died after living with extreme complications from Covid, and released a video message today thanking people for their support."
    },
    {
        "url": "https://www.stalbansreview.co.uk/news/national/24036067.snow-flurries-expected-across-england-amid-warning-ice/",
        "title": "More snow flurries expected across England, amid warning for ice",
        "description": "The Met Office said there would be snow flurries further west through Monday evening affecting parts of South West England into Tuesday morning."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24035888.post-office-scandal-horizon-error-led-west-boldon-allegations/",
        "title": "Post Office scandal: Horizon IT error led to West Boldon allegations",
        "description": "A former sub-postmaster who was once the youngest in the country has told how he was hounded for £88,000 for almost five years during the"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/08/rishi-sunak-conservatives-election-event-labour-keir-starmer-uk-politics-latest-updates?filterKeyEvents=false&page=with:block-659c5fd88f08bcbdc998e232",
        "title": "Government has ‘devised options’ to deal with outstanding Horizon convictions in Post Office scandal, minister says – <b>UK politics</b> live",
        "description": "Government hopes to soon be able to announce measures for resolving outstanding criminal convictions, business minister Kevin Hollinrake says"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-australia-67916228.amp",
        "title": "Australia puts republic referendum plan on hold",
        "description": "The comments follow last year&#39;s defeat for the government in a separate referendum, in which Australians overwhelmingly rejected a plan to give greater <b>political</b> rights to Indigenous ... to break away from the <b>UK</b> Royal Family &quot;longer term&quot;."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-labour-leader-sir-keir-starmer-faces-questions-on-sky-news-as-biggest-election-year-in-history-kicks-off-12593360?postid=7034042",
        "title": "<b>Politics</b> latest: Post Office accused of &#39;lying on industrial scale&#39; over IT scandal - as Rishi Sunak faces another by-election",
        "description": "On Sophy&#39;s panel tonight are: Richard Tice, leader of Reform <b>UK</b> and TV presenter; Anna Turley, former Labour MP. Watch live in the stream at the top of this page, and follow all the latest updates and key moments right here in the <b>Politics</b> Hub. Post Office ..."
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/american-sports/new-england-patriots-bill-belichick-31835069",
        "title": "New York Jets star makes Bill Belichick admission after ending New England Patriots&#39; year",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA ... You can report any errors to webhomepage@mirror.co.<b>uk</b>"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/patrick-roach-chris-heatonharris-secretary-of-state-northern-ireland-nasuwt-b2475092.html",
        "title": "Secretary of State urged to intervene before strike by public sector workers",
        "description": "The walkout on January 18 will be across the public sector and is expected to be one of the biggest strikes seen in recent history."
    },
    {
        "url": "https://www.irishnews.com/news/uk/fresh-by-election-headache-for-sunak-confirmed-as-skidmore-officially-resigns-O6LIU7AET5OORBU3HIXHH6X4KA/",
        "title": "Fresh by-election headache for Sunak confirmed as Skidmore officially resigns",
        "description": "The former minister was appointed to be Steward and Bailiff of the Three Hundreds of Chiltern under the archaic procedure."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/michael-mosleys-life-camera-psychopath-31835267",
        "title": "Michael Mosley&#39;s life off camera - &#39;psychopath&#39; traits to rarely-seen GP wife",
        "description": "He went on to study Philosophy, <b>Politics</b> and Economics at the University of Oxford and ... was met with criticism from <b>UK</b> eating disorder charity Beat, which stated that &quot;the programme caused enough stress and anxiety to our beneficiaries that we extended ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24035993.pro-indy-parties-will-judged-harshly-help-unionists-win/",
        "title": "Pro-indy parties will be judged harshly if they help Unionists win",
        "description": "However, the main issue for Scotland is how our political parties approach these elections, whenever they are. Will they act with conditioned reflexes like Pavlov’s dogs and repeat all the mistakes they learnt from the UK system?"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/08/farage-why-starmer-did-not-intervene-in-horizon-scandal/",
        "title": "Starmer must explain why he didn’t intervene in Horizon scandal, says Farage",
        "description": "Labour leader, director of public prosecutions when cases came to light, ‘has serious questions to answer’ claims ex-Ukip chief"
    },
    {
        "url": "https://inews.co.uk/opinion/late-flood-response-short-term-sunak-2843529",
        "title": "Late flood response is another symptom of ‘short-term Sunak’",
        "description": "Even at the height of his popularity in the autumn of 2019, Boris Johnson felt the backwash from a public who felt their leader was ignoring their sodden plight. “It’s took you over five days,” one woman heckled him on a belated trip to south Yorkshire. Footage of Johnson ineptly deploying a mop in a hairdressers in Derbyshire didn’t help either."
    },
    {
        "url": "https://news.sky.com/story/three-quarters-of-britons-think-country-in-a-worse-state-now-than-when-tories-came-to-power-13044239",
        "title": "Three quarters of Britons think country in a worse state now than when Tories came to power",
        "description": "After Tory MP Danny Kruger said his party faces &quot;obliteration&quot; because the UK is worse now than in 2010, a YouGov poll has suggested most Britons agree."
    },
    {
        "url": "https://www.nwemail.co.uk/news/national/24035949.red-sea-response-not-escalating-despite-uk-sending-new-warship---shapps/",
        "title": "Red Sea response not escalating despite <b>UK</b> sending in new warship – Shapps",
        "description": "The Defence Secretary told MPs that HMS Richmond is only being deployed to replace British vessels already patrolling the Red Sea."
    },
    {
        "url": "https://www.southwalesguardian.co.uk/news/24032721.martha-oneil-welsh-labours-carmarthenshire-candidate/",
        "title": "Martha O&#39;Neil on being Welsh Labour&#39;s Carmarthenshire candidate",
        "description": "Martha studied <b>politics</b> at Trinity College in Cambridge after being awarded ... Speaking on the levelling up project run by the <b>UK</b> Government, Martha said: “Levelling up hasn’t had a big levelling up effect in Wales at all. In fact, I would call ..."
    },
    {
        "url": "https://www.itv.com/news/2024-01-08/talking-politics-the-itv-news-podcast-analysing-the-weeks-biggest-issues",
        "title": "Talking <b>Politics</b> - the ITV News podcast analysing the week’s biggest <b>political</b> issues",
        "description": "Robert Peston and Anushka Asthana will be Talking <b>Politics</b> with Tom Bradby every Wednesday. Introducing... Talking <b>Politics</b>! The ITV News podcast to guide you through a massive election year. When will the prime minister go to the polls? How can Rishi ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-has-claimed-he-is-making-progress-on-his-5-pledges-to-voters-and-people-arent-convinced_uk_659bdff3e4b0bfe5ff640cdc?d_id=7155392&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Rishi Sunak Has Claimed He Is Making &#39;Progress&#39; On His 5 Pledges To Voters And People Aren&#39;t Convinced",
        "description": "However, revised figures last month showed that the economy actually shrunk by 0.1% between July and September, putting the <b>UK</b> at risk of going into a recession. Sky News <b>political</b> editor Beth Rigby was among those to cast doubt on the PM’s claims of ..."
    },
    {
        "url": "https://www.ft.com/content/33f85fd6-55ec-45a1-a1b6-69a845726d58",
        "title": "Investors warn on government debt levels in crucial election year",
        "description": "The <b>UK</b>, where an election is expected this year ... Scrutiny of debt levels comes in an historically busy year for elections that boosts the incentives for <b>political</b> leaders to raise spending. As the US gears up for its presidential election on November ..."
    },
    {
        "url": "https://uk.news.yahoo.com/daily-politics-briefing-january-8-062403889.html",
        "title": "Daily <b>politics</b> briefing: January 8",
        "description": "All the latest political developments in the UK, as Labour calls for the Prime Minister’s ethics adviser to investigate whether a minister broke the rules following claims he billed taxpayers for political campaigning purposes."
    },
    {
        "url": "https://www.independent.co.uk/news/antony-blinken-ap-israel-gaza-saudi-arabia-b2475230.html",
        "title": "US secretary of state rallies Mideast leaders to prepare for Gaza&#39;s post-war future",
        "description": "The leaders of those countries &quot;agreed to work together and to coordinate our efforts to help Gaza stabilize and recover, to chart a <b>political</b> path forward for the Palestinians and to work toward long-term peace, security and stability in the region as a ..."
    },
    {
        "url": "https://www.econotimes.com/contributors/estqi7ys",
        "title": "Dylan Sullivan",
        "description": "EconoTimes is a fast growing non-partisan source of news and intelligence on global economy and financial markets, providing timely, relevant, and critical insights for market professionals and those who want to make informed investment decisions."
    },
    {
        "url": "https://www.econotimes.com/contributors/29599",
        "title": "Richard Harris1",
        "description": "<b>UK</b> ban on boilers in new homes rules out hydrogen as a heating ... Once again, France finds itself in the grip of a <b>political</b> crisis. After the pension reform of June, which prompted more than one million people to take to the streets, president Emmanuel ..."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24035949.red-sea-response-not-escalating-despite-uk-sending-new-warship---shapps/",
        "title": "Red Sea response not escalating despite <b>UK</b> sending in new warship – Shapps",
        "description": "The Defence Secretary told MPs that HMS Richmond is only being deployed to replace British vessels already patrolling the Red Sea."
    },
    {
        "url": "https://www.ft.com/content/894aaa14-6fbe-4d88-8345-43f9f18c4b3b",
        "title": "Oil and gas executives leaned on to support controversial <b>UK</b> North Sea oil bill",
        "description": "The Offshore Petroleum Licensing Bill requires the North Sea Transition Authority, the industry regulator, to hold annual licensing rounds for drilling for oil and gas. But it has been dismissed as a political stunt given that the NSTA already carries out licensing rounds in most years as a matter of course."
    },
    {
        "url": "https://www.scotsman.com/news/politics/north-sea-gas-uk-government-insists-offshore-petroleum-licensing-bill-isnt-smoke-and-mirrors-amid-growing-backlash-4470734",
        "title": "North Sea gas: <b>UK</b> Government insists Offshore Petroleum Licensing Bill isn&#39;t &#39;smoke and mirrors&#39; amid growing backlash",
        "description": "Conservative figures are expected to rebel over the Offshore Petroleum Licensing Bill in a vote on Monday night"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24035871.scottish-independence-focus-child-poverty-instead/?ref=rss",
        "title": "Scottish independence: Let&#39;s focus on child poverty instead",
        "description": "OF all the former UK Prime Ministers still active in public life, only Gordon Brown has strived to improve the lives of those most in need of"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24035861.senior-minister-uk-space-launches-needed-mps-told/",
        "title": "Senior minister for <b>UK</b> space launches needed, MPs told",
        "description": "While UK Science Minister Andrew Griffith has the space sector within his portfolio, Mr Hammond said a cabinet-level role is needed. Mr Hammond told the committee he welcomed the space strategies published by the Scottish and UK Governments but felt more resources should be made available."
    },
    {
        "url": "https://uk.news.yahoo.com/rules-flying-palestinian-flag-uk-explained-173420242.html",
        "title": "The rules about flying the Palestinian flag in the <b>UK</b>, explained",
        "description": "As an east London council faces a legal challenge over Palestinian flags left hanging on lampposts, here&#39;s what we know about the UK&#39;s laws on displaying flags."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-67916648.amp",
        "title": "Republicans seek contempt charges for Hunter Biden",
        "description": "House Republicans have recommended that Hunter Biden be charged with contempt of Congress, after he refused to appear at a closed doors hearing last month. Mr Biden was subpoenaed to testify privately about his business dealings for the impeachment case against his father, President Joe Biden."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/08/foreign-diplomats-stress-need-for-free-fair-and-inclusive-elections/",
        "title": "Foreign diplomats stress need for ‘free, fair and inclusive’ elections",
        "description": "ISLAMABAD: Diplomats from United States (US) and the United Kingdom (UK) on Monday emphasised the need to hold fair elections on February 8.Diplomats from both the countries made the emphasi"
    },
    {
        "url": "https://www.leaderlive.co.uk/news/24035736.crews-attend-three-chimney-weekend-fires-wrexham/",
        "title": "Crews attend three chimney weekend fires in Wrexham",
        "description": "PEOPLE are urged to use chimneys safely after three weekend fires in Wrexham. North Wales Fire and Rescue Service (NWFRS) said it attended chimney fires in Chirk, Overton and Holt over the weekend."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/andrew-mitchell-israel-gaza-hamas-commons-b1131030.html",
        "title": "‘Stark’ famine risk as <b>UK</b> lobbies Israel to allow more aid to reach Gaza",
        "description": "Britain is lobbying Israel “hard and regularly” to ensure more humanitarian aid reaches Gaza, amid warnings the risk of famine is “stark”. Foreign Office minister Andrew Mitchell said there are “numerous constraints” that are “hindering” the efforts of the UK and others to help Gazan civilians."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/24028795.proposed-gas-works-andover-road-rescheduled/",
        "title": "Proposed gas works on Andover road to be rescheduled",
        "description": "&quot;I’ve heard from the project team that the start date has been delayed and we’ll be in touch with residents once work has been rescheduled.&quot; The Advertiser has asked SGN why the works have been delayed. More information can be found at sgn.co.<b>uk</b>/."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-left-out-suits-31834984.amp",
        "title": "Meghan Markle left out of Suits reunion as co-stars make confession at Golden Globes",
        "description": "Meghan Markle has reportedly been left out of the Suits reunion despite portraying lead character Rachel Zane in the show, as her co-stars admit they can&#39;t reach her"
    },
    {
        "url": "https://www.scotsman.com/news/politics/humza-yousaf-im-not-selling-voters-rivers-of-milk-and-honey-after-independence-4470607",
        "title": "Humza Yousaf: I’m not selling voters ‘rivers of milk and honey’ after independence",
        "description": "Humza Yousaf has said he is not selling voters “rivers of milk and honey” after independence as he set out his views on industrial policy in an independent Scotland. In a speech at Glasgow University, the First Minister said dramatic changes would not happen “overnight” and there would be “difficulties” during the transition process."
    },
    {
        "url": "https://www.bedfordtoday.co.uk/read-this/idris-elba-youth-violence-zombie-knives-machetes-4470590",
        "title": "Watch: Idris Elba calls for immediate ban on zombie knives and machetes to reduce youth violence",
        "description": "Video: A &quot;massive education&quot; around knife crime is needed, said actor Idris Elba during a protest in Parliament Square."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/more-elections-2024-ever-heres-164401109.html",
        "title": "There will be more elections in 2024 than ever before – here&#39;s how it could affect financial markets",
        "description": "The evidence is very mixed on how markets are affected by elections, but that doesn’t mean they’ll be irrelevant in 2024."
    },
    {
        "url": "https://www.itv.com/news/utv/2024-01-08/will-ni-be-ballot-box-bound-if-executive-not-restored-this-january",
        "title": "As Stormont election deadline looms DUP says <b>UK</b> government talks &#39;resume&#39; this week",
        "description": "January is a key month with a deadline for calling an election coinciding with a massive public sector strike. | UTV News"
    },
    {
        "url": "https://www.edp24.co.uk/news/24029755.83ft-dutch-barge-set-return-oulton-broad-lowestoft/",
        "title": "83ft Dutch barge set to return to Oulton Broad in Lowestoft",
        "description": "An 83ft Dutch barge, which was set to be scrapped, has been given a last minute reprieve - as it returns to Lowestoft this week."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24035592.civil-service-chief-simon-case-back-work-illness/",
        "title": "Civil service chief Simon Case back at work after illness",
        "description": "The UK’s top civil servant, Simon Case, has returned to work following illness and could be called to give evidence to the Covid inquiry about his scathing views on Boris Johnson’s administration."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11764905/swg3-cancels-nightclub-events-teen-drug-tragedy-rave/",
        "title": "SWG3 cancels all nightclub events after teen drug tragedy at Glasgow New Year rave",
        "description": "A CRISIS-HIT nightclub has axed all raves this month following the third suspected ecstasy death in four months of a teenage reveller at a New Year’s bash. SWG3 in Glasgow has cancelled the late"
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/24035023.political-map-wokingham-redrawn-2024-election/",
        "title": "<b>Political</b> map of Wokingham redrawn for 2024 election",
        "description": "The political map of Wokingham, the Reading suburbs and surrounding villages has been redrawn ahead of the full council election coming this May."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/liberal-democrats-announce-candidate-for-new-east-grinstead-and-uckfield-seat-in-next-general-election-4470546",
        "title": "Liberal Democrats announce candidate for new East Grinstead and Uckfield seat in next general election",
        "description": "The Liberal Democrats have announced that they have selected an environmental policy expert to be their MP candidate for the new constituency of East Grinstead and Uckfield."
    },
    {
        "url": "https://arynews.tv/next-uk-govts-budget-is-hostage-to-economy/",
        "title": "Next <b>UK</b> govt’s budget is hostage to economy",
        "description": "UK&#39;s next government will have little room to cut taxes or increase spending - at least according to bleak forecasts from the country&#39;s budget office. But"
    },
    {
        "url": "https://morningstaronline.co.uk/article/scotlands-polluted-politics-revealed",
        "title": "Scotland&#39;s ‘polluted <b>politics</b>’ revealed",
        "description": "“A just transition to a safe climate future can only be achieved if we end the pollution of our <b>politics</b> by fossil fuel companies.” Offshore Energies <b>UK</b>’s Jenny Stanning said: “We will continue to engage proactively with Scottish ..."
    },
    {
        "url": "https://www.business-live.co.uk/commercial-property/eldon-square-owners-warn-future-28411011",
        "title": "Eldon Square owners warn on future valuations despite revenue rise",
        "description": "The well-documented collapse of a number of retailers before, during and following the pandemic – including Top Shop, Monsoon, Dorothy Perkins, Paperchase and Debenhams – has affected shopping centre property valuations around the <b>UK</b> and Eldon Square ..."
    }
]