[
    {
        "url": "https://www.thetimes.co.uk/article/british-hospitals-russian-hackers-cyber-attack-easy-target-nhs-7bl25k6kd",
        "title": "NHS hospitals ‘easy targets’ for Russian hackers",
        "description": "British hospitals are an easy target for Russian hackers and the <b>UK</b> should be braced for a catastrophic attack on its critical national infrastructure, a report warns. Medical technology has not kept pace with the cyberthreat meaning that hospitals ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/tyrant-vladimir-putin-poses-mortal-32173896",
        "title": "&#39;Tyrant Vladimir Putin poses mortal danger to Britain - he can’t be ignored&#39;",
        "description": "Campaigner Bill Browder - thought to be top of the Kremlin&#39;s kill list in the UK - is right to warn of the threat Vladimir Putin poses and cannot be ignored, says the"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-harry-say-theyre-counting-32172475",
        "title": "Meghan and Harry say they&#39;re &#39;counting down the days&#39; until they can return to Canada",
        "description": "Meghan Markle and Prince Harry have said that they are &#39;counting down the days&#39; until they can return to Canada, following a fun-filled trip to Vancouver"
    },
    {
        "url": "https://www.stirlingnews.co.uk/news/national/24133106.lib-dems-call-extra-1bn-farming-budget-bid-win-rural-votes/",
        "title": "Lib Dems call for extra £1bn for farming budget in bid to win rural votes",
        "description": "The party is also calling for ‘arbitrary’ visa salary thresholds to be abandoned in order to help plug workforce gaps in the food sector."
    },
    {
        "url": "https://www.thetimes.co.uk/article/609a5a2f-e1c1-4c2e-9c5a-e9aeec2f657d?shareToken=cd42b151f47958457c7c76d9a6c3547a",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "In a speech to the National Farmers’ Union on Tuesday, Sunak will promise to put food security at the “top of the agenda” by committing to a <b>UK</b>-wide index to measure ... s veneer it is still about the <b>politics</b> of misplaced envy and class war.”"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106097/GRAHAM-GRANT-sop-Nationalists-proved-flop-viewers.html",
        "title": "GRAHAM GRANT: A sop to the Nationalists that proved a flop with viewers",
        "description": "<b>UK</b> and international, using a team based in Scotland. That idea was binned after a viewer backlash and amid fears it would be exploited as a <b>political</b> plaything, leaving the way clear for The Nine. Inevitably, it didn’t have the budget to perform the ..."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-ill-stay-on-as-scotlands-first-minister-if-snp-loses-seats-at-the-uk-general-election",
        "title": "Yousaf: I&#39;ll stay on as FM if SNP loses seats at general election",
        "description": "“I don’t know any other <b>political</b> leader who would win a general election and ... could with SNP MPs at Westminster “making sure we put these issues to a future <b>UK</b> Labour government”."
    },
    {
        "url": "https://inews.co.uk/opinion/editor/diplomat-prince-william-treads-fine-line-gaza-ceasefire-2917244",
        "title": "Diplomat Prince William treads fine line in push for a Gaza ceasefire",
        "description": "As we report on inews.co.uk, the Prince intervened in what was a co-ordinated push with the UK Foreign Office, echoing the words of Foreign Secretary Lord Cameron. It’s part of the attempt by Western leaders to dissuade Israel from launching an offensive in Rafah that is likely to cost many more civilian lives."
    },
    {
        "url": "https://news.sky.com/story/father-whose-babys-birth-certificate-was-defaced-says-being-jewish-in-uk-is-getting-worse-13076282",
        "title": "Father whose baby&#39;s birth certificate was &#39;defaced&#39; says &#39;being Jewish in <b>UK</b> is getting worse&#39;",
        "description": "Israel, who says the word &#39;Israel&#39; was altered on his five-month-old daughter&#39;s birth certificate, tells Sky News &quot;London is not London anymore&quot; and he feels &quot;unsafe&quot;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/vladimir-putins-death-squads-will-32173692",
        "title": "Vladimir Putin&#39;s death squads &#39;will launch killing spree against <b>UK</b> enemies&#39;",
        "description": "Bill Browder claims that, in the wake of Alexei Navalny’s death, the despot has a hit list of at least 12 targets."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106329/voters-tough-immigration-political-parties-preserve-right.html",
        "title": "Voters are tougher on immigration than all of the main <b>political</b> parties and back policies often seen as the preserve of the Right, poll finds",
        "description": "A survey of more than 13,000 adults found that almost two-thirds want more restrictions on immigration, including slim majorities of Labour and Liberal Democrat voters."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68354256.amp",
        "title": "Pakistan election: PMLN and PPP reach agreement on coalition government",
        "description": "It comes after a contentious election where the largest party led by former-PM Imran Khan alleged vote-rigging."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68346129",
        "title": "Labour calls for immediate humanitarian ceasefire in Gaza for first time",
        "description": "Shadow foreign secretary David Lammy says the party&#39;s call mirrors the language of the UN and international allies."
    },
    {
        "url": "https://www.heraldscotland.com/news/24133000.starmer-faces-new-rebellion-labour-mps-snp-ceasefire-motion/?ref=rss",
        "title": "Starmer faces new rebellion from Labour MPs over SNP ceasefire motion",
        "description": "Sir Keir Starmer could still face a rebellion from his own MPs, despite backing calls call for an &quot;immediate humanitarian ceasefire&quot;"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24125618.famous-folk-musician-martin-simpson-perform-twyford/",
        "title": "Famous folk musician Martin Simpson to perform in Twyford",
        "description": "WORLD-RENOWNED touring folk musician, Martin Simpson, will play St Mary’s Church in Twyford for an intimate solo set this spring."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/israel-hamas-war-labour-finally-shifts-its-ceasefire-stance-but-may-have-fallen-into-a-trap/",
        "title": "Israel-Hamas war: Labour finally shifts its ceasefire stance - but may have fallen into a trap",
        "description": "So the revised position had two goals - to try and sooth some anger in parts of the Labour movement over Sir Keir&#39;s decision to stand with Israel as it invaded Gaza, and to deal with the tactical challenge posed by Wednesday&#39;s votes and stop Labour MPs siding with the Scottish opposition."
    },
    {
        "url": "https://news.sky.com/story/politics-live-lord-david-cameron-vows-to-help-protect-falklands-during-visit-to-islands-12593360?postid=7260905",
        "title": "<b>Politics</b> live: Westminster gearing up for contentious vote on Gaza ceasefire",
        "description": "The next guest on tonight&#39;s edition of <b>Politics</b> Hub With Sophy Ridge is the SNP&#39;s Westminster ... He replies: &quot;The only reason that we are having this discussion tonight, the only reason that the <b>UK</b> parliament is talking about the situation in Gaza ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/20/father-jewish-birth-certificate-defaced-home-office-vetted/",
        "title": "Father of Jewish baby whose birth certificate was &#39;defaced&#39; by Home Office demands civil servants be vetted",
        "description": "The father of a Jewish baby whose birth certificate was returned defaced from the Home Office has demanded that all civil servants are vetted again."
    },
    {
        "url": "https://news.stv.tv/politics/uk-plans-to-maximise-north-sea-oil-and-gas-production-move-closer-to-becoming-law",
        "title": "Plans to maximise oil and gas production move closer to becoming law",
        "description": "Labour and the SNP criticised the UK Government’s bid, with an opposition frontbencher branding it &#39;political posturing&#39;."
    },
    {
        "url": "https://www.telegraph.co.uk/royal-family/2024/02/20/teddies-st-edwards-marlborough-school-prince-george-waleses/",
        "title": "The public schools that Prince George could attend – and how the people in charge compare",
        "description": "As the future king prepares for secondary education, the Prince and Princess of Wales have their eyes on two excellent institutions"
    },
    {
        "url": "https://www.lbc.co.uk/news/labours-ceasefire-motion-broader-and-goes-further-than-the-snp-david-lammy/",
        "title": "&#39;I want to do what is right&#39;: Labour&#39;s ceasefire motion is &#39;broader&#39; and &#39;goes further&#39; than the SNP&#39;s, says David Lammy",
        "description": "It&#39;s thorough… That is what the <b>UK</b> Parliament should be doing. This is too serious to play partisan <b>politics</b> about, way too serious.’ No 10 said it was not yet able to set out how the government planned to vote on Wednesday&#39;s SNP motion. A spokeswoman ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24133028.charles-miss-memorial-service-second-cousin-last-king-greece/",
        "title": "Charles to miss memorial service for second cousin the last king of Greece",
        "description": "The Queen will lead the royal family at St George’s Chapel on February 27 in honour of Constantine II, who died last year."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24129976.north-shields-teenage-cancer-trust-one-day-music-festival/",
        "title": "North Shields Teenage Cancer Trust one-day Music Festival",
        "description": "Another injection of 90&#39;s classics will come courtesy of the <b>UK</b>’s leading Britpop band, The National Anthems. The dynamic group who has toured throughout the country, will cover chart-toppers from Oasis, The Verve, Stone Roses, Shed 7, and more."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868842/royal-family-political-statements-snapshot",
        "title": "Five times the Royal Family have controversially waded into <b>politics</b>",
        "description": "The Royal Family is expected to stay out of <b>politics</b> and refrain from giving their personal opinion ... Diana was outspoken about the need to ban “the plague on earth” and described the <b>UK</b> government’s policy on landmines as “hopeless”."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/sport/other-sport/horse-racing/grand-national-2024-trainers-reaction-28671914",
        "title": "Grand National 2024: trainers&#39; reaction to Aintree weights",
        "description": "Selected trainers react to the reveal of the weights for the Grand National at the traditional lunch in St George&#39;s Hall"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/blanket-20mph-speed-limits-working-says-welsh-government-110984/",
        "title": "Blanket 20mph speed limits working, says Welsh government",
        "description": "Every day, five people die on <b>UK</b> roads and speed is a factor in every crash Ross Moorlock, Brake Research undertaken by the Transport Research Laboratory, a transport consultancy, in 2000 suggested there is an average 6% reduction in collisions with each ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-demands-cabinet-office-investigation-183200479.html",
        "title": "Labour demands Cabinet Office investigation into claims made by former Post Office chair Henry Staunton",
        "description": "<b>Politics</b> live: Sunak welcomes royal intervention on Gaza - as Labour shifts stance on calls for ceasefire Later that evening, Mr Staunton hit back at what he called Ms Badenoch&#39;s &quot;astonishing&quot; claims and said he stood by his assertion that he had been told ..."
    },
    {
        "url": "https://uk.news.yahoo.com/timeline-alexei-navalny-life-activism-214157941.html",
        "title": "Timeline of Alexei Navalny’s life and activism",
        "description": "Russian opposition leader Alexei Navalny had a long history of <b>political</b> activism and anti-corruption advocacy from leading protests to publishing exposés of government fraud. But his fight was cut short. Navalny died in an Arctic penal colony at age 47 ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/20/chose-mp-now-child-a-panic-button-20312944/?ico=trending-module_tag_instagram-stories_item-5",
        "title": "I chose to be an MP but now my child has to have a panic button in their bedroom",
        "description": "Of course – I know in the <b>UK</b>, despite all the problems I’ve had as an MP, we are lucky. This is not Putin’s Russia, <b>political</b> opposition and debate is welcome and encouraged. While critics may gather in the dead of night outside our houses ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/being-jewish-uk-getting-worse-145600732.html",
        "title": "&#39;Being Jewish in <b>UK</b> is getting worse&#39;: Father&#39;s anger after baby&#39;s birth certificate &#39;defaced&#39;",
        "description": "<b>Politics</b> live: Labour&#39;s Lammy asked five times for details of Gaza ceasefire call Referencing a rise in antisemitism in the <b>UK</b>, the father-of-three said: &quot;The situation here is not good. To be Jewish in the <b>UK</b> is very hard. And it&#39;s not getting better ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/alexei-navalny-wife-yulia-putin-brother-death-b2499262.html?page=7",
        "title": "Alexei Navalny death latest: X restores wife Yulia’s account as Putin brings new case against critic’s brother",
        "description": "The <b>UK</b> should refuse to recogise the upcoming Russian presidential ... But Dr Ben Noble, co-author of a biography on Navalny and an associate professor of Russian <b>politics</b> at UCL, said: “If Western governments were not to recognise the election as ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/19/kemi-badenoch-post-office-scandal-alexei-navalny-uk-politics-live?filterKeyEvents=true&page=with:block-65d36a2b8f08955f59f82ca0",
        "title": "Minister says government working on sanction options for those involved in Alexei Navalny’s death – as it happened",
        "description": "In a campaign speech delivered in Aberdeen, the <b>UK</b>’s oil capital, Scotland’s first minister accused Labour of risking 100,000 jobs after Keir Starmer promised a “proper” windfall tax on oil and gas firms this month when he scaled back his party’s ..."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24132985.lancashire-couple-revealed-winners-61m-euromillions-jackpot/",
        "title": "Lancashire couple to be revealed as winners of £61m EuroMillions jackpot",
        "description": "The <b>UK</b> winners of a £61 million EuroMillions jackpot will be revealed on Wednesday. A lucky couple from Lancashire won a £61,708,231 share of the £123 million jackpot prize from the draw on January 30 – with the other winning ticket having been bought ..."
    },
    {
        "url": "https://www.ft.com/content/373b7ab9-2a51-4db3-a0f5-2d021155c778",
        "title": "Canada contradicts Kemi Badenoch claims on ‘ongoing’ trade talks",
        "description": "Latest spat for business secretary as Ottawa’s diplomat in London writes to MPs saying no negotiations happening"
    },
    {
        "url": "https://www.bbc.co.uk/mediacentre/2024/bbc-scotland-broadcast-news-digital-impact",
        "title": "BBC Scotland announces plans to reshape broadcast news and grow digital impact in election year",
        "description": "The changes are designed to grow the impact of broadcast news services in Scotland whilst offering audiences more ways to watch and listen to news and current affairs output across all our services"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868856/Labour-triple-lock-pensions-policy-warning",
        "title": "Campaigners warn not to believe Labour triple lock pledge until it&#39;s in black and white",
        "description": "The Tories have said pensioners will take Labour&#39;s latest policy with a big pinch of salt, given previous U-turns."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/julian-assange-hearing-wikileaks-extradition-news-latest-b2499421.html",
        "title": "Julian Assange - latest: Wikileaks founder misses first day of extradition hearing as crowds rally in support",
        "description": "Julian Assange is facing a second day in the High Court as part of long-standing battle against extradition to the US, where he is accused of leaking confidential military secrets."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24132958.tesco-display-unit-pricing-clubcard-deals-consumer-group-criticism/",
        "title": "Tesco to display unit pricing on Clubcard deals after consumer group criticism",
        "description": "The lack of unit pricing on Tesco’s Clubcard offers was a glaring omission and we warned that this approach could be breaking the law last summer, so it’s good to see the nation’s largest supermarket stepping up to do the right thing by making this important change"
    },
    {
        "url": "https://inews.co.uk/news/world/david-cameron-falklands-provocation-2915280?ico=in-line_link",
        "title": "David Cameron’s visit to Falklands a ‘provocation’, says Argentine official",
        "description": "The Foreign Secretary said he was visiting the South Atlantic archipelago to make clear the territory was &#39;a valued part of the British family&#39;"
    },
    {
        "url": "https://www.thetimes.co.uk/article/borders-chief-sacked-for-revealing-security-threat-from-private-jet-passengers-2k8n2nbs5",
        "title": "Borders chief sacked for revealing security threat from private jet passengers",
        "description": "The home secretary has fired the border watchdog boss for leaking reports showing thousands arriving by private jet are avoiding physical passport checks"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/bas-javid-immigration-enforcement-rwanda-sajid-brother/",
        "title": "Bas Javid: ‘The policy of using a third country is right – it’s not for me to say if Rwanda’s right’",
        "description": "The man tackling the immigration crisis explains how his background makes him a good fit – and why he leaves politics to his brother Sajid"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24131339.anas-sarwar-right-channel-inner-thatcher/",
        "title": "Is Anas Sarwar right to channel his inner Thatcher?",
        "description": "For us, the most seismic <b>political</b> event of the 1990s was not the birth of New ... to “deliver on people’s aspirations and dreams”. If the <b>UK</b> economy was performing better, as it was in the period following the 1997 general election for example ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/labour-calls-for-immediate-ceasefire-in-gaza-for-first-time/",
        "title": "Labour calls for &#39;immediate ceasefire&#39; in Gaza for first time",
        "description": "Labour has called for an immediate ceasefire in Gaza for the first time, saying the situation there is intolerable."
    },
    {
        "url": "https://www.politics.co.uk/parliament/offshore-petroleum-licensing-bill-clears-final-house-of-commons-stages/",
        "title": "Offshore Petroleum Licensing Bill clears final House of Commons stages",
        "description": "The government’s Offshore Petroleum Licensing Bill cleared its final House of Commons stages today, with 285 MPs voting in favour of the legislation at third reading and 218 MPs voting against. The legislation would place the North Sea Transition Authority under a duty to run annual applications for new offshore oil and gas licences."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868867/Rishi-Sunak-commits-to-introducing-assisted-dying-laws-if-MPs-want-change",
        "title": "Rishi Sunak commits to introducing assisted dying laws if MPs want change",
        "description": "“But it’s important for everyone to understand, it’s not a party <b>political</b> issue ... about the need for safe access to medically assisted dying in the <b>UK</b> for those nearing the end of their lives with no hope of a cure. David wrote to the Commons ..."
    },
    {
        "url": "https://news.sky.com/story/home-office-fires-chief-inspector-of-borders-and-immigration-david-neal-13076361",
        "title": "Home Office fires chief inspector of borders and immigration David Neal",
        "description": "The Home Office has fired the chief inspector of borders and immigration who claimed UK Border Force had failed to check the occupants of hundreds of private jets at a London airport."
    },
    {
        "url": "https://www.thenational.scot/news/24132884.uk-government-fails-call-gaza-ceasefire-ahead-key-vote/",
        "title": "<b>UK</b> Government fails to call for Gaza ceasefire ahead of key vote",
        "description": "THE UK Government has failed to call for a ceasefire in Gaza as it stuck by Israel despite mounting international criticism of its ally."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/enough-is-enough-moray-community-besieged-by-wind-farms-342770/",
        "title": "The Cabrach in Moray &quot;besieged&quot; by wind farms in fight to protect future",
        "description": "A &quot;fragile&quot; Moray community say they have &quot;exhausted all avenues&quot; as they try to prevent further developments."
    },
    {
        "url": "https://faroutmagazine.co.uk/?p=474883",
        "title": "The classic song John Lennon wrote and recorded in 24 hours",
        "description": "Towards the end of his days with The Beatles and the beginning of his solo career, Lennon explored rhetorical, often politically pertinent material. In a spontaneous burst of creativity on January 27th,"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24132835.immigration-watchdog-sacked-amid-home-office-row-border-security-concerns/",
        "title": "Immigration watchdog sacked amid Home Office row over border security concerns",
        "description": "David Neal ‘breached’ the terms of his appointment and was informed his time in post was being immediately terminated."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/24132855.wrexham-council-tax-rise-9-9-moves-step-closer/",
        "title": "Wrexham council tax rise of 9.9% moves step closer",
        "description": "“It&#39;s important that everybody canvases their MS’s and MPs in Westminster and Cardiff that there is appropriate funding for public services across the <b>UK</b> because this is devastating ... done is that we have come to a <b>political</b> decision and set it ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/some-people-said-like-turkeys-28666196",
        "title": "&#39;Some people said it was like turkeys voting for Christmas... they were right&#39;",
        "description": "Hannah, 34, said: “Some people said it was like turkeys voting for Christmas, and they were right. Me? I didn’t vote Conservative and I never will. Why people thought the Conservatives would do anything for Leigh is beyond me.”"
    },
    {
        "url": "https://uk.news.yahoo.com/schism-over-russia-drives-republicans-222043718.html",
        "title": "Schism over Russia drives Republicans apart",
        "description": "Liz Cheney, who was all but run out of the party for opposing Trump, said Johnson currently wields a rare power in US <b>politics</b> since he could singlehandedly secure funding for Ukraine by simply allowing a vote on legislation passed through the Senate ..."
    },
    {
        "url": "https://uk.style.yahoo.com/historians-rank-donald-trump-worst-171335231.html",
        "title": "Historians Rank Donald Trump Worst U.S. President Again, with Biden in 14th Place",
        "description": "Abraham Lincoln came out on top among scholars as the nation’s greatest president, with Joe Biden debuting at 14 on the list"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-labour-fights-its-ceasefire-war/",
        "title": "London Playbook PM: Labour fights its ceasefire war",
        "description": "UKRAINE ROW LATEST: Home Office Minister Tom Pursglove told the Commons it was “deliberate scaremongering” to suggest the government had reduced access for Ukrainians hoping to flee war to the U.K. Downing Street also insisted changes this week to application routes for Ukrainian refugees do not reduce eligibility."
    },
    {
        "url": "https://www.thenational.scot/news/24132645.scottish-tories-undermined-uk-announces-short-term-let-scheme/",
        "title": "Scottish Tories ‘undermined’ as <b>UK</b> announces short term let scheme",
        "description": "THE Scottish Conservatives opposition to short term let regulation in Scotland has been “undermined” after the UK Government announced it"
    },
    {
        "url": "https://www.joe.co.uk/politics/ex-bbc-editor-reveals-biases-on-political-programmes-422624",
        "title": "Ex-BBC editor reveals biases on <b>political</b> programmes",
        "description": "Former BBC editor Rob Burley has said there is a centre-left, liberal bias at the broadcaster, just like in most newsrooms in the country."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24132148.greenpeace-activists-charged-criminal-damage-protest-pms-home/",
        "title": "Greenpeace activists charged with criminal damage after protest at PM’s home",
        "description": "After the charging decision was announced, Greenpeace <b>UK</b> <b>political</b> campaigner, Ami McCarthy, said: “After being under investigation for six months, our activists have now been charged with criminal damage for holding a completely peaceful protest."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/20/post-office-horizon-scandal-conservatives-kemi-badenoch-rishi-sunak-uk-politics-live?page=with:block-65d4dfcc8f0814397b234b79",
        "title": "SNP welcomes Labour call for ‘immediate humanitarian ceasefire’ in Gaza, claiming it forced Starmer into U-turn – <b>UK politics</b> live",
        "description": "Stephen Flynn says decision by Labour is ‘long-overdue’ and Starmer was forced into position by public pressure and the SNP You must be 18 or over to fill in this form. We will only use this data for the purpose of improving our live blogs. For more ..."
    },
    {
        "url": "https://www.ft.com/content/3a5ec92f-248e-4683-9485-09e4a86a18ef",
        "title": "Julian Assange launches final appeal against US extradition",
        "description": "Lawyers acting for the WikiLeaks founder, whose website published secret military logs and diplomatic cables that revealed US activity in Iraq and Afghanistan, told the High Court in London that he would face a “flagrant denial of justice” if the <b>UK</b> ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/what-happens-next-in-julian-assanges-legal-case-142147206.html",
        "title": "What happens next in Julian Assange&#39;s legal case?",
        "description": "He was granted <b>political</b> asylum at the Ecuadorian embassy in London in ... In June 2019, the US Justice Department asked the <b>UK</b> to extradite him to the United States to face 18 charges that he conspired to hack US government computers and violated ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/welsh-labour-welsh-government-uk-government-senedd-b1140449.html",
        "title": "Blanket 20mph speed limits working, says Welsh government",
        "description": "Every day, five people die on <b>UK</b> roads and speed is a factor in every crash Ross Moorlock, Brake Research undertaken by the Transport Research Laboratory, a transport consultancy, in 2000 suggested there is an average 6% reduction in collisions with each ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-immediate-ceasefire-gaza-israel-war-keir-starmer-wlzsfrw6w",
        "title": "Labour calls for ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "In an escalation of language that diverges from the <b>UK</b> government’s position, Labour urged both Israel and Hamas to put down their weapons and end a four-month battle immediately. The intervention before a crunch vote on Wednesday in parliament appeared ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/father-whose-babys-birth-certificate-was-defaced-says-being-jewish-in-uk-is-getting-worse/",
        "title": "Father whose baby&#39;s birth certificate was &#39;defaced&#39; says &#39;being Jewish in <b>UK</b> is getting worse&#39;",
        "description": "<b>Politics</b> live: Labour&#39;s Lammy asked five times for details of Gaza ceasefire call Referencing a rise in antisemitism in the <b>UK</b>, the father-of-three said: &quot;The situation here is not good. To be Jewish in the <b>UK</b> is very hard. And it&#39;s not getting better ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24132985.lancashire-couple-revealed-winners-61m-euromillions-jackpot/",
        "title": "Lancashire couple to be revealed as winners of £61m EuroMillions jackpot",
        "description": "The <b>UK</b> winners of a £61 million EuroMillions jackpot will be revealed on Wednesday. A lucky couple from Lancashire won a £61,708,231 share of the £123 million jackpot prize from the draw on January 30 – with the other winning ticket having been bought ..."
    },
    {
        "url": "https://www.politicshome.com/thehouse/article/offshore-petroleum-licensing-bill-answer-britains-problems",
        "title": "New oil and gas licences signal Britain is not serious about tackling climate change",
        "description": "We’re not even two months into the year and multiple storms have already caused not just property damage and business disruption across the"
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/east-lothian-residents-face-10-28671045",
        "title": "East Lothian residents face 10% council tax rise next year after freeze approved",
        "description": "The Scottish Government has offered local authorities who freeze council tax this year additional funding but cuts still needed to balance the budget"
    }
]