[
    {
        "url": "https://www.newsletter.co.uk/news/people/veteran-northern-ireland-political-journalists-ken-reid-and-stephen-grimason-honoured-by-queens-university-belfast-4493473",
        "title": "Veteran Northern Ireland <b>political</b> journalists Ken Reid and Stephen Grimason honoured by Queen&#39;s University Belfast",
        "description": "Former UTV <b>political</b> editor Ken Reid and BBC Northern Ireland <b>political</b> ... until unionist concerns over post-Brexit trading arrangements are addressed by the <b>UK</b> government. Speculation has been growing in recent days that Sir Jeffrey Donaldson’s party ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/severn-barrage-project-could-provide-28512034",
        "title": "Severn Barrage project that could provide up to 10% of the <b>UK</b>&#39;s electricity back on the agenda",
        "description": "The Western Gateway Partnership has established an independent commission to assess the feasibility of a barrage that would costs tens of billions to construct"
    },
    {
        "url": "https://www.scotsman.com/news/politics/analysis-from-fking-clowns-to-covid-policy-whatsapps-are-giving-us-a-valuable-insight-4493468",
        "title": "Analysis: From f**king clowns to Covid policy, WhatsApps are giving us a valuable insight",
        "description": "For one thing, Ms Lloyd’s WhatsApp messages – which formed part of her evidence to the UK Covid Inquiry – call into question the Scottish Government’s position that it did not routinely use the app for decision-making. This has been its repeated response in the face of criticism over ministers and officials deleting messages."
    },
    {
        "url": "https://news.sky.com/story/nearly-10bn-written-off-value-of-ppe-bought-during-covid-pandemic-13056349",
        "title": "Nearly £10bn written off value of PPE bought during COVID pandemic",
        "description": "Labour&#39;s shadow health secretary Wes Streeting said &quot;Rishi Sunak threw away taxpayers&#39; money as if it were confetti&quot; when chancellor, but the government insisted the decision to try to secure PPE for frontline health and care workers &quot;was right&quot;."
    },
    {
        "url": "https://www.thenational.scot/politics/24075888.yes-movement-switch-civil-rights-movement/",
        "title": "Should Yes movement switch to being a civil rights movement?",
        "description": "REGARDING your story reporting that 57.5 of Scots support the Scottish Parliament having powers to legislate for independence (Majority of"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/brexit/rishi-sunaks-offer-to-dup-on-sea-border-makes-a-nonsense-of-brexit-warns-jim-allister/a1159820922.html",
        "title": "Rishi Sunak’s offer to DUP on sea border ‘makes a nonsense of Brexit’, warns Jim Allister",
        "description": "Jim Allister has warned that the Prime Minister’s reported offer to sacrifice some of Britain’s freedoms in a bid to appease the DUP and restore power-sharing “would make a nonsense of Brexit”."
    },
    {
        "url": "https://fortune.com/2024/01/25/hansjorg-wyss-swiss-billionaire-george-soros-american-right-wing/",
        "title": "An 88-year-old Swiss billionaire who lives in Wyoming is the American right wing’s favorite to replace George Soros",
        "description": "On the right, his <b>politics</b>, wealth and foreign origins inevitably prompt ... The founder of Synthes Holdings AG, a medical-device manufacturer, and a co-owner of the <b>UK</b>’s Chelsea FC, Wyss is worth more than $10 billion, $3 billion more than Soros ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7126026",
        "title": "<b>Politics</b> latest: Sunak responds to plot to oust him - as MP warns of &#39;alarming&#39; change that may hit your travel plans",
        "description": "<b>Politics</b> Hub With Sophy Ridge is live Our weeknight <b>politics</b> ... General Sir Richard Sherriff, ex-deputy supreme allied commander of the military organisation, warned that the <b>UK</b> defence budget is not big enough to expand the armed forces alone."
    },
    {
        "url": "https://www.ft.com/content/d17425af-6b06-4593-9f13-60a6a38e948b",
        "title": "Humza Yousaf criticises Scottish government’s ‘poor’ handling of Covid inquiry requests",
        "description": "Scotland’s first minister’s testimony raises fresh concerns over transparency around official communication during pandemic"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/dup-utv-tony-blair-government-people-b1134909.html",
        "title": "Progress can only be made in N Ireland by taking risks, say veteran journalists",
        "description": "Former UTV political editor Ken Reid and Stephen Grimason, a former BBC Northern Ireland political editor, were honoured for services to journalism."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24075847.drones-banned-flying-within-400-metres-prisons/",
        "title": "Drones banned from flying within 400 metres of prisons",
        "description": "The legal change means drone operators could face fines of up to £2,500 for flying within 400 metres of closed prisons or young offender institutions. People caught smuggling items behind bars already face up to 10 years in prison."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68086757.amp",
        "title": "Peter Navarro: Ex-Trump adviser sentenced for contempt of Congress",
        "description": "Peter Navarro, former trade adviser to Donald Trump, has been sentenced to four months in prison and a $9,500 (£7,500) fine for contempt of Congress. Navarro was convicted in September after he ignored a subpoena from a House committee investigating alleged efforts to overturn the 2020 election."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1859871/tory-mps-trump-biden-election",
        "title": "MPs should beware getting stuck into the US election - voters hate both Trump and Biden",
        "description": "In short, it’s all risk and little reward for any <b>UK</b> politician who wants to give their view on the US election. Those who do willingly should be warned – your voters might not like anything you have to say. Chris Hopkins is <b>Political</b> Research Director ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/holyrood/24075044.nicola-sturgeons-covid-whatsapps-important/",
        "title": "Why Nicola Sturgeon&#39;s Covid WhatsApps are so important",
        "description": "Nicola Sturgeon&#39;s deleted WhatsApp messages are being brought up at the UK Covid Inquiry for good reason, argues a Herald reader."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/rwanda-bill-asylum-seekers-echr-b2484776.html",
        "title": "Why the government’s plan to send asylum seekers to Rwanda is hanging by a thread",
        "description": "Opponents of the UK government’s plan to send asylum seekers to Rwanda have been newly emboldened – meaning that the chances of any planes taking off for Kigali are now vanishingly thin, writes Sean O"
    },
    {
        "url": "https://www.hl.co.uk/news/articles/what-are-bond-market-vigilantes-and-what-does-this-mean-in-the-run-up-to-a-uk-election",
        "title": "What are &#39;bond market vigilantes&#39; and what does this mean in the run up to a <b>UK</b> election?",
        "description": "We look at what &#39;bond market vigilantes&#39; are and the impact this could have in the run up to the UK general election."
    },
    {
        "url": "https://www.theguardian.com/uk-news/nils-pratley-on-finance/2024/jan/25/sorry-france-youre-on-the-hook-at-hinkley-point-edf?ref=biztoc.com",
        "title": "Sorry, France, you’re on the hook at Hinkley Point",
        "description": "EDF understood exactly what it was signing in 2016"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24075784.unreserved-apology-yousaf-frankly-poor-handling-message-requests/",
        "title": "Unreserved apology from Yousaf over ‘frankly poor’ handling of message requests",
        "description": "Scottish First Minister Humza Yousaf gave evidence to the UK Covid-19 Inquiry, which is currently sitting in Edinburgh."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/reform-uk-support-surges-to-record-high/",
        "title": "Reform <b>UK</b> support surges to record high",
        "description": "Reform UK is more popular than at any point in its history, according to opinion polling, which shows 13 per cent of Britons would vote for the party if the general election was held now."
    },
    {
        "url": "https://www.thenational.scot/news/24075761.six-key-points-liz-lloyd-humza-yousafs-covid-inquiry-session/",
        "title": "Six key points from Liz Lloyd and Humza Yousaf&#39;s Covid inquiry session",
        "description": "HERE are six key points after Humza Yousaf and Liz Lloyd, the former chief of staff to Nicola Sturgeon, both appeared in front of the UK"
    },
    {
        "url": "https://uk.news.yahoo.com/nicola-sturgeon-called-boris-johnson-111931231.html",
        "title": "Sturgeon called Boris a ‘f****** clown’ over ‘utter incompetence’ in handling Covid, WhatsApps reveal",
        "description": "WhatsApp messages shared between the ex- SNP leader and her top adviser, Liz Lloyd, shown at the Covid inquiry demonstrated the utter disdain with which the then-prime minister was held. Ms Sturgeon said Mr Johnson’s address announcing a second national lockdown on 31 October 2020 was “f***ing excruciating” and “awful”."
    },
    {
        "url": "https://www.itv.com/news/2024-01-25/traffic-gridlock-and-14-hour-queues-await-tourists-entering-to-europe-mps-told",
        "title": "British tourists to face 14-hour queues to enter Europe under new scheme, MPs told",
        "description": "The new EU Entry-Exit System will make the process of getting over to Europe a little longer, meaning drivers could face long queues. | ITV National News"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/taylor-swift-considering-legal-action-31969076",
        "title": "Taylor Swift &#39;considering legal action&#39; after explicit AI-generated images emerge",
        "description": "Taylor Swift is said to be &#39;considering legal action&#39; after explicit AI-generated images of the singer were circulated online, with a source saying her family and friends are &#39;furious&#39;"
    },
    {
        "url": "https://www.scotsman.com/news/humza-yousaf-and-liz-lloyd-give-evidence-amid-whatsapp-row-4492055",
        "title": "Covid Inquiry: Nicola Sturgeon calls Boris Johnson a &#39;f**cking clown&#39; on WhatsApp as Humza Yousaf set to appear",
        "description": "Today we are due to hear evidence from Liz Lloyd, Nicola Sturgeon&#39;s former chief of staff, and First Minister Humza Yousaf. We are starting today&#39;s evidence with Liz Lloyd, who was Nicola Sturgeon&#39;s chief of staff until the former first minister&#39;s resignation in March 2023."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/24075620.rhos-on-sea-colwyn-bay-boots-stores-among-2024-closures/",
        "title": "Rhos-on-Sea and Colwyn Bay Boots stores among 2024 closures",
        "description": "Boots stores in Rhos-on-Sea and Colwyn Bay are among several in Wales set to close in the early months of 2024 - see the full list."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/must-read/2024-is-milestone-year-leeds-business-improvement-district-enters-its-10th-year-with-big-plans-for-the-city-4493344",
        "title": "2024 is milestone year: Leeds Business Improvement District enters its 10th year with big plans for the city",
        "description": "With an ‘out of this world’ event this Easter, creating a city-wide version of Monopoly during the school summer holidays and setting the ambition for the next five years, 2024 marks a milestone year for LeedsBID,"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/25/why-is-knife-back-in-the-news-and-what-is-being-proposed",
        "title": "Why is knife crime back in the news and what is being proposed?",
        "description": "As Valdo Calocane is sentenced for manslaughter of three people, UK political parties unveil plans to stem use of knives"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68094059",
        "title": "NHS data sale can fuel tech boom - Blair and Hague",
        "description": "The former political rivals team up to argue NHS data could give the UK an advantage in a new &quot;industrial revolution&quot;."
    },
    {
        "url": "https://www.blackpoolgazette.co.uk/arts-and-culture/books/munich-wolf-by-rory-clements-heart-thumping-and-page-turning-book-review-4493317",
        "title": "Munich Wolf by Rory Clements: Heart-thumping and page-turning – book review",
        "description": "Libraries and bookshelves are littered with novels set amidst the drama of life in pre-war Berlin, but in the febrile atmosphere of the mid-1930s, it was Munich – Adolf Hitler’s spiritual home – where the real Nazi power-play was fast spreading its evil roots."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68098666",
        "title": "Blair: World is undergoing new Industrial Revolution",
        "description": "Sir Tony Blair has said that current global changes are of &quot;even greater magnitude&quot; than the 19th century Industrial Revolution."
    },
    {
        "url": "https://www.ft.com/content/efe3f061-f128-42c3-a9dd-e6de655c8478",
        "title": "How Britain’s <b>political</b> elite broke the development bargain",
        "description": "And I know immigrants to Britain from countries such as Nigeria or Russia who nod with recognition at recent stories of elite self-dealing: the Conservative peer Michelle Mone, who lied about her relationship with a medical equipment company that won more than £200mn in state contracts during the pandemic;"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/rwanda-policy-rishi-sunak-migration-echr-illegal/?utmsource=email",
        "title": "Blow to Sunak’s Rwanda policy as European judge claims plan is unlawful",
        "description": "On Thursday, Síofra O’Leary, the president of the European Court of Human Rights (ECHR) said that the <b>UK</b> would be in breach of its legal obligations if it refused to comply with a Strasbourg injunction, known as a Rule 39 order. Deportation flights to ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/sell-nhs-medical-records-to-fund-cutting-edge-treatments-sir-tony-blair-and-lord-hague-say/",
        "title": "Sell NHS medical records to fund cutting-edge treatments, Sir Tony Blair and Lord Hague say",
        "description": "But they wrote: &quot;Whatever our <b>political</b> differences on more traditional issues ... Last summer they called for the <b>UK</b> to establish a &quot;national laboratory&quot; to test out AI in a bid to become the &quot;brain&quot; of both a British and international regulator."
    },
    {
        "url": "https://uk.news.yahoo.com/vote-confidence-uk-market-offshore-164001036.html",
        "title": "A vote of confidence in the <b>UK</b> market for offshore wind",
        "description": "WE were able to take FID on Hornsea 3 thanks in no small part to the strong <b>political</b> support the <b>UK</b> government has shown the offshore wind industry. The offshore wind industry called on the government to adjust the 2024 round of the signature scheme that ..."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jon-stewart-daily-show-return-john-oliver-b2484793.html?ref=upstract.com",
        "title": "John Oliver expresses ‘surprise’ as Jon Stewart returns to Daily Show",
        "description": "McCarthy continued: “In our age of staggering hypocrisy and performative <b>politics</b>, Jon is the perfect person to puncture the empty rhetoric and provide much-needed clarity with his brilliant wit.” Oliver joined the satirical news program in 2006 as its ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tony-blair-william-hague-nhs-british-labour-b1134694.html",
        "title": "Former <b>political</b> rivals call for sale of NHS data to drive AI treatment",
        "description": "Former <b>political</b> rivals Tony Blair and Lord William Hague have called ... have set out more than 40 recommendations on regulation and state support to help the <b>UK</b> stay at the forefront of growth in biotechnology and artificial intelligence."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/mancunian-way-time-become-player-28511618",
        "title": "The Mancunian Way: Time to become a player",
        "description": "<b>Political</b> reporter Joseph Timan told me the ‘relatively safe ... which promises to be the ‘biggest and most sustainable arena in the <b>UK</b>,’ according to the venue. But we’d be remiss to forget that Manchester already has an arena - and they ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h765vw",
        "title": "Not Normal Times",
        "description": "The team sit down to discuss the week&#39;s big <b>political</b> news, which saw Humza Yousaf, who was both Scottish Justice and then Health Secretary during the Covid-19 pandemic, answering the questions of the <b>UK</b> COVID inquiry as it continues in Scotland."
    },
    {
        "url": "https://www.newsletter.co.uk/news/opinion/columnists/editorial-the-uk-government-looks-increasingly-divided-and-desperate-4491425",
        "title": "Editorial: The <b>UK</b> government looks increasingly divided and desperate",
        "description": "Sir Simon is one of the Tories’ most high-profile ‘red wall’ MPs, representing the wing of the party that won new supporters in northern England by emphasising its commitment to Brexit and opposition to unchecked immigration. This time, many ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12502947.cancer-expert-says-megrahi-not-responding-treatment/",
        "title": "Cancer expert says Megrahi is not responding to treatment",
        "description": "Shakespeare&#39;s foresight when he wrote that &quot;all the world’s a stage&quot; seems apt in relation to the <b>political</b> machinations of Lockerbie ... Diplomatic negotiations began between the US, Libya and the <b>UK</b> not long after Abdelbaset Ali Mohmed al Megrahi ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-trap-reverse-tax-cuts-slash-public-services-2874208?ico=above_article_ticker",
        "title": "Labour’s spending trap: reverse Tory tax cuts or slash public services",
        "description": "Shadow Chancellor Rachel Reeves has rejected calls to raise taxes in order to pay for higher spending, other than a small number of specific tax increases such as imposing VAT on private school fees. She said last week: “I would like taxes to be lower on working people.”"
    },
    {
        "url": "https://www.ft.com/content/61d6679d-ce42-467b-afa4-af6526ada476",
        "title": "Brexit is leading to growing Balkanisation for business",
        "description": "But what’s symbolic of the broader regulatory Balkanisation caused by Brexit is that the business department announcement only covers those industrial products that fall under its remit."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/304394/leaders-urged-to-show-courage-and-reach-agreement",
        "title": "Leaders Urged To &#39;Show Courage&#39; And Reach Agreement",
        "description": "The SDLP has called on political leaders to &quot;show courage&quot; and reach an agreement to restore the Stormont institutions in the coming days. Leader Colum Eastwood MP was speaking in the House of Commons as MPs discussed the Northern Ireland (Executive Formation) Bill."
    },
    {
        "url": "https://www.politico.eu/article/germany-defence-minister-boris-pistorius-missile-swap-united-kingdom/",
        "title": "German defense minister doesn’t ‘know anything’ about missile swap with <b>UK</b>",
        "description": "London reportedly wants to get Germany’s Taurus cruise missiles and then send its Storm Shadow missiles to Ukraine."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68097829",
        "title": "Threats against Sir Jeffrey Donaldson reported to PSNI, says DUP",
        "description": "A &quot;threat of violence&quot; against Democratic Unionist Party (DUP) leader Sir Jeffrey Donaldson has been reported to police, the party has said. It comes after the DUP leader told MPs he had been threatened due to a &quot;stirring up&quot; of tensions over the party&#39;s talks on Brexit trade rules."
    },
    {
        "url": "https://www.heraldscotland.com/news/24075458.hornsea-3-vote-confidence-uk-market-offshore-wind/?ref=yahoo",
        "title": "Hornsea 3: A vote of confidence in the <b>UK</b> market for offshore wind",
        "description": "With a capacity of 2.9 GW, Hornsea 3 will generate enough low-cost, renewable energy to power more than 3.3 million UK homes. Our decision to build Hornsea 3 is a vote of confidence in the UK market for offshore wind, as we continue to invest significantly in UK clean energy infrastructure and in the UK supply chain."
    },
    {
        "url": "https://bylinetimes.com/2024/01/25/the-next-big-injustice-scandal-allegations-of-blood-on-governments-hands-as-thousands-of-prisoners-remain-locked-up-despite-serving-time/",
        "title": "The Next Big Injustice Scandal? Allegations of ‘Blood on Government’s Hands’ as Thousands of Prisoners Remain Locked Up Despite Serving Time",
        "description": "These are enough people still locked up who&#39;ve served their sentences to fill four UK prisons, according to new figures"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24075416.microsoft-cuts-1-900-jobs-activision-blizzard-xbox/",
        "title": "Microsoft cuts 1,900 jobs at Activision Blizzard and Xbox",
        "description": "Microsoft has not confirmed if any <b>UK</b>-based staff will be affected. Alongside the job cuts, Blizzard president Mike Ybarra confirmed that he was leaving the company. In a post on X, formerly Twitter, he also thanked staff impacted by the job cuts."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/304383/daera-calls-for-applications-to-30m-peaceplus-programme",
        "title": "DAERA Calls For Applications To €30m PEACEPLUS Programme",
        "description": "Smart Towns And Villages Investment Fund Now Open For Applications"
    },
    {
        "url": "https://thenantwichnews.co.uk/2024/01/25/letter-to-the-chancellor-from-cheshire-tourism-leaders/",
        "title": "LETTER: To the Chancellor from Cheshire tourism leaders",
        "description": "Tourist, business and council leaders in Cheshire and Warrington have penned an open letter to Chancellor Jeremy Hunt"
    },
    {
        "url": "https://www.holsworthy-today.co.uk/news/government-funding-announcement-criticised-by-lib-dem-leader-662668",
        "title": "Government funding announcement criticised by Lib Dem leader",
        "description": "He continued: “It’s the oldest trick in the <b>political</b> book. First, you quietly take away money with one hand, then you loudly give it back with the other. It’s exactly the same story with personal taxation; the government expects us to be grateful ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/steal-only-5-uk-growth-160200865.html",
        "title": "A steal at only £5! Is this <b>UK</b> growth stock a golden opportunity to profit in 2024?",
        "description": "This Fool UK contributor is impressed by a cheap growth stock that’s fighting for its place in a competitive industry with a bright future. The post A steal at only £5! Is this UK growth stock a golden opportunity to profit in 2024?"
    },
    {
        "url": "https://www.thenational.scot/politics/24075147.yes-eu-host-interactive-workshop-securing-scottish-membership/",
        "title": "Yes for EU to host interactive workshop on securing Scottish membership",
        "description": "Founder of BiS Gordon MacIntyre-Kemp said that last year&#39;s poll found 97% of No to Yes switchers want an independent Scotland to become a member of the EU, and described this as &quot;a really significant finding&quot;."
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/news/24073691.enough-enough-backlash-grows-green-agenda/",
        "title": "&#39;Enough is enough&#39; as backlash grows against green agenda",
        "description": "The Scottish Government refutes claims that the First Minister and Green Minister canceled a scheduled launch event in the Highlands to evade"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-starmer-has-zero-apologies-for-squeamish-sunak-attack-ad-12593360?postid/1000",
        "title": "<b>Politics</b> latest: Plot to oust Sunak becomes clear - as Johnson and Truss&#39;s severance pay revealed",
        "description": "The <b>UK</b> has sanctioned four people under its Yemen sanctions region ... The new year is upon us, and the <b>political</b> party leaders are working hard to convince the public to back them in the upcoming general election. But while the latest opinion polls ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nicola-sturgeon-boris-johnson-clown-b2484663.html",
        "title": "Nicola Sturgeon called Boris Johnson a ‘f***ing clown’, Covid WhatsApps reveal",
        "description": "Top Sturgeon adviser wanted ‘rammy’ with Tory government so she could ‘think about something other than sick people’"
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/24074347.asda-express-opens-new-convenience-store-corsham/",
        "title": "Asda Express opens new convenience store in Corsham",
        "description": "The new Asda Express in Pickwick Road, Corsham, opened its doors to shoppers at the Texaco filling station site on Thursday (January 25) and is one of 21 new convenience stores opening across the country by the end of the month."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006903/Rishi-Sunak-progress-Tory-rebels-Farage-Reform-Labour.html",
        "title": "Rishi Sunak insists he is making &#39;progress&#39; as Tory rebels plot to replace him with the party just SEVEN points ahead of Nigel Farage&#39;s Reform while Labour has a lead of 34 in ...",
        "description": "Two polls released today gave Labour a huge lead in its main target seats, and gave the Conservatives a narrowing lead over third-placed Reform UK."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/belfast-telegraph-and-sunday-life-journalists-shortlisted-for-17-regional-press-awards/a796586954.html",
        "title": "Belfast Telegraph and Sunday Life journalists shortlisted for 17 Regional Press Awards",
        "description": "Belfast Telegraph and Sunday Life journalists have been shortlisted for seventeen awards at The Regional Press Awards this year."
    },
    {
        "url": "https://www.prnewswire.co.uk/news-releases/generational-tensions-linked-to-lower-workplace-productivity-in-the-uk-and-us-302044879.html",
        "title": "Generational Tensions Linked to Lower Workplace Productivity in the <b>UK</b> and US",
        "description": "Employees who are much younger than their managers report lower productivity than those closer in age due to a lack of collaboration"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24074445.pandemic-decisions-not-made-political-reasons-insists-yousaf/",
        "title": "Pandemic decisions were not made for <b>political</b> reasons, insists Yousaf",
        "description": "The First Minister also said he has commissioned an external review into Scottish Government policy on mobile messaging."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/25/uk-politics-latest-news-updates-covid-inquiry-nicola-sturgeon-humza-yousaf-knife-crime?filterKeyEvents=false&page=with:block-65b28c888f08472b2b0765e9",
        "title": "Ed Balls says Starmer should perform ‘big U-turn’ and drop £28bn as size of green jobs plan – <b>UK politics</b> live",
        "description": "Former shadow chancellor says people need to hear Labour say they are commitment to ‘sound public finances’ over worries about taxation increase"
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/24074743.labour-not-play-king-canute-devolved-policing-wales---drakeford/",
        "title": "Labour should not play ‘King Canute’ with devolved policing in Wales – Drakeford",
        "description": "The outgoing First Minister said colleagues in Westminster would have a responsibility to show the ‘journey has begun’ towards"
    },
    {
        "url": "https://inews.co.uk/news/politics/bishop-paul-butler-rwanda-policy-2873209?ico=editors_picks",
        "title": "Sunak’s fight to get Rwanda bill through Lords just got a lot worse",
        "description": "I remain unconvinced that it will achieve the stated intention of deterring those seeking to reach the <b>UK</b>, and so will not stop the boats ... and we take that responsibility seriously. Party <b>politics</b> doesn’t come into it.” Earlier Siofra O ..."
    },
    {
        "url": "https://www.business-live.co.uk/opinion-analysis/welsh-governments-latest-budget-dealt-28510911.amp",
        "title": "The Welsh Government&#39;s latest budget has dealt a death sentence to many businesses",
        "description": "Labour has made the <b>political</b> decision to slash business rates relief by nearly ... Unfortunately, despite a record funding settlement from the <b>UK</b> Conservative Government, Labour’s Education Minister has cut the education budget, not just in real terms ..."
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/health/man-given-months-live-cancer-28509019",
        "title": "Man given months to live is cancer free after pioneering treatment",
        "description": "&quot;I was just sat there like &#39;how is this actually happening to me, I don&#39;t understand?&quot; Pancreatic cancer is the fifth biggest cancer killer in the <b>UK</b>, as 9,000 people who were diagnosed with it, die every year. Around half of people who are diagnosed with ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/25/uk-politics-latest-news-updates-covid-inquiry-nicola-sturgeon-humza-yousaf-knife-crime?filterKeyEvents=false&page=with:block-65b285a08f0811ef98ce4096",
        "title": "Nicola Sturgeon regarded Boris Johnson as ‘a clown’ because of his handling of Covid, inquiry learns – <b>UK politics</b> live",
        "description": "Former Scotland first minister used expletives in private messages about former <b>UK</b> PM’s handling of pandemic Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages and respond to some ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/ftse-100-live-25-january-063254631.html",
        "title": "FTSE 100 Live 25 January: London blue-chips close flat after US GDP crushes expectations",
        "description": "<b>UK</b> sales dipped 1% to £114.8 million ... buffeting the business are far outside of its control — CEO Johan Lundgren can’t solve Middle East <b>political</b> tensions and run a successful airline at the same time (the first task is beyond seemingly anyone)."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/uk-government-dup-stormont-ira-northern-ireland-b1134858.html",
        "title": "Threats against Donaldson have been reported to police – DUP",
        "description": "Amid speculation an agreement is near to being reached, the <b>UK</b> Government tabled new legislation on Wednesday ... “There is no place for the threat of violence in democratic <b>politics</b>.” A PSNI spokesperson said: “We do not discuss the security ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24074743.labour-not-play-king-canute-devolved-policing-wales---drakeford/",
        "title": "Labour should not play ‘King Canute’ with devolved policing in Wales – Drakeford",
        "description": "The outgoing First Minister said colleagues in Westminster would have a responsibility to show the ‘journey has begun’ towards"
    },
    {
        "url": "https://inews.co.uk/news/media/wilfred-frost-david-son-sky-news-nepo-baby-2848637?ico=in-line_link",
        "title": "Call me a nepo baby but I’ve proved myself, says David Frost’s son Wilfred",
        "description": "I couldn’t be prouder of him.” Wilfred Frost interviewed Sir Keir Starmer when he deputised as presenter of Sky News’ Sunday <b>politics</b> show (Photo: Sky <b>UK</b> Limited) It’s hardly surprising Mr Frost acquired a passion for the family trade. From a young ..."
    }
]