[
    {
        "url": "https://www.dailymail.co.uk/news/article-12872419/Rwanda-Sir-Keir-Labour-candidate-sells-CHILDRENs-holidays-illegal-migrants.html",
        "title": "Still say Rwanda isn&#39;t safe Sir Keir? Labour candidate sells CHILDREN&#39;s holidays to the very country party insists is too risky for illegal migrants",
        "description": "He has also said that he would &#39;love dual citizenship&#39; with Rwanda, and said on social media that people should go there &#39;to escape the <b>UK</b> winter ... Minister and described it as a &#39;gimmick&#39; and &#39;<b>political</b> performance art&#39;. Mr Rushworth told the MoS ..."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/23995047.alex-batty-returns-uk-missing-abroad-six-years/",
        "title": "Alex Batty returns to <b>UK</b> after being missing abroad for six years",
        "description": "The 17-year-old was found by chiropody student Fabien Accidini while walking alone near Toulouse in the early hours of Wednesday."
    },
    {
        "url": "https://www.thesun.co.uk/news/25078467/rishi-sunak-democracy-britain-illegal-migration/",
        "title": "Rishi Sunak needs to come out fighting in 2024 from day one",
        "description": "PM must come out fighting in 2024 RISHI Sunak warned yesterday that the very future of democracy depends on Britain getting to grips with illegal migration. Spot on, PM. The Sun has warned many"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/16/keir-starmer-represented-extremist-islamist-group/",
        "title": "Starmer acted for extremist Islamist group in bid to overturn ban",
        "description": "Sir Keir Starmer acted on behalf of an extremist Islamist group seeking to overturn a ban imposed on its activities in Germany, The Sunday Telegraph can disclose. The Labour leader led a team of lawyers claiming that Berlin’s prohibition of Hizb ut-Tahrir breached the group’s rights to freedom of religion and expression."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/bills/article-12871317/The-stealth-tax-raiders-creeping-closer-homes-Britain-danger-zone.html",
        "title": "The stealth tax raider&#39;s creeping closer to homes all over Britain - so are YOU in a danger zone?",
        "description": "Thousands of families in the Midlands and the North of England are being dragged into paying inheritance tax for the first time."
    },
    {
        "url": "https://www.politico.eu/article/uks-sunak-likens-italys-meloni-to-margaret-thatcher/",
        "title": "<b>UK</b>’s Sunak likens Italy’s Meloni to Margaret Thatcher",
        "description": "British prime minister calls on European leaders to channel the old Conservative leader’s ‘radicalism’ and challenge decades-old rules on refugees."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/16/labour-lead-slips-to-13-points-poll-nhs-priority-sunak-rwanda",
        "title": "Labour lead slips to 13 points in poll that shows NHS is voters’ main priority",
        "description": "Sunak’s approval increases slightly after surviving potential rebellion over Rwanda bill"
    },
    {
        "url": "https://www.lbc.co.uk/news/david-cameron-sustainable-ceasefire-amid-gaza-conflict-israel-killed-civilians/",
        "title": "David Cameron calls for &#39;sustainable&#39; ceasefire amid escalating Gaza conflict, as Israel has killed &#39;too many civilians&#39;",
        "description": "Foreign Secretary David Cameron has written a joint article with German Foreign Affairs Minister Annalena Baerbock amid growing concerns over Israel&#39;s conduct in the fight against Hamas."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872193/Sir-tony-blair-david-cameron-speculation-keir-starmer-lord-labour-cabinet.html",
        "title": "Sir Tony Blair says he has no interest in &#39;doing a Cameron&#39; amid speculation Keir Starmer could make him a Lord and bring him back to Labour cabinet",
        "description": "David Cameron made a shock return to politics as the new Foreign Secretary last month, displacing James Cleverly who has since taken over in the Home Office"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sustainable-ceasefire-needed-in-gaza-conflict-says-foreign-secretary-106156/",
        "title": "Sustainable ceasefire needed in Gaza conflict, says Foreign Secretary",
        "description": "Lord Cameron and the German Foreign Affairs minister Annalena Baerbock have jointly called for a sustainable ceasefire."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/16/hardline-right-france-politicians-macron/",
        "title": "Hard-Right dominates French top five politicians list, says poll, as Macron government struggles",
        "description": "National Rally leader Marine Le Pen in third, followed by deputy Jordan Bardella, with Le Pen’s anti-Islam niece Marion Maréchal fifth"
    },
    {
        "url": "https://metro.co.uk/2023/12/16/israeli-hostages-mistakenly-killed-idf-were-holding-white-flag-19985010/?ico=trending-post-strip_item_4",
        "title": "Three hostages mistakenly killed by Israeli troops ‘were holding up white flag’",
        "description": "Metro.co.<b>uk</b> is now on WhatsApp sending vital updates and top trending ... A man walks past portraits of Israeli hostages (Picture: AFP via Getty) Israeli <b>political</b> and military leaders often say freeing all the hostages is their top aim in the war ..."
    },
    {
        "url": "https://www.bbc.com/news/topics/c50znx8v18xt?page=20",
        "title": "UUP (Ulster Unionist Party)",
        "description": "Ulster Unionist leader Doug Beattie says it is embarrassing that a major US trade delegation is taking place while Northern Ireland has no government. The DUP, the UUP and TUV request Stormont funds after previously pledging to cover the full cost."
    },
    {
        "url": "https://www.thenationalnews.com/world/uk-news/2023/12/16/uk-and-germany-push-sustainable-ceasefire-in-gaza/",
        "title": "<b>UK</b> and Germany push for &#39;sustainable ceasefire&#39; in Gaza",
        "description": "Germany and the UK have called for a “sustainable ceasefire” in Gaza that can be a step towards a two-state future developed with Arab help. British Foreign Secretary David Cameron and German Foreign Affairs Minister Annalena Baerbock, writing in the Sunday Times, warned that “too many civilians have been killed”."
    },
    {
        "url": "https://www.whtimes.co.uk/news/23252248.mary-george-new-sky-series-filmed-hatfield-house/",
        "title": "Mary &amp; George: New Sky series filmed at Hatfield House",
        "description": "Location filming of new Sky Original series Mary &amp; George – starring Julianne Moore and Nicholas Galitzine – took place at Hatfield"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-gaza-german-grant-shapps-sunday-times-b1127433.html",
        "title": "Sustainable ceasefire needed in Gaza conflict, says Foreign Secretary",
        "description": "Lord Cameron and the German Foreign Affairs minister Annalena Baerbock have jointly called for a sustainable ceasefire."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12872117/David-Cameron-German-foreign-minister-sustainable-ceasefire-Israel-Hamas-Gaza.html",
        "title": "David Cameron joins forces with German foreign minister to call for a &#39;sustainable ceasefire&#39; between Israel and Hamas as Gaza death toll edges close to 19,000",
        "description": "Lord Cameron and the German foreign minister Annalena Baerbock, said they &#39;share the view that this conflict cannot drag on and on&#39; and advocated for an &#39;end the endless cycle of violence&#39;."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/16/telegraph-uae-takeover-questioned-national-security-libdems/",
        "title": "Lib Dems call for scrutiny of &#39;deeply worrying&#39; Telegraph bid",
        "description": "The takeover proposal has raised concerns across the political spectrum about the editorial independence of The Telegraph and The Spectator"
    },
    {
        "url": "https://www.thesun.co.uk/news/25077869/alex-batty-grandad-not-dead-france/",
        "title": "Alex Batty’s grandad is NOT dead and was seen mowing his lawn days ago, neighbour claims as teen returns to <b>UK</b>",
        "description": "THE granddad of “abducted” Brit teen Alex Batty is not dead and was spotted mowing grass just a week ago, neighbours claim. French authorities said David Batty perished six months ago"
    },
    {
        "url": "https://www.theguardian.com/world/2023/dec/16/sunak-accused-toxic-rhetoric-after-warning-overwhelming-migration-europe",
        "title": "Sunak accused of toxic rhetoric after warning of ‘overwhelming’ migration to Europe",
        "description": "Prime minister makes controversial remarks at Rome conference organised by Giorgia Meloni’s party"
    },
    {
        "url": "https://www.thetimes.co.uk/article/david-cameron-gaza-ceasefire-israel-palestine-war-s50x2kscw",
        "title": "David Cameron: Why the <b>UK</b> and Germany back a sustainable ceasefire",
        "description": "The foreign secretary and his German counterpart Annalena Baerbock call on all parties to work towards a two-state solution for Israel and Palestine — once the killing has stopped"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/stubbing-toe-first-sign-gateshead-28271293",
        "title": "Stubbing her toe was first sign of Gateshead gran&#39;s heartbreaking brain tumour",
        "description": "Carol Tate died a year after innocuously stubbing her toe proved the first sign of a brain tumour. Stubbing her toe while on a hike was the first sign of a fatal cancer that would kill a Sunniside grandmother."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-africa-67737039.amp",
        "title": "Former South Africa president Jacob Zuma leaves ANC",
        "description": "Former South African president Jacob Zuma says he will not vote for the African National Congress (ANC) and is creating a new political party. Mr Zuma was the country&#39;s president between 2009 and 2018. He said it &quot;would be a betrayal&quot; to campaign for the ANC of current President Cyril Ramaphosa."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/giant-50-metre-steel-tube-31688836",
        "title": "Giant 50-metre steel tube shipped on busy M25 without police-promised safety measures",
        "description": "One unnamed company was caught red-handed dangerously shipping 50 metre steel tubes down the M25 with none of the safety measures, or self-escort, they had promised police they would have"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1846406/terror-britain-mosques-hamas",
        "title": "Hamas-inspired terror may target towns &#39;like Swindon and Cheadle&#39; as well as major cities",
        "description": "Hamas sermons delivered from Britain&#39;s more radical mosques could inspire a new wave of lone-wolf terror attacks, intelligence sources warned."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-says-migration-threatens-to-overwhelm-europe-13031810",
        "title": "Rishi Sunak says migration threatens to &#39;overwhelm&#39; Europe",
        "description": "The prime minister has been battling to pass his Rwanda bill, which has split Conservatives as it does not allow the UK to override the European Convention on Human Rights."
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/american-sports/rob-gronkowski-fox-tv-nfl-31688817",
        "title": "Rob Gronkowski to sing national anthem at LA Bowl as he misses FOX TV coverage",
        "description": "Former New England Patriots star Rob Gronkowski will be missing from FOX&#39;s NFL TV coverage during Week 15 as he prepares to sing the national anthem at the LA Bowl instead"
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/national/23994708.kuwait-ruler-sheikh-nawaf-dies-86-weeks-hospital/",
        "title": "Kuwait ruler Sheikh Nawaf dies at 86 after weeks in hospital",
        "description": "Sheikh Nawaf Al Ahmad Al Sabah, Kuwait’s ruling emir, has died aged 86 after a three-year reign. Kuwait state television broke into programming with Quranic verses just before a sombre official made the announcement."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/sir-jeffrey-donaldson-says-much-more-needed-from-government-on-ni-funding-model-4448503",
        "title": "Sir Jeffrey Donaldson says ‘much more’ needed from Government on NI funding model",
        "description": "DUP leader Sir Jeffrey Donaldson has said the Government needs to provide &quot;much more&quot; in its offer for Northern Ireland, ahead of the resumption of talks on the £2.5 billion package to stabilise finances in the region."
    },
    {
        "url": "https://www.derbytelegraph.co.uk/sport/football/new-regime-same-result-brewers-8980187",
        "title": "New regime, same result as Brewers outclassed",
        "description": "As usual, there was no shortage of effort from the Brewers but they were unable to create much in possession and their goal led a charmed life at times until the home side added two late goals to their first-half lead."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-giorgia-meloni-italy-tunisia-edi-rama-b1127421.html",
        "title": "Sunak warns of migrant threat as <b>UK</b> and Italy agree to fund Tunisia plan",
        "description": "During a trip to Rome Mr Sunak met Italian prime minster Giorgia Meloni, with whom he has developed a strong partnership."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-67717021",
        "title": "Translink: NI buses and trains cancelled for third day",
        "description": "Businesses and shoppers across Northern Ireland are facing a day of disruption as bus and train staff strike over pay. It is the second consecutive day of industrial action by Translink staff and the third walk out this month. Union leaders said members had no alternative but to strike due to attempts to &quot;instigate a pay freeze&quot;."
    },
    {
        "url": "https://www.express.co.uk/journalist/123179/Sebastian-Murphy-Bates?o=2",
        "title": "Sebastian Murphy-Bates",
        "description": "Express.co.uk. He covers the royals, crime, UK politics and global affairs. He has a particular interest in crime and his first book, Easy Kills, focuses on the Stephen Port murders. He previously worked as assistant editor at the Daily Star Online and as a reporter at the MailOnline."
    },
    {
        "url": "https://www.ft.com/content/2bccd67f-a3c6-48d1-baa5-8ef9d54cdf67?trk=public_post_comment-text",
        "title": "EDF told not to expect <b>UK</b> to step in to fund flagship nuclear project",
        "description": "Keep abreast of significant corporate, financial and political developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert commentary and analysis you can trust."
    },
    {
        "url": "https://www.portsmouth.co.uk/news/politics/suella-braverman-duped-into-collecting-infamous-award-by-youtube-star-josh-pieters-on-channel-4s-the-last-leg-4448445",
        "title": "Suella Braverman duped into collecting infamous award by YouTube star Josh Pieters on Channel 4&#39;s The Last Leg",
        "description": "The current MP for Fareham and former home secretary was duped into on receiving the “D**k of the Year” award by Channel 4 comedy show The Last Leg. YouTube pranksters Josh Pieters and Archie Manners used every ploy up their sleeve to deceive the politician in a moment which went down in television history."
    },
    {
        "url": "https://uk.news.yahoo.com/don-t-believe-bbc-doomsters-200000708.html",
        "title": "Don’t believe BBC doomsters - the Conservatives are delivering",
        "description": "As advent becomes Christmas, we reflect on the year behind us and anticipate what is to come. But, as ever at this time, some people find it hard to know which narrative to choose to believe. This is particularly true at the moment,"
    },
    {
        "url": "https://www.thenational.scot/politics/23994214.news-story-like-parable-amoral-tory-britain/",
        "title": "News story was more like a parable of amoral Tory Britain",
        "description": "THERE was a story in the news this week that I couldn’t get out of my mind. For me it is a parable about the amoral climate engendered by"
    },
    {
        "url": "https://metro.co.uk/2023/12/16/holocaust-survivors-windrush-uk-better-off-immigration-19969687/?ico=mosaic_uk",
        "title": "Holocaust survivors and Windrush: How the <b>UK</b> is better off for its immigration",
        "description": "â Speaking with Metro.co.<b>uk</b> again, Sacha says he continues to have an active ... But then he was forced to flee again due to his <b>political</b> affiliations with a left-wing party that was outspoken about the Turkish government. But this time, he was ..."
    }
]