[
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/refugee-who-wore-paraglider-image-to-have-status-review/",
        "title": "Refugee who wore paraglider image at pro-Palestine protest to have asylum status reviewed",
        "description": "Woman was handed conditional discharge for ‘displaying article to arouse suspicion’ that she was Hamas supporter"
    },
    {
        "url": "https://inews.co.uk/news/politics/cameron-to-intensify-pressure-on-us-to-fund-ukraine-despite-kiss-my-ass-backlash-2908601?ico=related_article_inline",
        "title": "Cameron to intensify pressure on US to fund Ukraine despite ‘kiss my ass’ backlash",
        "description": "A military aid package to Ukraine is being held up in the US by political wrangling, most notably by Trump-allied Republicans"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/nigel-farage-threatens-scupper-natwest-share-sale-culture/",
        "title": "Nigel Farage threatens to scupper NatWest share sale unless it changes culture",
        "description": "Reform UK president says he will make life ‘very, very difficult’ for the bank’s incoming boss unless he receives a ‘fuller apology’"
    },
    {
        "url": "https://faroutmagazine.co.uk/?p=472289",
        "title": "The musician who completely changed Robert Plant’s way of thinking",
        "description": "Dylan was renowned for his ability to comment on America from a political and social point of view. It inspired many musicians who saw a true reflection of their country portrayed in the mainstream for the first time. Bruce Springsteen credits Bob Dylan as being the “ father of my country ” for this very reason."
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/jamie-stone-in-renewed-call-for-undersea-option-instead-of-h-342345/",
        "title": "Jamie Stone in renewed call for undersea option instead of Highland pylons",
        "description": "Jamie Stone is pushing for an undersea option rather than have a controversial line of huge new electricity pylons cutting through the Highlands."
    },
    {
        "url": "https://www.thesun.co.uk/news/25971154/keir-starmer-green-policy-anti-semitism-row-labour/",
        "title": "Bungled green policy &amp; anti-Semitism row…after worst 2 weeks as Labour boss, Starmer shouldn’t open the bubbly yet",
        "description": "IN the dying days of Boris ­Johnson’s government, an image of crates of fizz being wheeled in the back door of Downing Street could not be more perfect for an eagle-eyed snapper. Torpedoed by"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24120512.durham-drug-den-woods-removed-council-authorities/",
        "title": "Durham drug den in woods removed by council and authorities",
        "description": "A den was found in the woods in Frosterley, in Stanhope, County Durham, after concerns were raised about antisocial behaviour from minors"
    },
    {
        "url": "https://www.thesun.co.uk/news/25971845/second-person-dies-a96-crash-inverness/",
        "title": "Second person dies after horror crash on major Scots road as police picture tragic pair",
        "description": "A SECOND person has died following a horror crash near Inverness. Emergency services raced to the scene at around 12.10pm on Monday, February 12. The alarm was raised following a crash that"
    },
    {
        "url": "https://inews.co.uk/news/politics/budget-tories-shittery-2908776?ito=facebook_share_article-top",
        "title": "PM faces ‘perfect storm of sh**tery’ with Budget his last chance, pollsters say",
        "description": "Next month’s Budget will mark the Conservative Party ’s last chance to turn around its chances at the general election, with the Prime Minister facing a “perfect storm of shittery” later this week, polling experts have said."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/solving-dire-homes-crisis-key-32136935",
        "title": "&#39;Solving our dire homes crisis will be the key to getting into No10 - it starts with social housing&#39;",
        "description": "Kwajo Tweneboa sets the record straight on what could be one of the most decisive issues in the next General Election"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-scottish-jeane-freeman-humza-yousaf-kate-forbes-b1139379.html",
        "title": "Sturgeon transferred ‘zero’ WhatsApp Covid messages on to corporate record",
        "description": "The former first minister is now facing calls to make a personal statement to Holyrood to answer questions from MSPs."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24123387.heart-attack-survivors-face-higher-risk-developing-conditions---study/",
        "title": "Heart attack survivors face higher risk of developing other conditions – study",
        "description": "While the greatest risk to heart attack survivors was heart failure and atrial fibrillation – which makes the heart beat faster and irregularly – the risk of other conditions such as kidney failure also increased."
    },
    {
        "url": "https://www.theguardian.com/media/2024/feb/15/independent-in-talks-to-take-over-buzzfeed-and-huffpost-in-uk-and-ireland",
        "title": "Independent in talks to take over BuzzFeed and HuffPost in <b>UK</b> and Ireland",
        "description": "BuzzFeed founder and CEO Jonah Peretti told UK staff he was excited about deal, described as ‘strategic partnership’"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24123356.north-east-labour-candidate-kim-mcguinness-accused-racial-slur/",
        "title": "North East Labour candidate Kim McGuinness accused of ‘racial slur’",
        "description": "Labour’s candidate for North East mayor Kim McGuinness has been accused of using a “racial slur” in a historic social media post."
    },
    {
        "url": "https://www.thenational.scot/politics/24122662.sell-labour-working-class-band-together/",
        "title": "All who sell their labour are working-class and should band together",
        "description": "ASSA Samake-Roman has very much missed the point about social class in her column in Wednesday’s National (UK’s definition of who"
    },
    {
        "url": "https://eveshamobserver.co.uk/lifestyle/britain-as-a-nation-is-returning-to-church-48412/",
        "title": "Britain as a nation is returning to Church",
        "description": "Whatever the <b>political</b> shenanigans of the Church leaders may be ... However, this search has now extended to what is right here in the <b>UK</b> under our noses. As a nation we love history and we’re discovering the stories within parishes of great reformers ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68311139.amp",
        "title": "Donald Trump&#39;s first criminal trial set to begin next month",
        "description": "A New York judge refused to dismiss a hush money case against the former president and set the trial for 25 March."
    },
    {
        "url": "https://www.standard.co.uk/comment/baftas-london-world-film-capital-new-york-los-angeles-b1139367.html",
        "title": "Ahead of the Baftas on Sunday, we now know London is one of the best places in the world to make films",
        "description": "Sonic the Hedgehog 3 and hit <b>political</b> thriller The Diplomat season 2 starring Keri Russell as US ambassador to <b>UK</b>, Kate Wyler. Which proves that London really is the best place to tell a story. Fans of Notting Hill, Harry Potter, Paddington and Bridgerton ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-north-east-mayor-candidate-28642025",
        "title": "Labour North East mayor candidate Kim McGuinness accused of using &#39;racial slur&#39; in historic social media post",
        "description": "Northumbria Police and Crime Commissioner Kim McGuinness, who is standing to be North East mayor, has apologised for an &quot;offensive&quot; online remark made in 2011"
    },
    {
        "url": "https://www.currencynews.co.uk/forecast/20240215-40110_pound-to-dollar-rate-forecast-revised-higher-at-bank-of-america.html",
        "title": "Pound to Dollar Rate Forecast Revised HIGHER at Bank of America",
        "description": "International Money Transfer? Ask our resident FX expert a money transfer question or try John&#39;s new, free, no-obligation personal service! ,where he helps every step of the way, ensuring you get the best exchange rates on your currency requirements."
    },
    {
        "url": "https://www.currencynews.co.uk/forecast/20240215-40109_2024-02-15-pound-euro-dips-as-uk-recession-confirmed-sterling-below-117.html",
        "title": "Pound Euro Dips as <b>UK</b> Recession Confirmed, Sterling Below 1.17",
        "description": "International Money Transfer? Ask our resident FX expert a money transfer question or try John&#39;s new, free, no-obligation personal service! ,where he helps every step of the way, ensuring you get the best exchange rates on your currency requirements."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/breaking-selena-gomez-shares-new-32136418.amp",
        "title": "Selena Gomez shares new single &#39;Love On&#39; amid romance with boyfriend Benny Blanco",
        "description": "Pop star Selena Gomez has announced on Instagram that her latest single Love On will be out February 22 and fans couldn&#39;t be happier as they suspect it&#39;s about Benny Blanco"
    },
    {
        "url": "https://www.express.co.uk/entertainment/theatre/1867227/Ukraine-ballet-gala-Olga-Smirnova-Russian-ballet-Bolshoi-Ivan-Putrov-London",
        "title": "Russian star who quit Bolshoi over war headlines <b>UK</b> ballet gala for Ukraine this Sunday",
        "description": "EXCLUSIVE: Ukrainian icon Ivan Putrov is joined by Russian former Bolshoi prima ballerina Olga Smirnova at the Dance For Ukraine II gala on Sunday. Olga left her country in protest at the war, and Ivan tells us of the terrible personal cost to his family and home."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hc4nxb",
        "title": "The Art of the <b>Political</b> Interview",
        "description": "Felicity and James discuss the art of the political interview with the TV journalist Rob Burley, who has distilled his lengthy career making politics programmes into a book about the challenges of trying to get straight answers from ministers and Prime Ministers"
    },
    {
        "url": "https://www.hortweek.com/hortweek-survey-political-parties-manifestos-ahead-uk-general-election/turf/article/1861179",
        "title": "HortWeek Survey: What would you like to see on <b>political</b> parties&#39; manifestos ahead of the <b>UK</b> general election?",
        "description": "Tulip Siddiq MP has asked Defra to &quot;make an assessment of the potential impact of petrol leaf blowers on the environment&quot;."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/horsham-predicted-to-become-major-political-battleground-4519737",
        "title": "Horsham predicted to become &#39;major <b>political</b> battleground&#39;",
        "description": "Horsham has been a Conservative stronghold since 1880. POLITICO estimates that, as a new marginal, it could turn Lib Dem. Meanwhile, POLITICO concluded that the ‘red wall’ of working class areas in the north, which historically returned Labour MPs but in 2019 turned Tory, appeared to be returning to Labour."
    },
    {
        "url": "https://metro.co.uk/2024/02/15/lord-dave-told-kiss-ass-us-republican-20284741/?ico=trending-post-strip_item_4",
        "title": "Lord Dave told to ‘kiss my ass’ by US Republican",
        "description": "But what may have been intended as a genuine plea to continue aide for Ukraine’s fight against Putin’s forces has been turned into a <b>political</b> flashpoint for the American conservative party. Republicans have fired back and said the <b>UK</b> is not doing ..."
    },
    {
        "url": "https://www.politico.eu/article/british-politicians-ditch-tiktok-nigel-farage-move-in/",
        "title": "British politicians have ditched TikTok. Nigel Farage is moving in",
        "description": "At first glance, the success of an insurgent party promising to shake up British <b>politics</b> on TikTok, a platform most popular with younger generations, might seem unremarkable. But Reform <b>UK</b>&#39;s fiery rhetoric about migration and culture wars — bigged up by ..."
    },
    {
        "url": "https://www.scmp.com/news/china/diplomacy/article/3251442/china-opening-visa-free-rules-europe-and-asia-why-have-japan-and-uk-not-made-cut",
        "title": "China is opening up visa-free rules for Europe and Asia. Why have Japan and the <b>UK</b> not made the cut?",
        "description": "Exclusion of economic powerhouses Japan and Britain shows China remains mindful of geopolitical considerations even as it seeks to boost post-Covid economy, observers say."
    },
    {
        "url": "https://www.theglobeandmail.com/investing/markets/indices/IXF/pressreleases/24096202/uk-fell-into-recession-at-the-end-of-2023-as-economy-takes-center-stage-in-runup-to-general-election/",
        "title": "<b>UK</b> fell into recession at the end of 2023 as economy takes center stage in runup to general election",
        "description": "In a budget statement next month, Hunt is expected to try to turn the <b>political</b> momentum back for the Conservatives by cutting taxes, though with public finances stretched, government spending may have to be trimmed too. Rachel Reeves, who would replace ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/televisaunivision-revenue-slides-7-q4-175034530.html",
        "title": "TelevisaUnivision Revenue Slides 7% In Q4 On U.S. Advertising Slowdown",
        "description": "Hispanic media giant TelevisaUnivision’s total revenue slid 7% year-over-year to hit $820.7 million in the fourth quarter, hampered by a slowdown in U.S. advertising. Revenue from U.S. advertising fell 5% to $467."
    },
    {
        "url": "https://bylinetimes.com/2024/02/15/another-new-anti-immigration-pressure-group-is-launched-from-tufton-street-and-met-with-reams-of-media-coverage/",
        "title": "Another New Anti-Immigration Pressure Group is Launched from Tufton Street and Met with Reams of Media Coverage",
        "description": "The mysterious case of a tiny new ‘think tank’ launching – and being immediately granted gullible coverage from right-wing papers"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/stormont-committee-will-examine-post-brexit-trading-arrangements-100138/",
        "title": "Stormont committee will examine post-Brexit trading arrangements",
        "description": "The Assembly’s new Stormont brake committee will have scope to assess the impact of Northern Ireland being left in regulatory limbo if it diverges from both EU and UK laws. Members of the Windsor Framework Democratic Scrutiny Committee were told that their work will involve assessing the consequences of applying a new or replacement EU law in Northern Ireland and also the potential ramifications of not applying it."
    },
    {
        "url": "https://www.thegrocer.co.uk/supply-chain/uk-farmers-should-follow-their-european-peers-and-protest/688227.article",
        "title": "<b>UK</b> farmers should follow their European peers and protest",
        "description": "British farmers, meanwhile, are playing catch-up with their counterparts on mainland Europe, and they face a unique cultural challenge in getting their urgent message across. Due to Britain’s early industrialisation, most of the population has no connection with food production; no brother-in-law who grows wheat, no sister who herds cattle."
    },
    {
        "url": "https://www.cyclinguk.org/general-election-2024",
        "title": "General Election 2024",
        "description": "It&#39;s widely expected that the next General Election will take place this year. To make cycling a safe and obvious choice for all, it needs political support. At Cycling UK we are championing this cause, and will continue to do so in the lead up to the election."
    },
    {
        "url": "https://www.standard.co.uk/business/build-to-rent-housing-michael-gove-john-lewis-brownfield-b1139422.html",
        "title": "We must unlock a build-to-rent revolution in London to help house our young people",
        "description": "Planning reform is urgently needed before Michael Gove’s stark warning about the threat to democracy comes true"
    },
    {
        "url": "https://www.ft.com/content/2d887608-82df-4357-a72b-75ccbb3dc8c3",
        "title": "EU clearing rules are a quiet win for London",
        "description": "“LCH (London Clearing House) is the tip of the iceberg . . . you can only have a clearing business if you have the rest of the iceberg,” he adds, pointing to the legal expertise, supervision, common law and other attributes underpinning London’s clearing infrastructure."
    },
    {
        "url": "https://www.lgcplus.com/politics/lgc-briefing/making-the-growth-case-for-fiscal-devolution-15-02-2024/",
        "title": "Making the growth case for fiscal devolution",
        "description": "We suffer a lack of institutional capacity in economic development, writes Jonathan Werran, chief executive of Localis. Today’s top news and views: County"
    },
    {
        "url": "https://www.autism.org.uk/what-we-do/news/jason-arday-announced-as-speaker",
        "title": "Jason Arday announced as speaker at National Autistic Society Annual Professionals’ Conference",
        "description": "Jason Arday has been announced as a speaker at the National Autistic Society’s Annual Professionals’ Conference."
    },
    {
        "url": "https://inews.co.uk/news/world/post-brexit-uk-us-gaza-ceasefire-2907700",
        "title": "Post-Brexit <b>UK</b> will take cues from US over calls for Gaza ceasefire, says expert",
        "description": "The UK is aligning with the US not only because it wants to establish itself on the world stage after Brexit, says a Middle East politics professor at City, University of London"
    },
    {
        "url": "https://news.sky.com/story/the-world-is-on-cusp-of-a-nuclear-arms-space-race-but-it-is-not-a-cause-for-panic-13072308",
        "title": "The world is on cusp of a nuclear arms space race - but it is not a cause for panic",
        "description": "In short, we do not appear to be on the cusp of a nuclear arms race in space. Indeed, even senior US politicians have stated that despite Russia presenting a &quot;significant&quot; threat, this is &quot;not a cause for panic&quot;."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13087337/Spring-rate-cut-cards-economy-stutters.html",
        "title": "Spring interest rate cut back on the cards as economy stutters",
        "description": "Expectations of Spring interest rate cuts have reemerged after a slew of economic data forced a rethink on the outlook for UK monetary policy."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/dup-says-ireland-needs-training-on-belfast-agreement-after-michael-martin-calls-for-stormont-reform-4519254",
        "title": "DUP says Ireland needs ‘training’ on Belfast Agreement after Michael Martin calls for Stormont reform",
        "description": "It follows comments from Ireland’s deputy Prime Minister that &quot;realities of today are not those of 1998 and that the time has come for reform&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13087923/Could-UK-France-form-nuclear-umbrella-Europe.html",
        "title": "Could the <b>UK</b> and France form a &#39;nuclear umbrella&#39; over Europe? German minister calls for Britain to contribute to new nuclear shield as US raises fears that Putin could put ...",
        "description": "Britain and France are Europe&#39;s only nuclear powers, and despite being part of NATO maintain their own independent control over their respective nuclear arsenals."
    },
    {
        "url": "https://www.gg2.net/overseas-student-applications-to-uk-universities-rise-again/",
        "title": "Overseas student applications to <b>UK</b> universities rise again",
        "description": "While the UK government has been tightening immigration norms, the number of international students applying to undergraduate courses in British universities"
    },
    {
        "url": "http://www.abpclub.co.uk/bodyshop-news.php?id=171589",
        "title": "<b>Politics</b> - Shadow Minister for Roads says Labour will reinstate the 2030 date for a ban on internal combustion engine vehicle sales in <b>UK</b>",
        "description": "Bill Esterson, the Shadow Minister for Roads, has told members of electric vehicle trade group Recharge UK that Labour would restore the 2030 date for the end of the sale of new petrol and diesel cars....."
    },
    {
        "url": "https://www.scotsman.com/news/politics/nicola-sturgeon-former-first-minister-told-to-make-statement-on-recording-of-covid-whatsapps-over-zero-message-retention-4520427",
        "title": "Nicola Sturgeon: Former first minister told to make statement on recording of Covid WhatsApps over &#39;zero&#39; message retention",
        "description": "Opposition parties say the SNP government has ‘huge questions’ to answer about WhatsApp messages during the coronavirus pandemic"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/national-security-us-politics-congress-live-news-b2496966.html?page=2",
        "title": "House speaker moves to reassure public over ‘serious national security threat’: Live updates",
        "description": "Exact nature of threat not disclosed by congressional leaders to be briefed by White House national security adviser Jake Sullivan"
    },
    {
        "url": "https://www.derrynow.com/news/northern-ireland/1424284/first-minister-rejects-charge-executive-unwilling-to-make-hard-calls-on-finance.html",
        "title": "First Minister rejects charge Executive unwilling to make hard calls on finance",
        "description": "Stormont’s First Minister has rejected the charge that the new Executive is unwilling to make hard decisions as she vowed to continue the fight to secure more Treasury money for Northern Ireland. Michelle O’Neill and deputy First Minister Emma Little-Pengelly both called for a"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11987400/anas-sarwar-claims-labour-u-turns-show-political-bravery/",
        "title": "Anas Sarwar claims Labour U-turns show ‘<b>political</b> bravery’",
        "description": "LABOUR’s list of recent policy u-turns is an example of “political bravery”, Anas Sarwar claimed today. The Scottish Labour leader – speaking ahead of his party’s conference –"
    },
    {
        "url": "https://www.thenational.scot/news/24122727.scottish-salmon-named-uks-top-food-export-2023/",
        "title": "Scottish salmon named <b>UK</b>’s top food export for 2023",
        "description": "SCOTTISH salmon has been revealed as the UK&#39;s top food expert in 2023, in the latest annual HM Revenue and Customs figures."
    },
    {
        "url": "https://www.itv.com/news/meridian/2024-02-15/toddler-survives-rare-stroke-thanks-to-quick-thinking-parents-and-medical-team",
        "title": "Berkshire toddler survives rare stroke thanks to quick-thinking parents and Southampton medical team",
        "description": "Carter was put in an induced coma and having undergone rehabilitation he&#39;s been able to return home in time for this third birthday. | ITV News Meridian"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/ace-guidance-to-be-updated-after-allegations-of-attempts-to-silence-artists-100131/",
        "title": "ACE guidance to be updated after allegations of ‘attempts to silence artists’",
        "description": "Arts Council England published updates to its relationship framework in January, which has been criticised by Equity."
    },
    {
        "url": "https://uk.movies.yahoo.com/david-tennant-wont-during-bafta-154600956.html",
        "title": "David Tennant on what he won&#39;t do during BAFTA hosting debut",
        "description": "David Tennant has revealed exactly what he won&#39;t be doing as BAFTAs host this weekend. Ahead of the swish awards evening in London on Sunday (February 18), where the likes of Oppenheimer, The Holdovers,"
    },
    {
        "url": "https://uk.style.yahoo.com/having-posh-accent-ick-154233544.html",
        "title": "Is having a posh accent a new ick?",
        "description": "COMMENT: ‘Bake Off’s Prue Leith says she ‘hates’ her posh accent. But speaking RP is rarely a hindrance, argues"
    },
    {
        "url": "https://www.itv.com/news/2024-02-15/is-it-really-rishis-recession",
        "title": "Is it really &#39;Rishi&#39;s recession&#39;?",
        "description": "You can hear his explanation here. “<b>UK</b> slips into recession” is a potentially calamitous headline for the government. The prime minister has made a <b>political</b> pledge and, thus far, he has failed to deliver. Economically, whether the <b>UK</b> economy ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/15/kingswood-wellingborough-byelections-sunak-starmer-labour-conservatives-uk-politics-live-thursday?page=with:block-65ce35498f08b3287a2c201c",
        "title": "Labour accuses Hunt of being ‘out of touch’, with voting under way in Kingswood and Wellingborough byelections – <b>UK politics</b> live",
        "description": "Labour aiming to win two byelections as chancellor defends Sunak’s record, saying ‘economy is turning a corner’"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/uk-world-news/glasgow-film-festival-announces-star-32135063",
        "title": "Glasgow Film Festival announces star-studded line-up for 20th anniversary",
        "description": "Glasgow Film Festival (GFF) has revealed the stars who will be joining them for their 20th anniversary, including Viggo Mortensen and Maxine Peake. Viggo Mortensen, known for his role in The Lord Of The Rings, will take part in a special question and answer session on March 3, to talk about his acting and directing experiences."
    },
    {
        "url": "https://www.derrynow.com/news/national-news/1424228/call-for-reform-to-prevent-future-stormont-powersharing-collapses.html",
        "title": "Call for reform to prevent future Stormont powersharing collapses",
        "description": "Never again should one party in Northern Ireland have the power to collapse the powersharing institutions, Ireland’s deputy premier has said. Tanaiste Micheal Martin said he would like to see reform of the institutions to remove the veto mechanism ahead of the next Assembly election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/recession-latest-news-rishi-sunak-tories-rachel-reeves-live/",
        "title": "<b>Politics</b> latest news: Nigel Farage blames recession on Bank of England",
        "description": "Rachel Reeves, the shadow chancellor, said: “Rishi Sunak’s promise to grow the economy is now in tatters. The Prime Minister can no longer credibly claim that his plan is working or that he has turned the corner on more than fourteen years of economic decline under the Conservatives that has left Britain worse off."
    },
    {
        "url": "https://www.politicshome.com/news/article/recession-rishi-sunak-ons-by-election-economy-budget-labour",
        "title": "Recession Marks The Start Of A Difficult Weekend For Rishi Sunak",
        "description": "Confirmation that the UK has entered a recession brought what felt like a brief period of renewed Tory momentum to a halt as voters went to the"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rachel-reeves-accepted-donation-from-lord-donoughue-linked-to-climate-sceptic-group-gwpf/",
        "title": "Rachel Reeves accepted donation from Lord Donoughue, linked to climate sceptic group GWPF",
        "description": "Rachel Reeves accepted a £10,000 donation from a supporter linked with climate sceptic groups, shortly before Labour ditched its pledge to invest £28bn a year in green energy."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24122515.measles-cases-emerging-outside-original-outbreak-hotspot/",
        "title": "Measles cases emerging outside original outbreak hotspot",
        "description": "Clusters of measles cases have emerged outside of the outbreak hotspot in the West Midlands, new figures show. Cases have been found in London, the North West, Yorkshire and the Humber, and the East Midlands, the UK Health Security Agency (UKHSA) said."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/conservative-mayor-expelled-party-over-105300971.html",
        "title": "Conservative mayor expelled from party over alleged antisemitic remarks",
        "description": "<b>Politics</b> live: Chancellor says government will &#39;stick to our guns&#39; as <b>UK</b> enters recession The complaint alleged the local authority&#39;s mayor made &quot;offensive and inappropriate comments&quot; on both social media and WhatsApp. Now Sky News understands Mr Hoque has ..."
    },
    {
        "url": "https://www.cheshire-live.co.uk/news/chester-cheshire-news/mp-seeks-urgent-answers-over-28642090",
        "title": "MP seeks &#39;urgent&#39; answers over rumours of mothballing Chester’s warship HMS Albion",
        "description": "Chester is a proud military city, and we take our affiliations to units and ships of the <b>UK</b> armed forces seriously. On behalf of those from Chester who have served in the Royal Navy and Royal Marines can I ask whether you plan to mothball HMS Albion?"
    }
]