[
    {
        "url": "https://www.theguardian.com/politics/2023/dec/19/voters-in-wellingborough-trigger-byelection-after-suspension-of-peter-bone",
        "title": "Voters in Wellingborough trigger byelection after suspension of Peter Bone",
        "description": "Keiran Pedley, director of <b>politics</b> at Ipsos <b>UK</b>, has said previously that there would need to be a swing of at least 18 points for Labour to take the seat from the Tories."
    },
    {
        "url": "https://www.theguardian.com/media/live/2023/dec/19/bruce-lehrmann-defamation-trial-updates-day-19-fiona-brown-evidence-brittany-higgins-lisa-wilkinson-the-project-ntwnfb?filterKeyEvents=true&page=with:block-658133468f08a7f5b9269452",
        "title": "Lehrmann proceedings day 19 – as it happened",
        "description": "The “lip-speaker” has travelled from the <b>UK</b> with Reedy to help him answer questions in court ... Brown said there was no “cover-up” for “<b>political</b> expediency” and all the relevant agencies including police and government departments were ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/jeffrey-epstein-more-170-people-31712059",
        "title": "Jeffrey Epstein: More than 170 people set to be named in unsealed court documents",
        "description": "The identities of more than 170 people with ties to sex predator Jeffrey Epstein are set to be named in a trove of court documents ordered to be unsealed"
    },
    {
        "url": "https://news.sky.com/story/the-housing-battle-which-party-will-get-britain-building-13033841",
        "title": "The housing battle – which party will get Britain building?",
        "description": "Homebuilding peaked in 2019/20 at 240,000 a year - up from 120,000 after the financial crisis. But research from the National Housing Federation and Shelter found 340,000 homes would be needed every year in England to keep pace with the ageing and growing population."
    },
    {
        "url": "https://uk.news.yahoo.com/growing-concern-rise-political-extremism-181159960.html",
        "title": "Growing concern at rise of <b>political</b> extremism – Harris",
        "description": "He was speaking after the burning of a disused hotel in Co Galway which had been earmarked for use by asylum seekers."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/how-vote-bbc-sports-personality-28312368",
        "title": "How to vote for BBC Sports Personality of the Year 2023: Online and phone details",
        "description": "BBC SPOTY 2023 takes place at Media City in Salford on Tuesday night, with six nominees for the main prize including Katarina Johnson-Thompson, Stuart Broad and Mary Earps"
    },
    {
        "url": "https://uk.news.yahoo.com/am-writing-express-strong-support-170000862.html",
        "title": "&#39;I am writing to express my strong support for Proportional Representation&#39;",
        "description": "I urge all <b>political</b> parties to prioritise electoral reform and to work together to make Proportional Representation a reality in the <b>UK</b>. Ian Border Homington Salisbury"
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-risk-failed-election-reforms-watchdog-2814661?ITO=msn",
        "title": "<b>UK</b> at risk of ‘failed election’ without major reforms, watchdog warns",
        "description": "The chief of the Electoral Commission said laws needed to be simplified to ensure public confidence in elections"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/james-cleverly-rwanda-home-secretary-supreme-court-african-b2466847.html",
        "title": "Cleverly ‘very confident’ Rwanda will abide by asylum deal terms",
        "description": "He later said the “<b>political</b> desire within Rwanda to be seen to be successful ... “They (Rwanda) recognise that the <b>UK</b> is not the only country that wants to do this. So, once again, they have an incentive to show that this works."
    },
    {
        "url": "https://www.kentonline.co.uk/thanet/news/council-in-dark-over-government-s-precise-plans-for-secure-298847/",
        "title": "Government pledges to keep Thanet council informed of its plans for a ‘secure migrant removal centre’ at Manston – but gives no new details",
        "description": "The government has pledged to keep a council informed of its plans for an immigration processing centre – but stopped short of giving any details."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/james-cleverly-rwanda-home-secretary-supreme-court-african-b1128093.html",
        "title": "Cleverly ‘very confident’ Rwanda will abide by asylum deal terms",
        "description": "Speaking to the Lords International Agreements Committee on Tuesday, he insisted he had a “very high degree of confidence” that Rwanda would abide by the terms of the agreement struck with the UK, adding that “much of the world is watching” and “everyone’s going to be marking their homework”."
    },
    {
        "url": "https://www.mirror.co.uk/sport/football/news/ryan-reynolds-wrexham-housing-tourism-31711401",
        "title": "Ryan Reynolds impact on Wrexham laid bare as staggering landmark passed",
        "description": "Football fans are keen to live in Wrexham following the club&#39;s takeover, revealing just how popular the Welsh city has become since Ryan Reynolds and Rob McElhenney&#39;s involvement in the football club"
    },
    {
        "url": "https://inews.co.uk/news/politics/snp-raises-top-rate-tax-scotland-48-2816973",
        "title": "SNP raises top rate of tax in Scotland to 48%",
        "description": "The Conservatives accused the Scottish Government of harming businesses and punishing taxpayers with higher income tax rates"
    },
    {
        "url": "https://theboar.org/2023/12/russell-howard-live-at-the-warwick-arts-centre/",
        "title": "Russell Howard Live at the Warwick Arts Centre",
        "description": "Russell Howard has become one of the most popular British comedians of our generation. Renowned for his ability to make light of even the darkest of headlines, it’s no surprise that tickets for Howard’s tour have been in incredibly high demand."
    },
    {
        "url": "https://news.stv.tv/politics/snp-mps-call-for-santa-claus-contribution-to-christmas-to-be-recognised-in-parliament",
        "title": "SNP MPs call for Santa&#39;s contribution to Christmas to be recognised",
        "description": "A motion signed by SNP MPs called on the UK Government to &#39;acknowledge the contribution of the idea of Santa Claus to Christmas&#39;."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/19/no-firm-date-for-stopping-the-boats-admits-rishi-sunak/",
        "title": "No firm date for stopping the boats, admits Sunak",
        "description": "Rishi Sunak has said there is no “firm date” for when he will deliver his promise of stopping small boat Channel crossings despite making it one of his five priorities in office."
    },
    {
        "url": "https://www.thenational.scot/politics/24001322.michelle-mone-scandal-uncovers-new-depths-tory-duplicity/",
        "title": "Michelle Mone scandal uncovers new depths of Tory duplicity",
        "description": "Dame Meg Hillier MP, Chair of the Public Accounts Committee, said: &quot;The story of PPE purchasing is perhaps the most shameful episode the <b>UK</b> government response to ... tell foreigners to butt out of British <b>politics</b>? Peterson has said many crazy things ..."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-slapped-down-by-statistics-watchdog-for-wrongly-claiming-debt-is-falling-13034204",
        "title": "Rishi Sunak slapped down by statistics watchdog for wrongly claiming debt is falling",
        "description": "The statistics watchdog says claims by Mr Sunak gave the impression debt is falling or decisions had lowered it at fiscal events - &quot;neither of which is the case&quot;."
    },
    {
        "url": "https://www.itv.com/news/utv/2023-12-19/large-scale-industrial-action-planned-as-unions-announce-simultaneous-strikes",
        "title": "Large-scale industrial action planned as unions announce simultaneous strikes",
        "description": "Industrial action will impact schools and hospitals across Northern Ireland as multiple unions have announced strike action on the same day in January. | UTV News"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1847373/Keir-Starmer-tax-rise-fears",
        "title": "Keir Starmer will hike taxes if he wins power - just look at what&#39;s happened in Wales",
        "description": "Senior minister Laura Trott warns: &quot;Labour in Wales have today done what Labour always do in power - raised taxes.&quot;"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/new-income-tax-band-to-provide-additional-revenue-for-public-336404/",
        "title": "New income tax band to provide additional revenue for public services in Scotland",
        "description": "Amongst the proposals are a new income tax band for Scotland which will raise additional revenue Deputy First Minister and Finance Secretary Shona Robison has announced. The Advanced rate band will apply a 45 per cent tax rate on annual income between £75,000 and £125,140."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67759768?at_medium=RSS&at_campaign=KARANGA",
        "title": "Statistics watchdog rebukes Rishi Sunak over claim debt falling",
        "description": "In a letter in response, Sir Robert said the PM&#39;s office had told the watchdog the claims referred to the fact that the Office for Budget Responsibility was forecasting debt would be falling as a proportion of GDP in the final year of its five-year forecast."
    },
    {
        "url": "https://betting.betfair.com/politics/uk-politics/next-general-election-odds---michelle-mone-killing-tory-chances-191223-171.html",
        "title": "<b>UK Politics</b>: Michelle Mone could hammer the final into the Tory coffin",
        "description": "With the Tories at rock-bottom going into an election year, politics betting expert Paul Krishnamurty says the PPE scandal could deal a mortal blow"
    },
    {
        "url": "https://www.thenational.scot/politics/24000163.five-best-books-economy-written-2023/",
        "title": "The five best books about the economy written in 2023",
        "description": "It’s been another bumper year for books on the economy, and there have been some fantastic titles this year. We select our top five and"
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-mp-calls-on-uk-parliament-to-recognise-santas-contribution-to-christmas-4451923",
        "title": "SNP MP calls on <b>UK</b> Parliament to recognise Santa&#39;s contribution to Christmas",
        "description": "“This led me to wonder how I might look to have a similar statement made in the <b>UK</b> Parliament. “With so much division and anger in <b>politics</b> these days it’s nice to be able to sometimes bring a lighter touch, which I’d hope everyone would take in ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rishi-sunak-slammed-by-statistics-watchdog-over-misleading-debt-claims_uk_6581df66e4b036ecab46db4b?d_id=7095464&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Rishi Sunak Slammed By Statistics Watchdog Over Misleading Debt Claims",
        "description": "He claimed in a social media video, and also in the House of Commons, that debt was falling. But Sir Robert Chote, chair of the UK Statistics Authority, said that was misleading. In a letter to Lib Dem Treasury spokesperson Sarah Olney,"
    },
    {
        "url": "https://news.sky.com/story/tory-mp-lucky-to-be-alive-after-undergoing-extreme-surgery-for-sepsis-13034091?dcmp=snt-sf-twitter",
        "title": "Tory MP &#39;lucky to be alive&#39; after undergoing &#39;extreme surgery&#39; for Sepsis",
        "description": "On the right of the Tory party, Mr Mackinlay&#39;s <b>political</b> career began as a member for UKIP, which he briefly led in 1999. But claiming he was concerned about &quot;the direction&quot; it was going in, he left in 2005 and joined the Conservative Party."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/sunak-may-undermined-trust-claims-172136356.html",
        "title": "Sunak may have undermined trust with claims to have ‘reduced debt’ – watchdog",
        "description": "But the chairman of the <b>UK</b> Statistics Authority (UKSA ... “Instead, he has reached for the Boris Johnson playbook and is undermining trust in <b>politics</b>. This is desperate stuff from a desperate Prime Minister, and it is right that he has been called ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2023/dec/19/michael-gove-sadiq-khan-housebuilding-planning-policy-england-rishi-sunak-scotland-budget-keir-starmer-uk-politics-latest?filterKeyEvents=false&page=with:block-6581dca08f086a010de36f62",
        "title": "Sunak rebuked by <b>UK</b>’s statistics watchdog for making misleading claim about government debt – <b>UK politics</b> live",
        "description": "Rishi Sunak has been rebuked by the <b>UK</b>’s statistics watchdog for making misleading claims ... other senior politicians, departments and <b>political</b> parties ask themselves how someone with an interest but little specialist knowledge is likely to interpret ..."
    }
]