[
    {
        "url": "https://news.sky.com/story/rwanda-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-as-bill-passes-latest-lords-hurdle-13059470",
        "title": "Rwanda: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury as bill passes latest Lords hurdle",
        "description": "Justin Welby says plans to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;. But peers nod the scheme through - for now."
    },
    {
        "url": "https://www.telegraph.co.uk/tv/0/putin-vs-the-west-at-war-bbc-review/",
        "title": "Putin vs the West: At War, review: the inside story of the war that took world leaders by surprise",
        "description": "Boris Johnson and Bill Burns are among those sharing their memories in the second series of Norma Percy&#39;s impressive documentary"
    },
    {
        "url": "https://www.mirror.co.uk/news/world-news/convoy-heading-towards-israel-border-31996951",
        "title": "Convoy heading towards Israel border with Lebanon as Middle East braces for war",
        "description": "President Joe Biden vowed the US “shall respond” to the attack on ­logistics base Tower 22 in Jordan which was hit by increasingly aggressive pro-Iranian militia who are based in Syria"
    },
    {
        "url": "https://www.newhamrecorder.co.uk/news/national/24083081.police-brazil-investigate-bolsonaros-son-alleged-spying-opponents/",
        "title": "Police in Brazil investigate Bolsonaro’s son for alleged spying on opponents",
        "description": "Police said they conducted nine searches on Monday as part of a broader investigation into the nation’s intelligence agency."
    },
    {
        "url": "https://www.thesun.co.uk/news/25589294/wembley-fire-blaze-london-flats-evacuated/",
        "title": "Wembley fire: Huge blaze erupts at London block of flats with residents evacuated as 125 firefighters tackle inferno",
        "description": "A HUGE blaze has erupted at a black of flats in West London. Locals in Elm Road, Wembley, were forced to evacuate their homes as 125 firefighters tackled the inferno. Part of the buildings roof"
    },
    {
        "url": "https://www.thetimes.co.uk/article/expats-voting-general-election-campaign-swdl7vgr3",
        "title": "Tories hunt polling-day proxies to make most of expat vote",
        "description": "The move follows a change in the law that removed the requirement on expats to have lived in the <b>UK</b> in the past 15 years to vote at a parliamentary election. It enfranchised around 2.1 million people who are now being targeted by <b>political</b> parties ahead of ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-grandee-ken-clarke-rwanda-bill-black-white-2879467",
        "title": "Tory grandee Ken Clarke savages Rwanda Bill: ‘It’s like saying all dogs are cats’",
        "description": "Tory grandee Ken Clarke has savaged Rishi Sunak’s Rwanda laws with a warning that they risk moving the UK towards an “elected dictatorship”. The former chancellor reversed his previous support for legislation related to the controversial deportation deal, warning that the Prime Minister’s latest move was a “a step too far”."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/sunaks-rwanda-plan-faces-more-hurdles-as-tory-peers-condemn-policy",
        "title": "Sunak’s Rwanda plan faces more hurdles as Tory peers condemn policy",
        "description": "In a highly praised speech, the crossbench constitutional expert Lord Hennessy said the bill would diminish the <b>UK</b>’s standing in the world ... secured for itself a special place in British <b>political</b> history,” he said. “The day may not be far ..."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/29/middle-east-crisis-live-updates-jordan-drone-strike-iran-biden-us-soldiers-killed-hamas-israel-gaza-palestine-war-news?page=with:block-65b713378f08f89f155edb5e&filterKeyEvents=true",
        "title": "Middle East crisis live: US troops killed in drone strike named; White House condemns Israeli ministers’ Gaza resettlement remarks",
        "description": "Sgt William Rivers, 46, Spc Kennedy Sanders, 24, and Spc Breonna Moffett, 23, named by Pentagon; White House calls comments ‘reckless and incendiary’"
    },
    {
        "url": "https://www.bracknellnews.co.uk/news/national/24082942.enemy-drone-killed-us-troops-mistaken-us-drone-report-suggests/",
        "title": "Enemy drone that killed US troops ‘mistaken for US drone’, report suggests",
        "description": "As the enemy drone was flying in at a low altitude, a US drone was returning to the small desert installation known as Tower 22."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/aging-mobster-avoids-10-years-31996551",
        "title": "Aging mobster avoids 10 years in prison after stealing Wizard of Oz ruby slippers",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. Throughout the investigation, authorities posted a reward for returning the shoes set at $250,000 and an anonymous donor later put up a $1 million offer."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24083005.donaldson-arrives-meeting-dup-executive-stormont-block/",
        "title": "Donaldson arrives for meeting with DUP executive over Stormont block",
        "description": "While the deal being offered by the Government will seek to reduce red tape and offer additional measures aimed at strengthening GB-NI ties, they will not result in the axing of the EU and the <b>UK</b>’s jointly agreed protocol and framework. Last week ..."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24082330.researchers-identify-cases-alzheimers-believed-passed-donors/",
        "title": "Researchers identify cases of Alzheimer’s believed to be passed on from donors",
        "description": "Between 1959 and 1985, this was used to treat at least 1,848 people in the <b>UK</b> and used for various causes of short stature – when a child or a teen is well below the average height of their peers. But the treatment was withdrawn in 1985 after it was ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/david-cameron-family-british-ukraine-alexei-navalny-b2486678.html",
        "title": "Cameron urged to act as British-Russian dissident vanishes from Siberian prison",
        "description": "Murza, a British citizen, is serving a 25-year sentence for treason over his opposition to Russia’s invasion of Ukraine."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24082952.uk-awaiting-outcome-inquiries-decision-un-gaza-relief-agency-funds/",
        "title": "<b>UK</b> awaiting outcome of inquiries before decision on UN Gaza relief agency funds",
        "description": "Foreign Office minister Andrew Mitchell said he was ‘appalled’ by allegations that UNRWA staff were involved in October 7 attack on Israel."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/farce-as-details-of-top-secret-dup-executive-briefing-leaked-on-social-media-amid-claims-of-meeting-mayhem/a370896325.html",
        "title": "Farce as details of top secret DUP executive briefing leaked on social media amid claims of ‘meeting mayhem’",
        "description": "A DUP executive meeting descended into farce tonight after key elements of Sir Jeffrey Donaldson’s private briefing were live-tweeted by loyalist blogger Jamie Bryson."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/farce-as-details-of-top-secret-dup-executive-meeting-appear-on-social-media-as-protestors-warn-against-sell-out/a370896325.html",
        "title": "Farce as details of top secret DUP executive meeting appear on social media as protestors warn against &#39;sell out’",
        "description": "A DUP executive meeting descended into farce tonight after key elements of Sir Jeffrey Donaldson’s private briefing were live-tweeted by loyalist blogger Jamie Bryson."
    },
    {
        "url": "https://www.scotsman.com/news/politics/uk-covid-inquiry-snp-ministers-and-nicola-sturgeon-motivated-by-constitutional-politics-at-times-during-covid-suggests-michael-gove-4496821",
        "title": "<b>UK</b> Covid Inquiry: SNP ministers and Nicola Sturgeon motivated by constitutional <b>politics</b> at times during Covid, suggests Michael Gove",
        "description": "Nicola Sturgeon sought to diverge from the UK Government at certain points during the coronavirus pandemic in order to advance the SNP’s “political agenda”, Michael Gove has suggested to the UK Covid Inquiry."
    },
    {
        "url": "https://www.fool.co.uk/2024/01/29/20000-invested-in-these-cheap-ftse-250-shares-could-make-me-1430-in-passive-income/",
        "title": "£20,000 invested in these cheap FTSE 250 dividend shares could make me £1,430 in passive income!",
        "description": "These top dividend shares are on sale right now! Royston Wild explains why they could be a great way for investors to turbocharge their passive income."
    },
    {
        "url": "https://inews.co.uk/news/politics/world-dangerous-cold-war-uk-government-2879511",
        "title": "World now as dangerous as in the Cold War, <b>UK</b> government believes",
        "description": "Cameron’s anticipated intervention is likely to fuel the debate over defence spending, with Conservative hawks and military leaders pushing for the <b>UK</b> to boost the defence ... strategists are planning to ramp up <b>political</b> attacks on Cameron, raising ..."
    },
    {
        "url": "https://news.sky.com/story/covid-inquiry-ex-scottish-health-secretary-jeane-freeman-says-she-will-regret-care-home-deaths-for-rest-of-her-life-13059222",
        "title": "COVID inquiry: Ex-Scottish health secretary Jeane Freeman says she &#39;will regret care home deaths for rest of her life&#39;",
        "description": "Mr Gove rejected a suggestion the <b>UK</b> government had used the pandemic to strengthen support for the union, as he argued Scottish ministers diverged on policy to advance their &quot;<b>political</b> agenda&quot;. The levelling up secretary claimed language used in WhatsApp ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/29/laurence-fox-libel-two-men-paedophile-slur-judge-rules-20188927/?ico=trending-post-strip_item_3",
        "title": "Laurence Fox kisses partner outside courts after judge rules ‘paedophile’ slur libellous",
        "description": "‘Mr Fox’s principal project is to put his views and challenges about racism to the <b>UK</b> electorate in the <b>political</b> arena. ‘That, rather than a court of law, is in any event likely to be the determinative last word in relation to his reputation on such ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24082883.dup-leader-meets-party-members-ahead-crunch-gathering-stormont-return/",
        "title": "DUP leader meets party members ahead of crunch gathering on Stormont return",
        "description": "The invitation said the gathering would see Sir Jeffrey provide a “detailed update on the current <b>political</b> situation ... they will not result in the axing of the EU and the <b>UK</b>’s jointly agreed protocol and framework. Last week, in an impassioned ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-norfolk-68133873.amp",
        "title": "George Freeman quit as minister as he &#39;couldn&#39;t afford&#39; mortgage",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... &quot;We&#39;re in danger of making <b>politics</b> something only hedge fund donors ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68133057",
        "title": "Rochdale by-election triggered after Sir Tony Lloyd&#39;s death",
        "description": "You can also send story ideas to northwest.newsonline@bbc.co.<b>uk</b> How do people say they will vote in the <b>UK</b> ... Laura Kuenssberg takes a snapshot of what voters in key seats think about the state of <b>politics</b>."
    },
    {
        "url": "https://uk.movies.yahoo.com/laurence-fox-loses-libel-case-180211631.html",
        "title": "Laurence Fox Loses Libel Case After Calling Former ‘RuPaul’s Drag Race <b>UK</b>’ Star A Paedophile",
        "description": "Crystal, whose real name is Colin Munro Seymour, competed in the first season of Drag Race in the <b>UK</b>. Fox counter-sued the pair over ... over the past few years and has launched his own <b>political</b> party, Reclaim. Last year, his misogynistic rant on GB ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68130313",
        "title": "Michael Gove tells inquiry &#39;personalities do matter in <b>politics</b>&#39;",
        "description": "Michael Gove has told the <b>UK</b> Covid Inquiry that some Scottish government ministers were interested in making <b>political</b> points during discussions over the handling of the pandemic. The <b>UK</b> secretary of state for levelling up, housing and communities said ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68079726.amp",
        "title": "General election 2024 poll tracker: How do the parties compare?",
        "description": "The last possible date a general election can be held is 28 January 2025, writes BBC senior <b>political</b> analyst Peter Barnes ... although some do poll the whole of the <b>UK</b>. People surveyed do not get the option to choose parties which only stand in Northern ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/teesworks-inquiry-rejects-illegality-claims-28534396",
        "title": "Teesworks inquiry rejects illegality claims but raises questions on openness",
        "description": "Government Minister Lee Rowley said that Teesworks was the <b>UK</b>’s largest remediation zone, and should not be used as a <b>political</b> football. He said there was “no corruption, no illegality”. But Shadow Minister Justin Madders said the report was ..."
    },
    {
        "url": "https://www.standard.co.uk/news/crime/laurence-fox-fox-justice-nicola-thorp-high-court-b1135598.html",
        "title": "Laurence Fox considering appeal after losing High Court libel battle",
        "description": "She said: “Mr Fox’s principal project is to put his views and challenges about racism to the <b>UK</b> electorate in the <b>political</b> arena. “That, rather than a court of law, is in any event likely to be the determinative last word in relation to his ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/uk-news/laurence-fox-loses-high-court-28534221",
        "title": "Laurence Fox loses High Court libel battle - and says he&#39;s &#39;£2m in&#39;",
        "description": "She said: “Mr Fox’s principal project is to put his views and challenges about racism to the <b>UK</b> electorate in the <b>political</b> arena. That, rather than a court of law, is in any event likely to be the determinative last word in relation to his reputation ..."
    },
    {
        "url": "https://bylinetimes.com/2024/01/29/the-bbc-vs-the-post-office-the-undeclared-conflict-of-interest-as-panorama-investigated-the-horizon-scandal/",
        "title": "The BBC vs The Post Office: The Undeclared Conflict of Interest as Panorama Investigated the Horizon Scandal",
        "description": "In the summer of 2015 our BBC Panorama, Trouble At The Post Office, kept on not making the airwaves. Meanwhile, the chair of the Post Office, Alice Perkins, was leading its cover-up of the Horizon scandal from a secretive sub-committee, ‘Operation ..."
    },
    {
        "url": "https://www.ft.com/content/b89002bd-f3cc-45bd-ae46-18b88a481ffe?sharetype=gift",
        "title": "Housebuilders throw support behind Labour as Tories ‘bow to Nimbyism’",
        "description": "Housebuilders are overwhelmingly backing the Labour party to win the next <b>UK</b> election, as government concessions to ... steps on housing was “scarcely believable . . . Of all <b>political</b> parties, that is the one thing they tend to get right”."
    },
    {
        "url": "https://www.thetimes.co.uk/article/0bbb2d47-687d-4b5f-bbf6-22f54321120a?shareToken=6b166e93ee196c19474f39288a8cf759",
        "title": "Anti-EU populists poised to dominate in European elections",
        "description": "Europe faces a <b>political</b> earthquake with “anti-European populists” poised to be the main winners in continent-wide elections this June, according to a new forecast. A close ally of President Macron has warned that the EU will become “ungovernable ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/world-dangerous-cold-war-uk-government-2879511?ico=in-line_link",
        "title": "World now as dangerous as in the Cold War, <b>UK</b> government believes",
        "description": "The world is now more dangerous than any time since the Cold War, Lord Cameron is expected to warn as he pushes for the UK to strengthen its defences against hostile actors. The Foreign Secretary is planning to make his first major speech since rejoining the Government in the coming weeks, i understands."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-northern-ireland-politics-68031910?src_origin=BBCS_BBC",
        "title": "DUP members meeting over possible devolution deal",
        "description": "It’s the law. Ciaran McCauley and Rebekah Wilson All times stated are <b>UK</b> Jayne McCormack BBC News NI <b>political</b> correspondent Protestors have gathered at Larchfield Estate ahead of the DUP executive meeting, despite the fact the entrance is in pitch black ..."
    },
    {
        "url": "https://www.ft.com/content/8fd52932-b5b6-42eb-a251-b9d1e2187ded",
        "title": "Ex-minister blames mortgage hike for his quitting <b>UK</b> government post",
        "description": "George Freeman warns politics becoming unaffordable and says £118,300 salary not enough to cover home loan payments"
    },
    {
        "url": "https://news.sky.com/story/rwanda-bill-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-13059470",
        "title": "Rwanda bill: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury",
        "description": "As the House of Lords debates the government&#39;s small boats legislation, Justin Welby says its plan to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/northern-ireland-protocol-dup-leader-sir-jeffrey-donaldson-meets-party-members-ahead-of-crunch-gathering-on-stormont-return-4497488",
        "title": "Northern Ireland Protocol: DUP leader Sir Jeffrey Donaldson meets party members ahead of crunch gathering on Stormont return",
        "description": "The invitation said the gathering would see Sir Jeffrey provide a “detailed update on the current <b>political</b> situation ... they will not result in the axing of the EU and the <b>UK</b>’s jointly agreed protocol and framework. Last week, in an impassioned ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7148887",
        "title": "<b>Politics</b> latest: Tory MP quit six-figure minister role because he &#39;couldn&#39;t afford mortgage&#39;",
        "description": "&quot;That&#39;s <b>political</b> economy 2.0. &quot;We&#39;re in danger of making <b>politics</b> ... He said it is damaging for asylum seekers and the <b>UK</b>&#39;s reputation, contradicting the prime minister who has spoken &quot;on the value and importance of international law for this country&quot;."
    },
    {
        "url": "https://www.thesun.co.uk/news/25583010/iranian-terror-plot-assassinate-presenters/",
        "title": "Horror Iranian terror plot to assassinate top Brit TV news presenters is FOILED as <b>UK</b> slaps sanctions on officials",
        "description": "A HORRIFIC Iranian plot to assassinate top British TV news presenters has been foiled. The <b>UK</b> has now slapped travel bans and frozen the assets of eight senior Iranian officials. US President Joe Biden has vowed to hold those responsible for the three ..."
    },
    {
        "url": "https://www.thenational.scot/news/24082460.uk-vape-ban-scottish-pressure-forced-uk-ban-campaigner-says/",
        "title": "<b>UK</b> vape ban: Scottish pressure forced <b>UK</b> ban, campaigner says",
        "description": "“It’s great we’ve realised working together is the best way we can do this. It would just be playing <b>politics</b> if they [the <b>UK</b> Government] decided not to do it, it’s so clear cut. “Scotland has been really influential in bringing the <b>UK</b> Government ..."
    },
    {
        "url": "https://www.thenational.scot/news/24082258.brexit-experts-debate-keep-scotlands-voice-alive-europe/",
        "title": "Brexit: Experts to debate how to keep Scotland&#39;s voice alive in Europe",
        "description": "On Wednesday Europe for Scotland will host an online panel discussion called Beyond Brexit, which will dig into the question of how to keep Scotland relevant on the European <b>political</b> stage following the <b>UK</b>’s departure from the bloc. In June ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/29/russian-tv-host-taunts-america-predicts-civil-war-2-0-us-20187593/?ico=trending-module_author_sarah-hooper_item-5",
        "title": "US ‘is heading towards civil war 2.0’, TV host warns gleefully",
        "description": "Sergey Mardan commented on the possibility of the US <b>political</b> tensions hindering future military aid ... news Want to be the first to hear the world’s top stories? Metro.co.<b>uk</b> is now on WhatsApp sending vital updates and top trending stories straight ..."
    },
    {
        "url": "https://uk.style.yahoo.com/laurence-fox-loses-libel-case-180211631.html",
        "title": "Laurence Fox Loses Libel Case After Calling Former ‘RuPaul’s Drag Race <b>UK</b>’ Star A Paedophile",
        "description": "Crystal, whose real name is Colin Munro Seymour, competed in the first season of Drag Race in the <b>UK</b>. Fox counter-sued the pair over ... over the past few years and has launched his own <b>political</b> party, Reclaim. Last year, his misogynistic rant on GB ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/dup-stormont-micheal-martin-government-uk-government-b1135609.html",
        "title": "DUP leader meets party members ahead of crunch gathering on Stormont return",
        "description": "The invitation said the gathering would see Sir Jeffrey provide a “detailed update on the current <b>political</b> situation ... they will not result in the axing of the EU and the <b>UK</b>’s jointly agreed protocol and framework. Last week, in an impassioned ..."
    }
]