[
    {
        "url": "https://www.dailymail.co.uk/news/article-12897211/abhorrent-export-live-animals-Europe-end.html",
        "title": "Four years after I was mocked for saying it would be a huge benefit of Brexit...At last! The abhorrent export of live animals to Europe is about to end",
        "description": "An old sheep will sell in the <b>UK</b> for £70 but one destined for onward travel in the ... The hall was crammed with celebrities as well as MPs from all <b>political</b> parties. Ranulph Fiennes, for instance, was determined to add his support so drove up from ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/royals/article-12897209/King-Charles-Christmas-day-broadcast-environment.html",
        "title": "Eco-activist King Charles will use Christmas day broadcast to deliver powerful message about the environment to millions of viewers across the country",
        "description": "The move is likely to raise eyebrows given Justin Welby’s <b>political</b> interventions ... which was seen by 10.6 million viewers in the <b>UK</b>. The film opens on December 13, 2022, at Windsor Castle, and features the King saying of the message: ‘Well I ..."
    },
    {
        "url": "https://inews.co.uk/news/king-charles-deliver-second-christmas-speech-2823531?ico=most_popular",
        "title": "King Charles to deliver second Christmas speech",
        "description": "The Royal Christmas Broadcast, delivered nearly every year for more than 90 years, addresses social, <b>political</b> and technological trends as well as providing rare insight into the personal reflections of the monarch. The first Christmas broadcast was ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/23/lord-cameron-insists-play-no-role-telegraph-sale-uae/",
        "title": "Cameron insists he will play no role in review of UAE-backed Telegraph takeover",
        "description": "Foreign Secretary says review of a takeover involving Abu Dhabi is entirely a matter for Lucy Frazer, the Culture Secretary"
    },
    {
        "url": "https://www.thetimes.co.uk/podcasts/stories-of-our-times?trk=public_post_comment-text",
        "title": "Stories of our times",
        "description": "As well as being a fan of the British PM, she&#39;s also a devotee of one of the <b>UK</b>&#39;s most famous writers - author of The ... Rishi Sunak finds himself fighting for his <b>political</b> reputation on two fronts: immigration and his... America’s opioid crisis ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/cameron-warns-of-destructive-potential-of-small-boats-issue-34WJ7WW4VBMG7MF5Y66HWSUQCM/",
        "title": "Cameron warns of ‘destructive’ potential of small boats issue",
        "description": "Failing to tackle the small boats problem would be “destructive” to people’s faith in <b>politics</b>, Lord David Cameron has said ... South Korean President state visit to the <b>UK</b> Lord Cameron backed Rishi Sunak’s drive to ‘stop the boats’ He ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/james-cleverly-joked-giving-wife-31741719?trk=public_post_comment-text",
        "title": "James Cleverly joked about giving wife date-rape drug after announcing new spiking law",
        "description": "Colin Mackie, chair of Spike Aware <b>UK</b>, who lost a child through drink spiking ... Women’s Aid said: “We rely on <b>political</b> leaders to take action to end violence against women and girls and the misogyny that underpins it. It is vital that spiking ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/breaking-kate-garraway-heartbroken-prepares-31741977.amp",
        "title": "Kate Garraway &#39;heartbroken&#39; as she prepares to spend Christmas Day by Derek&#39;s hospital bedside",
        "description": "Derek, the 56-year-old <b>political</b> advisor has been left &quot;fighting for his life ... the-clock care after becoming one of the worst affected long Covid sufferers in the <b>UK</b>. TV presenter Kate, 56, and her two children Darcey, 17, and Billy, 14, will remain ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25154403/shoppers-rave-over-1p-winter-gadget/",
        "title": "Shoppers rave over winter gadget that costs just 1p per hour to run to avoid putting the heating on",
        "description": "With the cost of living crisis well and truly effecting people in the <b>UK</b>, grabbing one of these blankets is one step in the right direction for reducing expenses. Elsewhere, one man has shared a genius gadget that will mean you can say goodbye to cold ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12897381/James-Dyson-snobbery-holding-British-manufacturing.html",
        "title": "James Dyson claims &#39;snobbery&#39; is holding back British manufacturing as he blames views on Charles Dickens&#39;s portrayal of entrepreneurs",
        "description": "Sir James urged the <b>UK</b> to focus on growth not inflation. &#39;Wealth generation and growth became dirty words,&#39; he said, adding: &#39;If you&#39;ve got growth, a bit of inflation doesn&#39;t matter.&#39;"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-foreign-secretary-foreign-office-rwanda-mps-b1128890.html",
        "title": "Cameron warns of ‘destructive’ potential of small boats issue",
        "description": "Lord Cameron said tackling the problem was important to protect the UK’s immigration system and people’s trust in politics."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24010318.cameron-steps-warnings-irans-malign-influence/",
        "title": "Cameron steps up warnings about Iran’s ‘malign influence’",
        "description": "Foreign Secretary Lord David Cameron said the UK and allies needed to develop a strong set of deterrent measures against Iran."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12896405/Balls-gall-blame-London-Stock-Exchange.html?mrn_rm=rta",
        "title": "Balls has the gall to blame London Stock Exchange",
        "description": "Balls has called for a break-up of the London Stock Exchange Group - the company behind the world&#39;s oldest bourse."
    },
    {
        "url": "https://www.thesun.co.uk/news/25153420/majed-al-zeer-hamas-liaison-europe/",
        "title": "Brit activist pictured with Jeremy Corbyn accused of being Hamas’s key liaison in Europe",
        "description": "A BRITISH man who has been pictured with Jeremy Corbyn is accused of being Hamas’s key liaison in Europe. Prominent pro-Palestinian activist Majed Al-Zeer, 61, is alleged to have contacts at the"
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1848728/family-primacy-recognise",
        "title": "We must ensure no family is left behind",
        "description": "Recent data revealed by the CSJ’s Social Justice Commission in its Two Nations: The State of Poverty in the <b>UK</b> report reveals that family breakdown disproportionately affects the most impoverished communities, highlighting a significant social issue that ..."
    },
    {
        "url": "https://www.landlordzone.co.uk/news/the-war-on-landlords-are-these-bogeymen-to-blame-for-the-housing-crisis",
        "title": "The war on landlords: are these “bogeymen” to blame for the housing crisis?",
        "description": "“It is landlords who have borne the brunt of the country’s angst in the face of a housing crisis. This is despite new homes in England being built at an annual rate of 234,400 – well below the Government’s 300,000 target – and the country’s rental supply having not budged in over a decade,” says the Daily Telegraph."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24009971.pro-palestinian-protesters-target-zara-stores-londons-west-end/",
        "title": "Pro-Palestinian protesters target Zara stores in London’s West End",
        "description": "Pro-Palestinian protesters targeted fashion giant Zara as they urged Christmas shoppers to boycott “Israeli-linked” brands in London. Hundreds marched on Oxford Street, Regent Street and Carnaby Street, busy shopping districts in the capital’s West End, bringing traffic to a standstill on Saturday afternoon."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/mps-push-santa-clause-stop-31741187.amp",
        "title": "MPs push for &#39;Santa Clause&#39; to stop reindeer being shipped out of <b>UK</b> for slaughter",
        "description": "Tabled by former leader Tim Farron, the amendment seeks to ensure that live reindeer cannot be taken out of Britain for slaughter elsewhere"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/12/23/assisted-dying-drugs-patients-not-take-oregon-suicide/",
        "title": "Third of patients given lethal drugs under right-to-die laws ‘do not take them’",
        "description": "Studies of US states show many prescribed assisted dying pills change their mind and experts say prescription is used as ‘insurance policy’"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1848694/rwanda-tories-general-election",
        "title": "Rwanda will tear Tories apart or force snap election, MPs warn",
        "description": "Tensions escalate over Rishi Sunak&#39;s proposal to send asylum seekers to Rwanda, triggering warnings of a possible crisis within the Tory party."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24001238.tesco-customers-basingstoke-donate-food-charities/",
        "title": "Tesco customers in Basingstoke donate to food charities",
        "description": "The Trussell Trust works to end the need for foodbanks in the <b>UK</b>, as well as supporting people facing hardship with emergency food supplies while FareShare aims to relieve food poverty and reduce food waste in the <b>UK</b>. READ MORE: Harry Potter and Queen&#39;s ..."
    },
    {
        "url": "https://news.sky.com/story/senior-tories-pile-pressure-on-rishi-sunak-to-back-immediate-gaza-ceasefire-13033693?dcmp=snt-sf-twitter",
        "title": "Senior Tories pile pressure on Rishi Sunak to back immediate Gaza ceasefire",
        "description": "Mr Bristow told Sky News&#39;s <b>Politics</b> Hub with Sophy Ridge that on top of the MPs who signed the letter, there were &quot;many more behind the scenes&quot; who wanted the <b>UK</b> to push for a ceasefire. The letter followed an article from ex-defence secretary Ben Wallace ..."
    },
    {
        "url": "https://www.thetimes.co.uk/radio/show/20231223-21379/2023-12-23",
        "title": "Hannah MacIness in for Alexis Conran",
        "description": "Listen to Times Radio live for the latest breaking news, expert analysis and well-informed discussion covering the biggest stories of the day."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24007877.macallan-scotch-whisky-distiller-edrington-shines-gloom/",
        "title": "The Macallan Scotch whisky distiller Edrington shines in gloom",
        "description": "Scotch whisky distiller Edrington, which owns brands including The Macallan, Highland Park and The Famous Grouse, in the summer announced pre-tax profits before exceptional items of £387.7m for the year to March 31. This was up by 43% on the prior 12 months."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24010058.two-men-seriously-hurt-mclaren-car-crashes-home-catches-fire/",
        "title": "Two men seriously hurt as McLaren car crashes into home then catches fire",
        "description": "Anyone with information should email the force at SCIU@lancashire.police.<b>uk</b> or call 101 quoting log 174 of December 23 2023."
    },
    {
        "url": "https://uk.news.yahoo.com/californias-exodus-continues-population-dropping-160252144.html",
        "title": "California&#39;s exodus continues, with population dropping for the third year in a row, putting its <b>political</b> influence at risk",
        "description": "The high-cost of living and an increase in remote work are likely driving factors. Some fear the demographic changes could cause the state to lose <b>political</b> clout. California&#39;s population has dropped for the third year in a row, raising concerns about the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/my-mum-ignored-persistent-cough-28343125",
        "title": "&#39;My mum ignored a persistent cough... a year later she was dead&#39;",
        "description": "The <b>UK</b> still lags behind comparable countries when it comes to cancer survival, the charity said, and called on all <b>political</b> parties to make cancer a top priority in their party manifestos. Whoever assumes office after the general election must commit to ..."
    },
    {
        "url": "https://www.ft.com/content/aad0afd4-57cf-4d34-ae42-7397354600de?shareType=nongift",
        "title": "How migration is pushing Europe to the right",
        "description": "Italy’s Giorgia Meloni welcomes her <b>UK</b> counterpart Rishi Sunak and Albania’s Edi Rama ... “And this creates a dynamic in the <b>political</b> discussion, which then is not aimed at solving problems.” Immigration, whether by people fleeing persecution ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/local-news/8-million-upgrade-key-dumfries-31658452?int_source=nba",
        "title": "£8 million upgrade to key Dumfries and Galloway road rubber stamped",
        "description": "“What we have now is a firm commitment by the <b>UK</b> Government of £8 million to progress the upgrading of the A75 and a promise of even more funding to come. “As far as I am concerned it is not about party <b>politics</b>. Quite frankly, the people of Dumfries ..."
    }
]