[
    {
        "url": "https://pressgazette.co.uk/publishers/digital-journalism/novara-media-15000-supporters-youtube-events-north-editor-craig-gent/",
        "title": "Youtube drives increase in paying readers as Novara Media nears 15,000 donors",
        "description": "Craig Gent told Press Gazette that despite the cost of living crisis, 2023 was Novara Media&#39;s strongest year for supporter funding."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/meghan-markle-accused-making-huge-31998524",
        "title": "Meghan Markle accused of making huge demand &#39;to compete with Kate Middleton&#39;",
        "description": "Meghan Markle and Prince Harry moved into Nottingham Cottage in the grounds of Kensington Palace after they were engaged, but the Duchess of Sussex reportedly had grander ideas"
    },
    {
        "url": "https://inews.co.uk/news/politics/northern-ireland-power-sharing-deal-2879961?ico=above_article_ticker",
        "title": "How Northern Ireland power-sharing deal was reached – and what happens next",
        "description": "Frustration over the dysfunction of the <b>political</b> system led to historic strike action earlier ... but Sir Jeffrey said it would “remove checks for goods moving within the <b>UK</b> and remaining in Northern Ireland and will end Northern Ireland automatically ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/dup-agrees-deal-to-return-power-sharing-to-northern-ireland-2879749?ico=editors_picks",
        "title": "DUP agrees post-Brexit deal to return power sharing to Northern Ireland",
        "description": "The DUP has backed a <b>UK</b> Government deal meaning it will no longer automatically ... to discuss these matters and I hope to be able to finalise this deal with the <b>political</b> parties as soon as possible,” he said. Around 50 protesters assembled outside ..."
    },
    {
        "url": "https://www.gazetteseries.co.uk/news/national/24083331.kemi-badenoch-ally-says-evil-plotters-group-claim-silly-gossip/",
        "title": "Kemi Badenoch ally says ‘Evil Plotters’ group claim is ‘silly gossip’",
        "description": "“This is all the sort of self-indulgent conspiracy thing that goes on in <b>politics</b> from time to time.” Rishi Sunak is being subjected to Tory plotting (Ian Forsyth/PA) Former culture secretary Nadine Dorries suspects the WhatsApp group is an “ironic ..."
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/business/house-of-commons-launch-for-sixth-ladies-first-awards-celebrating-inspirational-achievers-4497675",
        "title": "House of Commons launch for sixth Ladies First Awards celebrating inspirational achievers",
        "description": "A prestigious event at London’s House of Commons this week marked the launch of a national awards campaign to celebrate some the country’s most inspirational female achievers."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/upper-crust-owner-ssp-confident-despite-ongoing-strike-woes-b1135693.html",
        "title": "Upper Crust owner SSP confident despite ongoing strike woes",
        "description": "Upper Crust owner SSP has seen UK sales surge thanks to buoyant air travel and commuters continuing to return to offices, but warned of ongoing disruption from train strikes."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/30/uk-northern-ireland-dup-power-sharing-stormont-latest-politics-news-updates?page=with:block-65b8c5d18f088db3a2e121db",
        "title": "Northern Ireland will no longer automatically have to follow EU laws under deal to restore power sharing, DUP leader says – <b>politics</b> live",
        "description": "The DUP has endorsed a deal with the <b>UK</b> government to restore power sharing in NI, paving an end to two years of <b>political</b> deadlock You must be 18 or over to fill in this form. We will only use this data for the purpose of improving our live blogs."
    },
    {
        "url": "https://www.thetimes.co.uk/article/what-dup-deal-mean-northern-ireland-stormont-5s3htk9k0",
        "title": "What does the DUP deal mean for Northern Ireland?",
        "description": "After months of public rows and secret negotiations the largest unionist party in Northern Ireland agreed a deal with the government to restore power-sharing after two years of hiatus. To optimists, the agreement signals the end of years of political turmoil caused by the impact of Brexit on Northern Ireland."
    },
    {
        "url": "https://www.thetimes.co.uk/article/bbdaf4a0-0eec-4ede-a02c-e672733397d9?shareToken=a0076ec4635a9cd3409268194d511273",
        "title": "People wanted me jailed based on fake news, says climate adviser",
        "description": "“The story is the latest from the Telegraph’s <b>political</b> editor (rather than the energy and climate ... At present the advisers are thrashing out how tough the <b>UK</b>’s 2042 carbon should be."
    },
    {
        "url": "https://www.express.co.uk/news/world/1861140/russia-ukraine-war-ammunition-production-nato",
        "title": "Russia has five times Ukraine&#39;s firepower, warns expert as he urges West to wake up",
        "description": "EXCLUSIVE: The West may no longer present a credible deterrent to Russia or other hostile forces around the world, a leading expert has warned."
    },
    {
        "url": "https://news.stv.tv/politics/john-swinney-and-kate-forbes-to-appear-before-uk-covid-inquiry",
        "title": "John Swinney and Kate Forbes to appear before <b>UK</b> Covid Inquiry",
        "description": "Scotland’s former finance secretary Kate Forbes and former deputy first minister John Swinney will give evidence at the UK Covid Inquiry on Tuesday. The hearings will take place in Edinburgh, with Forbes appearing in the morning, followed by Swinney who will continue to give evidence into the afternoon."
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, Labour’s silence over the cost of living crisis is deafening’",
        "description": "The opinions in <b>Politics</b>.co.<b>uk</b>&#39;s Comment section are those of the author. A new poll has found eight in 10 people expect January will turn out to be the toughest month yet financially. With rents and mortgages, food costs and energy bills still putting a ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/national/uk-will-consider-recognising-palestinian-state-to-help-end-conflict-cameron-98794/",
        "title": "<b>UK</b> will consider recognising Palestinian state to help end conflict – Cameron",
        "description": "Britain will look at recognising a Palestinian state under diplomatic efforts to end the conflict with Israel, Foreign Secretary Lord David Cameron has said."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/01/30/dup-set-to-end-2-year-stormont-boycott-as-leader-hails-decisive-breakthrough/",
        "title": "DUP set to end 2-year Stormont boycott as leader hails ‘decisive’ breakthrough",
        "description": "The opinions in <b>Politics</b>.co.<b>uk</b>&#39;s Comment section are those of the author. The Democratic Unionist Party (DUP) is on the verge of ending its 2-year-long boycott of Northern Ireland power-sharing arrangements after it backed a deal with the <b>UK</b> government."
    },
    {
        "url": "https://uk.news.yahoo.com/ed-sheeran-liam-gallagher-sign-093506080.html",
        "title": "Ed Sheeran and Liam Gallagher sign open letter demanding politicians address poverty in the <b>UK</b>",
        "description": "demanding politicians address the increasing number of people facing poverty in the <b>UK</b>. Co-written by anti-poverty charities the Trussell Trust and Joseph Rowntree Foundation, the letter calls for <b>political</b> leaders to make sure the basic rate of Universal ..."
    },
    {
        "url": "https://www.politico.eu/article/britains-potty-mouthed-parliament/",
        "title": "‘Shitshow!’ Britain’s potty-mouthed parliament",
        "description": "Britain’s straight-laced opposition leader Keir Starmer — the favorite to become prime minister later this year — added his own expletive to the record last week when he used his appearance at prime minister’s questions to repeat an anonymous briefing to a newspaper which had described the government’s childcare policy as a “shitshow.”"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/dup-deal-could-be-revealed-as-early-as-tomorrow-as-party-set-for-power-sharing-return-reaction/a1032325299.html",
        "title": "DUP set for power-sharing return after deal agreed – reaction",
        "description": "&quot;It is vital there is <b>political</b> stability to address the scale of the crisis ... &quot;I am pleased that the DUP have agreed to accept the package of measures that the <b>UK</b> Government has put forward and as a result they are ready to return to the Northern ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/what-happens-next-northern-ireland-deal-075103266.html",
        "title": "What happens next after dramatic Northern Ireland deal?",
        "description": "However, David Henig, <b>UK</b> director of the European Centre for International <b>Political</b> Economy think tank, warned that Donaldson&#39;s claim the deal will remove checks for goods moving within the <b>UK</b> &quot;isn&#39;t true&quot; under the Windsor Framework. &quot;So is this all ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/29/inside-laurence-foxs-relationship-cousin-emilia-amid-controversy-20189893/?ico=zone-widget_home_entertainment",
        "title": "Inside Laurence Fox’s relationship with cousin Emilia amid <b>political</b> controversy",
        "description": "However, the actor-turned-commentator and <b>political</b> hopeful has come under fire from both the ... In an interview with Metro.co.<b>uk</b> in 2020, Laurence’s brother Jack refused to comment about the controversies. ‘It’s his existence and I wouldn’t ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/technology-68128177.amp",
        "title": "Apple says <b>UK</b> could &#39;secretly veto&#39; global privacy tools",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about how we personalise ads in the BBC and our advertising partners. You can ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68130313",
        "title": "Michael Gove tells inquiry &#39;personalities do matter in <b>politics</b>&#39;",
        "description": "Michael Gove has told the <b>UK</b> Covid Inquiry that some Scottish government ministers were interested in making <b>political</b> points during discussions over the handling of the pandemic. The <b>UK</b> secretary of state for levelling up, housing and communities said ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68079726.amp",
        "title": "General election 2024 poll tracker: How do the parties compare?",
        "description": "The last possible date a general election can be held is 28 January 2025, writes BBC senior <b>political</b> analyst Peter Barnes ... although some do poll the whole of the <b>UK</b>. People surveyed do not get the option to choose parties which only stand in Northern ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/26/john-humphrys-snowflake-gen-z-boomers/?utmsource=email",
        "title": "John Humphrys: Gen Z aren’t the workshy ‘snowflakes’ we think they are",
        "description": "You bet I would! After all, Zedders – youngsters born between 1997 and 2012 – may not yet wield much (if any) <b>political</b> power, but we oldies surely know enough of their lifestyles and aspirations and whingeing to feel just a tad nervous at the prospect."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/30/uk-northern-ireland-dup-power-sharing-stormont-latest-politics-news-updates",
        "title": "Northern Ireland will no longer automatically have to follow EU laws under deal to restore power sharing, DUP leader says – <b>politics</b> live",
        "description": "The DUP has endorsed a deal with the UK government to restore power-sharing in NI, paving an end to two years of political deadlock"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-cameron-benjamin-netanyahu-israel-hamas-foreign-secretary-b1135678.html",
        "title": "<b>UK</b> will consider recognising Palestinian state to help end conflict – Cameron",
        "description": "Britain will look at recognising a Palestinian state under diplomatic efforts to end the conflict with Israel, Foreign Secretary Lord David Cameron has said."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "<b>Politics</b> latest news: Archbishop of Canterbury wrong over small boats crisis, suggests Nigel Farage",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/30/uk-will-consider-recognising-palestinian-state-says-david-cameron",
        "title": "<b>UK</b> will consider recognising Palestinian state, says David Cameron",
        "description": "Foreign secretary says move would help to make two-state solution an ‘irreversible’ process"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/passenger-caught-trying-board-dubai-31998162",
        "title": "Passenger caught trying to board Dubai flight with drug-filled Kinder Surprise up bum",
        "description": "Michael Whitty, from Merseyside, has been jailed after being caught by Manchester Airport sniffer dogs trying to fly to Dubai with Kinder Surprise eggs containing drugs hidden up his bottom"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24082166.businesses-established-durham-north-yorkshire/",
        "title": "More businesses established in Durham and North Yorkshire",
        "description": "Recently published figures show that more new businesses were established in Durham and in North Yorkshire during 2023."
    },
    {
        "url": "https://www.bbc.com/news/uk-68137220",
        "title": "<b>UK</b> considers recognising Palestine state, Lord Cameron says",
        "description": "Britain is ready to bring forward the moment when it formally recognises a Palestinian state, the foreign secretary has suggested. Lord Cameron said Palestinians had to be given a political horizon to encourage peace in the Middle East. He is beginning his fourth visit to the region since being appointed foreign secretary in November."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24083147.stormont-powersharing-set-return-dup-executive-backs-deal/",
        "title": "Stormont powersharing set to return after DUP executive backs deal",
        "description": "Party leader Sir Jeffrey Donaldson said the Government first had to implement agreed measures to address its concerns about post-Brexit trade."
    },
    {
        "url": "https://uk.news.yahoo.com/what-happens-next-northern-ireland-deal-075103266.html",
        "title": "What happens next after dramatic Northern Ireland deal?",
        "description": "DUP leader Sir Jeffrey Donaldson announced that his party have agreed a deal to restore power sharing to Northern Ireland after nearly two years of stalemate."
    },
    {
        "url": "https://www.politicshome.com/news/article/dup-green-lights-return-power-sharing-northern-ireland",
        "title": "DUP Green Lights Return To Power Sharing In Northern Ireland",
        "description": "The Democratic Unionist Party has agreed to return to power sharing in Northern Ireland after a post-Brexit boycott lasting nearly two years."
    },
    {
        "url": "https://www.voanews.com/a/northern-ireland-s-dup-strikes-deal-for-power-sharing-government/7462943.html",
        "title": "Northern Ireland&#39;s DUP Strikes Deal for Power-Sharing Government",
        "description": "&quot;Subject to the binding commitments between the Democratic Unionist Party and the <b>UK</b> government being fully and faithfully ... the role of Northern Ireland first minister, the latest <b>political</b> milestone for the former <b>political</b> wing of the Irish Republican ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labours-green-energy-plans-run-095257133.html",
        "title": "Labour&#39;s green energy plans will run out of steam",
        "description": "It is claimed that a ‘green energy sprint’ will result in the <b>UK</b>, in 2030, being the first country to run on 100 per cent clean power. To achieve this, the Labour plan will see, among other initiatives, offshore wind quadruple, solar power triple and ..."
    }
]