[
    {
        "url": "https://www.ibtimes.co.uk/labour-proposes-extension-equal-pay-rights-black-asian-minority-staff-1723273",
        "title": "Labour Proposes Extension of Equal Pay Rights to Black, Asian and Minority Staff",
        "description": "As the <b>political</b> debate on this matter intensifies, the spotlight remains on the government and other <b>political</b> parties to outline their stance on equal pay and contribute to shaping a more equitable future for all workers in the <b>UK</b>."
    },
    {
        "url": "https://www.leisureopportunities.co.uk/news/Sports-Think-Tank-launches-The-Road-to-the-2024-Election-Manifesto-Andy-Reed-Kim-Leadbeater-prevention-physical-activity/352592",
        "title": "Andy Reed Think Tank launches 2024 election manifesto for physical activity",
        "description": "In a newly-launched manifesto, physical activity sector stakeholders are calling for the next UK government to promote active environments, cut red tape and elevate the status of PE in schools."
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/08/australia-politics-live-png-prime-minister-marape-parliament-question-time-anthony-albanese-peter-dutton-stage-three-tax-cuts-ir-law-right-to-disconnect?topics=PERSON%3AJames+Marape",
        "title": "Australia <b>politics</b> live: Littleproud claims IR laws pose ‘biosecurity risk’ to farmers, backs reforms to end price-gouging",
        "description": "Follow live"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/07/tucker-carlson-putin-russia-fox-interview-kremlin-moscow/",
        "title": "How Tucker Carlson – and the libertarian Right – embraced Putin",
        "description": "The US provocateur is the first Western journalist to be granted an interview with the Russian leader – but is that such a surprise?"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24098243.thames-water-launch-applications-apprenticeships/",
        "title": "Thames Water launch applications for apprenticeships",
        "description": "A range of college-level to degree-level apprenticeships in a variety of roles from engineering to quantitative surveying will be on offer, with"
    },
    {
        "url": "https://www.thesun.co.uk/news/25793067/leniency-criminals-ezedi-calocane-british-state/",
        "title": "Leniency to vile criminals Ezedi &amp; Calocane shows <b>UK</b> state has lost the plot – &amp; it’s the victims who are being trampled",
        "description": "THE British state has not just lost control of our borders, it has lost its moral authority and its sense of purpose. Our deluded, impotent politicians and bureaucrats preside over an immigration"
    },
    {
        "url": "https://uk.movies.yahoo.com/apparently-gen-z-men-leaning-200913324.html",
        "title": "Apparently Gen Z Men Are Leaning Conservative While Gen Z Women Are More Liberal, And It’s Making Dating Really Hard",
        "description": "The research may help to explain the debate over whether Gen Z is more progressive or conservative, as studies often conflictingly report Gen Z is left leaning on some issues, but conservative on others."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-sunak-trans-joke-brianna-ghey-2895221",
        "title": "Brianna Ghey’s father calls on Sunak to apologise for ‘degrading’ trans ‘joke’",
        "description": "Peter Spooner is &#39;disgusted&#39; with the PM&#39;s &#39;absolutely dehumanising&#39; comment as Tory MPs complain to whips and PM refuses to apologise"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/labour-flagship-insulation-policy-cost-13bn-a-year/",
        "title": "Labour’s insulation policy will cost up to £13bn a year, Treasury claims",
        "description": "Party says its green measures would cost Exchequer a maximum of £6 billion a year, but Government’s analysis says it would be double that"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/07/the-guardian-view-on-public-service-queues-a-grim-symbol-of-chronic-underinvestment?ref=biztoc.com",
        "title": "The Guardian view on public service queues: a grim symbol of chronic underinvestment",
        "description": "The <b>UK</b> state is crumbling through sustained underinvestment and a myopic <b>political</b> fixation on cutting spending without regard for long-term social consequences. Although notionally NHS spending was “ringfenced” in George Osborne’s austerity budgets ..."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24103700.taxpayers-scammed-archbishop-canterbury-says-tory-mp/",
        "title": "Taxpayers are being ‘scammed’ by Archbishop of Canterbury, says Tory MP",
        "description": "Tim Loughton’s question follows news that 40 asylum seekers on the Bibby Stockholm barge had come forward to convert to Christianity."
    },
    {
        "url": "https://www.independent.co.uk/news/declan-mckenna-ap-british-fifa-brazil-b2492456.html",
        "title": "Music Review: Declan McKenna’s &#39;What Happened to the Beach?&#39; is a warped, pop sonic adventure",
        "description": "British pop singer-songwriter Declan McKenna is back with his third studio album, the bright “What Happened to the Beach?”"
    },
    {
        "url": "https://www.surreycomet.co.uk/news/national/24105242.brianna-gheys-father-demands-apology-sunak-transgender-jibe/",
        "title": "Brianna Ghey’s father demands apology from Sunak over transgender jibe",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender joke in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://metro.co.uk/2024/02/07/latvia-introduces-compulsory-conscription-men-aged-18-27-20236904/?ico=mosaic_tag",
        "title": "Map shows where there is conscription in Europe after Nato country brings it back",
        "description": "And it comes amid fears conscription could become mandatory in the <b>UK</b> and a ‘citizen army’ mobilised to fend ... such a state of preparedness that Russian generals and the Russian <b>political</b> classes clearly see that the direction of Europe is a no ..."
    },
    {
        "url": "https://uk.news.yahoo.com/panama-ex-president-ricardo-martinelli-222132908.html",
        "title": "Panama ex-President Ricardo Martinelli receives <b>political</b> asylum from Nicaragua",
        "description": "PANAMA CITY (AP) — Panama’s former President Ricardo Martinelli has received <b>political</b> asylum from Nicaragua days after Panama&#39;s Supreme Court denied his appeal over a money laundering conviction that carried a 10-year sentence. Martinelli’s attorney ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864161/wellingborough-by-election-reform-win-odds",
        "title": "Odds of Reform <b>UK</b> pulling off shock by-election victory slashed with Tory voters on strike",
        "description": "Speculation is mounting that Reform <b>UK</b> could cause &quot;a <b>political</b> earthquake&quot; in next week&#39;s Wellingborough by-election after bookmakers suddenly slashed the odds of the party&#39;s candidate Ben Habib. Mr Habib entered the race at a distant third favourite of ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68228439",
        "title": "PMQs: <b>Political</b> leaders send best wishes to King Charles",
        "description": "Opening PMQs, Rishi Sunak, Sir Keir Starmer and Stephen Flynn wish a speedy recovery to the monarch following his cancer diagnosis. Business Secretary Kemi Badenoch says the business model of the Post Office &quot;just wasn&#39;t working&quot;."
    },
    {
        "url": "https://www.lovereading.co.uk/blog/see-which-political-writing-triumphed-at-the-parliamentary-book-awards-2024-9097",
        "title": "See which <b>political</b> writing triumphed at The Parliamentary Book Awards 2024",
        "description": "The Winding Stair by Conservative MP Jesse Norman won in the Best Non-Fiction/Fiction by a Parliamentarian category. This novel &quot;tells the story of two founders from our modern world and their battle for power, pre-eminence and the hand of the most eligible women in the realm&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/fact-check-michael-gove-secret-164752837.html",
        "title": "FACT CHECK: Has Michael Gove’s secret ‘State of the Union’ report leaked online?",
        "description": "CLAIM: The secret “State of the Union” report written by Michael Gove and shown to the UK Cabinet in July 2020 has leaked online"
    },
    {
        "url": "https://news.sky.com/story/electoral-dysfunction-a-new-podcast-from-sky-news-13065552",
        "title": "Electoral Dysfunction - A new podcast from Sky News",
        "description": "Follow Electoral Dysfunction on Apple Podcasts, Spotify, Spreaker or wherever you get your podcasts."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13053547/George-Galloways-Workers-Party-Britain-denies-offering-role-paying-living-wage-advert-10-42-hour-campaign-intern-appears-political-jobs-site.html",
        "title": "George Galloway&#39;s Workers Party of Britain denies offering role paying less than the living wage after advert for £10.42 per hour &#39;campaign intern&#39; appears on <b>political</b> jobs site",
        "description": "George Galloway is contesting the by-election, scheduled for February 29, as the candidate for his political party: Workers Party of Britain."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68171524",
        "title": "Will voters unhappy with the Conservatives be attracted to Reform?",
        "description": "The party says it targets Labour supporters, but it is the Tories who are most worried about Reform UK&#39;s polling."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24105242.brianna-gheys-father-demands-apology-sunak-transgender-jibe/",
        "title": "Brianna Ghey’s father demands apology from Sunak over transgender jibe",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender joke in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/reason-royal-family-rift-could-32072008?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "Reason Royal family rift could be healed - and it&#39;s because of Meghan Markle",
        "description": "Prince Harry travelled to the UK to see his father King Charles after he was diagnosed with cancer - and taking the trip alone might have saved his relationship with Charles"
    },
    {
        "url": "https://www.thenational.scot/politics/24105198.jackie-baillie-quick-condemn-snp-not-apologise/",
        "title": "Jackie Baillie is quick to condemn the SNP, but not to apologise",
        "description": "WE were treated on Wednesday morning to a diatribe from Dame Jackie Baillie for nearly nine minutes, complaining about the wrong coding of women"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68232370",
        "title": "Row erupts over cost of Labour&#39;s home insulation plan",
        "description": "Labour has rejected as &quot;bogus&quot; an analysis by government officials that its plan to improve home energy efficiency would cost £12-15bn a year. The party has said the measures, part of a wider £28bn green investment plan, would be capped at £6bn a year."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/sinn-fein-says-us-visit-will-highlight-palestinian-freedom-and-demand-end-to-israels-war/a268241697.html",
        "title": "Sinn Fein says US visit will highlight ‘Palestinian freedom’ and ‘demand end to Israel’s war’",
        "description": "Sinn Fein has reiterated the party will use their annual Washington St Patrick’s Day trip to highlight solidarity with those living in Gaza."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68232883.amp",
        "title": "Gaza ceasefire: Israel&#39;s PM Benjamin Netanyahu rejects Hamas&#39;s proposed terms",
        "description": "Israel&#39;s Prime Minister Benjamin Netanyahu has rejected Hamas&#39;s proposed ceasefire terms - saying &quot;total victory&quot; in Gaza is possible within months. He was speaking after Hamas laid out a series of demands in response to an Israel-backed ceasefire proposal."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/government-agency-failed-to-protect-major-river-from-chicken-waste-court-hears-99558/",
        "title": "Government agency failed to protect major river from chicken waste, court hears",
        "description": "Campaigners have accused a government agency of failing to apply the law and stop excess nutrients from polluting a major river on the first day of a hearing."
    }
]