[
    {
        "url": "https://news.sky.com/story/amp/test-your-knowledge-with-the-politics-hub-christmas-quiz-13036140",
        "title": "Test your knowledge with the <b>Politics</b> Hub Christmas quiz",
        "description": "It&#39;s been another eventful year in British <b>politics</b>. But how much of it do you remember? The <b>Politics</b> Hub Christmas special will be airing on Sky News from 9pm this evening. It will include a quiz testing your knowledge of the last 12 months - and you can ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898705/Tucker-Carlson-Kevin-Spacey-video-White-House-bizarre.html",
        "title": "Tucker sits down with Kevin Spacey&#39;s House of Cards Frank Underwood in bizarre Christmas video to talk about current candidates, running for the White House... and Carlson as a ...",
        "description": "In an interview with Tucker Carlson on X, Spacey became his House of Cards character and ran through his views on the election candidates, trigger warnings and the legacy media."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/man-finds-massive-diamond-walking-31745789",
        "title": "Man finds massive diamond while walking in park and at first thinks it&#39;s just glass",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA ... You can report any errors to webhomepage@mirror.co.<b>uk</b>"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898573/Who-James-Cleverlys-wife-Susie-Meet-spouse-UKs-Home-Secretary-faces-calls-quite-joke-date-rape-drug.html",
        "title": "Who is James Cleverly&#39;s wife Susie? Meet the spouse of <b>UK</b>&#39;s Home Secretary as he faces calls to quite after joke about date-rape drug",
        "description": "Who exactly is James Cleverly&#39;s wife Susie and what has she done to help raise aware of breast cancer after she was diagnosed with the illness? Read on to find out."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/24/guide-elections-2024-votes-democracy-india-russia-us-eu/",
        "title": "The Telegraph guide to elections in 2024 ... democracy’s biggest year",
        "description": "The <b>UK</b> and European Union will both also hold elections to their ... defence – more than on social security – as the war in Ukraine dominates Mr Putin’s <b>political</b> agenda. Across the front lines, Volodymyr Zelensky, Ukraine’s president, will also ..."
    },
    {
        "url": "https://www.fxempire.com/forecasts/article/gbp-usd-price-outlook-for-2024-navigating-uncertainty-and-opportunity-in-the-year-ahead-1398105",
        "title": "GBP/USD Price Outlook for 2024: Navigating Uncertainty and Opportunity in the Year Ahead",
        "description": "GBP/USD navigate through Brexit, central bank policies, and geopolitical tensions, ending with a cautious yet hopeful recovery."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/cowboys-vs-dolphins-live-stream-how-to-watch-nfl-game-online-from-anywhere",
        "title": "Cowboys vs Dolphins live stream: how to watch NFL game online from anywhere",
        "description": "You can watch a Cowboys vs Dolphins live stream on Fox in the US. NFL fans in Australia can watch the game on Kayo Sports. In Canada, Cowboys vs Dolphins is being shown on DAZN, TSN and CTV, while viewers in the UK can tune in on Sky Sports. Full details below."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-67811919",
        "title": "Humza Yousaf delivers first Christmas message as FM",
        "description": "&quot;So to everyone who brings joy and laughter to our Christmases, thank you.&quot; Scottish Liberal Democrat leader Alex Cole-Hamilton said: &quot;While <b>politics</b> takes a short break, I know that many in our hospitals, care homes, homeless services and more will be ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/block-truss-resignation-honours-sunak-list-published-2823864",
        "title": "Block Truss’s resignation honours, Sunak urged ahead of list being published",
        "description": "The former Prime Minister&#39;s resignation honours list has been delayed for months but could be published this week"
    },
    {
        "url": "https://www.thesun.co.uk/tech/25129008/free-santa-ai-personalised-video-messages/",
        "title": "Little-known free site creates personalised Santa video messages just in time for Christmas",
        "description": "However, you can&#39;t write any rude messages. All are checked for anything <b>political</b>, sexual, offensive or criminal before they&#39;re sent. Once your message is ready, just add your email so you can then show it to the kids. It may take a few minutes to arrive ..."
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/carol-vorderman-countdown-earpiece-maths-theory-b2469140.html",
        "title": "Carol Vorderman reacts to Countdown fan ‘earpiece’ theory",
        "description": "Carol Vorderman has responding to a long-running fan theory about the popular quiz show Countdown. The Welsh TV and radio host, 63, rose to fame when she joined the Channel 4 gameshow in 1982, serving as assistant presenter until 2008."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/how-harry-meghan-spending-christmas-31744667?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "How Harry and Meghan are spending Christmas as Royals arrive at Sandringham without them",
        "description": "Prince Harry and Meghan Markle&#39;s plans for Christmas have been unveiled as members of the Royal Family have arrived at Sandringham for their Christmas Eve celebrations"
    },
    {
        "url": "https://www.thetimes.co.uk/article/403f4038-b2a1-490f-9f8f-cb2c612861b1?shareToken=d8e47bcaadc3bc0c275df95da45e4988",
        "title": "Reform <b>UK</b> to challenge Tories in every seat at general election",
        "description": "The leader of Reform <b>UK</b> has privately given his senior team “cast-iron guarantees ... amid mounting speculation that Farage is preparing to return to frontline <b>politics</b> after his widely publicised stint on I’m a Celebrity … Get Me Out of Here!."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/james-cleverly-rishi-sunak-yvette-cooper-home-secretary-prime-minister-b1128944.html",
        "title": "Cleverly’s date rape ‘joke’ the latest time he has talked his way into trouble",
        "description": "James Cleverly has found himself in hot water over unguarded comments for the third time in just six weeks as Home Secretary. He faced calls to resign after an “ironic joke” at a No 10 reception about using a date rape drug on his wife was made public by the Sunday Mirror."
    },
    {
        "url": "https://www.thenational.scot/politics/24010293.budget-issue-westminsters-fault---scotland-can/",
        "title": "Budget issue is Westminster’s fault – but here’s what Scotland can do",
        "description": "WHILE people – especially politicians – bemoan budget allocations, pointing out the problems that cuts entail, it always comes across"
    },
    {
        "url": "https://www.bbc.com/future/article/20231221-why-british-chocolate-tastes-the-way-it-does",
        "title": "Why British chocolate tastes the way it does",
        "description": "For some, nothing that beats the sweet, creamy, slightly baked flavour of British chocolate, while others find it an affront to their tastebuds. But why does it taste that way at all?"
    },
    {
        "url": "https://www.watfordobserver.co.uk/news/24001995.watford-mp-dean-russell-reflects-achievements-2023/",
        "title": "Watford MP Dean Russell reflects on achievements in 2023",
        "description": "I am proud of the progress we have made together in Watford. My most significant achievement was securing full funding for the redevelopment"
    },
    {
        "url": "https://news.sky.com/story/adam-boulton-things-may-be-bad-but-there-are-reasons-to-be-cheerful-in-2024-13036452?dcmp=snt-sf-twitter",
        "title": "Adam Boulton: Things may be bad, but there are reasons to be cheerful in 2024",
        "description": "Despite challenges and suffering, optimism remains an essential element of the human spirit. There are some reasons to be cheerful at the end of this year and as we head into the next."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/12/24/richard-holden-conservative-chairman-party-inward-looking/",
        "title": "Tory chairman says party has been too ‘inward looking’ amid migration rows",
        "description": "Richard Holden insists Conservatives are now ‘election ready’ as Labour says it is braced for Rishi Sunak to go to the polls in May"
    },
    {
        "url": "https://uk.news.yahoo.com/britain-home-secretary-apologizes-joke-131154878.html",
        "title": "Britain’s Home Secretary apologizes for joke about spiking his wife’s drink with date-rape drug",
        "description": "Women’s Aid, an organization which aims to tackle domestic violence in the <b>UK</b>, said: “We rely on <b>political</b> leaders to take action to end violence against women and girls, and the misogyny that underpins it. Story continues “It is vital that spiking ..."
    },
    {
        "url": "https://www.thenational.scot/news/24008408.uk-increasingly-sliding-towards-populism-since-brexit-vote/",
        "title": "<b>UK</b> &#39;increasingly sliding towards populism since Brexit vote&#39;",
        "description": "THE UK has been increasingly sliding towards populism since the Brexit referendum and checks and balances on the government’s power are"
    },
    {
        "url": "https://www.theguardian.com/world/2023/dec/24/eu-foreign-policy-chief-fears-rightwing-surge-in-june-elections",
        "title": "EU foreign policy chief fears rightwing surge in June elections",
        "description": "Josep Borrell is concerned voters will be scared into choosing populist parties for European parliament because of nearby wars"
    },
    {
        "url": "https://www.palatinate.org.uk/equal-pay-day-how-far-have-we-come-in-the-fight-for-equality/",
        "title": "Equal Pay Day: how far have we come in the fight for equality?",
        "description": "The <b>UK</b>’s leading charity campaigning to close the gender pay ... The gender pay issue is so much more than a social issue. It is intrinsically <b>political</b>, and it is vital that the government steps up to fight for gender equality in the workplace."
    },
    {
        "url": "https://www.heraldscotland.com/news/14699521.ruth-davidson-urges-government-far-proactive-trade-links/",
        "title": "Ruth Davidson urges Government to be &#39;far more proactive&#39; on trade links",
        "description": "However, she said this should not be used for &quot;<b>political</b> opportunism or constitutional change&quot;. Speaking at a press conference in Edinburgh, Ms Davidson also distanced herself from former <b>UK</b> Government lord chancellor Michael Gove&#39;s claim that Scotland ..."
    },
    {
        "url": "https://www.lowestoftjournal.co.uk/news/national/24011014.serbia-police-fire-tear-gas-keep-protesters-entering-council-building/",
        "title": "Serbia police fire tear gas to keep protesters from entering council building",
        "description": "Police in Serbia fired tear gas to prevent hundreds of opposition supporters from entering the capital’s city council building on Sunday. The demonstrators were gathered in protest of what election observers said were widespread vote irregularities during a general election last weekend."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848860/prince-harry-spare-sequel-new-book-meghan-markle-moving-forward",
        "title": "Prince Harry &#39;working on another book&#39; as Sussexes &#39;moving forward in positive direction&#39;",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA ... After experiencing a drop in popularity both in the <b>UK</b> and the US following the release of the memoir, the Duke and Duchess signalled they are ready to move on from their negative ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2023/dec/24/david-cameron-has-a-chance-at-redemption-by-delivering-crucial-weapons-to-ukraine",
        "title": "David Cameron has a chance at redemption by delivering crucial weapons to Ukraine",
        "description": "The foreign secretary should take the lead in creating a unified military supply chain to Kyiv and robustly sanctioning Russia"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/buy-lithium-stocks-stocks-shares-130016939.html",
        "title": "Should I buy lithium stocks in my Stocks and Shares ISA in 2024?",
        "description": "This Fool wonders if he should expose his Stocks and Shares ISA directly to the alkali metal that&#39;s key to the electric vehicle revolution. The post Should I buy lithium stocks in my Stocks and Shares ISA in 2024?"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24010719.christmas-day-set-warmest-years-temperatures-hitting-14c/",
        "title": "Christmas Day set to be ‘warmest in years’ with temperatures hitting 14C",
        "description": "Warmer-than-average temperatures on December 25 mean a White Christmas has been ruled out for most of the country."
    },
    {
        "url": "https://uk.style.yahoo.com/crime-mine-review-everyone-wants-122610068.html",
        "title": "‘The Crime Is Mine’ Review: Everyone Wants To Be a Murderess In François Ozon’s Feathery French Farce",
        "description": "Quick, silly and lent weight only by the costume department’s copious wigs and furs, “The Crime Is Mine” finds tireless French auteur François Ozon in the playful period pastiche mode of “Potiche” and “8 Women."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24010690.2023-celeb-sightings-paris-hilton-picket-line-samuel-l-jackson-bingo/",
        "title": "2023 celeb sightings: Paris Hilton on picket line and Samuel L Jackson at bingo",
        "description": "From a film star at a Glasgow bingo rave to royalty at Glastonbury, the UK has not been short of a surprising celebrity sighting in 2023. With Samuel L Jackson, Ed Sheeran and Paris Hilton among some of the quirkier celeb spots, here the PA news agency takes a look at some of the best of the year."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-hit-fresh-general-31743948",
        "title": "Rishi Sunak hit by fresh general election blow as major change confirmed for next year",
        "description": "The Conservatives will find it harder to cling on to seats at the next election as Nigel Farage&#39;s old party Reform UK vows to stand against its MPs for the first time"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/24010095.dwp-universal-credit-christmas-new-year-payment-dates/",
        "title": "DWP Universal Credit Christmas and New Year payment dates",
        "description": "Millions of people across the <b>UK</b> who receive government support will receive their payments on different days ahead of Christmas and New Year. The festive season can be a strain on finances at the best of times although this year families will also have to ..."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24010626.shane-macgowans-wife-supports-wham-band-claims-christmas-number-one/",
        "title": "Shane MacGowan’s wife supports Wham! after band claims Christmas number one",
        "description": "The Pogues’ Fairytale Of New York and Wham’s Last Christmas had been among the festive tracks battling it out for the Christmas title."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/politics-reflecting-on-the-challenges-faced-as-2023-comes-t-336728/",
        "title": "<b>Politics</b>: Reflecting on the challenges faced as 2023 comes to a close",
        "description": "Banffshire and Buchan Coast MSP Karen Adam looks back on the key political issues of 2023 in her final column of the year."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/24/reform-uk-leader-gives-guarantee-that-it-wont-step-aside-for-tories-at-election",
        "title": "Reform <b>UK</b> leader gives ‘guarantee’ that it won’t step aside for Tories at election",
        "description": "Richard Tice assures senior members of his party in writing that he will not revive Brexit party’s 2019 deal with Conservatives"
    },
    {
        "url": "https://news.sky.com/video/prime-minister-rishi-sunak-and-other-political-leaders-from-around-the-uk-issue-festive-christmas-messages-to-the-country-13037302",
        "title": "Prime minister Rishi Sunak and other <b>political</b> leaders from around the <b>UK</b> issue festive Christmas messages to the country",
        "description": "Prime minister Rishi Sunak and other <b>political</b> leaders from around the <b>UK</b> issue festive Christmas messages to the country Prime Minister went on pay tribute to the those in the NHS, police forces and armed forces and said looking ahead &quot;let&#39;s keep that promise of a brighter future burning into the New Year.&quot;"
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/new-book-from-dunbeath-publisher-highlights-caithness-role-336785/",
        "title": "New book from Dunbeath publisher highlights Caithness&#39; role in the Cold War",
        "description": "A new book from Dunbeath-based company Whittles includes details on the American naval base in Caithness and its significance during the Cold War."
    },
    {
        "url": "https://www.counterfire.org/article/palestine-ten-essential-reads/",
        "title": "Palestine: ten essential reads",
        "description": "The massive upsurge in protests and activity against Israel’s devastating assault on Gaza has widened the audience interested in understanding the oppression of the Palestinians."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/24010013.nasa-reveals-see-santas-sleigh-christmas/",
        "title": "NASA reveals when to see &#39;Santa&#39;s sleigh&#39; this Christmas",
        "description": "NASA has revealed when ‘Santa’s sleigh’ will be visible in the UK this Christmas. ‘Santa’s sleigh’ is in fact the International Space Station (ISS) and is often spotted by families searching for Santa on Christmas Eve."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24010555.uk-will-not-allow-red-sea-become-no-go-area-shipping---shapps/",
        "title": "<b>UK</b> will not allow Red Sea to become ‘no go’ area for shipping – Shapps",
        "description": "The UK and allies will not allow the Red Sea to become a “no go” zone for shipping and will step up efforts to tackle Iran’s “malign influence”, Cabinet ministers have said. Defence Secretary Grant Shapps said the UK was committed to “repelling” the attacks on ships using the vital trade route by an Iranian-backed group in Yemen."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24010548.two-teenagers-blythe-die-northumberland-car-crash/",
        "title": "Two teenagers from Blythe die in Northumberland car crash",
        "description": "Two teenagers have died following a car crash on Friday. A three vehicle collision on the A192, in Cramlington, saw a massive emergency response at 9.30pm on Friday night (December 22)."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/alex-cole-hamiltons-christmas-message",
        "title": "Alex Cole-Hamilton’s Christmas message",
        "description": "Scottish Liberal Democrat leader Alex Cole-Hamilton said: “Christmas is a time for reflection, and I think it&#39;s important to look back on the long road travelled since last year. “Just twelve months ago Nicola Sturgeon was the most powerful figure in ..."
    },
    {
        "url": "https://www.fool.co.uk/2023/12/24/3-penny-stocks-i-think-could-turn-into-pounds-in-2024/",
        "title": "3 penny stocks I think could turn into pounds in 2024",
        "description": "A lot of penny stocks have fallen further than the bigger ones in 2023. I&#39;m wondering which of them might rebound the best in 2024."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24010466.royal-navy-warship-sent-guyana-tensions-rise/",
        "title": "Royal Navy warship sent to Guyana as tensions rise",
        "description": "He added that the <b>UK</b> would work internationally “to ensure the territorial integrity of Guyana is upheld”. HMS Trent is a River-class patrol vessel, designed for work including what the Government describes as “defence diplomacy”."
    },
    {
        "url": "https://www.newarkadvertiser.co.uk/news/fairer-voting-system-needed-9346051/",
        "title": "Reader’s letter: Fairer voting system needed",
        "description": "Both Rishi Sunak and Keir Starmer recognise that politics is failing to deliver, but have yet to propose serious solutions. They should bring us all some new year cheer and commit themselves to a better voting system: proportional representation. — S. DANDO, Maythorne, Southwell."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1848809/prince-harry-guilty-christmas-presents-meghan-markle-megxit",
        "title": "Prince Harry&#39;s &#39;guilty&#39; Christmas gift to staff minutes before stepping back from royalty",
        "description": "Prince Harry shared how he managed to organise two sentimental Christmas gifts for staff members moments before officially stepping back as a senior royal."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/2023-for-the-bbc-from-hosting-major-events-to-navigating-various-investigations-96201/",
        "title": "2023 for the BBC: From hosting major events to navigating various investigations",
        "description": "An average of 9.9 million <b>UK</b> viewers tuned in to see Swedish star Loreen crowned ... Huw Edwards, who has been at the helm of significant <b>political</b> and royal events for the corporation, was named in July as the BBC presenter at the centre of allegations ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/debanking-saga-happened-where-banks-101532301.html",
        "title": "The ‘debanking’ saga: What happened and where do the banks stand now?",
        "description": "Chancellor Jeremy Hunt said people should not be debanked for having the “wrong <b>political</b> views”. It is already illegal for financial institutions to discriminate against customers on the basis of lawful freedom of expression. But the changes mean <b>UK</b> ..."
    },
    {
        "url": "https://metro.co.uk/2023/12/24/spend-christmas-alone-love-19976265/?ico=trending-module_tag_spain_item-1",
        "title": "We spend Christmas alone – and we love it!",
        "description": "I used to find Christmas in the <b>UK</b> fairly tedious, so a few years ago ... I’m okay now, but life is precious; why not live for today?’ ‘Christmas is a lot of <b>politics</b>, I want to get away from that’ Mel Valentine, 36, from Wilmslow, Cheshire ..."
    },
    {
        "url": "https://www.onlondon.co.uk/dave-hill-telegraph-and-mark-harper-present-seasonal-ulez-scrappage-farce/",
        "title": "Dave Hill: Telegraph and Mark Harper present seasonal ULEZ scrappage farce",
        "description": "The traditional media silly season occurs in late summer, when a shortage of <b>politics</b> news is made up for with frivolousness ... Ben Wallace MP, lately <b>UK</b> defence secretary, took to Ex-Twitter to make known that having “had a good call” with the ..."
    },
    {
        "url": "https://www.independent.co.uk/life-style/food-and-drink/pret-subscription-prices-downfall-b2469036.html",
        "title": "Pret is the worst – but the lunchtime juggernaut is too big to stop now",
        "description": "Every time the chain sneakily adds an extra 5p to the cost of those aforementioned terrible baguettes they get one step closer to cementing their reputation as the <b>UK</b> high street’s ... Whatever Pret’s <b>political</b> affiliations – can a latte have a ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23998245.scotlands-political-apparatchiks-truly-unbelievable/?ref=rss",
        "title": "Scotland&#39;s <b>political</b> apparatchiks who are truly unbelievable",
        "description": "AS 2024 approaches each of Scotland’s main <b>political</b> parties are finalising their lists of preferred candidates for next year’s <b>UK</b> election. Here, we run a light-hearted rule over some of the rising stars of Scottish <b>politics</b> who are set to test the ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23995659.scotland-foreign-affairs-governments-need-grow/?ref=rss",
        "title": "Scotland and foreign affairs: both our governments need to grow up",
        "description": "<b>Political</b> institutions, like the <b>UK</b> and Scottish Governments, represent sections of their domestic societies in international relations. Which sections depend on domestic <b>politics</b> and whose interests institutions believe should define their policies ..."
    }
]