[
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24054580.fujitsi-urged-make-10m-initial-contribution-towards-horizon-compensation/",
        "title": "Fujitsi urged to make £10m ‘initial contribution’ towards Horizon compensation",
        "description": "Technology giant Fujitsu, which has its <b>UK</b> head office in Bracknell, developed the Horizon system for the Post Office (Andrew Matthews/PA) “Already too many people whose lives and livelihoods were ruined by this scandal have passed away without ever ..."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24054577.met-uses-undercover-victim-officers-clamp-luxury-watch-thefts/",
        "title": "Met uses undercover ‘victim’ officers to clamp down on luxury watch thefts",
        "description": "Two operations carried out in late 2022 and 2023 saw officers deployed as potential targets wearing expensive watch brands."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24054576.medication-shortages-impacting-upon-patient-safety-pharmacy-leaders-warn/",
        "title": "Medication shortages ‘impacting upon patient safety’, pharmacy leaders warn",
        "description": "Experts said reasons for shortages are ‘wide and varying’, but there are calls for the Government to recognise the seriousness of the issue."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-67996628",
        "title": "Stormont Assembly recalled ahead of devolution deadline",
        "description": "The assembly collapsed in early 2022 due to the Democratic Unionist Party&#39;s (DUP) protest over post-Brexit trade rules for Northern Ireland. It has not been able to sit since as the DUP has refused to vote for a Speaker. The recall comes ahead of Thursday&#39;s legal deadline to restore devolution."
    },
    {
        "url": "https://www.thetimes.co.uk/article/your-three-minute-digest-6ldw228w0",
        "title": "Your three-minute digest",
        "description": "The IT company behind the Post Office’s faulty computer system has apologised to postmasters and admitted it has a “moral obligation” to pay Post Office victims compensation. Paul Patterson, the UK"
    },
    {
        "url": "https://news.sky.com/story/tory-deputy-chairmen-lee-anderson-and-brendan-clarke-smith-resign-after-backing-rwanda-bill-amendments-13049746",
        "title": "Tory deputy chairmen resign party roles as government suffers significant rebellion on Rwanda bill",
        "description": "Lee Anderson and Brendan Clarke-Smith stood down from their party roles after they backed proposals to toughen up Rishi Sunak&#39;s controversial Rwanda bill."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/man-grows-hair-three-years-31898640",
        "title": "Man grows hair for three years to make wig for girlfriend with alopecia",
        "description": "Cody Ennis decided to grow his hair 2 feet long as a gift for his girlfriend, Hannah Hosking, who is bald due to the hair-loss condition"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67999810?at_medium=RSS&at_campaign=KARANGA",
        "title": "Lee Anderson resigns as deputy Tory chair to rebel over Rwanda bill",
        "description": "Lee Anderson has resigned as deputy Conservative chairman to rebel over the government&#39;s flagship Rwanda bill. Another deputy party chairman, Brendan Clarke-Smith, also resigned ahead of voting against the government. They were among 60 Tory MPs who backed an amendment which rebels said was aimed at toughening up the bill."
    },
    {
        "url": "https://www.thesun.co.uk/news/25377713/scientists-reveal-best-formula-for-dunking-biscuit/",
        "title": "Scientists reveal best formula for dunking biscuits in tea &amp; coffee – and how long each should be submerged for",
        "description": "SCIENTISTS have revealed the perfect formula for dunking biscuits – discovering Rich Tea, Hobnobs and Digestives should be submerged for less than ONE second. Dr Helen Pilcher, who has a PhD in"
    },
    {
        "url": "https://www.yellowad.co.uk/it-happened-today-this-day-in-history-january-17-5/",
        "title": "It happened today – this day in history – January 17",
        "description": "Pope Gregory XI moves the Papacy back to Rome from Avignon. 1501: Cesare Borgia returns in triumph to Rome"
    },
    {
        "url": "https://www.ibtimes.co.uk/widening-wealth-gap-worlds-first-trillionaire-predicted-decade-poor-gets-poorer-1722766",
        "title": "Widening Wealth Gap: World&#39;s First Trillionaire Predicted in a Decade as the Poor Gets Poorer",
        "description": "The world&#39;s billionaires have collectively become £2.6 trillion richer since 2020, growing their wealth at a rate three times faster than inflation."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/man-sues-27-women-57m-31898316",
        "title": "Man sues 27 women for £57m over Facebook reviews calling him &#39;clingy&#39; and &#39;ghoster&#39;",
        "description": "Nikko D&#39;Ambrosio, 32, is taking legal action against 27 women and demanding $75 million in damages after they wrote some less-than-desirable reviews about him on a Facebook page"
    },
    {
        "url": "https://www.ft.com/content/3b2683ed-355d-45fc-a8b1-4d8c36d31f7a",
        "title": "Labour’s Rachel Reeves prepares for pitch to business in Davos",
        "description": "Shadow chancellor to accuse Tories of presiding over ‘14 years of stagnant growth’ as she courts corporate elite"
    },
    {
        "url": "https://www.itv.com/news/2024-01-16/fujitsu-challenged-to-make-10-million-horizon-compensation-contribution",
        "title": "Fujitsu challenged to make £10 million ‘initial contribution’ towards Horizon compensation",
        "description": "MP Marion Fellows told Fujitsu Europe director Paul Patterson the cash would be a “small step in the right direction”. | ITV National News"
    },
    {
        "url": "https://inews.co.uk/news/politics/brexit-liz-truss-blame-britains-inflation-problem-rachel-reeves-2857967?ico=above_article_ticker",
        "title": "Brexit and Liz Truss to blame for Britain’s inflation problem, Rachel Reeves says",
        "description": "Rishi Sunak claims the cost of living squeeze is coming to an end - but Labour will accuse the Conservatives of making it worse"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/labour-s-ambitions-not-achievable-without-business-reeves-to-tell-davos-summit-b1132791.html",
        "title": "Labour’s ambitions not achievable without business, Reeves to tell Davos summit",
        "description": "The shadow chancellor will vow to ‘restore stability’ to the UK economy during her trip to the World Economic Forum in Switzerland."
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-housing-market-set-3-rise-2024-amidst-economic-resilience-1722740",
        "title": "<b>UK</b> Housing Market Set for 3% Rise in 2024 Amidst Economic Resilience",
        "description": "Anticipation of interest rate cuts by the Bank of England has injected newfound optimism into the property sector."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/16/telegraph-nominated-18-press-awards/",
        "title": "Telegraph nominated for 18 Press Awards",
        "description": "Shortlisted accolades include Specialist Reporter, Website and App and Front Page of the Year for the first day of The Lockdown Files"
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/national/24054544.us-uk-announce-biosecurity-alliance-counter-pandemics-bioterrorism/",
        "title": "US and <b>UK</b> announce biosecurity alliance to counter pandemics and bioterrorism",
        "description": "The UK and US have agreed to work together to counter growing biological threats such as pandemics, antimicrobial resistance and bioterrorism. The two nations announced a new strategic dialogue on biosecurity on Tuesday."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12971343/DANIEL-HANNAN-Channel-boats-Britains-laws-election-rout-Tory-support-bill.html",
        "title": "DANIEL HANNAN: The Channel boats make a mockery of Britain&#39;s laws and guarantee an election rout. That&#39;s why every Tory who wants to keep their seat must support this bill",
        "description": "Conservative MPs are staring down the barrel of a gun. Unless voters get to see illegal migrants being marched off planes in Rwanda before poll-ing day, they face electoral annihilation."
    },
    {
        "url": "https://www.thesun.co.uk/sport/25387684/newcastle-chairman-yasir-al-rumayyan-lawsuit/",
        "title": "Newcastle chairman set to be hit with £59m lawsuit amid accusations of ‘malicious’ campaign to ‘destroy’ Saudi spy chief",
        "description": "NEWCASTLE chairman Yasir Al-Rumayyan is set to be hit by a £59million lawsuit after being accused of orchestrating a “malicious” campaign against a dissident former Saudi spy chief. Former"
    },
    {
        "url": "https://news.stv.tv/politics/covid-inquiry-to-offer-advice-on-handling-future-disaster-better-counsel",
        "title": "Covid inquiry to offer advice on handling ‘future disaster’ better",
        "description": "The UK Covid-19 Inquiry will offer the government recommendations on “how any such future disaster might be handled better”, a counsel to the inquiry has said."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/16/labour-will-restore-uks-reputation-for-business-rachel-reeves-to-tell-davos?ref=biztoc.com",
        "title": "Labour will restore <b>UK</b>’s reputation for business, Rachel Reeves to tell Davos",
        "description": "Shadow chancellor will say party has put private sector investment at heart of growth strategy, at JP Morgan breakfast meeting"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/dup-amendment-to-rwanda-bill-seeks-to-put-uk-law-ahead-of-eus-in-northern-ireland/a954914452.html",
        "title": "DUP amendment to Rwanda Bill seeks to put <b>UK</b> law ahead of EU’s in Northern Ireland",
        "description": "The DUP is due to put forward an amendment to Rishi Sunak’s controversial ‘Rwanda Bill’ today to ensure the law applies in Northern Ireland."
    },
    {
        "url": "https://news.sky.com/story/ukraine-volodymyr-zelenskyy-brushes-off-funding-fears-if-donald-trump-wins-us-presidential-election-13049810",
        "title": "Ukraine: Volodymyr Zelenskyy brushes off funding fears if Donald Trump wins US presidential election",
        "description": "Speaking at the World Economic Forum&#39;s annual meeting in Davos, Volodymyr Zelenskyy said Ukraine needs outside support, but did not express concern at the idea of Donald Trump returning to the White House."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-12971123/Jamie-Lee-Curtis-dons-purple-pantsuit-promoting-childrens-book.html",
        "title": "Jamie Lee Curtis, 65, is stylish in plum pantsuit while promoting children&#39;s book in NYC... as she reveals her approach to growing old gracefully",
        "description": "Jamie Lee Curtis looked sophisticated wearing a plum pantsuit and nude heels while promoting her 20th children&#39;s book in Midtown Manhattan on Tuesday. Hairstylist Sean James coiffed the 65-year-old Oscar winner&#39;s signature silver pixie cut and make-up artist Grace Ahn made sure she was camera ready for her press tour."
    },
    {
        "url": "https://www.itv.com/news/2024-01-16/post-office-and-fujitsu-bosses-face-grilling-by-mps-on-horizon-scandal",
        "title": "Fujitsu boss says his &#39;gut feel&#39; is staff knew of Horizon problems, as he apologises for scandal",
        "description": "The European boss of Fujitsu has told MPs that his &quot;gut feeling&quot; is staff in the company knew of errors in the Horizon system. | ITV National News"
    },
    {
        "url": "https://www.varsity.co.uk/interviews/26811",
        "title": "Robert Peston: ‘British exceptionalism today is a pernicious idea’",
        "description": "Ella McCartney speaks to Robert Peston about journalism, geopolitics, and his ‘middle-aged dad’ rock cover band"
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-67998491?src_origin=BBCS_BBC?bingParse",
        "title": "Lee Anderson and Brendan Clarke-Smith resign over Rwanda vote",
        "description": "Lee Anderson and Brendan Clarke-Smith have written to Rishi Sunak to explain their decision to resign from their roles as deputy chairmen of the Conservative Party in order to be able to support backbench amendments to the government&#39;s Rwanda Bill."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/24052427.test-valley-borough-council-release-countryside-event-guides/",
        "title": "Test Valley Borough Council release countryside event guides",
        "description": "Test Valley Borough Council’s guides to events and activities taking place in nature reserves and open spaces across the region are now available."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856484/rishi-sunak-rwanda-bill-reform-uk-election",
        "title": "Disaster for Rishi Sunak as pollster warns Tories are &#39;haemorrhaging&#39; votes to Reform <b>UK</b>",
        "description": "If Mr Sunak fails to get his legislation through the Commons on Wednesday he will look &quot;weak and lacking control over his own party&quot;, Chris Hopkins says."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67361138?at_bbc_team=editorial&at_link_origin=BBC_Politics&at_campaign=Social_Flow&at_medium=social&at_link_id=15CCDE6C-B451-11EE-BA95-D1F554826ABF&at_ptr_name=facebook_page&at_format=link&at_campaign_type=owned&at_link_type=web_link",
        "title": "General election: Labour would need record swing to win",
        "description": "But a uniform national swing has been a reliable model for general elections in the <b>UK</b> over a long period of time. Changes to the <b>political</b> map ahead of the next general election mean constituencies will be new or different from the last general election ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/politics-a-helping-hand-is-available-so-check-your-eligibil-339045/",
        "title": "<b>Politics</b>: A helping hand is available so check your eligibility for benefits",
        "description": "In her latest column, MSP Gillian Martin discusses the post office scandal and how to access benefits even if you are in work."
    },
    {
        "url": "https://metro.co.uk/2024/01/16/tiktok-turns-feral-hot-houthi-pirate-20123795/?ico=trending-module_tag_israel-hamas-war_item-1",
        "title": "TikTok turns feral over hot Houthi pirate: ‘He can board my ship anytime’",
        "description": "The <b>UK</b> and US on Thursday launched a barrage of airstrikes on ... Yemen’, with some comparing him to Misfits actor Robert Sheehan. The Houthi movement is a <b>political</b> and military group that follows a minority strand of Islam called Zaydism."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/uk-elections-brits-overseas-abroad-voting-rules-register-b1132654.html",
        "title": "<b>UK</b> elections: Britons living abroad regain right to vote as 15-year rule ends",
        "description": "Many more Britons can now vote in the next general election, the date of which has yet to be decided by Prime Minister Rishi Sunak"
    },
    {
        "url": "https://www.sheffield.ac.uk/news/political-parties-using-your-data-their-campaigns-not-always-threat-democracy",
        "title": "<b>Political</b> parties using your data in their campaigns not always a threat to democracy",
        "description": "New insights into how political parties use personal data in their election campaigns are provided in a new book published by the University of Sheffield’s Kate Dommett, a professor of digital politics,"
    },
    {
        "url": "https://www.cityam.com/britain-has-little-money-left-and-it-needs-politicians-who-are-honest-about-that/",
        "title": "Britain has little money left – and it needs politicians who are honest about that",
        "description": "It may not be an easy vote winner, but Britain needs politicians who are honest about our fiscal reality, writes Adam Hawksbee."
    },
    {
        "url": "https://www.modernghana.com/news/1285963/uks-sunak-battles-rebels-over-rwanda-migrant.html",
        "title": "<b>UK</b>&#39;s Sunak battles rebels over Rwanda migrant law",
        "description": "<b>UK</b> leader Rishi Sunak fought to quell growing dissent within ... The Conservative prime minister has staked his <b>political</b> future on slashing record levels of regular migration and stopping asylum seekers crossing from France to Britain in small boats."
    },
    {
        "url": "https://www.gov.uk/government/speeches/defending-britain-from-a-more-dangerous-world",
        "title": "Defending Britain from a more dangerous world",
        "description": "We use some essential cookies to make this website work. We’d like to set additional cookies to understand how you use GOV.<b>UK</b>, remember your settings and improve government services. We also use cookies set by other sites to help us deliver content from ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousafs-brother-law-charged-31877686?int_source=nba",
        "title": "Humza Yousaf&#39;s brother-in-law charged with drug offences in Dundee",
        "description": "It comes just days after Nadia, from Dundee, appealed to the <b>UK</b> Government to be allowed to host her other ... To sign up to the Daily Record <b>Politics</b> newsletter, clickhere."
    },
    {
        "url": "https://bylinetimes.com/2024/01/17/contradictory-and-self-defeating-mps-slam-government-for-building-new-houses-in-high-flood-risk-areas/",
        "title": "‘Contradictory’ and ‘Self-Defeating’: MPs Slam Government for Building New Houses in High-Flood Risk Areas",
        "description": "The Government’s plans to tackle the growing problems of flooding – particularly in rural areas – are “a drop in the ocean”, according to a new parliamentary report. The House of Commons’ Public Accounts Committee is highly critical of the ..."
    },
    {
        "url": "https://www.independent.co.uk/business/labour-s-ambitions-not-achievable-without-business-reeves-to-tell-davos-summit-b2479774.html",
        "title": "Labour’s ambitions not achievable without business, Reeves to tell Davos summit",
        "description": "The shadow chancellor will vow to ‘restore stability’ to the UK economy during her trip to the World Economic Forum in Switzerland."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rwanda-bill-vote-latest-news-rishi-sunak-amendments-tory-rebellion-vfg5pjr5n?region=global",
        "title": "Lee Anderson and Brendan Clarke-Smith resign over Rwanda bill — follow latest",
        "description": "Two deputy chairmen of the Conservative party have resigned after being told their positions were untenable as they joined a Tory rebellion against Rishi Sunak’s Rwanda bill. Lee Anderson and Brendan Clarke-Smith resigned from their party roles after voting for two amendments that aimed to toughen up the government’s Safety of Rwanda bill."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/16/rwanda-bill-rishi-sunak-latest-politics-news-updates-live?page=with:block-65a6e72f8f0845976a83f0fd",
        "title": "Lee Anderson and Brendan Clarke-Smith resign over Rwanda bill – <b>UK politics</b> live",
        "description": "Jane Stevenson joins Conservative party’s deputy chairs in resigning on a bruising night for Rishi Sunak"
    },
    {
        "url": "https://inews.co.uk/opinion/rwanda-rebellion-tory-traitors-without-fun-2857908?ico=best_of_opinion",
        "title": "The Rwanda rebellion is the Tory equivalent of The Traitors – without the fun",
        "description": "For their part, members of the “five families” of right-wing groups say they are the true loyalists, staying loyal to the party’s Brexit promises to take back control of the nation’s borders. Suella Braverman has declared the current version of the bill is “a betrayal to the British public”."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856459/rishi-sunak-plea-to-tory-rebels-rwanda",
        "title": "Rishi’s plea for party to “come together” on Rwanda bill",
        "description": "Rishi Sunak has made a dramatic last minute plea to Tory rebels to save his Rwanda flights bill after suffering the biggest revolt of his premiership."
    },
    {
        "url": "https://www.telegraph.co.uk/columnists/2024/01/16/conservative-election-1997-wipeout-sunak-government-voters/",
        "title": "The only thing shocking about a 1997-style wipeout is that Sunak might keep 169 seats",
        "description": "It’s one thing to alienate the floating voter, but they’ve been acting like they were their natural supporters’ own worst enemy"
    },
    {
        "url": "https://uk.news.yahoo.com/fact-check-yes-biden-said-000000356.html",
        "title": "Fact Check: Yes, Biden Said in 2020 that &#39;Trump Does Not Have the Authority to Take Us into War with Iran Without Congressional Approval&#39;",
        "description": "&quot;A president should never take this nation to war without the informed consent of the American people,&quot; part of the purported quote read."
    },
    {
        "url": "https://www.thenational.scot/politics/24054432.snp-still-time-opt-less-risky-general-election-strategy/",
        "title": "SNP still have time to opt for a less risky General Election strategy",
        "description": "KIRSTY Strickland in her column on Monday claims “SNP electoral strategy has its merits – and risks”. However, for me she fails to provide"
    },
    {
        "url": "https://www.thenational.scot/politics/24054389.professor-predicted-2008-crash-talks-economics-independence/",
        "title": "Professor who predicted 2008 crash talks economics of independence",
        "description": "He is a former head of the school of economics, <b>politics</b> and history at Kingston University and ... Pact before becoming a member of the EU Voluntarily contributing to the <b>UK</b>&#39;s national debts Professor Keen&#39;s insights offer a sobering perspective on ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/uk-today/24054334.instagram-video-showing-snowman-getting-spray-tan-goes-viral/",
        "title": "Instagram video showing snowman getting spray tan goes viral",
        "description": "A &#39;brilliant&#39; video showing a snowman getting a spray tan in Liverpool has gone viral amid the Met Office alert for snow and ice in the UK."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24054352.hiring-judges-rwanda-appeals-will-challenge-says-ex-justice-secretary/",
        "title": "Hiring judges for Rwanda appeals will be a challenge, says ex-justice secretary",
        "description": "The Lady Chief Justice has stressed that the decision to deploy more judges was ‘exclusively a matter for the judiciary’."
    },
    {
        "url": "https://metro.co.uk/2024/01/16/russell-brand-popular-ever-100-000-new-fans-20112368/?ico=trending-post-strip_item_2",
        "title": "The troubling rise of Russell Brand’s fandom after rape and abuse allegations",
        "description": "Over the years, Brand shifted from being a comedian and actor – playing a large part in shaping late-noughties pop culture on comedy panel shows, chat shows, and in films – to a <b>political</b> campaigner ... Now, Metro.co.<b>uk</b> can reveal that, in spite ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rwanda-bill-rebels-full-list-191300121.html",
        "title": "Rwanda bill rebels - full list of Tories who voted for Cash amendment",
        "description": "The amendment, seeking to ensure <b>UK</b> and international law cannot be used to block a ... of the scale of unease within the Conservative Party during an election year. <b>Politics</b> latest: Rebellion on Sunak&#39;s Rwanda bill will cause &#39;jitters&#39; Below is a full ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lee-anderson-letter-to-rishi-sunak-rwanda-b2479676.html",
        "title": "Lee Anderson and Brendan Clarke-Smith’s letter in full as Tory deputy chairs resign over Rwanda bill",
        "description": "It comes as MPs voted 529 to 68, majority 461, to reject Conservative Sir Bill Cash’s changes to the Bill, which aimed to ensure <b>UK</b> and international law cannot ... As two people who have been on very different <b>political</b> journeys, one as a person who ..."
    }
]