[
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/mike-freer-minister-to-stand-down-as-mp-over-personal-safety-fears-after-death-threats-and-arson-attack/",
        "title": "Mike Freer: Minister to stand down as MP over personal safety fears after death threats and arson attack",
        "description": "&quot;Instead, <b>politics</b> is now so often skewed by violent language ... Post-Brexit checks on goods between Britain and Northern Ireland set to end under new plans The <b>UK</b> government is tabling legislation to end post-Brexit checks on goods moving between ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/great-political-communicator-stumbles-towards-a-simple-word-yes-v22d77g39",
        "title": "Great <b>political</b> communicator stumbles towards a simple word: Yes",
        "description": "The former first minister of Scotland gave a one-word, decisive answer to whether she had deleted her pandemic WhatsApp messages — at the fourth time of asking"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24089077.young-reporter-enticing-shen-yun---rishmita-de-parmiters-school/",
        "title": "Young Reporter The Enticing Shen Yun - Rishmita De, Parmiter&#39;s School",
        "description": "With its birth in 2006, Shen Yun is a performance in which professionals of classical Chinese dance perform on stage to display aspects of"
    },
    {
        "url": "https://www.ibtimes.co.uk/make-it-look-like-suicide-russian-exile-says-he-still-being-hunted-putin-1723125",
        "title": "&#39;Make It Look Like Suicide&#39;: Russian Exile Says He Is Still Being Hunted By Putin",
        "description": "PhosAgro is owned and operated by a group of Russian oligarchs, business leaders with a great deal of <b>political</b> influence, who have been sanctioned by the <b>UK</b> for being in close connection to Russian President Vladimir Putin. In March last year, less than ..."
    },
    {
        "url": "https://www.ft.com/content/8ed76932-e2a8-4a06-bd90-71e495b0986a",
        "title": "FirstFT: Meta’s Mark Zuckerberg issues dramatic apology at Senate hearing",
        "description": "After being called upon repeatedly by Republican Senator Josh Hawley to apologise to victims, Zuckerberg turned round to the large crowd of families present behind him, many of whom held photographs of lost loved ones, and said that he was sorry for everything that they had been through."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13030621/Power-sharing-Northern-Ireland-begin-thanks-Rishi-Sunaks-trade-boosting-deal.html",
        "title": "Power-sharing in Northern Ireland to begin again thanks to Rishi Sunak&#39;s trade-boosting deal",
        "description": "Rishi Sunak&#39;s latest post-Brexit deal on trading rules for Northern Ireland was yesterday hailed on both sides of the Irish Sea."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13030513/Archbishop-Canterbury-Justin-Welby-joins-forces-former-judge-Labour-peer-mission-derail-Rwanda-plan.html",
        "title": "Archbishop of Canterbury Justin Welby joins forces with a former top judge and a Labour peer in mission to derail Rwanda plan",
        "description": "The Archbishop is backing changes which would instead give the United Nations High Commissioner on Refugees (UNHCR) the final say on whether the east African nation is safe."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/31/nicola-sturgeon-covid-inquiry-analysis",
        "title": "Nicola Sturgeon at the Covid inquiry: by turns defensive, lawyerly and very raw",
        "description": "Trust in Scotland’s former first minister has ebbed since the height of the pandemic, as evidence reveals a presidential leadership style that came to exhaust her"
    },
    {
        "url": "https://news.sky.com/story/jeremy-hunt-casts-doubt-on-big-tax-cuts-at-next-budget-13060942?dcmp=snt-sf-twitter",
        "title": "Jeremy Hunt casts doubt on big tax cuts at next budget",
        "description": "The chancellor confirms he warned cabinet colleagues there is unlikely to be &quot;room&quot; for the size of reductions seen in the autumn."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68159003?at_campaign=KARANGA&at_medium=RSS",
        "title": "Jeremy Hunt: Less scope for tax cuts in Budget",
        "description": "Asked about the reports, Mr Hunt told the BBC&#39;s <b>Political</b> Thinking podcast he was awaiting the ... On Tuesday the International Monetary Fund (IMF) warned the <b>UK</b> against further tax cuts, saying preserving public services and investment implied higher ..."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24088926.dup-says-stormont-deal-delivered-fundamental-change-uk-eu-trading-rules/",
        "title": "DUP says Stormont deal has delivered ‘fundamental change’ to <b>UK</b>/EU trading rules",
        "description": "The EU has said it will ‘carefully analyse’ measures that would end routine checks on goods moving from GB to and staying in NI."
    },
    {
        "url": "https://www.itv.com/news/2024-01-31/chancellor-says-less-room-for-tax-cuts-in-spring-budget-than-in-autumn",
        "title": "Chancellor says less room for tax cuts in spring Budget than in autumn",
        "description": "Have you heard our new podcast Talking <b>Politics</b>? Every week Tom ... the chancellor said “the direction of travel” is for the <b>UK</b> to emulate successful low-tax economies. Economists have said the fact the government borrowed less than expected in ..."
    },
    {
        "url": "https://www.itv.com/watch/news/talking-politics-is-a-united-ireland-coming-four-years-after-brexit/zhk7dmy",
        "title": "Talking <b>Politics</b>: Is a united Ireland coming, four years after Brexit?",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://inews.co.uk/news/politics/sturgeons-moral-superiority-vanished-2882496?ico=more_from_this_author",
        "title": "Just like her WhatsApps, Sturgeon’s moral superiority over Johnson has vanished",
        "description": "Throughout the pandemic, her <b>political</b> acuity and moral superiority stood in contrast to the chaos and carelessness of Boris Johnson. But just after 12.15pm on Wednesday, Nicola Sturgeon’s entire persona came crashing down. She blinked away tears as she ..."
    },
    {
        "url": "https://uk.news.yahoo.com/skipton-students-sit-live-debates-164346522.html",
        "title": "Skipton students sit in on live debates in Palace of Westminster",
        "description": "STUDENTS at Skipton Girl’s High School visited Westminster in the City of London in order to enrich their knowledge of <b>UK Politics</b>. One, Georgia Bateson, said: &quot;It was really insightful to see the inner workings of Parliament, and it brought to life ..."
    },
    {
        "url": "https://www.bbc.com/news/world-europe-68151965.amp",
        "title": "Boris Nadezhdin: Putin challenger submits bid to run for Russian president",
        "description": "Kremlin challenger Boris Nadezhdin says he has collected enough signatures to stand as a candidate in Russia&#39;s upcoming presidential election. The former local councillor has become known for his relatively outspoken criticism of Mr Putin and of Russia&#39;s full-scale invasion of Ukraine."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/exclusive-whats-in-the-legal-text-to-be-published-by-the-uk-government-as-part-of-dup-stormont-deal-4498918",
        "title": "Exclusive: What&#39;s in the legal text to be published by the <b>UK</b> government as part of DUP Stormont deal",
        "description": "The News Letter can reveal some of the legislative changes the UK government plans to introduce as part of a deal with the DUP to restore the Stormont Executive."
    },
    {
        "url": "https://uk.news.yahoo.com/council-vote-against-foul-threat-123000492.html",
        "title": "Council vote against &#39;foul threat&#39; to civil rights amidst protest outside",
        "description": "City councillors have unanimously voted against government legislation described as a &quot;foul threat&quot; to civil rights against the backdrop of protesters outside the town hall. The controversial &#39;Anti-Boycott Bill&#39; was discussed at an Oxford City Council ..."
    },
    {
        "url": "https://www.ft.com/content/fc600196-f821-4397-92fc-364ed8d2608a?trk=public_post_comment-text",
        "title": "India tells tech giants to police deepfakes under ‘explicit’ rules",
        "description": "Faked clips have already been used to influence <b>politics</b> and elections in the <b>UK</b>, Bangladesh, Nigeria, Sudan and Slovakia. Social media platforms meanwhile have drawn up rules to combat deepfakes. Meta, X and TikTok now require that deceptive manipulated ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/dup-chris-heatonharris-stormont-eu-commission-cameron-b1136216.html",
        "title": "DUP says Stormont deal has delivered ‘fundamental change’ to <b>UK</b>/EU trading rules",
        "description": "The EU has said it will ‘carefully analyse’ measures that would end routine checks on goods moving from GB to and staying in NI."
    },
    {
        "url": "https://www.thesun.co.uk/news/25639121/dup-restore-power-sharing-northern-ireland/",
        "title": "DUP agrees to restore power-sharing in Northern Ireland after two-year bitter Brexit row",
        "description": "NORTHERN Ireland is on the cusp of a return to a working government after two years. Hardline unionist party the DUP has agreed to restore power-sharing after a bitter Brexit row. And Michelle"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13029925/Investors-pull-8bn-woke-ESG-funds-amid-greenwashing-backlash.html",
        "title": "Investors pull £8bn out of woke ESG funds amid greenwashing backlash",
        "description": "Blackrock boss Larry Fink (pictured), was once at the forefront of the ESG movement but said last year that he had stopped using the term."
    },
    {
        "url": "https://www.thenational.scot/sport/national/24088985.abuse-officials-players-rugby-world-cup-sparks-legal-action/",
        "title": "Abuse of officials and players at Rugby World Cup sparks legal action",
        "description": "World Rugby has revealed legal action is being taken after match officials and players suffered online abuse during the 2023 World Cup. One individual in Australia has been charged for online abuse, cases in other jurisdictions are pending – including ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68159003?at_medium=RSS&at_campaign=KARANGA",
        "title": "Jeremy Hunt: Less scope for tax cuts in Budget",
        "description": "Jeremy Hunt has said there is likely to be less scope for tax cuts in the March Budget than there was last autumn. The chancellor told the BBC he wanted to &quot;lighten the tax burden&quot; to help grow the economy. But he said this had to be done in a &quot;responsible&quot; way."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/house-sturgeon-turned-mound-dust-32015848",
        "title": "The House of Sturgeon has turned into a mound of dust",
        "description": "Record Political Editor Paul Hutcheon says her confident handling of covid was part of her legacy, but this has now gone."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/ill-debate-jim-allister-when-he-publishes-paper-on-his-windsor-framework-achievements-donaldson/a116078044.html",
        "title": "I’ll debate Jim Allister when he publishes paper on his Windsor Framework achievements: Donaldson",
        "description": "Sir Jeffrey Donaldson has said he will have a public debate with Jim Allister when the TUV leader publishes a paper on what he has achieved in changing the Windsor Framework."
    },
    {
        "url": "https://inews.co.uk/news/politics/nicola-sturgeon-reputation-snp-votes-covid-betrayal-2883150?ico=more_from_this_author",
        "title": "Nicola Sturgeon loses reputation and SNP votes after Covid ‘betrayal’",
        "description": "Labour hopes to take a number of seats from Humza Yousaf’s party in this year’s general election, after being left with one in 2019"
    },
    {
        "url": "https://www.eppingforestguardian.co.uk/news/national/24088962.key-questions-deal-restore-powersharing-stormont/",
        "title": "The key questions on the deal to restore powersharing at Stormont",
        "description": "The DUP has agreed to end its blockade on devolution after two years protesting at post-Brexit trading arrangements."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24088497.unionist-advocacy-paid-dividends-changing-post-brexit-trade-rules---martin/",
        "title": "Unionist advocacy ‘paid dividends’ in changing post-Brexit trade rules – Martin",
        "description": "The foreign affairs minister was speaking after meeting with Stormont parties in Belfast as the deal agreed between the DUP and the <b>UK</b> Government was unveiled ... “I do sense from talking to <b>political</b> parties that there is a recognition and the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68161268?at_medium=RSS&at_campaign=KARANGA",
        "title": "Former FM Nicola Sturgeon returns to centre stage at Covid Inquiry",
        "description": "But there were awkward areas that she had to address. Nicola Sturgeon denies Covid decisions were <b>political</b> Nicola Sturgeon&#39;s reputation on the line at <b>UK</b> Covid inquiry Was Sturgeon just following WhatsApp guidelines by hitting delete? First up - WhatsApps."
    },
    {
        "url": "https://www.heraldscotland.com/news/24088795.five-exchanges-nicola-sturgeons-uk-covid-inquiry-appearance/?ref=rss",
        "title": "Five exchanges from Nicola Sturgeon’s <b>UK</b> Covid inquiry appearance",
        "description": "There was intense drama at today&#39;s hearing of the <b>UK</b> Covid inquiry when former first minister Nicola ... she was drained by the unrelenting and unforgiving pressures of modern <b>politics</b>. Ms Sturgeon became emotional several times during her evidence."
    }
]