[
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24142445.uk-us-launch-strikes-houthis-surge-attacks-shipping/",
        "title": "<b>UK</b> and US launch strikes against Houthis after surge in attacks on shipping",
        "description": "The <b>UK</b> and US have launched another round of missile strikes against Houthi targets in Yemen after a surge in attacks around the Red Sea by the Iran-backed group. American and British fighter jets hit sites in eight locations, according to US officials."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/uk-pledges-4-25m-in-sexual-and-reproductive-aid-for-women-in-gaza-100864/",
        "title": "<b>UK</b> pledges £4.25m in sexual and reproductive aid for women in Gaza",
        "description": "Foreign Secretary Lord Cameron reiterated the Government line that an ‘immediate pause’ in the fighting is needed."
    },
    {
        "url": "https://www.thetimes.co.uk/article/theres-no-debate-politics-belongs-on-the-curriculum-3bnmbtdsl",
        "title": "There’s no debate — <b>politics</b> belongs on the curriculum",
        "description": "Our leaders of tomorrow must be encouraged to develop skills in critical thinking and public speaking"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24142462.snp-propose-fresh-gaza-ceasefire-motion-commons-chaos/",
        "title": "SNP to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "Mr Flynn added: “The SNP’s calls for the <b>UK</b> to back an immediate ceasefire have never just ... A fresh debate will renew the <b>political</b> headache that Labour leader Sir Keir was able to avoid on Wednesday. Many of his MPs are likely to vote in favour ..."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-greeted-fierce-bear-hug-000701902.html",
        "title": "Trump greeted with fierce bear hug from Javier Milei backstage at CPAC",
        "description": "He’s a great gentleman ... he said ‘I am Maga’ then I realized these are the few [who] can really do it,’ former president says"
    },
    {
        "url": "https://uk.news.yahoo.com/mps-vote-fresh-gaza-ceasefire-001302310.html",
        "title": "MPs to vote on fresh Gaza ceasefire motion after Commons chaos",
        "description": "Story continues Mr Flynn added: “The SNP’s calls for the <b>UK</b> to back an immediate ceasefire have never ... A fresh debate will renew the <b>political</b> headache that Labour leader Sir Keir was able to avoid on Wednesday. Many of his MPs are likely to vote ..."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/24/nhs-tops-poll-of-voters-concerns-as-latest-strike-threatens-further-havoc",
        "title": "NHS tops poll of voters’ concerns as latest strike threatens further havoc",
        "description": "Junior doctors’ 11th walkout in England expected to add to backlogs in service a third of Britons say NHS is most pressing issue The NHS has overtaken soaring prices as the issue most Britons believe is the biggest challenge facing the <b>UK</b>, new polling ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-lancashire-68392068.amp",
        "title": "Huge Ukrainian flag unfurled at Preston anniversary event",
        "description": "<b>UK</b> <b>political</b> leaders recently reaffirmed their support for Ukraine, with Prime Minister Rishi Sunak saying Britain was prepared to do &quot;whatever it takes&quot; as he pledged nearly £250m towards producing artillery shells."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-gaza-government-keir-starmer-commons-b1141347.html",
        "title": "SNP to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "MPs are set to again debate calling for a ceasefire in Gaza after a previous attempt dissolved into angry recriminations and demands for the Commons Speaker to resign. The SNP said it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the last Commons debate on the subject."
    },
    {
        "url": "https://www.thetimes.co.uk/article/politics-turning-into-nightmare-conspiracy-theories-liz-truss-braverman-7dxlkxllt",
        "title": "<b>Politics</b> is turning into a nightmare of conspiracy theories",
        "description": "Liz Truss and Suella Braverman court the far right; the left is just as bad. No one dares mention our real problems"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/cameron-gaza-foreign-office-government-foreign-secretary-b1141343.html",
        "title": "<b>UK</b> pledges £4.25m in sexual and reproductive aid for women in Gaza",
        "description": "The <b>UK</b> has pledged £4.25 million to help the UN’s agency for ... But he repeated his call for a “new <b>political</b> horizon for the Palestinian people” and a two-state solution, which Israeli prime minister Benjamin Netanyahu opposes."
    },
    {
        "url": "https://news.sky.com/story/the-prime-minister-in-waiting-but-who-really-is-keir-starmer-13079122",
        "title": "The Prime Minister In Waiting - but who really is Keir Starmer?",
        "description": "The man himself may insist it isn&#39;t over until the votes are in, but Keir Starmer looks likely to be the next prime minister. Who is he and how did he get here? And why do those close to him feel the public doesn&#39;t see all of what they see?"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/the-worry-westminster-people-sick-32204219",
        "title": "&#39;The worry in Westminster: People are sick of Tories, but what if they don&#39;t vote Labour?&#39;",
        "description": "At a time when it&#39;s vital for people to be paying attention to politics, carnivals of point-scoring like what happened over the Gaza ceasefire vote shows why there&#39;s a lack of faith in politicians"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/snp-ceasefire-israel-gaza-b2501948.html",
        "title": "MPs to vote on fresh Gaza ceasefire motion after Commons chaos",
        "description": "The SNP says it will take up speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the previous Commons debate on the subject"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13121597/Lisa-Cameron-death-threats-joining-Tories-hiding-protect-children-former-SNP-MP.html",
        "title": "I was sent death threats for joining the Tories… I had to go into hiding to protect my children",
        "description": "A former Nationalist MP who was deluged with ­violent threats from online nationalist trolls after defecting to the Tories last night told of her ­turmoil at being forced to go into hiding."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/ranting-donald-trump-warns-hell-32203730",
        "title": "Ranting Donald Trump warns he&#39;ll save US from &#39;obliteration&#39; in World War 3 in wild CPAC speech",
        "description": "Trump, who described himself in his speech as a &quot;proud <b>political</b> dissident,&quot; has long said his 2020 election ... also made an appearance at the right-wing conference, with the <b>UK</b>&#39;s worst-ever Prime Minister hailed as a &quot;modern Margaret Thatcher&quot; by ..."
    },
    {
        "url": "https://drillordrop.com/2024/02/24/spending-doubles-at-cuadrilla-but-no-plans-for-future-substantive-expenditure/",
        "title": "Spending doubles at Cuadrilla but no plans for future “substantive expenditure”",
        "description": "Cuadrilla’s Australian owner spent more than £0.75m in six months in the UK in 2023, more than double the amount in the previous year. But the company has no plans for future “substantive"
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24142371.anderson-tory-whip-suspended-refusal-apologise-islamist-claim/",
        "title": "Anderson has Tory whip suspended after ‘refusal to apologise’ for Islamist claim",
        "description": "The decision was taken following the former Tory deputy chairman’s “refusal to apologise” for the remarks made on Friday, a spokesperson for chief whip Simon Hart said. Pres"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/24/lee-anderson-whip-suspended-sadiq-khan-islamists/",
        "title": "Farage woos Anderson after Tory suspended over Khan comments",
        "description": "Lee Anderson has had the Conservative whip withdrawn after claiming that “Islamists” have “got control” of Sadiq Khan. On Saturday afternoon, a spokesman for the Chief Whip Simon Hart said: “Following his refusal to apologise for comments made yesterday, the Chief Whip has suspended the Conservative whip from Lee Anderson MP.”"
    },
    {
        "url": "https://www.asianimage.co.uk/news/24142342.reform-leader-tice-wants-legistlate-supposed-sharia-law-threats/",
        "title": "Reform leader Tice wants to legistlate supposed Sharia Law threats",
        "description": "Reform UK leader Richard Tice said the country is at the “Everest base camp of sectarian politics” as he said political leaders, the establishment and the police were all in fear of extremists."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/24141747.rishi-sunak-vows-back-ukraine-prevails-war-anniversary/",
        "title": "Rishi Sunak vows to back Ukraine until it prevails on war anniversary",
        "description": "The Prime Minister said ‘tyranny will never triumph’ as President Volodymyr Zelensky’s troops defend the country against an emboldened Russia."
    },
    {
        "url": "https://metro.co.uk/2024/02/24/donald-trump-says-joe-biden-will-us-losing-world-war-3-20341468/?ico=trending-post-strip_item_3",
        "title": "Donald Trump says ‘crookedest’ Joe Biden will have US ‘losing World War 3’",
        "description": "We won’t even be in World War 3, we’ll be losing World War 3, with weapons the likes of which nobody has ever seen before.&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/24/rural-right-wing-voters-yougov-poll-conservatives-reform-uk/",
        "title": "Rural Right-wing voters abandon Tories in huge switch to Reform <b>UK</b>",
        "description": "Former Conservative voters living in the countryside are shifting allegiance to Richard Tice’s party, suggests poll by Labour think tank"
    },
    {
        "url": "https://www.thenational.scot/politics/24142211.unhinged-tory-conspiracies-nothing-new-uk-politics/",
        "title": "Unhinged Tory conspiracies are nothing new in <b>UK politics</b>",
        "description": "THE strapline is “where globalism goes to die.” The Conservative Political Action Conference styles itself as “the largest and"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/24/nigel-farage-reform-uk-conference-doncaster-party?ref=upstract.com",
        "title": "‘When’s Nigel coming back?’ Farage absence looms large over Reform <b>UK</b> conference",
        "description": "The leaders of Reform <b>UK</b>, which grew out of the Brexit party after the last ... “He’s the only one with any <b>political</b> nous,” said one former minister. He pointed to issues that seem too technical and remote, such as Northern Ireland’s Brexit ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870467/boris-johnson-rishi-sunak-relations-boost-ukraine",
        "title": "Boris Johnson and Rishi Sunak share major boost of relations on Ukraine anniversary",
        "description": "A simple social media post has given the biggest indication yet that Boris Johnson and Rishi Sunak are set to improve relations ahead of the General Election."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/24/the-observer-view-on-the-parliamentary-chaos-over-gaza",
        "title": "The Observer view on the parliamentary chaos over Gaza",
        "description": "x"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-broken-britain-reform-uk-manifesto-2924690?ico=in-line_link",
        "title": "Tories have ‘broken Britain’, says Reform <b>UK</b> leader as he unveils manifesto",
        "description": "Mr Tice said it demonstrated that Reform <b>UK</b> is now a “significant force now in British <b>politics</b> and that people have got to take us seriously”. Delegates attend the Reform <b>UK</b> Party spring rally at Doncaster Racecourse on February 24, 2024 in Doncaster ..."
    }
]