[
    {
        "url": "https://www.theguardian.com/business/2024/jan/27/to-get-to-net-zero-we-may-have-to-sell-off-the-uks-future",
        "title": "To get to net zero, we may have to sell off the <b>UK</b>’s future",
        "description": "The <b>UK</b>, meanwhile, is taking a piecemeal approach with one-off ... There is even less state cash to play with these days if we accept that entrenched <b>political</b> interests prevent reform of the tax system and that state borrowing has limits."
    },
    {
        "url": "https://www.hertsad.co.uk/news/national/24079216.death-camp-survivors-mark-79th-anniversary-auschwitz-birkenau-liberation/",
        "title": "Death camp survivors mark 79th anniversary of Auschwitz-Birkenau liberation",
        "description": "A group of survivors of Nazi death camps marked the 79th anniversary of the liberation of the Auschwitz-Birkenau camp during the Second World War in a modest ceremony on Saturday in southern Poland. About 20 survivors from various camps set up by Nazi Germany around Europe laid wreaths and flowers and lit candles at the Death Wall in Auschwitz."
    },
    {
        "url": "https://news.sky.com/story/post-office-chairman-henry-staunton-ousted-amid-row-with-government-13057745",
        "title": "Post Office chairman Henry Staunton ousted amid row with government",
        "description": "&quot;This is why the <b>UK</b> government announced new legislation ... surrendered her CBE after growing public and <b>political</b> pressure. Kevin Hollinrake, the postal affairs minister, has said he would support prosecutions of those involved in the scandal and ..."
    },
    {
        "url": "https://inews.co.uk/news/how-the-uk-and-us-will-respond-to-houthi-missile-strike-and-the-impact-on-gaza-2876856",
        "title": "How <b>UK</b> and US will respond to latest Houthi missile strike",
        "description": "The US and UK have conducted airstrikes on Houthi military sites in Yemen in response. This includes when UK and US warships repelled a barrage of 21 Houthi rockets, drones and cruise missiles apparently fired at western warships in the Red Sea in early January."
    },
    {
        "url": "https://www.middleeasteye.net/news/palestine-officials-denounce-us-uk-pause-funding-unrwa",
        "title": "War on Gaza: Palestinian officials denounce US and <b>UK</b> decision to pause Unrwa funding",
        "description": "The <b>UK</b> government has by suspending funding to Unrwa caved in ... of their support for Unrwa to immediately reverse their decision, which entails great <b>political</b> and humanitarian relief risks.&quot; The development was also condemned by Hamas, which accused ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/national/ireland-has-no-plans-to-suspend-funding-to-unrwa-amid-israeli-allegations-98628/",
        "title": "Ireland has ‘no plans’ to suspend funding to UNRWA amid Israeli allegations",
        "description": "As well as the <b>UK</b> and US, Australia, Italy and Canada have also temporarily ... people of Gaza – and all states and private entities rendering aid, granting <b>political</b> cover to, or otherwise enabling, this assault must cease such support immediately ..."
    },
    {
        "url": "https://uk.news.yahoo.com/russia-provocations-kyiv-security-forum-155500318.html",
        "title": "Russia’s provocations: Kyiv Security Forum identifies five global flashpoints",
        "description": "Despite targeted airstrikes by the US, <b>UK</b>, Australia, Bahrain, Canada ... Currently, the conflict involves strong <b>political</b> statements. On Jan. 25, Colonel Wu Qian, spokesperson for the Chinese Ministry of National Defense, reiterated that Taiwan is ..."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/uk-today/24079129.robbie-williams-named-president-port-vale-football-club/",
        "title": "Robbie Williams named president of Port Vale Football Club",
        "description": "British singer Robbie Williams has been named president of Port Vale Football Club. The English Football League (EFL) League One club - which is based in Burslem, Stoke-on-Trent - made the announcement on Friday (January 26) night. Port Vale, at the time ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/hatred-margaret-thatcher-still-burns-31959010?int_source=nba",
        "title": "&#39;Hatred&#39; of Margaret Thatcher &#39;still burns bright&#39; in Scots mining communities 40 years on, says MP",
        "description": "“The miners’ strike is a poignant chapter in Scotland’s history, symbolising the struggle of industrial workers against <b>UK</b> government policies hostile to their livelihoods and communities. “It helped shape <b>political</b> attitudes in Scotland ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/holocaust-survivor-poignant-plea-people-31899036",
        "title": "Holocaust survivor poignant plea as people &#39;still easily hate others who are different&#39;",
        "description": "He is recorded to have died on March 25, 1945 in Buchenwald, another camp. As a young refugee Dr Stern came to the <b>UK</b> in 1950, went to Manchester Grammar School and then on to University of Oxford to read Medicine. He&#39;s since been involved in activism to ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/ireland-micheal-martin-israeli-gaza-international-court-of-justice-b1135247.html",
        "title": "Ireland has ‘no plans’ to suspend funding to UNRWA amid Israeli allegations",
        "description": "The US and UK are among countries to pause funding to the relief agency after Israel claimed some of its staff participated in the October 7 attacks."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13013535/woke-Britain-Russia-conscription-Bob-Seely-MP-political-correctness.html",
        "title": "Does &#39;woke&#39; Britain have the strength to come together and defeat Russia? As leaders talk of conscription, former soldier Bob Seely MP warns &#39;the poison of <b>political</b> ...",
        "description": "The <b>UK</b> reserves account for just 17.8 percent of total Armed Forces ... It goes by a series of names; ‘woke’, ‘critical theory’, ‘cultural war’ but is generally known as <b>political</b> correctness. I don’t believe that the minority that peddle ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/27/uk-to-pause-funding-for-key-un-aid-agency-for-palestinian-refugees",
        "title": "<b>UK</b> to pause funding for key UN aid agency for Palestinian refugees",
        "description": "Government follows example of US after allegations that staff took part in attacks on Israel last year The <b>UK</b> is to pause funding for the UN’s key aid agency for Palestinian refugees after allegations that several of its employees took part in Hamas’s ..."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24079062.uk-pauses-funding-unrwa-claims-staff-involved-hamas-attack/",
        "title": "<b>UK</b> pauses funding for UNRWA over claims staff involved in Hamas attack",
        "description": "The <b>UK</b> will suspend funding for the UN’s relief agency in Gaza over claims made by Israel that a number of its employees were involved in Hamas’s October 7 attack.The Foreign Office said Britain is “appalled” by allegations about staff at the ..."
    },
    {
        "url": "https://leftfootforward.org/2024/01/could-the-tories-still-win/",
        "title": "Could the Tories still win?",
        "description": "Could 2024 become remembered for the British people ‘hurling the findings of the opinion polls back into the faces of the pollsters,’ as Times’ journalist George Clarke wrote following the Tories’ shock win in 1970?"
    },
    {
        "url": "https://www.bbc.com/news/world-middle-east-68104203?at_format=link",
        "title": "UNRWA Hamas attack claims: <b>UK</b> becomes latest country to pause funding for agency",
        "description": "The <b>UK</b> has become the latest country to pause funding for the ... said the decision by some countries to pause support for the vital UN agency &quot;entails great <b>political</b> and humanitarian relief risks&quot;. Mr al-Sheikh urged Western donors to immediately reverse ..."
    },
    {
        "url": "https://www.politico.eu/article/italy-canada-australia-united-states-funding-unrwa-united-nations-hamas-israel/",
        "title": "<b>UK</b>, Italy, Canada, Australia join US in pulling funding for UN Palestinian agency",
        "description": "Britain, Italy, Canada and Australia followed the United States in withdrawing financial support for the United Nations agency for Palestinian refugees after some of its employees were suspected of involvement in the October 7 Hamas attacks against Israel."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1860439/Huw-Edwards-now-unfit-talks-future-bbc-suspension-health",
        "title": "Huw Edwards ‘remains unfit to join talks about his future at BBC’ after suspension",
        "description": "BBC chief news presenter Huw Edwards was suspended in July 2023 over allegations that he received inappropriate messages from a teenager and gave them money."
    },
    {
        "url": "https://sluggerotoole.com/2024/01/27/fool-me-once-shame-on-you-fool-me-twice/",
        "title": "Fool me once, shame on you, fool me twice…",
        "description": "Stephen Phipson, CEO of Make <b>UK</b>, the manufacturers’ organisation said ... why is he taking such a hell of a <b>political</b> risk? And quotes the aforementioned Kemi Badenock as saying: “I can’t, of course, comment on the Northern Ireland <b>political</b> ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68104203?at_bbc_team=editorial&at_campaign=Social_Flow&at_campaign_type=owned&at_format=link&at_link_id=E0CBDE06-BD16-11EE-A499-9F1487A28522&at_link_origin=BBCBreaking&at_link_type=web_link&at_medium=socia",
        "title": "Funding paused as UNRWA staff probed over Hamas attack",
        "description": "The UK, Australia, Italy and Canada have become the latest countries to pause funding for the UN agency for Palestinians, UNRWA. This comes after the agency announced the sacking of several of its staff over allegations of involvement in the 7 October Hamas attacks."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-scotland-68117859",
        "title": "The Covid Inquiry Podcast 19. &quot;She Actually Wants None Of Us&quot;",
        "description": "The Covid Inquiry hears its second week of evidence in Edinburgh, with questions over the deletion of WhatsApp messages. The BBC&#39;s Lorna Gordon has been following the hearings in Scotland and reflects on the week&#39;s revelations. Prof Leitch says he gave then Health Secretary Humza Yousaf mask-rule advice for a drinks reception in late 2021."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-defence-secretary-to-face-questions-as-uk-sends-military-assets-to-the-middle-east-12593360?postid=6589138.",
        "title": "<b>Politics</b> latest: More names of plotters trying to oust Rishi Sunak expected to be revealed; Reform <b>UK</b> surges in polls",
        "description": "<b>UK</b> general elections have to be held no more than five years ... The new year is upon us, and the <b>political</b> party leaders are working hard to convince the public to back them in the upcoming general election. But while the latest opinion polls will likely ..."
    },
    {
        "url": "https://www.chesterstandard.co.uk/news/24077310.chase-contestant-northwich-takes-shot-75k/",
        "title": "The Chase contestant from Cheshire West takes shot at £75k",
        "description": "A Cheshire West woman who appeared on The Chase bravely took a shot at £75,000 on the popular quiz show. Sarah Bowyer gave a strong performance on the ever-popular TV game quiz, where four competitors take on some of the UK’s finest minds for potentially life-changing cash prizes,"
    },
    {
        "url": "https://www.thesun.co.uk/news/25540744/nazi-children-saved-sir-nicholas-winton-film/",
        "title": "I was one of 669 children saved from Nazis by Sir Nicholas Winton – now I’m working on film depicting moment we met him",
        "description": "A WOMAN who was one of 669 children saved from the Nazis by Sir Nicholas Winton has worked on a film depicting his heroic life. Lady Milena Grenfell-Baines MBE, 94, was just nine when"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24078943.firefighting-continues-british-linked-ship-struck-houthis-gulf-aden/",
        "title": "Firefighting continues on British-linked ship struck by Houthis in Gulf of Aden",
        "description": "The <b>UK</b> and its allies “reserve the right to respond appropriately” following the latest attack claimed by the Iran-backed group, the Government has said. The Marlin Luanda went up in flames on Friday after Houthi threats to shipping in the region ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13013171/Harry-Meghans-Jamaica-trip-not-welcome-London-jaunt-criticised-misguided-political-connotations.html",
        "title": "Harry and Meghan&#39;s Jamaica trip was &#39;not especially welcome back in London&#39; as jaunt is criticised as being &#39;misguided&#39; due its <b>political</b> connotations",
        "description": "The Duke and Duchess of Sussex made a surprise visit to the Caribbean country this week to attend the premiere of Bob Marley: One Love and support the Marley family."
    },
    {
        "url": "https://inews.co.uk/news/politics/why-brexit-is-still-not-done-and-why-its-about-to-cause-even-more-chaos-2876327?ico=more_from_this_author",
        "title": "Why Brexit is still not ‘done’ – and why it’s about to cause even more chaos",
        "description": "The standoff is just the latest <b>political</b> flashpoint in the ongoing Brexit drama. Experts warn there is also a huge economic cost. Economist Thomas Sampson, an associate professor at the London School of Economics, says that Brexit is costing the <b>UK</b> ..."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-doubles-down-against-border-165906889.html",
        "title": "Trump Doubles Down Against Border Deal, Even As Biden Pledges Shutdown",
        "description": "Senate Minority Leader Mitch McConnell (R-Ky.) this week told GOP senators that the “<b>politics</b> on this have changed” because of Trump’s renewed push to make immigration his main 2024 campaign issue, according to Punchbowl News. McConnell reportedly ..."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/24078857.greta-thunberg-joins-protest-farnborough-airport/",
        "title": "Greta Thunberg to be at Farnborough Airport with Extinction Rebellion",
        "description": "Greta Thunberg is joining an Extinction Rebellion protest against private jets at Farnborough Airport on Saturday, January 27"
    },
    {
        "url": "https://www.heraldscotland.com/news/24073106.sturgeon-whatsapps-matter-covid-inquiry/",
        "title": "Sturgeon, WhatsApps, and why they matter to Covid inquiry",
        "description": "A &quot;Watergate-style cover up&quot; or an anti-SNP &quot;witch-hunt&quot;? In the polarised world of Scottish politics, the row over the"
    },
    {
        "url": "https://metro.co.uk/2024/01/27/britain-not-equipped-deal-chinese-spies-says-ex-mi6-boss-20181690/?ico=metro-posts_article_whats-trending-now",
        "title": "Ex-MI6 boss’s dire warning about how prepared <b>UK</b> is against spies",
        "description": "David Cameron presided over a ‘golden era’ of <b>UK</b>-China relations during his time as PM (Picture: PA) Prime Minister Rishi Sunak, however, said in November that Lord Cameron’s <b>political</b> comeback as Foreign Secretary late last year will not mean the ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/inside-prince-harrys-close-bond-31959726.amp",
        "title": "Inside Prince Harry&#39;s close bond and sweet relationship with Princess Kate before Meghan",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. The Duke of Sussex was once incredibly close to his sister-in-law Princess Catherine(<b>UK</b> Press via Getty Images) The trio then became famed for carrying out ..."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/27/middle-east-crisis-live-us-military-says-it-destroyed-a-houthi-anti-ship-missile-site-hours-after-oil-tanker-attack?page=with:block-65b50de18f08f89f155ecd78",
        "title": "Middle East crisis live: <b>UK</b> suspends support for UN’s Gaza aid agency after staff accused of involvement in Hamas attack on Israel",
        "description": "<b>UK</b> joins US, Italy, Canada and Australia in suspending support for UNRWA following 7 October allegations The <b>UK</b> has temporarily paused future funding of UNRWA, saying it is “appalled by allegations that UNRWA staff were involved in the 7 October attack ..."
    },
    {
        "url": "https://www.ft.com/content/8576a0f1-a57c-4935-899b-84026f9efc5e",
        "title": "More countries pull funding from UN agency over October 7 attack allegations",
        "description": "The <b>UK</b> Foreign Office said: “The <b>UK</b> is appalled by allegations ... secretary-general Hussein al-Sheikh warned that the suspension of funding carried “great <b>political</b> and humanitarian risks” at a time when millions of Palestinians in Gaza depended ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/suspended-presenter-huw-edwards-too-102825215.html",
        "title": "Suspended presenter Huw Edwards ‘too unwell to discuss future at BBC’",
        "description": "Resolving Mr Edwards’s future is coming into sharper focus as the BBC prepares for a busy news year, with multiple elections taking place across the world - as well as in the <b>UK</b> - and wars in ... at the helm of significant <b>political</b> and royal events ..."
    },
    {
        "url": "https://www.ft.com/content/a6f6c456-c9d4-49a3-9a89-c966e0d89d15",
        "title": "<b>UK</b> proposes plan to end Israel-Hamas war",
        "description": "Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. The <b>UK</b> is proposing a five-point plan to end the war between Israel and Hamas, as western allies that have backed the Jewish state push for a permanent ceasefire and a ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/british-government-fire-iran-grant-shapps-b1135225.html",
        "title": "Fire on British-linked ship put out after Houthi strike in Gulf of Aden",
        "description": "The <b>UK</b> and its allies “reserve the right to respond appropriately” following the latest attack claimed by the Iran-backed group, the Government has said. The Marlin Luanda went up in flames on Friday after Houthi threats to shipping in the region ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68106040?at_campaign_type=owned&at_campaign=Social_Flow&at_link_type=web_link&at_ptr_name=facebook_page&at_link_origin=BBC_Politics&at_bbc_team=editorial&at_link_id=F40FA8A0-BCF6-11EE-8497-D217AAF30DC0&at_format=link&at_medium=social",
        "title": "Former Fujitsu <b>UK</b> CEO quits government role",
        "description": "The Post Office prosecuted 700 sub-postmasters and sub-postmistresses after faulty software made it look like money was missing The former <b>UK</b> head of Fujitsu during part of the Post Office scandal has resigned from his role at the Cabinet Office."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-give-evidence-uk-31959173",
        "title": "Humza Yousaf to give evidence at <b>UK</b> Covid Inquiry as SNP ministers face growing secrecy row",
        "description": "The <b>UK</b> Covid Inquiry was set-up to examine how Westminster and ... To sign up to the Daily Record <b>Politics</b> newsletter, click here."
    },
    {
        "url": "https://www.palatinate.org.uk/labour-on-cronyism-time-for-a-crackdown/",
        "title": "Labour on cronyism: time for a crackdown?",
        "description": "At home, Reform <b>UK</b> promises to end council wastage by implementing a blanket ... There is a considerable level of cynicism and disillusionment surrounding British <b>politics</b> at present, very possibly reflected here. An attack on backroom deals and nepotistic ..."
    }
]