[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h47f7b",
        "title": "The Post Office Scandal: Justice Delivered?",
        "description": "James and Chris talks Rebecca Thomson, the journalist who first broke the story back in 2009. Alicia Kearns, chair of the Foreign Affairs Select Committee is also on, after having grilled Lord Cameron, the foreign secretary, over the UK’s approach to the war in the middle east, as well as military support for Ukraine."
    },
    {
        "url": "https://inews.co.uk/news/politics/pressure-sunak-sanction-fujitsu-post-office-scandal-2847932?ico=above_article_ticker",
        "title": "Pressure on Sunak to sanction Fujitsu over Post Office scandal",
        "description": "Pressure is mounting on Rishi Sunak to ban Fujitsu from securing future government contracts and for the Japanese giant to compensate victims of the Post Office scandal."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/leisure/national/24041526.georgia-harrison-love-island-spin-off-welcome-break-revenge-porn-trial/",
        "title": "Georgia Harrison: Love Island spin-off is welcome break after revenge porn trial",
        "description": "Obviously I changed the law, I got to go into Downing Street, I’ve really took some large steps within the <b>political</b> sector over the last couple of years. “And in a way, I’ve absolutely loved that new area of my life, but it can be really draining ..."
    },
    {
        "url": "https://www.itv.com/watch/itv-evening-news/2a4545/2a4545a2090",
        "title": "ITV Evening News",
        "description": "The day&#39;s national and international news with reports and analysis from ITV&#39;s Correspondents in the <b>UK</b> and around the world ... and real-life victims on scandal 2 hours ago • Talking <b>Politics</b>: Watch ITV News&#39; new podcast as the Post Office scandal ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/disabled-children-battle-access-free-31853486",
        "title": "Disabled children in &#39;battle&#39; for access to free school meals as over 100,000 go without",
        "description": "More than 100,000 eligible disabled children are unable to access the free school meals they are meant to receive due to reasons including sensory difficulties or absence due to illness"
    },
    {
        "url": "https://inews.co.uk/news/fujitsu-post-office-scandal-horizon-2847627?ITO=msn",
        "title": "How Fujitsu became embedded at the heart of <b>UK</b> infrastructure amid Horizon scandal",
        "description": "Senior politicians, such as Conservative former minister Mark Francois, have called on the Government to &#39;consider suspending&#39; Fujitsu contracts following the scandal"
    },
    {
        "url": "https://news.sky.com/story/post-office-horizon-scandal-postmasters-very-cynical-of-new-law-to-quash-convictions-13045494",
        "title": "Post Office Horizon scandal: Mass exoneration of sub-postmasters &#39;right thing to do&#39; despite concerns over judicial independence, minister says",
        "description": "A lawyer previously said legislation announced by Rishi Sunak risked &quot;riding roughshod&quot; over judicial independence."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-post-office-minister-admits-government-worried-about-new-law-to-quash-convictions-12593360",
        "title": "<b>Politics</b> latest: Gary Lineker challenged to run against Tory MP in Stoke-on-Trent North",
        "description": "Next on <b>Politics</b> Hub with Sophy Ridge ... Iran of &quot;guiding what is happening&quot; in the Red Sea by providing equipment and intelligence. He says the <b>UK</b> must be clear that the attacks &quot;have to stop&quot;, and adds: &quot;Watch this space.&quot; Finally, Sophy Ridge asks ..."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1853762/Love-Island-all-stars-2024-Georgia-Harrison-political-career",
        "title": "Love Island’s Georgia Harrison ‘conscious of <b>political</b> career’ as she joins All Stars cast",
        "description": "All Stars contestant Georgia Harrison has been bravely campaigning for the online safety of women and girls. Having previously discussed a future career in politics, Georgia told Express.co.uk about how she plans to keep this in mind during her time in the villa."
    },
    {
        "url": "https://www.bbc.com/news/uk-67940193",
        "title": "Can the Post Office exoneration scheme work?",
        "description": "The government will face pressure to ensure this legislation is a one-off to correct an exceptional injustice."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24040880.anne-praises-extraordinary-work-save-children-sri-lanka/",
        "title": "Anne praises ‘extraordinary’ work of Save the Children in Sri Lanka",
        "description": "The Princess Royal attended a number of engagements marking the 75th anniversary of Britain’s diplomatic links with Sri Lanka."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/hidden-faces-post-office-scandal-31839231",
        "title": "Hidden faces of Post Office scandal - people in power lurking in background as saga unfolded",
        "description": "I think ministers from all <b>political</b> parties were misled ... worked as chief executive and chairman for the <b>UK</b> operative branch of Fujitsu, the tech company behind Horizon. Keegan has denied having any operational involvement during his chief executive ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/gen-zs-refusal-join-rat-race-admired-20094488/?ico=metro-posts_uncategorized_whats-trending-now",
        "title": "Should Gen-Z’s refusal to join the rat race be admired?",
        "description": "Metro.co.<b>uk</b> is a member of the Independent Press Standards Organisation ... to the world – rather than isolationist – as being a betrayal. As if his brand of <b>politics</b> was self-certifiably the most patriotic. I’ll think of his ‘patriotism ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67939327",
        "title": "Post Office scandal: New law pledged but issues remain",
        "description": "The BBC&#39;s political editor Chris Mason on how a TV drama has &quot;turbocharged&quot; political interest in the Post Office scandal."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/10/rishi-sunak-latest-news-post-office-hollinrake-horizon/?utmsource=email",
        "title": "<b>Politics</b> latest news: Sunak &#39;taken hostage&#39; by Tory MPs over Rwanda plan, claims Starmer",
        "description": "what I do know is that Reform is going to play a very important role in realigning the centre right of British <b>politics</b> to give us a proper choice.” Nigel Farage rejected the claim made by the Tories that a vote for Reform <b>UK</b> at the next election would ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/anders-breivik-says-prison-a-nightmare-sues-isolation-20090841/?ico=metro-posts_home_whats-trending-now",
        "title": "Mass-murderer Anders Breivik moans about being lonely in prison",
        "description": "I am willing to give up <b>politics</b>.’ Convicted mass murderer Anders Behring Breivik ... Get in touch with our news team by emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check our news page."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/post-office-scandal-horizon-pmqs-commons-parliament-b1131470.html",
        "title": "PMQs sketch: &#39;A plague on all their houses&#39; after decades of <b>political</b> dither over Post Office scandal",
        "description": "Labour leader Sir Keir Starmer appeared keen to immunise himself from the Post Office “plague”. He quickly moved past the scandal to ridicule Mr Sunak about his Rwanda deportation scheme, which faces mounting disquiet on the Tory backbenches."
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/01/10/why-reform-uk-remains-a-mystery/",
        "title": "Why Reform <b>UK</b> remains a mystery",
        "description": "The opinions in <b>Politics</b>.co.<b>uk</b>&#39;s Comment section are those of the author. It categorically rules out an electoral pact with the Conservatives, but opts to stand aside in the forthcoming Kingswood by-election. It claims to want to “destroy” the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/gove-denies-knowing-government-interference-134705096.html",
        "title": "Gove denies knowing of Government ‘interference’ with independent Teesworks probe",
        "description": "Michael Gove has denied being aware of any Government “interference” with the independent review into the Teesworks development. The Levelling Up Secretary said that part of the inquiry’s report will have already been seen by people in his department ..."
    },
    {
        "url": "https://www.cityam.com/a-stronger-pound-and-bond-vigilantes-what-should-markets-expect-ahead-of-an-election/",
        "title": "A stronger pound and ‘bond vigilantes’: What should markets expect ahead of an election",
        "description": "&quot;In the lead-up to this year’s UK election, we’re watching the fiscal policy stance,&quot; chief investment strategist at Blackrock, told Bloomberg."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tobias-ellwood-andrew-mitchell-afghanistan-minister-foreign-office-b2476543.html",
        "title": "Minister: Officials speak regularly but <b>UK</b> ‘some way off’ recognising Taliban",
        "description": "He also said the Government will keep “very much under review” calls to reopen the <b>UK</b> embassy in Afghanistan, but he noted the security and <b>political</b> situation does not currently allow them to re-establish a diplomatic presence in Kabul. Mr Mitchell ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13157481.unspun-politics-diary/",
        "title": "Unspun: The <b>Politics</b> Diary",
        "description": "SPARE a thought for Tory environment spokesman Sir Jamie McGrigor MSP as he scrabbles to secure a windfarm on his Argyll estate that could bag him £8million. Nearby residents are up in arms about the proposal at Ardchonnel, and council officials are ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13156761.three-universities-join-cbi-exodus-wake-pro-uk-positioning/",
        "title": "Three universities join CBI exodus in wake of pro-<b>UK</b> positioning",
        "description": "&quot;We have a clearly stated position that Scotland and the rest of the <b>UK</b> are stronger together on economic grounds ... to its members how it reached the conclusion to take a landmark <b>political</b> stand against independence.&quot; Mr Cridland told BBC Radio 4&#39;s ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24040921.will-snp-recognise-dangers-strategy-chosen/",
        "title": "Will the SNP recognise the dangers of the strategy they have chosen?",
        "description": "IAN Roberts (Letters, Jan 8) puts the most pertinent questions in relation to gaining independence, fairly and squarely, in the context of"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tobias-ellwood-andrew-mitchell-afghanistan-foreign-office-kabul-b1131553.html",
        "title": "Minister: Officials speak regularly but <b>UK</b> ‘some way off’ recognising Taliban",
        "description": "Foreign Office minister Andrew Mitchell was responding to calls from Tory MP Tobias Ellwood for the UK to re-engage with Afghanistan."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/police-chiefs-accuse-significant-political-figures-of-improper-interference/",
        "title": "Police chiefs accuse &#39;significant <b>political</b> figures&#39; of improper interference",
        "description": "In a letter to Home Secretary James Cleverly, Chief Inspector of Constabulary Andy Cooke said most senior officers in 12 forces have experienced &quot;improper pressure or interference from significant political figures, whether through direct contact or through the media&quot;."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/ex-tory-minister-pleads-uk-31853039",
        "title": "Ex-Tory minister pleads for <b>UK</b> to engage with Taliban amid &#39;another 9/11&#39; fear",
        "description": "Tobias Ellwood said that the majority of Taliban members aren&#39;t fundamentalists, claiming many join the group for social and tribal reasons"
    },
    {
        "url": "https://www.thenational.scot/news/24041426.scottish-post-office-scandal-victims-cleared-humza-yousaf-says/",
        "title": "Scottish Post Office scandal victims to be cleared, Humza Yousaf says",
        "description": "ALL subpostmasters wrongly convicted in Scotland because of the Post Office Horizon IT scandal will be cleared, Humza Yousaf has said"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-suella-bravermans-war-on-woke-policing-criticised-by-her-own-review-as-rishi-sunak-moves-fast-to-tackle-post-office-scandal-12593360",
        "title": "<b>Politics</b> latest: Suella Braverman&#39;s war on &#39;woke&#39; policing criticised by her own review - as Rishi Sunak moves fast to tackle Post Office scandal",
        "description": "<b>UK</b> general elections have to be held no more than five years ... of postmasters that began during the Cameron years come back to haunt him. Coming up on <b>Politics</b> Hub With Sophy Ridge at 7pm Our weeknight <b>politics</b> show <b>Politics</b> Hub With Sophy Ridge is ..."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/10/sir-lynton-crosby-step-back-tory-lobbying-ct-group-election/",
        "title": "Sir Lynton Crosby steps back at Tory lobbying firm as election looms",
        "description": "The Australian election strategist, nicknamed the “Wizard of Oz”, is moving away from frontline <b>politics</b> in the <b>UK</b> having previously spearheaded successful campaigns for Boris Johnson, Theresa May and David Cameron. Sir Lynton served as an informal ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1854272/nigel-farage-labour-general-election",
        "title": "&#39;Here&#39;s the truth of it&#39;: Nigel Farage makes dire Labour general election prediction",
        "description": "He also insisted Reform <b>UK</b> is going to play a key part in &quot;realigning the centre right of British <b>politics</b>&quot;. But he said he was undecided over his future amid rumours of a sensational <b>political</b> comeback. Mr Farage told GB News: “I think Labour has got a ..."
    },
    {
        "url": "https://msf.org.uk/article/explainer-why-msf-treating-people-seeking-asylum-uk",
        "title": "Explainer: Why is MSF treating people seeking asylum in the <b>UK</b>?",
        "description": "Médecins Sans Frontières / Doctors Without Borders (MSF) is now providing primary healthcare to people seeking asylum in the UK who are being held at the large-scale containment site at Wethersfield in Essex."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/horizon-post-office-scandal-victims-31853369",
        "title": "Horizon Post Office scandal victims in Scotland to be cleared, says Humza Yousaf",
        "description": "Everyone in Scotland convicted as part of the Horizon Post Office scandal will be cleared, Humza Yousaf has said. Yousaf said he would work with Westminster to make sure that all victims across the UK are exonerated."
    },
    {
        "url": "https://www.itv.com/news/border/2024-01-10/snp-first-minister-humza-yousaf-talks-independence-tax-and-alex-salmond",
        "title": "SNP First Minister Humza Yousaf talks independence, tax and Alex Salmond",
        "description": "It&#39;s been a turbulent year for the SNP, from the resignation of Nicola Sturgeon to the investigation into the party&#39;s finances. | ITV News Border"
    },
    {
        "url": "https://metro.co.uk/2024/01/10/gen-zs-refusal-join-rat-race-admired-20094488/",
        "title": "Should Gen-Z’s refusal to join the rat race be admired?",
        "description": "He was writing in response to actress Jodie Foster, who said their workplace attitude was ‘annoying’ – coming in late if they felt like it, and describing proper grammar and correct spelling in emails as ‘limiting’. Louis says we should admire their refusal to join the rat race and burn themselves out just to please the boss."
    },
    {
        "url": "https://www.forres-gazette.co.uk/news/national/northern-ireland-set-to-be-brought-to-a-standstill-by-massive-strike-97251/",
        "title": "Northern Ireland set to be ‘brought to a standstill’ by massive strike",
        "description": "Northern Ireland is set to be brought to a standstill next week in the biggest strike in recent history, trade unions have said."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24041273.champagne-stolen-mainsgill-farm-shop-east-layton/",
        "title": "Champagne stolen from Mainsgill Farm Shop, East Layton",
        "description": "Anyone with any information is asked to email Fiona.Wilding@northyorkshire.police.<b>uk</b>. If you wish to remain anonymous, you can pass information to Crimestoppers on 0800 555 111. Please quote reference number 12230236868."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-making-the-best-of-bad-news/",
        "title": "London Playbook PM: Making the best of bad news",
        "description": "MAKING THE BEST OF BAD NEWS: Rishi Sunak heads into the evening with a rare spring in his step after seizing the narrative on the Post Office scandal and making his government look responsive in tackling a horrific injustice."
    },
    {
        "url": "https://metro.co.uk/2024/01/10/post-office-scandal-eurovision-tv-shows-sparked-a-revolution-20093855/?ico=more_text_links",
        "title": "From Mr Bates to Eurovision: When TV shows sparked a revolution",
        "description": "The song had no <b>political</b> messages, but it was used to spark a movement ... If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.<b>uk</b> entertainment team by emailing us celebtips@metro.co.<b>uk</b>, calling 020 3615 2145 or by visiting ..."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/national/24041196.adviser-calls-transparency-procurement-prevent-future-scandals/",
        "title": "Adviser calls for more transparency on procurement to prevent future scandals",
        "description": "Mr Keith, chairman of the <b>UK</b> Open Government Network ... whilst continuing to pursue reforms in health, environment, <b>political</b> integrity and the protection of civic space.” A group has already been established in the Cabinet Office to examine freedom ..."
    },
    {
        "url": "https://www.stroudnewsandjournal.co.uk/news/national/24041195.kremlin-foe-alexei-navalny-jokes-court-via-video-link-arctic-prison/",
        "title": "Kremlin foe Alexei Navalny jokes in court via video link from Arctic prison",
        "description": "Mr Navalny, who is President Vladimir Putin’s fiercest <b>political</b> foe, is serving time on charges of extremism. He spent months in isolation at Prison Colony No. 6 before his transfer. He was repeatedly placed in a tiny punishment cell over alleged minor ..."
    },
    {
        "url": "https://uk.news.yahoo.com/george-conway-trump-legal-team-173008352.html",
        "title": "George Conway: Trump legal team’s immunity argument ‘made absolutely no sense’",
        "description": "“So what he’s saying, on one hand, is saying we can’t have presidents prosecuted because … it could be <b>political</b>, and then he’s saying that the <b>political</b> Congress gets to decide,” Conway told CNN’s Kaitlan Collins. “It made absolutely no sens"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/10/rishi-sunak-post-office-scandal-pmqs-keir-starmer-uk-politics-live?topics=PERSON%3AMichael+Gove",
        "title": "Horizon inquiry has shown evidence of ‘incompetence and malevolence’ by Post Office, says minister – <b>UK politics</b> live",
        "description": "Kevin Hollinrake, responding to urgent question about Post Office scandal, says evidence was not available at time of prosecutions Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages ..."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12946073/BUSINESS-LIVE-Sainsburys-lifted-groceries-Greggs-open-sites-Persimmon-flags-market-uncertainty.html",
        "title": "BUSINESS LIVE: Sainsbury&#39;s lifted by groceries; Greggs to open 160 sites; Persimmon flags market uncertainty",
        "description": "‘As inflation falls in the <b>UK</b> and we get closer to the general election, <b>political</b> parties may be more tempted to promise looser fiscal policy – the more this occurs, the greater the likelihood of the return of the bond vigilantes,’ Paul told ..."
    }
]