[
    {
        "url": "https://www.mirror.co.uk/news/health/parkinsons-disease-breakthrough-new-treatment-31798459",
        "title": "Parkinson&#39;s disease breakthrough as new treatment could use specific genetic mutation",
        "description": "The discovery &#39;opens exciting new directions&#39; for developing precision medicine-based therapies for Alzheimer&#39;s disease giving new hope to sufferers around the world"
    },
    {
        "url": "https://uk.news.yahoo.com/hundreds-pro-palestinian-protesters-block-174139952.html",
        "title": "Hundreds of pro-Palestinian protesters block Westminster Bridge with sit-in calling for ceasefire",
        "description": "Hundreds of pro-Palestinian protesters blocked Westminster Bridge while calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/bob-dylans-legacy-60-years-31821548",
        "title": "Bob Dylan&#39;s legacy 60 years on from iconic album The Times They Are a-Changin&#39;",
        "description": "This January marks the sixtieth anniversary of the release of Bob Dylan&#39;s iconic album The Times They Are a-Changin&#39; which captured the mood of upheaval and progress that marked a turbulent decade"
    },
    {
        "url": "https://www.thenational.scot/news/24032036.unionist-call-general-election-used-end-devolution/",
        "title": "Unionist call for General Election to be used to ‘end devolution’",
        "description": "POLITICAL parties should be pushed to include the abolition of devolved powers in their General Election manifesto, anti-independence​"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24023640.letter-we-need-compulsory-voting-education-democracy/",
        "title": "Letter: &#39;We need compulsory voting and education on democracy&#39;",
        "description": "While I agree with Geoff Naylor that &#39;the time for PR is now&#39;, (Gazette, December 28) the changes we need to our political system are so much"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24032293.robert-jenrick-threatens-amend-pms-rwanda-bill-unless-strengthened/",
        "title": "Robert Jenrick threatens to amend PM’s Rwanda Bill unless it is strengthened",
        "description": "The former immigration minister said changes are required to the Safety of Rwanda legislation to ensure it is ‘sufficiently robust’."
    },
    {
        "url": "https://ukdefencejournal.org.uk/shapps-rumoured-to-be-scrapping-uks-assault-ships/",
        "title": "Shapps rumoured to be scrapping <b>UK</b>’s assault ships",
        "description": "It is understood that the defence secretary aims to retire both HMS Albion and HMS Bulwark from active service ten years before their planned out-of-service dates."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/06/hamas-gaza-protest-police-bill-london-israel/",
        "title": "Make Palestine march organisers pay towards policing costs, official review says",
        "description": "Metropolitan Police has spent £17 million controlling protests in the two months following the Hamas terror attack in October"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/06/islamic-preacher-claims-zionists-plotting-to-control-world/",
        "title": "Islamic preacher claims Zionists are plotting to ‘control the world’",
        "description": "An Islamic preacher has been accused of using anti-Semitic tropes in a London mosque by claiming Zionists are plotting to “control the world” by manipulating banks, media organisations and regimes, The Telegraph can reveal."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1852744/nigel-farage-risks-missing-best-chance-to-become-mp-voters-exasperated",
        "title": "Nigel Farage risks missing best opportunity to become MP as &#39;voters are exasperated&#39;",
        "description": "The former UKIP leader is said to be mulling over his return to frontline <b>politics</b> after his finished in third place ... Mr Johnson added that the <b>UK</b>&#39;s first past the post system meant Farage was unlikely to succeed with Reform. He said: “If I was ..."
    },
    {
        "url": "https://wingsoverscotland.com/the-broken-mike/comment-page-1/",
        "title": "The Broken Mike",
        "description": "Mike Russell’s first Sturgeon-era Scottish government appointment as Minister for <b>UK</b> Negotiations On Scotland’s Place In Europe in August 2016 came a matter of weeks after the Brexit referendum. Readers will remember that period in Scottish <b>politics</b> as ..."
    },
    {
        "url": "https://leftfootforward.org/2024/01/the-right-wing-plot-against-ukraine/",
        "title": "The right-wing plot against Ukraine",
        "description": "With Nigel Farage, a self-declared Putin admirer, believed to be on the political rise and intending to ‘shape politics’ before the country goes to the polls this year, you wonder how the western right’s anti-Ukraine sentiment may impact on the UK."
    },
    {
        "url": "https://inews.co.uk/news/british-doctors-gaza-operate-without-morphine-2841199?ico=related_stories",
        "title": "British doctors in Gaza operate without morphine as healthcare crumbles",
        "description": "A convoy of British doctors have arrived in Gaza to help provide care in besieged - and said the healthcare system has fallen apart"
    },
    {
        "url": "https://www.londontheatre1.com/reviews/1979-by-michael-healey-at-finborough-theatre-review/",
        "title": "1979 by Michael Healey at Finborough Theatre | Review",
        "description": "A European premiere from multi-award-winning playwright Michael Healey in his fourth production at the Finborough Theatre."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24032163.pro-palestinian-protesters-stage-sit-in-westminster-bridge/",
        "title": "Pro-Palestinian protesters stage sit-in at Westminster Bridge",
        "description": "Hundreds of protesters blocked off the bridge and surrounding roads following a march from London’s St James’s Park on Saturday."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1852090/post-office-scandal-political-players-warning-signs",
        "title": "Post Office scandal: The <b>political</b> players who ignored key warning signs",
        "description": "Following the scandal, there have been calls for former chief of the Post Office Paual Vennels to hand back her CBE."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24031037.home-secretary-james-cleverlys-date-rape-drug-jokes-shocking/?ref=rss",
        "title": "Home Secretary James Cleverly&#39;s date rape drug jokes are shocking",
        "description": "After meeting victims of spiking, and shortly after the UK Government announced its plans to treat the crime with the utmost care and attention,"
    },
    {
        "url": "https://www.derrynow.com/news/local-news/1388422/largest-nursing-union-in-northern-ireland-joins-day-of-industrial-action.html",
        "title": "Largest nursing union in Northern Ireland joins day of industrial action",
        "description": "Patients and staff are suffering every single day due to the lack of <b>political</b> movement which not only affects ... “The fair and generous package offered by the <b>UK</b> Government is worth over £3bn, including up to £584m to address public sector pay ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/nhs-asks-patients-choose-11-174804424.html",
        "title": "NHS asks patients to choose from 11 genders, 10 sexual preferences and 159 religions",
        "description": "Think tanks said the use of “dubious options” to choose from showed the NHS “playing identity <b>politics</b>” in ways that would perplex many of those seeking treatment. The questions are asked as part of the registration process for MyChart, an online ..."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24031709.police-investigate-potential-fraud-offences-horizon-scandal/",
        "title": "Police investigate ‘potential fraud offences’ during Horizon IT scandal",
        "description": "Metropolitan Police detectives are looking at “potential fraud offences” committed during the Horizon IT scandal. More than 700 Post Office branch managers were handed criminal convictions after faulty Fujitsu accounting software made it appear as though money was missing from their outlets."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/06/middle-east-crisis-israel-gaza-war-hamas-us-blinken-trip-erdogan?page=with:block-659945508f08640ae963b140",
        "title": "Middle East crisis live: Israel carries out strikes in Lebanon following rocket attacks",
        "description": "The Israel Defence Forces said its fighter jets had attacked a number of sites run by Hezbollah"
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/opinion/24029541.euro-notebook-uk-agricultures-cheap-food-challenge/",
        "title": "Euro Notebook: <b>UK</b> agriculture&#39;s cheap food challenge",
        "description": "Navigating the realm of marketing may not be my forte, but recognising the proficiency of giant food retailers in tailoring their offerings"
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24031922.yellow-cold-health-alert-issued-across-south-west/",
        "title": "Yellow cold-health alert issued across the South West",
        "description": "A YELLOW cold-health alert has been issued across the South West. The alert has been issued by the UK Health Security Agency and the Met Office, who warn of cold temperatures from 9am today (Saturday, January 6) to noon on Friday, January 12. Widespread frosts and lower temperatures than normal are expected."
    },
    {
        "url": "https://guildford-dragon.com/letter-all-politicians-are-not-the-same/",
        "title": "Letter: All Politicians Are Not the Same",
        "description": "The world is still full of ghastly authoritarian leaders – Putin, Xi, Modi, Erdogan, Orban etc – who are desperate for us to give up on liberal democracy but whose own long-term futures look far from secure. This year’s 50 national elections may show which way the global wind is blowing."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/conservative-north-yorkshire-mayoral-candidate-keane-duncan-says-i-dont-always-agree-with-the-tories-4468611",
        "title": "Conservative North Yorkshire mayoral candidate Keane Duncan says &#39;I don’t always agree with the Tories&#39;",
        "description": "If the Conservatives lose the next general election, Tory metro mayors will be the most powerful politicians in their party."
    },
    {
        "url": "https://metro.co.uk/2024/01/06/tattooed-beauty-blogger-allowed-stand-putin-election-20073907/?ico=mosaic_home",
        "title": "Tattooed beauty blogger ‘allowed’ to stand against Putin in Russian election",
        "description": "A tattooed beauty influencer and shaman-admirer who is fond of posing nude has been cleared to fight Vladimir Putin in the Russian presidential election in March. Rada Russkikh, 39, a self-confessed cosmetic surgery addict labelled a ‘freak candidate’, is being allowed to stand when genuine anti-war, pro-democracy challengers are banned.‌"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/06/more-harm-than-ukip-reform-uks-threat-to-the-conservatives",
        "title": "‘More harm than Ukip’: Reform <b>UK</b>’s threat to the Conservatives",
        "description": "Its polling is up, but former Brexit party still lacks crucial support from its talisman Nigel Farage"
    },
    {
        "url": "https://www.thetimes.co.uk/article/uk-general-election-parties-tee-up-tetchy-campaign-zjprp9m0h",
        "title": "<b>UK</b> general election: parties tee up tetchy campaign",
        "description": "As Rishi Sunak pencils in polling day for November 15, leaders outline their strategies for what seems certain to be a prolonged and rancorous campaign"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-67891893.amp",
        "title": "Israel-Gaza war: The huge challenges facing Israel&#39;s &#39;day after&#39; plan",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... is lawlessness and a Palestinian <b>political</b> vacuum alongside the grim ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/05/boss-natwest-says-not-difficult-buy-a-house-20072876/?ico=metro-posts_working-metro_whats-trending-now",
        "title": "Bank boss tells first time buyers it’s ‘not that difficult’ to buy a house",
        "description": "The typical price for a house in the <b>UK</b> in December 2023 was £287,105 ... Mr Farage claimed it was for <b>political</b> reasons but the BBC reported it was closed for commercial reasons. The bank’s former chief executive Dame Alison Rose resigned after ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h3gmh4",
        "title": "How To Interview A Prime Minister",
        "description": "Laura’s preparing for an interview with Rishi Sunak on Sunday. She and Paddy are joined by political journalist and documentary maker Michael Cockerell, who’s interviewed nearly every prime minister from 1963 onwards."
    },
    {
        "url": "https://www.themag.co.uk/2024/01/bbc-sport-comments-from-neutrals-interesting-on-newcastle-united-after-hammering-sunderland/",
        "title": "BBC Sport comments from ‘neutrals’ – Interesting on Newcastle United after hammering Sunderland",
        "description": "The BBC Sport comments from neutrals in the past had been overwhelmingly a catalogue of abuse aimed at NUFC supporters. Particularly stuff about the Newcastle United owners and the media inspired pile-ons that NUFC fans have become used to, when blamed for who now owns their club."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/migrants-outnumbered-two-one-guards-31821802",
        "title": "Migrants outnumbered two to one by guards on deportation flights",
        "description": "Guards hired by outsourcing firm Mitie outnumbered migrants two to one on flights deporting migrants and foreign offenders, with the Government spending more than £3million removing them from the UK"
    },
    {
        "url": "https://www.news18.com/world/uk-opposition-raises-questions-over-akshata-murtys-liquidated-firm-8730698.html",
        "title": "<b>UK</b> Opposition Raises Questions Over Akshata Murty&#39;s Liquidated Firm",
        "description": "The 43-year-old Indian businesswoman and daughter of Infosys co-founder Narayana Murthy had incorporated the venture in 2013 with her husband as one of the directors before he resigned in 2015."
    },
    {
        "url": "https://www.mirror.co.uk/sport/boxing/andrew-tate-accused-choking-woman-31821502",
        "title": "Andrew Tate accused of choking woman unconscious during sex and threatening to kill her",
        "description": "The woman has joined three others who have accused Tate of sexual violence between 2013 and 2016 when the former kickboxer lived in the <b>UK</b>, and they are set to file a civil lawsuit against him for damages. Tate is also facing rape and human trafficking ..."
    },
    {
        "url": "https://uk.news.yahoo.com/time-radical-action-housing-crisis-100000284.html",
        "title": "It’s time for radical action on our housing crisis",
        "description": "As the Conservatives continue to lay the groundwork for the upcoming election, housing is an issue that has come back into full focus. Last month, Michael Gove unveiled the latest national planning framework and this week he promised measures aimed at boosting affordability of housing,"
    },
    {
        "url": "https://www.middleeasteye.net/opinion/war-gaza-voices-really-matter-are-journalists-ground",
        "title": "War on Gaza: The voices that really matter are the journalists on the ground",
        "description": "Tense exchange between TalkTV presenter and Palestinian politician Mustafa Barghouti highlights the structural biases of western media"
    },
    {
        "url": "https://www.politics.co.uk/week-in-review/2024/01/06/week-in-review-how-rishi-sunak-lost-control-of-the-election-narrative/",
        "title": "Week-in-Review: How Rishi Sunak lost control of the election narrative",
        "description": "Incumbency advantage is a very real thing in UK politics. When asked to select who they want as prime minister — either the incumbent or the Leader of the Opposition — Britons tend to lump in, perhaps logically,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/doctors-call-action-youth-vaping-e-cigarettes-d5p3wmwpx?ilc=timesradio:morefromthetimes",
        "title": "Doctors call for prescription-only vapes to protect children",
        "description": "Vapes should be made prescription ­only to protect children, leading ­respiratory doctors have said. In a letter published in The Times ­today, 17 practising and retired paediatric specialists call on ministers to take action to curb youth vaping."
    },
    {
        "url": "https://www.christiantoday.com/article/what.can.the.first.chapter.of.exodus.teach.us.about.leadership.in.a.leaderless.world/141236.htm",
        "title": "What can the first chapter of Exodus teach us about leadership in a leaderless world?",
        "description": "Jewish academic and Hebrew scholar Irene Lancaster reflects on the qualities of a good leader."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/bradford-council-on-the-brink-a-full-list-of-services-set-to-be-cut-4468215",
        "title": "Bradford Council on the brink: a full list of services set to be cut",
        "description": "With Bradford Council fighting desperately to avoid issuing a Section 114 notice - effective bankruptcy - proposals have been published by the authority which will have significant effects on the city."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/06/rishi-sunak-javier-milei-donald-trump-atlas-network?ref=upstract.com",
        "title": "What links Rishi Sunak, Javier Milei and Donald Trump? The shadowy network behind their policies",
        "description": "The Atlas Network’s dark-money junktanks are behind neoliberal policies around the world, says Guardian columnist George Monbiot"
    },
    {
        "url": "https://www.independent.co.uk/life-style/wetherspoons-tim-martin-honours-controversy-brexit-b2473235.html",
        "title": "Booze, Brexit and bad hair: how Wetherspoons became the most divisive establishment in Britain",
        "description": "The British high street has for years been dominated by a chain of cheap-and-cheerful pubs boasting straightforward food, inexpensive pints and mad carpets. Oh, and political propaganda. As Spoons founder Tim Martin is granted a knighthood,"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24031404.double-msp-salaries-no-cutting/",
        "title": "Double MSP salaries? No, we should be cutting them",
        "description": "Andy Maciver&#39;s view that we have poor quality elected representatives because they are not paid enough and therefore not attracting"
    },
    {
        "url": "https://inews.co.uk/news/politics/inside-uks-asylum-chaos-officials-lost-track-of-thousands-2840916?s=04",
        "title": "Inside the <b>UK</b>’s asylum chaos: How officials lost track of thousands of migrants",
        "description": "Officials say deaths went unnoticed and migrants had claims removed in a &#39;rigged&#39; system as the Home Office raced to clear asylum backlog"
    },
    {
        "url": "https://www.lynnnews.co.uk/news/a-trip-to-india-a-lovely-walk-coffee-and-scones-and-plans-9347003/",
        "title": "A trip to India, a lovely walk, coffee and scones in Downham Market and plans for a new dual carriageway in the Wensum Valley",
        "description": "Friday Politics column, Green Party councillor Pallavi Devulapalli discusses a busy December and looks forward to the New Year."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24031754.flood-warnings-remain-place-cold-weather-alert-issued/",
        "title": "Flood warnings remain in place as cold weather alert issued",
        "description": "Data from the Environment Agency showed almost every river in England has reached exceptionally high levels with some reaching record levels."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24031198.bolton-train-passengers-warned-drainage-work-closures/",
        "title": "Bolton train passengers warned about drainage work closures",
        "description": "Train passengers going between Bolton and Manchester have been urged to “check before you travel” ahead of a series of weekend closures."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/jeremy-hunt-says-i-dont-yet-know-if-govt-can-cut-taxes-again-before-election-after-national-insurance-reduction/",
        "title": "Jeremy Hunt says &#39;I don&#39;t yet know&#39; if govt can cut taxes again before election after National Insurance reduction",
        "description": "Chancellor Jeremy Hunt is unsure if the government can afford further tax cuts - as a National Insurance (NI) reduction comes into force today."
    },
    {
        "url": "https://www.thenational.scot/politics/24031641.owen-jones-keir-starmer-soundbite-sums-labours-weakness/",
        "title": "Owen Jones: The Keir Starmer soundbite that sums up Labour&#39;s weakness",
        "description": "THERE are two dead certs in politics: one, that an election beckons this year, and two, that it will end with Keir Starmer as prime minister."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24023678.letter-top-down-housing-targets-deeply-disappointing/",
        "title": "Letter: &#39;Top-down housing targets are deeply disappointing&#39;",
        "description": "It is deeply disappointing that the Government continue to enforce top-down housing targets. There is a lot of misleading commentary floating around. If councils had been given the power to set their own housing targets, we would have jumped at the opportunity, to say otherwise, as some are, is deliberately misleading."
    },
    {
        "url": "https://www.newsletter.co.uk/news/opinion/columnists/ben-lowry-unionists-have-slowly-lost-faith-in-any-idea-of-the-best-of-both-worlds-from-the-eu-and-uk-4468539",
        "title": "Ben Lowry: Unionists have slowly lost faith in any idea of the best of both worlds from the EU and <b>UK</b>",
        "description": "1. Northern Ireland remains entirely in the UK internal market, and has no barriers, indeed no legal change with the rest of UK, despite Great Britain having left the EU single market. At the same time, NI, alone in the UK, has full, unfettered access – no checks or forms whatsoever – to the EU single market, but no legal exposure to EU laws."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-mp-bring-forward-bill-31815876",
        "title": "SNP MP to bring forward bill to ban unpaid trial shifts if <b>UK</b> Government fails to act",
        "description": "An SNP MP has warned the UK Government that he will bring forward a bill to ban unpaid trial shifts if it does not take action. Stewart McDonald wrote to Tory Business Secretary Kemi Badenoch asking for her to ban the &quot;exploitative&quot; practice last month."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/what-the-papers-say-january-6-96939/",
        "title": "What the papers say – January 6",
        "description": "The i weekend focuses on “bin chaos” in towns and cities across the UK, which it says is leading to infestations of rats. And the FT Weekend says the British Library will “drain around 40% of its reserves” as it rebuilds after a cyber attack."
    },
    {
        "url": "https://news.sky.com/story/amp/first-minister-humza-yousaf-brands-israels-actions-in-gaza-tantamount-to-ethnic-cleansing-13042644",
        "title": "First Minister Humza Yousaf brands Israel&#39;s actions in Gaza &#39;tantamount to ethnic cleansing&#39;",
        "description": "&quot;And the <b>UK</b> government is a trusted ally of the Israeli government ... &quot;If that is not tantamount to ethnic cleansing, then I don&#39;t know what is. &quot;And I think <b>political</b> leaders should stop beating around the bush, [and] should call what they&#39;re seeing ..."
    }
]