[
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-to-launch-snps-2024-uk-general-election-campaign-in-glasgow",
        "title": "Humza Yousaf to launch SNP&#39;s 2024 general election campaign",
        "description": "Humza Yousaf will launch the SNP’s general election campaign in Glasgow on Friday with a pitch to “wipe the Tories off the electoral map”. The First Minister will deliver a speech to party members at the Oran Mor bar and venue in the city’s west end."
    },
    {
        "url": "https://www.teletrader.com/uk-us-to-reportedly-carry-out-strikes-on-houthi-targets-in-y/news/details/61261007",
        "title": "<b>UK</b>, US to reportedly carry out strikes on Houthi targets in Yemen tonight",
        "description": "The United Kingdom and the United States are said to be planning joint airstrikes on Houthi military positions in Yemen in the coming hours, The Times political editor Steven Swinford disclosed on"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/11/judges-could-delay-rwanda-flights-after-election-sunak/",
        "title": "European judges could delay Rwanda flights until after election, Sunak warned",
        "description": "European Court of Human Rights likely to drag out any final judgment and could be ‘tempted’ to push it beyond the next election"
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/fleabag-star-andrew-scott-praised-31862687",
        "title": "Fleabag star Andrew Scott praised for calling on the phrase &#39;openly gay&#39; to be retired",
        "description": "Andrew Scott was discussing his experience in the industry with fellow stars including Colman Domingo and Robert Downey Jr when he approached attitudes towards acting and sexuality"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12953505/Has-artist-deliberately-destroyed-works.html",
        "title": "Has any artist deliberately destroyed their own works?",
        "description": "This practice is rooted in various motivations such as creative expression, dissatisfaction, or the desire to control one&#39;s artistic legacy."
    },
    {
        "url": "https://www.thetimes.co.uk/article/europe-dismisses-german-protesters-at-its-peril-wbmqrtppf",
        "title": "Europe dismisses German protesters at its peril",
        "description": "Protesters blocking roads. Train drivers on strike. Doctors set to down stethoscopes and join picket lines. Food and energy prices soaring amid a cost of living crisis and growing income inequality. Sound familiar?"
    },
    {
        "url": "https://inews.co.uk/news/politics/britain-us-talks-air-strikes-yemen-rebels-red-sea-attacks-2849940?ico=related_article_inline",
        "title": "<b>UK</b> and US prepare air strikes on Yemen rebels amid Red Sea attacks",
        "description": "It comes after Defence Secretary Grant Shapps warned retaliation was being considered after weeks of attacks by the Iran-backed Houthi rebels on ships in the Red Sea"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/11/uk-government-admits-rwanda-human-rights-record-issues-asylum-rishi-sunak",
        "title": "<b>UK</b> government admits Rwanda has ‘issues with its human rights record’",
        "description": "The 2022 US government human rights report noted that the Rwandan government “impeded the formation of <b>political</b> parties ... and details of the financial memorandum signed between the <b>UK</b> and Rwanda. Meanwhile, ministers were accused of having a ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1854741/ruth-davidson-assisted-dying",
        "title": "Ruth Davidson regrets voting against assisted dying legislation in 2015",
        "description": "The former Scottish leader is the latest heavyweight name to sign a Daily Express petition demanding a full Parliamentary debate and free vote on assisted dying."
    },
    {
        "url": "https://news.sky.com/story/sunak-to-hold-cabinet-meeting-thought-to-be-about-uk-and-us-strikes-against-yemens-houthi-fighters-13046384",
        "title": "Cabinet thought to be due to discuss <b>UK</b> and US military action against Yemen&#39;s Houthi fighters",
        "description": "Rishi Sunak is due to hold a full cabinet call at 7.45pm tonight, which is thought to be about military strikes against Yemen&#39;s Houthi rebels."
    },
    {
        "url": "https://www.thetimes.co.uk/article/convicted-drug-smuggler-got-contract-to-teach-vulnerable-children-khf0znlvz",
        "title": "Convicted drug smuggler got contract to teach vulnerable children",
        "description": "Salford council gave Paul O’Dee, who was jailed for four years in 2003, funds to run a facility for youngsters excluded from mainstream schools"
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/pierce-brosnan-wife-keely-spotted-31862058",
        "title": "Pierce Brosnan and his wife Keely spotted with rarely-seen son after harsh comments",
        "description": "James Bond legend Pierce Brosnan and his wife Keely Brosnan have been spotted with their rarely-seen son Dylan after harsh comments that were made about them online"
    },
    {
        "url": "https://www.thenational.scot/politics/24044156.media-cant-blame-snp-post-office-horizon-scandal/",
        "title": "Media can&#39;t blame SNP for Post Office Horizon scandal",
        "description": "Proceedings were dominated by the story which has pushed all other UK political stories out of the top of the news agenda, the Horizon software scandal which resulted in hundreds of subpostmasters and mistresses being wrongly convicted of fraud and false accounting."
    },
    {
        "url": "https://www.telegraph.co.uk/films/0/tina-fey-effect-how-original-mean-girl-made-comedy-smarter/",
        "title": "The Tina Fey effect: how the original Mean Girl made comedy smarter",
        "description": "The most influential – and hardest working – woman in US comedy tells jokes her male peers wouldn’t dare. How does she get away with it?"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/martin-lewis-sends-message-anybody-28432174",
        "title": "Martin Lewis sends message to anybody with credit card and says &#39;if you get chance&#39;",
        "description": "Martin Lewis has said &quot;do give this a listen&quot; in a message to anybody with credit card debt or who pays childcare. The ITV The Martin Lewis Money Show has promoted his BBC Sounds podcast after it returned following Christmas."
    },
    {
        "url": "https://uk.news.yahoo.com/us-british-warships-having-fight-185056274.html",
        "title": "How US and British warships are taking the fight to the Houthis in the Red Sea",
        "description": "Since the 7th of October last year, the Iranian-backed Houthis of Yemen have fired 116 missiles and drones at ships in the Southern Red Sea. Two nights ago they launched their largest and most complex attack yet: 21 missiles and drones were fired,"
    },
    {
        "url": "https://www.thenational.scot/politics/24044244.cant-let-england-ignore-political-division-across-union/",
        "title": "We can&#39;t let England ignore <b>political</b> division across the Union",
        "description": "Although he is well aware of my <b>politics</b> and interests it did not seem to occur to him ... asked me whether there really would be a national General Election in the <b>UK</b> sometime in the next 12 months, or whether instead quite different elections might ..."
    },
    {
        "url": "https://www.knutsfordguardian.co.uk/news/national/24043864.donald-trump-defies-judge-addresses-civil-fraud-trial/",
        "title": "Donald Trump defies judge and addresses civil fraud trial",
        "description": "The former US president says he did nothing wrong, did not lie about his fortune and is the victim of political persecution."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24042112.andy-maciver-politics-begins-40/?ref=rss",
        "title": "Andy Maciver: <b>Politics</b> begins at 40 (or should)",
        "description": "Age is a circumstance about which a person can do nothing. The appointment of Gabriel Attal as the Prime Minister of France has attracted"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/big-dumb-lie-could-wreck-102801960.html",
        "title": "The big dumb lie that could wreck the American economy",
        "description": "In almost all cases, I have no more insight into the election than any average American citizen, but given my role as a business economist, there&#39;s at least one conspiracy theory I feel the need to confront head-on: that the Federal Reserve is trying to boost President Joe Biden&#39;s reelection chances."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-pm-sunak-hold-cabinet-182308280.html",
        "title": "<b>UK</b> PM Sunak to hold cabinet call on Thursday evening -report",
        "description": "British Prime Minister Rishi Sunak will hold a call with his cabinet of ministers at 1945 GMT on Thursday, the political editor for the Times newspaper reported. Sunak&#39;s Downing Street office did not immediately respond to a request from Reuters for comment."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24041390.2-county-durham-villages-among-uks-biggest-house-price-hotspots/",
        "title": "2 County Durham villages among <b>UK</b>’s biggest house price hotspots",
        "description": "South Moor and Shotley Bridge in County Durham were among the UK&#39;s biggest house price hotspots in 2023, according to new Rightmove data."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1854573/Carol-Vorderman-LBC-radio-bbc-axe-overwhelmed-twitter",
        "title": "Carol Vorderman left in tears and &#39;overwhelmed&#39; as she moves on from BBC after radio axe",
        "description": "Carol Vorderman has been reduced to tears over the support she has received since being forced to leave her BBC Radio Wales show."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-post-office-investigator-in-heated-exchanges-as-ex-chancellor-says-he-knows-when-election-will-be-12593360",
        "title": "<b>Politics</b> latest: Post Office investigator in heated exchanges - as ex-chancellor says he knows when election will be",
        "description": "The pause in attempts to cross to British shores comes as cold and snowy weather has battered many parts of the <b>UK</b>. Rishi Sunak has kicked off 2024&#39;s <b>political</b> season with a hint at when the next general election will be - saying it&#39;s his &quot;working ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rwanda-human-rights-government-admits-2849852?ico=related_article_inline",
        "title": "Rwanda has ‘issues with human rights’ Government admits",
        "description": "Home Secretary James Cleverly writes to MPs and Lords to convince them Rwanda is &#39;safe&#39; but admits Kigali mistreats political opponents"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67943548",
        "title": "I&#39;m up for fight over nanny state accusations, says Keir Starmer",
        "description": "Sir Keir Starmer has said he is &quot;up for that fight&quot; over accusations Labour is embracing the &quot;nanny state&quot; as he announced proposals for supervised toothbrushing in schools. The Labour leader said tooth decay was the top reason children between six and 10 go to hospital and that the government had to act."
    },
    {
        "url": "https://www.heraldscotland.com/news/24044087.general-election-will-2024-better-year-snp/",
        "title": "General Election: Will 2024 be a better year for the SNP?",
        "description": "All eyes will be on the SNP tomorrow as it gears up for the general election with a campaign launch event taking place in the west end of Glasgow."
    },
    {
        "url": "https://www.watfordobserver.co.uk/news/national/24043384.scottish-government-unable-say-many-xl-bullies-moved-due-restrictions/",
        "title": "Scottish Government unable to say how many XL bullies moved due to restrictions",
        "description": "“The First Minister and his colleagues have wasted months playing <b>political</b> games and causing worry, only to now announce they will, rightly, replicate the <b>UK</b> Government’s ban anyway. “Having picked a needless fight with the <b>UK</b> Government, the SNP ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/uks-digital-markets-regulator-gives-173154227.html",
        "title": "<b>UK</b>&#39;s digital markets regulator gives flavor of rebooted rules coming for Big Tech",
        "description": "However the turmoil in <b>UK politics</b> of the past several years contributed to delaying progress on enacting the reform. As a consequence the <b>UK</b> has slipped behind peers like the European Union -- which adopted its own flagship digital competition reform last ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/bristol-councillors-approve-new-constitution-9027162",
        "title": "Bristol councillors approve new constitution but mayor declines to vote",
        "description": "A new constitution for Bristol City Council has been approved by a vote of all councillors, apart from Bristol mayor Marvin Rees. From May the council will be run by several committees of councillors instead of a directly elected mayor."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67943541",
        "title": "Lib Dems urge Ofcom to investigate GB News Post Office scandal coverage",
        "description": "The Lib Dems have asked Ofcom to investigate alleged bias in GB News&#39; coverage of the Post Office scandal, including attacks on Sir Ed Davey. The party claims GB News hosts Nigel Farage and Sir Jacob Rees-Mogg targeted opposition politicians but overlooked Tory MPs&#39; role in the scandal."
    },
    {
        "url": "https://arynews.tv/explainer-what-is-britains-post-office-scandal/",
        "title": "Explainer: What is Britain’s Post Office scandal?",
        "description": "LONDON: One of Britain&#39;s biggest miscarriages of justice, the wrongful conviction of hundreds of Post Office workers due to faulty software, has exploded"
    },
    {
        "url": "https://www.independent.co.uk/news/ap-lawsuit-jewish-israel-marc-kasowitz-b2477340.html",
        "title": "Lawsuit filed against Harvard, accusing it of violating the civil rights of Jewish students",
        "description": "College leaders have struggled to define the line where <b>political</b> speech crosses into harassment and discrimination, with Jewish and Arab students raising concerns that their schools are doing too little to protect them. The issue took center stage in ..."
    },
    {
        "url": "https://www.atvtoday.co.uk/231817-auction/",
        "title": "Historic letters go up for auction",
        "description": "Chorley’s auctioneers have announced two very exciting discoveries for auction this spring… The first is a letter by the renowned 18th-century Swiss philosopher, composer, author and political theorist Jean-Jacques Rousseau (1712-1778),"
    },
    {
        "url": "https://impactnottingham.com/2024/01/impact-reports-from-labour-students-pint-and-policy/",
        "title": "Impact Reports From Labour Students’ Pint And Policy",
        "description": "On Thursday 7th December the University of Nottingham Labour Society held, for the last time in 2023, Pint and Policy – an informal political discussion with drinks at the Sir John Borlase Warren pub."
    },
    {
        "url": "https://www.middleeasteye.net/news/uk-antisemitism-monitor-inside-police-operations-room-during-gaza-war-protests",
        "title": "<b>UK</b> antisemitism monitor inside police operations room during Gaza war protests",
        "description": "Presence of Community Security Trust, which accuses protesters calling for ceasefire of inflaming antisemitism, raises fresh concerns about &#39;politicised policing&#39;"
    },
    {
        "url": "https://uk.movies.yahoo.com/uks-digital-markets-regulator-gives-173154227.html",
        "title": "<b>UK</b>&#39;s digital markets regulator gives flavor of rebooted rules coming for Big Tech",
        "description": "The UK&#39;s competition authority has fleshed out new details of how it plans to wield long anticipated powers, incoming under a reform bill that&#39;s still in front of parliament, to proactively regulate digital giants with so-called strategic market status (SMS) -- saying today that,"
    },
    {
        "url": "https://metro.co.uk/2024/01/11/the-post-office-scandal-needs-making-right-this-not-way-20101178/",
        "title": "‘The Post Office Horizon scandal needs making right but this is not the way’",
        "description": "In today&#39;s MetroTalk readers are talking about the Post Office Horizon Scandal and Rishi Sunak&#39;s new law to exonerate the victims."
    },
    {
        "url": "https://www.newstatesman.com/podcasts/new-statesman-podcast/2024/01/2023-the-good-the-bad-and-the-outright-bizarre",
        "title": "What’s gone wrong with <b>political</b> journalism in the <b>UK</b>? With Ash Sarkar, Ian Dunt and Armando Iannucci | Westminster Reimagined",
        "description": "In a special festive episode of the podcast, Anoosh Chakelian is joined by Andrew Marr and Freddie Hayward to revisit some of the best, the worst, and weirdest moments from <b>UK politics</b> in 2023. You can watch the video from this episode on our YouTube channel."
    },
    {
        "url": "https://www.newstatesman.com/podcasts/new-statesman-podcast/westminster-reimagined/2024/01/whats-gone-wrong-with-political-journalism-in-the-uk-with-ash-sarkar-ian-dunt-and-armando-iannucci-westminster-reimagined",
        "title": "2023: The good, the bad, and the outright bizarre",
        "description": "To do this they are joined by Ash Sarkar, senior editor at Novara Media, and Ian Dunt, columnist at the I and former editor of <b>Politics</b>.co.<b>uk</b>. This is the last episode of this series of Westminster Reimagined. Subscribers to the New Statesman can listen ..."
    },
    {
        "url": "https://www.marieclaire.co.uk/culture/tv-and-film/white-lotus-season-three-theory",
        "title": "One wild prediction about The White Lotus&#39; third season looks like it could actually be happening",
        "description": "One particularly wild theory about The White Lotus season three has been doing the rounds, and following the announcement of the new cast, it looks like it could actually be happening."
    },
    {
        "url": "https://www.ids.ac.uk/opinions/bangladesh-election-results-implications-for-growth-democracy-and-development/",
        "title": "Bangladesh election results: implications for growth, democracy and development",
        "description": "Bangladesh held its national elections on January 7 with the incumbent party - the Awami League - winning a fourth consecutive term as the opposition boycotted it. . Dr Nazneen looks at the implications of the result for democracy and development."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-testing-the-patience-of-patients/",
        "title": "London Playbook PM: Testing the patience of patients",
        "description": "Verdict from health bosses: NHS National Medical Director Stephen Powis praised his healthcare troops for working really hard to bring the numbers down … But the Royal College of Nursing pointed out that given the figures still remain really high in a strike-free month, the PM can’t blame striking staff for failing to reach his target."
    },
    {
        "url": "https://www.thenational.scot/news/24044009.brexit-cost-uk-1-8-million-jobs-analysis-labour-finds/",
        "title": "Brexit has cost <b>UK</b> 1.8 million jobs, analysis for Labour finds",
        "description": "He will also warn that there has been a slide towards populism in <b>UK</b> and European <b>politics</b>. Speaking to The Sunday National last month, Alison Young, the Sir David Williams Professor of Public Law at the University of Cambridge, said she had noted ..."
    },
    {
        "url": "https://news.stv.tv/politics/scotlands-top-law-officer-to-appear-before-holyrood-over-post-office-horizon-scandal-convictions",
        "title": "Scotland&#39;s top lawyer to appear before MSPs over Horizon Post Office scandal",
        "description": "The Lord Advocate faces questions over the up to 100 Post Office workers in Scotland who may have been wrongly convicted by the Crown Office."
    },
    {
        "url": "https://pressgazette.co.uk/media_law/new-york-times-openai-microsoft-ip-experts/",
        "title": "Legal experts say OpenAI has ‘case to answer’ in showdown with New York Times",
        "description": "The New York Times case against OpenAI appears to give the tech company &quot;a case to answer&quot; on IP but puts it on the &quot;horns of a dilemma&quot;."
    },
    {
        "url": "https://news.sky.com/story/brexit-new-report-suggests-uk-163311bn-worse-off-by-2035-due-to-leaving-eu-13046256",
        "title": "Brexit: New report suggests <b>UK</b> £311bn worse off by 2035 due to leaving EU",
        "description": "The report came up with a scenario for growth if the UK had stayed inside the EU, and compared it to forecasts the Office for Budget Responsibility made in March last year."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/11/labour-keir-starmer-post-office-scandal-conservatives-rishi-sunak-uk-politics-live?filterKeyEvents=false&page=with:block-65a0201c8f086f8ed62f2dbf",
        "title": "Post Office only agreed to accept reduced charges in some cases if accused accepted ‘nothing wrong’ with Horizon – <b>UK politics</b> live",
        "description": "Stephen Bradshaw, former Post Office investigator, tells Horizon IT inquiry this was ‘probably not’ appropriate"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/health/dont-get-sick-on-day-of-mass-strike-health-chiefs-warn-ni-public-of-disruption/a929704148.html",
        "title": "Don’t get sick on day of mass strike: Health chiefs warn NI public of disruption",
        "description": "The Department of Health has advised the public to take all steps necessary to avoid needing medical treatment during unprecedented strike action next week."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24043564.strike-pay-issue-can-resolved-quickly-heaton-harris-acts-now-say-unions/",
        "title": "Strike pay issue can be resolved quickly if Heaton-Harris acts now, say unions",
        "description": "Teachers, nurses, health workers, education support workers, police staff and civil servants are set to take part in a day of action on January 18."
    },
    {
        "url": "https://www.dailymail.co.uk/columnists/article-12952625/Richard-Littlejohn-BBC-migrants-Bibby-Stockholm-asylum-barge.html",
        "title": "RICHARD LITTLEJOHN: Why is the BBC fawning over migrants given free bed and board, wifi and a bus into town?",
        "description": "Beginning with a report on the funeral in Tirana of 27-year-old Leonard Farruku, who took his own life on board the barge moored off the Dorset coast, it segued seamlessly into an ‘exclusive’ interview with an asylum seeker from Sierra Leone who had been forced to share his cabin — sorry, ‘cell’."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-67945677?at_medium=social&at_campaign=Social_Flow&at_ptr_name=facebook_page&at_link_type=web_link&at_bbc_team=editorial&at_link_origin=BBC_Scotland_News&at_format=link&at_link_id=3A847D9A-B074-11EE-A4C3-454FD0B4AF07&at_campaign_type=owned",
        "title": "How easy will it be to clear Scottish postmasters?",
        "description": "When it became clear that the UK government was considering legislation to overturn convictions in England and Wales, the Scottish government said it was looking at doing something similar. Then when Rishi Sunak actually announced his plans,"
    },
    {
        "url": "https://www.standard.co.uk/business/ftse-100-live-tesco-m-s-whitbread-results-sec-approves-bitcoinspot-etfs-savills-reach-asos-b1131590.html",
        "title": "FTSE 100 Live 11 January: Microsoft overtakes Apple to become world&#39;s most valuable firm; US inflation setback",
        "description": "Microsoft has now become the world&#39;s most valuable business after overtaking Apple. Microsoft shares rose around 1% after the opening bell on Wall Street, while Apple shares fell by a similar amount."
    },
    {
        "url": "https://www.maidenhead-advertiser.co.uk/news/taplow/193768/profumo-affair-turned-on-its-head-in-new-book-by-twyford-author.html",
        "title": "Profumo Affair turned on its head in new book by Twyford author",
        "description": "Twyford author Vanessa Holburn has written a new non-fiction book which takes a fresh look at one of the biggest political scandals in UK history."
    },
    {
        "url": "https://www.thisisoxfordshire.co.uk/news/24043076.oxford-boffin-helps-find-secret-multiple-sclerosis-gene/",
        "title": "Oxford boffin helps find secret of multiple sclerosis gene",
        "description": "New findings by Professor Lars Fugger, a consultant physician at John Radcliffe Hospital, show the MS gene was an advantage in ancient times."
    },
    {
        "url": "https://www.onlondon.co.uk/richard-brown-londons-universities-lead-the-way-on-social-mobility/",
        "title": "Richard Brown: London’s universities lead the way on social mobility",
        "description": "Young people from poorer backgrounds in the capital have a better chance than others of benefiting from higher education close to home"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/dont-get-sick-on-day-of-mass-strike-public-told-as-health-chiefs-warn-of-disruption/a929704148.html",
        "title": "‘Don’t get sick during mass strike action’, NI health chiefs warn public",
        "description": "The Department of Health has advised the public to take all steps necessary to avoid needing medical treatment during unprecedented strike action next week."
    },
    {
        "url": "https://morningstaronline.co.uk/article/chancellor-jeremy-hunt-accused-hypocrisy-after-complaining-about-gas-drilling-his",
        "title": "Chancellor Jeremy Hunt accused of hypocrisy after complaining about gas drilling in his Surrey constituency",
        "description": "CAMPAIGNERS accused Jeremy Hunt of hypocrisy today after the Tory Chancellor complained about gas drilling in his constituency, while championing oil and gas exploration north of the border. Mr Hunt said he was “bitterly disappointed” after a legal ruling gave the green light to a gas drilling project in his Surrey constituency."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67949653",
        "title": "Starmer rejects criticism of supervised tooth-brushing",
        "description": "The Labour leader says it is &quot;shocking&quot; to learn the most common reason for children in hospital is dealing with tooth extraction."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/01/11/ai-could-replace-thousands-of-civil-service-fraud-detection-jobs-minister-says/",
        "title": "AI could replace thousands of civil service fraud detection jobs, minister says",
        "description": "The discussion in central London came against the backdrop of intense political focus on the Post Office scandal."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/24042395.wiltshires-biggest-careers-fair-takes-place-melksham/",
        "title": "Wiltshire’s biggest careers fair takes place in Melksham",
        "description": "Businesses or organisations who would like to attend the Careers Fair and run a stand are very welcome to email: michelle.donelan.mp@parliament.<b>uk</b> to confirm a place."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/government-uk-government-first-minister-scottish-government-england-b1131764.html",
        "title": "Scottish Government unable to say how many XL bullies moved due to restrictions",
        "description": "“The First Minister and his colleagues have wasted months playing <b>political</b> games and causing worry, only to now announce they will, rightly, replicate the <b>UK</b> Government’s ban anyway. “Having picked a needless fight with the <b>UK</b> Government, the SNP ..."
    }
]