[
    {
        "url": "https://www.thetimes.co.uk/article/if-you-want-save-democracy-get-involved-9jf0q7rxj",
        "title": "If you want save democracy, get involved",
        "description": "Ireland has shown that groups of open-minded, constructive citizens can be the antidote to toxic politics and online hate"
    },
    {
        "url": "https://www.mirror.co.uk/news/world-news/ukrainian-families-safe-uk-after-31748531",
        "title": "Ukrainian families safe in <b>UK</b> after fearing they wouldn&#39;t see another Christmas",
        "description": "The refugees thanked the kind-hearted British people who have put them up - saying it showed &#39;there are some good people in the world&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/why-reform-uk-could-be-electoral-sleeper-hit-2024-2824412?ico=related_article_inline",
        "title": "Why Reform <b>UK</b> could be the electoral sleeper hit of 2024",
        "description": "Support for the outfit formerly known as the Brexit Party has been ticking up over the last 12 months, and poses a threat to both the Tories and Labour"
    },
    {
        "url": "https://www.thetimes.co.uk/radio/show/20231225-24772/2023-12-25",
        "title": "Alex James talks to Mariella Frostrup",
        "description": "Listen to Times Radio live for the latest breaking news, expert analysis and well-informed discussion covering the biggest stories of the day."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-growing-election-threat-farage-reform-uk-2820860?ico=in-line_link",
        "title": "Tories facing growing election threat from Farage’s Reform <b>UK</b>",
        "description": "John Curtice&#39;s analysis of polling over the course of 2023 shows Rishi Sunak has failed to close the gap on Labour to a meaningful degree"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12899703/The-skies-Bethlehem-fear-angels-glory-Archbishop-Canterbury-uses-Christmas-Day-sermon-highlight-anti-Semitism-UK-suffering-children-caught-Israel-Hamas-war.html",
        "title": "&#39;The skies of Bethlehem are full of fear rather than angels and glory&#39;: Archbishop of Canterbury uses Christmas Day sermon to highlight anti-Semitism in the <b>UK</b> and the ...",
        "description": "Fierce battles continued between Israel and Hamas in the southern Levant today. More than 250 are reported to have been killed in the last 24 hours as churches hold muted ceremonies for the faithful."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-67819758.amp",
        "title": "King&#39;s Christmas message: Charles focuses on shared values in time of conflict",
        "description": "The King referenced the role of the &quot;close to nature&quot; shepherds in the story of Jesus&#39;s birth - and the broadcast includes the carol &#39;While Shepherds Watched Their Flocks&#39; sung by a community choir from Bexley, a group designed to widen access to music."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24011213.imprisoned-russian-opposition-leader-alexei-navalny-located-penal-colony/",
        "title": "Imprisoned Russian opposition leader Alexei Navalny located in penal colony",
        "description": "The town of Kharp is near Vorkuta, whose coal mines were among the harshest of the Soviet Gulag prison-camp system."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-67820068.amp",
        "title": "Alexei Navalny: Russian opposition leader found, says team",
        "description": "Kremlin critic Alexei Navalny is alive and being held in a penal colony in Siberia, according to his spokeswoman. &quot;We found Alexei Navalny,&quot; Kira Yarmysh said on 25 December, adding that he was now in northern Russia. His team had had no contact with him since 6 December, after he was moved from a previous prison."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/154426/christmas-message-from-reverend-anne-gilbert",
        "title": "Christmas message from Reverend Anne Gilbert",
        "description": "Christmas message from Reverend Anne Gilbert, Vicar of Rochdale Parish Churches: St Chad’s, St Mary in the Baum,"
    },
    {
        "url": "https://metro.co.uk/2023/12/25/missing-putin-critic-alexei-navalny-found-alive-siberia-20024026/?ico=trending-module_category_world_item-2",
        "title": "Putin’s ‘missing’ arch nemesis is found alive in Siberian prison colony",
        "description": "Missing Kremlin critic Alexei Navalny has been found alive, weeks after disappearing from a Russian prison. The Russian opposition leader described as the man Putin fears most has been moved to a penal colony in northwestern Siberia, his team said, two weeks after he went missing."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/middle-east-politics-key-issues-define-2024",
        "title": "The key issues that will define Middle East <b>politics</b> in 2024",
        "description": "Wars, shifting geopolitics, climate change and economic headwinds have all had profound effects on the region in 2023 and will dominate the agenda of its leaders in 2024"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/sunday-life/news/junior-nio-ministers-us-trip-cost-more-than-combined-total-for-five-ni-politicians/a1718318194.html",
        "title": "Junior NIO minister’s US trip cost more than combined total for five NI politicians",
        "description": "A trip to the US by Northern Ireland Office (NIO) junior minister Lord Caine cost more than the entire bill for a delegation of local politicians."
    },
    {
        "url": "https://www.eadt.co.uk/news/24009862.heathside-lodges-wenshaston-suffolk-named-best/",
        "title": "Heathside Lodges in Wenshaston in Suffolk named best",
        "description": "The luxury holiday accommodation at Heathside Lodges in Wenhaston in Suffolk have been named the best by Hoseasons."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/dolly-parton-77-candidly-reveals-31746614",
        "title": "Dolly Parton, 77, candidly reveals the cosmetic procedures she regrets having done",
        "description": "Country singer Dolly Parton has candidly revealed the cosmetic procedures she regrets having done despite admitting that she &quot;tries to do little bits at a time&quot;"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/13-world-news-stories-you-might-have-missed-this-year_uk_658428a9e4b03e698a123ad8",
        "title": "13 World News Stories You Might Have Missed This Year",
        "description": "Over the past year, headlines in America were dominated by US politics and some world news events, including the ongoing war in Gaza between Israel and the Hamas militant group, and the conflict between Russia and Ukraine in Eastern Europe, among other things. Still, there are plenty more international news stories that are worth your attention."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24011108.100-years-since-first-diabetes-patient-treated-insulin-england/",
        "title": "100 years since the first diabetes patient treated with insulin in England",
        "description": "It has been 100 years since the first person in England was treated with insulin, changing the course of diabetes treatment in the country. The milestone in medicine took place at the University of Sheffield’s Medical School in 1923, on a patient called Sir Stuart Goodwin, who was in the Sheffield steel industry and philanthropist."
    },
    {
        "url": "https://www.telegraph.co.uk/travel/family-holidays/the-10-holidays-to-pitch-to-your-family-on-christmas-day/",
        "title": "10 holidays to pitch to your family on Christmas Day (and how to get granny to pay)",
        "description": "The festive dinner table can be a conversation minefield. Avoid all talk of politics and instead raise where you should go in 2024"
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24011071.viral-moments-2023-giant-baked-bean-seal-pup-kebab-shop/",
        "title": "Viral moments of 2023: From a giant baked bean to a seal pup at a kebab shop",
        "description": "From the creation of a giant baked bean to a seal pup found outside a kebab shop in Norfolk, here is a look at a few of the quirkier viral moments of 2023. A seal pup was rescued after it was spotted wandering past an arcade and kebab shop in Norfolk late on a Friday night in January, and attracted thousands of views online."
    },
    {
        "url": "https://uk.news.yahoo.com/2023-politics-wrapped-much-nonsense-075232573.html",
        "title": "2023 <b>Politics</b> Wrapped: How Much Of This Nonsense Do You Remember?",
        "description": "Here is a whistle-stop tour of the last year in British <b>politics</b>. The prime minister unveiled his five ... The Scottish government launched a legal battle with the <b>UK</b> Government after it blocked the Scottish Parliament’s move to make it easier to change ..."
    },
    {
        "url": "https://www.thepinknews.com/2023/12/25/lgbtq-image-round-up-2023/",
        "title": "The seven most inspiring LGBTQ+ images that defined 2023",
        "description": "However, LGBTQ+ people around the world faced soaring hate crime rates, <b>political</b> scapegoating and increasingly harsh ... Thousands of trans people and their allies attending vigils up and down the <b>UK</b>, as well as in the US and Australia."
    },
    {
        "url": "https://news.sky.com/story/uk-government-offers-16333bn-to-northern-ireland-in-bid-to-restore-power-sharing-13034055?dcmp=snt-sf-twitter",
        "title": "<b>UK</b> government makes £3.3bn &#39;final offer&#39; to Northern Ireland in bid to restore power-sharing",
        "description": "The <b>UK</b> government has been trying to restore power-sharing through various negotiations - both with the DUP and with <b>political</b> parties in Belfast as a whole. A resolution is not expected to be reached in either set of talks this year, Northern Ireland ..."
    },
    {
        "url": "https://bylinetimes.com/2023/12/12/in-fighting-for-the-cause-of-refugees-and-migrants-we-fight-for-ourselves/",
        "title": "‘In Fighting for the Cause of Refugees and Migrants, We Fight For Ourselves’",
        "description": "In the <b>UK</b> today, a desperate Conservative Party is flogging the immigration ... Germany and Australia need net immigration lest their economies stall; whereas the saner <b>political</b> parties in the former understand the problem, politicians in the latter ..."
    },
    {
        "url": "https://www.newstalkzb.co.nz/on-air/holiday-breakfast/audio/sarah-ferguson-spotted-with-royal-family-for-christmas/",
        "title": "Sarah Ferguson Spotted With Royal Family For Christmas In Sandringham",
        "description": "Sarah Ferguson has joined members of the royal family for their traditional Christmas Day outing, alongside ex-husband Prince Andrew. Ferguson has not appe"
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/first-ever-psychedelic-mdma-therapy-31748443",
        "title": "First-ever psychedelic MDMA therapy drug set to be approved in the US early 2024",
        "description": "The US Food and Drug Administration (FDA) has received an application for the first-ever &#39;psychedelic-assisted therapy&#39; drug, which could be approved in early 2024"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/bogus-pudsey-bear-fraudsters-charities-28346378",
        "title": "The bogus Pudsey Bear fraudsters and the charities they left struggling",
        "description": "They fleeced the public out of £500,000 that could be traced - but the amount of cash that was handed over is likely to be far higher"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/a-strong-christian-faith-is-my-anchor-in-politics-donaldson-tells-gb-news-foster/a1289283727.html",
        "title": "A strong Christian faith is my ‘anchor’ in <b>politics</b>, Donaldson tells GB News’ Foster",
        "description": "Sir Jeffrey Donaldson has described how his strong Christian belief helps guide him through the “storms” of frontline politics."
    },
    {
        "url": "https://news.sky.com/video/pope-condemns-the-futile-logic-of-war-as-ukraine-marks-christmas-on-25-december-for-first-time-13037570",
        "title": "Pope condemns &#39;the futile logic of war&#39; as Ukraine marks Christmas on 25 December for first time",
        "description": "Pope Francis has called for an end to all conflicts around the world and the Archbishop of Canterbury has used his Christmas Day sermon to highlight antisemitism in the UK."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/mirrors-2023-quiz-year-how-31748409",
        "title": "Mirror&#39;s 2023 quiz of the year! How much can you remember of the last 12 months?",
        "description": "From the Royal Family to global news, showbiz and sport, how much did you take in over the last year? Try your hand at the Mirror&#39;s 2023 quiz to find out"
    },
    {
        "url": "https://www.thetimes.co.uk/article/doctor-who-christmas-special-review-ncuti-gatwa-l5089ntsk",
        "title": "Doctor Who Christmas special review — Ncuti Gatwa rises to the occasion",
        "description": "Taking over as the new Doctor on Christmas Day of all days is, I imagine, a lot of pressure. Expectations for an all-singing, all-dancing, extra-special episode are sky-high when you haven’t even yet established yourself with the audience."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25158157/charlotte-church-documentary-tv-series/",
        "title": "Pop star set for surprising new reality TV show inspired by Kim Kardashian",
        "description": "AT just 37, Welsh singing sensation Charlotte Church has achieved more than most of us manage in our lifetime. But she’ll soon be swapping sonatas for the small screen as I can reveal she is"
    },
    {
        "url": "https://www.yogonet.com/international/news/2023/12/25/70173-bacta-34the-changes-proposed-in-the-white-paper-will-provide-opportunities-for-our-members-to-grow-their-businesses-34",
        "title": "Bacta: &quot;The changes proposed in the White Paper will provide opportunities for our members to grow their businesses&quot;",
        "description": "The changes that have been proposed in the white paper will most certainly provide opportunities to be competitive and therefore opportunities for members to grow their businesses."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/bbc-star-sally-nugents-life-31748421",
        "title": "BBC star Sally Nugent&#39;s life away from the camera - &#39;affair&#39; claims and split",
        "description": "She added: &quot;Before I do anything, I check the overnight briefing notes to see which guests have been confirmed, what news I’ve sleep through and the latest <b>political</b> line. I don’t wake my husband or son. I’m a tiptoer. I have years of experience.&quot;"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24008413.karbon-homes-good-deeds-campaign-celebrates-community-heros/",
        "title": "Karbon Homes Good Deeds Campaign Celebrates Community Heros",
        "description": "This Christmas, community stars from up and down the North East are being recognised for their selfless acts of kindness."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/24011184.met-office-boxing-day-weather-forecast-buckinghamshire/",
        "title": "Met Office: Boxing Day weather forecast in Buckinghamshire",
        "description": "Boxing Day is perfect for a walk with family and friends, so it is good to know what weather to prepare for in Buckinghamshire."
    },
    {
        "url": "https://www.independent.co.uk/news/poland-ap-alexander-lukashenko-tallinn-belarus-b2469377.html",
        "title": "Belarus leader says Russian nuclear weapons shipments are completed, raising concern in the region",
        "description": "The president of Belarus says Russia has completed its shipments of short-range, tactical nuclear weapons to his country, an initiative that has raised strong concerns in neighboring Poland and elsewh"
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/24010095.dwp-will-pay-universal-credit-christmas-new-year/",
        "title": "When DWP will pay Universal Credit during Christmas and New Year",
        "description": "The Christmas and New Year bank holidays mean many expecting DWP payments will see the money hit their bank accounts earlier than expected"
    },
    {
        "url": "https://www.alloaadvertiser.com/news/national/24011159.pope-blasts-weapons-industry-makes-christmas-appeal-world-peace/",
        "title": "Pope blasts weapons industry as he makes Christmas appeal for world peace",
        "description": "He also called for an end to Israel’s military campaign in Gaza and the ‘appalling harvest of innocent civilians’."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/24011251.royal-family-attend-christmas-church-service-norfolk/",
        "title": "Pictures: King Charles and rest of Royal family&#39;s Christmas service",
        "description": "The royal family was seen marking Christmas Day in Norfolk by attending a traditional church service at Sandringham estate with smiles and waves."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/24010675.royal-mint-king-charles-iii-50p-sold-huge-amount/",
        "title": "Royal Mint: The King Charles III 50p that sold for huge amount",
        "description": "The new 50ps bearing King Charles’s official coin portrait is being sold on eBay for more than their face value."
    },
    {
        "url": "https://www.independent.co.uk/news/nikol-pashinyan-ap-tallinn-russia-estonia-b2469373.html",
        "title": "Armenian leader travels to Russia despite tensions and promises economic bloc cooperation",
        "description": "Armenian Prime Minister Nikol Pashinyan, whose country’s relations with Russia grew tense this year, says that when Armenia takes the rotating chairmanship of a Moscow-dominated economic alliance he w"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/phil-foden-praises-man-city-28346481",
        "title": "Phil Foden praises Man City duo as new youngster looks to the future",
        "description": "Manchester City fans, everyone at MEN Sport hopes you have had a wonderful day. Of course, no matter what Santa may have brought you today, it may pale in comparison to the happiness which City have managed to produce in 2023."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/23996008.letter-swans-loyal-rightly-act/",
        "title": "Letter: &#39;Swans are loyal and would rightly act&#39;",
        "description": "Having walked past the swans in question many (Chronicle, December 14) times when nesting prior to their removal and blatant cruelty having"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24001648.letter-editor-this-exciting-/",
        "title": "Letter to the editor: &#39;This is exciting?&#39;",
        "description": "Send letters by email to newsdesk@hampshirechronicle.co.<b>uk</b> or by post to Editor, Hampshire Chronicle, 5 Upper Brook Street, Winchester, Hampshire, SO23 8AL. All letters and e-mails must include full names and addresses (anonymous letters will not be ..."
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-12899731/Ivanka-Trump-Miami-Dolphins-Christmas.html",
        "title": "Ivanka Trump puts on a VERY glam display at the Miami Dolphins game with Jared Kushner and their three kids - before sharing heartwarming throwback snaps from Christmases gone by",
        "description": "Ivanka, 42, put on a stylish display while attending the Miami Dolphins game with her family - before sharing adorable snaps of her celebrating Christmas as a child. She shared the snaps on Instagram."
    },
    {
        "url": "https://www.standard.co.uk/news/world/hamas-islamic-jihad-palestinians-egyptian-proposal-gaza-ceasefire-proposal-b1129015.html",
        "title": "Egypt puts forward proposal on how to end Israel-Hamas war",
        "description": "Egypt has put forward an ambitious proposal to end the Israel-Hamas war with a permanent ceasefire. A phased hostage release and the creation of a Palestinian government of experts who would administer the Gaza Strip and occupied West Bank would also be part of the plan, a senior Egyptian official and a European diplomat said."
    },
    {
        "url": "https://metro.co.uk/2023/12/25/donald-trump-toe-pads-speculation-social-media-20024639/",
        "title": "Donald Trump’s ‘toe pads’ ignite speculation on social media",
        "description": "A picture of ex-President Donald Trump standing on &#39;toe pads&#39; while giving a speech has sparked debate on social media."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-67819122",
        "title": "Israel-Gaza war: Netanyahu vows to intensify campaign",
        "description": "Prime Minister Benjamin Netanyahu has said Israel will intensify its fight against Hamas in the coming days. He told members of his party that he had visited Gaza on Monday morning and that Israel&#39;s military campaign there was &quot;not close to being over&quot;."
    },
    {
        "url": "https://faroutmagazine.co.uk/the-album-bruce-springsteen-calls-his-samurai-record/",
        "title": "The album Bruce Springsteen calls his “samurai record”",
        "description": "Bruce Springsteen calls &#39;Darkness on the Edge of Town&#39; his &quot;samurai record&quot;, an album which served as a pivotal juncture in the trajectory of his career."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24011238.white-christmas-declared-snow-falling-across-parts-scotland/",
        "title": "White Christmas declared with snow falling across parts of Scotland",
        "description": "Forecasters have officially declared a white Christmas with snow falling across parts of Scotland, after the record for the highest daily minimum temperature for Christmas Day was broken further south."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24008307.newcastle-theatre-royal-announces-new-shows-coming-2024/",
        "title": "Newcastle Theatre Royal announces new shows coming in 2024",
        "description": "There is much to look forward to in the new year as Newcastle Theatre Royal announces all the new shows coming in 2024."
    },
    {
        "url": "https://www.ledburyreporter.co.uk/news/24006370.celebrities-born-christmas-day/",
        "title": "Celebrities born on Christmas Day",
        "description": "Here are some of the most current celebrities that were born on Christmas day: The Prime Minister of Canada, Justin Trudeau, was born on Christmas day in 1971. He has held office since 2015 and been the leader of the Liberal Party since 2013, he is the second youngest prime minister in Canadian history."
    },
    {
        "url": "https://www.fenlandcitizen.co.uk/news/chair-s-christmas-and-new-year-message-for-cambridgeshire-re-9345928/",
        "title": "Chair’s Christmas and New Year message for Cambridgeshire residents",
        "description": "Cambridgeshire County Council’s chair Sebastian Kindersley has a Christmas message for the area’s residents."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/how-to-watch-ghosts-christmas-special-2023-stream-online-from-anywhere",
        "title": "How to watch Ghosts Christmas Special 2023 – stream online from anywhere",
        "description": "Three simple steps to using a VPN to watch the Ghosts Christmas Special online: 2. Connect to the relevant server location - launch the VPN app, click on &#39;choose location&#39; and select the right location i.e. UK for BBC iPlayer. 3. Head to the chosen broadcaster&#39;s live stream – in this case, head to the BBC iPlayer website or app to watch Ghosts."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/2023-british-politics-wrapped-how-much-of-this-nonsense-do-you-remember_uk_657b22c7e4b020f3b6741bfc?3qlb",
        "title": "2023 <b>Politics</b> Wrapped: How Much Of This Nonsense Do You Remember?",
        "description": "Nadhim Zahawi was sacked as Tory Party chairman after “a serious breach of the ministerial code” over his tax affairs. Sunak marked his first 100 days in office by being less popular at that point than his five predecessors (who made it that far). Labour headed into the year with a 26-point lead."
    },
    {
        "url": "https://www.countytimes.co.uk/news/24003518.powys-charity-overwhelmed-generosity-christmas/",
        "title": "Powys charity &#39;overwhelmed by generosity&#39; before Christmas",
        "description": "Montgomeryshire Family Crisis Centre in Newtown who support men, women and children experiencing domestic abuse in north Powys have had a flood"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/23994563.new-shops-restaurants-opened-basingstoke-2023/",
        "title": "The new shops and restaurants opened in Basingstoke in 2023",
        "description": "Here we take a look at some of the new shops and restaurants that have opened in Basingstoke in 2023. A new homeware and gift shop selling environmentally-friendly products from local artists and producers opened in Basingstoke town centre in September."
    },
    {
        "url": "https://uk.news.yahoo.com/politics-daily-briefing-december-25-082305156.html",
        "title": "<b>Politics</b> daily briefing: December 25",
        "description": "Daily politics briefing for December 25 as The UK and allies will not allow the Red Sea to become a “no go” zone for shipping and will step up efforts to tackle Iran’s “malign influence”, Cabinet ministers have said."
    },
    {
        "url": "https://uk.news.yahoo.com/shame-herefordshire-mp-making-decision-050000014.html",
        "title": "Shame on Herefordshire MP for making this decision!",
        "description": "Reports indicating Russian dictator Vladimir Putin’s interest in ending the war are in fact a ploy to impede and disrupt further military aid to Ukraine from Western allies, the U.S.-based think tank Institute for the Study of War (ISW) wrote on Dec. 23."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/national/24011042.warning-issued-pouring-turkey-fat-sink-christmas/",
        "title": "Warning issued over pouring turkey fat down sink at Christmas",
        "description": "Water UK has issued a warning to families to dispose of cooking fats, oils and greases responsibly to avoid blocked pipes."
    },
    {
        "url": "https://znetwork.org/znetarticle/day-x-marks-the-calendar-julian-assanges-final-appeal/",
        "title": "Day X Marks the Calendar: Julian Assange’s ‘Final’ Appeal",
        "description": "The former, among other matters, took issue with the acceptance by the Home Office that the extradition was not for a <b>political</b> offense and therefore prohibited by Article 4 of the <b>UK</b>-US Extradition Treaty. The defense team stressed the importance of due ..."
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/cowboys-vs-dolphins-live-stream-how-to-watch-nfl-game-online-from-anywhere",
        "title": "Cowboys vs Dolphins live stream: how to watch NFL game online and on TV from anywhere, team news",
        "description": "You can watch a Cowboys vs Dolphins live stream on Fox in the US. NFL fans in Australia can watch the game on Kayo Sports. In Canada, Cowboys vs Dolphins is being shown on DAZN, TSN and CTV, while viewers in the UK can tune in on Sky Sports. Full details below."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/test-your-knowledge-with-the-politics-hub-christmas-quiz/",
        "title": "Test your knowledge with the <b>Politics</b> Hub Christmas quiz",
        "description": "The <b>Politics</b> Hub Christmas special aired on Sky News on Christmas ... the salary threshold for a family visa – with some Tories accusing him of &quot;weakness&quot;. <b>UK</b> economy at risk of recession, official figures reveal The <b>UK</b> economy has performed worse ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12898705/Tucker-Carlson-Kevin-Spacey-video-White-House-bizarre.html",
        "title": "Tucker sits down with Kevin Spacey&#39;s House of Cards Frank Underwood in bizarre Christmas video to talk about current candidates, running for the White House... and Carlson as a ...",
        "description": "In an interview with Tucker Carlson on X, Spacey became his House of Cards character and ran through his views on the election candidates, trigger warnings and the legacy media."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2023/12/24/guide-elections-2024-votes-democracy-india-russia-us-eu/",
        "title": "The Telegraph guide to elections in 2024 ... democracy’s biggest year",
        "description": "The <b>UK</b> and European Union will both also hold elections to their ... defence – more than on social security – as the war in Ukraine dominates Mr Putin’s <b>political</b> agenda. Across the front lines, Volodymyr Zelensky, Ukraine’s president, will also ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/20239098.thinktank-says-scotlands-tax-system-not-fit-looming-challenges/?ref=habersitesi.org",
        "title": "Thinktank says Scotland&#39;s tax system &#39;not fit&#39; for looming challenges",
        "description": "“Redesigning the tax system is a major task, and a delicate one, but the system we have in the <b>UK</b> is clearly no longer fit for purpose, and serves only to limit smart thinking. &quot;As in so much else, <b>political</b> vision and courage are what the nation needs ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/20220190.scottish-independence-nicola-sturgeon-says-opposition--running-scared/?ref=habersitesi.org",
        "title": "Scottish independence: Nicola Sturgeon says opposition &#39; running scared&#39;",
        "description": "However a <b>UK</b> Government spokesperson insisted ... She said: “The only scary thing in Scottish <b>politics</b> at the moment is the depths Nicola Sturgeon will sink to in order to distract from her own Government’s failures. “Once again the SNP are ..."
    }
]