[
    {
        "url": "https://www.thetimes.co.uk/article/609a5a2f-e1c1-4c2e-9c5a-e9aeec2f657d?shareToken=d24eba5853aab0588d1194dd548f0fe5",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "In a speech to the National Farmers’ Union on Tuesday, Sunak will promise to put food security at the “top of the agenda” by committing to a <b>UK</b>-wide index to measure ... s veneer it is still about the <b>politics</b> of misplaced envy and class war.”"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/22/uk-withdraws-investment-treaty-put-net-zero-under-threat/",
        "title": "<b>UK</b> withdraws from investment treaty that put net zero under threat",
        "description": "“Civil society organisations and parliamentarians from all <b>political</b> parties have been clear that the Energy Charter Treaty is an out-of-date agreement and undermines our efforts to tackle climate change. “We welcome the <b>UK</b>’s decision to ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/opinion/columnists/andrew-grocock-now-is-the-time-for-all-those-in-support-of-the-union-to-work-together-4530036",
        "title": "Andrew Grocock: Now is the time for all those in support of the Union to work together",
        "description": "But now is the time for supporters of the Union to work together, across all <b>political</b> and business sectors ... of securing a unionist representative at Westminster. The Together <b>UK</b> Foundation is delighted to publish an article recently written by Colonel ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24138694.truss-says-world-needs-republican-white-house-not-mention-trump/",
        "title": "Truss says world ‘needs Republican in White House’ but does not mention Trump",
        "description": "Liz Truss criticised ‘conservatives in name only’ during a speech to the right-wing Cpac conference near Washington DC."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/22/post-office-said-last-month-it-stands-by-most-horizon-convictions",
        "title": "Post Office said last month it stands by most Horizon convictions",
        "description": "According to Staunton, Read sent this letter at the behest of <b>UK</b> Government Investments (UKGI), the body that ... In the letter, Read wrote: “This clearly raises acute <b>political</b>, judicial, and communications challenges against the very significant ..."
    },
    {
        "url": "https://www.fool.co.uk/2024/02/22/when-cheap-markets-meet-favourable-conditions-sentiment-flips-very-quickly/",
        "title": "When cheap markets meet favourable conditions, sentiment flips very quickly",
        "description": "Think of Gordon Brown’s decision to make the Bank of England independent, for instance, freeing it from <b>political</b> interference when it came to setting interest rates. Investors have hardly been enthusiastic about <b>UK</b> equities over the past several months."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/national/24138662.speakers-role-throughout-history-beheadings-revolting-mps/",
        "title": "Speaker’s role throughout history from beheadings to revolting MPs",
        "description": "Though the Speakership under its present title dates back to the appointment of Sir Thomas Hungerford in 1377, the <b>UK</b> Parliament identifies the first ... an unwavering ambition to emulate his father’s <b>political</b> career. Sir Lindsay became the youngest ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869792/reform-uk-conservative-general-election-polling",
        "title": "Reform <b>UK</b> surge in bombshell poll as gap closes with Tories on brink of landslide defeat",
        "description": "Reform UK has narrowed the gap with the Conservatives in a bombshell new poll, that saw the Tories sink to new lows in the latest voting intention poll. The latest YouGov/Times poll shows the Tories on 20 percent, a four percentage point drop from the last poll on February 14-15."
    },
    {
        "url": "https://news.sky.com/video/share-13078376",
        "title": "Commons Speaker row over Gaza vote explained",
        "description": "Sir Lindsay Hoyle is under pressure over his handling of the SNP&#39;s motion for a ceasefire in Gaza. His decision to allow a vote on a Labour amendment saw Tory and SNP MPs storm out - and dozens of them have signed a motion declaring they have no confidence ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?filterKeyEvents=false&page=with:block-65d715898f08aff1ffae3224",
        "title": "<b>Uk politics</b>: Sunak ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – as it happened",
        "description": "The speaker is due to hold talks with the parties to clear the air after Gaza ceasefire debate descended into chaos"
    },
    {
        "url": "https://www.thenational.scot/politics/24136992.labours-behaviour-reveals-brutal-truth-british-politics/",
        "title": "Labour&#39;s behaviour reveals the brutal truth about British <b>politics</b>",
        "description": "THERE are moments when the curtain is abruptly pulled aside, when the brutal truth about <b>political</b> power in Britain becomes impossible to ignore. This was consistent with the SNP’s traditions, not least opposing the calamitous invasion of Iraq."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68362405?at_campaign_type=owned&at_medium=social&at_link_id=B083FB3C-D0FA-11EE-8A82-D67A87A28522&at_link_origin=BBC_Politics&at_link_type=web_link&at_ptr_name=facebook_page&at_bbc_team=editorial&at_format=link&at_campaign=Social_Flow",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "&quot;This should have been the chance for the <b>UK</b> Parliament to do the right thing and vote for ... Sir Keir accused the Conservatives and SNP of &quot;choosing <b>political</b> games over serious solutions&quot;. &quot;Today was a chance for Parliament to unite and speak with ..."
    },
    {
        "url": "https://feweek.co.uk/politically-driven-post-16-policy-churn-has-damaged-stability-think-tank-warns/",
        "title": "‘Politically driven’ post-16 policy churn has damaged stability, think tank warns",
        "description": "Governments must end the “high level” of policy churn across all four UK nations that has caused instabilities and overly complex training routes"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/commons-speaker-under-pressure-after-gaza-vote-chaos-100626/",
        "title": "Commons Speaker under pressure after Gaza vote chaos",
        "description": "The Speaker of the House of Commons is under pressure over his handling of a debate on Gaza, which resulted in MPs passing Labour’s amendment calling for an “immediate humanitarian ceasefire” amid scenes of chaos. The motion was approved but only ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/liz-truss-joe-biden-cpac-cino-b2500958.html",
        "title": "Liz Truss attacks Biden and ‘CINOs’ in Tory party as she rants to half-empty crowd at US right-wing conference",
        "description": "Liz Truss has hit out at Joe Biden and members of the Tory party over the “most almighty backlash” that led to her own failed <b>UK</b> premiership ... “quangos and bureaucrats and lawyers” for her <b>political</b> demise. Ms Truss made the remarks as she ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/house-of-commons-ap-parliament-lindsay-hoyle-gaza-b2500712.html",
        "title": "<b>UK</b> Parliament is in turmoil after a debate over a Gaza cease-fire raised fears for lawmakers&#39; safety",
        "description": "“And I would ask all honorable members not to do this House a further disservice by suggesting that the shameful events that took place yesterday were anything other than party <b>politics</b> on behalf of the Labour Party.” But the Institute for ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68373939",
        "title": "Rochdale by-election candidates discuss the town&#39;s needs",
        "description": "Reform UK&#39;s Simon Danczuk said his &quot;only priority&quot; was Rochdale and tackling crime in the town was vital. George Galloway of the Workers Party for Britain said he wanted to save Rochdale AFC and reopen the market. A number of the 11 candidates standing in the by-election had been due to take part in the debate."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24137555.sharp-rise-anti-muslim-hatred-uk-with-women-bearing-brunt/",
        "title": "Sharp rise in anti-Muslim hatred in <b>UK</b> ‘with women bearing brunt’",
        "description": "“This rise in anti-Muslim hate is unacceptable and we hope that <b>political</b> leaders speak out to send a clear ... More than 4,000 antisemitic incidents were recorded in the <b>UK</b> by the Community Security Trust (CST) in 2023, with the all-time high being ..."
    },
    {
        "url": "https://inews.co.uk/opinion/mob-politics-is-putting-our-democracy-in-peril-2920946?ico=related_stories",
        "title": "Mob <b>politics</b> is putting our democracy in peril",
        "description": "But processes do matter if you think <b>politics</b> matters – how parliament operates and conducts ... the Holocaust would stoke community divisions across the world – and the <b>UK</b> is no exception. Cases of antisemitism reached a record high last year, with ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-politics-68374640.amp",
        "title": "Law to clear Post Office victims should be <b>UK</b>-wide, says Naomi Long",
        "description": "&quot;I am deeply disappointed that the <b>UK</b> Government has decided to legislate in England and ... there&#39;s already a long list of things to do for ministers after 24 months of <b>political</b> paralysis. Mr Madden said that if the legislation to clear convictions ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68371954.amp",
        "title": "Vaughan Gething: Probe call over Labour hopeful&#39;s £200k donations",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about ... University&#39;s Centre for Welsh <b>Politics</b> and Society, said the donations ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-eyeing-six-months-32184541",
        "title": "Prince Harry &#39;eyeing six months in <b>UK</b> for new Royal role - but Meghan won&#39;t allow it&#39;",
        "description": "Prince Harry considered spending time in the <b>UK</b> as a part-time royal to help his ailing father ... For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. The source claimed: &quot;It is absolutely and categorically clear ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/liz-truss-trump-america-republican-boris-johnson-b1141007.html",
        "title": "Truss says world ‘needs Republican in White House’ but does not mention Trump",
        "description": "Former prime minister Liz Truss told a right-wing conference in America that the world ‘needs a Republican in the White House’ (Victoria Jones/PA) In a speech to the Conservative <b>Political</b> Action ... Mr Trump and Reform <b>UK</b> founder Nigel Farage are ..."
    }
]