[
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24099697.labour-pushes-government-change-rules-ministers-severance-payouts/",
        "title": "Labour pushes Government to change rules for ministers’ severance payouts",
        "description": "Ministers who lost their jobs during the chaos under Boris Johnson and Liz Truss received nearly £1 million in payouts, according to"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048441/GRAHAM-GRANT-lazy-Left-wing-tripe-progressive-tax-rises-time-Holyrood-tried-start-CUTTING-them.html",
        "title": "GRAHAM GRANT: Enough of this lazy Left-wing tripe about &#39;progressive&#39; tax rises it&#39;s time Holyrood tried to start CUTTING them",
        "description": "Is Scotland condemned to high taxes for eternity - and is any political party brave enough to make a stand against them? It&#39;s a fiction to suppose that Scots are wedded to punitive taxation."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24099680.king-thanked-health-professionals-raising-awareness-cancer/",
        "title": "King thanked by health professionals for raising awareness about cancer",
        "description": "Buckingham Palace said Charles chose to share his diagnosis to “assist public understanding” for those around the world affected by the disease."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/05/bishop-criticises-suella-braverman-fake-asylum-claims/",
        "title": "Bishop hits back over Braverman’s claims asylum seekers are faking Christian conversion",
        "description": "The Bishop of Chelmsford says only the Home Office has the power to grant asylum and assess whether a claimant is genuine"
    },
    {
        "url": "https://www.ibtimes.co.uk/green-party-overtakes-tories-second-most-popular-voters-under-30-1723235",
        "title": "The Green Party Overtakes The Tories As The Second Most Popular For Voters Under 30",
        "description": "A YouGov poll revealed that for voters aged 18 to 24, the Green Party is nine per cent more popular than the Conservative Party and 12 per cent ahead of the Liberal Democrats."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863050/prince-harry-meghan-markle-poll",
        "title": "Royal Family LIVE: Prince Harry and Meghan Markle&#39;s popularity plunges in brutal new poll",
        "description": "Prince Harry and Meghan Markle&#39;s popularity since they left the Royal Family has continued its downward spiral, new polling results show."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13048115/Houthis-hold-world-hostage-targeting-Red-Sea-trade-terrorists-threaten-established-order.html",
        "title": "Houthis hold the world hostage: By targeting Red Sea trade, terrorists threaten established order",
        "description": "Of the three terror groups starting with the letter H, Hamas, Hezbollah and Houthis, the one least known to the world until recently is the Yemen-based militia."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24090651.winchester-science-centre-announces-programme-winter-activities/",
        "title": "Winchester Science Centre announces programme of winter activities",
        "description": "In The Hibernation Station, families will learn all about what the <b>UK</b>’s native species are up to during winter. And for those feeling brave, there will be a chance to step outside and try some hibernation den building. Back inside, the science centre ..."
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/love-island-dumping-confirmed-itv-32054357",
        "title": "Love Island dumping &#39;confirmed&#39; as ITV star drops huge spoiler live on TV",
        "description": "All Stars continues tonight following the dramatic awards ceremony in the last episode and Good Morning Britain&#39;s Andi Peters has teased something to expect"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68208325.amp",
        "title": "Nevada caucuses v primary: Why both Trump and Haley may claim victory",
        "description": "Nevada is holding a primary and caucus in its Republican contest for the presidential nomination. Against a backdrop of neon lights and the clink of casino chips, the Nevada caucuses were once a colourful and important stop in the race to become the presidential nominee."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/the-longest-hour-piers-morgans-excruciating-interview-with-rishi-sunak?ref=biztoc.com",
        "title": "The longest hour: Piers Morgan’s excruciating ‘interview’ with Rishi Sunak",
        "description": "Prime minister joined UK Sun God for an exchange of awkward blokey bants, unbased claims and bonfire of vanities"
    },
    {
        "url": "https://www.thedrum.com/tv/video/best-for-britains-naomi-smith-on-modern-campaigns-social-media-shifts-and-the-urgency-of-electoral-reform",
        "title": "Best for Britain&#39;s Naomi Smith on modern campaigns, social media shifts, and the urgency of electoral reform",
        "description": "From her corporate career to leading Best for Britain, Naomi discusses tackling the aftermath of the Brexit referendum and Rishi Sunak&#39;s surprising ranking in an eye-opening Sunday Times Poll"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/warm-relations-among-executive-as-stormont-gets-back-to-business/a1808103318.html",
        "title": "Warm relations among Executive as Stormont gets back to business",
        "description": "It may have been blustery weather up on the hill for the press pack awaiting the politicians’ arrival, but it didn’t match the cordial calmness among the meeting Executive."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-king-and-pm-to-continue-weekly-audiences-as-concerned-biden-reveals-plans-to-call-12593360",
        "title": "<b>Politics</b> latest: King and PM to continue weekly audiences - as &#39;concerned&#39; Biden reveals plans to call",
        "description": "He will be travelling to <b>UK</b> to see His Majesty in the coming days,&quot; the source said. For more updates on the King&#39;s cancer diagnosis away from Westminster and the <b>political</b> reaction, read our dedicated live blog: New Northern Ireland FM wishes King well ..."
    },
    {
        "url": "https://news.sky.com/story/king-cancer-diagnosis-latest-he-chose-to-share-diagnosis-to-prevent-speculation-13064923?postid=7186951",
        "title": "King cancer diagnosis latest: He chose to share news to &#39;prevent speculation&#39;; Prince Harry to travel to <b>UK</b> to see father",
        "description": "The King has cancer, Buckingham Palace has disclosed. His diagnosis was made after he was treated at a London hospital for an enlarged prostate, a statement says. The Duke of Sussex is to travel to the UK &quot;in the coming days&quot; to see his father."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/05/bristol-university-professor-discrimination-anti-zionist/",
        "title": "Bristol University professor sacked for anti-Zionist views wins discrimination case",
        "description": "Professor David Miller was discriminated against based on his philosophical belief that Zionism is inherently racist, a tribunal has found"
    },
    {
        "url": "https://www.heraldscotland.com/politics/westminster/24099594.new-stormont-leaders-unite-demand-ni-funding-treasury/?ref=rss",
        "title": "New Stormont leaders unite to demand more NI funding from Treasury",
        "description": "The new Republican and Unionist leaders of Northern Ireland have united to demand more money from the <b>UK</b> Government to tackle the region ... meetings this morning with the Executive, with <b>political</b> leaders across Stormont, and it is a historic and ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/uk-keep-bombing-houthis-rules-out-regime-change-war-iran-2891560?ico=related_article_inline",
        "title": "<b>UK</b> will keep bombing Houthis but rules out regime change or war with Iran",
        "description": "The British Government has committed to continuing its bombing campaign until the Houthis end their attacks in the Red Sea"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68208677.amp",
        "title": "FM&#39;s &#39;prayers&#39; with King after cancer diagnosis",
        "description": "Scotland&#39;s first minister and other political leaders have sent messages of support to King Charles after the announcement that he has cancer. Humza Yousaf said his &quot;thoughts and prayers&quot; were with the King and he wished him a speedy recovery. The Scottish Conservative and Scottish Labour leaders also sent their best wishes to the Royal Family."
    },
    {
        "url": "https://www.theguardian.com/education/2024/feb/05/uk-professor-suffered-discrimination-due-to-anti-zionist-beliefs-tribunal-rules",
        "title": "<b>UK</b> professor suffered discrimination due to anti-Zionist beliefs, tribunal rules",
        "description": "Complaints that this resembled the antisemitic trope that Jews wield secretive influence on <b>political</b> affairs were dismissed by ... anti-Zionist views qualify as a protected belief under the <b>UK</b> Equality Act. This was the most important reason for taking ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-piers-morgan-talktv-nhs-tory-b2490614.html",
        "title": "Rishi Sunak: I can’t keep pledge to reduce NHS waiting lists",
        "description": "PM takes a huge political gamble by admitting he’s failed to deliver key election promise – and sparks outrage by accepting £1,000 bet on live TV that he won’t fail on Rwanda flights"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68209330?at_link_type=web_link&at_link_origin=BBCWorld&at_bbc_team=editorial&at_link_id=6566A770-C44E-11EE-98A3-6E93D0B4AF07&at_format=link&at_ptr_name=twitter&at_campaign_type=owned",
        "title": "Opposition parties attack Rishi Sunak over £1,000 Rwanda bet",
        "description": "Prime Minister Rishi Sunak has been criticised by opposition parties for a bet over his Rwanda policy. Asked by TalkTV&#39;s Piers Morgan if he would bet £1,000 for a refugee charity that deportation flights would take off before the next election, the PM shook hands with him."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24099586.northern-irelands-political-leaders-extend-well-wishes-king-diagnosis/",
        "title": "Northern Ireland’s <b>political</b> leaders extend well wishes to King on diagnosis",
        "description": "First Minister Michelle O’Neill and deputy First Minister Emma Little-Pengelly said they hoped the King made a speedy recovery."
    },
    {
        "url": "https://inews.co.uk/news/politics/brexit-dividend-northern-ireland-union-border-poll-2891355?ico=related_article_inline",
        "title": "Brexit dividend ‘could keep Northern Ireland in Union’ despite border poll claims",
        "description": "But she warned that those hoping for reunification would need to have a detailed plan for a post-<b>UK</b> Northern Ireland as voters would ... as voters eye the relative <b>political</b> stability of the Republic and wonder if “we’d be better off there”, while ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/happen-king-charles-abdicated-throne-20229498/?ico=metro-posts_africa_whats-trending-now",
        "title": "What would happen if King Charles abdicated?",
        "description": "Back in the <b>UK</b>, if Charles was to take a similar approach ... Kings and Queens abdicate for a number of reasons – including love, <b>political</b> pressure, or religious beliefs. In British history, only four monarchs have abdicated: Edward VIII, Richard ..."
    },
    {
        "url": "https://uk.news.yahoo.com/political-parties-come-together-support-192030030.html",
        "title": "<b>Political</b> parties come together in support of the King",
        "description": "The King has been diagnosed with a form of cancer and has begun a schedule of regular treatments, and while he has postponed public duties he “remains wholly positive about his treatment”, Buckingham Palace said."
    },
    {
        "url": "https://metro.co.uk/2024/02/05/a-controversial-former-fox-news-anchor-moscow-20225385/?ico=trending-module_tag_russia-ukraine-conflict_item-1",
        "title": "Is Putin about to be interviewed by a controversial American TV host?",
        "description": "But a high profile interview with a <b>political</b> figure as convoluted as Putin is not all ... Keir Giles, an expert with the Russia and Eurasia Programme at Chatham House, told Metro.co.<b>uk</b> that if he did make the decision to travel to Moscow with the ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/rapper-killer-mike-charged-after-32047199.amp",
        "title": "Rapper Killer Mike booked after he was arrested at Grammys Awards moments after winning",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. In the video, he was wearing his red carpet black suit with multiple officials around him. Speaking to ABC News, authorities said Killer Mike is &quot;in the process of ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68200997.amp",
        "title": "Chris Mason: NI power-sharing affords Rishi Sunak chance for a victory lap",
        "description": "The <b>UK</b> is now two prime ministers on ... The message appears to be that there has been a weekend of high rhetoric and highfalutin <b>politics</b> - with all the references to history associated with a first nationalist First Minister - but now the focus should ..."
    },
    {
        "url": "https://www.penarthtimes.co.uk/news/24099578.welsh-political-figures-send-king-charles-best-wishes/",
        "title": "Welsh <b>political</b> figures send King Charles best wishes",
        "description": "Figures from across the <b>political</b> spectrum in Wales have wished His Majesty the ... How many people are diagnosed with cancer every year in the <b>UK</b>? According to Macmillan Cancer Support around 393,000 people in the <b>UK</b> are diagnosed with cancer."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/martin-lewis-warns-its-another-28576045",
        "title": "Martin Lewis warns &#39;it&#39;s another nail in coffin&#39; after government &#39;cut&#39;",
        "description": "The most important tenet to boost social mobility is that <b>UK</b> students do not need to pay for university ... Too much of the media and <b>political</b> focus is on tuition fees. In fact, they&#39;re not a problem for students; they&#39;re an issue for graduates once ..."
    },
    {
        "url": "https://uk.news.yahoo.com/leading-gop-conservative-faces-political-220000234.html",
        "title": "Leading GOP conservative faces <b>political</b> storm over border bill",
        "description": "Sen. James Lankford (R-Okla.) is in the middle of a <b>political</b> storm as he tries to pull off the Herculean task of passing the Senate’s bipartisan border package into law amid rising opposition. Lankford and his fellow Senate negotiators have been taking ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/brexit-dividend-northern-ireland-union-border-poll-2891355",
        "title": "Brexit dividend ‘could keep Northern Ireland in Union’ despite border poll claims",
        "description": "Professor Katy Hayward, of Queen’s University Belfast, said Brexit led to a “lack of trust in the British government” in the region, firstly among predominantly Irish nationalist remainers as Northern Ireland voted to stay in the EU, but later unionists after Boris Johnson’s exit deal created trade barriers between the region and UK mainland."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24099578.welsh-political-figures-send-king-charles-best-wishes/",
        "title": "Welsh <b>political</b> figures send King Charles best wishes",
        "description": "Figures from across the political spectrum in Wales have wished His Majesty the King well after his cancer diagnosis. King Charles III has been diagnosed with cancer, Buckingham Palace has confirmed. Mark Drakeford said: “I’m saddened to hear the news that HM King Charles III is facing further health challenges."
    },
    {
        "url": "https://www.ft.com/content/6ebd6544-3cf1-4198-960e-f5fea7cb490b",
        "title": "Sunak urges Northern Irish executive to focus on ‘day-to-day matters’",
        "description": "Prime Minister Rishi Sunak has urged Northern Ireland’s newly restored executive to focus on resolving the “day-to-day things that matter to people” rather than the future question of Irish reunification."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24098261.covid-inquiry-exposed-snps-contempt-people/?ref=rss",
        "title": "Covid inquiry has exposed SNP’s contempt for the people",
        "description": "The contempt the UK&#39;s current crop of political leaders reserve for the voting public is beyond any caricature in a television drama and"
    },
    {
        "url": "https://www.thenational.scot/politics/24099432.david-mundell-will-pleased-greens-standing-constituency/",
        "title": "David Mundell will be pleased Greens are standing in his constituency",
        "description": "I WOULD not be surprised if Tory MP and former Scottish Secretary David Mundell was having a wee celebration and raising a glass to the"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7187022",
        "title": "<b>Politics</b> latest: Sunak wishes King &#39;full and speedy recovery&#39; after cancer diagnosis",
        "description": "You can scroll back through the <b>Politics</b> Hub to catch up on what the defence secretary had to say about the crisis in the Middle East - including the latest <b>UK</b>-US airstrikes on Houthi targets. Stay with us throughout the evening for more updates and ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=false&page=with:block-65c120bd8f08d62b48aaa729",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – <b>UK politics</b> live",
        "description": "SNP condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’ You must be 18 or over to fill in this form. We will only use this data for the purpose of improving our live blogs. For more information please read our terms of ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/islamophobia-scotland-first-minister-muslim-europe-b1137250.html",
        "title": "Islamophobia is endemic in the <b>UK</b> and getting worse, says Yousaf",
        "description": "Speaking to The Rest is <b>Politics</b> podcast with Alastair Campbell and Rory Stewart, he was asked about the <b>political</b> landscape in the <b>UK</b>, where several senior positions in <b>politics</b> are held by Muslims. Scottish Labour leader Anas Sarwar is Muslim and Mr ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/nis-only-ever-elected-black-28574931",
        "title": "NI&#39;s only ever elected black politician on the absence of any ethnic minority Ministers in new Executive",
        "description": "While the <b>UK</b> is now led by a Prime Minister from a minorities ethnic ... Lilian, who is also a director at the North West Migrants Forum, wrote: &quot;Equality is making strides in NI <b>politics</b>. Six women at the Executive table. Childcare, EVAWG &amp; Gender ..."
    },
    {
        "url": "https://www.business-live.co.uk/topics/topic-wales/severn-barrage-project-could-provide-28512034",
        "title": "Independent commission launched to look into a Severn tidal barrage",
        "description": "While it had some <b>political</b> support there was strong opposition in the west of England including from the Port of Bristol with concerns over the impact on its shipping flows. The project was rejected by the <b>UK</b> Government in 2013. Two years ago an early ..."
    }
]