[
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/23965186.committee-recommends-supermajority-speaker-election-restore-stormont/",
        "title": "Committee recommends ‘supermajority’ speaker election to restore Stormont",
        "description": "Among the measures it recommends in its report are calls for the <b>UK</b> Government to urgently reform the Assembly ... have been collapsed on several occasions previous to the current <b>political</b> impasse, including by Sinn Fein in 2017 in protest at the DUP ..."
    },
    {
        "url": "https://uk.news.yahoo.com/chris-packham-legal-challenge-against-000100278.html",
        "title": "Chris Packham in legal challenge against Government for weakening green policy",
        "description": "“To do so on a whim for short term <b>political</b> gain is reckless and betrays a disregard ... from the vehicle and gas boiler policies were “intrinsically important to the <b>UK</b>’s ability to reach somewhere near its net zero commitments”."
    },
    {
        "url": "https://uk.news.yahoo.com/coolie-series-picked-suharjono-sisters-000000776.html",
        "title": "‘Coolie’ Series Picked up by Suharjono Sisters’ I.E. Entertainment for ATF Launch (EXCLUSIVE)",
        "description": "With Hong Kong actor Louise Wong (“A Guilty Conscience,” “Anita,” “Table for Six”) in the lead role as a young woman who departs from southern China to marry a <b>political</b> exile working on a sugarcane plantation in Cuba, the narrative sees her ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/please-no-politicians-im-celebrity-214234662.html",
        "title": "Please, no politicians on I&#39;m a Celebrity next year, say Ant and Dec",
        "description": "Ant and Dec have urged ITV executives for a year “without politicians” on I’m A Celebrity...Get Me Out of Here following the appearances of Matt Hancock and Nigel Farage."
    },
    {
        "url": "https://inews.co.uk/news/politics/idiots-country-uk-disillusioned-city-stopped-voting-2782295",
        "title": "‘Idiots run the country’: Why the <b>UK</b>’s most disillusioned city stopped voting",
        "description": "Hull had the lowest turnout in the UK in 2019 and as another election approaches scepticism towards politicians is growing"
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/23965184.disabled-five-year-old-excited-spend-first-proper-christmas-buddy-dog/",
        "title": "Disabled five-year-old ‘excited’ to spend first proper Christmas with buddy dog",
        "description": "The mother of a severely disabled child whose face “lit up with joy” when he got a buddy dog says the youngster is “excited” to spend his first proper Christmas with the pet. Nicole Dodd-Moore’s five-year-old son JJ is severely disabled, immobile and non-verbal."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/23965175.hotel-syndicate-planning-special-christmas-party-1m-euromillions-win/",
        "title": "Hotel syndicate planning special Christmas party after £1m EuroMillions win",
        "description": "Syndicate leader Darren Gargan is planning a holiday to Lapland and other foreign trips after 13 staff members scooped £76,923 each."
    },
    {
        "url": "https://www.ft.com/content/a6c12222-559e-4152-b404-a663c5392471",
        "title": "Toyota explores <b>UK</b> investments after hybrid ban postponed",
        "description": "Keep abreast of significant corporate, financial and <b>political</b> developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert commentary and analysis you can trust."
    },
    {
        "url": "https://metro.co.uk/2023/12/04/chris-packham-court-challenge-government-weakening-green-policy-19919269/?ico=mosaic_uk",
        "title": "Chris Packham in court to challenge government weakening green policy",
        "description": "He has applied for a judicial review of the government&#39;s decision to ditch the timetable for a number of green policies."
    },
    {
        "url": "https://www.themanufacturer.com/articles/uk-manufacturing-pmi-industry-downturn-eases-in-november/",
        "title": "<b>UK</b> Manufacturing PMI: Industry downturn eases in November",
        "description": "The UK manufacturing industry downturn eased in November, with industry potentially turning a corner as the end of the year approaches, according to the latest S&amp;P Global / CIPS UK Manufacturing PMI®."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/dec/03/keir-starmer-labour-wont-turn-on-spending-taps-wins-election",
        "title": "Keir Starmer: Labour ‘won’t turn on spending taps’ if it wins election",
        "description": "The speech marks the first time Starmer has spoken publicly about the long-term path of public sector spending since last month’s autumn statement, which put the <b>UK</b> on course for another ... change in modern British <b>politics</b> begins with the realisation ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/23965147.sunak-starmer-refuse-commit-pensions-triple-lock-beyond-election/",
        "title": "Sunak and Starmer refuse to commit to pensions triple lock beyond election",
        "description": "Rishi Sunak refused to comment on the timing of the general election (Stefan Rousseau/PA) Mr Hunt began to ease the historically high tax burden in last month’s highly-<b>political</b> autumn statement, claiming the <b>UK</b> economy had turned a corner. A cut in ..."
    },
    {
        "url": "https://inews.co.uk/culture/television/starmer-can-kick-bbc-licence-fee-political-football-into-touch-2789439?ico=related_article_inline",
        "title": "Starmer can kick BBC licence fee <b>political</b> football into touch",
        "description": "Wise heads believe it’s time to kick the licence fee <b>political</b> football into touch. Expect an incoming Labour government to consider creating an independent panel to set the level, removing the big stick Downing Street wields over the corporation."
    },
    {
        "url": "https://metro.co.uk/2023/12/03/rwanda-given-15-000-000-take-migrants-arrive-uk-19918830/?ico=trending-post-strip_item_1",
        "title": "Rwanda could be given £15,000,000 to take migrants who arrive in <b>UK</b> on small boats",
        "description": "Almost 28,500 asylum seekers arrived to the <b>UK</b> in 2023 using the sea route ... court reached its conclusion on the law and took ‘no view whatsoever’ about the <b>political</b> merits of the policy."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/23961169.letters-debate-sowerby-topcliffe-by-election/",
        "title": "Letters: Debate over Sowerby and Topcliffe by-election",
        "description": "I read in these pages that electoral reform campaigners have expressed dismay after North Yorkshire Council opposition parties rejected an appeal"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-britain-labour-andrew-bailey-margaret-thatcher-b1124494.html",
        "title": "Starmer: Labour must be obsessed with growth to turn economy around",
        "description": "“The <b>political</b> consensus that if you work hard and play by the ... It will see a focus on supporting the <b>UK</b>’s “huge assets” — its financial sector, highly educated population and world class universities — by carrying out supply-side reforms."
    }
]