[
    {
        "url": "https://www.thenational.scot/politics/24013437.house-lords-represents-scotland-stands/",
        "title": "The House of Lords represents all that Scotland stands against",
        "description": "The National published an article by former SNP advisor Stephen Noon in which he argued that Yes supporters and"
    },
    {
        "url": "https://inews.co.uk/news/world/jacques-delors-dies-at-98-2826640?ico=related_stories",
        "title": "Jacques Delors, founding father of the modern EU, dies aged 98",
        "description": "Jacques Delors, the former European Commission president who was the driving force behind the modern European Union, has died at 98, according to his daughter. Mr Delors played the leading role in creating the single market allowing the free movement of people, goods and services across the bloc."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24014054.motorists-stranded-roads-closed-storm-gerrit-batters-scotland/",
        "title": "Motorists stranded and roads closed as Storm Gerrit batters Scotland",
        "description": "It comes as travellers across Scotland endure disruption due to poor weather conditions caused by Storm Gerrit, with several major roads closed and all trains cancelled north of Perth and Dundee."
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/national/24014068.architect-euro-single-market-jacques-delors-dies-aged-98/",
        "title": "Architect of euro and single market Jacques Delors dies aged 98",
        "description": "Former European Commission president Jacques Delors, who played a key role in the design of the euro and creation of the single market, has died aged 98. Mr Delors was hailed as a “statesman of French destiny” by French president Emmanuel Macron after news of his death was confirmed."
    },
    {
        "url": "https://inews.co.uk/opinion/why-economists-got-wrong-2023-2826196?ico=more_from_this_author",
        "title": "Why economists got it so wrong in 2023",
        "description": "It is not just that most of them got their 2023 forecasts badly wrong. It was always going to be difficult in a time of wider turmoil to predict how any particular element – growth, inflation, unemployment – was going to develop."
    },
    {
        "url": "https://www.telegraph.co.uk/obituaries/2023/12/27/jacques-delors-president-ec-clashed-thatcher-died-obituary/",
        "title": "Jacques Delors, architect of the modern European Union who clashed repeatedly with Margaret Thatcher – obituary",
        "description": "Before the 2016 Brexit referendum there were rumours that Delors wanted Britain to leave, to help speed up integration, but in public he maintained that the <b>UK</b>’s participation ... taking night classes in economics, <b>politics</b> and philosophy."
    },
    {
        "url": "https://www.theguardian.com/business/2023/dec/27/how-a-spring-uk-budget-could-fire-the-starting-gun-for-an-early-election?ref=biztoc.com",
        "title": "How a spring <b>UK</b> budget could fire the starting gun for an early election",
        "description": "UK economic prospects are bleak but an agenda-setting fiscal event such as sweeping tax cuts in March offers another roll of the dice"
    },
    {
        "url": "https://www.bbc.com/news/world-europe-13360806.amp",
        "title": "Jacques Delors: EU heavyweight whose ideas faced stiff opposition",
        "description": "His ideas faced stiff opposition in the UK from Margaret Thatcher, John Major and the British press - which saw him as a modern-day Charlemagne, bent on the political union of Europe. And he lived long enough to see the UK break with his European project altogether, in the Brexit referendum in 2016."
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/darts/scott-williams-martin-schindler-chant-31757486",
        "title": "Darts star in bizarre &quot;two World Wars, one World Cup&quot; jibe after beating German opponent",
        "description": "Scott Williams claimed a thrilling win over Martin Schindler to reach the Last 16 of the PDC World Championship, but the Englishman made reference to an infamous chant in his post-match interview"
    },
    {
        "url": "https://metro.co.uk/2023/12/27/comedian-tom-smothers-half-smothers-brothers-dies-aged-86-20031366/",
        "title": "Comedian Tom Smothers, half of the Smothers Brothers, dies aged 86",
        "description": "Tom Smothers, best known as half of the comedy duo the Smothers Brothers, has died aged 86. The comedian died on Boxing Day in Santa Rosa, California following a battle with cancer, the National Comedy Center announced on behalf of his family today (Wednesday December, 27)."
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/american-sports/taylor-swift-zero-travis-kelce-31757431",
        "title": "Taylor Swift has &#39;zero&#39; to do with Travis Kelce and Kansas City Chiefs&#39; struggles",
        "description": "The Kansas City Chiefs have lost three of the eight games Taylor Swift has attended this season, leading to some fans suggesting the pop star is a &#39;distraction&#39;"
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24013935.irish-stars-remember-writer-director-david-leland-following-death-aged-82/",
        "title": "Irish stars remember writer and director David Leland following death aged 82",
        "description": "Irish stars Pierce Brosnan and Liam Neeson are among those who have paid tribute to writer, director and actor David Leland following his death at the age of 82. British star Leland, whose career spanned more than five decades, died on Christmas Eve “held tight by his loving family”, his agent confirmed on Wednesday."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1849540/labour-plan-stop-boats",
        "title": "Labour&#39;s plan to stop the boats will be a gift to people traffickers, says Esther Krakue",
        "description": "Sir Keir Starmer has been one of the most vocal critics of the Government’s Rwanda scheme, labelling it “a gimmick” and a piece of “<b>political</b> performance art ... And with the <b>UK</b> asylum acceptance rate of 77 per cent, compared with the EU ..."
    },
    {
        "url": "https://www.thesun.co.uk/health/25173601/mpox-mosquito-covid-measles-health-threat-2024/",
        "title": "From mpox and mosquitoes to mutant Covid and the world’s most infectious disease – the 4 biggest health threats of 2024",
        "description": "WHETHER it begins tomorrow, next year, or next decade, another health threat is coming. From the emergence of the new JN.1 Covid strain, to concerns over a more lethal Mpox variant, to the spread"
    },
    {
        "url": "https://news.stv.tv/politics/councils-dismayed-and-frustrated-by-scottish-government-treatment",
        "title": "Councils &#39;dismayed and frustrated&#39; by Scottish Government treatment",
        "description": "COSLA has warned the &#39;poverty gap will continue to grow&#39; unless more funding can be provided for local government."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24013816.storm-gerrit-disruption-brings-misery-post-christmas-travellers/",
        "title": "Storm Gerrit disruption brings misery for post-Christmas travellers",
        "description": "Disruption caused by Storm Gerrit has brought misery for travellers on their way home from the Christmas holidays across the country. Wind gusts of 80mph and heavy rain caused delays to road, rail, air and ferry transport."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/national/24013788.man-21-remains-critical-condition-disturbance/",
        "title": "Man, 21, remains in critical condition after ‘disturbance’",
        "description": "A 21-year-old man remains in a critical condition after he was stabbed in a “large-scale disturbance”, which left two others injured. The man was found by police officers with stab wounds to the chest in Liverpool city centre at 5.30am on Wednesday, a spokesman for Merseyside Police said."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1849547/Nurses-threaten-more-strikes",
        "title": "Nurses threaten fresh strikes amid &#39;unprecedented anger&#39;",
        "description": "The Royal College of Nursing&#39;s general secretary, Pat Cullen, said industrial action over the last 12 months had resulted in only &quot;modest progress&quot; despite &quot;an unprecedented amount of anger and optimism&quot;."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/national/24013717.suspected-arson-attack-tory-mps-office-concerning-says-no-10/",
        "title": "Suspected arson attack at Tory MP’s office ‘concerning’, says No 10",
        "description": "Mike Freer, the MP for Finchley and Golders Green, has raised the possibility that the incident could be related to his pro-Israel stance."
    },
    {
        "url": "https://www.ladbible.com/entertainment/film/emma-stone-poor-things-movie-uk-release-date-240497-20231227",
        "title": "Movie where Emma Stone has sex with an apple is about to drop in <b>UK</b> and it comes with a warning",
        "description": "Emma Stone’s latest movie, which contains numerous sex scenes including one involving an apple, is set to land in the UK"
    },
    {
        "url": "https://www.theguardian.com/world/live/2023/dec/27/israel-gaza-war-live-hamas-palestinians-west-bank-un-aid-us?page=with:block-658c4d898f08eff61a0b1133",
        "title": "Israel-Gaza war live: White House and Israeli minister discuss options for postwar Gaza",
        "description": "White House says national security adviser Jake Sullivan and Israel’s strategic affairs minister Ron Dermer have held talks"
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/state-of-british-politics-in-2023-perfectly-summed-up-in-one-tweet-365720/",
        "title": "State of British <b>politics</b> in 2023 perfectly summed up in one tweet",
        "description": "It has been another topsy-turvy year in British politics after Rishi Sunak emerged on the scene offering stability and accountability in the wake of the disastrous Liz Truss administration."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-london-67787184.amp",
        "title": "How does London’s <b>political</b> year look for 2024?",
        "description": "As election years go, 2024 is likely to be a ballot bonanza in London. There are the ones we know will definitely happen during the year: the elections for the mayor of London and for the 25 members of the London Assembly, which will take place simultaneously on 2 May."
    },
    {
        "url": "https://www.independent.co.uk/voices/letters/christmas-gaza-israel-palestine-conflict-tory-party-b2469971.html",
        "title": "This Christmas we cannot remain indifferent to the suffering in Gaza",
        "description": "This is a humanitarian tragedy whose cataclysmic health, social and <b>political</b> repercussions are bound to reverberate across the world. This shouldn’t be about Gaza. It is war of civilisation versus barbarism."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-67829682.amp",
        "title": "Antony Blinken leads officials to Mexico as US seeks to stem migration",
        "description": "US Secretary of State Antony Blinken and Mexican President Andres Manuel Lopez Obrador are holding talks, as a growing migration crisis causes chaos on their shared border. The high-level meeting comes as pressure grows on the White House to stem the influx of migrants to the US."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-rush-find-alternative-asylum-plan-before-rwanda-flights-take-off-1722402",
        "title": "Labour Rush To Find Alternative Asylum Plan Before Rwanda Flights Take Off",
        "description": "While Rishi Sunak continues to push his emergency Rwanda Treaty, Keir Starmer is considering processing asylum applications from overseas."
    },
    {
        "url": "https://www.newstalkzb.co.nz/on-air/holiday-breakfast/audio/rod-liddle-vast-majority-of-uk-do-not-support-either-major-political-party/",
        "title": "Rod Liddle: Vast Majority of <b>UK</b> Do Not Support Either Major <b>Political</b> Party Anymore",
        "description": "A feeling of malaise seems to have descended on British politics. UK correspondent Rod Liddle told Tim Dower that according to the latest opinion polls, fe"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24013419.stockton-man-given-12-week-sentence-south-bank-assault/",
        "title": "Stockton man given 12-week sentence after South Bank assault",
        "description": "A Stockton man who carried out a racially aggravated assault will be spending Christmas in prison for his actions."
    },
    {
        "url": "https://www.edinburghlive.co.uk/best-in-edinburgh/iconic-edinburgh-bar-announces-immediate-28354187",
        "title": "Iconic Edinburgh bar announces its immediate closure in scathing social media post",
        "description": "The Auld Hoose in Edinburgh&#39;s Southside made the announcement to their customers and said they were forced into the decision due to the cost of living crisis and rising prices."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24013412.lottery-ticket-holder-claims-15m-jackpot-pre-christmas-draw/",
        "title": "Lottery ticket holder claims £15m jackpot from pre-Christmas draw",
        "description": "Camelot UK Lotteries Limited confirmed on Wednesday that it had received a claim for the prize won by a single ticket-holder"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/milla-jovovich-apologizes-post-supporting-191302126.html",
        "title": "Milla Jovovich apologizes for post supporting Shaun King: &#39;It brought pain&#39;",
        "description": "The &quot;Resident Evil&quot; and &quot;Monster Hunter&quot; actress and model previously shared a post calling for King&#39;s return to Instagram."
    },
    {
        "url": "https://www.sharecast.com/news/political-news/uk-spring-budget-set-for-march-6-fuelling-election-speculation--15703246.html",
        "title": "<b>UK</b> spring Budget set for March 6, fuelling election speculation",
        "description": "Britain&#39;s spring budget statement will be delivered on March 6, the Treasury announced on Wednesday, amid suggestions the government may axe inheritance tax in an attempt to narrow a large opinion poll deficit ahead of a General Election which must be called by January 2025."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24013331.young-reporter-evolution-red-carpet-fashion---elodie-st-georges/",
        "title": "Young Reporter:The evolution of Red-carpet Fashion - Elodie St Georges",
        "description": "Red-carpet Fashion: how the past has influenced our present-day, potrayed at an exhibition at the heart of royalty, Kensington Palace."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/jeremy-hunt-just-confirmed-the-spring-budget-date-what-does-that-mean-for-the-next-election_uk_658c1bbfe4b0cd3cf0e43462?d_id=7119532&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Jeremy Hunt Just Confirmed The Spring Budget Date – What Does That Mean For The Next Election?",
        "description": "Jeremy Hunt has just announced the spring budget will be officially unveiled on March 6, sparking new speculation over the date of the next general election. While this particular announcement almost always happens in March, political pundits are reading into the early date."
    },
    {
        "url": "https://www.chad.co.uk/news/politics/ashfield-council-to-set-up-new-board-to-deliver-long-term-towns-plan-4458920",
        "title": "Ashfield Council to set up new board to deliver long-term towns plan",
        "description": "Ashfield Council will receive £50,000 this month and £200,000 next year to set up a new town board which will draw up a new long-term plan for towns."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24013270.no-channel-crossings-christmas-first-time-five-years/",
        "title": "No Channel crossings over Christmas for first time in five years",
        "description": "Migrants did not cross the Channel over the Christmas period for the first time since current records began. According to Home Office figures, no Channel crossings took place on Christmas Eve, Christmas Day or Boxing Day this year. This is the first time this has happened since 2018."
    },
    {
        "url": "https://bellacaledonia.org.uk/2023/12/27/the-uks-brezhnev-years-and-the-failure-of-the-free-market-utopia/",
        "title": "The <b>UK</b>’s Brezhnev years and the failure of the free market utopia",
        "description": "Why Materialist Utopias Fail, by Abby Innes, Cambridge University Press, £26.99. Reviewed by Lesley McDonald  One comment about the recent Dutch elections and the rightward"
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24013240.three-men-injured-liverpool-city-centre-disturbance/",
        "title": "Three men injured after Liverpool city centre ‘disturbance’",
        "description": "Three men have been injured after a “large disturbance” in Liverpool city centre. A man in his 20s is in a critical condition after being found with stab wounds at about 5.30am on Wednesday, a spokesman for Merseyside Police said."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24013238.boxing-day-retail-footfall-4-2022-analysis-shows/",
        "title": "Boxing Day retail footfall up 4% on 2022, analysis shows",
        "description": "High streets enjoyed an 8.8 rise in shoppers on December 26 last year, while central London saw footfall up 10.6, MRI Software said."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1849498/carol-vorderman-countdown-banned-contract-dispute",
        "title": "Carol Vorderman claims Countdown &#39;barred her from show as she quit over contract dispute&#39;",
        "description": "Countdown legend and TV presenter Carol Vorderman was a series regular on the Channel 4 show for 26 years, ever since it first launched in 1982, before leaving the show in 2008."
    },
    {
        "url": "https://metro.co.uk/2023/12/27/gb-news-presenter-champions-free-speech-blocks-critics-20029128/?ico=mosaic_tv",
        "title": "Confusion as GB News presenter who champions ‘free speech’ blocks critics",
        "description": "A GB News presenter has left many social media users scratching their heads after blocking them. Andrew Doyle is a playwright, journalist, and political satirist who joined the broadcaster in 2021, and hosts a weekly show titled Free Speech Nation."
    },
    {
        "url": "https://inews.co.uk/news/politics/half-tory-voters-government-covid-handling-damaged-economy-2818101?ico=most_popular",
        "title": "Half of Tory voters think Government’s handling of Covid damaged the economy",
        "description": "Half of Tory voters think the Government’s handling of the Covid pandemic has damaged the economy, as new polling also shows the public inquiry into the pandemic has left voters believing ministers are less compassionate than they previously thought."
    },
    {
        "url": "https://uk.news.yahoo.com/scrapping-inheritance-tax-benefit-wealthiest-123031545.html",
        "title": "Scrapping inheritance tax would benefit the wealthiest - here&#39;s how",
        "description": "Abolishing inheritance tax is seen as a vote-winner by the PM even though it will only affect % of the population."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-scrapping-inheritance-tax-benefit-wealthiest-123031095.html",
        "title": "Scrapping inheritance tax would benefit the very wealthiest - here&#39;s how",
        "description": "Abolishing inheritance tax is seen as a vote-winner by the PM, but in reality it will only affect % of the population."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24013013.storm-gerrit-brings-disruption-road-rail-ferry-networks/",
        "title": "Storm Gerrit brings disruption on road, rail and ferry networks",
        "description": "ScotRail warned passengers that Storm Gerrit is bringing “widespread disruption” to multiple routes across Scotland. Speed restrictions are in place, and passengers are urged to check their journeys ahead of travelling."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12903153/Princess-Diana-didnt-know-difference-Northern-Ireland-Republic-Ireland-Irish-note.html",
        "title": "&#39;Ignorant&#39; Princess Diana &#39;didn&#39;t know the difference between Northern Ireland and the Republic of Ireland&#39;, unsealed Irish note claims",
        "description": "Diana, Princess of Wales showed &#39;obvious ignorance of, or disregard for, constitutional niceties&#39; in relation to Northern Ireland, according to a note from the Irish ambassador in 1993."
    },
    {
        "url": "https://leftfootforward.org/2023/12/rmts-eddie-dempsey-slams-tory-narrative-on-rail-fare-rises/",
        "title": "RMT’s Eddie Dempsey slams Tory narrative on rail fare rises",
        "description": "The Senior Assistant General Secretary of the RMT union has slammed rail fare price hikes and debunked the Tory narrative over this year’s ongoing rail disputes. Speaking to Politics Joe, Eddie Dempsey first dismantled the argument that pay rises for workers would lead to increased ticket prices."
    },
    {
        "url": "https://www.business-live.co.uk/enterprise/year-north-east-business-2023-28353343",
        "title": "The year in North East business 2023: the 10 biggest stories",
        "description": "We kick off our end of year round-up with a selection of the 10 biggest stories for the North East business scene this year"
    },
    {
        "url": "https://www.fleetnews.co.uk/news/opinion-what-the-automotive-industry-can-anticipate-in-2024",
        "title": "Opinion: What the automotive industry can anticipate in 2024",
        "description": "Alfonso Martinez, UK MD at ALD Automotive LeasePlan, takes a look at the year that was and looks at what the automotive industry can anticipate in 2024."
    },
    {
        "url": "https://www.halesowennews.co.uk/news/national/24012927.jeremy-hunt-sets-march-6-spring-budget-date/",
        "title": "Jeremy Hunt sets March 6 as spring budget date",
        "description": "Jeremy Hunt has announced a spring budget will be set out on March 6, in what could be his last chance to introduce tax changes before the next general election.The Chancellor has commissioned the Office for Budget Responsibility (OBR) to prepare an economic and fiscal forecast to be presented to Parliament alongside the budget next year."
    },
    {
        "url": "https://www.theguardian.com/music/2023/dec/27/green-day-uk-tour-album-saviors?ref=upstract.com",
        "title": "Green Day: ‘If you want to experience British culture, go to see Millwall play’",
        "description": "Ahead of a UK tour and the release of their 14th studio album, Saviors, the trio talk conspiracy theories, being lost and what makes a good political song"
    },
    {
        "url": "https://hrreview.co.uk/hr-news/recruitment/44-of-uk-businesses-struggling-to-compete-on-pay-and-benefits-amidst-talent-war/373919",
        "title": "44% of <b>UK</b> businesses struggling to compete on pay and benefits amidst talent war",
        "description": "A recent study reveals that 44% of organisations are finding it difficult to match competitors&#39; pay and benefits, posing a threat to their ability to secure top talent!"
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-warship-crimea-putin-latest-news-b2469790.html?page=3",
        "title": "Ukraine-Russia war live: New images show Putin’s warship completely destroyed after Kyiv missile strike",
        "description": "Russia’s Defence Ministry confirmed its warship was hit in a Ukrainian strike by plane-launched guided missiles. Novocherkassk, one of Vladimir Putin ’s prized Black Sea fleet, was hit at Feodosiya in Russian-occupied Crimea early yesterday."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/24012715.colne-convicted-murder-jailed-historic-sex-offences/",
        "title": "Colne: Convicted murder jailed for historic sex offences",
        "description": "A convicted murderer has been jailed again for historic rapes and sexual offences against young girls. Terence Hughes, 81, committed the offences in East Lancashire and Gloucestershire, and caused “severe psychological harm” to each of the victims."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/inside-year-uk-politics-rishi-31744129.amp",
        "title": "Inside the year in <b>UK politics</b>: Rishi Sunak&#39;s gaffe-filled 2023 as Boris Johnson quits in a strop",
        "description": "After the unprecedented chaos of 2022, which saw Boris Johnson and Liz Truss brought down by their own failings, Rishi Sunak&#39;s efforts to steady the ship have repeatedly been tested"
    },
    {
        "url": "https://www.irishnews.com/news/ireland/diana-showed-ignorance-of-or-disregard-for-ni-constitutional-state-G5HXFQK7OBNJLCXD3SWCIEAIXI/",
        "title": "Diana showed ‘ignorance of, or disregard for’ NI constitutional state",
        "description": "A briefing note from the Irish ambassador stated that the late princess had referred to Northern Ireland as part of Ireland."
    },
    {
        "url": "https://www.irishnews.com/news/ireland/how-irish-president-refused-invite-to-charles-and-dianas-wedding-YIHDLGDA75KD7IHEVKMXOQJUG4/",
        "title": "How Irish President refused invite to Charles and Diana’s wedding",
        "description": "Irish President Patrick Hillery’s decision to decline an invitation to the wedding of Charles and Diana prompted concerns from Irish government officials. The invitation was sent to Mr Hillery and his wife for the wedding on July 29 1981 in St Paul’s Cathedral, and requested a reply by June 26."
    },
    {
        "url": "https://www.newstatesman.com/spotlight/2023/12/policy-wins-2023",
        "title": "Beavers are the secret weapon in the <b>UK</b>’s flood defences",
        "description": "The Bank of England deserves credit for its handling of the banking crises in spring 2023. Silicon Valley Bank UK was transferred to HSBC, with no bailout required. In the United States, meanwhile, the bailouts of Silicon Valley Bank and Signature Bank cost taxpayers $22bn."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24012401.winchester-weather-forecast-storm-gerrit-hits-uk/",
        "title": "Winchester weather forecast as Storm Gerrit hits the <b>UK</b>",
        "description": "Winchester is to be bit with heavy rain and strong winds as Storm Gerrit sweeps across the country. The Met Office has issued an alert for wind all along the south coast which will be in place from 3am to 6pm. It does not cover the Winchester area, but the city is forecast for strong wind and heavy rain on Wednesday, December 27."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24012413.boxing-day-shopper-footfall-fifth-last-year-figures-suggest/",
        "title": "Boxing Day shopper footfall down a fifth on last year, figures suggest",
        "description": "“The fact that compared to 2019 levels, footfall remains down 33.8% indicates the long-term impacts of the continued rise of online shopping, as many consumers may have started their sale shopping on Christmas Day evening, and with Black Friday only a few weeks ago many will have grabbed their bargains back then."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24012339.post-christmas-travellers-face-disruption-storm-gerrit-sweeps/",
        "title": "Post-Christmas travellers face disruption as Storm Gerrit sweeps in",
        "description": "Met Office meteorologist Simon Partridge said Storm Gerrit was named as a warning to people travelling after the Christmas holidays. It has been a very wet and windy morning for many as #StormGerrit sweeps across the country ⚠️"
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicester-city-centre-homeless-tap-8967081",
        "title": "Leicester city centre scheme set up to take homeless people off the streets raises nearly £50,000",
        "description": "Since its inception, the charity has raised just under £50,000 - the equivalent of 19,520 hot meals. GIVE Leicester donations have assisted The Bridge Homelessness to Hope, to help take over 120 people off of the streets and into accommodation and have been the catalyst to provide much-needed additional support in the community."
    },
    {
        "url": "https://www.nottinghampost.com/news/local-news/nottinghamshire-conservatives-say-can-turn-8882037",
        "title": "Nottinghamshire Conservatives say they can &#39;turn things around&#39; before next election",
        "description": "Nottinghamshire&#39;s MPs say they expect the next general election in 2024 and some of the county&#39;s Conservatives say they have time to &quot;turn things around.&quot; The last point at which Rishi Sunak can legally call a general election is in January 2025, but most Conservatives expect voters to head to the ballot box sooner."
    },
    {
        "url": "https://www.thesun.co.uk/news/25169741/speedboat-killer-stay-prison-release-dad/",
        "title": "My daughter drowned on date with speedboat killer…he’s never revealed truth about horror but could be freed next month",
        "description": "A DAD has issued a heartfelt plea to keep his daughter’s killer in prison until he reveals the truth about her final moments. Charlotte Brown, 24, was thrown from Jack Shepherd’s boat"
    },
    {
        "url": "https://www.politics.co.uk/comment/2023/12/27/lord-carlile-unravelling-the-sinister-link-between-advertising-fraud-and-terrorism/",
        "title": "Lord Carlile: ‘Unravelling the sinister link between advertising fraud and terrorism’",
        "description": "The opinions in <b>Politics</b>.co.<b>uk</b>&#39;s Comment section are those of the author. In the ever-evolving landscape of online advertising, a marketplace set to attract over £20bn of spending in the <b>UK</b> this year alone, a disquieting truth is emerging: a lack of ..."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/24000939.7-huge-concerts-festivals-coming-norfolk-2024/",
        "title": "7 huge concerts and festivals coming to Norfolk in 2024",
        "description": "From Take That at Carrow Road to Sundown at the Norfolk Showground, these huge concerts and festivals are coming to Norfolk in 2024."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/what-happened-in-world-of-business-during-2023-april-to-june-4458307",
        "title": "What happened in world of business during 2023: April to June",
        "description": "Tensions within Westminster continued to make headlines during late spring and early summer, although Yorkshire continued to attract inward investment during a period of soaring inflation."
    },
    {
        "url": "https://www.lse.co.uk/news/general-election-looms-for-uk-leaders-sunak-and-starmer-in-2024-rm8yho3t4bavbzw.html",
        "title": "General election looms for <b>UK</b> leaders Sunak and Starmer in 2024",
        "description": "The stakes for both Sunak and Keir Starmer are high: the general election expected in 2024 could see Labour return to power for the first time since 2010 or pave the way for a period of Tory rule lasting almost two decades."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24011785.higher-education-middle-class-private-school-pupils-pay-price/?ref=rss",
        "title": "Higher education: Middle class and private school pupils pay price",
        "description": "Devolution came about largely because of the social and cultural vandalism wrought by Thatcherism on the fabric of former industrial communities"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/dup-mla-accuses-sinn-fein-of-stoking-division-after-mcdonald-says-border-poll-possible-by-2030/a787908880.html",
        "title": "DUP MLA accuses Sinn Fein of stoking division after McDonald says border poll possible by 2030",
        "description": "The only issue Sinn Fein cares about is “creating division and instability”, a DUP MLA has said, after Mary Lou McDonald speculated that a border poll could be held within the lifetime of the next Dail."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/sinn-fein-accused-of-stoking-division-after-mcdonald-says-border-poll-possible-by-2030/a787908880.html",
        "title": "Sinn Fein accused of stoking division after McDonald says border poll possible by 2030",
        "description": "The only issue Sinn Fein cares about is “creating division and instability”, a DUP MLA has said, after Mary Lou McDonald speculated that a border poll could be held within the lifetime of the next Dail."
    }
]