[
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24135851.government-launches-baby-loss-certificate-scheme-recognise-grief-parents/",
        "title": "Government launches baby loss certificate scheme to ‘recognise grief of parents’",
        "description": "“We cannot begin to tackle the wider problem of baby loss without a Government commitment to gather and record <b>UK</b>-wide miscarriage statistics. “Without data, miscarriage remains a largely hidden problem and isn’t prioritised, despite the tens of ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24135844.uk-quits-outdated-treaty-penalise-shift-net-zero/",
        "title": "<b>UK</b> quits ‘outdated’ treaty that could penalise shift to net zero",
        "description": "“Civil society organisations and parliamentarians from all <b>political</b> parties have been clear that the Energy Charter Treaty is an out-of-date agreement and undermines our efforts to tackle climate change. “We welcome the <b>UK</b>’s decision to ..."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24135842.poorer-families-full-time-jobs-need-eight-day-week-escape-poverty/",
        "title": "Poorer families in full-time jobs ‘need eight-day week to escape poverty’",
        "description": "The charity said its analysis showed almost 300,000 low-income families with children in the <b>UK</b> are trapped in poverty despite the ... “In this election year, this is something all <b>political</b> parties must address. “Further research is needed into ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24135840.most-distressed-ipp-prisoners-immediately-released-charity-says/",
        "title": "‘Most distressed’ IPP prisoners should be immediately released, charity says",
        "description": "In its report, the CCJS said reviews of resentencing for all IPP prisoners and all forms of preventative detention in the <b>UK</b> should be ordered ... adopt our recommendations without delay, to end the <b>political</b> inertia that has allowed this stain on the ..."
    },
    {
        "url": "https://www.countytimes.co.uk/news/national/24135846.2-700-dangerous-wild-animals-privately-owned-figures-show/",
        "title": "More than 2,700 dangerous wild animals privately owned, figures show",
        "description": "Dr Mark Jones, Born Free’s head of policy, said: “It is unbelievable that, in this day and age, so many dangerous animals, including big cats, large primates, crocodiles and venomous snakes, continue to be legally kept in people’s homes in the <b>UK</b>."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/commons-speaker-under-pressure-after-gaza-vote-chaos-100626/",
        "title": "Commons Speaker under pressure after Gaza vote chaos",
        "description": "The Speaker of the House of Commons is under pressure over his handling of a debate on Gaza, which resulted in MPs passing Labour’s amendment calling for an “immediate humanitarian ceasefire” amid scenes of chaos. The motion was approved but only ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68362405.amp",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "&quot;This should have been the chance for the <b>UK</b> Parliament to do the right thing and vote for ... Sir Keir accused the Conservatives and SNP of &quot;choosing <b>political</b> games over serious solutions&quot;. &quot;Today was a chance for Parliament to unite and speak with ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-68358532",
        "title": "Tensions rise towards Speaker in Commons Gaza debate",
        "description": "Conservative and SNP MPs show their anger with Lindsay Hoyle&#39;s ruling over a debate calling for a Middle East ceasefire."
    },
    {
        "url": "https://www.edp24.co.uk/news/24133420.councillors-lying-says-mps-insensitive-moment/",
        "title": "Councillor’s lying says more than MP’s insensitive moment",
        "description": "While empathy is due to anyone who is working hard and struggling, MP George Freeman’s pleading poverty as reason to resign his ministerial"
    },
    {
        "url": "https://www.lbc.co.uk/opinion/views/embracing-geopolitical-uncertainty-discord-presents-lucrative-opportunities/",
        "title": "Embracing geopolitical uncertainty: Why discord presents lucrative opportunities for investors",
        "description": "With geopolitical worries thickening it is tempting for investors to succumb to pessimism. But remember that from a purely investment point of view discord also brings opportunity."
    },
    {
        "url": "https://www.independent.co.uk/politics/speaker-gaza-commons-lyndsay-hoyle-votes-b2500244.html",
        "title": "Why Speaker’s decision on Gaza debate in House of Commons sparked chaos in chamber",
        "description": "Commons Leader Penny Mordaunt accused Sir Lindsay of having “hijacked” the debate and said it had become a “<b>political</b> row within the Labour Party”, adding: “Regrettably Mr Speaker has inserted himself into that row with today’s decision and ..."
    },
    {
        "url": "https://www.architectsjournal.co.uk/news/opinion/this-is-the-year-to-get-political-and-make-the-case-for-what-you-believe-in",
        "title": "This is the year to get <b>political</b> and make the case for what you believe in",
        "description": "Having barely emerged from the tumult of Brexit and the Covid-19 pandemic, the <b>UK</b>’s <b>political</b> framework and resolve have been tested to their limits in recent months. As a beleaguered Tory administration prepares for what must be an election year ..."
    },
    {
        "url": "https://feweek.co.uk/politically-driven-post-16-policy-churn-has-damaged-stability-think-tank-warns/",
        "title": "‘Politically driven’ post-16 policy churn has damaged stability, think tank warns",
        "description": "Governments must end the “high level” of policy churn across all four UK nations that has caused instabilities and overly complex training routes"
    },
    {
        "url": "https://www.independent.co.uk/climate-change/news/green-alliance-government-germany-spain-netherlands-b2500316.html",
        "title": "<b>UK</b> quits ‘outdated’ treaty that could penalise shift to net zero",
        "description": "“Civil society organisations and parliamentarians from all <b>political</b> parties have been clear that the Energy Charter Treaty is an out-of-date agreement and undermines our efforts to tackle climate change. “We welcome the <b>UK</b>’s decision to ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/private-sector-must-continue-take-charge-eastern-europes-economic-development-1723486",
        "title": "The Private Sector Must Continue to Take Charge of Eastern Europe&#39;s Economic Development",
        "description": "Historically, the post-Soviet sphere still suffers from the challenges emanating from its legacies of centralized economies and unstable <b>political</b> transitions. As many a government still struggles to navigate complex reforms and institutional changes ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harrys-path-royal-reconciliation-32183115?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "Prince Harry&#39;s path to royal reconciliation could take years as &#39;trust&#39; must be gained",
        "description": "Prince Harry&#39;s Path to Royal Reconciliation Could Take Years as &#39;trust&#39; must be gained. Newsweek&#39;s royal correspondent Jack Royston, has mapped out Harry&#39;s possible route back."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68362405.amp",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "A Commons debate on calls for a ceasefire in Gaza descended into chaos, after the Speaker was accused of allowing it to be &quot;hijacked&quot; by Labour. Sir Lindsay Hoyle sparked fury from the SNP and Conservatives when he broke with convention to allow a vote on a Labour motion for an &quot;immediate humanitarian ceasefire&quot;."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13110591/MP-accuses-infuriating-IMF-dodging-scrutiny-sits-perch-Washington.html",
        "title": "MP accuses &#39;infuriating&#39; IMF of dodging scrutiny as it sits on its &#39;perch in Washington&#39;",
        "description": "A senior MP who chairs the Treasury select committee branded it ‘infuriating’, just weeks after the IMF waded into <b>UK politics</b> by advising Chancellor Jeremy Hunt not to cut taxes in the Budget next month and increase public spending. The Washington ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/snps-stephen-flynn-calls-for-investigation-following-chaotic-gaza-vote-4528450",
        "title": "SNP’s Stephen Flynn calls for investigation following chaotic Gaza vote",
        "description": "Stephen Flynn has called for an investigation into the chaos in the Commons on Wednesday following a debate on Gaza led by his party."
    },
    {
        "url": "https://www.irishnews.com/news/uk/house-of-commons-gaza-debate-what-happened-during-the-chambers-day-of-chaos-LK6WMNSGP5OTHL2WCBATZFZSZQ/",
        "title": "House of Commons Gaza debate: What happened during the chamber’s day of chaos?",
        "description": "What was meant to be a discussion about the UK’s policy on the Hamas-Israel conflict spiralled into heated exchanges on the Speaker’s actions."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?page=with:block-65d67b4e8f089d88380e86a6",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – <b>UK politics</b> live",
        "description": "Labour amendment calling for immediate Gaza ceasefire passes after government and SNP walkout"
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1869393/Loose-Women-Carol-McGiffin-Dan-Wootton-investigation-witch-hunt",
        "title": "Loose Women&#39;s Carol McGiffin slams Dan Wootton investigation as a &#39;<b>political</b> witch hunt&#39;",
        "description": "Former Loose Women star Carol McGiffin has branded the police investigation into Dan Wootton a &quot;political witch hunt&quot;, after learning the GB News presenter has been cleared."
    },
    {
        "url": "https://www.prnewswire.co.uk/news-releases/first-quantum-announces-comprehensive-refinancing-transactions-as-part-of-its-balance-sheet-strengthening-initiatives-302068040.html",
        "title": "FIRST QUANTUM ANNOUNCES COMPREHENSIVE REFINANCING TRANSACTIONS AS PART OF ITS BALANCE SHEET STRENGTHENING INITIATIVES",
        "description": "First Quantum Minerals Ltd. (&quot;First Quantum&quot; or the &quot;Company&quot;) (TSX: FM) announces four balance sheet strengthening initiatives"
    },
    {
        "url": "https://www.itv.com/news/2024-02-21/uk-sanctions-the-heads-of-artic-penal-colony-where-alexei-navalny-died",
        "title": "Lord Cameron urges world to hold &#39;Putin and his cronies to account&#39; after Navalny death",
        "description": "Six individuals at the head of the Arctic penal colony where Alexei Navalny died have been sanctioned by the UK. The men are now banned from the UK and subject to an asset freeze preventing UK companies and individuals from dealing with them."
    },
    {
        "url": "https://news.sky.com/story/speaker-clinging-on-to-job-as-33-mps-sign-no-confidence-motion-after-commons-gaza-vote-descends-into-row-13077779",
        "title": "Speaker clinging on to job as 33 MPs sign no-confidence motion after Commons Gaza vote descends into row",
        "description": "An SNP opposition day starts with a row over Sir Lindsay Hoyle&#39;s decision to select a Labour amendment and ends with a mass walkout of MPs."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/happened-house-commons-gaza-ceasefire-vote-chaos-explained-20323752/?ico=mosaic_news",
        "title": "What happened with <b>UK</b> Gaza ceasefire vote as Lindsay Hoyle’s future is questioned",
        "description": "The commotion in Parliament drew widespread criticism, with Palestinian ambassador to the <b>UK</b> Husam Zomlot telling LBC: ‘It’s very disgraceful. Today we have seen British <b>politics</b> at its worst.’ Halima Begum, chief executive of the ActionAid <b>UK</b> ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/gaza-ceasefire-vote-descends-into-chaos-and-anger-as-snp-and-tories-walk-out-2919643?ico=related_article_inline",
        "title": "Gaza ceasefire vote descends into chaos and anger as SNP and Tories walk out",
        "description": "But the result came only after scenes of chaos and bitter <b>political</b> point-scoring which saw Tory MPs call ... to the SNP’s Gaza ceasefire motion (Photo: House of Commons/<b>UK</b> Parliament) At one stage, MPs voted on whether the Commons should sit in private ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/results-uks-gazas-ceasefire-vote-revealed-20323318/?ico=trending-post-strip_item_4",
        "title": "<b>UK</b> government votes to call for an ‘immediate ceasefire’ in Gaza",
        "description": "Pro-Palestinian demonstrators are marching outside of parliament ahead of the vote (Picture: HENRY NICHOLLS/AFP) MPs have voted to call for an immediate ceasefire in Gaza after a day of <b>political</b> wrangling between Labour and the SNP. The <b>UK</b> government ..."
    },
    {
        "url": "https://www.mirror.co.uk/sport/golf/tiger-woods-charlie-pga-tour-32182494.amp",
        "title": "Tiger Woods&#39; son Charlie takes huge step towards PGA Tour debut at just 15",
        "description": "The 82-time Tour winner had not featured on Tour since last December&#39;s Hero World Challenge in the Bahamas. For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. Tiger Woods&#39; daughter Sam caddied for the 15-time major ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-parliament-plunged-chaos-over-234329678.html",
        "title": "<b>UK</b> parliament plunged into chaos over Gaza ceasefire vote",
        "description": "Dozens of lawmakers stormed out of Britain&#39;s parliament on Wednesday with tempers flaring as the three biggest <b>political</b> parties sought to outmanoeuvre each other over a vote on a ceasefire in Gaza. The uproar followed a decision by the speaker to ignore ..."
    },
    {
        "url": "https://uk.news.yahoo.com/house-commons-sinks-chaos-over-212311445.html",
        "title": "House of Commons Sinks Into Chaos Over Israel-Hamas War Vote",
        "description": "Yet in the <b>UK</b>’s pre-election <b>politics</b>, the smallest differences are opportunities for point-scoring, which is why during the debate on a non-binding vote on a cease-fire, some MPs lamented the bigger picture was completely overlooked. The focus “must ..."
    },
    {
        "url": "https://inews.co.uk/news/business/hsbc-profit-interest-rates-boost-2917388?ico=more_from_this_author",
        "title": "HSBC announces record £24bn profit boosted by interest rates",
        "description": "Its profits were also boosted by its emergency rescue of Silicon Valley Bank <b>UK</b> during the banking crisis last year ... expected economic recovery after the pandemic, greater regional <b>political</b> tensions and a crisis in the property market."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-hamas-house-of-commons-b1140715.html",
        "title": "Labour amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "The commotion in Parliament drew widespread criticism, with Palestinian ambassador to the <b>UK</b> Husam Zomlot telling LBC: “It’s very disgraceful. Today we have seen British <b>politics</b> at its worst.” ActionAid <b>UK</b>’s chief executive Halima Begum said ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/politics/government-warned-over-excluding-ni-from-livestock-export-ban/a504913910.html",
        "title": "Government warned over excluding NI from livestock export ban",
        "description": "While recognising the &quot;complex <b>political</b> and pragmatic reasons&quot; behind the Northern ... Lord Dodds added: &quot;Once again, the territorial integrity of the United Kingdom, the right of <b>UK</b> lawmakers to make democratic decisions, and the sovereignty of our ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mpc-bank-of-england-b1140667.html",
        "title": "Waiting to cut rates risks ‘hard landing’ for <b>UK</b> economy, says Bank policymaker",
        "description": "She said that <b>UK</b> consumption had still not recovered to levels seen before the pandemic, unlike in the US and eurozone, adding that the impact of the recent run of 14 rate hikes in a row would still continue to be felt for some time. Ms Dhingra said ..."
    }
]