[
    {
        "url": "https://www.bbc.com/news/uk-politics-68121804",
        "title": "Watch: Martin Lewis for PM? Voters give their views",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts with Laura Kuenssberg. Hear their suggestions of who should be prime minister are some names you may have heard of but not necessarily for their political backgrounds."
    },
    {
        "url": "https://faroutmagazine.co.uk/lana-del-reys-favourite-lyric-of-all-time/",
        "title": "Lana Del Rey’s favourite lyric of all time",
        "description": "While they share many similarities, Del Rey’s songwriting has often been accused of lacking the <b>political</b> awareness Dylan’s protest anthems did. In her early Born To Die years, the obsessive explorations of Americana have been accused of being tone ..."
    },
    {
        "url": "https://www.ft.com/content/0b8c0038-b15e-4874-8ced-260ce2cbd733",
        "title": "Biden says Iran-backed militants killed 3 US servicemen in drone attack",
        "description": "Three US service members have been killed by a drone attack on a military base carried out by “radical Iran-backed militant groups” near the Syria border, the White House said on Sunday. President Joe Biden said the US would “hold all those responsible to account at a time and in a manner of our choosing”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13016153/Police-arrest-two-people-eco-attacked-Mona-Lisa-Louvre-soup-Da-Vinci-masterpiece-climate-change.html",
        "title": "Police arrest two people after ranting eco-morons attacked Mona Lisa in the Louvre by throwing soup at Da Vinci&#39;s priceless masterpiece before launching into climate change rant",
        "description": "<b>Politics</b> failed women in 1914 ... adding that more activists were slow marching on Whitehall, the road that hosts many <b>UK</b> government buildings. The gallery said the pair &#39;appeared to strike&#39; the glass protecting the painting with &#39;what appeared to be ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/duptuv-tensions-increase-as-speculation-around-a-deal-to-restore-stormont-executive-intensifies-4495815",
        "title": "DUP/TUV tensions increase as speculation around a deal to restore Stormont Executive intensifies",
        "description": "A copy of the email, seen by the News Letter, states that the members of the members attending will be provided with a “detailed update on the current <b>political</b> situation ... forward by government would mean <b>UK</b> ministers having to consider the ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24080063.monkey-loose-escaping-scottish-wildlife-park/",
        "title": "Monkey on the loose after escaping from Scottish wildlife park",
        "description": "“If members of the public encounter the macaque they should contact comms@rzss.org.<b>uk</b> with more information and do not approach it.” There were reports residents of Kincraig had spotted the monkey roaming their garden while enjoying enjoying nuts and ..."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1860657/cancer-treatment-targets",
        "title": "Cancer treatment targets missed, thousands left waiting",
        "description": "Cancer Research <b>UK</b> claims that if the target had been consistently met ... Amy, who is engaged, added: “I want to be inspired by my <b>political</b> leaders and confident they have the highest-level aspirations when it comes to our nation’s healthcare.&quot;"
    },
    {
        "url": "https://www.itv.com/news/utv/2024-01-28/northern-irelands-sunday-news-headlines",
        "title": "Northern Ireland&#39;s Sunday news headlines: DUP talks and Conway murder charge",
        "description": "A DUP spokesperson said they do not comment on internal meetings. A 27-year-old man has been charged with the murder of Kevin Conway in Belfast. Mr Conway was shot and killed near his home in the West of the city on the 9 January in what police have described as a &quot;horrific, calculated and ruthless&quot; murder."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/marina-purkiss-masterclass-comes-back-to-haunt-rees-mogg-367709/",
        "title": "Marina Purkiss masterclass comes back to haunt Rees-Mogg",
        "description": "The <b>UK</b> has delayed border checks on goods coming from Europe five times since leaving the EU, but new rules will gradually start to be implemented from next week and they will soon start to drive up costs on certain foods. Nearly half of what we eat in ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/khloe-kardashian-shares-rare-video-31987464",
        "title": "Khloe Kardashian shares rare video of son Tatum as he bonds with family&#39;s pet",
        "description": "The Kardashians are known for sharing images of their lavish day-to-day lives on social media, but it&#39;s not often fans get to see footage that isn&#39;t famous scenes from their popular TV show on Hulu in the US and Disney Plus in the <b>UK</b>. But Khloe took to her ..."
    },
    {
        "url": "https://www.eadt.co.uk/news/national/24079932.kinlochewe-sets-provisional-uk-record-january-temperature-19-6c/",
        "title": "Kinlochewe sets provisional <b>UK</b> record for January temperature with 19.6C",
        "description": "If confirmed, the temperature would beat the previous record of 18.3C recorded in two villages in Aberdeenshire in 2003 and in Wales in 1958"
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24071407.residents-complain-state-basingstokes-bus-shelters/",
        "title": "Residents complain about the state of Basingstoke&#39;s bus shelters",
        "description": "A spokesperson for Basingstoke and Deane Borough Council said: &quot;The majority of bus shelters in Basingstoke and Deane are owned by the borough council or Clear Channel <b>UK</b>. Clear Channel sell advertising space on the ones they are responsible for and maintain."
    },
    {
        "url": "https://inews.co.uk/news/politics/wealth-tax-labour-public-services-neil-kinnock-2877272?ico=related_article_inline",
        "title": "Wealth tax could be imposed by Labour to boost public services, says Neil Kinnock",
        "description": "“The <b>politics</b> of it become a bit more complex – because tax cuts you know you get, but if you spend more on public services, is it clear the hospitals and schools and so on actually get better? “So it may be that tax cuts are a sensible strategy even ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-normal-neil-kinnock-2876233?ico=more_from_this_author",
        "title": "Rishi Sunak not normal enough to pull off Major-style victory, says Neil Kinnock",
        "description": "Ex-Labour leader recalls 1992 battle with John Major and says current PM could never carry off his opponent&#39;s famous &#39;megaphone moment&#39;"
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/opinion/24073194.red-tape-top-red-tape-new-customs-checks/",
        "title": "Red tape on top of red tape from new customs checks",
        "description": "The government has finally confirmed a key element will be completed in the coming months. From the end of April customs checks will begin on food and agricultural products coming into the UK from the EU."
    },
    {
        "url": "https://www.thenational.scot/politics/24079851.uk-politics-entering-dangerous-new-phase/",
        "title": "<b>UK politics</b> is entering a dangerous new phase",
        "description": "And what their <b>politics</b> is telling them is that these people are dismissive ... What they want, and the threat that is waiting in the wings is Richard Tice’s Reform <b>UK</b> Party, with an eager Nigel Farage ready to take the helm to pounce on a wounded ..."
    },
    {
        "url": "https://www.thenational.scot/news/24079713.sunday-laura-kuenssberg-bbc-panned-english-focus-group/",
        "title": "Sunday with Laura Kuenssberg: BBC panned over English focus group",
        "description": "Introducing the segment, Kuenssberg (below) said: “Let’s hear what people had to say then, because <b>politics</b> is of course is about serving ... Greens or Reform <b>UK</b>; and those all-important undecided voters, whose ballots are still up for grabs."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/politics-poor-broadband-issue-had-to-be-raised-again-in-par-340425/",
        "title": "<b>Politics</b>: Poor broadband issue had to be raised again in Parliament",
        "description": "The issue of poor broadband connections has been brought up again by MP David Duguid. Out of 650 <b>UK</b> Parliament constituencies, Banff and Buchan has dropped from sixth to fifth from bottom of the league for superfast coverage. Only 86.3 per cent of premises ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "R eform UK is now polling consistently in joint third alongside the Liberal Democrats amid anger at the Conservatives over their handling of illegal migration, The Telegraph’s tracker shows. Richard Tice’s party is holding on to a 10 per cent share of national voting intention, which puts it on an equal footing with the Lib Dems."
    },
    {
        "url": "https://uk.news.yahoo.com/labours-28bn-green-pledge-still-120000926.html",
        "title": "Labour&#39;s £28bn green pledge still the &#39;level of ambition&#39;, says shadow business secretary",
        "description": "<b>Politics</b> latest: Badenoch issues warning to Tory rebels The shadow business secretary also said the money would be sourced from a combination of public and private investment, and added: &quot;We want to get to that level of ambition by the latter part of the ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h7m82k",
        "title": "Why is trust in <b>UK politics</b> so low?",
        "description": "Today, we look at whether the voters trust <b>political</b> leaders. Laura, Paddy and Henry wrap up what the politicians made of the focus groups on Laura&#39;s show. Can politicians be trusted with the big issues voters believe the country faces? Who does the public ..."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68113424/page/2",
        "title": "&#39;It just wasn&#39;t working&#39;: Badenoch on Post Office chairman&#39;s departure",
        "description": "Badenoch says there&#39;s too much &quot;personality <b>politics</b>&quot; and reporting on &quot;Westminster gossip ... saying inflation is &quot;not a <b>UK</b> specific problem&quot;."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/dup-urged-step-endless-merry-28527044",
        "title": "DUP urged to step off ‘endless merry-go-round’ and return to Stormont",
        "description": "It said the gathering would see party leader Sir Jeffrey Donaldson provide a “detailed update on the current <b>political</b> situation ... “Either NI will embark on transition out of the <b>UK</b> by unionists implementing the template designed for that purpose ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-middle-east-68123222.amp",
        "title": "Key UN Gaza aid agency UNRWA runs into diplomatic storm",
        "description": "And it has also become something of a <b>political</b> football, kicked by various sides over the ... and that many of the books in question were not used in its schools. <b>UK</b> halts aid to UN agency after Hamas attack claim UN in aid plea after staff accused ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/andrew-tate-youtube-real-world-b2484840.html",
        "title": "YouTube ‘earned up to £2.4m from ads on Andrew Tate videos’",
        "description": "It comes afterThe Independent revealed shocking figures finding more young men in the <b>UK</b> have seen material from Tate than have heard of the PM Rishi Sunak. In another piece, we also revealed the findings of exclusive polling by YouGov that found around a ..."
    },
    {
        "url": "https://www.nwemail.co.uk/news/national/uk-today/24079764.kemi-badenoch-asks-public-not-hound-ex-post-office-bosses/",
        "title": "Kemi Badenoch asks public to not hound ex-Post Office bosses",
        "description": "He had been tasked with leading the board of directors as the business reels from the fallout of what has been described as the <b>UK</b>’s biggest miscarriage of justice. The Post Office prosecuted more than 700 branch managers between 1999 and 2015 after ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/business-support-shift-labour-keir-starmer-over-rish-sunak/",
        "title": "Labour gains business support as half of leaders prefer Starmer-led Government",
        "description": "Opinium poll unveils shift in business sentiment, with a quarter of Tory-supporting business leaders favouring Labour under Sir Keir Starmer"
    },
    {
        "url": "https://www.mirror.co.uk/news/health/hero-boots-pharmacist-saved-womans-31709076?int_source=nba",
        "title": "Boots pharmacist saved woman&#39;s life after serious allergic reaction",
        "description": "Boots has 2,100 stores across the <b>UK</b> where over 4,300 pharmacists are supported by over 12,900 pharmacy technicians, dispensers, advisors and healthcare sales assistants. Over 80% of the population lives within 10 minutes of a Boots store too, and most are ..."
    },
    {
        "url": "https://www.ft.com/content/9016754a-317a-4371-b3a1-c25165ca6400?sharetype=gift",
        "title": "Charismatic leaders plus hollowed-out parties are a bad recipe for democracy",
        "description": "The writer is a professor of <b>politics</b> at Princeton University ... such as France Unbowed (La France Insoumise), Podemos in Spain and Momentum in the <b>UK</b>. This membership, though, was not rooted in stable milieus and, most tellingly, new movements such ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/middle-east/gaza-war-unrwa-aid-revoked-uk-palestine-b2486113.html",
        "title": "UN agency in Gaza on brink of collapse after ‘shocking’ decisions to halt aid, says chief",
        "description": "US, UK and other countries have pulled funding from UN agency for Palestinians over allegations its workers participated in 7 October Hamas terror attack"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860619/tory-plotters-rishi-sunak-may-coup-comment",
        "title": "Tory plotters warned that May day coup against Rishi Sunak is &#39;too late&#39; to oust the PM",
        "description": "But as another week in <b>politics</b> begins, Tory MPs are looking at what happens ... But the biggest worry of all is Wellingborough which has become a test for how far Reform <b>UK</b>&#39;s vote has grown. Currently Richard Tice&#39;s party is getting between 9 and 13 ..."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1860635/Jonathan-Dimbleby-assisted-dying-esther-rantzen",
        "title": "Jonathan Dimbleby declares &#39;tide is turning&#39; on assisted dying as he backs Esther Rantzen",
        "description": "Almost 85,000 people have now backed our push in conjunction with charity Dignity in Dying and lifelong campaigner Dame Esther Rantzen, 83, who has terminal lung cancer."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/children-live-poverty-cornwall-parents-9058235",
        "title": "Children live in poverty in Cornwall as parents struggle to pay bills",
        "description": "The figures come as nearly one in three children are living in poverty in Cornwall. The latest official figures show that a shocking 31 per cent of children in Cornwall are living below the breadline - up from 29 per cent in 2014/15, and the highest figure in at least eight years."
    },
    {
        "url": "https://www.thenational.scot/politics/24079406.covid-inquiry-jason-leitch-latest-victim-uk-smear-campaign/",
        "title": "Covid Inquiry: Jason Leitch is the latest victim of <b>UK</b> smear campaign",
        "description": "I REALLY felt heartfelt sick at the, in my view, wholly undeserved flak that National Clinical Director of Healthcare for the Scottish"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/so-called-hate-crime-law-could-be-used-to-stop-the-display-of-the-union-flag-in-northern-ireland-4495700",
        "title": "So-called hate crime law &#39;could be used to stop the display of the Union flag&#39; in Northern Ireland",
        "description": "The FSU&#39;s gathering in Belfast on Friday night, with Toby Young holding the microphone An FSU spokesperson said the ‘speakeasy’ meeting in Belfast was “its largest regional event, anywhere in the <b>UK</b>,” and ... of identity <b>politics</b>, and served ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/ian-blackford-insists-nicola-sturgeon-and-humza-yousaf-trusted-by-public-as-labour-surges-to-biggest-lead-over-snp-for-a-decade-4495575",
        "title": "Ian Blackford insists Nicola Sturgeon and Humza Yousaf trusted by public as Labour surges to biggest lead over SNP for a decade",
        "description": "Ian Blackford has insisted Nicola Sturgeon and Humza Yousaf are trusted by the public as a poll found Labour had surged to its biggest lead over the SNP for a decade. Research by Nostat put Labour on 36 per cent, up three points since its last poll in October, with the SNP on 33 per cent, down four points."
    },
    {
        "url": "https://www.scotsman.com/news/politics/humza-yousaf-urged-to-order-ministerial-code-probe-into-himself-over-whatsapp-scandal-4495680",
        "title": "Humza Yousaf urged to order ministerial code probe into himself over Whatsapp scandal",
        "description": "Humza Yousaf has been urged to order an investigation into himself over statements made about deleted WhatsApp messages. It follows his appearance before the UK Covid-19 Inquiry, where the First Minister appeared to admit deleting WhatsApp messages, despite previously claiming otherwise."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/national/24079760.uk-undaunted-houthis-target-hms-diamond-shapps-says/",
        "title": "<b>UK</b> ‘undaunted’ after Houthis target HMS Diamond, Shapps says",
        "description": "Grant Shapps has said the UK remains “undaunted” after Iran-backed Houthis targeted the HMS Diamond in the Red Sea during their latest round of strikes. Crew on the ship shot down a drone deployed by the Yemen-based group, which appears undeterred despite UK-US military action against the rebels earlier this week."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/head-of-unrwa-calls-on-countries-to-reconsider-shocking-pause-in-gaza-funding-367699/",
        "title": "Head of UNRWA calls on countries to reconsider ‘shocking’ pause in Gaza funding",
        "description": "displacement and <b>political</b> crises in the region.” The <b>UK</b> Foreign Office said earlier in a statement that it was “appalled” by allegations against UNRWA staff and would temporarily halt funding while an investigation takes place. The relief agency has ..."
    },
    {
        "url": "https://www.theguardian.com/science/2024/jan/28/climate-scientist-mark-maslin-we-have-all-the-technology-we-need-to-move-to-a-cleaner-renewable-world?ref=upstract.com",
        "title": "Climate scientist Mark Maslin: ‘We have all the technology we need to move to a cleaner, renewable world’",
        "description": "The professor of Earth system science on the hottest year on record, using humour – with a little help from Jo Brand – to get his message across, and why there are reasons to be positive"
    },
    {
        "url": "https://news.stv.tv/politics/yousaf-urged-to-order-ministerial-code-probe-into-himself-over-whatsapp-claim",
        "title": "Yousaf urged to order ministerial code probe into himself over WhatsApp claim",
        "description": "This week the <b>UK</b> Covid-19 Inquiry heard Humza Yousaf had deleted WhatsApp messages in line with guidance issued by the Scottish Government, although these were later recovered from another device. Following reports last year he had erased the messages ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7141423",
        "title": "<b>Politics</b> latest: &#39;Stop messing around&#39; - Badenoch issues warning to Tory rebels; the pledge &#39;haunting&#39; Labour",
        "description": "He said: &quot;I urge the <b>UK</b> government to commit to standing with South Africa ... of the Post Office&#39;s chair in her interview with Trevor Phillips this morning, our <b>political</b> correspondent Rob Powell says. She confirmed he was asked to go and &quot;clearly ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24078542.humza-yousaf-became-target-global-right-wing-conspiracy/?ref=fbshr",
        "title": "How Humza Yousaf became the target of a global right wing conspiracy",
        "description": "This is a far-right, white-nationalist conspiracy theory, first concocted in France but later spread to the United States and <b>UK</b>, claiming that unspecified ... in the feverish cauldron of Scottish online <b>politics</b>, as evidence that Yousaf thought there ..."
    },
    {
        "url": "https://uk.news.yahoo.com/stop-using-workers-political-pawns-114000103.html",
        "title": "Stop using the workers as ‘<b>political</b> pawns’ – Jill Weir",
        "description": "Jill referenced assurances given in 2019 that health workers would never face pay disparities with <b>UK</b> counterparts again - but this has ... rising public opinion that workers are being used as “<b>political</b> pawns” by Northern Ireland Secretary of State ..."
    },
    {
        "url": "https://www.burytimes.co.uk/news/national/uk-today/24079764.kemi-badenoch-asks-public-not-hound-ex-post-office-bosses/",
        "title": "Kemi Badenoch asks public to not hound ex-Post Office bosses",
        "description": "He had been tasked with leading the board of directors as the business reels from the fallout of what has been described as the <b>UK</b>’s biggest miscarriage of justice. The Post Office prosecuted more than 700 branch managers between 1999 and 2015 after ..."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24079755.vue-odeon-cineworld-cinemas-banned-food-drink-items/",
        "title": "Vue, Odeon and Cineworld cinemas banned food &amp; drink items",
        "description": "All our cinemas display the necessary signage, advising customers of this policy&quot;. Showcase, which has just 17 cinemas in the <b>UK</b>, said it does not allow guests to bring &quot;hot food, alcoholic beverages and drinks in glass containers into our buildings&quot;."
    }
]