[
    {
        "url": "https://uk.news.yahoo.com/cummings-considering-run-indiana-attorney-232500660.html",
        "title": "Cummings considering run for Indiana Attorney General",
        "description": "Depending on the fate of Indiana Attorney General Todd Rokita in the coming weeks, Madison County Prosecutor Rodney Cummings is interested in the position. Last year Cummings announced he was seeking the Republican Party nomination for the 5th Congressional District but later withdrew from the race."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/?ico=related-posts",
        "title": "Adam Hills rages that government should be ‘f***ing ashamed’ over Gaza in blistering rant",
        "description": "‘No matter what side of <b>politics</b> you’re on, or what you think about what ... If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.<b>uk</b> entertainment team by emailing us celebtips@metro.co.<b>uk</b>, calling 020 3615 2145 or ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/24/gen-z-making-deadly-hurricanes-kill-thousands-fun-20332588/?ico=zone-widget_home_platform",
        "title": "Gen Z are making up deadly hurricanes that kill thousands… just for fun",
        "description": "It was 6am in Honduras when Tropical Storm Jose, hovering dangerously close to the coast, was officially declared a hurricane. Six hours later, as 110mph winds whipped the Caribbean Sea into a furious lather, it was upgraded to a Category 2 storm."
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-child-activity-workers-legally-obliged-report-child-sexual-abuse-1723604",
        "title": "<b>UK</b> Child Activity Workers To Be &#39;Legally Obliged&#39; To Report Child Sexual Abuse",
        "description": "UK&#39;s sex offense laws are going to be strengthened with stricter child sexual abuse law which makes it a punishable offence to hide any child sexual exploitation leading to prison term."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/24141549.labour-demands-truss-anderson-lose-whip-pair-rebuked-senior-tory/",
        "title": "Labour demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth condemned remarks made by the pair"
    },
    {
        "url": "https://uk.news.yahoo.com/uk-vows-support-ukraine-until-223000957.html",
        "title": "<b>UK</b> vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "<b>UK</b> <b>political</b> leaders have marked the second anniversary of the war in Ukraine by vowing to stand with Kyiv “until they prevail”. Prime Minister Rishi Sunak said “tyranny will never triumph” as President Volodymyr Zelensky’s troops defend the ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68379673",
        "title": "Government backs crackdown on spurious legal actions",
        "description": "Proposals to crack down on spurious legal claims used to silence journalists and other critics have been backed by the government. Strategic Lawsuits Against Public Participation, known as Slapps, are often used by rich individuals to stop the exposure of wrongdoing."
    },
    {
        "url": "https://www.constructionnews.co.uk/sections/long-reads/opinion/a-year-of-procurement-politics-and-productivity-lies-ahead-23-02-2024/",
        "title": "A year of procurement, <b>politics</b> and productivity lies ahead",
        "description": "Simon Toplass is group CEO of Pagabo and The 55 Group The move into a new year is always a time for reflection, but equally for a look to the future, and"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/23/uk-politics-live-latest-news-updates-rishi-sunak-keir-starmer-speaker-lindsay-hoyle?page=with:block-65d871368f086f23f6db1c38",
        "title": "James Cleverly says politicians should not make decisions based on ‘fear or favour’ – <b>UK politics</b> live",
        "description": "The fallout over a Gaza ceasefire motion on Wednesday has highlighted risks faced by MPs"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68377468",
        "title": "Gaza vote chaos highlights pressure on MPs",
        "description": "&quot;Be that from the angry crowd that was gathered around while the vote was taking place last night, or the increasing levels of intimidation that MPs are facing at their homes, out"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/22/lindsay-hoyle-speaker-conservatives-gaza-rishi-sunak-labour-keir-starmer-uk-politics-live?filterKeyEvents=true&page=with%3Ablock-65d7388e8f08aff1ffae33ae",
        "title": "<b>Uk politics</b>: Sunak ‘concerned’ over Hoyle’s rule change but gives credit over speaker’s apology – as it happened",
        "description": "She says to suggest that the “shameful events” that took place yesterday were anything other than party <b>politics</b> is to do a disservice to the house. She says it fell to the government to defend the rights of a minority party (the SNP) in the house."
    },
    {
        "url": "https://www.cheshire-live.co.uk/news/chester-cheshire-news/man-arrested-after-assault-bus-28663195?int_source=nba",
        "title": "Man arrested after assault on bus in Warrington",
        "description": "A man has been arrested on suspicion of assault after an incident on a bus in Warrington. Police said a 31-year-old man had been arrested after being escorted off the number 3 bus by security after what they described as a &quot;suspicious incident&quot;. The ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68388542",
        "title": "Ukraine war: <b>UK</b> reaffirms Ukraine support on war anniversary",
        "description": "Political leaders in the UK have reaffirmed their support for Ukraine ahead of the second anniversary of Russia&#39;s full-scale invasion. Prime Minister Rishi Sunak said Britain was prepared to do &quot;whatever it takes, for as long as it takes&quot; to help Ukraine achieve victory."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-ashworth-liz-truss-rishi-sunak-labour-steve-bannon-b1141263.html",
        "title": "Labour demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth condemned remarks made by the pair as ‘egregious’."
    }
]