[
    {
        "url": "https://www.dailymail.co.uk/home/books/article-12980337/inside-mind-putin-west-understand-wizard-kremlin-empoli.html",
        "title": "Inside the mind of Putin... and why the West can never understand him: PETER HITCHENS reviews The Wizard Of The Kremlin",
        "description": "Though this is a work of fiction, it is based very closely on reality, and I doubt I have anywhere seen a cleverer portrayal of the Russian view of power, <b>politics</b> and the world, or a better explanation of how the colourless, secret police bureaucrat Putin ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24060229.richard-murphy-rachel-reeves-no-idea-scottish-firms-want/",
        "title": "Richard Murphy: Rachel Reeves has no idea what Scottish firms want",
        "description": "I GROANED when I heard Rachel Reeves say that she had gone to Davos to make clear that Labour were going to make the <b>UK</b> a good place to do business ... in the 45 or more years that I have observed the <b>political</b> scene. The second, more pragmatically ..."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/biggest-strike-in-nis-recent-history-under-way-as-tens-of-thousands-walk-out-JJVXWKQX4VNS3LQPBMMKMHFH74/",
        "title": "‘My members are angry’- biggest strike in Northern Ireland’s recent history as tens of thousands walk out",
        "description": "The biggest strike in Northern Ireland’s recent history is under way. An estimated 150,000 public sector workers are taking part in the walkouts over pay. Northern Ireland Secretary Chris Heaton-Harris has been urged to intervene to release funding to make delayed pay awards in the absence of devolved government."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/recep-tayyip-erdogan-humza-yousaf-first-minister-cameron-scotland-b1133275.html",
        "title": "Yousaf defends inviting Turkish leader Erdogan to Scotland",
        "description": "The Humanist Society Scotland hit out at the invitation, with chief executive Fraser Sutherland saying: “This is a very short-sighted invite from the First Minister. Under President Erdogan Turkey has seen a sustained attack on civil liberties and human rights."
    },
    {
        "url": "https://www.mirror.co.uk/sport/other-sports/nfl-decision-teams-hard-knocks-31915859",
        "title": "NFL &#39;Hard Knocks&#39; 2024 team options as league faces selection decision",
        "description": "The NFL has a decision to make over its flagship &quot;Hard Knocks&quot; series, with three teams in the running to be the focus of the fly-on-the-wall documentary in training camp this summer"
    },
    {
        "url": "https://news.sky.com/story/150-000-public-sector-workers-walk-out-in-northern-irelands-biggest-strike-in-recent-history-13051183",
        "title": "150,000 public sector workers walk out in Northern Ireland&#39;s biggest strike in recent history",
        "description": "From early morning, striking workers braved sub-zero temperatures to gather at picket lines across Northern Ireland. Pay parity with the rest of the UK is the core issue for workers angry at a widening wage gap and political paralysis."
    },
    {
        "url": "https://news.sky.com/story/david-cameron-dismisses-nadine-dorries-claims-of-plot-for-him-to-return-as-tory-leader-13051172",
        "title": "David Cameron dismisses Nadine Dorries claims of &#39;plot&#39; for him to return as Tory leader",
        "description": "The foreign secretary says Nadine Dorries is a &quot;much better novelist than a political forecaster&quot; after she claimed there was a plan for him to replace Rishi Sunak if Labour defeat the Tories."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/18/tory-donor-post-office-scandal-government-role-pamdemic/",
        "title": "Tory donor embroiled in Post Office scandal given government role",
        "description": "A Tory donor caught up in the Post Office scandal was given a non executive government role on the Board of the UK Health Security Agency (UKHSA)."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/northern-ireland-strikes-unions-warn-28469842",
        "title": "Northern Ireland strikes: Unions warn of more action to come as tens of thousands take to the streets",
        "description": "More strike action is on the cards across Northern Ireland unless public sector workers receive their long-awaited pay award. That was the rallying cry on Thursday as tens of thousands of public sector workers took to the streets across Northern Ireland in what was billed as the largest strike here in 50 years."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12979911/Peter-Thiel.html",
        "title": "Peter Thiel says we are living in a &#39;very strange postmodern world&#39; - where the public do not trust any of the &#39;lies we are being told&#39; - but fail to focus on the important things",
        "description": "In the rare interview, Thiel also suggested <b>UK</b> prime minister Rishi Sunak and opposition leader ... Thiel had become synonymous with right-wing <b>politics</b> in America. However, Vance was one of his few successes in the 2022 midterms despite donating over ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24059069.lee-anderson-spare-thought-wee-soul/",
        "title": "Lee Anderson: Spare a thought for the wee soul",
        "description": "The Conservative rebellion against the government&#39;s new Rwanda bill evaporated yesterday, with fewer Tory back benchers voting against the bill"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24060125.us-strikes-houthi-rebels-will-continue-says-biden/",
        "title": "US strikes against Houthi rebels will continue, says Biden",
        "description": "The comments came on the same day the Houthi rebels’ supreme leader vowed that attacks on ships in the Red Sea and the Gulf of Aden will continue."
    },
    {
        "url": "https://www.lbc.co.uk/news/nearly-6000-migrants-missing-failed-asylum-applications/",
        "title": "Nearly 6,000 migrants missing after asylum applications failed, Home Office admits",
        "description": "Close to 6,000 migrants have disappeared after their asylum applications were withdrawn, the Home Office has said."
    },
    {
        "url": "https://www.modernghana.com/news/1286490/uk-pm-says-controversial-rwanda-plan-is-will-of.html",
        "title": "<b>UK</b> PM says controversial Rwanda plan is &#39;will of the people&#39;",
        "description": "Rishi Sunak on Thursday urged members of the UK&#39;s unelected upper chamber of parliament to pass his contentious plan to send migrants to Rwanda, insisting it was the will of the people ."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/18/asylum-seekers-react-to-passing-of-rwanda-bill",
        "title": "‘We are just being used’: asylum seekers react to passing of Rwanda bill",
        "description": "While Tory infighting has dominated headlines, people threatened with removal say their views are being ignored"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/striking-images-define-modern-britain-31915204",
        "title": "These striking images which &#39;define modern Britain&#39; have won a prestigious award",
        "description": "A photograph of a lady at home, decked out in a full Union Jack outfit, and a picture of a young refugee from Eritrea in front of a global flag display at school define modern Britain"
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-first-rwanda-flight-may-2862597?ico=above_article_ticker",
        "title": "Rishi Sunak targets May for first Rwanda flight",
        "description": "Government privately presents Lords timeline which would see PM&#39;s &quot;emergency&quot; laws to save the policy enacted by Easter"
    },
    {
        "url": "https://www.opendemocracy.net/en/covid-care-homes-scotland-inquiry-test-hospital-patients-discharge-deaths/",
        "title": "Scotland ‘waited too long’ to test patients discharged to care homes for Covid",
        "description": "Care home deaths soared as Holyrood took two months to introduce testing for outgoing hospital patients, inquiry hears"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68021267",
        "title": "Lord Cameron tells Iranian minister Red Sea raids &#39;must end&#39;",
        "description": "Responding on social media, Mr Amir-Abdollahian said he told Lord Cameron that &quot;America and England should immediately stop supporting the war crimes of the Zionist apartheid regime against the Palestinians&quot; - a reference to western backing for Israel&#39;s right to respond to Hamas&#39;s terror attack on 7 October."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-67982624?at_format=link&at_campaign_type=owned&at_link_type=web_link&at_bbc_team=editorial&at_link_origin=BBC_News_NI&at_ptr_name=facebook_page&at_medium=social&at_link_id=1EE4115C-B5D0-11EE-A2D8-48E754826ABF&at_campaign=Social_Flow",
        "title": "Public sector strike: &#39;Why is Northern Ireland the poor neighbour?&#39;",
        "description": "&quot;We are not being paid in line with inflation, we are not being paid the same as the <b>UK</b>, so teachers in Scotland are actually ... make myself and others feel like we&#39;re pawns in a game of <b>politics</b> which is unfair. &quot;It&#39;s disadvantaging us for reasons ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tory-popularity-rishi-sunak-polls-rwanda-b2481126.html",
        "title": "John Rentoul answers your questions as Tory popularity plummets in the polls",
        "description": "With so much contradictory information out there, chief political commenator John Rentoul has been answering reader questions on the polls, Conservative popularity amid the Rwanda bill vote and Labour"
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/ill-get-as-much-as-i-can-hunt-vows-to-pursue-fujitsu-for-compensation",
        "title": "&#39;I&#39;ll get as much as I can&#39;: Hunt vows to pursue Fujitsu for compensation",
        "description": "Since then, while Meta has reduced its <b>UK</b> footprint, Microsoft has committed to building data centres. Hunt sees signs of progress. Have you heard our new podcast Talking <b>Politics</b>? Every week Tom, Robert and Anushka dig into the biggest issues dominating ..."
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24060082.lives-saved-uncertainty-caused-guidance-inquiry-told/",
        "title": "Lives could have been saved but for uncertainty caused by guidance, inquiry told",
        "description": "Dr Donald Macaskill, chief executive of Scottish Care, said he had ‘absolutely no doubt’ that deaths could have been avoided."
    },
    {
        "url": "https://www.newsletter.co.uk/education/northern-ireland-strike-newtownabbey-mum-of-boy-with-special-needs-says-strike-caused-four-meltdowns-at-home-4484252",
        "title": "Northern Ireland strike: Newtownabbey mum of boy with special needs says strike caused &#39;four meltdowns&#39; at home",
        "description": "The Newtownabbey mother of a child with special needs said she was &quot;ready to march to Stormont herself&quot; after her son suffered four “meltdowns” during today’s mass strike."
    },
    {
        "url": "https://news.stv.tv/politics/scottish-government-made-same-mistakes-twice-during-pandemic-inquiry-hears",
        "title": "Covid Inquiry: Scottish Government &#39;made same mistakes twice&#39; during pandemic",
        "description": "The Scottish Government appeared to make “exactly the same mistakes twice” when dealing with the pandemic in 2020, an inquiry has heard. Professor Paul Cairney questioned whether the Government learned from experience and said there was a “rhetoric of learning that does not match reality”."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/18/rishi-sunak-press-conference-rwanda-bill-conservatives-labour-fujitsu-post-office-horizon-uk-politics-latest?page=with:block-65a956cf8f082472faf423f4",
        "title": "Rishi Sunak challenges House of Lords to accept ‘the will of the people’ and pass Rwanda bill – <b>UK politics</b> live",
        "description": "Rishi Sunak gave his press conference in No 10, and he was ostensibly talking about government policy, but in reality that was a party <b>political</b> event, where Sunak was rehearsing messages we are likely to hear endlessly as the year goes on. Politicians ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-sussex-68018928",
        "title": "Hastings: New leader urges fractured council to find &#39;common ground&#39;",
        "description": "Green councillor Julia Hilton became leader of Hastings Borough Council on Wednesday and will form a cabinet with the Independent group. Ms Hilton said she was someone people could trust and had put herself forward after months of political turmoil. She said she hoped the council could &quot;find common ground&quot;."
    },
    {
        "url": "https://www.ft.com/content/faa3429d-c55a-4e83-a68d-83cfa67d5881",
        "title": "Hipgnosis Songs Fund adviser offers to drop clause on music rights",
        "description": "Merck Mercuriadis, adviser to Hipgnosis Songs Fund, has offered to drop a controversial clause giving him the right to buy the group’s music portfolio as he battles to stay on at the investment trust he founded."
    },
    {
        "url": "https://www.heraldscotland.com/news/24059997.uk-covid-inquiry-scottish-government-kept-appearances/?ref=yahoo",
        "title": "<b>UK</b> Covid Inquiry: How Scottish Government kept up appearances",
        "description": "raises questions about the intersection of <b>political</b> messaging and crisis governance. Navigating the complexities of pandemic governance, the Scottish Government also encountered challenges similar to those experienced at the <b>UK</b> level. Changes to how ..."
    },
    {
        "url": "https://inews.co.uk/opinion/rwanda-bill-fyre-festival-2861331?ico=related_stories",
        "title": "The Rwanda bill has turned into the <b>political</b> equivalent of Fyre Festival",
        "description": "There was widespread opposition but then the <b>UK</b> Supreme Court ruled the scheme was unlawful ... If something feels like it’s morphing into the <b>political</b> equivalent of the famous Fyre Festival, step away. “Something must be done” shouldn’t mean ..."
    },
    {
        "url": "https://uk.news.yahoo.com/emily-ratajkowski-no-longer-cares-200000000.html",
        "title": "Emily Ratajkowski no longer cares about critics of her skimpy outfits",
        "description": "She added in an interview with Glamour <b>UK</b> magazine: “So, if I am in a certain type of mood ... and has “bigger fish to fry than caring about the <b>politics</b> of whether or not I’m appealing to the male gaze in a given moment”. She said: “I guess ..."
    },
    {
        "url": "https://bylinetimes.com/2024/01/18/reform-uk-limited-the-political-business-brought-to-you-by-billionaires/",
        "title": "Reform <b>UK</b> Limited: The <b>Political</b> Business Brought to You by Billionaires",
        "description": "Despite its wealthy backers and blanket media coverage, few have peered under the bonnet of Reform UK. It&#39;s time to take a look at its backers."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857105/reform-uk-yougov-poll-richard-tice",
        "title": "Richard Tice hails new poll as Reform <b>UK</b> hits highest-ever level of support",
        "description": "Mr Tice has warned he will not enter into an electoral pact with the Conservatives. It comes amid speculation over whether Nigel Farage, who is honorary president of Reform <b>UK</b>, will make a <b>political</b> comeback."
    },
    {
        "url": "https://uk.news.yahoo.com/gop-senator-says-conservatives-might-195827364.html",
        "title": "GOP senator says some conservatives might scuttle a bipartisan immigration-Ukraine deal to stick it to Biden",
        "description": "Republican Sen. James Lankford, the leading GOP lawmaker on bipartisan immigration talks, said that some conservatives want to tank a potential deal over concern that it could hand President Joe Biden a <b>political</b> win. &quot;There are some that are saying ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1856834/poll-reform-uk-general-election",
        "title": "POLL: Do you think Reform <b>UK</b> has a chance at the next general election? Vote here",
        "description": "Readers can vote in our online survey on whether you think the Nigel Farage-linked party stands a chance when the country goes to the polls."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-house-lords-rwanda-bill-b2481090.html",
        "title": "Rishi Sunak set for titanic battle with Lords over Rwanda bill",
        "description": "PM warns peers not to ‘frustrate the will of the people’ by opposing his flagship ‘stop the boats’ legislation – as support for the Tories hits a new low with poll putting Labour 27 points ahead"
    },
    {
        "url": "https://www.ft.com/content/eceb77d7-c12e-4d6b-97ad-693a0a4c1f2f?sharetype=gift",
        "title": "Is the tide finally turning for unloved <b>UK</b> stocks?",
        "description": "To say the UK stock market has fallen out of favour in recent years is something of an understatement. At this point, it is looking rather friendless. But some plucky diehards are asking the question one more time with feeling: is it time to buy UK stocks?"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/18/netanyahu-tells-the-us-he-opposes-a-two-state-solution/",
        "title": "Netanyahu tells the US he opposes a two-state solution",
        "description": "Israeli PM says Palestinian statehood ‘collides with the idea of sovereignty’ and he reserves the right to ‘say no to our friends’"
    },
    {
        "url": "https://www.helensburghadvertiser.co.uk/news/national/24060095.netanyahu-says-told-us-opposes-palestinian-state-postwar-scenario/",
        "title": "Netanyahu says he has told US he opposes Palestinian state in postwar scenario",
        "description": "Israeli Prime Minister Benjamin Netanyahu has rejected US calls to scale back Israel’s military offensive in the Gaza Strip or take steps towards the establishment of a Palestinian state after the war, drawing an immediate scolding from the White House."
    },
    {
        "url": "https://www.thenational.scot/news/24059634.bbc-criticised-prioritising-royals-health-news-politics/",
        "title": "BBC criticised for prioritising royals health news over <b>politics</b>",
        "description": "THE BBC has been criticised for treating the royal family as “more important than every other person” after prioritising their medical"
    },
    {
        "url": "https://uk.news.yahoo.com/following-science-scottish-government-kept-172821196.html",
        "title": "&#39;Following the science&#39;: How Scottish Government kept up appearances during Covid",
        "description": "There has been cautious praise for the response of the SNP-led Scottish Government to the pandemic yet suspicion remains that the positive impression was rooted in comparisons to Westminster."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68022076",
        "title": "Seized Russian money could help Ukraine - Cameron",
        "description": "There is a “moral, political, legal, and economic case” for using money seized from Russia to help rebuild Ukraine, says the UK foreign secretary."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1857276/rishi-sunak-rwanda-house-of-lords",
        "title": "Rishi Sunak warns House of Lords against blocking Rwanda laws",
        "description": "Steely Rishi Sunak issued a clear warning to unelected peers that they must not &quot;frustrate the will of the people&quot; by blocking Rwanda laws."
    },
    {
        "url": "https://morningstaronline.co.uk/article/human-rights-campaigners-slam-bitterly-disappointing-rwanda-vote",
        "title": "Human rights campaigners slam &#39;bitterly disappointing&#39; Rwanda vote",
        "description": "HUMAN rights campaigners hit out today after a “bitterly disappointing” parliamentary vote in favour of the Tories’ Rwanda policy. Prime Minister Rishi Sunak’s “shameful” legislation passed its third reading in the Commons on Wednesday night by 44 votes."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/home-office-loses-track-of-nearly-6000-asylum-seekers",
        "title": "Home Office loses track of nearly 6,000 asylum seekers who &#39;remain in the <b>UK</b>&#39;",
        "description": "The migrants &#39;remain in the UK and the Home Office is taking steps to urgently re-establish contact with them,&#39; the disclosure to MPs revealed. | ITV National News"
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24050402.letter-environment-agency-must-take-responsibility-flooding/",
        "title": "Letter: Environment Agency must take responsibility for flooding",
        "description": "Is it not time for the Regional Rivers Boards to be set up again to deal, properly and effectively, with the flooding problem.  If the"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/changing-school-holidays-can-improve-28467225",
        "title": "&#39;Changing school holidays can improve school attendance&#39;",
        "description": "We know wellbeing suffers during overly long school terms. We also know wellbeing affects school attendance. What if changing a school year designed for a bygone era to make it more in-line with how we all live our lives today could help get children back in the classroom?"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-battle-lords-rwanda-b2481090.html",
        "title": "Rishi Sunak set for titanic battle with Lords over Rwanda bill",
        "description": "Sunak warns peers not to ‘frustrate the will of the people’ by opposing his flagship Stop the Boats legislation - as support for Tories hits new low with poll putting Labour 27 points ahead"
    },
    {
        "url": "https://www.hl.co.uk/news/articles/five-sustainability-themes-for-2024-and-beyond",
        "title": "Five sustainability themes for 2024 and beyond",
        "description": "Momentum on sustainability stalled in 2023. After years of progress, the UK government have chipped away at legislation for protecting the environment. They’ve delayed plans to prohibit the sale of new combustion engine-powered cars, and are granting more oil &amp; gas exploration licences."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24059821.grey-squirrels-sapping-efforts-combat-climate-change-parliament-told/",
        "title": "Grey squirrels sapping efforts to combat climate change, Parliament told",
        "description": "The damage caused by the bark-stripping pests means landowners are not planting the trees needed in the drive to reach net zero."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24058936.jump-searches-enlarged-prostate-following-kings-revelation/",
        "title": "Jump in searches for ‘enlarged prostate’ following King’s revelation",
        "description": "There has been a significant increase in searches for an “enlarged prostate” on the NHS website after the King shared his diagnosis, new figures show. The NHS website’s prostate enlargement page received more than 11 times as many visits on Wednesday compared to Tuesday."
    },
    {
        "url": "https://www.heraldscotland.com/politics/westminster/24059809.rishi-sunak-insisted-tories-completely-united/",
        "title": "Rishi Sunak has insisted the Tories are &#39;completely united&#39;",
        "description": "Rishi Sunbak has insisted his party is “completely united” and has “come together” over the flagship Rwanda policy, despite a week"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/18/rishi-sunak-press-conference-rwanda-bill-conservatives-labour-fujitsu-post-office-horizon-uk-politics-latest?filterKeyEvents=false&page=with:block-65a962bf8f082472faf424ae",
        "title": "Rishi Sunak challenges House of Lords to accept ‘the will of the people’ and pass Rwanda bill – <b>UK politics</b> live",
        "description": "Prime minister says he wants first flight to leave ‘as soon as practicably possible’ but will not give date"
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/northern-ireland-strikes-live-updates-28467145",
        "title": "Northern Ireland strikes LIVE updates as rallies take place in &#39;biggest ever&#39; industrial action",
        "description": "As public sector workers take to the picket lines in the biggest day of industrial action in Northern Ireland in around 50 years, a range of services will be impacted. The strike action will impact our hospitals, schools, public transport and driving on the roads, bringing many services in the region to a standstill."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68023517.amp",
        "title": "Rwanda bill passes but poll gloom still haunts PM",
        "description": "Rishi Sunak wasn&#39;t defeated over his key policy, but there are no certainties for the PM as the bill heads to the Lords."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68018470",
        "title": "Bridges near to falling down, warns council leader",
        "description": "Bridges in Monmouthshire are &quot;near to falling down&quot;, after more than a decade of cuts to its highways budget, the local council leader has warned. Mary Ann Brocklesby said squeezing such infrastructure spending for too long would &quot;come back to haunt us&quot;."
    },
    {
        "url": "https://www.nme.com/news/music/glastonbury-and-lana-del-rey-tickets-among-freebees-mps-declared-in-2023-3573098",
        "title": "Glastonbury and Lana Del Rey tickets among freebees MPs declared in 2023",
        "description": "Glastonbury and Lana Del Rey tickets have been revealed as some of the freebees MPs declared during last year."
    },
    {
        "url": "https://inews.co.uk/opinion/rwanda-bill-fyre-festival-2861331?ico=more_from_this_author",
        "title": "The Rwanda bill has turned into the <b>political</b> equivalent of Fyre Festival",
        "description": "The Rwanda chapter should be a lesson. If something feels like it’s morphing into the political equivalent of the famous Fyre Festival, step away. “Something must be done” shouldn’t mean losing your mind – and a shed load of taxpayers’ cash."
    },
    {
        "url": "https://www.globalreinsurance.com/home/rising-political-risk-for-emerging-market-manufacturing-hubs-verisk-maplecroft/1450930.article",
        "title": "Rising <b>political</b> risk for emerging market manufacturing hubs - Verisk Maplecroft",
        "description": "Heightened political risks are overshadowing a &#39;friendshoring&#39; shift, according to report data from Verisk Maplecroft."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/01/18/irish-meps-criticise-wording-of-conditional-eu-call-for-gaza-ceasefire/",
        "title": "Irish MEPs criticise wording of ‘conditional’ EU call for Gaza ceasefire",
        "description": "Irish MEPs have said they did not vote in favour of a European Parliament motion that called for a Gaza ceasefire because two conditions attached to it rendered it “meaningless”."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-renews-calls-warm-home-plan-5000-excess-cold-deaths",
        "title": "Labour Says Spike In Cold Deaths Underlines Urgency Of Home Insulation Scheme",
        "description": "Labour has renewed calls for better home insulation in response to the &#39;appalling and avoidable&#39; increase in excess death estimates due to cold,"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24059277.thousands-jobs-risk-tata-presses-ahead-plan-close-furnaces/",
        "title": "Thousands of jobs at risk as Tata ‘presses ahead with plan to close furnaces’",
        "description": "Unions will consult their members on how to respond to job losses in south Wales, with industrial action not being ruled out."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/24059433.charity-pool-night-colwyn-bay-feature-former-world-champion/",
        "title": "Charity pool night in Colwyn Bay to feature former world champion",
        "description": "The Colwyn Bay Legion social club, on Coed Pella Road, will host a charity pool night on Friday, March 8 from 7.30pm. Tickets cost £5 per person, with proceeds to be donated to Prostate Cancer UK. Former world champion pool player Carl Morris will be the event’s special guest, and attendees will have the chance to take him on."
    },
    {
        "url": "https://news.sky.com/story/mps-request-urgent-meeting-with-security-minister-after-threat-to-life-warnings-given-to-uk-sikhs-13050997",
        "title": "MPs request &#39;urgent&#39; meeting with security minister after &#39;threat to life warnings&#39; given to <b>UK</b> Sikhs",
        "description": "There are growing concerns about India&#39;s attitude to the Sikh community worldwide. The government in India dislikes the Khalistan movement, which wants a free Sikh state to be established."
    },
    {
        "url": "https://www.irishnews.com/news/politics/some-people-who-share-fake-news-on-social-media-actually-think-theyre-helping-the-world-YRBT6EAWBFGEJBSB47JCSF6UAE/",
        "title": "Some people who share fake news on social media actually think they’re helping the world",
        "description": "Only a minority of people share false information but, given the vast scale of social media platforms, even that can lead to fake stories spreading like wildfire. This makes it harder for people to get news they can trust and leads people to believe things that simply aren’t true."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scottish-government-government-edinburgh-nicola-sturgeon-jeane-freeman-b1133249.html",
        "title": "Scottish Government ‘made same mistakes twice’ during pandemic, inquiry told",
        "description": "The Scottish Government appeared to make “exactly the same mistakes twice” when dealing with the pandemic in 2020, an inquiry has heard. Professor Paul Cairney questioned whether the Government learned from experience and said there was a “rhetoric of learning that does not match reality”."
    },
    {
        "url": "https://www.thetimes.co.uk/article/iran-pakistan-strikes-attack-live-latest-news-middle-east-war-8br79sxz0",
        "title": "Iran on high alert after Pakistan launches retaliatory attacks — as it happened",
        "description": "The <b>UK</b> government has not yet commented on the strike by Pakistan ... Tehran is the dominant force in Iraqi <b>politics</b>, yet Baghdad reacted with outrage, recalling its ambassador. Pakistan was similarly angered. Assuming these reactions are genuine ..."
    },
    {
        "url": "https://www.itv.com/news/2024-01-18/scottish-government-bans-xl-bully-dogs",
        "title": "Scottish government introduces ban on XL Bully dogs",
        "description": "The move comes after the country saw an influx of XL Bully dogs being brought to Scotland from south of the border. | ITV National News"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/public-sector-workers-strike-mass-rally-in-belfast-hears-calls-for-northern-ireland-secretary-chris-heaton-harris-to-release-pay-awards-for-workers-and-for-the-dup-to-end-stormont-boycott-4483807",
        "title": "Mass strike rally hears calls for Chris Heaton-Harris to release pay awards",
        "description": "Thousands of public sector workers have taken to the streets across Northern Ireland in the biggest strike action in the region’s recent history."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/18/rishi-sunak-latest-news-rwanda-bill-philp/",
        "title": "<b>Politics</b> latest news: Tory support sinks as Reform <b>UK</b> hits record polling high",
        "description": "Rishi Sunak’s Rwanda Bill should make it through the House of Lords “fairly fast”, a minister said this morning after the flagship legislation cleared the House of Commons last night."
    },
    {
        "url": "https://www.mirror.co.uk/money/jeremy-hunt-says-guard-rails-31912804",
        "title": "Jeremy Hunt says &#39;guard-rails&#39; needed, but calls for &#39;light touch&#39; AI regulation",
        "description": "Speaking at the World Economic Forum event at Davos, the Chancellor of the Exchequer said there was a need for some &quot;guard-rails&quot; around generative AI."
    },
    {
        "url": "https://www.nfuonline.com/updates-and-information/nfu24-see-our-2024-nfu-conference-programme/",
        "title": "NFU24: See our 2024 NFU Conference programme",
        "description": "The NFU&#39;s annual conference returns to the ICC in Birmingham on 20 and 21 February 2024 with expert sessions exploring our theme, ‘British Food: What plan for the future?’."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/michelle-oneill-urges-workers-on-strike-to-not-give-up-and-calls-chris-heaton-harris-dishonest/a1194914890.html",
        "title": "Michelle O&#39;Neill urges workers on strike to &#39;not give up&#39; and calls Chris Heaton-Harris &#39;dishonest&#39;",
        "description": "Sinn Fein vice president Michelle O’Neill met striking workers in Magherafelt. Public sector workers in Northern Ireland have not received pay uplifts given to counterparts elsewhere in the UK, due to the ongoing political impasse at Stormont."
    },
    {
        "url": "https://www.sthelensstar.co.uk/news/national/24059215.government-unveils-subsidy-proposals-support-firms-burning-wood-energy/",
        "title": "Government unveils subsidy proposals to support firms burning wood for energy",
        "description": "The Government has launched proposals to financially support companies generating electricity from burning wood pellets, including Britain’s biggest power station, Drax in North Yorkshire. The consultation, which will run until February 29, will explore if and how it can provide more subsidies to bolster large-scale biomass generators in the UK."
    },
    {
        "url": "https://www.thesun.co.uk/news/25401658/uk-weather-rare-amber-warning-snow/",
        "title": "<b>UK</b> weather: ‘Danger to life’ health alert extended for entire country as snow shuts schools in -14C freeze",
        "description": "A ‘DANGER to life’ health alert has been extended for the entire country as snow shut schools in a -14C freeze. Amber and yellow warnings for snow and ice have been issued by the Met"
    },
    {
        "url": "https://www.middleeasteye.net/news/uk-hizb-ut-tahrir-ban-british-mps-vote-add-islamic-group-terrorism-list",
        "title": "Hizb ut-Tahrir ban: British MPs vote to add Islamic group to terrorism list",
        "description": "UK government accuses Islamic political party of antisemitism over praise for Hamas&#39;s attack against Israel, as motion to ban group passes with no opposition"
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/18/liam-byrne-britain-wealth-owning-democracy-ideal/",
        "title": "Liam Byrne: ‘How Britain can revive the wealth-owning democracy ideal — and secure our future’",
        "description": "As the world’s elite jet home from Davos, they leave one big unanswered question behind. How on earth are we going to fix the gigantic inequality of wealth, now fuelling division, dissent and populist politics around the world?"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rwanda-bill-vote-rishi-sunak-results-tories-b2480641.html",
        "title": "Rwanda bill - latest: Rishi Sunak pleads with House of Lords to back deportation plan – live",
        "description": "Rishi Sunak will hold a press conference this morning after seeing off a rightwing rebellion on his Rwanda plan. The prime minister is expected to give an update on the government’s immigration policies and take questions from the media."
    }
]