[
    {
        "url": "https://www.ross-shirejournal.co.uk/news/national/why-was-rwanda-policy-blocked-by-courts-and-what-is-rishi-sunak-s-plan-b-94673/",
        "title": "Why was Rwanda policy blocked by courts and what is Rishi Sunak’s Plan B?",
        "description": "Rishi Sunak’s promise to the British public was a straightforward one – he vowed to “stop the boats” as thousands of asylum seekers crossed the Channel without authorisation. But as crossings continued, the pledge has been complicated by legal challenges arguing that forcibly removing migrants to Rwanda is against their rights and the law."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/23967801.cautious-consumers-delay-christmas-spending/",
        "title": "Cautious consumers delay Christmas spending",
        "description": "Consumers appear to be sticking to plans for a budget Christmas this year with retail spending remaining weak despite Black Friday, figures show. Total <b>UK</b> retail sales increased by just 2.7% in November, a significant weakening on last November’s 4.2% ..."
    },
    {
        "url": "https://uk.style.yahoo.com/letters-bbc-expect-yet-more-000100378.html",
        "title": "Letters: How can the BBC expect yet more cash from hard-pressed taxpayers?",
        "description": "SIR – Sir Keir Starmer’s praise of Thatcherite ideals (report, December 4) is a last-ditch attempt to make it look like the Labour Party has moved on to the unoccupied <b>political</b> middle ... claims the <b>UK</b> will drop plans to return the Chagos Islands ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/james-cleverly-heading-to-rwanda-to-sign-new-asylum-treaty-2791468?ITO=msn",
        "title": "James Cleverly heading to Rwanda to sign new asylum treaty",
        "description": "He is expected to land in the capital at about 8am <b>UK</b> time, according to reports. Rishi Sunak has been attempting to make his plan to send migrants to the African nation legally watertight after the Supreme Court’s ruling against the policy last month."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-uk-sets-sights-on-house-of-commons-after-poll-shows-party-taking-tory-votes-2791330?ico=related_article_inline",
        "title": "Reform <b>UK</b> sets sights on House of Commons after poll shows party taking Tory votes",
        "description": "Reform UK is aiming to damage the Conservatives all across the country at the next election before picking up Commons seats at the election which follows it, party insiders say. The right-wing party founded by Nigel Farage has reached a record high in the opinion polls, according to a BMG Research survey for i."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/james-cleverly-commons-migration-plan_uk_656e0c6ee4b0dcfcc980e43d?d_id=6954539&ncid_tag=fcbklnkukhpmg00000008",
        "title": "Laughter In The Commons As James Cleverly Hails &#39;Great&#39; Tory Government",
        "description": "It came as the home secretary unveiled a five-point plan to bring down the number of immigrants coming to the <b>UK</b> by 300,000 a year. One of the proposals is to scrap the shortage occupation list, which allows some companies to hire overseas workers for 20% ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/boris-johnson-what-he-said-about-the-big-covid-scandals-during-pandemic-171838909.html",
        "title": "Boris Johnson: What he said about the big COVID scandals during pandemic",
        "description": "The former PM is likely to emphasise the success of the <b>UK</b>&#39;s vaccine programme and ... many people who&#39;d made great sacrifices to follow COVID restrictions were angry at the <b>political</b> establishment for not doing the same. Story continues At the time ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/23963267.brexit-views-labour-conservatives-sadly-similar/",
        "title": "Brexit views of Labour and Conservatives sadly similar",
        "description": "The damage from Brexit is clear so Labour’s stance is curious, especially given Sir Keir’s previously eloquent opposition to the folly back in 2019. Sir Keir has since embraced Brexit. He is ahead in the polls and at times seems terrified of upsetting the apple cart on any front."
    },
    {
        "url": "https://thetab.com/uk/london/2023/12/04/london-students-stage-walkout-against-gender-violence-and-tory-culture-war-51840",
        "title": "London students stage walkout against gender violence and ‘Tory culture war’",
        "description": "UCL was the first <b>UK</b> university to disaffiliate from the LGBTQ+ organisation ... In a statement, UCL Student Socialist Alternative linked the ongoing dispute on campuses to a broader <b>political</b> culture under the Conservative government."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rwanda-james-cleverly-rishi-sunak-kigali-plan-b-b1124763.html",
        "title": "Why was Rwanda policy blocked by courts and what is Rishi Sunak’s Plan B?",
        "description": "Rishi Sunak’s promise to the British public was a straightforward one – he vowed to “stop the boats” as thousands of asylum seekers crossed the Channel without authorisation. But as crossings continued, the pledge has been complicated by legal challenges arguing that forcibly removing migrants to Rwanda is against their rights and the law."
    },
    {
        "url": "https://www.espn.co.uk/nfl/story/_/id/39043361/tuohys-respond-michael-oher-injunction-request-include-text-messages-court-filing",
        "title": "Tuohys respond to Oher injunction request, quote texts in filing",
        "description": "Sean and Leigh Anne Tuohy filed documents Monday in their ongoing dispute with Michael Oher in Tennessee&#39;s Shelby County Probate Court, quoting text messages in which the former NFL player demanded money from them."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/23967788.james-cleverly-heading-rwanda-seal-new-asylum-treaty/",
        "title": "James Cleverly heading to Rwanda to seal new asylum treaty",
        "description": "The Sunday Times reported that the capital of Kigali is to be given a £15 million top-up payment to agree fresh terms on the agreement to take migrants who arrive in the <b>UK</b> on small boats. Mr Sunak met Rwanda’s President Paul Kagame on the sidelines ..."
    },
    {
        "url": "https://www.wiltshiretimes.co.uk/news/national/23967159.labours-28bn-green-plans-subject-fiscal-rules-says-starmer/",
        "title": "Labour’s £28bn green plans subject to fiscal rules, says Starmer",
        "description": "Sir Keir Starmer used a speech to warn that a Labour administration will not be able to ‘turn on the spending taps’."
    }
]