[
    {
        "url": "https://menafn.com/1107834465/Believing-In-The-UK-Crypto-Ecosystem-Coinrule-Joins-Grow-London-Global-Cohort",
        "title": "Believing In The <b>UK</b> Crypto Ecosystem: Coinrule Joins Grow London Global Cohort",
        "description": "Coinrule CEO Gabriele Musella commented that“as the web3 space becomes more mature, we welcome the UK&#39;s political will to shape the web3 sector with sensible regulations,” and that &quot;Blockchain has already transformed the financial markets in an irreversible way which aligns perfectly with Coinrule&#39;s ethos and view on the future of investing.&quot;"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68257232.amp",
        "title": "Pakistan elections: Against the odds, Khan&#39;s PTI proves support is solid",
        "description": "Pakistan requires all independents to join a political party within 3 days from the moment they are officially declared or they must stay independent. PTI will need to come up with a solution soon. Other parties are already openly eyeing up the candidates, hoping they can persuade them to join their ranks, picking them off one by one."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68256017",
        "title": "Pakistan election: Rival parties each claim advantage",
        "description": "The jailed former Pakistani Prime Minister Imran Khan has claimed victory in Thursday&#39;s general election and called on his supporters to celebrate. Independent candidates linked to him have won most seats so far, with the majority of seats declared."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/the-king-ayesha-hazarika-labour-plaid-cymru-douglas-ross-b1138306.html",
        "title": "No 10 announces 13 new <b>political</b> life peers during recess",
        "description": "Thirteen new life peers have been announced by the Government. Downing Street published the list of political peerages on Friday as MPs were on holiday. The Tories’ eight nominations include Paul Goodman, a former Conservative MP and editor of the influential ConservativeHome website."
    },
    {
        "url": "https://news.sky.com/story/sunak-paid-half-a-million-pounds-in-tax-last-year-according-to-his-tax-returns-13067577",
        "title": "Sunak paid half a million pounds in tax last year, according to his tax returns",
        "description": "Rishi Sunak has published his personal tax return, showing he paid more than £500,000 in UK tax last year, as his total income rose to £2.2m. The summary of the prime minister&#39;s financial affairs was made public on Friday afternoon as parliament was in recess."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24107337.haymarket-julius-caesar-show-comes-basingstoke/",
        "title": "The Haymarket: Julius Caesar show comes to Basingstoke",
        "description": "SHAKESPEARE fans will be in for a treat when the Ucarus Theatre Collective brings Julius Caesar to The Haymarket Set in the near future, the show combines state-of-the-art digital technology and theatrical magic to highlight the parallels between the gossips and doom-mongers of Ancient Rome, and the power of fake news to destroy our world today."
    },
    {
        "url": "https://www.andoveradvertiser.co.uk/news/24105804.column-citizens-advice-answers-tackle-mould-home/",
        "title": "Column: Citizens Advice answers how to tackle mould in your home",
        "description": "A: You’ve done the right thing by bringing this to your landlord. To work out if they are responsible you’ll need to find the cause of the damp and mould, but this can take time unless there’s a clear cause, like bad insulation or a leaking roof."
    },
    {
        "url": "https://www.express.co.uk/entertainment/theatre/1865208/Tosca-review-ROH-Royal-Opera-Puccini",
        "title": "Tosca review: Stunning Royal Opera staging of Puccini classic boasts superb villain",
        "description": "Armenian baritone Grisha Martirosyan performed well as escaped <b>political</b> prisoner Angelotti ... RATING: 4 stars Box Office: roh.org.<b>uk</b> or 020 7304 4000 (Four more performances: 8, 12, 19 and 24 February 2024 before Tosca returns in July)"
    },
    {
        "url": "https://www.stroudnewsandjournal.co.uk/news/national/24110982.harris-slams-politically-motivated-report-bidens-mishandling-documents/",
        "title": "Harris slams ‘politically motivated’ report of Biden’s mishandling of documents",
        "description": "Beau Biden died of brain cancer in 2015 at the age of 46. Mr Sams suggested that the <b>political</b> environment led Mr Hur, who was appointed as US attorney by former President Donald Trump, to include the comments. “There’s an environment that we are in ..."
    },
    {
        "url": "https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-looks-downcast-crammed-32091025?int_source=nba",
        "title": "Prince Harry looks downcast in crammed lift at NFL event after 26-hour trip to see Charles",
        "description": "For all the latest on news, <b>politics</b>, sports, and showbiz from the USA, go to The Mirror US. Earlier this week, Harry flew to the <b>UK</b> to visit his father, King Charles, after it was announced that the monarch was battling some form of cancer. The prince was ..."
    },
    {
        "url": "https://www.westerntelegraph.co.uk/news/national/24110975.pakistans-former-pm-says-will-seek-coalition-government-trailing-rival/",
        "title": "Pakistan’s former PM says he will seek coalition government after trailing rival",
        "description": "Your massive turnout frightened everyone. Nobody can stop us. Don’t be scared. Celebrate.” Pakistan’s deeply divided <b>political</b> climate is unlikely to produce a strong coalition pushing for the betterment of a country grappling with high inflation ..."
    },
    {
        "url": "https://www.mirror.co.uk/sport/football/news/premier-league-legal-manchester-city-32091467",
        "title": "Premier League facing rebellion as Man City threaten legal challenge after controversial vote",
        "description": "The Premier League are trying to stop clubs over-inflating sponsorship or commercial deals tied to in-house companies, but tensions emerged at a shareholders&#39; meeting"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=above_article_ticker",
        "title": "‘S**t <b>politics</b>’: Starmer urged to get his act together after green U-turn",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being straight” after he scaled back a £28bn-a-year green investment pledge to less than £5bn."
    },
    {
        "url": "https://metro.co.uk/2024/02/09/will-uk-go-war-russia-putins-world-war-three-warning-20254528/?ico=mosaic_tag",
        "title": "Will the <b>UK</b> go to war with Russia? Putin’s World War Three warning and other threats",
        "description": "In response, the Houthis – a <b>political</b> militant group who control much of northern Yemen – kicked off a targeted campaign of drone and missile attacks on commercial ships in the Red Sea. Almost two months into the Houthi assaults, the <b>UK</b> and US ..."
    },
    {
        "url": "https://uk.news.yahoo.com/us-uk-eu-urge-probe-204010447.html",
        "title": "US, <b>UK</b>, EU urge probe into Pakistan election, express concerns",
        "description": "Both declared victory separately. Elections were held for 265 seats in the national assembly and a <b>political</b> party needs 133 seats for a simple majority. The U.S. and the EU both mentioned allegations of interference, including arrests of activists ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-rod-stewart-says-labour-182100879.html",
        "title": "Sir Rod Stewart says Labour &#39;deserve a crack&#39; at running the country",
        "description": "<b>Politics</b> Live: Sir Rod Stewart says Labour &#39;deserve a crack&#39; at power &quot;Keir Starmer and Labour deserve a crack at it,&quot; he told The Times. &quot;If there was anyone else we could vote for, maybe, but they should be given a shot. I live here (in the <b>UK</b> ..."
    },
    {
        "url": "https://www.thetimes.co.uk/money-mentor/investing/how-will-the-uk-and-us-elections-this-year-impact-investments",
        "title": "How will the <b>UK</b> and US elections this year impact investments?",
        "description": "This will encompass nearly half of the world’s people (49%). In global terms, the US election that takes place on 5 November is the most important <b>political</b> event of the year. For <b>UK</b> investors however, the likelihood of Britain holding a general election ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/sir-rod-stewart-slams-boris-32091616",
        "title": "Sir Rod Stewart slams Boris Johnson dubbing him a &#39;lying public schoolboy&#39;",
        "description": "In an interview with the Times, Sir Rod appeared to cement his recent swing in <b>political</b> support by saying Sir Keir Starmer ... I live here (in the <b>UK</b>) now. I didn’t used to. “And I see what the Conservatives get up to. Well, I liked Boris Johnson."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067045/Imprisoned-Imran-Khan-posts-AI-video-declaring-victory-Pakistani-election-independent-candidates-backing-win-seats-vote-marred-mobile-shutdown.html",
        "title": "Imran Khan posts AI video declaring victory in Pakistani election as candidates backed by his party win most seats despite him being behind bars and communications blackout",
        "description": "In the message, which is usually delivered by word through his lawyers, the AI version of Imran Khan rejected rival Nawaz Sharif&#39;s earlier claim to victory"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/lord-hammond-faces-investigation-calls-crypto-company/",
        "title": "Lord Hammond faces investigation calls for Treasury contact on crypto company",
        "description": "Former chancellor has denied lobbying after speaking with officials about start-up Copper after leaving his role"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68258641",
        "title": "Tory MSP Donald Cameron to take up House of Lords seat",
        "description": "A Conservative MSP is standing down to take up a seat in the House of Lords. Donald Cameron has served as a list member of the Scottish Parliament since 2016, representing the Highlands and Islands region. He is to become a parliamentary undersecretary of state in the Scotland Office, the UK government has confirmed."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1865211/antiques-roadshow-theo-burrell-brain-cancer-support-bbc",
        "title": "Antiques Roadshow star battling tumour calls for government to help fight brain cancer",
        "description": "Grieving families and patients have demanded that ministers do more to tackle the underfunding of research and provide more investment into supporting those diagnosed with brain tumours as Antiques Roadshow expert Theo Burrell joined the campaign."
    },
    {
        "url": "https://www.counterfire.org/article/the-crisis-of-academic-freedom-in-the-uk/",
        "title": "The crisis of academic freedom in the <b>UK</b>",
        "description": "Efforts to suppress the expression of solidarity with Palestine in UK universities are dangerous, but can and must be resisted, argues Lucia Pradella In December 2023, Judith Butler published an article in Boston Review partially criticising her own critique of the Harvard Palestine Solidarity Committee’s statement claiming that ‘the apartheid regime is the only one to blame’ for the 7 October attacks."
    },
    {
        "url": "https://www.libdems.org.uk/news/article/our-long-term-plan",
        "title": "Our long-term plan",
        "description": "Part of that long-term outlook also has to be changing the way our politics works. Not just securing electoral reform for the Commons and local government in England and Wales. But also reforming the role of money in our politics and strengthening the power of Parliament to hold the government to account."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/national/24110928.vital-ocean-currents-regulating-earths-climate-on-course-tipping-point/",
        "title": "Vital ocean currents regulating Earth’s climate ‘on course to a tipping point’",
        "description": "A breakdown of this system could potentially plunge the UK and large parts of the Northern Hemisphere into a new ice age."
    },
    {
        "url": "https://www.bbc.com/news/uk-68247739?at_format=link&at_link_origin=BBCWorld&at_link_id=3129F140-C757-11EE-950F-5DBBD0B4AF07&at_ptr_name=twitter&at_bbc_team=editorial&at_link_type=web_link&at_campaign_type=owned",
        "title": "Piers Morgan to move TalkTV show Uncensored to YouTube",
        "description": "YouTube is also free from the regulation of media watchdogs, with Ofcom imposing rules on TV news channels in the <b>UK</b> in areas including <b>political</b> impartiality and offence. In 2021, Morgan&#39;s controversial comments about the Duchess of Sussex on ITV&#39;s Good ..."
    },
    {
        "url": "https://www.ft.com/content/83b5bced-fa8b-4624-ba4a-82aaee7420dd",
        "title": "The <b>political</b> love-in with business is long overdue",
        "description": "They follow a period when both political parties viewed business with suspicion — at times with outright hostility. Business then was seen as part of the problem, rather than solution, to economic growth. The inconvenient truth is that they are both."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68251300?at_medium=RSS&at_campaign=KARANGA",
        "title": "Ed Miliband: I didn&#39;t think of quitting over Labour&#39;s green U-turn",
        "description": "That&#39;s why I&#39;m in frontline <b>politics</b>, because I care so much about this cause and ... and has said he remains committed to his mission for the <b>UK</b> to achieve net zero electricity by 2030. But the party&#39;s plan to insulate homes is set to be one casualty ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=related_article_inline",
        "title": "‘S**t <b>politics</b>’ – Starmer allies urge him to get party ready for government",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/09/the-guardian-view-on-ukraines-president-and-general-the-military-and-political-blur?ref=upstract.com",
        "title": "The Guardian view on Ukraine’s president and general: the military and <b>political</b> blur",
        "description": "Volodymyr Zelenskiy’s sacking of his commander in chief has highlighted disagreements that had remained muted <b>Politics</b> doesn’t end in wartime, even when it has been subsumed by more immediate, existential matters. With the passage of time, Winston ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/09/putin-reveals-one-case-russia-invade-european-countries-20252033/?ico=top-stories_home_top&ICID=ref_fark",
        "title": "Putin reveals the ‘one case’ when Russia would invade more European countries",
        "description": "Latvia’s foreign minister Krisjanis Karins told The Telegraph: ‘We need to be in such a state of preparedness that Russian generals and the Russian <b>political</b> classes clearly ... emailing us at webnews@metro.co.<b>uk</b>. For more stories like this, check ..."
    },
    {
        "url": "https://www.marieclaire.co.uk/news/celebrity-news/ryan-gosling-on-family",
        "title": "Ryan Gosling has opened up about his family life in a rare statement",
        "description": "Jenny Proudfoot is an award-winning journalist, specialising in lifestyle, culture, entertainment, international development and <b>politics</b>. She has worked at Marie Claire <b>UK</b> for seven years, rising from intern to Features Editor and is now the most ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/national/24110568.rishi-sunak-earned-2-2-million-paid-508-000-tax-documents-show/",
        "title": "Rishi Sunak earned £2.2 million and paid £508,000 in tax, documents show",
        "description": "Robert Palmer, executive director at Tax Justice <b>UK</b>, said: “At the moment someone who earns most ... for everything that I’ve got” and that those using his wealth as a “<b>political</b> smear” lacked ambition for the country. Chancellor of the Exchequer ..."
    }
]