[
    {
        "url": "https://www.bignewsnetwork.com/news/274094398/former-polish-pm-admits-ukraines-strategy-failed",
        "title": "Former Polish PM admits Ukraine&#39;s strategy failed",
        "description": "The conflict is going in the wrong direction Mateusz Morawiecki told the UKs Express newspaper Ukraines 2023 counteroffensive w"
    },
    {
        "url": "https://www.techradar.com/streaming/entertainment/dolphins-vs-chiefs-live-stream-how-to-watch-nfl-game-online-from-anywhere",
        "title": "Dolphins vs Chiefs live stream: how to watch NFL game online from anywhere",
        "description": "The Dolphins vs Chiefs game is available to watch for free on 7Mate, which is showing every game of the NFL playoffs live. Kick-off is set for 12.15pm AEDT on Sunday afternoon. That means viewers can also fire up a free Dolphins vs Chiefs live stream on the 7Plus streaming service, which is compatible with most smart devices."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/people/reform-uk-launches-wellingborough-by-election-campaign-with-battle-bus-handshakes-and-show-of-strength-from-candidate-ben-habib-4477487",
        "title": "Reform <b>UK</b> launches Wellingborough by-election campaign with battle bus, handshakes and show of strength from candidate Ben Habib",
        "description": "As the two Reform <b>UK</b> leaders were meeting residents and shaking well-wishers’ hands and posing for selfies, another <b>political</b> party, Britain First, were also on the campaign trail in another battle ‘bus’ – a white van with security mesh windows ..."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/people/reform-uk-launches-wellingborough-by-election-campaign-with-battle-bus-handshakes-and-show-of-strength-from-ben-habib-4477487",
        "title": "Reform <b>UK</b> launches Wellingborough by-election campaign with battle bus, handshakes and show of strength from Ben Habib",
        "description": "Reform UK has launched its campaign for the Wellingborough by-election by bussing-in supporters to welcome party leader Richard Tice and candidate Ben Habib into the town on Saturday."
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-12959235/Vitalitys-boss-health-insurance-business-rewards-getting-shape.html",
        "title": "Vitality&#39;s boss on how his health insurance business rewards you for getting in shape",
        "description": "Koopowitz&#39;s data suggests that members on average increase their exercise levels by 22 per cent after joining."
    },
    {
        "url": "https://www.thesun.co.uk/news/25353053/robert-jenrick-immigration-rwanda-government/",
        "title": "Don’t pass a Rwanda Bill that will just fail – we must sort immigration now",
        "description": "IT is a first duty of any government to secure our borders. But for far too long, small boat crossings have blown our borders open. More than 114,000 migrants have illegally entered the UK by"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12959985/houthi-troops-drills-jewish-residential-yemen-airstrikes.html",
        "title": "Houthi strike troops seen conducting armed drills in Israeli themed terrain complete with Star of David tents in wake of <b>UK</b> and US airstrikes in Yemen",
        "description": "Photos shared by the Houthi Media Centre late on Saturday showed soldiers armed with assault rifles operating in mock residential areas in Yemen."
    },
    {
        "url": "https://www.thesun.co.uk/travel/25346747/belfast-holiday-pub-crawl-titanic-museum/",
        "title": "The <b>UK</b> staycation with musical pub crawl, Titanic museum and £11 flights",
        "description": "I have never thought of holidaying in Northern Ireland. Maybe it’s because I assume more of the same unpredictable weather? Maybe it’s because it’s in the UK so it"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/13/seat-nigel-farage-beat-tories-election-reform-candidate/",
        "title": "The seat where Nigel Farage could beat Tories if he stood as Reform candidate",
        "description": "Survey results will fuel calls among supporters of former Ukip and Brexit Party leader to make a political comeback at the next election"
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-zelensky-kyiv-sunak-latest-b2478050.html?page=7",
        "title": "Russia-Ukraine war - live: Moscow launches hypersonic missile attack as <b>UK</b> pledges to send more drones",
        "description": "The renewed funding will help Ukraine purchase new military drones including surveillance, long-range and sea drones"
    },
    {
        "url": "https://www.libdemvoice.org/reprise-adventures-of-a-liberal-democrat-at-the-iowa-caucuses-part-1-74522.html",
        "title": "REPRISE: Adventures of a Liberal Democrat at the Iowa caucuses, Part 1",
        "description": "Eight years, at the beginning of the 2016 year of Brexit and Trump Hell, Kevin Lang, now our Group Leader on the City of Edinburgh Council, found himself in Iowa during the caucuses. Across three articles,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1855442/grant-shapps-houthi-americans",
        "title": "Grant Shapps in firing line after one comment left Americans completely &#39;p***** off&#39;",
        "description": "Grant Shapps reportedly “p***** off” American diplomats with a remark he made in the lead-up to joint US and UK strikes on Houthi targets in Yemen."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/foreign-office-spends-200k-crisis-31875895",
        "title": "Foreign office spends £200k on &#39;crisis media training&#39; in £4 million consultant splurge",
        "description": "It’s more than double the figure the department spent on outside advisors the previous year. It comes as the department’s spending on temporary agency staff also reached a record high of nearly £40 mi"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nhs-nurses-could-launch-more-31875836",
        "title": "NHS nurses could launch more strikes as Rishi Sunak has &#39;lost touch with reality&#39;",
        "description": "Pat Cullen, General Secretary of the Royal College of Nursing warned the Prime Minister: &quot;Every option – including strike action – is on the table.&quot;"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/jan/13/john-kerry-biden-administration-re-election-campaign?ref=mc.news",
        "title": "John Kerry to leave White House to assist Biden re-election campaign",
        "description": "Kerry’s office announced the news on Saturday after he had informed his staff and spoken with Biden earlier in the week"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12877813/Peace-Middle-East-faces-obstacles-calls-permanent-Israel-Hamas-ceasefire-grow-louder-sides-clear-sustaining-violence-untenable-experts-warn.html",
        "title": "Peace in the Middle East faces many obstacles... but as calls for a more permanent Israel-Hamas ceasefire grow louder from all sides, it is clear that sustaining the violence ...",
        "description": "As the war rages on with no immediate end in sight, experts spoke to MailOnline about the future of Gaza, Israel and conflict in the Middle East."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-accused-of-trying-to-take-glory-with-new-post-office-law-12593360?postid=7050851",
        "title": "<b>Politics</b> latest: Sunak and Zelenskyy sign security deal; &#39;biggest attack on <b>UK</b> navy in decades&#39; one reason for Yemen strikes - PM",
        "description": "Thank you for joining us on the <b>Politics</b> Hub for another busy day in Westminster ... the start of his general election campaign launch to express scepticism about the <b>UK</b>’s airstrikes on Houthi targets in Yemen. Humza Yousaf said parliament should ..."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/war-gaza-west-military-action-houthis-fail",
        "title": "War on Gaza: The West&#39;s military action against the Houthis is doomed to fail",
        "description": "Attacks on Red Sea shipping will continue until the US and UK help remove Houthi justifications for them by demanding an Israel-Hamas ceasefire"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0h4vv3l",
        "title": "Yemen strikes: The <b>political</b> fallout",
        "description": "Newscast brings you daily analysis of the latest political news stories from the BBC. It was presented by Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Hanna Ward. The technical producer was Jack Graysmark."
    },
    {
        "url": "https://www.thetimes.co.uk/article/38-of-the-best-adventure-holidays-for-2024-hzctnxrlx",
        "title": "38 of the best adventure holidays for 2024",
        "description": "Make this year one to remember with our pick of incredible trips – from hiking in Nepal and ebiking in the Lake District to spotting lemurs in Madagascar"
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/13/how-houthi-anger-with-israel-is-reshaping-the-middle-east-conflict",
        "title": "How Houthi anger with Israel is reshaping the Middle East conflict",
        "description": "Attacks on Yemen by the UK and the US have fuelled tensions in a region riven by conflict and violence"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/13/rishi-sunak-political-hero-tax-raising-labour-chancellor/",
        "title": "Rishi Sunak hid his admiration for an unlikely <b>political</b> hero - a tax-raising Labour chancellor",
        "description": "However, during Mr Sunak’s tenure as chancellor, the portrait raised eyebrows among some of his colleagues given that Gaitskell’s brief stint at the Treasury between 1950 and 1951 saw a tax-raising budget that would send shivers down the spines of today’s jittery Conservative MPs."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1855349/kevin-hollinrake-post-office-scandal-compensation",
        "title": "This is how we&#39;ll stop taxpayers having to pay for Post Office scandal compensation",
        "description": "Writing for the Express, Postal Affairs Minister Kevin Hollinrake explains how he intends to get compensation to victims as quickly as possible."
    },
    {
        "url": "https://www.thetimes.co.uk/radio/show/20240113-21385/2024-01-13",
        "title": "Alexis Conran",
        "description": "Join Matt Chorley as he guides you through what really matters in British <b>politics</b>. Formerly the Red Box podcast, he brings together the best interviews, smartest analysis and funniest panel discussions from his Times Radio show, <b>Politics</b> Without The ..."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24047827.thousands-demand-immediate-ceasefire-gaza-london-pro-palestinian-march/",
        "title": "Thousands demand immediate ceasefire in Gaza at London pro-Palestinian march",
        "description": "Thousands of pro-Palestine protesters have taken to the streets of London, calling for an immediate ceasefire in Gaza. Around 1,700 police officers patrolled the capital on Saturday, making two arrests for “offensive placards”, as the march made its way to Parliament Square."
    },
    {
        "url": "https://uk.news.yahoo.com/thousands-march-london-gaza-day-161850502.html",
        "title": "Thousands march in London for Gaza &#39;day of action&#39;",
        "description": "Thousands of pro-Palestine protesters marched in central London on Saturday as part of a &quot;global day of action&quot; to oppose Israel&#39;s bombing campaign in Gaza.The day of action, involving 30 countries, was called by the UK organising coalition comprising the Palestine Solidarity Campaign,"
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-houthi-rebels-labour-yemen-b2478192.html",
        "title": "Keir Starmer: Labour backs strikes on Houthi rebels to protect <b>UK</b>",
        "description": "Those who seek to damage Britain should be in no doubt as to the seriousness of our country’s resolve in response to their aggression"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67843756?at_medium=RSS&at_campaign=KARANGA",
        "title": "Kuenssberg: The thorny <b>politics</b> of Houthi strikes for Sunak and Starmer",
        "description": "The military action is instinctively trickier territory for Labour leader Sir Keir Starmer. Sir Keir Starmer says Labour backs the western military operation against Houthi rebels in the Red Sea. Labour nerves still jangle over what went so terribly wrong in Iraq, even after all these years."
    },
    {
        "url": "https://leftfootforward.org/2024/01/how-britains-corrupt-political-funding-helps-the-right/",
        "title": "How Britain’s corrupt <b>political</b> funding helps the Right",
        "description": "With the 2024 general election set to be the dirtiest battle yet, the party which receives the most money from donors could be at a distinct advantage."
    },
    {
        "url": "https://metro.co.uk/2024/01/13/us-fires-missiles-houthi-rebels-yemen-20108728/?ico=trending-post-strip_item_2",
        "title": "US launches fresh strikes on Iran-backed Houthi rebels in Yemen",
        "description": "Metro.co.<b>uk</b> is now on WhatsApp sending vital updates and top trending ... a member of the Houthi supreme <b>political</b> council, speaks while holding a gun (Picture: Reuters) Asked if he believes the Houthis are a terrorist group, Mr Biden responded: ‘I ..."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-labour-backs-180256670.html",
        "title": "Voices: Keir Starmer: Labour backs strikes on Houthi rebels to protect <b>UK</b>",
        "description": "Ultimately, we need <b>political</b> processes towards sustainable peace and regional security. Alongside essential military action, the <b>UK</b> must continue to pursue a diplomatic track – at the UN and through our discussions with regional players – that reduces ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/13/mps-like-betrayed-rishi-yemen-vote-20107245/?ico=just-in_tag_must-read",
        "title": "MPs like me have been betrayed by Rishi on Yemen – where was our vote?",
        "description": "The <b>UK</b> has a historic obligation to this region as well as our ... and to not lose sight of the <b>political</b> horizon and that precious peace in the Middle East."
    },
    {
        "url": "https://www.ft.com/content/12174950-8729-4ec0-95b0-693b76bce175",
        "title": "The <b>UK</b> has an accountability problem — just look at the Post Office",
        "description": "The <b>UK</b> landscape is littered with similar hybrid bodies which ... bodies discovers that it can’t — they are often statutory. The level of effort and <b>political</b> capital you would need to expend trying to get rid of any of them is too much for the average ..."
    },
    {
        "url": "https://www.somersetlive.co.uk/news/somerset-news/new-base-beloved-ice-cream-9030292",
        "title": "New base for beloved ice cream brand among new Somerset planning applications",
        "description": "A new homes for a beloved ice cream brand, self-storage units and an extension to a farm shop are among the schemes people are trying to get planning permission for in Somerset. Every week, hundreds of planning applications are submitted to Somerset ..."
    },
    {
        "url": "https://www.bbc.com/culture/article/20240112-post-office-scandal-how-a-tv-drama-shook-up-britain-in-just-a-week?trk=public_post_comment-text",
        "title": "Mr Bates vs The Post Office: How a TV drama shook up Britain – in just a week",
        "description": "This month, a <b>UK</b> TV show went far beyond all of this ... a four-part drama that was broadcast for four consecutive nights from 1 January. As the BBC&#39;s <b>political</b> editor Chris Mason put it on Wednesday, &quot;Just a week ago the ITV drama … was still on."
    },
    {
        "url": "https://inews.co.uk/opinion/the-vinted-tax-just-start-2843039?ico=most_read_by_subscribers",
        "title": "The Vinted tax is just the start",
        "description": "First, these new markets involve a large number of people – nobody quite knows how many in the <b>UK</b> have a “side hustle” but the estimates reach into millions, particularly among the young. Second, it’s happened so fast that our culture, <b>politics</b> and ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13157417.ukip-fire-british-builder-turns-irish/",
        "title": "Ukip under fire after &#39;British builder&#39; turns out to be Irish",
        "description": "NIGEL Farage&#39;s Ukip has come in for more criticism ahead of the May 22 European elections after it emerged the actor portraying a British builder in a £1.5m poster campaign to highlight the impact of immigration on <b>UK</b> jobs is an Irish migrant. Dave O ..."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24047611.thousands-join-seventh-national-march-palestine-london/",
        "title": "Thousands join seventh national march for Palestine in London",
        "description": "Hundreds of police officers are on duty in the capital on Saturday, with protesters warned that they face arrest over offensive placards or slogans."
    },
    {
        "url": "https://www.independent.co.uk/voices/middle-east-war-keir-starmer-labour-b2478132.html",
        "title": "Will war in the Middle East cast a shadow over a Starmer government?",
        "description": "For Labour, however, more than for the Conservatives, military action in Yemen, which is being linked on today’s pro-Palestinian demonstrations with the conflict in Gaza, reopens all the old wounds of the Iraq war."
    },
    {
        "url": "https://www.bbc.com/news/live/world-asia-67954619?pinned_post_locator=urn:asset:90cac51a-be05-4e21-9643-bf84dafc7911&pinned_post_asset_id=65a1fb734d761d484ed45e87&pinned_post_type=share",
        "title": "William Lai, who China sees as &#39;troublemaker&#39;, wins Taiwan election",
        "description": "Social media users in China have got the news: William Lai, their least favourite candidate, has won. Although the hashtag &quot;Taiwan election&quot; was censored, hashtags such as &quot;Taiwan&quot; and &quot;Taiwan region&quot; are still active. The popularity of the &quot;Taiwan&quot; hastag has seen a big jump, with more than 19 million views so far today."
    },
    {
        "url": "https://www.middleeasteye.net/news/israel-palestine-war-100-days-gaza-war-biden-fails-achieve-basic-policy-goals",
        "title": "Israel-Palestine war: 100 days into Gaza war Biden fails to achieve basic policy goals",
        "description": "US efforts to cobble together a plan for post-war Gaza lay bare the contradictory goals the administration has failed to resolve"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24047522.amol-rajan-viral-remix-moment-social-media-can-kind/",
        "title": "Amol Rajan on viral remix moment: Social media can be kind",
        "description": "Amol Rajan has said that social media can have “kindness and creativity rather than conspiracy and contempt” after going viral for a moment on University Challenge. The presenter and journalist, 40, was sampled for music following a question on the popular BBC quiz."
    }
]