[
    {
        "url": "https://www.thetimes.co.uk/article/boris-johnson-accuses-met-playing-politics-israel-war-crimes-t8wmlzfjr",
        "title": "Boris Johnson accuses Met of playing <b>politics</b> over Israel ‘war crimes’",
        "description": "Scotland Yard confirmed that its war crimes team had received more than 40 referrals in recent weeks over Israel-Hamas conflict"
    },
    {
        "url": "https://www.politicshome.com/news/article/transition-talks-opposition-civil-service-start-immediately-says-new-report",
        "title": "Transition Talks Between Opposition And Civil Service Should Start Immediately, Says New Report",
        "description": "Transition talks between the Civil Service and opposition party should begin in January if Keir Starmer’s Labour Party is ready to govern the"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-must-allow-civil-31797088",
        "title": "Rishi Sunak must allow civil service to plan for Labour government under Keir Starmer",
        "description": "The Institute for Government warns time is running out for Labour to discuss its plans for government with the civil service if Rishi Sunak calls a general election in May"
    },
    {
        "url": "https://uk.news.yahoo.com/opinion-trump-real-vulnerability-004946078.html",
        "title": "Opinion: Trump’s real vulnerability",
        "description": "Historian Julian Zelizer writes that looking to Iowa and New Hampshire as game changers in the Republican presidential race this year may be a mistake."
    },
    {
        "url": "https://www.ft.com/content/e6c8de7e-6d71-4488-9d14-ee90448e0bf0",
        "title": "Starmer issues call to arms to Labour ahead of <b>UK</b> general election",
        "description": "Labour leader Sir Keir Starmer will put the opposition party on high alert for a general election as he tells British voters that “the opportunity to shape our country’s future rests in your hands” in a speech on Thursday."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-to-launch-election-campaign-with-vow-to-change-the-character-of-politics-13041690",
        "title": "Sir Keir Starmer to launch election campaign with vow to change the &#39;character of <b>politics</b>&#39;",
        "description": "The Labour leader will be launching his election bid for 2024, following similar addresses from Liberal Democrat leader Sir Ed Davey and Reform UK chief Richard Tice."
    },
    {
        "url": "https://www.bbc.co.uk/news/health-67878403.amp",
        "title": "Junior doctors&#39; strike: Some hospitals request staff return to work",
        "description": "NHS bosses have made more than 20 requests for striking junior doctors in England to be allowed to cross the picket line to help out services. None of the requests made on the first strike day have been granted so far by the British Medical Association (BMA)."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/uk-sends-investigation-team-to-japan-after-fatal-tokyo-runway-crash-96779/",
        "title": "<b>UK</b> sends investigation team to Japan after fatal Tokyo runway crash",
        "description": "A Japan Airlines plane on fire on the runway of Haneda airport on Tuesday (Kyodo News via AP) Four UK-based inspectors are being sent to Japan after a large passenger plane and a coastguard aircraft collided on a runway and burst into flames,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/03/farage-return-frontline-politics-tory-nightmare/",
        "title": "Farage refuses to confirm <b>political</b> comeback as Reform unveils ‘one in, one out’ immigration plan",
        "description": "Former Ukip leader says he has not decided ‘one way or the other’ whether he will return to the fray before the next general election"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/03/labour-election-win-would-lift-downtrodden-uk-keir-starmer-to-say",
        "title": "Labour election win would lift downtrodden <b>UK</b>, Keir Starmer to say",
        "description": "In a speech in the west of England, Labour leader will say he wants British people to believe in politics again"
    },
    {
        "url": "https://www.express.co.uk/news/world/1851720/israel-war-lebanon-regional-conflict-hamas",
        "title": "Israel&#39;s new war: Lebanon warns &#39;we are approaching regional&#39; conflict in stark message",
        "description": "The chilling threat came from Lebanon&#39;s foreign minister Abdallah Bou Habib, who was speaking after a senior Hamas leader was assassinated."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-reform-uk-playing-politics-jr2rf5wwl",
        "title": "The Times view on Reform <b>UK</b>: Playing <b>Politics</b>",
        "description": "The German statesman Otto von Bismarck ­enduringly defined politics as “the art of the possible”. But that is not an edict which appeared to trouble Richard Tice, the leader of the right-wing populist party Reform UK,"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24022026.winchester-city-council-leader-visits-kings-worthy-mens-shed/",
        "title": "Winchester City Council leader visits Kings Worthy Men’s Shed",
        "description": "Kings Worthy Community Shed, which has been supported by the Winchester City Council Grants and Neighbourhood Services teams, welcomed the leader to their shed for coffee and cake on International Men’s Day."
    },
    {
        "url": "https://www.varsity.co.uk/interviews/26710",
        "title": "CURR: the ‘special society’ giving a voice to all",
        "description": "Samuel Hudson speaks with the founders of University Reproductive Rights about their inclusive space within divisive debates"
    },
    {
        "url": "https://www.thenational.scot/news/national/24025358.least-95-killed-twin-blasts-ceremony-honouring-iranian-general/",
        "title": "At least 95 killed in twin blasts at ceremony honouring Iranian general",
        "description": "A decade and a half later, he had become Iran’s most recognisable battlefield commander, ignoring calls to enter <b>politics</b> but growing as powerful, if not more, than its civilian leadership. Ultimately, a drone strike launched by the Trump administration ..."
    },
    {
        "url": "https://inews.co.uk/news/trump-major-security-risk-uk-top-diplomats-2834083?ico=in-line_link",
        "title": "Trump 2.0 is major security risk to <b>UK</b>, warn top former British-US diplomats",
        "description": "The British Government must privately come up with plans to mitigate risks to national security if Donald Trump becomes US president again, according to senior diplomatic veterans"
    },
    {
        "url": "https://metro.co.uk/2024/01/03/putin-breaks-bombing-ukraine-condemn-iran-attack-20059476/",
        "title": "Putin breaks from bombing schools and hospitals to condemn ‘terrorism’ after Iran attack",
        "description": "Vladimir Putin has condemned the ‘terrorist’ attacks in Iran – after his own forces have spent days blitzing homes, hospitals and schools in Ukraine. The Russian president expressed condolences to Iran’s leadership following two blasts that went off in the Iranian city of Kerman today."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-labour-exhausted-britain-b2472845.html",
        "title": "Keir Starmer pledges to bring hope to an ‘exhausted’ Britain",
        "description": "Tories can’t change Britain, so they try to undermine the possibility of change itself,’ Labour leader tells voters"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24026423.young-reporter---uk-done-support-ukraine---harry-ng/",
        "title": "Young Reporter - What has the <b>UK</b> done to support Ukraine? - Harry Ng",
        "description": "As the war between Russia and Ukraine nears its third year, the UK’s support for Ukraine has continued even in the face of two changes of"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/03/reform-uk-mainstream-nigel-farage-richard-tice/",
        "title": "Reform <b>UK</b> can’t become mainstream without Farage front and centre",
        "description": "The pitch could not have been clearer. In pledging to “save Britain” from the Hobson’s choice of “socialist Sunak” or a full-blown “Starmageddon”, the bods behind Reform UK claim the Right-wing party is on the brink of a major political upset."
    },
    {
        "url": "https://www.maldonandburnhamstandard.co.uk/news/national/24026404.number-hospitals-call-junior-doctors-return-work/",
        "title": "A number of hospitals call on junior doctors to return to work",
        "description": "A number of hospitals have called on striking junior doctors to return to work due to patient safety concerns, during the longest walkout in NHS history. Services across England are facing “significant demand” on the first day of a six-day walkout by junior doctors, health leaders have said."
    },
    {
        "url": "https://inews.co.uk/news/politics/jeremy-hunt-reform-uk-farage-2836330?ico=related_stories",
        "title": "Jeremy Hunt under threat from Reform <b>UK</b> as Farage party guns for Tories",
        "description": "Even Reform winning just 3 per cent of the vote could leave senior Tory MPs vulnerable in their constituencies, according to the data"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/reform-uk-polls-tory-voters-labour-constituencies-b2472858.html",
        "title": "How Reform <b>UK</b> could reshape the election – and the Tories",
        "description": "Nigel Farage might not be standing for parliament but his party can still change the future of Britain’s right, says Sean O’Grady"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851645/ukip-conservative-party-nigel-farage-henry-bolton",
        "title": "Former UKIP leader’s fury as he’s denied membership to Conservative Party",
        "description": "While Mr Bolton has been denied Conservative Party membership, there are questions over whether the same would apply to Mr Farage if he chooses to return to frontline <b>politics</b>. According to Reform <b>UK</b> candidate Alan Cook, Mr Farage reportedly says “timing ..."
    },
    {
        "url": "https://news.sky.com/story/small-boat-arrivals-in-uk-could-hit-35000-this-year-according-to-leaked-border-force-documents-13041526?dcmp=snt-sf-twitter",
        "title": "Small boat arrivals in <b>UK</b> could hit 35,000 this year, according to leaked Border Force documents",
        "description": "<b>Politics</b> latest: &#39;Starmergeddon&#39; warning from Reform <b>UK</b> as party says it won&#39;t do deal with Tories &quot;It is entirely right to project forward and look at all scenarios, including worst cases. But that is exactly how we plan and focus our attention on the ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/carol-vorderman-responds-shaun-bailey-comments-gb-news-instagram_uk_65956acbe4b0bf73e177fcb8/",
        "title": "Carol Vorderman Brands Shaun Bailey A &#39;Misogynist&#39; After His Comments About Her On GB News",
        "description": "but simultaneously demonises and bullies those who hold different <b>political</b> views to her own. I strongly support free speech. I don’t support bullying.” HuffPost <b>UK</b> has also contacted GB News for comment. Since uploading her post, Carol has been backed ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67878342",
        "title": "Keir Starmer seeks new year boost before 2024 election",
        "description": "And all this after the Liberal Democrats and Reform <b>UK</b> did their new year thing. If you are one of the smaller parties, commanding attention is 99% of the <b>political</b> challenge. The Lib Dems embrace this reality by throwing subtlety into the sea. Leader Sir ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/03/dream-job-offer-taken-away-told-disability-20028146/?ico=trending-post-strip_item_2",
        "title": "My dream job offer was taken away after I told them about my disability",
        "description": "I am incredibly proud of the work I have done to help shape the world for disabled people, around <b>political</b> representation ... Over 25% of small businesses in the <b>UK</b> are owned by someone with a disability or health condition and – as of 2020 – the ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24023810.three-big-elections-change-face-global-politics-2024/",
        "title": "Three big elections could change the face of global <b>politics</b> in 2024",
        "description": "FIRSTLY, a very Happy New Year to you all. Jonathon and I for once had a restful time with family and friends in Stirling and I feel the better"
    },
    {
        "url": "https://www.theguardian.com/politics/audio/2024/jan/03/2024-what-happens-when-us-uk-elections-collide-podcast?ref=upstract.com",
        "title": "2024: what happens when US and <b>UK</b> elections collide?",
        "description": "UK and US elections don’t usually happen in the same year. So what happens when they do? Jonathan Freedland delves into history books and what lessons they have for 2024"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-67876860.amp",
        "title": "Statistics watchdog to examine government asylum backlog claims",
        "description": "When you consent to data collection on AMP pages you are consenting to allow us to display personalised ads that are relevant to you when you are outside of the <b>UK</b>. Read more about how we personalise ads in the BBC and our advertising partners. You can ..."
    },
    {
        "url": "https://www.channel4.com/news/reform-uks-richard-tice-claims-tory-mps-terrified-of-his-party-and-urges-sunak-to-call-election",
        "title": "Reform <b>UK</b>’s Richard Tice claims Tory MPs ‘terrified’ of his party and urges Sunak to call election",
        "description": "Rishi Sunak is facing more calls from his <b>political</b> opponents to call an election early this ... From the right, the Leader of Reform <b>UK</b> Richard Tice claimed that Conservative MPs are “terrified” of his party and urged Rishi Sunak to call an election ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/jeremy-hunt-reform-uk-farage-2836330",
        "title": "Jeremy Hunt under threat from Reform <b>UK</b> as Farage party guns for Tories",
        "description": "Even Reform winning just 3 per cent of the vote could leave senior Tory MPs vulnerable in their constituencies, according to the data"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24026399.uk-warns-houthi-rebels-end-attacks-red-sea-container-ships-immediately/",
        "title": "<b>UK</b> warns Houthi rebels to end attacks on Red Sea container ships immediately",
        "description": "The British Government and 11 other countries have issued a final warning to the militants to cease hostilities in the important maritime"
    },
    {
        "url": "https://www.kentonline.co.uk/kent/news/kent-s-viral-videos-including-darts-fans-painful-escalato-299509/",
        "title": "Kent’s viral videos: Darts fan’s escalator fall, McDonald’s fights and the TikTok man who hates county",
        "description": "As 16-year-old Luke Littler tries to make history, we remember the Kent Darts fan who went viral and other popular videos from the county."
    },
    {
        "url": "https://uk.news.yahoo.com/letters-tories-only-themselves-blame-000200951.html",
        "title": "Letters: The Tories have only themselves to blame for the rise of Reform <b>UK</b>",
        "description": "Lee Anderson, deputy chairman of the Conservative Party, has warned Reform UK, formerly the Brexit Party, that it could allow Labour to win power by standing candidates against the Tories (report, January 3)."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12923701/NANA-AKUA-Appointing-transgender-activist-Munroe-Bergdorf-represent-British-women-laughable-werent-dangerous-appalling-decision.html",
        "title": "NANA AKUA: Appointing transgender &#39;activist&#39; Munroe Bergdorf to represent British women would be laughable if it weren&#39;t so dangerous - it&#39;s an appalling decision",
        "description": "Munroe Bergdorf (pictured), born a man but now identifies as a woman, has been appointed as UN Women UK&#39;s first &#39;UK champion&#39; - an ambassadorial role to empower females."
    },
    {
        "url": "https://www.thenational.scot/politics/24026360.despite-hear-election-year-uk-cant-resuscitated/",
        "title": "Despite what we’ll hear in election year, the <b>UK</b> can’t be resuscitated",
        "description": "THE Union is beyond resuscitation. Sunak and Starmer, on behalf of the British establishment, will disingenuously do their utmost to convince"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-67876502.amp",
        "title": "Robert F Kennedy Jr qualifies for first presidential ballot in Utah",
        "description": "Independent candidate and anti-vaccination activist Robert F Kennedy Jr has qualified for the 2024 presidential ballot in his first state. Elections officials in Utah said Mr Kennedy Jr had collected the 1,000 signatures necessary for ballot access. He still faces a long battle to qualify in the other 49 US states and the District of Columbia."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851674/nigel-farage-reform-uk-general-election-2024",
        "title": "Nigel Farage gives defiant three-word message after Reform <b>UK</b> no-show",
        "description": "The former UKIP leader threw his weight behind Richard Tice this afternoon amid rumours he was planning to make a political comeback."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1851663/nigel-farage-reform-uk-general-election-2024",
        "title": "Nigel Farage&#39;s secret election plan revealed and Brexit voters won&#39;t be happy",
        "description": "Mr Farage is currently Reform UK&#39;s president and the insurgent party is plotting how best to use the architect of Brexit."
    },
    {
        "url": "https://www.thenational.scot/politics/24026298.junior-doctors-strike-england-reveals-media-double-standards-scotland/",
        "title": "Junior doctors&#39; strike in England reveals media double standards in Scotland",
        "description": "IT’S the longest strike in NHS history. Six days of walkouts by junior doctors which mean thousands of outpatient appointments have been"
    },
    {
        "url": "https://news.stv.tv/east-central/edinburgh-city-council-to-bring-in-pavement-parking-ban-from-january-29-after-new-powers-introduced",
        "title": "Edinburgh&#39;s pavement parking ban enforced this month announces council",
        "description": "Edinburgh will become the first city in Scotland to enforce a ban on pavement parking, starting on January 29. Local authorities were given new powers to stop vehicles from parking on pavements by the Transport (Scotland) Act 2019, which came into effect in December."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/mortgage-rates-falling-borrowers-still-174133703.html",
        "title": "Mortgage rates are falling but borrowers are still feeling the squeeze – a finance expert explains how to cut your repayments",
        "description": "Homeowners looking to remortgage and first-time buyers struggled to manage interest rate hikes in 2023. Here’s what to think about this year."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/reform-uk-tory-general-election-farage-sunak-b2472640.html",
        "title": "Reform <b>UK</b> rules out deal with the Tories as Nigel Farage ducks bid to become MP",
        "description": "Reform UK has “categorically” ruled out a deal with the Tories at the 2024 general election as Nigel Farage appears to have ducked an eighth bid to become an MP. In a move that piles yet more pressure on Rishi Sunak, Reform leader Richard Tice vowed to field candidates in every constituency in England, Wales and Scotland."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/israel-hamas-war-conflict-lebanon-gaza-red-sea-west-bank_uk_65954b39e4b0912833ae7ca9",
        "title": "Israel-Hamas War: How The Violent Conflict Is Already Reaching Across The Middle East",
        "description": "The Israel -Hamas war has spilled out into the wider Middle Eastern region recently, with at least three areas now where violent skirmishes could escalate."
    },
    {
        "url": "https://www.techuk.org/resource/wales-looks-to-hold-a-major-esports-tournament.html",
        "title": "Wales looks to hold a major Esports tournament",
        "description": "Wales is aiming to position itself as a major player in the global Esports industry, most notably by integrating the focus within schools and colleges across the country."
    },
    {
        "url": "https://inews.co.uk/news/politics/trump-major-security-risk-uk-top-diplomats-2834083?ico=related_article_inline",
        "title": "Trump 2.0 is major security risk to <b>UK</b>, warn top former British-US diplomats",
        "description": "The Government urgently needs to prepare secret contingency plans to protect the UK if Donald Trump is elected as US President in November, three of Britain’s most experienced diplomatic figures have warned."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/watchdog-to-scrutinise-sunak-s-claim-the-asylum-backlog-has-been-cleared-107250/",
        "title": "Watchdog to scrutinise Sunak’s claim the asylum backlog has been ‘cleared’",
        "description": "Rishi Sunak’s claim that ministers have “cleared” the asylum backlog is being investigated by the official statistics watchdog after allegations from opponents that it is a “barefaced lie”."
    },
    {
        "url": "https://www.property118.com/landlords-who-gets-your-vote/",
        "title": "Landlords – Who gets your vote?",
        "description": "Hi, Do landlords have a viable political home? It appears not. Historically the Conservative party has been the party of the landlord, permitting the market to control itself to a large extent."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/richard-tice-rishi-sunak-nigel-farage-reform-lee-anderson-b1130090.html",
        "title": "Reform rules out Tory pact as Sunak faces pressure to call election",
        "description": "Richard Tice, the leader of the Nigel Farage-linked party, claimed the Tories are ‘terrified’ of the threat Reform poses."
    },
    {
        "url": "https://www.libdems.org.uk/press/release/ed-davey-launches-tory-removal-service-poster-as-he-calls-for-may-2024-election",
        "title": "Ed Davey launches “Tory Removal Service” poster as he calls for May 2024 election",
        "description": "Liberal Democrat Leader Ed Davey has unveiled a new ‘Tory Removal Service’ campaign poster, as he announces a new plan to force a May 2024 election and stop Rishi Sunak clinging on to power."
    },
    {
        "url": "https://www.harrogateadvertiser.co.uk/news/politics/live-facial-recognition-cameras-to-be-trialled-in-harrogate-and-scarborough-pledges-mayoral-candidate-4465188",
        "title": "Live facial recognition cameras to be trialled in Harrogate and Scarborough pledges mayoral candidate",
        "description": "Cutting-edge live facial recognition cameras could be deployed in North Yorkshire as early as this year under Tory mayoral candidate Keane Duncan’s “tough-on-crime” agenda."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-reform-uk-general-election-b2472559.html",
        "title": "Nigel Farage ‘assessing’ return to <b>politics</b> amid warning Reform <b>UK</b> could pick off Tories - live",
        "description": "Reform UK to target Labour voters and claim Keir Starmer’s party will ‘bankrupt’ Britain if it wins next general election"
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24025903.new-procedure-type-2-diabetics-assessed-nhs-spending-watchdog/",
        "title": "New procedure for type 2 diabetics being assessed by NHS spending watchdog",
        "description": "The safety of a procedure for type 2 diabetes patients that uses heat to destroy the lining of part of the small intestine – allowing it to regrow so cells respond better to insulin – is being explored for potential NHS use by the spending watchdog."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/fishermen-net-benefits-of-leaving-common-fisheries-policy-337812/",
        "title": "Fishermen net benefits of leaving Common Fisheries Policy",
        "description": "Fishermen continue to net the benefits of being out of the Common Fisheries Policy after seeing yearly sales incomes rise."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/uk-general-election-dates-potential-britain-polls-vote-b1129877.html",
        "title": "<b>UK</b> general election: Three potential dates when Britain could go to the polls",
        "description": "Britain is on its third Prime Minister since Boris Johnson oversaw a landslide victory for the Conservatives in December 2019. In just four years the party has been hit by a number of scandals and now languishes around 20 points behind Labour in opinion polls."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/anti-northern-ireland-protocol-campaigner-ben-habib-to-fight-wellingborough-by-election-for-reform-uk-4465123",
        "title": "Anti-Northern Ireland Protocol campaigner Ben Habib to fight Wellingborough by-election for Reform <b>UK</b>",
        "description": "NI Protocol campaigner Ben Habib will contest a Westminster byelection as a Reform UK candidate for Wellingborough."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24024565.oxford-professor-warns-oversharing-ai-chatbots/",
        "title": "Oxford professor warns against oversharing with AI chatbots",
        "description": "A professor of computer science at Oxford University has urged individuals using chatbot technology to avoid oversharing personal information."
    },
    {
        "url": "https://news.sky.com/story/nigel-farage-still-assessing-what-role-he-will-play-in-general-election-says-reform-uk-leader-richard-tice-13041394",
        "title": "Nigel Farage still &#39;assessing&#39; what role he will play in general election, says Reform <b>UK</b> leader Richard Tice",
        "description": "Richard Tice says he has been in discussions with Mr Farage about a potential comeback, calling the former Reform UK leader a &quot;master of political timing&quot;."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/303666/psni-investigate-serious-assault-in-strabane",
        "title": "PSNI Investigate Serious Assault In Strabane",
        "description": "03 January 2024 Road Users Urged To Stay Safe On NI&#39;s Roads In 2024 Road users have been urged to safeguard their safety and others using NI&#39;s roads in 2024. The release of provisional figures today by the PSNI show that 69 people died in road tragedies during 2023."
    },
    {
        "url": "https://leftfootforward.org/2024/01/nigel-farage-assessing-his-political-comeback-to-party-says-reform-uk-leader/",
        "title": "Nigel Farage ‘assessing’ his <b>political</b> comeback to party, says Reform <b>UK</b> leader",
        "description": "Founder of Reform UK, Nigel Farage, failed to turn up to his party’s election campaign launch today, as the current leader Richard Tice announced Farage was ‘assessing’ his return to the far-right political party."
    },
    {
        "url": "https://www.itv.com/news/2024-01-02/nhs-faces-tough-start-to-2024-with-upcoming-strikes-boss-warns",
        "title": "NHS faces &#39;one of its most difficult starts to the year&#39; as its longest-ever strike begins",
        "description": "The NHS may have to deal with “one of the most difficult starts to the year” it has ever faced, a medical leader has warned."
    },
    {
        "url": "https://www.rusi.org/explore-our-research/publications/commentary/are-covid-lockdowns-behind-rise-extreme-poverty-global-south",
        "title": "Are Covid Lockdowns Behind the Rise in Extreme Poverty in the Global South?",
        "description": "In the context of a huge increase in global poverty since 2020 which has driven political convulsions most especially in low-income countries, a closer look at pandemic policies is vital to safeguard against future missteps."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/303679/reforms-needed-to-prevent-future-political-collapse",
        "title": "Reforms Needed To Prevent Future <b>Political</b> Collapse",
        "description": "03 January 2024 New Parents Can Now Apply For Child Benefit Online HM Revenue and Customs (HMRC) has announced that new parents can now claim Child Benefit online for the first time since it was launched 47 years ago, helping millions of families with the cost of raising their children."
    },
    {
        "url": "https://www.holyrood.com/news/view,reform-uk-vows-to-stand-everywhere-in-scotland",
        "title": "Reform <b>UK</b> vows to stand &#39;everywhere&#39; in Scotland",
        "description": "Reform UK leader Richard Tice vows to stand &#39;everywhere&#39; in Scotland in general election fight against Conservatives"
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/national/24024993.hate-crime-assault-caused-ongoing-trauma-says-drag-star-vivienne/",
        "title": "Hate crime assault has caused ‘ongoing trauma’, says drag star The Vivienne",
        "description": "Drag star The Vivienne said a homophobic assault while he waited for food in a McDonald’s has caused “stress, anguish and ongoing trauma”. Last month, magistrates ruled the one-punch attack by scaffolder Alan Whitfield, 51, on James Lee Williams, 31, who performs as the drag queen, was a hate crime."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/03/rishi-sunak-latest-news-farage-small-boats-uk-doctor-strike/",
        "title": "<b>Politics</b> latest news: Reform <b>UK</b> rules out election pact with Tories",
        "description": "Nigel Farage has warned the Tories that illegal immigration is “rapidly climbing up towards the top of the list” of voters’ political priorities."
    },
    {
        "url": "https://www.bbc.com/mediacentre/2024/jon-ronson-things-fell-apart-season-2",
        "title": "Jon Ronson returns in BBC Radio 4’s Things Fell Apart Season 2 to unearth astonishing origins of the culture wars that ignited during Covid lockdown",
        "description": "The award winning podcast returns with eight more extraordinary stories about the culture wars that divide us so toxically today"
    },
    {
        "url": "https://www.blackpoolgazette.co.uk/news/transport/lancashires-roads-to-get-20mph-limits-only-where-they-are-necessary-and-wanted-4464954",
        "title": "Lancashire’s roads to get 20mph limits only where they are ‘necessary and wanted’",
        "description": "Speed limits became a touchstone <b>political</b> issue nationally after Wales made 20mph the default limit for its residential roads last year - while leaving local authorities the flexibility to decide which routes should remain at 30mph. It was expected that ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/03/junior-doctors-strikes-nhs-pay-bma-rishi-sunak-uk-politics-live?page=with:block-65957bb48f083d1e9a9af48b",
        "title": "Reform <b>UK</b> leader rules out helping Tories at general election and says party will stand in every seat in Britain – <b>UK politics</b> live",
        "description": "Nigel Farage does not appear at Reform UK press conference as Richard Tice says ‘a good poker player does not show his hand early’"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-leader-keir-starmer-fires-223000104.html",
        "title": "Labour Leader Keir Starmer Fires Starting Gun on <b>UK</b> ‘Election Year’",
        "description": "Labour leader Keir Starmer will make his opening pitch to voters in what is widely expected to be a UK election year, declaring that Britain is “crying out for change” after 14 years of Conservative governments."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24025341.michael-mosley-fast-800-pioneer-health-guru/",
        "title": "Who is Michael Mosley? The Fast 800 pioneer and health guru",
        "description": "Dr Michael Mosley is an award-winning documentarian and journalist who is responsible for changing health habits."
    },
    {
        "url": "https://www.politicshome.com/news/article/nigel-farage-no-show-overshadows-reform-election-campaign-launch",
        "title": "Nigel Farage No Show Overshadows Reform&#39;s Election Campaign Launch",
        "description": "Growing questions over the political future of Nigel Farage dominated a Reform UK press conference launching the party&#39;s preparations for the 2024"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nigel-farage-snubs-reform-press-31797413",
        "title": "Nigel Farage snubs Reform press conference as Tories told no &#39;special deals&#39; with party",
        "description": "Reform leader Richard Tice said the &#39;terrified&#39; Conservatives were already &#39;pleading&#39; for his party not to stand in certain seats but said &#39;under no circumstances&#39; will he make any pacts"
    },
    {
        "url": "https://www.lgcplus.com/politics/lgc-briefing/what-does-2024-hold-in-store-for-local-government-03-01-2024/",
        "title": "What does 2024 hold in store for local government?",
        "description": "Working together and with the Electoral Commission, returning officers in <b>UK</b> local authorities need to prepare robust ... For, as the saying goes, “all <b>politics</b> is local”. Kwame Boakye, LGC reporter: My prediction for 2024 is that South Cambridgeshire ..."
    }
]