[
    {
        "url": "https://www.thejakartapost.com/indonesia/2024/02/21/questions-raised-about-jokowi-prabowo-postelection-dynamics.html",
        "title": "Questions raised about Jokowi, Prabowo postelection dynamics",
        "description": "Once he takes office in October, former Army general Prabowo Subianto may set his own agenda rather than completely following in President Joko &quot;Jokowi&quot; Widodo&#39;s footsteps, although the politician still needs to compromise with his predecessor,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106045/poll-joe-biden-perform-better-against-trump.html",
        "title": "New poll shows Biden would perform BETTER against Trump than potential Democratic back-ups Kamala Harris and Gavin Newsom",
        "description": "Despite all the handwringing over President Biden&#39;s age and ability to seek reelection, a new poll shows the president would do better in a race against Donald Trump than another potential Democratic presidential candidate would in the <b>general election</b>."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-ill-stay-on-as-scotlands-first-minister-if-snp-loses-seats-at-the-uk-general-election",
        "title": "Yousaf: I&#39;ll stay on as FM if SNP loses seats at <b>general election</b>",
        "description": "Asked by STV’s John Mackay if he would continue as leader following such a result, Yousaf replied: “Yes, because we would have just won a <b>general election</b> in Scotland. “I don’t know any other political leader who would win a <b>general election</b> and ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106241/arab-americans-michigan-demand-joe-biden-step-gaza.html",
        "title": "Arab Americans in Michigan demand Biden STEP DOWN &#39;as soon as possible&#39; and insist they will NEVER support him: Progressive fury grows over Joe&#39;s Gaza policy in swing state ...",
        "description": "Arab American organizations in Michigan are urging Biden to &#39;step down&#39; as they push for Democratic voters in the state to cast their ballot for &#39;uncommitted&#39; in the February 27th primary."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/20/election-updates-nikki-haley-south-carolina-trump-republican-latest?ref=upstract.com",
        "title": "‘We have a country to save’: Nikki Haley vows to stay in race against Donald Trump ahead of South Carolina primary – as it happened",
        "description": "Former South Carolina governor who is the last major challenger to Donald Trump reaffirms her spot in 2024 race ahead of Saturday’s primary"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/tim-farron-lib-dems-nfu-liberal-democrats-government-b2499545.html",
        "title": "Lib Dems call for extra £1bn for farming budget in bid to win rural votes",
        "description": "The party is also calling for ‘arbitrary’ visa salary thresholds to be abandoned in order to help plug workforce gaps in the food sector."
    },
    {
        "url": "https://www.thetimes.co.uk/article/fd56080a-5f3f-4aaa-b2f3-de67a22338b2?shareToken=49b7b3e346f9817c904615a9558f08a1",
        "title": "Scott Benton: by-<b>election</b> alert as gambling sting MP loses appeal",
        "description": "Rishi Sunak is expected to face another by-election test after an MP exposed by a Times investigation lost an appeal against a 35-day suspension from parliament for breaking lobbying rules. Scott Benton was filmed telling undercover reporters posing as gambling industry investors that he could lobby ministers and leak a confidential policy document in return for payment of up to £2,"
    },
    {
        "url": "https://www.ft.com/content/28c85e37-1ac2-46bb-8091-82cdd16609a5",
        "title": "South Africa sets May 29 for pivotal <b>general election</b>",
        "description": "South Africa’s president has chosen May 29 as the date for national elections, setting the stage for what could be the closest-fought vote since the country became a democracy three decades ago."
    },
    {
        "url": "https://thelincolnite.co.uk/2024/02/lincolnshires-spring-budget-wishlist-vat-cuts-flood-funding-and-boosting-productivity/",
        "title": "Lincolnshire’s Spring Budget wishlist: VAT cuts, flood funding and boosting productivity",
        "description": "In what is likely to be the final major economic statement before the <b>General Election</b>, Lincolnshire “urgently” needs support in its hospitality and tourism sectors to boost growth, as well as government support to prevent future flooding catastrophes."
    },
    {
        "url": "https://www.bbc.co.uk/mediacentre/2024/bbc-scotland-broadcast-news-digital-impact",
        "title": "BBC Scotland announces plans to reshape broadcast news and grow digital impact in <b>election</b> year",
        "description": "The changes are designed to grow the impact of broadcast news services in Scotland whilst offering audiences more ways to watch and listen to news and current affairs output across all our services"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/cpac-2024-donald-trump-republicans-b2498831.html",
        "title": "Trump boosters, Biden attacks – and a Liz Truss speech: What to expect at Republicans’ CPAC event this week",
        "description": "Donald Trump will take centre stage, as will his veepstakes, plus plenty of international characters. Eric Garcia reports ahead of the annual conservative gathering"
    },
    {
        "url": "https://www.itv.com/news/granada/2024-02-20/mp-caught-in-lobbying-sting-faces-suspension-after-appeal-fails",
        "title": "Blackpool South MP Scott Benton loses appeal after being caught in lobbying sting",
        "description": "Scott Benton will be given the 35 day recommended suspension after an independent panel dismissed his appeal. Benton was caught by the Times in April 2023, offering to lobby ministers and table parliamentary questions on behalf of gambling investors. Footage also showed him allegedly boasting there were ways to keep corporate hospitality secret."
    },
    {
        "url": "https://inews.co.uk/news/politics/badenoch-demands-ex-post-office-chair-provide-evidence-for-compensation-delay-claims-2916754",
        "title": "Badenoch demands ex-Post Office chair provide evidence for compensation delay claims",
        "description": "Kemi Badenoch has demanded the former chair of the Post Office reveal evidence that he was told to stall compensation payments to victims of the Horizon IT scandal."
    },
    {
        "url": "https://www.ft.com/content/cae5c81e-e2d0-481b-9b5e-bbb4dec6a040",
        "title": "Rishi Sunak should resist a swerve to the right",
        "description": "Bleeding support on that scale on its right flank, they say, could compound its losses in an election. They are urging Sunak to tack further to the right in cutting taxes, slowing climate goals and hardening his line on “illegal” migration,"
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/20/plea-filed-in-sc-lahore-registry-seeking-probe-into-poll-rigging/",
        "title": "Plea filed in SC Lahore Registry, seeking probe into poll rigging",
        "description": "Lahore Registry on Tuesday seeking an investigation into the alleged rigging in the recently held general elections in the country.A citizen"
    },
    {
        "url": "https://uk.news.yahoo.com/cnn-reporter-biden-camp-focusing-194446823.html",
        "title": "CNN reporter: Biden camp focusing on ‘crazy s— that Trump says’",
        "description": "A CNN reporter used profane language during a live report on Tuesday about President Biden’s campaign strategy as his campaign looks ahead to a potential <b>general election</b> showdown with former President Trump. “President Biden himself personally ..."
    },
    {
        "url": "https://www.theguardian.com/politics/ng-interactive/2024/feb/20/general-election-uk-opinion-polls-seats-tories-lose",
        "title": "UK <b>general election</b>: the seats the Tories will lose if the polls are right",
        "description": "Guardian analysis reveals the Conservative seats most at risk to Labour in the next election, based on current national polls"
    },
    {
        "url": "https://www.falkirkherald.co.uk/news/politics/general-election-scottish-labour-select-candidate-for-new-alloa-and-grangemouth-constituency-4526039",
        "title": "<b>General election</b>: Scottish Labour select candidate for new Alloa and Grangemouth constituency",
        "description": "A golf pro is hoping to see a swing to Scottish Labour in the next general election after being selected as their Westminster candidate for a new constituency."
    },
    {
        "url": "https://metro.co.uk/2024/02/20/chose-mp-now-child-a-panic-button-20312944/?ico=more_text_links",
        "title": "I chose to be an MP but now my child has to have a panic button in their bedroom",
        "description": "It was so badly done that it just made me laugh at the time, but technology has moved on, and I suspect at the next <b>general election</b> the images will be a million times better, and possibly indistinguishable as fakes. There are probably all sorts of ..."
    },
    {
        "url": "https://www.falkirkherald.co.uk/education/grangemouth-primary-school-holds-election-to-decide-how-to-spend-ps1100-funding-4525884",
        "title": "Grangemouth primary school holds &#39;<b>election</b>&#39; to decide how to spend £1100 funding",
        "description": "Two P7 classes are forming their own political parties in order to take part in an election which will decide how the school spents £1100 of funding."
    },
    {
        "url": "https://www.financialreporter.co.uk/academy/general-election-2024-whats-been-promised-whats-being-prioritised-and-whats-the-outlook-for-the-property-market.html",
        "title": "<b>General election</b> 2024: What&#39;s been promised, what&#39;s being prioritised, and what&#39;s the outlook for the property market",
        "description": "Mike Cook, chief mortgage officer at Market Financial Solutions, explores what the main political parties may focus on in the run up to the next general election and how the property market may be affected by the promises made by both Labour and the Conservatives."
    },
    {
        "url": "https://news.yahoo.com/biden-campaign-democrats-raise-42m-151810432.html",
        "title": "Biden campaign and Democrats raise $42m in January ‘driven by grassroots’",
        "description": "The Democrats now have $130m in cash on hand as the <b>general election</b> season is set to be one of the longest in recent memory. Julie Chavez Rodriguez, Biden’s campaign manager, said in a statement that “January’s fundraising haul – driven by a ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/arkhouse-nominates-nine-highly-qualified-181000786.html",
        "title": "Arkhouse Nominates Nine Highly Qualified, Independent Candidates for <b>Election</b> to Macy’s Board of Directors",
        "description": "highly qualified candidates for <b>election</b> to the Company’s Board of Directors (the &quot;Board&quot;) at the 2024 Annual Meeting of Shareholders (the &quot;Annual Meeting&quot;). Gavriel Kahane and Jonathon Blackwell, Arkhouse Managing Partners, said: &quot;Arkhouse and its ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "Rishi Sunak attempted to dampen down speculation over the timing of a <b>general election</b> by stating his “working assumption” was that the poll would take place in the second half of the year. The announcement was intended to head off a planned Labour ..."
    },
    {
        "url": "https://www.modernghana.com/news/1293952/election-2024-the-ballot-box-is-on-the-ground.html",
        "title": "<b>Election</b> 2024: The ballot box is on the grounds, not social media — Ursula Owusu reacts to online polls with Bawumia losing to Mahama",
        "description": "The Minister of Communications and Digitization, Ursula Owusu-Ekuful, has rubbished online polls predicting defeat for Dr. Mahamudu Bawumia in the run-up to the 2024 <b>general</b> <b>elections</b>. She has emphasized that the governing New Patriotic Party (NPP ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-wales-68338278",
        "title": "<b>General election</b>: Cost of living help among voters&#39; pleas",
        "description": "With a <b>general election</b> looming, voters in a key Welsh battleground have highlighted the cost of living as one of the key issues. Tara Mellor from Geek&#39;s Barbers says she is &quot;working extra hours, trying to cut back, doing meal plans, turning the heating ..."
    },
    {
        "url": "https://www.foxnews.com/politics/trump-spokesperson-claims-haley-will-kiss-a-when-she-quits-vowed-stay-race",
        "title": "Trump spokesperson claims Haley will &#39;kiss a-- when she quits&#39; after she vowed to stay in race",
        "description": "The Trump campaign responded to former Ambassador Haley&#39;s pledge not to &#39;kiss the ring&#39; and drop out of the race by predicting she will eventually &#39;kiss a--&#39; and drop out."
    },
    {
        "url": "https://www.cbsnews.com/news/trump-reshape-rnc-leadership-changes/",
        "title": "Trump hopes to reshape RNC into &quot;seamless operation&quot; with leadership changes",
        "description": "Trump recently endorsed two close allies, daughter-in-law Lara Trump and senior campaign adviser Chris LaCivita, to bridge the gap between his campaign and the GOP."
    },
    {
        "url": "https://apnews.com/article/belarus-election-lukashenko-b81e0ccdd1c43d2e8e8bef47c511d60e",
        "title": "As Belarus votes in tightly controlled <b>elections</b>, its leader accuses the West of fueling unrest",
        "description": "The authoritarian leader of Belarus has accused the West of trying to foment protests during parliamentary and local elections this month in order to undermine his rule, while the country’s opposition leader-in-exile has called for a boycott of the vote."
    },
    {
        "url": "https://www.foxnews.com/world/south-africa-schedules-election-mandelas-party-fights-retain-30-year-majority",
        "title": "South Africa schedules <b>election</b> as Mandela&#39;s party fights to retain 30-year majority",
        "description": "South Africa has set a national election date of May 29, with this year&#39;s vote expected to be a serious test of the long-ruling African National Congress&#39; stranglehold on power."
    },
    {
        "url": "https://www.yahoo.com/news/whats-primary-election-ballot-central-203004019.html",
        "title": "What&#39;s on the primary <b>election</b> ballot in Central Texas? A look at the races and candidates",
        "description": "Once the Republican and Democratic candidates are settled, Texans in November will cast ballots for a gauntlet of local, state and federal offices."
    },
    {
        "url": "https://www.latimes.com/world-nation/story/2024-02-20/navalnys-mother-appeals-to-putin-to-release-her-sons-body",
        "title": "Navalny’s mother appeals to Putin to release her son’s body",
        "description": "The mother of Russian opposition leader Alexei Navalny appealed to Vladimir Putin to intervene and turn her son’s body over to her."
    },
    {
        "url": "https://news.yahoo.com/south-africa-sets-stage-may-191252805.html",
        "title": "South Africa sets stage for May 29 <b>general election</b>",
        "description": "Three decades after the advent of democracy, South Africa will go to the polls on May 29 for general elections and perhaps the first serious challenge to ANC rule.&quot;This election is a turning point for South Africa,"
    },
    {
        "url": "https://www.nytimes.com/2024/02/20/us/steve-garvey-california-senate.html",
        "title": "Riding His Baseball Fame, Steve Garvey Disrupts the California Senate Race",
        "description": "A fierce contest between Democratic members of Congress has become a strategic battle that could send the 75-year-old Republican to the general election. He still has little chance of winning office,"
    },
    {
        "url": "https://thehill.com/homenews/media/4479134-cnn-reporter-biden-camp-focusing-crazy-s-trump-says/",
        "title": "CNN reporter: Biden camp focusing on ‘crazy s— that Trump says’",
        "description": "A CNN reporter used profane language during a live report on Tuesday about President Biden’s campaign strategy as his campaign looks ahead to a potential general election showdown with"
    },
    {
        "url": "https://www.yahoo.com/news/florida-house-election-bill-sparks-183938595.html",
        "title": "Florida House <b>election</b> bill sparks debate over drop boxes, 2026 gubernatorial runoffs",
        "description": "The Florida House introduced a major elections bill that revives run-off primaries and sparked concerns over voting access."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/nikki-haley-hasnt-yet-won-a-gop-contest-but-vows-to-keep-fighting-trump",
        "title": "Nikki Haley hasn’t yet won a GOP contest, but vows to keep fighting Trump",
        "description": "Haley tells The Associated Press that she will not leave the Republican primary election regardless of Saturday&#39;s result. And she vowed to stay in the fight against Donald Trump at least until after Super Tuesday&#39;s slate of 16 contests on March 5."
    },
    {
        "url": "https://apnews.com/article/south-africa-election-date-anc-ramaphosa-f4ee2cf884ac74b96f5dc3d3f9e3a214",
        "title": "South African president sets May 29 as <b>election</b> day as polls show a drop in support for the ANC",
        "description": "South Africa&#39;s President Cyril Ramaphosa has announced that the highly anticipated national election will be held on May 29."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-jailed-imran-khan-labels-february-8-elections-as-mother-of-all-rigging/articleshow/107861474.cms",
        "title": "Pakistan: Jailed Imran Khan labels February 8 <b>elections</b> as &#39;mother of all rigging&#39;",
        "description": "Former Pakistan Prime Minister Imran Khan condemns the rigging in the February 8 elections and demands the real mandate of the public to be handed over. PTI intensifies its call for the resignation of Chief Election Commissioner Sikandar Sultan Raja."
    },
    {
        "url": "https://finance.yahoo.com/news/proposal-board-directors-ab-volvo-180500144.html",
        "title": "Proposal for Board of Directors of AB Volvo",
        "description": "As previously announced, the Election Committee of AB Volvo proposes Pär Boman to be elected new Chairman of the Board and Board member at the Annual General Meeting on March 27, 2024. The Election Committee also proposes the re-election of the Board members Matti Alahuhta,"
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-vows-stay-presidential-race-south-carolina-rcna139561",
        "title": "‘I refuse to quit’: Nikki Haley vows to stay in the presidential race after South Carolina",
        "description": "Haley, who trails Trump by a wide margin in her home state, made it clear in a Tuesday speech she isn&#39;t going away."
    },
    {
        "url": "https://www.cbsnews.com/news/eric-hovde-wisconsin-u-s-senate-race-democrat-tammy-baldwin/",
        "title": "Real estate developer Eric Hovde enters Wisconsin U.S. Senate race to unseat Democrat Tammy Baldwin",
        "description": "Eric Hovde, who&#39;s running for U.S. Senate in Wisconsin, is the CEO of several companies and is expected to fund his own campaign against Democratic Sen. Tammy Baldwin."
    },
    {
        "url": "https://edition.cnn.com/2024/02/20/politics/joe-biden-donald-trump-wild-comments/",
        "title": "Biden instructed aides to dial up attacks on Trump’s wild comments",
        "description": "President Joe Biden personally directed his senior campaign aides in recent days to focus more aggressively on former President Donald Trump’s inflammatory comments, according to two sources familiar with the president’s edict."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4478891-haley-slams-biden-sounds-like-his-mind-closing-up-shop/",
        "title": "Haley slams Biden: ‘He sounds like his mind is closing up shop’",
        "description": "GOP presidential candidate Nikki Haley slammed President Biden’s cognitive ability during a speech she gave on Tuesday, saying “he sounds like his mind is closing up shop.” Haley said Biden"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13105041/Put-helicopter-drop-Atlantic-Voters-Britains-marginal-seat-deliver-brutal-verdict-Rishi-Sunak-untrustworthy-Keir-Starmer-doesnt-fare-better.html",
        "title": "&#39;Put him on a helicopter and drop it in the Atlantic somewhere&#39;: Voters in Britain&#39;s most marginal seat deliver a brutal verdict on Rishi Sunak... but &#39;untrustworthy&#39; Keir ...",
        "description": "The Prime Minister was described as &#39;not strong enough&#39;, &#39;terrible&#39;, and an &#39;absolute conman&#39; by people in the Tory-held constituency of Bury North, Greater Manchester."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/20/election-updates-nikki-haley-south-carolina-trump-republican-latest?filterKeyEvents=false&page=with:block-65d4dba58f084d7f1c62b5e0",
        "title": "Nikki Haley vows to stay in race ahead of South Carolina speech – live",
        "description": "Former South Carolina governor and last major challenger to Donald Trump will deliver remarks about the 2024 race ahead of Saturday’s primary"
    },
    {
        "url": "https://abcnews.go.com/International/wireStory/bank-england-uk-recession-modest-historical-terms-upturn-107368925",
        "title": "Bank of England says UK recession is modest in historical terms",
        "description": "Bank of England Gov. Andrew Bailey says the U.K.’s economic recession, which was confirmed last week, is modest by historical standards and is probably over"
    },
    {
        "url": "https://www.reuters.com/world/us/biden-campaign-democrats-rake-42-mln-january-fundraising-2024-02-20/",
        "title": "Biden campaign, Democrats rake in $42 million in January fundraising",
        "description": "U.S. President Joe Biden&#39;s re-election campaign and his Democratic Party allies raised more than $42 million in January and have $130 million cash-on-hand as they prepare for a likely general election contest against Republican Donald Trump."
    },
    {
        "url": "https://finance.yahoo.com/news/notice-annual-general-meeting-citycon-151800646.html",
        "title": "Notice of the Annual <b>General</b> Meeting of Citycon Oyj",
        "description": "General Meeting (the &quot;General Meeting&quot;) of Citycon Oyj (the &quot;Company&quot;) will be held on Tuesday, 19 March 2024 at 12:00 noon (EET). The General Meeting will be held without a meeting venue using remote connection in real time,"
    },
    {
        "url": "https://www.politico.com/news/2024/02/20/dnc-challenge-rnc-arizona-election-manual-00142156",
        "title": "DNC intervenes in GOP effort to nullify Arizona <b>election</b> manual",
        "description": "Democrats are challenging a Republican effort to nullify the manual used to oversee Arizona election rules and results."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/nikki-haley-2024-election-trump-south-carolina-b2499363.html",
        "title": "Watch live: Nikki Haley speaks after vowing to stay in presidential race",
        "description": "Watch live as Nikki Haley delivers a speech in South Carolina on Tuesday, 20 February after vowing not to leave the Republican primary election."
    },
    {
        "url": "https://www.wsj.com/politics/elections/biden-campaign-reports-42-million-in-january-fundraising-8e477187",
        "title": "Biden Campaign Reports $42 Million in January Fundraising",
        "description": "President Biden’s re-election effort continued a strong fundraising streak as he and Donald Trump are increasingly likely to face each other in the general election."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/20/idaho-voting-faq/72427267007/",
        "title": "Idaho voting FAQ",
        "description": "There is no absentee voting for caucuses, as that&#39;s in-person voting only."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/nawaz-sharifs-party-says-pakistans-electoral-history-not-perfect/articleshow/107858273.cms",
        "title": "Nawaz Sharif&#39;s party says Pakistan&#39;s electoral history not perfect",
        "description": "The Pakistan Muslim League-Nawaz (PML-N) criticized the 2018 general elections in Pakistan, calling it a &#39;dark chapter&#39; in the country&#39;s history. PML-"
    },
    {
        "url": "https://www.marketwatch.com/story/republican-senate-hopefuls-seek-trump-endorsement-just-not-in-pennsylvania-b561e2b2",
        "title": "Republican Senate hopefuls seek Trump endorsement. Just not in Pennsylvania.",
        "description": "Since he became the single biggest force in Republican politics nearly a decade ago, Donald Trump has figured prominently in"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/20/democrats-seek-to-intervene-in-election-lawsuits/72662660007/",
        "title": "Democrats want a say in lawsuits challenging Arizona&#39;s <b>election</b> guidelines",
        "description": "The Democrats argue they need to intervene in the lawsuit to protect voters from intimidation and harassment while casting a ballot. In 2022, observers, some carrying weapons, posted themselves near drop boxes. Other observers tried to question and photograph voters who were dropping off their ballots, leading to complaints of intimidation."
    },
    {
        "url": "https://www.politico.com/newsletters/weekly-score/2024/02/20/state-gops-line-up-behind-trump-00142121",
        "title": "State GOPs line up behind Trump",
        "description": "A handful of state Republican Parties or their chairs have thrown their backing behind Trump’s presidential bid — long before voters in their states hit the polls."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-lancashire-68348594?at_ptr_name=twitter&at_link_id=40586C20-CFE8-11EE-8D1D-CE1C55826ABF&at_link_origin=BBCPolitics&at_bbc_team=editorial&at_link_type=web_link&at_campaign_type=owned&at_format=link",
        "title": "Scott Benton: Lobbying scandal MP loses suspension appeal",
        "description": "Blackpool South MP Scott Benton, who was caught in a lobbying scandal, has lost his appeal against a 35-day suspension from Parliament. MPs will now vote whether to trigger a recall petition that could force a by-election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/rishi-sunak-keir-starmer-approval-gap-tory-election/?utmsource=email",
        "title": "Sunak and Starmer approval gap widest ever after Tory by-<b>election</b> defeats",
        "description": "A survey conducted by Deltapoll gave Rishi Sunak a net approval rating of minus 43 Credit: ADRIAN DENNIS/REUTERS Rishi Sunak’s approval rating has plummeted in the wake of the Conservatives’ by-election defeats,"
    },
    {
        "url": "https://edition.cnn.com/2024/02/20/politics/joe-biden-fundraising-january/",
        "title": "Biden draws in $42 million in January amid a fresh round of Democratic handwringing",
        "description": "President Joe Biden raised more than $42 million for his presidential campaign and the Democratic Party in January, a sizable haul that shows the party’s donor class is still firmly behind the president despite anxiety around his reelection run."
    },
    {
        "url": "https://www.thetimes.co.uk/article/just-stop-oil-candidates-elections-politicians-labour-mps-dnsqm9zqp",
        "title": "Just Stop Oil to fight Labour at <b>elections</b> if its demands are rejected",
        "description": "Just Stop Oil plans to stand against Labour in the general election if its MPs and candidates do not sign a pledge to resign if a Labour government refuses to cancel oil and gas licences granted by the Tories."
    },
    {
        "url": "https://www.bbc.com/news/articles/cp490rp287wo.amp",
        "title": "Cost of living fears rife in <b>election</b> battleground",
        "description": "As a general election looms, the 20-year-old from from Rhyl, Denbighshire, wants more intervention from politicians to ease the cost of living crisis. She still lives with her dad and pays him a quarter of her £400-a-week wages in rent."
    },
    {
        "url": "https://www.ft.com/content/f998d7cf-e330-49fa-9ada-6d62961bcea5",
        "title": "‘On a knife edge’: Humza Yousaf seeks to fend off Labour in Scotland",
        "description": "Since Nicola Sturgeon stepped down as Scotland’s first minister last March, a police investigation into Scottish National party finances has handed her successor a toxic inheritance as he faces a fierce general election battle with a resurgent Labour party."
    },
    {
        "url": "https://abcnews.go.com/US/letitia-james-shes-prepared-seize-trumps-assets-pay/story?id=107381482",
        "title": "Letitia James says she&#39;s prepared to seize Trump&#39;s assets if he can&#39;t pay his $354M civil fraud fine",
        "description": "New York AG Letitia James tells ABC News that she is prepared to seize Donald Trump&#39;s assets if he is unable to pay the $354 million fine in his civil fraud case."
    },
    {
        "url": "https://www.politico.com/newsletters/inside-congress/2024/02/20/dems-israel-divide-takes-toll-on-progressive-caucus-00142276",
        "title": "Dems’ Israel divide takes toll on Progressive Caucus",
        "description": "The latest sign of existential angst: Rep. Ritchie Torres (D-N.Y.) has quietly left the Congressional Progressive Caucus over its treatment of the Israel-Hamas war, according to a person familiar with the situation. He’s no longer listed on the nearly 100-member bloc’s website."
    },
    {
        "url": "https://nypost.com/2024/02/20/us-news/biden-laughs-off-question-about-gavin-newsom-being-democrats-plan-b/",
        "title": "Biden laughs off question about Gavin Newsom being Democrats’ ‘Plan B’ in 2024",
        "description": "If Biden were to abruptly drop out, there could be a scramble for the nomination featuring Newsom and others, such as Vice President Kamala Harris and Govs. Gretchen Whitmer of Michigan, Phil Murphy of New Jersey, Josh Shapiro of Pennsylvania and Jared Polis of Colorado."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4478537-haley-says-wont-drop-out-regardless-south-carolina-gop-primary-result-2024-election/",
        "title": "Haley says she won’t drop out, regardless of South Carolina primary result",
        "description": "Republican presidential candidate Nikki Haley said she will not drop out of the race regardless of the results of Saturday’s South Carolina primary even as polls show her trailing former President"
    },
    {
        "url": "https://finance.yahoo.com/news/election-2024-5-ways-could-123007520.html",
        "title": "<b>Election</b> 2024: 5 Ways It Could Help Bitcoin Continue To Skyrocket",
        "description": "Bitcoin has been off to a great start in 2024, with the asset breaching the $50,000 ceiling earlier this month, a feat which hasn&#39;t happened since 2021. Yet in an election cycle that is making"
    },
    {
        "url": "https://inews.co.uk/opinion/politicians-rural-posturing-isnt-fooling-our-farmers-2916317?ico=related_article_inline",
        "title": "Politicians’ rural posturing isn’t fooling our farmers",
        "description": "Labour has declared it will “fully ban fox hunting ”, which it believes to be an issue which divides rural areas to its advantage as fewer locals have contact with hunting sports and many of the grand old hunts are now as likely to be full of “Down/Up from Londoners” riding to hounds as the local mix of aristos and home-grown enthusiasts."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/nikki-haley-won-gop-contest-shes-vowing-fighting-107368451",
        "title": "Nikki Haley hasn&#39;t yet won a GOP contest. But she&#39;s vowing to keep fighting Donald Trump",
        "description": "Nikki Haley&#39;s allies are bracing for a big loss in her home state’s primary election in South Carolina on Saturday"
    }
]