[
    {
        "url": "https://edition.cnn.com/2024/02/07/opinions/supreme-court-dont-let-trump-delay-douglas/index.html",
        "title": "Opinion: Trump is hoping to delay his trial. The Supreme Court shouldn’t take the bait",
        "description": "The Supreme Court should decline any move for a stay and instead allow the trial to proceed, says Joshua A. Douglas. The country needs to know whether Trump is convicted of these crimes before the November election."
    },
    {
        "url": "https://www.huffpost.com/entry/haley-nevada-disaster_n_65c3ee3fe4b093b2e7821b7d",
        "title": "Haley&#39;s Nevada Loss To &#39;None Of The Above&#39; Provides Ominous Warning For Super Tuesday",
        "description": "Haley’s campaign explained the result as unsurprising since she spent no money to win there — but that’s also largely true of the 15 states voting on March 5."
    },
    {
        "url": "https://www.ft.com/content/c433bc0d-13cb-4708-86a6-f4d6a7f1163e",
        "title": "FirstFT: China replaces head of market regulator as it battles sell-off",
        "description": "Also in today’s newsletter, Netanyahu rejects ‘delusional’ Hamas terms for hostage deal and Alibaba puts IPO for its logistics arm on hold"
    },
    {
        "url": "https://edition.cnn.com/2024/02/07/americas/venezuela-election-immigration-maduro-biden-intl/index.html?ref=mc.news",
        "title": "Maduro’s immigration card could influence America’s <b>election</b>, not just Venezuela’s",
        "description": "What happens in the South American country this year could have an impact on Joe Biden’s hopes for reelection."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68227690",
        "title": "Pakistan: Two fatal blasts cause chaos ahead of <b>election</b>",
        "description": "Video from the Qillah Saif Ullah district in Pakistan shows chaos and panic after a fatal blast, on the eve of the country&#39;s general election day. Elsewhere, a separate blast killed at least 12 people outside a independent candidate&#39;s party office in the Pishin district."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-open-minded-social-media-ban-under-16s-2895453?ico=most_popular",
        "title": "Labour ‘open-minded’ to social media ban for under-16s",
        "description": "Labour has said it is “open-minded” about banning social media for under-16s following calls for a change in the laws from the mother of murdered teenager Brianna Ghey."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68232370",
        "title": "Row erupts over cost of Labour&#39;s home insulation plan",
        "description": "Labour has rejected as &quot;bogus&quot; an analysis by government officials that its plan to improve home energy efficiency would cost £12-15bn a year. The party has said the measures, part of a wider £28bn green investment plan, would be capped at £6bn a year."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/07/congress-ukraine-israel-aid-trump-haley-campaign-politics-updates?page=with:block-65c3db6a8f08db8c5981f2c9",
        "title": "Top Senate Democrat tees up two votes on Israel and Ukraine aid - one with border security, one without - live",
        "description": "Chuck Schumer announces two votes: one will include hardline immigration policies and one will not"
    },
    {
        "url": "https://www.radio.gov.pk/07-02-2024/info-minister-assures-possible-facilitation-to-media-on-polling-day",
        "title": "Info Minister assures every possible facilitation to media on polling day",
        "description": "Minister for Information and Broadcasting Murtaza Solangi launched Media Facilitation Center regarding the coverage of general elections at Press Information Department in Islamabad on Wednesday. Speaking on the occasion, the Information Minister assured to extend every possible help and facilitation to the journalists on the polling day."
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/02/07/the-settled-will/",
        "title": "The Settled Will",
        "description": "How do you understand the latest polling from IPSOS which puts the SNP ahead of Labour by seven points and predicts they would pick up 40 seats in the next General Election? At the last general"
    },
    {
        "url": "https://betting.betfair.com/politics/us-politics/2024-us-election-odds-should-donald-trump-be-the-favourite-070224-171.html",
        "title": "US <b>Election</b> 2024: Should Donald Trump be the favourite?",
        "description": "US Election 2024 betting and odds update from Paul Krishnamurty who asks if Donald Trump should be the favourite and discusses Joe Biden&#39;s chances of re-election"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/07/bombings-at-election-offices-in-pakistan?ref=upstract.com",
        "title": "Islamic State claims responsibility for bombings on eve of Pakistan <b>election</b>",
        "description": "Party office and that of an independent candidate were hit in Balochistan province on day before vote"
    },
    {
        "url": "https://uk.news.yahoo.com/bill-india-govern-unwed-couples-180751895.html",
        "title": "A New Bill in India Will Govern Unwed Couples Who Live Together",
        "description": "Uttarakhand, a Himalayan state in northern India, has become the first to pass a new law that governs the personal lives of Indian citizens."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/07/nawaz-sharif-imran-khan-pakistan-election-dispatch/",
        "title": "Sharif’s lackluster campaign exudes <b>election</b> confidence as Khan buried under criminal sentences",
        "description": "In what should be the final push ahead of Thursday’s election, the former Pakistani prime minister is merely going through the motions"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13057695/King-Charles-brief-personal-phone-call-Rishi-Sunak-resume-person-audiences-Prime-Minister-two-weeks-time.html",
        "title": "King Charles has &#39;brief personal phone call&#39; with Rishi Sunak but will resume in-person audiences with the Prime Minister in two week&#39;s time, Palace says as monarch battles cancer",
        "description": "King Charles has had a &#39;brief personal call&#39; with Rishi Sunak today but is set to resume in-person audiences with the Prime Minister, Buckingham Palace says. The 75-year-old monarch had his weekly audience today over the phone following his cancer diagnosis."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/nevada-primary-results-nikki-haley-updates-b2492058.html",
        "title": "Nevada primary results – live: Humiliation for Nikki Haley as she loses to ‘none of the above’",
        "description": "Joe Biden wins Democratic primary with ease, as Donald Trump is expected to do in GOP caucus on Thursday, handing him a further 26 Republican delegates and taking him a step closer to securing nominat"
    },
    {
        "url": "https://www.standard.co.uk/news/uk/rwanda-safe-country-uk-government-position-b1137648.html",
        "title": "Is Rwanda a safe country? The Government&#39;s position on sending asylum seekers to the country",
        "description": "The Rwanda Safety Bill has been dogged by setbacks and controversy but the prime minister is determined to press on with it"
    },
    {
        "url": "https://www.theambler.co.uk/2024/02/07/reports-form-our-county-councillors-144/",
        "title": "Reports form our County Councillors #144",
        "description": "Voters will need to show an accredited form of photographic identification in order to receive their ballot paper(s) to cast their vote at polling stations for local Mayor and Police Crime Commissioner 2024 elections,"
    },
    {
        "url": "https://www.heraldscotland.com/news/24104532.snap-general-election-know-mid-march/",
        "title": "Snap <b>general election</b>? Why we’ll know by mid March",
        "description": "Around Westminster and Holyrood, at meetings of local party groups, and indeed in newsrooms up and down the country, everyone is wondering &#39;when is the <b>general election</b>?&#39; But shortly after the Christmas break Rishi Sunak told journalists his working ..."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/tory-mp-nickie-aiken-to-stand-down-while-government-comms-chief-husband-quits-99542/",
        "title": "Tory MP Nickie Aiken to stand down while Government comms chief husband quits",
        "description": "Alex Aiken will leave the Civil Service to take up a new job as a communications adviser to the United Arab Emirates government."
    },
    {
        "url": "https://www.thetimes.co.uk/article/snps-lead-over-labour-is-narrowing-poll-shows-hvvqt2gvv",
        "title": "SNP’s lead over Labour is narrowing, poll shows",
        "description": "Labour has narrowed its gap with the SNP in voting for the next general election, according to the latest polling. The SNP remains ahead in Westminster voting intentions with a seven-point lead over Labour,"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68226516?at_medium=RSS&at_campaign=KARANGA",
        "title": "Pakistan <b>election</b>: Two blasts kill 28 in Balochistan day before vote",
        "description": "Two bomb explosions have killed at least 20 people in Pakistan&#39;s Balochistan province on the eve of general elections, officials say. The first blast killed 12 people in front of an independent candidate&#39;s party office in Pishin district."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13056703/Nickie-Aiken-latest-Tory-MP-announce-shes-quitting-general-election-Whitehall-mandarin-husband-lands-job-UAE.html",
        "title": "Nickie Aiken becomes the latest Tory MP to announce she&#39;s quitting at the <b>general election</b> after her Whitehall mandarin husband lands a top spin doctor job with the UAE",
        "description": "Nickie Aiken today became the latest Tory MP to announce she&#39;s quitting at the general election after her Whitehall mandarin husband landed a top job with the UAE."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155089/rochdale-byelection-green-party-candidate-removed-just-weeks-before-voters-go-to-the-polls",
        "title": "Rochdale by-<b>election</b>: Green Party candidate removed just weeks before voters go to the polls",
        "description": "The Green Party candidate for the Rochdale by-election has been removed from his position as candidate just days"
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155089/rochdale-byelection-green-party-candidate-no-longer-endorsed-by-party-just-weeks-before-voters-go-to-the-polls",
        "title": "Rochdale by-<b>election</b>: Green Party candidate no longer endorsed by party just weeks before voters go to the polls",
        "description": "The candidate for the Green Party at the Rochdale by-election is no longer being endorsed by the party, it has"
    },
    {
        "url": "https://www.abergavennychronicle.com/news/politics/plans-for-automatic-voter-registration-in-wales-move-a-step-closer-664846",
        "title": "Plans for automatic voter registration in Wales move a step closer",
        "description": "Plans to introduce automatic voter registration in Wales moved a step closer as proposed legislation cleared its first hurdle in the Senedd."
    },
    {
        "url": "https://bylinetimes.com/2024/02/07/its-like-gb-news-regulating-ofcom-house-of-lords-slams-new-government-imposed-strategy-for-elections-watchdog/",
        "title": "‘It’s Like GB News Regulating Ofcom’: House of Lords Slams New Government-Imposed Strategy for <b>Elections</b> Watchdog",
        "description": "Levelling Up secretary Michael Gove now sets the overarching &quot;strategy and policy&quot; of the previously independent Electoral Commission."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/uk-general-election-poll-tracker-conservative-labour/?utmsource=email",
        "title": "<b>General election</b> poll tracker",
        "description": "The Conservatives&#39; progress in the polls since Liz Truss&#39;s resignation &quot;approximates zero&quot;, a leading <b>elections</b> expert has said. The Telegraph&#39;s polling tracker shows Labour holding onto a lead of around 20 points for the fifteenth week. The last time the ..."
    },
    {
        "url": "https://news.sky.com/story/electoral-dysfunction-a-new-podcast-from-sky-news-13065552",
        "title": "Electoral Dysfunction - A new podcast from Sky News",
        "description": "Follow Electoral Dysfunction on Apple Podcasts, Spotify, Spreaker or wherever you get your podcasts."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/nhs-dentist-cost-private-general-election-b2492392.html",
        "title": "Why the state of our teeth could become an <b>election</b> issue",
        "description": "Dentistry could now join hospital waiting lists as a potential <b>election</b> issue for the prime minister. Perhaps the most graphic reason is pictures of a huge queue of people trying to register as NHS patients at a new dental surgery in Bristol; the images ..."
    },
    {
        "url": "https://www.ottumwacourier.com/news/local_news/council-votes-down-elections-ordinance/article_190c535c-c5d9-11ee-af4c-b33b1b37f6a0.html",
        "title": "Council votes down <b>elections</b> ordinance",
        "description": "Instead, nominees who meet petition criteria (75 signatures) would all appear on one <b>general election</b> ballot and the top vote-getters would win the seats based on <b>election</b> results. Chapter 45 would also save the city $10,000 or more to not run a primary ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082?ico=most_read_by_subscribers",
        "title": "Tories planning for two back-to-back <b>general</b> <b>elections</b>",
        "description": "Tory party strategists are privately planning for two <b>general</b> <b>elections</b> in quick succession amid a growing belief that the first result could be tighter than national opinion polls suggest, i has been told. While the Conservatives’ prevailing opinion is ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/govt-to-roll-out-digital-ad-policy-soon-thakur/articleshow/107504433.cms",
        "title": "Govt to roll out ‘digital ad policy’ soon: Thakur",
        "description": "I&amp;B minister Anurag Thakur announced the upcoming digital advertising policy to support India&#39;s digital news media industry. The policy aims to addres"
    },
    {
        "url": "https://news.yahoo.com/divided-house-passes-virginia-beach-220200110.html",
        "title": "Divided House passes Virginia Beach charter bill on <b>election</b> districts",
        "description": "State delegates approved a contentious bill Wednesday that will align the city’s election system with its charter, sending it on the way to the governor’s desk. Because the bill changed the city’s charter,"
    },
    {
        "url": "https://www.barrons.com/news/un-strongly-condemns-pakistan-bomb-attacks-on-election-eve-ccea5a0c",
        "title": "UN &#39;Strongly&#39; Condemns Pakistan Bomb Attacks On <b>Election</b> Eve",
        "description": "UN Secretary-General Antonio Guterres has firmly condemned the deadly bomb attacks Wednesday in southwest Pakistan, his spokesperson said, adding they were &quot;clearly related to the elections&quot; being held the next day."
    },
    {
        "url": "https://finance.yahoo.com/news/watts-water-technologies-inc-elects-213000412.html",
        "title": "Watts Water Technologies, Inc. Elects Rebecca Boll to Its Board of Directors",
        "description": "Watts Water Technologies, Inc. (NYSE: WTS), today announced the election of Rebecca J. Boll as a member of the Board of Directors. Ms. Boll was also appointed by the Board to serve as a member of each of the Governance and Sustainability Committee and Audit Committee of the Board of Directors."
    },
    {
        "url": "https://www.reuters.com/legal/florida-top-court-weighs-letting-voters-decide-abortion-rights-amendment-2024-02-07/",
        "title": "Florida top court weighs letting voters decide abortion rights amendment",
        "description": "Florida&#39;s attorney general on Wednesday urged the state&#39;s highest court to block voters from deciding whether to amend the state constitution to protect abortion, arguing the measure was misleading and unclear."
    },
    {
        "url": "https://www.businesswire.com/news/home/20240206129670/en/Great-Scott-Media-A-Scott-Bolden-Providing-Sought-After-Legal-Commentary-About-Top-Issues-in-the-News-on-BBC-News-CNN-Capital-Report-Fox-MSNBC-NewsNation-Other-Platforms/",
        "title": "Great Scott Media: A Scott Bolden Providing Sought-After Legal Commentary About Top Issues in the News on BBC News, CNN, Capital Report, Fox, MSNBC, NewsNation &amp; Other Platforms",
        "description": "A Scott Bolden, attorney, has expanded his legal and political media commentating on white collar crime cases, racial injustice &amp; the 2024 election."
    },
    {
        "url": "https://arstechnica.com/tech-policy/2024/02/texas-firm-allegedly-behind-fake-biden-robocall-that-told-people-not-to-vote/",
        "title": "Texas firm allegedly behind fake Biden robocall that told people not to vote",
        "description": "An anti-voting robocall that used an artificially generated clone of President Biden&#39;s voice has been traced to a Texas company called Life Corporation &quot;and an individual named Walter Monk,&quot; according to an announcement by New Hampshire Attorney General John Formella yesterday."
    },
    {
        "url": "https://www.politico.com/news/2024/02/07/haley-biden-trump-wisconsin-poll-00140200",
        "title": "New Wisconsin poll shows Trump tied with Biden, Haley ahead by 15 points",
        "description": "A new Marquette Law School poll in Wisconsin showed Haley leading President Joe Biden by 15 percentage points among likely voters, 57 percent to 42 percent. Trump, meanwhile, was neck-and-neck with Biden, 50 percent to 49 percent, a result well within the poll’s margin of error of plus or minus 4.4 percentage points."
    },
    {
        "url": "https://www.washingtonpost.com/washington-post-live/2024/02/07/transcript-election-2024-post-political-roundtable/",
        "title": "Transcript: <b>Election</b> 2024: The Post Political Roundtable",
        "description": "SULLIVAN: Hello, everyone, and welcome back to “Election 2024: The Post Political Roundtable.” I’m Sean Sullivan, campaign editor here at The Washington Post, and today we continue our conversation about the 2024 election with some of the top journalists in our newsroom."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4454251-biden-trump-deadlocked-in-wisconsin-poll-of-registered-voters/",
        "title": "Biden, Trump deadlocked in Wisconsin poll of registered voters",
        "description": "President Biden and former President Trump are deadlocked in a new poll of registered voters in Wisconsin, a key swing state. A new Marquette Law School Poll survey of Wisconsin voters finds Biden"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-open-minded-social-media-ban-under-16s-2895453?ico=related_stories",
        "title": "Labour ‘open-minded’ to social media ban for under-16s",
        "description": "Labour has said it is “open-minded” about banning social media for under-16s following calls for a change in the laws from the mother of murdered teenager Brianna Ghey. Esther Ghey, whose daughter was brutally murdered partly as a result of her transgender identity,"
    },
    {
        "url": "https://www.politico.com/news/2024/02/07/trump-supreme-court-lawyers-00139974",
        "title": "Meet the lawyers arguing the Trump ballot case at the Supreme Court",
        "description": "On Trump’s side is a prominent Texas conservative. Arguing against him are two Colorado lawyers making their Supreme Court debuts."
    },
    {
        "url": "https://www.yahoo.com/news/trumps-ballot-eligibility-headed-supreme-110017180.html",
        "title": "Trump&#39;s ballot eligibility is headed to the Supreme Court. Here&#39;s what to know.",
        "description": "The justices will be wading into uncharted legal waters to hear a case that could have sweeping ramifications for the 2024 presidential race."
    },
    {
        "url": "https://news.yahoo.com/voter-guide-march-5-primary-192351496.html",
        "title": "VOTER GUIDE: Here’s who, what’s on the March 5 primary ballot in Fresno, San Joaquin Valley",
        "description": "Welcome to The Fresno Bee’s Voter Guide to California’s March 5 primary election. Early mail-in voting for the March 5 presidential primary election opened this week, and voters in various parts of Fresno and Fresno County have much more to choose than simply who will advance to the general election in November."
    },
    {
        "url": "https://www.inc.com/melissa-angell/regulators-call-for-ban-of-ai-robocalls-after-bidens-alleged-deep-fake-culprit-emerges-in-texas.html",
        "title": "Regulators Call for Ban of AI Robocalls After Biden&#39;s Alleged Deep Fake Culprit Emerges in Texas",
        "description": "The New Hampshire Attorney General on Tuesday announced that the call&#39;s origin was traced back to the Arlington, Texas-based Life Corporation, a company owned by a man named Walter Monk. The contact button on Life Corporation&#39;s webpage appeared to be disabled on Wednesday."
    },
    {
        "url": "https://abcnews.go.com/Business/wireStory/virginia-democrats-sending-gun-control-bills-skeptical-gov-107035088",
        "title": "Virginia Democrats are sending gun-control bills to a skeptical Gov. Youngkin",
        "description": "Dozens of pieces of gun-related legislation that advocates say will bolster public safety are winding their way through Virginia’s Democratic-controlled General Assembly"
    },
    {
        "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/verdict-on-sustainability-of-regional-business-models-will-be-out-soon-britannia-md-varun-berry/articleshow/107503316.cms",
        "title": "Verdict on sustainability of regional business models will be out soon: Britannia MD Varun Berry",
        "description": "Varun Berry, the Executive Vice-Chairman and Managing Director of Britannia, remarked that regional competitors offer products at lower prices and provide greater margins to retailers. However, the sustainability of these competitors will depend on consumer demand in the coming months."
    },
    {
        "url": "https://www.usnews.com/news/world/articles/2024-02-07/islamic-state-claims-responsibility-for-blast-in-southwestern-pakistan-groups-telegram-channel",
        "title": "Islamic State Claims Responsibility for Blast in Southwestern Pakistan -Group&#39;s Telegram Channel",
        "description": "(Reuters) - Islamic state claimed the responsibility for a blast in southwestern Pakistan, the group&#39;s Telegram channel said on Wednesday."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-07/blasts-pakistan-candidates-offices-kill-on-election-eve/103439686",
        "title": "Blasts near Pakistan national political candidates&#39; offices kill at least 30 on eve of <b>election</b>",
        "description": "Two blasts near the offices of electoral candidates in Pakistan&#39;s south-west have killed dozens of people and injured many more, raising concerns about security in the lead-up to today&#39;s national election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mike-freer-conservative-london-finchley-golders-green-b1137730.html",
        "title": "Man admits calling Tory MP’s office and saying: ‘I’m coming for you’",
        "description": "James Phillips appeared at Westminster Magistrates’ Court on Wednesday. A 46-year-old man has admitted calling the office of Tory MP Mike Freer and saying: “I’m coming for you” last week."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/national/tory-mp-nickie-aiken-to-stand-down-while-government-comms-chief-husband-quits-99542/",
        "title": "Tory MP Nickie Aiken to stand down while Government comms chief husband quits",
        "description": "Alex Aiken will leave the Civil Service to take up a new job as a communications adviser to the United Arab Emirates government."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/neil-kinnock-labour-poll-lead-general-election-mandelson/",
        "title": "Lord Kinnock warns Starmer: 20-point lead ‘still not conclusive enough’ for <b>election</b> win",
        "description": "Former Labour leader says party is not going to lose national vote but argues ‘that’s not the same thing as winning’ with working majority"
    },
    {
        "url": "https://www.huffpost.com/entry/opinion-black-men-supporting-trump-2024-election_n_65c2c020e4b0dbc806ae8577?ncid=engmodushpmg00000003",
        "title": "The Sad State Of Affairs When Black Men Stump For Trump",
        "description": "A New York Times-Siena College poll from October revealed that 22% of Black voters in six battleground states would support Trump in a general election held at the time."
    },
    {
        "url": "https://uk.news.yahoo.com/pakistan-election-2024-does-candidates-135711190.html",
        "title": "Pakistan <b>election</b> 2024: how does it work and who are the candidates?",
        "description": "Pakistanis will take to the polls on February 8 to vote for the country&#39;s next government. In what is one of the first national elections of 2024, up to 128 million registered voters nationwide will get the chance to have their say this week."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/07/rishi-sunak-pmqs-victoria-atkins-labour-conservatives-nhs-dentists-politics-live?page=with:block-65c389b78f08d10a917c9c64",
        "title": "No 10 refuses to apologise after Sunak makes trans jibe while Brianna Ghey’s mother watched PMQs from gallery – UK politics live",
        "description": "Downing Street says it was ‘legitimate’ for PM to highlight Starmer’s ‘U-turns’ despite strong condemnation Sunak’s comments"
    },
    {
        "url": "https://www.bbc.co.uk/mediacentre/articles/2024/5live-sports-extra/",
        "title": "Proposed changes to 5 Live Sports Extra",
        "description": "Live is thriving with an engaged and varied audience who know their voices are shared, valued and represented across news, current affairs and sport. We provide unrivalled coverage and commentary from the heart of the action at the biggest sporting events including live coverage on 5 Sports Extra,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/pakistan-election-explosion-blast-imran-khan-kmqkt8tbr",
        "title": "Pakistan <b>election</b>: Bomb explosions targeting political parties kill 27",
        "description": "Twin bomb blasts have killed at least 27 people and injured dozens more in Pakistan on the eve of the country’s delayed general election. The attacks targeted political parties in the country’s restive southwestern Balochistan province."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13055811/Imran-Jemima-Khans-UK-based-children-receive-death-threats-Pakistan-prepares-one-bloodiest-elections-dozens-killed-bomb-blasts-hours-polls-open.html",
        "title": "Imran and Jemima Khan&#39;s UK-based children receive death threats as Pakistan prepares for one of its bloodiest-ever <b>elections</b> - with dozens killed in bomb blasts hours before ...",
        "description": "Suleman Khan, 27, and Qasim Khan, 25, received &#39;threats of violence&#39; should they ever go to visit their father, former prime minister Imran Khan, in prison in Pakistan."
    },
    {
        "url": "https://www.bbc.com/news/av/world-asia-68227690",
        "title": "Pakistan: Two fatal blasts causes chaos ahead of <b>election</b>",
        "description": "Video from the Qillah Saif Ullah district in Pakistan shows chaos and panic after a fatal blast, on the eve of the country&#39;s general election day. Elsewhere, a separate blast killed at least 12 people outside a independent candidate&#39;s party office in the Pishin district."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25778571/tax-jeremy-hunt-row-starmer-green-plan-28-billion/",
        "title": "Treasury claim Labour plan leaves £13 billion black hole – sparking tax hike fears",
        "description": "LABOUR’S home insulation scheme will cost more than DOUBLE their £6 billion estimates, the Treasury claim. Ministers have triggered a fresh £28 billion borrowing by using officials to knock down"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-mps-who-stepping-down-32050068",
        "title": "All the Labour MPs who are stepping down at the next UK <b>general election</b>",
        "description": "Dozens of MPs from all parties have said they will quit the Westminster life rather than slug it out at the next election after a Parliament dogged by chaos and calamity"
    },
    {
        "url": "https://edition.cnn.com/2024/02/07/politics/democrats-biden-election-polling/index.html",
        "title": "Why Democrats should worry about Biden’s polling",
        "description": "The political eyes of the world are on Nevada this week for the state’s Democratic and Republican nominating contests. President Joe Biden easily won the Democratic primary on Tuesday while former President Donald Trump is expected to coast in the GOP caucuses on Thursday."
    },
    {
        "url": "https://www.ft.com/content/444e7854-97bd-414d-8a37-a686a585cac3",
        "title": "As Liz Truss pops up, talk turns to the next Tory leader",
        "description": "A successful coup against Rishi Sunak still looks unlikely, but the direction of the party could shift post-election as MPs’ fears change"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-eyes-october-general-32064849",
        "title": "Rishi Sunak &#39;eyes October <b>general election</b>&#39; to avoid clash with US presidential race",
        "description": "Concerns have been raised about the UK general election overlapping with the US presidential race in November, and potential global chaos triggered by a Donald Trump victory"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/october-election-rishi-sunak-donald-trump-b2491958.html",
        "title": "Rishi Sunak eyeing early October <b>election</b> to avoid clash with US",
        "description": "The general election was previously tipped for the week after the US presidential election but insiders are concerned about logistics"
    },
    {
        "url": "https://edition.cnn.com/videos/world/2024/02/07/exp-pakistan-elections-preview-coren-pkg-020701aseg1-cnni-world.cnn?ref=upstract.com",
        "title": "Pakistan on edge as it gears up for its <b>general election</b>",
        "description": "The South Asian nation heads to the polls on Thursday for a widely anticipated general election in which its widely popular former leader Imran Khan is barred from standing."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/uk-general-election-poll-tracker-conservative-labour/",
        "title": "<b>General election</b> poll tracker",
        "description": "The Telegraph&#39;s polling tracker shows Labour holding onto a lead of around 20 points for the fifteenth week. The last time the Tories were ahead of the Opposition was late 2021. Sir John Curtice said that the Conservatives faced a “brutal problem” in the polls in that they had made little progress in months."
    },
    {
        "url": "https://www.thesun.co.uk/news/25767566/rishi-sunak-general-election-october-avoid-trump-clash/",
        "title": "Rishi Sunak poised to call <b>General Election</b> in October amid worries of ‘upheaval’ if Trump wins US <b>election</b>",
        "description": "RISHI Sunak is “moving away” from holding the election in November with October eyed instead, The Sun can reveal. Concerns over massive global insecurity triggered by the potential return of"
    },
    {
        "url": "https://www.independent.co.uk/asia/south-asia/pakistan-bomb-blast-elections-balochistan-latest-news-b2491941.html",
        "title": "At least 8 people killed in blast near <b>election</b> office in Pakistan’s southwest",
        "description": "At least eight people were killed and several suffered injuries in a blast near an election office in Balochistan province, just a day ahead of Pakistan&#39;s crucial general elections."
    }
]