[
    {
        "url": "https://edition.cnn.com/2024/01/25/politics/nikki-haley-trump-republican-primary/index.html",
        "title": "Haley remains defiant as Trump ratchets up attacks on last-standing 2024 GOP rival",
        "description": "Former South Carolina Gov. Nikki Haley is growing more defiant in the face of Donald Trump’s efforts to push her out of the 2024 Republican primary race, poking and prodding at the former president and encouraging supporters to wear Trump’s attacks as a badge of honor."
    },
    {
        "url": "https://www.foxnews.com/politics/iowa-secretary-state-introduces-bill-could-limit-14th-amendment-ballot-challenges-trump",
        "title": "Iowa secretary of state introduces bill that could limit 14th Amendment ballot challenges against Trump",
        "description": "Iowa Secretary of State Paul Pate introduced a bill that could limit challenges to former President Trump being on the ballot under the 14th Amendment."
    },
    {
        "url": "https://www.nbcnews.com/politics/donald-trump/trump-cites-allegations-improper-relationship-effort-dismiss-georgia-e-rcna135729",
        "title": "Trump cites allegations of improper relationship in effort to dismiss Georgia <b>election</b> charges",
        "description": "A Trump co-defendant in the election interference case alleged this month that two key prosecutors in the case were engaged in a romantic relationship."
    },
    {
        "url": "https://www.ft.com/content/08aaa76f-e681-4e02-94f4-34c35ee0d164",
        "title": "Zimbabwe opposition leader Nelson Chamisa quits ‘hijacked’ party",
        "description": "Defeated presidential candidate says his Citizens Coalition for Change party has been ‘contaminated’ by ruling Zanu-PF"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/jan/25/congress-mexico-border-ukraine-israel-aid-mcconnell",
        "title": "Congressional talks on US-Mexico border and Ukraine aid near collapse",
        "description": "Amid warnings soldiers may run out of ammunition, Senate minority leader Mitch McConnell said to abandon compromise"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/reform-uk-support-surges-to-record-high/",
        "title": "Reform UK support surges to record high",
        "description": "Reform UK is more popular than at any point in its history, according to opinion polling, which shows 13 per cent of Britons would vote for the party if the general election was held now."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/jan/25/rnc-kristina-karamo-michigan-republican",
        "title": "Michigan GOP chair Kristina Karamo rightly ousted, say RNC lawyers",
        "description": "Swing state’s Republican party has seen two feuding groups claiming to be its legitimate leaders in recent weeks"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13006465/PETER-HITCHENS-Ive-witnessed-two-executions-Ive-no-problem-Kenneth-Smith-death-Alabama-hanging-swifter-humane.html",
        "title": "PETER HITCHENS: I&#39;ve witnessed two executions and I&#39;ve no problem with Kenneth Smith being put to death in Alabama - although hanging would be swifter and more humane",
        "description": "In modern Britain your view on the death penalty is a test of whether you are a good person. I am therefore a bad person. Hundreds of right-thinking people think I&#39;m a monster."
    },
    {
        "url": "https://www.bbc.com/news/articles/ckm30dmrgnxo",
        "title": "Deputies reject rolling <b>elections</b> idea",
        "description": "The proposal for an investigation was submitted by Deputies Peter Roffey and the President of the States Assembly and Constitution Committee, Carl Meerveld. Mr Roffey said he suggested the idea because &quot;the majority of the assembly have concerns about this&quot;."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-prime-minister-labour-mps-conservative-b2484919.html",
        "title": "PM insists he is ‘making progress’ despite Tory warnings of electoral ‘massacre’",
        "description": "Rishi Sunak has told Conservatives fearing they face being electorally “massacred” that he is “making progress”, as he urged them to stick with his plan. Former Cabinet minister Sir Simon Clarke’s warning that the Tories face oblivion at the next election without a change in the Prime Minister was followed by fresh gloom from an adviser."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006143/Trump-leads-Biden-SIX-POINTS-New-nationwide-poll-shows-huge-surge-ex-president-25-voters-undecided-65-dont-want-rematch-all.html",
        "title": "Trump leads Biden by SIX POINTS: New nationwide poll shows huge surge for ex-president - but 25% of voters are still undecided and 65% don&#39;t want the rematch at all",
        "description": "Trump leads President Joe Biden by 40 to 34 in a new Reuters/Ipsos poll, which comes after both men prevailed in separate New Hampshire primaries. The balance are unsure or back someone else."
    },
    {
        "url": "https://edition.cnn.com/2024/01/25/politics/trump-weaknesses-general-election-strategy/index.html?ref=mc.news",
        "title": "Iowa and New Hampshire showcased Trump’s strengths – and exposed his weaknesses",
        "description": "The first two Republican presidential nominating contests have validated what has been apparent for nearly eight years: Donald Trump remains a singular, dominant force within his party."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-conservatives-starmer-sunak-election-poll-b2484767.html",
        "title": "Labour holds huge 34-point lead in key marginal seats, YouGov poll finds",
        "description": "Labour holds a mammoth lead over the Tories in the key marginals it needs to win a majority at the general election, a new YouGov poll has found. Sir Keir Starmer ’s party is an incredible 34 points ahead of Rishi Sunak ’s party in 150 crucial target constituencies."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-68087295.amp",
        "title": "UUP: Iraq veteran Col Tim Collins to run in North Down",
        "description": "Retired British Army colonel Tim Collins is to run for the Ulster Unionists as their North Down candidate in the next general election. Col Collins is best known for his role in the Iraq War in 2003. The last time an MP from the party was elected to North Down was 2010."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.livelaw.in/supreme-court/members-in-default-of-membership-fee-stand-disqualified-from-society-without-notice-theyre-not-entitled-to-vote-supreme-court-247668",
        "title": "Members In Default Of Membership Fee Stand Disqualified From Society Without Notice; They&#39;re Not Entitled To Vote : Supreme Court",
        "description": "The Supreme Court recently (on January 23) held that as per Section 15 of the Societies Registration Act, 1860, disqualified members would not be entitled to any notice as they had no right"
    },
    {
        "url": "https://news.yahoo.com/despite-likely-presidential-election-rematch-202300095.html",
        "title": "Despite likely presidential <b>election</b> rematch, Lake County political leaders focused on local races; ‘We’re excited to take on the challenge’",
        "description": "Lake County Democratic and Republican officials are gearing up for the 2024 election — and two national conventions in the region. A general election rematch between President Joe Biden and former President Donald Trump is looking more likely after Trump secured more votes in New Hampshire than his Republican opponent Nikki Haley."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/were-still-fighting-tories-right-31969823",
        "title": "&#39;We&#39;re still fighting Tories for our right to strike 40 years after Thatcher banned unions&#39;",
        "description": "There are painful parallels with 1984 as spiteful Tory anti-trade union legislation culminates in the new Strikes (Minimum Service Levels) Act, which could mean some workers losing their jobs for stri"
    },
    {
        "url": "https://inews.co.uk/news/politics/george-osborne-secret-tory-leadership-plotters-2873697",
        "title": "Secret Tory plotters are ‘casting a shadow’ over the party, George Osborne says",
        "description": "Ex-chancellor says Conservative Britain Alliance is &#39;casting a big shadow&#39; over the party amid questions over Sunak&#39;s leadership"
    },
    {
        "url": "https://apnews.com/article/kentucky-legislature-school-choice-f3b23f9cc599014287522a3fe5c145b1",
        "title": "School choice measure will reach Kentucky’s November ballot, key lawmaker predicts",
        "description": "A House committee chairman in Kentucky is predicting that lawmakers will put a school choice proposal on the November ballot."
    },
    {
        "url": "https://www.nytimes.com/2024/01/25/us/politics/michigan-republican-party-karamo-hoekstra.html",
        "title": "R.N.C. Says It Looks Like Michigan G.O.P. Leader Was ‘Properly Removed’",
        "description": "Kristina Karamo, the state party’s embattled chairwoman, is disputing the legality of her ouster earlier this month by Republican leaders."
    },
    {
        "url": "https://www.nytimes.com/2024/01/25/us/politics/haley-fundraising-trump.html",
        "title": "Haley Super PAC Says It Raised $50.1 Million, Eclipsing Trump",
        "description": "The figure for the second half of last year outstripped the haul of more than $46 million that Donald J. Trump’s allied super PAC announced this week."
    },
    {
        "url": "https://www.hl.co.uk/news/articles/what-are-bond-market-vigilantes-and-what-does-this-mean-in-the-run-up-to-a-uk-election",
        "title": "What are &#39;bond market vigilantes&#39; and what does this mean in the run up to a UK <b>election</b>?",
        "description": "We look at what &#39;bond market vigilantes&#39; are and the impact this could have in the run up to the UK general election."
    },
    {
        "url": "https://fortune.com/2024/01/25/ron-desantis-campaign-marketing-expert-politics-adam-hanft/",
        "title": "What the ill-fated Ron DeSantis campaign and plant-based meat have in common, according to a marketing expert",
        "description": "However, in a primary <b>election</b>, and most <b>general</b> <b>elections</b>, people don’t vote for a checklist of policies, but for an emotionally constructed candidate entity. While Trump’s entity has been successfully built and fortified, DeSantis’s entity was ..."
    },
    {
        "url": "https://www.yahoo.com/news/trump-didnt-win-hampshire-every-201454356.html",
        "title": "No, Trump didn&#39;t win New Hampshire &#39;every time,&#39; as he said in victory speech | Fact check",
        "description": "While Trump did win his third straight GOP primary in New Hampshire, he lost the state to Democratic opponents in each of his two general elections."
    },
    {
        "url": "https://time.com/6588528/biden-campaign-how-to-win-reelection/",
        "title": "The Biden Campaign Must Be About More Than Trump",
        "description": "If President Biden believes that Trump truly represents an existential threat to democracy, it is incumbent on him to articulate a campaign, and governing strategy, that is similarly exceptional. Restoring democracy cannot be solely about defeating Donald Trump. It also requires a compelling vision."
    },
    {
        "url": "https://finance.yahoo.com/news/uk-treasury-warns-ministers-money-163104269.html",
        "title": "UK Treasury Warns Ministers Money for Giveaways May Be Limited",
        "description": "The Treasury is telling ministers that Chancellor Jeremy Hunt is expected to have limited money for giveaways in his upcoming budget, signaling caution as members of the ruling Conservative Party push for tax cuts ahead of a general election."
    },
    {
        "url": "https://abcnews.go.com/538/best-pollsters-america/story?id=105563951",
        "title": "What are the best pollsters in America?",
        "description": "Eagle-eyed readers (and pollster-rating superfans) may have noticed two key differences from 538&#39;s past pollster ratings. The first is that the ratings incorporate not just polling error, but polling bias. We think both metrics are important, as demonstrated by this simple illustration."
    },
    {
        "url": "https://www.yahoo.com/news/able-vote-run-louisianas-future-160728199.html",
        "title": "Will you be able to vote or run in Louisiana&#39;s future closed party primary <b>elections</b>?",
        "description": "Louisiana will reshape its election system for some offices beginning in 2026 with a new law signed by Governor Jeff Landry."
    },
    {
        "url": "https://news.yahoo.com/ny-2024-elections-key-dates-160124380.html",
        "title": "NY 2024 <b>elections</b>: Key dates for voters to cast ballots in federal, state races",
        "description": "Here are key dates for New York voters to know to cast ballots in three 2024 elections for president, Congress and the state legislature."
    },
    {
        "url": "https://www.foxnews.com/politics/virginia-general-assembly-appoints-scc-commissioners-without-opposition",
        "title": "Virginia <b>General</b> Assembly appoints SCC commissioners without opposition",
        "description": "The VA General Assembly filled two long-standing vacancies on the State Corporation Commission, which oversees an array of interests like utilities and insurers."
    },
    {
        "url": "https://www.intellinews.com/outlook-2024-central-europe-309495/",
        "title": "OUTLOOK 2024 Central Europe",
        "description": "Falling inflation has enabled central banks to begin to cut rates. The region was the first in the EU to begin raising rates in April 2022; it has now become the first to cut them. The Polish, Hungarian and Czech central banks have already started a new cycle of monetary easing, which is expected to continue this year."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/vsu-students-explore-the-importance-of-debates-and-voting-hbcu-2024-election-biden-trump-2020-ballot/72344398007/",
        "title": "VSU students explore questions about representation as they prepare for the 2024 debate",
        "description": "As preparations for the 2024 debate slated to take place at VSU begin, students wrestle with questions in the classroom on voting and representation."
    },
    {
        "url": "https://finance.yahoo.com/news/resolutions-extraordinary-general-meeting-beyond-152400758.html",
        "title": "Resolutions at the Extraordinary <b>General</b> Meeting in Beyond Frames Entertainment AB (publ)",
        "description": "At the extraordinary general meeting of Beyond Frames Entertainment AB (publ) on January 24, 2024, in the company&#39;s offices at Bondegatan 21 in Stockholm, the following main decisions were made. For detailed information about the decisions,"
    },
    {
        "url": "https://apnews.com/article/north-macedonia-government-resigns-elections-kovachevski-caretaker-93af67187044d22245049a05a280888d",
        "title": "North Macedonia’s government resigns ahead of <b>general</b> <b>elections</b>",
        "description": "North Macedonia’s prime minister and his cabinet have formally submitted their resignations to parliament, paving the way for a caretaker government to prepare for general elections planned this May."
    },
    {
        "url": "https://www.reuters.com/world/us/trump-seeking-advice-friends-allies-running-mate-pick-2024-01-25/",
        "title": "Friends, allies urge Trump to choose a woman or Black man as his running mate",
        "description": "Donald Trump is calling friends, allies and donors to seek advice on who he should pick as a vice presidential running mate as he closes in on the Republican White House nomination, according to five close allies of the former president."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/25/general-elections-2024-media-should-follow-ecps-code-of-conduct-solangi/",
        "title": "<b>General</b> <b>Elections</b> 2024: Media should follow ECP’s code of conduct: Solangi",
        "description": "ISLAMABAD: Caretaker Federal Minister for Information and Broadcasting Murtaza Solangi has said that during the upcoming general elections, the mainstream media should follow the code of conduct issue"
    },
    {
        "url": "https://abcnews.go.com/538/538s-pollster-ratings-work/story?id=105398138",
        "title": "How 538&#39;s pollster ratings work",
        "description": "Our new methodology considers each pollster&#39;s accuracy and transparency."
    },
    {
        "url": "https://www.wired.com/story/maga-trump-vice-president/",
        "title": "Here’s Who the Online MAGA World Wants as Trump’s VP",
        "description": "With Trump’s nomination all but inevitable, the former president’s most fervent far-right supporters are already debating who should join the 2024 ticket."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4428996-2024-election-18-percent-wouldnt-vote-trump-biden-rematch-poll/",
        "title": "18 percent in new poll say they wouldn’t vote in Trump-Biden rematch",
        "description": "Eighteen percent of Americans said they would not vote in next year’s election if it’s a rematch between President Biden and former President Trump, according to a new poll.  According to"
    },
    {
        "url": "https://www.usatoday.com/story/news/local/arizona-education/2024/01/25/legislative-proposal-would-make-az-school-board-races-partisan/72330303007/",
        "title": "Legislative proposal would make Arizona school board races partisan",
        "description": "Senate Bill 1097, sponsored by Sen. Justine Wadsack, R-Tucson, would require candidates for Arizona&#39;s more than 200 school boards to run with partisan designations. It passed the Senate Education Committee on Wednesday by a party-line, 4-3 vote, with Democrats opposed."
    },
    {
        "url": "https://www.economist.com/united-states/2024/01/25/why-americas-political-parties-are-so-bad-at-winning-elections",
        "title": "Why America’s political parties are so bad at winning <b>elections</b>",
        "description": "E very four years the American presidential primaries roll around to remind Americans how weak, clumsy and negative their major political parties have become. The news media’s r"
    },
    {
        "url": "https://uk.news.yahoo.com/postal-voters-issued-reminder-changes-144000446.html",
        "title": "Postal voters issued reminder of changes ahead of <b>general election</b>",
        "description": "Voters are being reminded of changes to postal and proxy voting ahead of this year&#39;s impending <b>general election</b>. Ribble Valley Council is reminding residents who use the systems to cast their votes to ensure they are registered so they don&#39;t miss out on ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13004877/Grim-poll-shows-Labour-34-POINTS-ahead-150-target-seats-Rishi-Sunak-Keir-Starmer.html",
        "title": "Grim poll shows Labour 34 POINTS ahead in Keir Starmer&#39;s top 150 target seats as Rishi Sunak tries to contain Tory alarm - with ex-adviser &#39;joining revolt&#39; despite ministers ...",
        "description": "After months of bitter Tory infighting Sir Keir Starmer &#39;s opposition has a commanding 34-point lead in 150 constituencies identified as those it needs to win to take power."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/hunt-tax-cut-reversed-election-ifs-b2484584.html",
        "title": "Tax cut pledge likely to be reversed after <b>election</b>, says think tank, as it warns Hunt not to ‘ignore reality’",
        "description": "The IFS think tank said high debt costs cannot be ignored and that the next governement faces a “miserable” outlook"
    },
    {
        "url": "https://edition.cnn.com/2024/01/25/politics/biden-coalition-trump-2024/index.html",
        "title": "Biden has a bridge to reelection – but has to rebuild it first",
        "description": "Some Republicans – observing Trump’s strength in the early nominating contests and cognizant of Biden’s struggles – argue that Republicans who opposed Trump in 2020 will return to the Republican ticket in 2024 amid disillusionment with Biden’s liberal agenda."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/northern-ireland-ulster-unionist-party-troubles-british-army-alliance-party-b2484559.html",
        "title": "Colonel Tim Collins backs legacy laws: ‘Northern Ireland needs to move on’",
        "description": "Retired Colonel Tim Collins, who is to stand as a candidate for the Ulster Unionist Party in the next general election, has said he backs controversial new legacy laws because Northern Ireland has to move on."
    },
    {
        "url": "https://www.ft.com/content/7279badf-29d1-42b1-ab5c-727b82ad56f3/",
        "title": "UK car industry ‘back in the game’ after £24bn investment pledged in single year",
        "description": "Between 2016 and 2022, a total of £17bn of new investments into the UK auto industry were announced, SMMT calculations show, while last year’s figure reached £23.7bn, boosted by £15bn from JLR and £2bn from Nissan."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-prime-minister-plot-resign-leadership-k755pzj5n?ilc=timesradio:morefromthetimes",
        "title": "Inside the Tory plot to oust Rishi Sunak",
        "description": "A former adviser to the prime minister is working with a secretive group of MPs to remove him from office before the general election"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24070162.really-comparing-johnson-sturgeon-seriously/?ref=eb",
        "title": "Are we really comparing Johnson and Sturgeon? Seriously?",
        "description": "David Bol reminds us &quot;that the SNP cannot win a <b>General Election</b> UK-wide&quot; (&quot;Talking up Labour poll chances is a risky tactic by SNP&quot;, The Herald, January 23). Currently, Northern Ireland has 18 seats at Westminster, Wales has 40, Scotland has 59 ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/13180582.heralds-commitment-keep-pressure-uk-government-welcome/",
        "title": "The Herald&#39;s commitment to keep the pressure on UK Government is most welcome",
        "description": "Conversations over dinner with people of diverse interests, largely successful in their own areas of activity, made it abundantly clear that the majority will be voting for Ukip in the next <b>General Election</b>. A future Tory/Ukip coalition is likely to have ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/no-10-halts-police-funding-plans-over-electoral-basklash-concern",
        "title": "Downing Street Halts New Police Funding Plan Over Fears Of <b>Election</b> Backlash",
        "description": "A long-planned new formula for how the police are funded has been put on hold over concern among ministers that it could result in some local"
    },
    {
        "url": "https://www.thenational.scot/politics/24075888.yes-movement-switch-civil-rights-movement/",
        "title": "Should Yes movement switch to being a civil rights movement?",
        "description": "REGARDING your story reporting that 57.5 of Scots support the Scottish Parliament having powers to legislate for independence (Majority of"
    },
    {
        "url": "https://fortune.com/2024/01/25/hansjorg-wyss-swiss-billionaire-george-soros-american-right-wing/?ref=biztoc.com",
        "title": "An 88-year-old Swiss billionaire who lives in Wyoming is the American right wing’s favorite to replace George Soros",
        "description": "As the 2024 US presidential <b>election</b> looms, so do sobering questions about the ... The FEC investigated and in 2022 found no evidence of wrongdoing, although the agency’s <b>general</b> counsel faulted the groups for failing to provide evidence of the ..."
    },
    {
        "url": "https://www.modernghana.com/news/1287969/bono-regional-minister-calls-for-calm-unity-ahead.html",
        "title": "Bono Regional Minister calls for calm, unity ahead of NPP Parliamentary primaries",
        "description": "Ahead of the NPP parliamentary primaries across the country, the Bono Regional Minister, Justina Owusu Banahene, is calling for calm and unity of purpose before, during and after the elections to ensure that the party faces the 2024 general election with a formidable force."
    },
    {
        "url": "https://uk.news.yahoo.com/biden-going-full-steam-ahead-180456114.html",
        "title": "Biden, going &#39;full steam ahead&#39; against Trump, at last wins swing state union&#39;s support",
        "description": "Joe Biden, the self-proclaimed &quot;most pro-union&quot; American president, on Wednesday secured the United Auto Workers Union&#39;s endorsement as he ramps up his reelection bid, after the group had withheld backing him for months."
    },
    {
        "url": "https://www.sloughobserver.co.uk/news/24075137.slough-windsor-election-predictions-lot-change/",
        "title": "Slough and Windsor <b>election</b> predictions: Could a lot change?",
        "description": "The Conservative party face the prospect of large-scale losses in key battlegrounds across the UK if there was a general election"
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/24073387.local-mps-go-head-head-public-pre-election-debate/",
        "title": "Local MPs go head to head in public pre-<b>election</b> debate",
        "description": "East Devon MP Simon Jupp and Lib Dem MP Richard Foord, who will compete for the Honiton &amp; Sidmouth seat in the General Election, will take"
    },
    {
        "url": "https://morningstaronline.co.uk/article/council-leaders-call-for-reform%20of-local-government-finance-following-drop-in-the-ocean-emergency-fund-for-social-care",
        "title": "Council leaders call for reform of local government finance following ‘drop in the ocean’ emergency fund for social care",
        "description": "COUNCIL leaders have called for reform of local government finance and an end to “short-term” measures after Michael Gove confirmed that authorities will receive £500 million in emergency funding for social care."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/prime-minister-rishi-sunak-visits-east-sussex-village-to-campaign-with-lewes-mp-maria-caulfield-4493065",
        "title": "Prime Minister Rishi Sunak visits East Sussex village to campaign with Lewes MP Maria Caulfield",
        "description": "Prime Minister Rishi Sunak came to East Sussex last week to campaign with Lewes MP Maria Caulfield. He visited the village of Willingdon to meet Mrs Caulfield and Conservative activists as part of a campaign session for the incumbent Lewes MP."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-starmer-has-zero-apologies-for-squeamish-sunak-attack-ad-12593360?postid/1000",
        "title": "Politics latest: Plot to oust Sunak becomes clear - as Johnson and Truss&#39;s severance pay revealed",
        "description": "Mr Yousaf: &quot;Both personal and government devices, yes.&quot; The new year is upon us, and the political party leaders are working hard to convince the public to back them in the upcoming <b>general election</b>. But while the latest opinion polls will likely be a ..."
    },
    {
        "url": "https://www.ft.com/content/c7b4fa91-3601-4b82-b766-319af3c261a5",
        "title": "UK <b>general election</b> poll tracker",
        "description": "The Financial Times’ UK poll tracker combines voting intention surveys published by major British pollsters ahead of the <b>general election</b> expected this year. The most recent polls suggest that the UK’s main national political parties would achieve the ..."
    },
    {
        "url": "https://www.investing.com/news/world-news/two-prominent-haley-donors-to-pull-funding-after-trump-new-hampshire-win-3283322",
        "title": "Two prominent Haley donors to pull funding after Trump New Hampshire win",
        "description": "(Reuters) - A prominent donor to Republican presidential candidate Nikki Haley will stop funding her campaign, declaring that former President Donald Trump has effectively won the party&#39;s nominating race after he defeated Haley in New Hampshire."
    },
    {
        "url": "https://www.wakefieldexpress.co.uk/news/politics/jon-trickett-mp-government-is-not-taking-medication-shortages-seriously-4492997",
        "title": "Jon Trickett MP: Government is not taking medication shortages seriously",
        "description": "As MPs returned to parliament after the short Christmas break it was clear that the general election was at the forefront of everyone’s minds."
    },
    {
        "url": "https://www.radio.gov.pk/25-01-2024/ecp-issues-code-of-conduct-for-armed-civil-forces-for-elections",
        "title": "ECP issues code of conduct for armed, civil forces for <b>elections</b>",
        "description": "The Election Commission of Pakistan has issued the Code of Conduct for Armed and Civil Armed Forces to ensure foolproof security during the upcoming General Elections."
    },
    {
        "url": "https://uk.style.yahoo.com/ted-cruz-pitches-wild-idea-151124586.html",
        "title": "Ted Cruz Pitches Wild Idea To Choose Between Trump And Biden",
        "description": "Sen. Ted Cruz (R-Texas) on Wednesday appeared excessively concerned with attacks on Donald Trump’s mental acuity after he repeatedly mixed up former House Speaker Nancy Pelosi (D-Calif.) with Republican challenger Nikki Haley. (Watch the video below.)"
    },
    {
        "url": "https://www.modernghana.com/news/1287992/election-2024-opambour-predicts-victory-for-maham.html",
        "title": "<b>Election</b> 2024: Opambour predicts victory for Mahama",
        "description": "Reverend Ebenezer Adarkwa Yiadom Rev. Opambour, General Overseer and Founder of the Ebenezer Miracle Center, has predicted victory for the flag-bearer of the NDC, Mr John Dramani Mahama."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24071911.hundreds-fines-issued-darlington-parents-school-absences/",
        "title": "Hundreds of fines issued to Darlington parents for school absences",
        "description": "The number of fines issued to parents for children missing school in Darlington has increased sharply. Figures from the Department for Education show student absence is on the rise, with nearly 200 more fines issued. In 2021/22, the council issued 752 fines for truancy. In 2022/23, it increased by 24 per cent to 932."
    },
    {
        "url": "https://www.thenational.scot/politics/24073086.no-independence-route-relies-london-cooperating-viable/",
        "title": "No independence route that relies on London cooperating is viable",
        "description": "ON the route to independence, most discourse fumbles the pivotal issue. With London opposed to Scottish independence and committed in word and"
    },
    {
        "url": "https://www.itv.com/news/london/2024-01-25/knife-crime-up-by-more-than-a-fifth-across-the-capital",
        "title": "Knife crime up by more than a fifth across the Capital last year",
        "description": "Actor and knife crime campaigner Idris Elba has welcomed new government legislation on zombie knives, but wants it to include other weapons like swords. | ITV News London"
    },
    {
        "url": "https://inews.co.uk/opinion/british-homes-british-workers-cynical-attempt-blame-immigrants-housing-crisis-2872631",
        "title": "‘British homes for British workers’ is a cynical attempt to blame immigrants for the housing crisis",
        "description": "Perhaps this is why Rishi Sunak‘s Government is considering a policy which, at best, is a cynical attempt to win votes and, at worst, misleads the public by turning immigrants and asylum seekers into scapegoats for housing policy failures."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1859783/nigel-farage-political-comeback",
        "title": "Nigel Farage outlines what his exact goal really is if he makes sensational comeback",
        "description": "Nigel Farage revealed if he makes a political comeback his &quot;aim must be to win the general election after next&quot;. The former Ukip leader admitted the pressure was high as speculation continues over whether he will make a return to frontline politics."
    },
    {
        "url": "https://betting.betfair.com/politics/uk-politics/next-general-election-odds-can-sunak-survive-tory-rebellion-250124-171.html",
        "title": "Next <b>General Election</b> Betting: The grim schedule awaiting Rishi Sunak",
        "description": "The next general odds point to a heavy Tory defeat and Rishi Sunak is under pressure again from within his own party says Paul Krishnamurty"
    },
    {
        "url": "https://www.bbc.com/news/business-68086302",
        "title": "Tax cut promises may need to be rolled back - IFS think tank",
        "description": "Promises of tax cuts during general election campaigns may have to be rolled back as the UK economy faces some of its worst problems since the 1950s, a leading think tank has said. &quot;Tax cuts today add to the risk of tax rises or spending cuts tomorrow,&quot; the Institute for Fiscal Studies said."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/sell-nhs-medical-records-to-fund-cutting-edge-treatments-sir-tony-blair-and-lord-hague-say/",
        "title": "Sell NHS medical records to fund cutting-edge treatments, Sir Tony Blair and Lord Hague say",
        "description": "Read more: Blair says AI impact &#39;on par with Industrial Revolution&#39; What 2023 taught us about science and technology Warning AI &#39;poses growing threat to next <b>general election</b>&#39; The report on biotechnology is the third collaboration by Sir Tony and Lord Hague."
    },
    {
        "url": "https://prtechnews.com/pakistan-general-election-pmln-supporters-arrived-with-lion-tiger-in-nawaz-sharif-election-rally-video-viral/",
        "title": "Pakistan <b>General Election</b> pmln supporters arrived with Lion tiger in Nawaz Sharif <b>Election</b> Rally Video Viral",
        "description": "Nawaz Sharif Rally Video Viral: National Assembly <b>elections</b> are going to be held in Pakistan on 8th February. Regarding this, the political parties of Pakistan are putting their full strength in the <b>elections</b>. Pakistan Muslim League-Nawaz (PML-N), the ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12503759.tory-msp-criticised-bid-westminster-seat/",
        "title": "Tory MSP criticised over bid for Westminster seat",
        "description": "Labour has been accused of peddling &quot;shoddy politics of the worst kind&quot; after branding David Cameron a hypocrite over Tory MSP John Lamont’s bid to hold a dual mandate and become an MP at the next <b>General Election</b>. Earlier this week, local Tories chose ..."
    }
]