[
    {
        "url": "https://www.axios.com/2024/01/30/biden-avoid-saying-trump-2024-election",
        "title": "After three years, Biden goes all-in on the T-word",
        "description": "What they&#39;re saying: &quot;Every time crooked Joe Biden utters Donald Trump&#39;s name, Americans will be reminded of how much better their lives were under his leadership that led to low gas prices, record-low mortgage rates, a secure border and peace around the world,&quot; Karoline Leavitt, the Trump campaign&#39;s national press secretary, told Axios."
    },
    {
        "url": "https://www.huffpost.com/entry/seth-meyers-trump-e-jean-carroll-fox-news_n_65b8b5b1e4b0102bd2d5f0f5",
        "title": "Seth Meyers Airs Fox News Moment That’s A Bad Sign For Donald Trump",
        "description": "Seth Meyers on Monday highlighted an interview on Fox News that went against the conservative network’s usual Donald Trump -boosting grain. Commenting on Trump being ordered to pay writer E. Jean Carroll $83.3 million for defamation, George W. Bush-era Deputy Assistant Attorney General John Yoo said:"
    },
    {
        "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4?kr1",
        "title": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It",
        "description": "Many on the right claim the U.S. is being &quot;invaded&quot; by migrants but also want to wait until Donald Trump is elected president again to stop it."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/30/uk-northern-ireland-dup-power-sharing-stormont-latest-politics-news-updates",
        "title": "Northern Ireland will no longer automatically have to follow EU laws under deal to restore power sharing, DUP leader says – politics live",
        "description": "The DUP has endorsed a deal with the UK government to restore power-sharing in NI, paving an end to two years of political deadlock"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68138591?at_campaign=KARANGA&at_medium=RSS",
        "title": "Pakistan former PM Imran Khan jailed for leaking state secrets",
        "description": "Former Pakistani prime minister Imran Khan has been sentenced to 10 years in jail in a case in which he was accused of leaking state secrets. Mr Khan, who was ousted by his opponents as PM in 2022, is already serving a three-year jail term after being convicted of corruption."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68130660",
        "title": "Bigger Senedd voting changes confusing, says Labour MS",
        "description": "A Labour Member of the Senedd (MS) says a new voting system for the next Welsh Parliament election will confuse the public. Mike Hedges criticised the closed lists system his own party is proposing to elect a larger body with more members."
    },
    {
        "url": "https://www.ft.com/content/a16c5df5-f9db-40c9-92c9-03c0a97c750e",
        "title": "Should I protect my finances ahead of US and UK <b>elections</b>?",
        "description": "For example, Americans claiming the remittance basis may pay UK tax on a later remittance of foreign wealth without a credit for the original US tax paid. We therefore often advise UK-resident Americans to pay tax in both countries as it arises, to maximise tax credits and minimise future UK tax on remittances."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/dup-northern-ireland-deal-powersharing-stormont-b2487062.html",
        "title": "DUP agrees deal to end boycott of Northern Ireland government and restore powersharing",
        "description": "DUP leader Sir Jeffrey Donaldson says deal is subject to government passing new legislation over post-Brexit trade"
    },
    {
        "url": "https://www.independent.co.uk/news/democratic-ap-michigan-gretchen-whitmer-detroit-b2487070.html",
        "title": "2 Democratic-leaning Michigan House districts to hold special <b>election</b> primaries",
        "description": "Two Michigan House districts will hold special election primaries to fill seats that were held by Democrats whose departures have left the legislative chamber in an even split since November"
    },
    {
        "url": "https://www.theguardian.com/australia-news/commentisfree/2024/jan/30/the-stage-three-tax-cut-changes-could-be-a-pivotal-moment-for-anthony-albanese-if-he-frames-them-right",
        "title": "The stage-three tax cut changes could be a pivotal moment for Anthony Albanese – if he frames them right",
        "description": "This could be his chance to create a new trust frame, asking voters: ‘Who do you trust to stand up for working Australians?’"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68079726?at_link_type=web_link&at_campaign_type=owned&at_format=link&at_bbc_team=editorial&at_link_origin=BBCPolitics&at_link_id=2142A690-BE8E-11EE-83FD-A0A9D0B4AF07&at_ptr_name=twitter",
        "title": "<b>General election</b> 2024 poll tracker: How do the parties compare?",
        "description": "Individual poll data is published online by the different companies. Where a party has polled less than 0.5%, it is shown in the table below as 0 due to rounding down the numbers. Each dot in the chart shows one poll result for a party. We summarise all that information with an average line that makes it easier to understand the trend."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-africa-68129365?at_medium=RSS&amp%3Bat_campaign=KARANGA",
        "title": "South Africa: ANC suspends ex-President Jacob Zuma after rival party launch",
        "description": "South Africa&#39;s former President Jacob Zuma has been suspended from the party he once led, after refusing to vote for it and launching a rival organisation. The governing African National Congress (ANC) announced its decision on Monday."
    },
    {
        "url": "https://www.ft.com/content/c7b4fa91-3601-4b82-b766-319af3c261a5",
        "title": "UK <b>general election</b> poll tracker",
        "description": "The FT’s main UK poll tracker uses data from every new national voting intention poll by a member of the British Polling Council. Voting intentions in demographic subsamples use data from Deltapoll, Ipsos, Omnisis, Opinium, PeoplePolling, Redfield and Wilton, Savanta, Survation, Techne and YouGov."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/next-general-election-labour-tories-31940247",
        "title": "When is the next <b>general election</b> and are Labour or the Tories more likely to win?",
        "description": "Dithering Rishi Sunak is under pressure to call the next general election as fed-up voters demand a chance to deliver their verdict on 14 years of Conservative rule"
    },
    {
        "url": "https://www.thetimes.co.uk/article/british-expats-vote-labour-lib-dems-next-general-election-tories-n8mzzrx5d",
        "title": "Millions of expats given vote by Tories ‘will punish party for Brexit’",
        "description": "Labour and Liberal Democrats expected to reap benefit from franchise rule changes and frustration over visa restrictions"
    },
    {
        "url": "https://www.baltimoresun.com/2024/01/30/baltimore-county-executive-johnny-olszewski-jr-to-run-for-congress/",
        "title": "Baltimore County Executive Johnny Olszewski Jr. to run for Congress",
        "description": "Baltimore County Executive Johnny Olszewski Jr. said Tuesday he would run for Congress, ending widespread speculation about his ambitions for higher office."
    },
    {
        "url": "https://www.thetimes.co.uk/article/dougie-smith-poll-general-election-tory-party-w5wpk3rbz?ilc=timesradio:morefromthetimes",
        "title": "Tory aide Dougie Smith linked to rebels behind plot to oust Rishi Sunak",
        "description": "A senior Conservative strategist who has worked as an adviser to successive prime ministers is in contact with a group of rebels who are plotting to oust Rishi Sunak. Dougie Smith, who has played a key role as a fixer for decades in the Conservative Party ..."
    },
    {
        "url": "https://www.cbc.ca/news/world/imran-khan-sentenced-10-years-1.7098811",
        "title": "Former Pakistan PM Imran Khan gets 10-year jail term for leaking state secrets",
        "description": "A Pakistan court handed former prime minister Imran Khan a 10-year jail term on Tuesday for leaking state secrets, the former premier&#39;s media team said, his second conviction in recent months and just 10 days before the country&#39;s general election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/aslef-rmt-london-overground-labour-mick-whelan-b1135676.html",
        "title": "New rail strike announced as walkout by drivers hits services",
        "description": "Aslef members have taken industrial action on Tuesday while the RMT has said London Overground workers will strike in a separate dispute over pay."
    },
    {
        "url": "https://nypost.com/2024/01/30/news/former-pakistan-pm-imran-khan-gets-10-year-jail-term-party-says/",
        "title": "Former Pakistan PM Imran Khan gets 10-year jail term, party says",
        "description": "A Pakistan court handed former Prime Minister Imran Khan a 10-year jail term on Tuesday for leaking state secrets, the former premier’s media team said, his second conviction in recent"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? Starmer opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://www.investing.com/news/world-news/skoreas-yoon-blocks-new-probe-of-2022-halloween-crowd-crush-3286617",
        "title": "S.Korea&#39;s Yoon blocks new probe of 2022 Halloween crowd crush",
        "description": "SEOUL (Reuters) -South Korean President Yoon Suk Yeol blocked on Tuesday a bill to launch a new probe into a Halloween crowd crush that killed 159 people in Seoul&#39;s Itaewon district in 2022, in a move slammed by the opposition and relatives of the victims."
    },
    {
        "url": "https://news.yahoo.com/video-shows-bangladeshi-politician-crying-061201337.html",
        "title": "Video shows Bangladeshi politician crying at campaign rally, not after losing <b>election</b>",
        "description": "Misinformation has swirled around Bangladesh&#39;s election which saw Prime Minister Sheikh Hasina secure a landslide victory in polls boycotted as a &quot;sham&quot; by the opposition. As results were being announced,"
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/money/property-and-mortgages/election-delay-interest-rate-cut-2872763?ico=most_popular",
        "title": "<b>Election</b> could delay first interest rate cut, ex-Bank of England economists warn",
        "description": "Most forecasters expect a rate cut in May or June, but if an election campaign were called then, some think a cut could be pushed back"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/national/24083153.sanctions-relief-ended-opposition-leader-blocked-election/",
        "title": "Sanctions relief ended after opposition leader blocked from <b>election</b>",
        "description": "The US had agreed to relax sanctions against Venezuela if it took steps to provide a fair presidential election."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-elections-caretaker-prime-minister-anwaar-ul-haq-kakar-says-political-parties-manifestos-lack-economic-foresight/articleshow/107249753.cms",
        "title": "Pakistan <b>Elections</b>: Caretaker Prime Minister Anwaar ul Haq Kakar says political parties manifestos &#39;lack economic foresight&#39;",
        "description": "PM Kakar underscored that the parties should focus on improving the economy but added that, unfortunately, no political party had yet come up with an"
    },
    {
        "url": "https://www.usnews.com/news/us/articles/2024-01-30/2-democratic-leaning-michigan-house-districts-to-hold-special-election-primaries",
        "title": "2 Democratic-Leaning Michigan House Districts to Hold Special <b>Election</b> Primaries",
        "description": "Two Michigan House districts will hold special election primaries to fill seats that were held by Democrats whose departures have left the legislative chamber in an even split since November"
    },
    {
        "url": "https://www.independent.co.uk/news/nicole-kidman-ap-hong-kong-amazon-prime-china-b2487097.html",
        "title": "&#39;Expats,&#39; starring Nicole Kidman, was filmed in Hong Kong, but you can&#39;t watch it there",
        "description": "The first two episodes of “Expats,” a six-episode drama about expat women, were released on Amazon Prime on Jan. 26. But when viewers in Hong Kong try to watch it, they instead get a message saying that “this video is currently unavailable to watch in your location.”"
    },
    {
        "url": "https://www.abc.net.au/abc-international-development/in-convo-with-alexander-rheeney/103351222",
        "title": "In conversations with: Alexander Rheeney",
        "description": "Alexander Rheeney is a Team Leader with PACMAS, covering regions in the Pacific. Get to know more about Alex&#39;s journey and how he hopes to make the best out of his role with ABCID."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/chennai/aiadmk-will-expose-bjps-betrayal-of-tn-jayakumar/articleshow/107245372.cms",
        "title": "AIADMK will expose BJP’s betrayal of TN: Jayakumar",
        "description": "Chennai: Continuing his tirade against the BJP, senior AIADMK leader D Jayakumar on Monday said the party would expose the betrayal of Tamil Nadu by t."
    },
    {
        "url": "https://www.bloomberg.com/graphics/2024-labour-battleground-voters-will-decide-uk-leader/",
        "title": "Older, Richer, Whiter: These Voters Will Decide UK’s Next Leader",
        "description": "The UK’s last election left the Labour Party in dire straits, holding the fewest seats since 1935. To get back into power, Labour leader Keir Starmer must win in areas that are older, richer, more rural,"
    },
    {
        "url": "https://finance.yahoo.com/news/japan-pm-keeps-push-higher-235449246.html",
        "title": "Japan PM Keeps Up Push for Higher Wages as <b>Election</b> Talk Swirls",
        "description": "Japanese Prime Minister Fumio Kishida is pressing forward with his campaign for higher wages as his slumping support rate levels out and speculation re-emerges that he could opt to call a general election this year."
    },
    {
        "url": "https://www.politico.com/news/2024/01/29/biden-jordan-middle-east-campaign-00138458",
        "title": "Biden’s team is blaming Iran for American deaths. How will the US respond?",
        "description": "The deaths of the service members in Jordan adds to rising Middle East tensions just as the 2024 campaign begins."
    },
    {
        "url": "https://www.yahoo.com/news/facing-gop-pushback-house-democrats-232900829.html",
        "title": "Facing GOP pushback, House Democrats rally around bill to amend charter for Virginia Beach <b>elections</b>",
        "description": "Democrats are rallying around a bill facing pushback in the House of Delegates that would enshrin Beach’s recent transition to a City Council with solely single-member districts into the city’s charter."
    },
    {
        "url": "https://news.yahoo.com/phoenix-man-sentenced-probation-threat-232322574.html",
        "title": "Phoenix man sentenced to probation in threat to poison Maricopa County supervisor",
        "description": "Ryan Stuart Hadland was sentenced to three years of probation after threatening Maricopa County Supervisor Bill Gates following the 2022 election."
    },
    {
        "url": "https://thehill.com/blogs/in-the-know/4436310-fox-news-pirro-to-taylor-swift-dont-get-involved-in-politics/",
        "title": "Fox News’s Pirro to Taylor Swift: ‘Don’t get involved in politics’",
        "description": "Fox News anchor Judge Jeanine Pirro advised pop singer Taylor Swift on Monday to not “get involved in politics” amid reports President Biden’s reelection campaign is trying to"
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/trumps-secret-plan-expand-presidential-immunity-1234955710/",
        "title": "Trump’s Secret Plan to Expand Presidential Immunity to ‘King George’ Levels",
        "description": "Trump and his allies are planning to expand presidential immunity to ‘King George’ levels if he beats Joe Biden in the 2024 election."
    },
    {
        "url": "https://www.bizjournals.com/sanjose/news/2024/01/29/sunnyvale-property-transfer-tax-november-election.html",
        "title": "Sunnyvale to poll voters if they&#39;d support an additional tax on property transfers",
        "description": "Sunnyvale wants to ask its residents if they will support a property transfer tax measure for November&#39;s election"
    },
    {
        "url": "https://www.yahoo.com/news/white-house-gives-maduro-april-220153349.html",
        "title": "White House gives Maduro an April deadline on democratic reform before sanctions snap back",
        "description": "The Biden administration warned the Nicolás Maduro regime on Monday that it has until April to fulfill its commitment to free political prisoners, and to allow all presidential candidates to compete in this year’s elections,"
    },
    {
        "url": "https://www.nytimes.com/2024/01/29/world/africa/south-africa-jacob-zuma-anc.html",
        "title": "African National Congress Suspends Former President Jacob Zuma",
        "description": "After defending the former South African president and party leader during a slew of corruption scandals, the country’s powerful governing party punished him for endorsing the opposition."
    },
    {
        "url": "https://abcnews.go.com/Business/wireStory/venezuelan-opposition-candidate-blocked-court-calls-judicial-criminality-106774204",
        "title": "Venezuelan opposition candidate blocked by court calls it &#39;judicial criminality,&#39; won&#39;t abandon race",
        "description": "Venezuelan opposition leader María Corina Machado says the court ruling blocking her presidential candidacy represents “judicial criminality"
    },
    {
        "url": "https://abcnews.go.com/Politics/2024-republican-democratic-presidential-primaries-caucuses-work/story?id=106765290",
        "title": "How the 2024 Republican and Democratic presidential primaries and caucuses work",
        "description": "The public nature of caucuses is what sets them apart from a typical primary where, like in normal elections, voters can arrive at a polling location at any time throughout the day (or vote early or by mail, depending on the state), privately cast their secret ballot and then leave."
    },
    {
        "url": "https://www.politico.com/newsletters/digital-future-daily/2024/01/29/the-ai-trust-deficit-00138404",
        "title": "The AI trust deficit",
        "description": "The impact of deepfakes on society — and elections particularly — has been an anxiety for years. Easy-to-use generative AI tools have recently moved it from an issue in niche areas to a top security risk across the board. Before the Biden robocall, AI deepfakes were used in attempts to disrupt elections in Slovakia and Taiwan."
    },
    {
        "url": "https://edition.cnn.com/2024/01/29/politics/house-subpoena-justice-department/index.html",
        "title": "Justice Department subpoenas House for documents related to misuse of funds issue, source says",
        "description": "The Justice Department has issued a subpoena for documents to the Sergeant at Arms for the US House of Representatives."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13019919/joe-biden-texas-way-mexico-border.html",
        "title": "President Joe Biden needs to &#39;get out of the way&#39; so Texas can secure its southern border with Mexico, 26 Republican attorneys <b>general</b> demand in scathing letter",
        "description": "More than two dozen Republican attorneys general have signed a letter supporting Texas&#39; right to defend its borders against migrant invasion, telling Biden to &#39;get out of the way.&#39;"
    },
    {
        "url": "https://thehill.com/homenews/4435862-trump-claims-credit-record-stock-market-biden/",
        "title": "Trump claims credit for record-high stock market under Biden",
        "description": "Former President Trump, who has predicted economic doom if he’s not elected back to the White House, said Monday he should get credit for the stock market’s recent record highs, more"
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/ahmedabad/election-for-four-rajya-sabha-seats-from-gujarat-on-feb-27/articleshow/107245736.cms",
        "title": "Gujarat: <b>Election</b> for four Rajya Sabha seats on February 27",
        "description": "The election for four Rajya Sabha seats from Gujarat will be held on Feb 27. Both the BJP and the Congress hold two seats each for which the election will be held. Owing to the landslide victory of the BJP in the 2022 assembly election,"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13021335/Britain-create-Scandinavian-style-National-Service-21st-Century-ex-Foreign-Secretary-Lord-Hague-urges-general-sparked-conscription-fears-event-war-Russia.html",
        "title": "Britain must create a Scandinavian-style National Service for the 21st Century, ex-Foreign Secretary Lord Hague urges - after top <b>general</b> sparked conscription fears in event of ...",
        "description": "Former Tory leader Lord Hague has joined the chorus of prominent voices who have warned that a major war could be looming and called for a modern version of national service."
    },
    {
        "url": "https://www.politico.com/news/2024/01/29/biden-robocall-ai-trust-deficit-00138449",
        "title": "A mysterious phone call cloned Biden’s voice. Can the next one be stopped?",
        "description": "The call went out on Jan. 21, two days before the primary, trying to discourage Democrats from heading to the polls. It’s not certain who was behind the call, what software was used in its creation, or how many voters got one. The New Hampshire attorney general’s office is investigating."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/29/biden-sees-low-approval-rating-in-virginia-leading-into-election-year-2024-president-economy-voters/72399218007/",
        "title": "Va. voters approve of Democrat platforms, disapprove of Democrat president, survey says",
        "description": "President Joe Biden recieved a 36% approval rating from voters in Virginia, down from 38% in the previous year, according to a January survey."
    },
    {
        "url": "https://www.foxnews.com/politics/gina-swoboda-activist-trump-becomes-new-arizona-republican-party-chair",
        "title": "Gina Swoboda, activist endorsed by Trump, becomes new Arizona Republican party chair",
        "description": "Gina Swoboda is an election activist who was endorsed by former President Donald Trump. She has become the new chair of the Arizona Republican Party following Jeff DeWit&#39;s resignation."
    },
    {
        "url": "https://www.nytimes.com/2024/01/29/nyregion/suozzi-mazi-pilip-santos.html",
        "title": "In the Race to Replace George Santos, National Issues Reverberate",
        "description": "Here’s what you need to know about the special House election on Feb. 13, pitting former Representative Tom Suozzi, a Democrat, against the Republican Party’s candidate, Mazi Pilip, a local legislator."
    }
]