[
    {
        "url": "https://www.bbc.com/news/world-asia-68177777?at_bbc_team=editorial&at_campaign_type=owned&at_format=link&at_link_id=F1EE6DB8-C47B-11EE-8313-0D6AD0B4AF07&at_link_origin=BBCWorld&at_link_type=web_link&at_ptr_nam",
        "title": "Imran Khan is in jail. Pakistan has never been more divided",
        "description": "It was a rule laid down shortly after Imran Khan was elected Pakistan&#39;s prime minister in July 2018. &quot;I remember my father didn&#39;t vote for Imran Khan in the 2018 elections. My sister and I didn&#39;t talk to him for three months. We couldn&#39;t sit together at meals or anything,&quot; said Nida Zeshaan, who calls herself a &quot;diehard Khan supporter&quot;."
    },
    {
        "url": "https://edition.cnn.com/2024/02/05/politics/fact-check-trump-james-lankford-endorsement/index.html?ref=mc.news",
        "title": "Fact check: Trump falsely claims he ‘did not endorse’ Republican immigration negotiator James Lankford",
        "description": "Former President Donald Trump falsely claimed on Monday that he didn’t endorse Sen. James Lankford of Oklahoma, the primary Republican negotiator of a bipartisan immigration bill that Trump has sharply criticized."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048441/GRAHAM-GRANT-lazy-Left-wing-tripe-progressive-tax-rises-time-Holyrood-tried-start-CUTTING-them.html",
        "title": "GRAHAM GRANT: Enough of this lazy Left-wing tripe about &#39;progressive&#39; tax rises it&#39;s time Holyrood tried to start CUTTING them",
        "description": "Is Scotland condemned to high taxes for eternity - and is any political party brave enough to make a stand against them? It&#39;s a fiction to suppose that Scots are wedded to punitive taxation."
    },
    {
        "url": "https://www.ft.com/content/6982fea8-e619-4574-b9ea-fda2abcb684c",
        "title": "Pakistan’s political dynasties jockey for power in <b>election</b> lacking Imran Khan",
        "description": "The general election on Thursday will pit the Pakistan Muslim League-N of three-time former premier Nawaz Sharif, who has returned to Pakistan from four years of self-imposed exile, against political scion Bilawal Bhutto Zardari’s Pakistan People’s party."
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-on-zelenskys-reshuffle-of-military-and-civilian-leaders-iron-general-5w2j2n8wr",
        "title": "The Times view on Zelensky’s reshuffle of military and civilian leaders: Iron <b>General</b>",
        "description": "His commander-in-chief, Valery Zaluzhny — nicknamed the Iron General — can at present boast 88 per cent. It is natural, then, that the president sees a potential rival in his army chief, and may be bracing to fire him."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/rishi-sunak-out-of-touch-bet-rwanda-plan-labour",
        "title": "Sunak ‘out of touch’ for betting £1,000 on Rwanda plan’s success, says Labour",
        "description": "Prime minister also criticised for saying ‘the facts speak for themselves’ when asked if Keir Starmer was a terrorist sympathiser"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68209330",
        "title": "Opposition parties attack Rishi Sunak over £1,000 Rwanda bet",
        "description": "Prime Minister Rishi Sunak has been criticised by opposition parties for a bet over his Rwanda policy. Asked by TalkTV&#39;s Piers Morgan if he would bet £1,000 for a refugee charity that deportation flights would take off before the next election, the PM shook hands with him."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?ICID=ref_fark",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "SNP condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’"
    },
    {
        "url": "https://edition.cnn.com/2024/02/05/politics/cnn-poll-trump-verdict-election-charges/index.html",
        "title": "CNN Poll: Most Americans want verdict on Trump <b>election</b> subversion charges before 2024 vote",
        "description": "Most Americans want to see a verdict on the federal charges former President Donald Trump faces related to election subversion in 2020 before this year’s presidential election, according to a new CNN poll conducted by SSRS."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-68208485?at_medium=RSS&at_campaign=KARANGA",
        "title": "Robin Swann: UUP leader has &#39;decision to make over health minister&#39;",
        "description": "UUP leader Doug Beattie has said he as a decision to make over Robin Swann&#39;s position as health minister. Mr Swann was appointed on Saturday when power-sharing government in Northern Ireland was restored. However, he is planning to run as a candidate in the UK general election, which is due to happen in the next 12 months."
    },
    {
        "url": "https://www.huffpost.com/entry/neal-katyal-donald-trump-freakout_n_65c0a343e4b05c8779fa5a7c",
        "title": "Ex-DOJ Official Says He’s ‘Now At The Freakout Stage’ Over 1 Donald Trump Case",
        "description": "This is a real problem,” said Neal Katyal. Former federal prosecutor Andrew Weissmann said he was “in violent agreement” with the fear."
    },
    {
        "url": "https://www.independent.co.uk/independentpremium/politics-explained/labour-muslim-keir-starmer-general-election-b2490773.html",
        "title": "Labour is losing support from Muslim voters – could it cause problems at the 2024 <b>general election</b>?",
        "description": "The party has been losing the support of Muslim voters since Israel launched its assault on Gaza in response to the Hamas 7 October terror attacks. Archie Mitchell looks at whether this could constitute a significant risk to Labour’s fortunes at the ballot"
    },
    {
        "url": "https://www.huffpost.com/entry/kristen-welker-trump-biden-poll_n_65c08c54e4b05c8779fa442b",
        "title": "‘Wow!’: NBC’s Kristen Welker Shocked By New ‘Truly Stunning’ Biden-Trump Poll",
        "description": "NBC News’ Kristen Welker, on Sunday’s broadcast of “Meet The Press,” expressed her surprise at new polling over a potential 2024 election between President Joe Biden and former President Donald Trump. They involved “some truly stunning numbers,” she told colleague Steve Kornacki."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13047675/Energy-minister-loses-responsibility-rollout-new-electricity-pylons-expressing-worries-new-pylons-local-area.html",
        "title": "Energy minister loses responsibility for rollout of new electricity pylons... after expressing worries about new pylons in his local area",
        "description": "Andrew Bowie, a minister in the Department for Energy Security and Net Zero (DESNZ), had been in charge of the UK&#39;s energy networks until December last year."
    },
    {
        "url": "https://www.ft.com/content/90f49e4e-11d4-4bc6-a327-dfe3916fdcf5",
        "title": "Emerging markets investors brace for historic <b>election</b> year",
        "description": "Electoral contests in countries such as India, Indonesia and Mexico are expected to inject volatility into portfolios"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-trump-hoover-campaign-event-b2490813.html",
        "title": "Biden says he has to ‘hold my Irish temper’ as he rages at ‘Donald Hoover Trump’ in fiery campaign speech",
        "description": "Mr Biden is more frequently invoking his predecessor’s name as the two men hurtle towards a rematch of the 2020 general election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/rishi-sunak-bets-piers-morgan-rwanda-flights-election/",
        "title": "Watch: Rishi Sunak bets Piers Morgan £1,000 Rwanda flights will take off before <b>election</b>",
        "description": "Rishi Sunak has shaken hands on a £1,000 bet with Piers Morgan that migrant deportation flights to Rwanda will take off before the next general election. Mr Morgan bet the Prime Minister £1,000, to be given to a refugee charity, that “you don’t get anybody on those planes before the election.”"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://inews.co.uk/news/politics/former-scottish-labour-leader-kezia-dugdale-admits-voting-for-snp-2889749?ico=above_article_ticker",
        "title": "Former Scottish Labour leader Kezia Dugdale voted SNP due to anger over Brexit",
        "description": "The former leader said she voted for the party just once at the European elections but it was &#39;in no way&#39; a vote for independence"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68185435",
        "title": "Former Scottish Labour leader Kezia Dugdale admits voting SNP",
        "description": "A former leader of the Labour Party in Scotland has admitted voting SNP. Kezia Dugdale told a new BBC documentary she was &quot;so mad about Brexit&quot; she backed the party at the European Parliament election in 2019. She said she had voted Labour at every election since."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082?ico=in-line_link",
        "title": "Tories planning for two back-to-back <b>general</b> <b>elections</b>",
        "description": "Tory party strategists are privately planning for two <b>general</b> <b>elections</b> in quick succession amid a growing belief that the first result could be tighter than national opinion polls suggest, i has been told. While the Conservatives’ prevailing opinion is ..."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/ohio-attorney-general-opposes-speeding-timeline-lawsuit-proposed-106972363",
        "title": "Ohio attorney <b>general</b> opposes speeding up timeline for lawsuit over proposed voting rights amendment",
        "description": "Republican Attorney General Dave Yost has told the Ohio Supreme Court that a lawsuit filed against him by a coalition of civil rights organizations behind a proposed voting rights amendment shouldn&#39;t"
    },
    {
        "url": "https://www.nytimes.com/2024/02/05/us/politics/trump-incumbency-imagery.html",
        "title": "How Trump Uses the Power and Imagery of His Presidency",
        "description": "Donald Trump is capitalizing on his unusual status as both a former president and a candidate to twist the race in his favor in ways big and small."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4449662-haley-urges-congress-change-border-bill-we-need-this-fix-now/",
        "title": "Haley urges Congress to make changes to border bill: ‘We need this fix now’",
        "description": "Former United Nations ambassador Nikki Haley urged Congress to amend a bipartisan border deal unveiled by Senate negotiators on Sunday, urging lawmakers that “we need this fix now.”  “They need to"
    },
    {
        "url": "https://www.livemint.com/news/world/rishi-sunaks-makes-1-000-bet-about-rwanda-deportation-flights-the-condition-is-11707166917232.html",
        "title": "Rishi Sunak&#39;s makes £1,000 bet about Rwanda deportation flights. The condition is....",
        "description": "British Prime Minister Rishi Sunak has made a £1,000 bet about migrant deportations to Rwanda in the coming months."
    },
    {
        "url": "https://www.marketwatch.com/story/conventional-wisdom-said-trump-couldnt-win-in-2016-this-historians-keys-said-he-would-what-are-those-keys-telling-us-today-4562126e",
        "title": "Conventional wisdom said Trump couldn’t win in 2016. This historian’s ‘keys’ said he would. What are those keys telling us today?",
        "description": "Biden holds an edge this November based on American University professor Allan Lichtman’s analysis of 13 historical predictors."
    },
    {
        "url": "https://news.yahoo.com/interest-ended-open-primaries-increases-212343744.html",
        "title": "Interest in ended open primaries increases amongst Texas GOP",
        "description": "Ahead of the March 5 primary elections in Texas, leaders in the state GOP are seeking to close off primary contests to registered Republicans only."
    },
    {
        "url": "https://www.thedailybeast.com/biden-and-democrats-are-their-own-worst-enemies-on-border-crisis",
        "title": "Biden and Democrats Are Their Own Worst Enemies on Border Crisis",
        "description": "They’ve had all the time in the world to manage a problem that polls show voters prefer Trump and Republicans to handle."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/this-time-bjp-will-get-370-and-nda-over-400-seats-asserts-pm/articleshow/107438477.cms",
        "title": "This time, BJP will get 370+ and NDA over 400 seats, asserts PM",
        "description": "Prime Minister Narendra Modi confidently declared on Monday his anticipation of returning to office in May with a resounding victory. He predicted tha"
    },
    {
        "url": "https://apnews.com/article/nayib-bukele-el-salvador-president-0ab3b1d63d3633c535b2cb9b60c56879",
        "title": "‘Coolest dictator’ to ‘philosopher king,’ Nayib Bukele’s path to reelection in El Salvador",
        "description": "El Salvador’s Nayib Bukele has called himself the “world’s coolest dictator” or as his X profile read on election day, the “Philosopher King.”"
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-says-wants-debate-joe-biden-rcna137340",
        "title": "Trump says he wants to debate Biden",
        "description": "The Republican National Committee decided in 2022 to withdraw from the quadrennial events set up by the Commission on Presidential Debates."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/tdp-mp-jayadev-galla-to-quit-politics-raises-concerns-over-weaponisation-of-agencies/articleshow/107438457.cms",
        "title": "TDP MP to quit politics, flags ‘weaponisation’ of agencies",
        "description": "TDP MP Jayadev Galla announces decision to step away from politics, citing concerns over the &#39;weaponisation&#39; of government agencies. He highlights the impact on &#39;Make-in-India&#39; and &#39;Atmanirbhar Bharat&#39; initiatives."
    },
    {
        "url": "https://www.vanityfair.com/news/will-donald-trump-actually-face-accountability-criminal-trials",
        "title": "Will Donald Trump Actually End Up Facing Legal Accountability?",
        "description": "The former president is facing 91 felony charges. But, with the three most serious cases mired in delays, will anything come of them before Americans deliver their own verdict at the ballot box in November?"
    },
    {
        "url": "https://www.yahoo.com/news/hell-does-think-biden-goes-202700749.html",
        "title": "&#39;Who the hell does he think he is?&#39;: Biden goes after Trump&#39;s rhetoric in Nevada",
        "description": "With two days to go until Nevada&#39;s presidential primary, President Joe Biden appears to have his sights set on November: At a get-out-the-vote rally on Sunday night in North Las Vegas, Biden sharpened his attacks on former President Donald Trump,"
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/corporate-america-republican-minority-rule-1234959739/",
        "title": "Blame These Companies for the GOP’s Minority Rule",
        "description": "And it is a dynamic fueled by some of America’s most recognizable brands — companies that have donated tens of millions of dollars to the organization behind REDMAP, and the group most responsible for engineering minority rule in this country: the Republican State Legislative Committee."
    },
    {
        "url": "https://thehill.com/homenews/administration/4449377-biden-meets-with-union-workers-las-vegas/",
        "title": "Biden meets with union workers in Las Vegas",
        "description": "President Biden on Monday met with union workers in Las Vegas, seeking to bolster his support with a key constituency on the eve of the state’s primary and ahead of the general election. Biden"
    },
    {
        "url": "https://www.livemint.com/news/us-president-biden-calls-israeli-pm-netanyahu-bad-f-cking-guy-as-us-is-pushed-into-wider-war-in-middle-east-report-11707105255261.html",
        "title": "US President Biden calls Israeli PM Netanyahu &#39;Bad f*cking guy&#39; as US is pushed into wider war in Middle East: Report",
        "description": "US President Joe Biden has referred to Israeli Prime Minister Benjamin Netanyahu as a bad guy in private, according to sources"
    },
    {
        "url": "https://www.politico.com/news/2024/02/05/chutkan-trump-trial-date-2024-00139665",
        "title": "Chutkan contemplates Trump trial extending deep into 2024, as case remains in limbo",
        "description": "It was the judge&#39;s first acknowledgment that Trump’s federal trial could could extend into the general election."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/prominent-democrats-duel-baseball-star-garvey-feinsteins-us-106956666",
        "title": "Prominent Democrats duel ex-baseball star Garvey for Feinstein&#39;s US Senate seat in California",
        "description": "A trio of prominent California Democrats is dueling with Republican former baseball star Steve Garvey for the U.S. Senate seat once held by the late Democratic Sen. Dianne Feinstein"
    },
    {
        "url": "https://slate.com/news-and-politics/2024/02/fani-willis-controversy-now-what-trump-trial-news.html",
        "title": "Keeping Up With the Trump Trials: Fani Willis Broke Her Silence. Now What?",
        "description": "On Friday, after staying mostly silent for the past three weeks on pretty damning misconduct allegations, Willis finally addressed the scandal in a court-ordered 176-page motion. And buried in the pages of legalese is an admission that Willis is in fact in a romantic relationship with special prosecutor Nathan Wade."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/05/so-what-happens-if-trump-is-actually-convicted/",
        "title": "So what happens if Trump is actually convicted?",
        "description": "The Donald Trump era in American politics has been defined in part by the assumption that something might at some point get in Trump’s way."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/india/appalling-mockery-murder-of-democracy-sc-on-chandigarh-mayor-polls/articleshow/107437430.cms",
        "title": "Appalling, mockery, murder of democracy: SC on Chandigarh mayor polls",
        "description": "The Supreme Court has criticized the returning officer of the Chandigarh mayoral polls for allegedly defacing ballot papers on video to influence the election results. The Chief Justice of India verbally observed that the returning officer should be prosecuted and called it a &quot;mockery and murder of democracy."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/ex-cec-sunil-arora-for-one-election-but-wants-separate-local-polls/articleshow/107437165.cms",
        "title": "Ex-CEC Sunil Arora for one <b>election</b>, but wants separate local polls",
        "description": "The &#39;One Nation, One Election&#39; panel, chaired by former president of India, Ram Nath Kovind, has sought the views of former CECs, chief justices, political parties, chambers of commerce and the public on the prospect of holding simultaneous elections across all three tiers of the government -- panchayats/ local bodies,"
    },
    {
        "url": "https://news.yahoo.com/fewer-americans-survey-expect-trump-175530450.html",
        "title": "Fewer Americans in new survey expect Trump to concede if he loses in November",
        "description": "Nearly three-quarters of Americans, 74 percent, believe former President Trump will refuse to concede if he loses the 2024 election, a significant increase from similar surveys in 2020. The CNN poll released Monday signals that many voters expect election denial rhetoric to continue if Trump loses again in November."
    },
    {
        "url": "https://www.yahoo.com/news/el-salvador-president-elected-bad-171932216.html",
        "title": "El Salvador’s president will be re-elected. That’s bad news for democratic norms | Opinion",
        "description": "We also should be worried that other countries will follow the idea that popularity justifies giving leaders power. | Opinion"
    },
    {
        "url": "https://www.thetimes.co.uk/article/worlds-coolest-dictator-election-el-salvador-r06vzk3f0",
        "title": "El Salvador’s self-styled ‘cool dictator’ Nayib Bukele claims <b>election</b> victory",
        "description": "Nayib Bukele, El Salvador’s president, is set to win an overwhelming victory in the country’s general election, held on Sunday, which will secure the leader who once boasted he was the “world’s coolest dictator” another five years in power."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24096937.heaton-harris-tells-oneill-focus-public-services-not-border-poll/",
        "title": "Heaton-Harris tells O’Neill to focus on public services not border poll",
        "description": "Northern Ireland’s First Minister Michelle O’Neill should focus on improving public services rather than raising the issue of a ballot on reunification, Chris Heaton-Harris suggested. The Northern Ireland Secretary dismissed the prospect of a border poll after Ms O’Neill claimed one could be held in the next 10 years."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-plans-to-extend-equal-pay-rights-to-racial-minorities-xf6f9gqqc",
        "title": "Labour plans to extend equal pay rights to racial minorities",
        "description": "Labour will enshrine in law the right of black, Asian and ethnic minority people to equal pay if it wins the next general election, the party is set to announce. Anneliese Dodds, Labour’s shadow women and equalities secretary,"
    },
    {
        "url": "https://edition.cnn.com/2024/02/05/politics/presidency-trump-eligible-trials-court/index.html",
        "title": "Trump’s legal battles are at a critical moment with major implications for the 2024 <b>election</b>",
        "description": "Critical days are ahead in Donald Trump’s multiple legal battles. Imminent rulings and looming trials could prove fateful to the Republican frontrunner’s 2024 campaign and his personal fortune. The powers and the limits of the presidency, and even America’s constitutional democracy, will be shaped by what happens next."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13045087/Rishi-Sunak-bets-Piers-Morgan-1000-refugees-planes-Rwanda-general-election-broadcaster-savages-Prime-Minister-allowing-mother-wait-seven-hours-heart-attack-treatment-warzone-NHS-hospital.html",
        "title": "Rishi Sunak bets Piers Morgan £1000 he will get refugees on planes to Rwanda BEFORE <b>general election</b> after broadcaster savages Prime Minister for allowing his mother to wait ...",
        "description": "The Prime Minister shook on the wager after being grilled by the TalkTV host in an uncomfortable hour-long sit-down interview at No 10."
    },
    {
        "url": "https://www.huffpost.com/entry/el-salvador-elections-nayib-bukele_n_65c0535de4b05c8779f9fad2",
        "title": "El Salvador Celebrates Likely Reelection Of ‘World’s Coolest Dictator’",
        "description": "Bukele, the self-described “world’s coolest dictator,” has gained fame for his brutal crackdown on gangs, in which more than 1% of the country’s population has been arrested. On Sunday afternoon, Bukele waded through a crowd of supporters to vote wearing a blue golf shirt and white baseball cap."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13044801/joe-biden-fighting-talk-trump-irish-temper.html",
        "title": "Joe&#39;s fighting talk for sick f**k Trump: Biden unleashes during Las Vegas fundraiser, warning he has to &#39;hold his Irish temper&#39; around GOP rival for talking about dead son Beau",
        "description": "President Joe Biden unleashed on Donald Trump during a fundraiser, indicating he&#39;s considered punching his Republican rival and noting he has to &#39;hold his Irish temper&#39; around him."
    }
]