[
    {
        "url": "https://www.thesun.co.uk/news/25616088/rishi-sunak-this-morning-rylan-clark-rochelle-humes/",
        "title": "Rishi Sunak bats away tough questions during This Morning chat with Rylan Clark and Rochelle Humes",
        "description": "RISHI Sunak faces a roasting from This Morning’s Rylan Clark and Rochelle Humes as he joins them while they cook. The trio were in the ITV show’s kitchen tasting chicken as the PM talked about his"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/30/hunt-warns-weak-economy-undermining-tax-cut-hopes/",
        "title": "Hunt warns weak economy undermining tax cut hopes",
        "description": "Jeremy Hunt has warned the cabinet that he may have limited scope to cut taxes as the International Monetary Fund (IMF) said Britain’s growing debt pile and pressures on the NHS would make them unaffordable."
    },
    {
        "url": "https://www.huffpost.com/entry/anthony-kern-overturn-elections-bill-arizona_n_65b95883e4b0102bd2d673f7",
        "title": "Arizona Republican Proposes Bill That Would Allow Politicians To Overturn <b>Elections</b>",
        "description": "Arizona state Sen. Anthony Kern (R), a “fake elector” for Donald Trump in 2020 who was also photographed on Capitol grounds during the Jan. 6 attack, has filed a longshot proposal to allow Arizona politicians to overturn the will of voters in presidential elections."
    },
    {
        "url": "https://www.ft.com/content/4dbfc3c2-39d5-464b-82a1-fb4c9975d569",
        "title": "FirstFT: Hong Kong proposes new security law to follow China’s crackdown",
        "description": "Also in today’s newsletter, Pakistan’s Imran Khan sentenced to 10 years in prison and Volodymyr Zelenskyy prepares to replace Ukraine’s top general"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/tories-labour-age-vote-election_uk_65b96e59e4b01c5c3a3883a8",
        "title": "Only The Over-70s Would Vote Tory, Poll Finds",
        "description": "“The Tories are now the most popular party only among the over-70s, 43% of whom back the party. This is down from 67% in 2019, however, with Labour being the main beneficiaries, having increased their vote share among the oldest Britons from 14% to 23%."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13024893/joe-biden-super-pac-ad-swing-states-reelection-donald-trump.html",
        "title": "Biden Super PAC puts record breaking $250 MILLION into swing state ad blitz: Joe&#39;s 2024 re-<b>election</b> supporters target battleground states including Georgia in bid to take down ...",
        "description": "A super PAC supporting President Biden&#39;s re-election bid is planning to spend a record $250 million on ads ahead of the November election in an effort to take down Donald Trump."
    },
    {
        "url": "https://www.thesun.co.uk/news/25613678/population-projected-sun-says/",
        "title": "Staggering population totals now projected are a rapid upheaval than Britain can possibly handle",
        "description": "Migrant shock WHAT mandate do politicians think they have to let our population soar to the staggering totals now projected? Voters never agreed to it. Not at the Brexit referendum, nor the 2019"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-tories-election-tax-cuts-immigration-b2487561.html",
        "title": "Rishi Sunak’s fading <b>election</b> hopes hit by triple whammy",
        "description": "IMF rules out tax cuts, minister Kemi Badenoch caught in ‘Evil Plotters’ row, while Tory right claims six million rise in population makes mockery of Brexit"
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/30/volodymyr-zelenskiy-asked-top-general-to-step-down-but-he-refused",
        "title": "Ukraine’s top <b>general</b> refuses request from Zelenskiy to step down",
        "description": "Personality clashes blamed for conflict with popular commander Valerii Zaluzhnyi"
    },
    {
        "url": "https://edition.cnn.com/2024/01/30/politics/biden-florida-fundraising-stops/index.html",
        "title": "Biden sets his sights on 2024 Florida win during visit to Trump territory",
        "description": "Since then, Trump’s Mar-a-Lago estate has emerged as the de-facto epicenter of national Republican politics. He formally changed his residence from New York to Palm Beach in 2019, and spends the winter months using the oceanfront estate as a campaign hub, fundraising venue and setting for dinner meetings over steak and chocolate cake."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/30/trust-is-lost-muslim-voters-unhappy-with-labour-stance-on-gaza-war",
        "title": "‘Trust is lost’: Muslim voters unhappy with Labour’s stance on Gaza war",
        "description": "Party’s position has shifted with Keir Starmer now calling for a ‘sustainable ceasefire’ but for some voters it is too little too late"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13023843/Rishi-Sunak-pounced-Morning-milanese.html",
        "title": "QUENTIN LETTS: Half-starved Rishi, fresh from his latest 36-hour fast, pounced on This Morning&#39;s mid-week milanese like a seagull",
        "description": "Fresh from his latest 36-hour fast, Rishi Sunak was interviewed on the This Morning sofa. Spying some fresh-fried chicken in breadcrumbs, half-starved Rishi pounced on it like a seagull."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/30/rishi-sunak-latest-news-dup-northern-ireland-farage/",
        "title": "Politics latest news: Reform UK backing among 2019 Tory voters reaches record high",
        "description": "Nigel Farage has criticised the Archbishop of Canterbury Justin Welby over comments he made about small boat crossings and the Government’s Rwanda Bill."
    },
    {
        "url": "https://edition.cnn.com/2024/01/30/politics/donald-trump-illinois-14th-amendment/index.html",
        "title": "Bipartisan Illinois <b>election</b> board dismisses 14th Amendment case against Trump",
        "description": "The Illinois State Board of Elections voted unanimously Tuesday to dismiss a challenge to former President Donald Trump’s candidacy, but the decision is not expected to be the final word in the matter,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/imf-warns-tories-against-cutting-taxes-before-election-2vlps09pg",
        "title": "IMF warns Tories against cutting taxes before <b>election</b>",
        "description": "The International Monetary Fund has warned the Conservatives against new pre-election tax cuts and cast doubt on the government’s ability to make swingeing reductions to public spending over the"
    },
    {
        "url": "https://www.ft.com/content/22001ea1-273e-46d7-90d6-18b10327d574",
        "title": "Imran Khan sentenced to 10 years in prison ahead of Pakistan <b>election</b>",
        "description": "A Pakistani court has sentenced Imran Khan to 10 years in prison just days before the country’s general election, in what his party said was part of an escalating campaign to sideline the popular former prime minister."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-laughs-hes-grilled-32000159",
        "title": "Rishi Sunak laughs as he&#39;s grilled by ITV This Morning&#39;s Rylan on Tory <b>election</b> chances",
        "description": "The Prime Minister was quizzed by ITV This Morning&#39;s Rylan Clark and Rochelle Humes on when viewers will next head to the ballot box as polls show the Tories trailing Labour"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/celebrities-campaign-petition-universal-credit-32000561",
        "title": "Emma Thompson and celebs sign open letter calling for rise in Universal Credit basic rate",
        "description": "It comes as almost three million emergency food parcels were distributed last year by anti-poverty charity, The Trussell Trust"
    },
    {
        "url": "https://www.bbc.com/pidgin/articles/c2xjdz0z7g2o",
        "title": "Pakistan former Prime Minister Imran Khan dey sentenced to prison for leaking state secrets",
        "description": "Former Pakistani Prime Minister Imran Khan don dey sentenced to 10 years in jail inside one case wia dem accuse am of leaking state secrets."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68138591.amp",
        "title": "Imran Khan: Pakistan former PM jailed in state secrets case as <b>election</b> looms",
        "description": "Former Pakistani prime minister Imran Khan has been sentenced to 10 years in jail in a case in which he was charged with leaking state secrets. Khan, who was ousted by his opponents as PM in 2022, is already serving a three-year jail term after being convicted of corruption."
    },
    {
        "url": "https://uk.news.yahoo.com/parties-pick-candidates-council-election-131038975.html",
        "title": "Parties pick candidates for council by-<b>election</b> in Glasgow in March",
        "description": "Candidates have been chosen to fight the Hillhead by-election in Glasgow. The four parties represented on the council have selected who will contest the vote on March 7. The by-election was called after the death of long-serving Labour councillor,"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-general-election-starmer-mandelson-poll-b2487453.html",
        "title": "Labour grandee Mandelson warns Labour lead is ‘artificial’ and will shrink before <b>election</b>",
        "description": "His comments come days after a major poll predicted Labour is on track for a 1997-style <b>general election</b> landslide. The YouGov survey said the Tories could retain as few as 169 seats, while Labour would sweep into power with 385 – giving Sir Keir Starmer ..."
    },
    {
        "url": "https://www.mymotherlode.com/news/national/general-election/3300890/indiana-legislation-would-add-extra-verification-steps-to-prove-voters-are-eligible.html",
        "title": "Indiana legislation would add extra verification steps to prove voters are eligible",
        "description": "Republican lawmakers in Indiana have advanced a bill that would make first-time voters prove where they live and would increase the power of the state to verify all voters&#39; addresses. Voting advocates worry the legislation approved Monday could inadvertently remove lawfully registered voters."
    },
    {
        "url": "https://metro.co.uk/2024/01/30/nicole-kidmans-new-show-expats-banned-amazon-prime-hong-kong-20198495/?ico=trending-post-strip_item_2",
        "title": "Nicole Kidman’s new show banned by Amazon Prime",
        "description": "The first episode includes a brief scene in which people at a rally chant in Cantonese: ‘I want real <b>general</b> <b>elections</b>.’ The trailer for the show also features a crowd holding umbrellas, a reference to the 2014 Umbrella Movement, when protesters ..."
    },
    {
        "url": "https://news.yahoo.com/exclusive-donor-bigelow-gave-trump-211943442.html",
        "title": "Exclusive-Hotelier Robert Bigelow gives Trump $1 million for legal fees",
        "description": "(Reuters) -Hotelier Robert Bigelow told Reuters on Tuesday he gave Republican presidential candidate Donald Trump $1 million for his legal fees and agreed to donate another $20 million to a pro-Trump outside group for campaign purposes."
    },
    {
        "url": "https://www.politico.com/newsletters/politico-influence/2024/01/30/resolute-lobbyists-land-at-porter-wright-00138676",
        "title": "Resolute lobbyists land at Porter Wright",
        "description": "Porter Wright Morris &amp; Arthur has snapped up four of the lobbyists who were impacted last year when Illinois-based Resolute Public Affairs abruptly laid off its D.C. office."
    },
    {
        "url": "https://news.yahoo.com/missouri-senate-republicans-filibuster-hopes-224626560.html",
        "title": "Missouri Senate Republicans filibuster in hopes of making it harder for voters to amend constitution",
        "description": "A faction of the Missouri Senate ended a roughly 16-hour filibuster on Tuesday that was meant to pressure their fellow Republicans into fast-tracking legislation that would make it harder for voters to amend the state constitution."
    },
    {
        "url": "https://www.ibtimes.co.uk/50-business-leaders-want-keir-starmer-next-prime-minister-1723098",
        "title": "50% Of Business Leaders Want Keir Starmer As Next Prime Minister",
        "description": "Corporate leaders have said that they would have more business confidence if the Labour Party win the next general election."
    },
    {
        "url": "https://www.ibtimes.co.uk/pakistan-protestors-clash-police-after-imran-khan-sentenced-decade-jail-1723093",
        "title": "Pakistan: Protestors Clash With Police After Imran Khan Sentenced To Decade In Jail",
        "description": "Ex-Prime Minister Khan and former Foreign Minister Shah Mahmood Qureshi have been sentenced to 10 years in prison on further corruption charges."
    },
    {
        "url": "https://apnews.com/article/wisconsin-absentee-voting-biden-trump-6a9f4e3fe909af0f6c5230402348423d",
        "title": "Judge orders Wisconsin <b>elections</b> officials to move quickly on changing absentee ballot rules",
        "description": "The Wisconsin Elections Commission will likely be voting next week on how to implement a judge’s ruling allowing election clerks to accept absentee ballots that have partial witness addresses, a decision that is expected to expand the number of ballots that will be counted in battleground Wisconsin."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/on-budget-session-eve-govt-moves-to-revoke-14-oppn-mps-suspension/articleshow/107272013.cms",
        "title": "On budget session eve, government moves to revoke 14 opposition MPs&#39; suspension",
        "description": "The government initiated revocation of suspension of 14 opposition MPs after an all-party meeting. The last session of the 17th Lok Sabha will focus o"
    },
    {
        "url": "https://www.barrons.com/news/international-7-day-news-agenda-39300abc",
        "title": "International 7-Day News Agenda",
        "description": "OSLO (Norway) - Annual ethics report of Norway&#39;s pension fund, the largest in the world (0900 GMT) BRAUNSCHWEIG (Germany) - Court hears Matthias Müller, ex-boss of the Volkswagen group, in the investor collective action trial over market manipulation (0900 GMT) PICTURE."
    },
    {
        "url": "https://www.yahoo.com/news/senators-push-federal-commission-help-205122943.html",
        "title": "Senators push federal commission to help defend voters from AI disinformation",
        "description": "The letter from Sens. Amy Klobuchar and Susan Collins comes after a robocall in New Hampshire gained national attention."
    },
    {
        "url": "https://www.barrons.com/news/us-republicans-gamble-on-immigration-as-major-2024-election-issue-d0b17143",
        "title": "US Republicans Gamble On Immigration As Major 2024 <b>Election</b> Issue",
        "description": "US immigration reform has become the focus of a high-stakes political battle, with President Joe Biden and Donald Trump locking horns over one of the hottest issues of the 2024 election."
    },
    {
        "url": "https://apnews.com/article/north-carolina-elections-voting-registration-lawsuits-a96bceac60814622025d8d14e167a239",
        "title": "North Carolina amends same-day voter registration rules in an effort to appease judge’s concerns",
        "description": "North Carolina election officials are trying to fine-tune how they verify the addresses of voters who register and cast their ballots on the same day."
    },
    {
        "url": "https://www.politico.com/news/2024/01/30/south-carolina-black-voters-biden-00138597",
        "title": "South Carolina’s ‘unprecedented’ Democratic primary",
        "description": "Christale Spain, the first Black woman to serve as South Carolina’s Democratic Party chair, says Black voters will repeat history in the Palmetto state primary — and deliver for Joe Biden."
    },
    {
        "url": "https://www.cnn.com/2024/01/30/politics/5-distinct-legal-questions-looming-over-donald-trump/index.html",
        "title": "5 distinct legal questions looming over Donald Trump this week",
        "description": "While Donald Trump’s path through Republican primaries is clearing up, he faces looming unanswered questions in multiple different courts. Keeping track of the complicated and ever-evolving web of Trump-related court cases is nearly impossible,"
    },
    {
        "url": "https://www.yahoo.com/news/special-elections-set-two-house-185935365.html",
        "title": "Special <b>elections</b> set for two House vacancies. One candidate is a Senator’s sister.",
        "description": "The Republican candidate in that district belongs to a familiar family in Frankfort. Courtney Gilbert, who won the Republican nomination process for House District 24, is Sen. Adrienne Southworth’s, R-Lawrenceburg, sister. It wasn’t her first time vying for the seat."
    },
    {
        "url": "https://inews.co.uk/news/jenrick-and-braverman-lead-tory-backlash-as-migration-set-to-add-6m-to-population-2881353?ITO=msn",
        "title": "Jenrick and Braverman lead Tory backlash as migration set to add 6m to population",
        "description": "But Conservative MPs have warned that more measures will be needed to reduce net migration to below 250,000, as promised in the last Tory <b>general election</b> manifesto. They are lobbying Rishi Sunak behind closed doors to consider making use of the UK’s ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/kemi-badenoch-rishi-sunak-conservative-leader-b1135766.html",
        "title": "Kemi Badenoch may be part of the &#39;Evil Plotters&#39; WhatsApp group but she has an audacious plan",
        "description": "But — arch Tory in-jokes aside — she definitely doesn’t want yet another leadership contest before the <b>general election</b>. She has correctly calculated that the winner of such a race would then be blamed for the Tories’ subsequent defeat and ..."
    },
    {
        "url": "https://www.basingstokegazette.co.uk/news/24077107.election-basingstoke-labour-candidate-applications-close/",
        "title": "<b>Election</b>: Basingstoke Labour candidate applications close",
        "description": "The application process, which opened on Thursday, January 18, and closed on Thursday, January 25, saw members of the Basingstoke Labour Party put their names forward to be voted as its representative in the area during the next general election."
    },
    {
        "url": "https://www.edp24.co.uk/news/24085301.election-2024-time-supercharge-east-anglia/",
        "title": "<b>Election</b> 2024: its time to supercharge East Anglia",
        "description": "As a result, we perhaps don’t always shout loudly enough about what we need. But with a <b>general election</b> on the horizon, we argue that it’s time for that to change. That’s why we’re launching a manifesto outlining exactly what it will take to ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7152332",
        "title": "Northern Ireland latest: Stormont set for historic first minister after power-sharing deal struck",
        "description": "And as the Rwanda plan divides the Tory party, small boat crossings continue. So, with the <b>general election</b> approaching, how is the prime minister doing on delivering his other promises? You can see the progress for yourself below. Rabbit out of the hat ..."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/30/ecp-gives-directive-to-complete-printing-of-ballot-papers-by-feb-2/",
        "title": "ECP gives directive to complete printing of ballot papers by Feb 2",
        "description": "ISLAMABAD: As the date of the general elections nears, the Election Commission of Pakistan (ECP) said it will complete the printing of ballot papers by February 2.On the other hand, the electoral"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-norfolk-68141420",
        "title": "George Freeman: Voters criticise MP who &#39;couldn&#39;t afford&#39; mortgage",
        "description": "Voters have criticised a Conservative MP who claimed he could not afford to pay his mortgage on a £118,300 ministerial salary. Mid Norfolk MP George Freeman quit as science minister in November, in order to take other jobs to make ends meet. Constituent Jamie Langham said he had &quot;no sympathy&quot; for the MP."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68138591.amp",
        "title": "Imran Khan: Pakistan former PM jailed in state secrets case as <b>election</b> looms",
        "description": "Former Pakistani prime minister Imran Khan has been sentenced to 10 years in jail in a case in which he was charged with leaking state secrets. Khan, who was ousted by his opponents as PM in 2022, is already serving a three-year jail term after being convicted of corruption."
    },
    {
        "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4?ncid=engmodushpmg00000003",
        "title": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It",
        "description": "Many on the right claim the U.S. is being &quot;invaded&quot; by migrants but also want to wait until Donald Trump is elected president again to stop it."
    },
    {
        "url": "https://uk.news.yahoo.com/reform-uk-ready-general-election-115321043.html",
        "title": "Reform UK will be ready for <b>general election</b>, Tice says",
        "description": "Reform UK leader Richard Tice says his party will be ready for a <b>general election</b> and urged Labour to stand aside, as he claims he did for the Conservatives in 2019."
    },
    {
        "url": "https://www.independent.co.uk/news/democratic-ap-michigan-gretchen-whitmer-detroit-b2487070.html",
        "title": "2 Democratic-leaning Michigan House districts to hold special <b>election</b> primaries",
        "description": "Two Michigan House districts will hold special election primaries to fill seats that were held by Democrats whose departures have left the legislative chamber in an even split since November"
    },
    {
        "url": "https://www.modernghana.com/news/1288952/atonsu-chief-adorning-mahama-with-kente-cloth.html",
        "title": "&quot;Atonsu Chief adorning Mahama with Kente cloth is sign of victory&quot; — NDC PC for Asokwa",
        "description": "Nana Yiadom Gu-Ayebiafo is a sign of victory for the party in the upcoming December 7 <b>general</b> <b>elections</b>. Former President John Dramani Mahama was gifted the artistically woven Kente fabric by the Chief last Friday, at Atonsu Roman Catholic Church ..."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/missouri-senate-republicans-filibuster-hopes-making-harder-voters-106811637",
        "title": "Missouri Senate Republicans filibuster in hopes of making it harder for voters to amend constitution",
        "description": "A faction of the Missouri Senate has ended a roughly 16-hour filibuster that was meant to pressure their fellow Republicans into fast-tracking legislation that would make it harder for voters to amend"
    },
    {
        "url": "https://news.yahoo.com/ballot-process-opens-thursday-hawaii-223200158.html",
        "title": "Ballot process opens Thursday for Hawaii political candidates",
        "description": "Candidates for this year&#39;s Primary and General elections can begin the process to have their names on the ballot starting Thursday. Candidates must obtain a nomination paper and signatures from registered voters in their district ahead of the June 4 deadline to turn in their paperwork."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/wisconsin-elections-officials-expected-move-quickly-absentee-ballot-106807794",
        "title": "Judge orders Wisconsin <b>elections</b> officials to move quickly on changing absentee ballot rules",
        "description": "A Wisconsin judge has ordered the Wisconsin Elections Commission to implement his ruling allowing election clerks to accept absentee ballots that have partial witness addresses, a decision that is expected to expand the number of ballots that will be"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/30/biden-uaw-plan-michigan-event/72411006007/",
        "title": "Biden, UAW planning Michigan event for this Thursday",
        "description": "No details were known about the expected event but it would come on the heels of the UAW giving its endorsement to Biden last week."
    },
    {
        "url": "https://www.yahoo.com/gma/voters-said-didnt-want-biden-192200150.html",
        "title": "Voters said they didn&#39;t want a Biden-Trump rematch. Now they&#39;re facing longest <b>general election</b> ever.",
        "description": "For a while, poll after poll suggested voters didn&#39;t want a rematch between Joe Biden and Donald Trump -- let alone one that took most of the year. &quot;It&#39;s almost a cruel joke on the electorate that the longest presidential election potentially ever might also be the one that they&#39;re least excited about,"
    },
    {
        "url": "https://www.nytimes.com/2024/01/30/climate/patagonia-holdfast-philanthropy.html",
        "title": "Patagonia’s Profits Are Funding Conservation — and Politics",
        "description": "Patagonia and the Chouinards set up a series of trusts, limited liability corporations and charitable groups designed to protect the independence of the clothing company while distributing all of its profits through an entity known as the Holdfast Collective."
    },
    {
        "url": "https://www.cbc.ca/news/world/imran-khan-sentenced-10-years-1.7098811",
        "title": "Former Pakistan PM Imran Khan gets 10-year prison term for leaking state secrets",
        "description": "A Pakistan court handed former prime minister Imran Khan a 10-year jail term on Tuesday for leaking state secrets, the former premier&#39;s media team said, his second conviction in recent months and just 10 days before the country&#39;s general election."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/01/30/ken-paxton-deposition-temporary-reprieve/735c1ea2-bfc4-11ee-a4c6-8f5c350e9316_story.html",
        "title": "Texas Attorney <b>General</b> Ken Paxton gets temporary reprieve from testifying in lawsuit against him",
        "description": "The Texas Supreme Court has agreed to temporarily halt state Attorney General Ken Paxton’s scheduled testimony in a whistleblower lawsuit at the heart of impeachment charges brought against him in 202"
    },
    {
        "url": "https://www.nytimes.com/2024/01/30/world/africa/khaled-nezzar-dead.html",
        "title": "Khaled Nezzar, <b>General</b> at Center of Algeria’s Bloodshed, Dies at 86",
        "description": "In the 1990s, he oversaw troops that committed a host of atrocities against equally brutal Islamist rebels in what became known as the Black Decade."
    },
    {
        "url": "https://apnews.com/article/indiana-election-security-bill-voter-registration-da12aab7f3c13bc4b0d5bcd653d8ec22",
        "title": "Indiana legislation would add extra verification steps to prove voters are eligible",
        "description": "Republican lawmakers in Indiana have advanced a bill that would make first-time voters prove where they live and would increase the power of the state to verify all voters&#39; addresses."
    },
    {
        "url": "https://www.bizjournals.com/stlouis/news/2024/01/30/feds-probe-cori-bush-report.html",
        "title": "Feds probe US Rep. Cori Bush over misuse of security money: Reports",
        "description": "Bush was elected in 2020 after defeating longtime St. Louis-area representative Lacy Clay in the Democratic primary."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/hyderabad/satyavedu-ysrcp-legislator-meets-nara-lokesh/articleshow/107269707.cms",
        "title": "Satyavedu YSRCP legislator meets Nara Lokesh",
        "description": "HYDERABAD: Satyavedu YSRCP legislator Koneti Adimoolam who expressed his displeasure with the party leadership&#39;s decision to field him in the Tirupati."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-general-election-labour-tory-starmer-b2487291.html",
        "title": "Rishi Sunak insists he is ‘absolutely confident’ ahead of 2024 <b>general election</b>",
        "description": "The prime minister told ITV’s This Morning that he was ready for the contest and said Britain has ‘turned a corner’"
    },
    {
        "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4?kr1",
        "title": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It",
        "description": "Many on the right claim the U.S. is being &quot;invaded&quot; by migrants but also want to wait until Donald Trump is elected president again to stop it."
    }
]