[
    {
        "url": "https://edition.cnn.com/2024/02/01/politics/biden-trump-rematch-poll-what-matters/index.html",
        "title": "A Biden-Trump rematch would be mostly about Trump",
        "description": "President Joe Biden may be the incumbent in the White House, but rather than a referendum on Biden and his policies, the coming general election is shaping up to be yet another referendum on former President Donald Trump."
    },
    {
        "url": "https://www.ft.com/content/490ecef0-5b54-4a39-94dd-8be8ffee7a00",
        "title": "FirstFT: Bank losses revive concerns over US commercial real estate",
        "description": "Also in today’s newsletter, Modi’s government promises record level infrastructure spending and US to sanction Israeli settlers"
    },
    {
        "url": "https://www.huffpost.com/entry/biden-executive-order-targeting-israel-settlers-attack-palestinians-west-bank_n_65bbb503e4b0102bd2d82c63",
        "title": "Biden Sanctions Four Israeli Settlers Accused Of Attacking Palestinians In The West Bank",
        "description": "Biden has spoken out against retaliatory attacks by Israeli settlers against Palestinians in the West Bank in the aftermath of the Hamas attacks against Israel on Oct. 7."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68166050.amp",
        "title": "Christopher Steele: Orbis welcomes High Court victory over Trump",
        "description": "A British consultancy that compiled a salacious dossier linking Donald Trump to Russia has welcomed a UK High Court decision to throw out a lawsuit by the former US president. Orbis Business Intelligence - run by ex-MI6 officer Christopher Steele - said it was &quot;delighted&quot; by the ruling."
    },
    {
        "url": "https://edition.cnn.com/2024/02/01/politics/cnn-poll-trump-biden-election-2024/index.html?ref=mc.news",
        "title": "CNN Poll: Trump narrowly leads Biden in <b>general election</b> rematch",
        "description": "With presidential primaries underway and a 2020 general election rematch seemingly the most likely outcome, a new CNN poll conducted by SSRS shows former President Donald Trump narrowly ahead of President Joe Biden in a matchup shaping up to be a close contest nationally."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/01/ex-mp-simon-danczuk-suspended-for-sexting-to-fight-byelection-for-reform",
        "title": "Ex-MP Simon Danczuk suspended for sexting to fight byelection for Reform",
        "description": "Former Labour member likely to be up against George Galloway in contest for Rochdale seat"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13035157/arson-attack-Tory-MP-Mike-Freers-constituency-office-safety.html",
        "title": "Couple appear in court over arson attack at Tory MP Mike Freer&#39;s constituency office as government minister announces he is stepping down because of concerns for his safety",
        "description": "Paul Harwood, 42, and Zara Kasory, 32. were charged last month for setting a shed on fire at the justice minister&#39;s office in North Finchley, London, on Christmas Eve."
    },
    {
        "url": "https://www.huffpost.com/entry/adam-schiff-katie-porter-california_n_65bbe26ee4b05c8779f84e72",
        "title": "Adam Schiff Releases Ad Boosting GOP Opponent In California Senate Race",
        "description": "Schiff holds a lead in the race, according to several polls conducted recently, while Garvey and Rep. Katie Porter (D-Calif.) are battling for second place, and Rep. Barbara Lee (D-Calif.) trails behind them."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/former-labour-mp-simon-danczuk-32025626",
        "title": "Former Labour MP Simon Danczuk switches to Nigel Farage&#39;s Reform for Rochdale byelection",
        "description": "Former Labour MP Simon Danczuk, who was blocked from running for Labour in 2017 after an explicit texting scandal, is standing as the candidate for Nigel Farage&#39;s Reform Party"
    },
    {
        "url": "https://www.bbc.com/news/articles/c72gz7xgyvwo",
        "title": "Politicians pledge action over stinky landfill",
        "description": "A Labour politician has pledged to get answers over a stinky landfill site if his party wins the next election. Shadow environment secretary Steve Reed visited the Walleys Quarry landfill site in Newcastle-under-Lyme on Wednesday to meet local residents."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68164524",
        "title": "Labour promise not to raise corporation tax if elected",
        "description": "Shadow chancellor Rachel Reeves and party leader Keir Starmer are meeting business leaders at an event in London."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tory-mp-election-threat-mike-freer-b2488691.html",
        "title": "MPs plead for security help after Tory minister quits over death threats",
        "description": "Justice minister Mike Freer said he had avoided murder “by the skin of my teeth” – as MPs urged the government, their own parties and Commons authorities to do more to ensure proper security protection."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rachel-reeves-labour-tax-corporation-pro-business-party/",
        "title": "Rachel Reeves won’t promise income tax cuts despite criticising Tories’ freeze on thresholds",
        "description": "Shadow chancellor says Labour is a ‘pro-business’ party and pledges to cap corporation tax at 25 per cent for five years if it wins election"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/mps-standing-down-next-election-b2488852.html",
        "title": "Mapped: All the MPs standing down at the next <b>election</b>",
        "description": "Mr Freer joins a growing number of Conservative MPs deciding to quit politics, including several high-profile ex-cabinet secretaries and other ministers. Alok Sharma, the former business secretary and Cop26 president,"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labours-rachel-reeves-vows-cap-32018632.amp",
        "title": "Labour&#39;s Rachel Reeves vows to cap corporation tax for five years after Tory U-turns chaos",
        "description": "The Shadow Chancellor Rachel Reeves said the current 25% rate of corporation tax will not change for the first term of a Labour Government as she addressed business leaders"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25655131/rishi-slams-vitriolic-hatred-against-mike-freer/",
        "title": "Rishi slams ‘vitriolic hatred’ by Islamic extremists against Tory MP quitting politics &amp; calls it ‘attack on democracy’",
        "description": "RISHI Sunak today slammed the “vitriolic hatred” by Islamic extremists that has driven a veteran Tory minister to quit politics. A No10 spokesperson called the violent threats made"
    },
    {
        "url": "https://www.ft.com/content/ced49313-f02d-4722-b227-ca32b11eff0d",
        "title": "UK justice minister steps down after death threats",
        "description": "North London MP says arson attack on his constituency office and persistent abuse have made his position untenable"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032821/Society-Editors-vows-call-absurd-fake-newspapers.html",
        "title": "Society of Editors vows to name and shame political parties using &#39;absurd&#39; fake local newspapers as campaign material ahead of the <b>general election</b>",
        "description": "The Society of Editors vowed today that it will be monitoring candidates attempting to distribute so-called &#39;fake newspapers&#39; during the upcoming elections."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/tony-blair-leadership-manual-keir-starmer-election/",
        "title": "Tony Blair pens ‘leadership manual he wishes he was given in 1997’",
        "description": "Former Prime Minister says the role is ‘painful’ as you have to move from simply talking to getting things done – ‘governing in about doing’"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/01/donald-trump-nikki-haley-dropping-out-republican?ref=upstract.com",
        "title": "Trump frustrated by Haley as primaries pull focus from campaign against Biden",
        "description": "Ex-president determined to see Haley withdraw from Republican race as he attempts to secure nomination as quickly as possible"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24089158.two-thirds-voters-want-change-government-election-major-poll-suggests/",
        "title": "Two-thirds of voters want change of government at <b>election</b>, major poll suggests",
        "description": "According to Best for Britain’s analysis of the new poll, 56% of those who do not know how they will vote want to see a new government, suggesting that potentially two million voters who seek change are unsure how to cast their ballot to achieve it."
    },
    {
        "url": "https://www.foxnews.com/official-polls/fox-news-poll-biden-trump-tie-wisconsin-head-to-head-matchup",
        "title": "Fox News Poll: Biden and Trump tie in Wisconsin head-to-head matchup",
        "description": "Fox News poll reveals Wisconsin voters currently tied President Joe Biden and former President Donald Trump and who they would back between the two based on several key issues."
    },
    {
        "url": "https://www.politico.com/news/2024/02/01/nikki-haley-donald-trump-halloween-00139167",
        "title": "Haley takes Halloween-themed shot at Trump",
        "description": "“Nikki Haley is a stone cold loser who is becoming more irrelevant by the day,” Trump campaign spokesperson Steven Cheung said in a statement. “The more people get to know her and her Democrat ties, the more they despise her for being a fraud.”"
    },
    {
        "url": "https://www.livemint.com/economy/the-math-of-how-the-centre-plans-to-cut-fiscal-deficit-explained-11706782918268.html",
        "title": "The math of how the Centre plans to cut fiscal deficit, explained",
        "description": "The Centre stayed put on the fiscal consolidation path, aiming to bring the deficit down to 5.1% in 2024-25. Reducing revenue expenditure as a share of GDP is the key factor behind this."
    },
    {
        "url": "https://www.nytimes.com/2024/02/01/us/politics/haley-democrats-south-carolina.html",
        "title": "Democrats Warn Their Voters Against Backing Haley in South Carolina",
        "description": "For any Democrat thinking about skipping Saturday’s primary and participating instead in the Republican contest three weeks later, the message is very clear: Don’t."
    },
    {
        "url": "https://abcnews.go.com/538/americans-democracy-peril-2024-election/story?id=106803471",
        "title": "Americans think democracy is in peril in the 2024 <b>election</b>",
        "description": "But Democrats and Republicans have different concerns."
    },
    {
        "url": "https://nymag.com/intelligencer/2024/02/andrew-cuomo-wants-redemption-and-to-win-an-election.html",
        "title": "Andrew Cuomo Wants Redemption — and He Wants to Win an <b>Election</b>",
        "description": "So Cuomo denies ever harassing anyone, but he has no public forum in which to make his case and has to live with headlines that no politician seeking redemption wants to see. Virtually all were a variation on what the New York Times ran: “Cuomo Created ‘Sexually Hostile’ Workplace, Says Justice Department.”"
    },
    {
        "url": "https://www.nytimes.com/2024/02/01/nyregion/weisselberg-perjury-trump-fraud.html",
        "title": "Trump’s Former Finance Chief in Negotiations to Plead Guilty to Perjury",
        "description": "Allen H. Weisselberg would admit to lying on the stand during the former president’s civil fraud trial, according to people familiar with the talks."
    },
    {
        "url": "https://mashable.com/article/fcc-ai-generated-robocalls-proposal",
        "title": "Listen to this ‘Biden&#39; call sent to voters. No wonder the FCC is cracking down on AI robocalls.",
        "description": "Some voters in New Hampshire received a call from someone who sounded a lot like President Joe Biden. The call encouraged those New Hampshire residents to stay home during the primary election last week and &quot;save your votes&quot; for the general election in November."
    },
    {
        "url": "https://www.barrons.com/news/senegal-presidential-race-to-start-with-one-candidate-behind-bars-7c22a655",
        "title": "Senegal Presidential Race To Start With One Candidate Behind Bars",
        "description": "The race to become Senegal&#39;s next president looks set to kick off on Sunday with anti-establishment candidate Bassirou Diomaye Faye behind bars, according to his aides."
    },
    {
        "url": "https://timesofindia.indiatimes.com/business/budget/nirmala-sitharamans-budget-signals-confidence-in-election-outcome/articleshow/107336084.cms",
        "title": "<b>Election</b>-eve confidence: Finance minister Nirmala Sitharaman shuns sweeteners, focuses on fiscal fitness",
        "description": "Finance minister Nirmala Sitharaman&#39;s budget sends a strong message of confidence in the outcome of the 2024 Lok Sabha elections. Explore the key achievements and future plans outlined in the budget."
    },
    {
        "url": "https://www.cbc.ca/lite/story/1.7101507",
        "title": "Trump&#39;s legal bills appear to be piling up for donors, according to <b>election</b> expenses report",
        "description": "Republican presidential candidate Donald Trump&#39;s fundraising slowed in the last three months of 2023 and his legal fees appeared to drag on the finances behind his election effort, according to fresh disclosures submitted to the Federal Election Commission (FEC)."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/women-support-abortion-rights-trump-focus-group-rcna136546",
        "title": "These women support abortion rights. They’re still voting Trump.",
        "description": "Focus groups illustrate how a set of female Pennsylvania voters who backed Trump in 2020 are weighing abortion and other issues in their 2024 choice."
    },
    {
        "url": "https://nypost.com/2024/02/01/news/da-fani-willis-nathan-wade-should-step-down-from-trump-case-expert/",
        "title": "DA Fani Willis, prosecutor Nathan Wade should step down from <b>election</b> fraud case: expert",
        "description": "District Attorney Fani Willis and the lead prosecutor on the election fraud case should both step down over allegations they had an affair, an expert said."
    },
    {
        "url": "https://www.livemint.com/opinion/columns/budget-2024-where-are-the-good-jobs-wages-aren-t-working-for-women-11706820702733.html",
        "title": "Budget 2024: Where are the ‘good jobs’? Wages aren’t working for women",
        "description": "The uptick in overall labour force participation is largely driven by an increase in rural female labour force participation."
    },
    {
        "url": "https://news.yahoo.com/former-city-council-member-atlantic-202429921.html",
        "title": "Former city council member in Atlantic city charged with mail-in ballot fraud",
        "description": "He was arrested Thursday for his role in procuring, casting and tabulating fraudulent mail-in ballots submitted in the Nov. 8, 2022 general election."
    },
    {
        "url": "https://www.politico.com/newsletters/digital-future-daily/2024/02/01/ceos-want-to-avoid-a-big-embarrassing-ai-hearing-00139145",
        "title": "CEOs want to avoid a big, embarrassing AI hearing",
        "description": "One reason companies might avoid that fate in the dawning AI era is that there’s already a clear-eyed (many even say excessive) view of the technology’s potential harms, from nonconsensual sexually explicit images to bias and discrimination to, uh, robots developing sentience and killing everybody."
    },
    {
        "url": "https://nypost.com/2024/02/01/news/trump-leads-haley-by-26-in-south-carolina-weeks-before-primary-poll/",
        "title": "Trump leads Nikki Haley by 26% in South Carolina just weeks before primary, new poll reveals",
        "description": "The Washington Post/ Monmouth University poll shows 58% of South Carolina voters support Trump, compared to 32% for Haley."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-02/tas-rockliff-stateline-analysis-early-election-trigger/103413270",
        "title": "Tasmanian Premier Jeremy Rockliff calls for independents to be a little less independent or we have an early <b>election</b>",
        "description": "Speaking to Stateline, Premier Jeremy Rockliff is unequivocal: if Tasmania goes to an early election, it&#39;ll be the fault of independents John Tucker and Lara Alexander, writes Adam Langenberg."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/01/more-than-120000-votes-cast-so-far-in-nevada-presidential-primary/72440949007/",
        "title": "More than 120,000 votes cast so far in Nevada Presidential Preference Primary",
        "description": "Democrats account for about 61% of early votes cast in Nevada&#39;s Presidential Preference Primary. PPP Election Day is Feb. 6. The GOP caucus is Feb. 8."
    },
    {
        "url": "https://www.yahoo.com/entertainment/race-no-2-adam-schiff-195110190.html",
        "title": "The Race For No. 2: Adam Schiff’s Campaign Singles Out Republican Steve Garvey — And Not Democratic Rivals — In His Latest Ad",
        "description": "Adam Schiff’s Senate campaign announced a multimillion dollar, statewide ad buy for a spot that is most notable for who it singles out: Steve Garvey, the former Dodger great who is running as the highest profile Republican in a Democratic-dominated state."
    },
    {
        "url": "https://news.yahoo.com/schiffs-latest-ad-boosts-republican-194547250.html",
        "title": "Schiff&#39;s latest ad boosts Republican Senate rival Steve Garvey. Rep. Katie Porter hates it",
        "description": "Days before Californians will be mailed ballots, Rep. Adam B. Schiff&#39;s latest ad acts as if Rep. Katie Porter doesn&#39;t exist."
    },
    {
        "url": "https://abcnews.go.com/International/wireStory/guatemalas-new-president-societys-face-opposition-entrenched-powers-106874918",
        "title": "Guatemala&#39;s new president to ask for society&#39;s help in face of opposition from entrenched powers",
        "description": "Guatemalan President Bernardo Arévalo says that with his political party suspended, little support in congress and an attorney general in hot pursuit, he will appeal to the country&#39;s people to help him overcome the entrenched old guard and achieve the"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13032699/We-death-threats-Commons-Speaker-vows-step-protections-MPs-Tory-minister-Mike-Freer-announces-hes-quitting-safety-fears-Labour-figures-slammed-celebrating-exit.html",
        "title": "&#39;We ALL get death threats&#39;: Commons Speaker vows to step up protections for MPs after Tory minister Mike Freer announces he&#39;s quitting over safety fears... but Labour figures ...",
        "description": "Sir Lindsay Hoyle said he was &#39;really saddened&#39; by Mike Freer&#39;s announcement he will stand down at the next general election following an arson attack on his office."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labours-rachel-reeves-vows-cap-32018632",
        "title": "Labour&#39;s Rachel Reeves vows to cap corporation tax for five years after Tory U-turns chaos",
        "description": "The Shadow Chancellor Rachel Reeves said the current 25% rate of corporation tax will not change for the first term of a Labour Government as she addressed business leaders"
    },
    {
        "url": "https://www.thesun.co.uk/news/25649952/jeremy-hunt-plays-down-tax-cuts-at-budget/",
        "title": "Jeremy Hunt risks major backlash by playing down hopes of Spring Budget 2024 tax cuts",
        "description": "JEREMY Hunt today insisted he wants to “lighten the tax burden” – but played down expectations of mega cuts. Ahead of the Spring Budget next month, Mr Hunt hinted that Treasury"
    },
    {
        "url": "https://www.bbc.com/news/world-asia-india-68151023.amp",
        "title": "India Budget 2024: PM Modi shuns big spending in pre-<b>election</b> budget",
        "description": "High public spending is expected to help keep India&#39;s GDP growth at about 7%. The rapid expansion has allowed the government to collect higher taxes, and curb its fiscal deficit - the gap between what it earns and spends - by half a percent to 5.1% this year."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-london-68163968",
        "title": "Mike Freer: North London MP to step down over safety fears",
        "description": "Mike Freer, a justice minister and also north London MP, said he avoided being murdered &quot;by the skin of my teeth&quot; by Ali Harbi Ali, who went on to kill Southend West MP Sir David Amess. Mr Freer has represented Finchley and Golders Green since 2010. He said he could no longer put his family through the worry of his safety."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/fake-newspapers-political-parties-election-2024-uk-editors/",
        "title": "Stop using ‘absurd’ fake newspapers, political parties told",
        "description": "The Society of Editors has vowed to name and shame political parties using “absurd” fake local newspapers as campaign material."
    },
    {
        "url": "https://www.ft.com/content/7c3c5827-c965-453c-8bd1-d1312e90669a",
        "title": "Imran Khan taps AI and TikTok to fight Pakistan <b>election</b> from jail",
        "description": "Barred from next week’s vote, former prime minister is using chatbots and social media to energise his party’s supporters"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24089158.two-thirds-voters-want-change-government-election-major-poll-suggests/",
        "title": "Two-thirds of voters want change of government at <b>election</b>, major poll suggests",
        "description": "According to Best for Britain’s analysis of the new poll, 56% of those who do not know how they will vote want to see a new government, suggesting that potentially two million voters who seek change are unsure how to cast their ballot to achieve it."
    }
]