[
    {
        "url": "https://www.unison.org.uk/news/2024/02/prospective-mps-urged-to-back-new-national-care-service/",
        "title": "Prospective MPs urged to back new national care service",
        "description": "A national care service would mean the quality of care is of the same high standard, no matter where in the country it was being provided."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/sunak-touts-gigabit-broadband-rollout-000100659.html",
        "title": "Sunak touts gigabit broadband rollout on ‘levelling up tour’ of North Wales",
        "description": "As he gears up for the <b>general election</b> and his party languishes in the polls, Mr Sunak frequently attacks the performance of what he calls “Labour-run Wales”. On Wednesday, he warned that the Welsh Government’s new farm subsidy scheme would ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/adi-marsiela-q-ibt-1723484",
        "title": "Adi Marsiela Q&amp;A IBT",
        "description": "We had a chance to sit down with Adi Marsiela, coordinator at CekFakt for a conversation about disinformation, the upcoming Indonesian elections and expected challenges."
    },
    {
        "url": "https://www.standard.co.uk/business/ftse-100-live-public-borrowing-hsbc-london-stock-exchange-shares-interest-rates-prices-bae-rio-tinto-b1140468.html",
        "title": "FTSE 100 Live 21 February: &#39;Blowout&#39; Nvdia results, blue-chips close down 0.7%, record budget surplus",
        "description": "London’s FTSE 100 Index is sharply lower today after a negative reaction to results by heavyweights HSBC, Glencore and BAE Systems."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110955/jeremy-hunt-plans-inheritance-tax-spring-budget-tight-public-finances.html",
        "title": "Jeremy Hunt shelves plans to cut inheritance tax again ahead of his Spring Budget due to tight public finances",
        "description": "In a blow to Tory MPs campaigning on the issue, the Chancellor has concluded tight public finances leave him unable to make meaningful changes to the tax."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?page=with:block-65d66e898f088e120023e72b",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – UK politics live",
        "description": "Labour amendment calling for immediate Gaza ceasefire passes after government and SNP walkout"
    },
    {
        "url": "https://www.ft.com/content/ac89b09b-6fd0-43e4-b7ff-7e147801e73a",
        "title": "Badenoch rows highlight combative style of Tory leadership prospect",
        "description": "Stance as ‘anti-woke, black woman’ seen as making her popular with predominantly white, older party membership."
    },
    {
        "url": "https://news.sky.com/story/politics-live-defence-secretary-to-make-commons-statement-after-failed-nuclear-deterrent-launch-12593360?postid=7266151",
        "title": "Politics latest: Motion of no confidence in Speaker after Gaza debate descends into chaos",
        "description": "And Beth warned that this sort of political game-playing will continue as the <b>general election</b> approaches. Few days in Westminster are quite so dramatic. It started with the prospect of Labour being embarrassed by the SNP over its Gaza and green energy ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68354552",
        "title": "Kettering Lib Dem candidate steps down over stammer abuse",
        "description": "Mr Nelson was first selected as the Lib Dem candidate for Kettering in 2010. He later ran again in the 2019 election, both times finishing in the top three candidates, reported the Local Democracy Reporting Service. He said the &quot;final straw&quot; had come in August when a politician mocked his stammer in the street."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/post-office-cameron-government-horizon-prime-minister-b2499921.html",
        "title": "PM ignores calls to repeat ‘lying’ allegation aimed at ex-Post Office chairman",
        "description": "Labour leader Sir Keir Starmer called for an investigation into claims the Government wanted to stall Horizon compensation payments."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fox-news-townhall-south-carolina-latest-b2499726.html",
        "title": "Trump threatened by New York AG over payment of civil fraud fine: Live",
        "description": "Letitia James issues warning to Republican after he struggles with questions on Navalny, illegal immigration and classified documents at Fox town hall in South Carolina"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68357074.amp",
        "title": "Sarah Munby: Top civil servant hits out in Post Office compensation row",
        "description": "Henry Staunton, who was sacked last month, said the comment was made by a senior civil servant during a meeting last year. It comes amid an escalating row over his previous claim he was told to delay Horizon compensation payments for sub-postmasters. This has been rejected by ministers."
    },
    {
        "url": "https://www.heraldscotland.com/news/24135732.analysis-gaza-ceasefire-scrap-politics-worst/",
        "title": "Analysis: Gaza ceasefire scrap is politics at its worst",
        "description": "How did it come to this? Point scoring between the SNP and Labour is being played out by politicising a harrowing and deadly conflict in the"
    },
    {
        "url": "https://www.walesonline.co.uk/news/world-news/mps-call-immediate-ceasefire-gaza-28679740",
        "title": "MPs call for &#39;immediate ceasefire in Gaza&#39; as chaos spills over in Commons",
        "description": "There were calls for the Speaker of the House Sir Lindsay Hoyle to resign and on whether the House of Commons should sit in private."
    },
    {
        "url": "https://www.scotsman.com/news/politics/chaotic-scenes-in-house-of-commons-as-speaker-embroiled-in-gaza-vote-row-4528424",
        "title": "Chaotic scenes in House of Commons as Speaker embroiled in Gaza vote row",
        "description": "Shouts of “resign” could be heard from both sides of the House. If the government has “lost control” of foreign policy it would warrant an immediate <b>general election</b>, Labour MP Sir Chris Bryant (Rhondda) has said. “There are perfectly legitimate ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/mps-back-calls-for-immediate-gaza-ceasefire-on-day-of-commons-chaos_uk_65d62491e4b0cc1f2f7a60da",
        "title": "MPs Back Calls For &#39;Immediate&#39; Gaza Ceasefire On Day Of Commons Chaos",
        "description": "Meanwhile, Labour was forced to deny claims that senior party figures had warned Hoyle that he would be removed as Speaker after the <b>general election</b> unless he chose their amendment. A Labour spokesperson told HuffPost UK: “It’s complete rubbish."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/tories-vote-down-labour-snp-32181075",
        "title": "Tories vote down Labour and SNP calls for Gaza ceasefire in Commons",
        "description": "Labour denied reports that it had threatened Hoyle that it would vote him out as speaker after the <b>general election</b> if he did not allow their amendment. There were also reports that the Tories and SNP were planning to work together to oust Hoyle as speaker."
    },
    {
        "url": "https://uk.news.yahoo.com/most-voters-biden-trump-both-225000542.html",
        "title": "Most voters say Biden, Trump both mentally unfit for 2nd term, poll finds",
        "description": "American voters are broadly skeptical that President Joe Biden is mentally fit to serve a second term, and most do not think his potential <b>general election</b> rival Donald Trump is mentally fit either, according to a Quinnipiac University poll published ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/polling/2024/02/george-galloway-rochdale-by-election",
        "title": "When the lights went out",
        "description": "In the annals of political history, Rochdale isn’t far off earning the epithet “cursed”. Once the seat of child abuser Cyril Smith, the current by-election, caused by the sad death of Labour MP Tony Lloyd, has seen candidates and parties left, right and centre humiliated. (See Anoosh’s report from the seat in this week’s NS .)"
    },
    {
        "url": "https://www.modernghana.com/news/1294239/2024-elections-the-suffering-in-ghana-indicates.html",
        "title": "2024 <b>elections</b>: &#39;The suffering in Ghana indicates It&#39;s a must-win for NDC; don&#39;t screw this up&#39; — Yaw Boateng Gyan to Mahama",
        "description": "Yaw Boateng Gyan, former National Organizer of the National Democratic Congress (NDC), has emphasized the importance of the 2024 <b>general</b> <b>elections</b> for the party, urging former President John Dramani Mahama not to let the opportunity slip. Speaking on Okay ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-bristol-68342446.amp",
        "title": "Labour&#39;s Damien Egan says West Country accent helped Kingswood win",
        "description": "In July 2023 he was selected as Labour&#39;s candidate for Bristol North East, a new seat being created for the next <b>general election</b>. So it was a shock when, on holiday at the start of January, he was told Kingswood&#39;s Conservative MP was standing down - and ..."
    },
    {
        "url": "https://www.latimes.com/politics/story/2024-02-21/biden-culver-city-student-debt-forgiveness",
        "title": "Biden, at Culver City stop, announces $1.2 billion in student debt forgiveness",
        "description": "The student debt announcement was Biden&#39;s final event during a two-day swing in the Los Angeles area. He headlined a major fundraiser the previous night."
    },
    {
        "url": "https://www.yahoo.com/news/most-voters-biden-trump-both-225000542.html",
        "title": "Most voters say Biden, Trump both mentally unfit for 2nd term, poll finds",
        "description": "American voters are broadly skeptical that President Joe Biden is mentally fit to serve a second term, and most do not think his potential general election rival Donald Trump is mentally fit either, according to a Quinnipiac University poll published Wednesday."
    },
    {
        "url": "https://news.yahoo.com/presidential-race-good-versus-evil-223123608.html",
        "title": "The presidential race ‘is good versus evil’ says Lara Trump during Beaufort campaign rally",
        "description": "The former president’s daughter in law visited the a local VFW. Donald Trump faces Nikki Haley in Saturday’s SC primary"
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/pennsylvanias-high-court-throws-gop-lawmakers-subpoena-2020-107428953",
        "title": "Pennsylvania&#39;s high court throws out GOP lawmakers&#39; subpoena in 2020 presidential <b>election</b> case",
        "description": "Pennsylvania’s highest court is ruling that Republican state lawmakers can no longer try to enforce a subpoena for election records that they issued in 2021"
    },
    {
        "url": "https://www.nbcnews.com/politics/joe-biden/biden-touts-new-student-debt-relief-giving-people-chance-succeed-rcna139591",
        "title": "Biden touts his new student debt relief as &#39;giving people a chance&#39; to succeed",
        "description": "Speaking in Los Angeles County, the president announced his latest tranche of student debt forgiveness, affecting an estimated 153,000 borrowers."
    },
    {
        "url": "https://www.usnews.com/news/politics/articles/2024-02-21/how-is-an-ex-fbi-informant-charged-with-lying-about-bidens-allegedly-linked-to-russian-intelligence",
        "title": "How Is an Ex-FBI Informant Charged With Lying About Bidens Allegedly Linked to Russian Intelligence?",
        "description": "Federal prosecutors say the explosive allegations at the center of an impeachment inquiry into President Joe Biden were false and came from an ex-FBI informant who said he was in touch with Russian in"
    },
    {
        "url": "https://www.washingtonpost.com/washington-post-live/2024/02/21/transcript-world-stage-with-robert-m-gates/",
        "title": "Transcript: World Stage with Robert M. Gates",
        "description": "Today, I&#39;m pleased to be joined by former Defense Secretary Bob Gates. He served in that position under both President Bush 43 and President Obama. In that sense, he symbolizes what used to be a tradition of bipartisan foreign policy in the country."
    },
    {
        "url": "https://abcnews.go.com/538/2024-predictor-polls-special-elections/story?id=107369614",
        "title": "Which is the better 2024 predictor: polls or special <b>elections</b>?",
        "description": "Democrats have had successes in special elections and Republicans are leading in many polls. But the two metrics aren&#39;t as far apart as they may seem."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/21/sir-lindsay-hoyle-speaker-gaza-motion-commons",
        "title": "Sir Lindsay Hoyle vowed to restore calm but now faces Brexit-like chaos",
        "description": "Questions about speaker’s future after he causes uproar by breaking convention over Gaza motion"
    },
    {
        "url": "https://www.nytimes.com/2024/02/21/us/politics/haley-trump-race.html",
        "title": "Why Nikki Haley Isn’t Dropping Out",
        "description": "She dismissed speculation about her motives behind staying in the race, and has encouraged supporters to stick with her until the end, whenever that may be."
    },
    {
        "url": "https://www.nbcnews.com/politics/black-voters-biden-nikki-haley-tall-task-politics-desk-rcna139632",
        "title": "Inside a quiet effort to drive Black voters from Biden: From the Politics Desk",
        "description": "This is the digital version of From the Politics Desk, a daily newsletter covering the biggest stories in politics. Today&#39;s top story is from Ben Kamisar, plus analysis from Steve Kornacki. President Joe Biden could be facing a turnout problem in 2024."
    },
    {
        "url": "https://www.cbsnews.com/news/trump-gop-lag-biden-democrats-fundraising-january-2024/",
        "title": "Trump, GOP lag Biden and Democrats in fundraising as campaigns look to <b>general election</b>",
        "description": "Trump&#39;s political apparatus continued to spend more than it raised, according to campaign finance reports filed for January."
    },
    {
        "url": "https://www.foxnews.com/politics/biden-campaign-trolls-trump-weakest-operation-history-lagging-campaign-cash",
        "title": "Biden campaign trolls Trump&#39;s &#39;weakest operation in ... history&#39; amid lagging campaign cash",
        "description": "The Biden campaign is trolling former President Donald Trump by touting its cash-on-hand advantage as the latter pays millions toward his legal defense."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/21/adam-schiff-katie-porter-california-senate-debate/72686688007/",
        "title": "At risk of slipping behind, Katie Porter lashes out in final Senate debate",
        "description": "Republican Steve Garvey is surpassing Democratic Rep. Katie Porter in new poll, and all four candidates make last-ditch appeal to Latino voters"
    },
    {
        "url": "https://www.yahoo.com/news/charter-review-committee-votes-city-171313633.html",
        "title": "Charter Review Committee votes up on city commission raises, down on adding more commissioners",
        "description": "After weeks of debate, the city’s Charter Review Committee voted against expanding the size of the five-person City Commission but agreed that commissioners should be paid more money."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13108261/Ex-Post-Office-chair-reveals-bombshell-memo-meet-mandarin-told-delay-compensation-postmasters-Government-hobble-election.html",
        "title": "Ex-Post Office chair reveals bombshell memo of meeting where top mandarin &#39;told him to delay compensation for postmasters so Government could &#39;hobble&#39; into <b>election</b>&#39;",
        "description": "Henry Staunton, who was Post Office chairman between December 2022 and last month, revealed how he was told not to &#39;rip off the band aid&#39; in terms of finances by a top civil servant."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/congress-and-samajwadi-party-announce-seat-sharing-pact-for-lok-sabha-elections-in-uttar-pradesh/articleshow/107890836.cms",
        "title": "Congress-SP finalise UP seat-sharing pact: How Priyanka Gandhi played a key role in breaking the deadlock",
        "description": "In a crucial breakthrough, the Congress and the Samajwadi Party have finally announced a seat-sharing pact for the Lok Sabha elections in Uttar Pradesh. Read more to know the details."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/what-to-expect-in-the-south-carolina-republican-primary-between-trump-and-haley",
        "title": "What to expect in the South Carolina Republican primary between Trump and Haley",
        "description": "It&#39;s Donald Trump and Nikki Haley&#39;s first head-to-head matchup since the New Hampshire primary a month ago. The contest takes place on Haley’s home turf."
    },
    {
        "url": "https://finance.yahoo.com/news/nnit-notice-convening-annual-general-151100967.html",
        "title": "NNIT A/S: Notice convening the annual <b>general</b> meeting for NNIT A/S",
        "description": "The Board of Directors gives notice of the annual general meeting for NNIT A/S, company registration (CVR) no. 21 09 31 06 (the “Company”), to be held Thursday, March 14, 2024, 2:00 pm (CET) at NNIT A/S,"
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/21/trump-legal-bills-debt-campaign-fundraising-shortfalls/9c7bf614-d0fd-11ee-ac8b-765284b5203e_story.html",
        "title": "Trump faces warning signs that his fundraising prowess may have limits in 2024 campaign",
        "description": "Donald Trump’s mythic ability to raise massive sums of political cash may be on a collision course with a new reality"
    },
    {
        "url": "https://www.pbs.org/newshour/politics/as-2024-election-picks-up-biden-campaign-signals-a-more-aggressive-challenge-to-the-press",
        "title": "As 2024 <b>election</b> picks up, Biden campaign signals a more aggressive challenge to the press",
        "description": "Within the past two weeks, an administration aide sent an unusual letter to White House correspondents complaining about their coverage of a special counsel&#39;s report on Biden&#39;s handling of classified documents."
    },
    {
        "url": "https://www.bbc.com/news/world-africa-68358900",
        "title": "South Africa budget boosts welfare grants ahead of May <b>election</b>",
        "description": "South Africa&#39;s finance minister has boosted welfare payments to more than 18 million people in his last budget ahead of May&#39;s general election. The governing African National Congress (ANC) is facing a tough political challenge as it battles to maintain its outright majority in the 29 May poll."
    },
    {
        "url": "https://www.cnbc.com/2024/02/21/ukraine-war-live-updates-latest-news-on-russia-and-the-war-in-ukraine.html",
        "title": "Ukraine war live updates: Zelenskyy calls for &#39;unity&#39; after Polish farmers block border; Russian military chief visits Ukraine",
        "description": "Russia&#39;s military chief has visited troops in eastern Ukraine as Moscow continues to relish — and heavily promote — its recent capture of Avdiivka."
    },
    {
        "url": "https://www.politico.com/newsletters/california-playbook/2024/02/21/katie-porters-late-inning-pitch-00142375",
        "title": "Katie Porter’s late-inning pitch",
        "description": "THE BUZZ: SENATE STAGE — Rep. Katie Porter made one of her final pleas to voters last night — going hard after fellow Democratic Rep. Adam Schiff in the last debate before Californians finish casting their primary ballots on March 5."
    },
    {
        "url": "https://www.foxnews.com/politics/trump-leadership-pac-spends-nearly-3m-january-legal-expenses-fec-filing-shows",
        "title": "Trump leadership PAC spends nearly $3M in January on legal expenses, FEC filing shows",
        "description": "Former President Trump&#39;s leadership PAC, Save American, spent another $2.9 million on legal expenses last month, as Trump&#39;s cash holdings drop."
    },
    {
        "url": "https://finance.yahoo.com/news/sidechannel-announces-board-directors-appointments-120000123.html",
        "title": "SideChannel Announces New Board of Directors Appointments and Re-<b>Election</b> of Chairwoman",
        "description": "WORCESTER, MA / ACCESSWIRE / / SideChannel, Inc. (OTCQB:SDCH) (&quot;SideChannel&quot; or the &quot;Company&quot;), a leading provider of cybersecurity services and technology to emerging and middle market companies, is delighted to announce the appointment"
    },
    {
        "url": "https://www.thetimes.co.uk/article/pakistan-coalition-imran-khan-shehbaz-sharif-prime-minister-8n22nhb3w",
        "title": "Pakistan coalition keeps Imran Khan out of government",
        "description": "Dynastic political parties announce a power-sharing agreement, with Shehbaz Sharif put forward as prime minister"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/21/marine-le-pen-not-learnt-lesson-brexit-claim-michel-barnier/",
        "title": "Marine Le Pen has not ‘learnt lessons’ of Brexit, claims Michel Barnier",
        "description": "Former Brexit negotiatior says the UK&#39;s EU departure has made trade with Europe, and economic growth, more difficult"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/21/post-office-boss-note-stall-horizon-compensation/",
        "title": "Ex-Post Office boss &#39;was told to stall on finances&#39; in unearthed memo",
        "description": "Henry Staunton was allegedly told by civil servant not to &#39;rip the band-aid off&#39; in row over Horizon compensation"
    },
    {
        "url": "https://news.yahoo.com/heres-whos-moving-general-election-110349599.html",
        "title": "Here&#39;s who&#39;s moving on to the <b>general election</b> after Tuesday&#39;s primary in Winnebago County",
        "description": "Omro incumbent mayor Steve Jungwirth is among the candidates in Winnebago County to advance from Tuesday&#39;s primary."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/21/no-labels-gains-ballot-access-in-nc-but-no-primary-candidate/72427292007/",
        "title": "Confused about No Labels in North Carolina? We&#39;ve got answers.",
        "description": "After No Labels became an option for NC voters, confusion stirred. Who are they? What will your ballot look like? Here are the answers."
    },
    {
        "url": "https://www.latimes.com/politics/story/2024-02-21/march-5-primary-election-california-senate-debate-candidates-schiff-porter-lee-garvey",
        "title": "In final primary debate, Senate candidates spar over Israel, immigration and campaign donations",
        "description": "The top four candidates vying to represent California in the U.S. Senate squared off Tuesday for the final debate before the March 5 primary."
    },
    {
        "url": "https://edition.cnn.com/2024/02/21/politics/campaign-finance-takeaways-january/",
        "title": "Biden and Democrats build cash edge over Trump and GOP, plus other campaign finance takeaways",
        "description": "President Joe Biden’s political operation has expanded its financial advantage over Donald Trump’s campaign as the two men hurtle toward an expected general election confrontation, new filings show."
    },
    {
        "url": "https://www.marketwatch.com/story/heres-trumps-shortlist-for-vice-president-which-includes-ron-desantis-83e3ff2a",
        "title": "Here’s Trump’s shortlist for vice president, which includes Ron DeSantis",
        "description": "Former President Donald Trump acknowledged Tuesday that at least five high-profile Republicans and one former Democrat are on his shortlist for"
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/rest-of-world/south-korea-emergency-units-turn-back-patients-as-doctors-protest/articleshow/107881761.cms",
        "title": "South Korea emergency units turn back patients as doctors protest",
        "description": "South Korea&#39;s hospitals cancelled procedures as trainee doctors protested a government plan to boost medical school admissions. Emergency care was aff"
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68346802",
        "title": "Government finances show big surplus in January",
        "description": "The government finances showed a large surplus last month, more than double the surplus last January. The surplus - the difference between spending and tax income - rose to £16.7bn in January, the Office for National Statistics (ONS) said. These are the last set of public finance figures to be released before the Chancellor&#39;s Budget in March."
    }
]