[
    {
        "url": "https://timesofindia.indiatimes.com/india/supreme-court-wont-interfere-in-ec-work-on-voter-lists/articleshow/107639670.cms",
        "title": "Supreme Court: Won&#39;t interfere in EC work on voter lists",
        "description": "India News: upreme Court on Monday expressed full satisfaction with the work being done by Election Commission in preparing the final voter list for the coming ge"
    },
    {
        "url": "https://www.ft.com/content/0e365a05-e87e-4cd1-a2b9-09e843e9403a",
        "title": "From banned <b>general</b> to dancing grandpa: how Prabowo became favourite to lead Indonesia",
        "description": "Support from popular president Joko Widodo has lifted the 72-year-old once barred from the US over human rights concerns"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/12/trump-election-interference-case-stay-delay",
        "title": "Trump asks US supreme court to keep <b>election</b> interference case frozen",
        "description": "Ex-president met deadline imposed by federal appeals case to keep the criminal case on hold as he prepares a last-ditch challenge"
    },
    {
        "url": "https://edition.cnn.com/2024/02/12/politics/us-out-nato-second-trump-term-former-senior-adviser/index.html",
        "title": "Trump will pull US out of NATO if he wins <b>election</b>, ex-adviser warns",
        "description": "As US allies reel from Donald Trump’s weekend comments encouraging Russia to attack European allies if they don’t meet NATO budget contribution goals, multiple former Trump advisers warn in my upcoming book that the former president will seek to formally withdraw the US from the NATO alliance if he wins a second term."
    },
    {
        "url": "https://www.bbc.com/pidgin/articles/cldq9vxk4ndo",
        "title": "&#39;We feel betrayed&#39; - why pipo dey para for Senegal",
        "description": "Senegal be like who dey pass through identity crisis - di citizens dey proud of di fact say di kontri dey seen as one of di most stable democracies for West Africa but dem dey vex say dis reputation fit spoil."
    },
    {
        "url": "https://www.independent.co.uk/politics/labour-party-rochdale-azhir-ali-candidate-b2494995.html",
        "title": "Labour withdraws support for Rochdale by-<b>election</b> candidate Azhar Ali after antisemitism row",
        "description": "Labour has withdrawn its support for Rochdale by-election candidate Azhar Ali, following criticism of remarks he made about Israel. Mr Ali had apologised after he was recorded suggesting in a meeting of the Lancashire Labour Party that Israel had taken the October 7 Hamas assault as a pretext to invade Gaza."
    },
    {
        "url": "https://inews.co.uk/news/politics/unlikely-lord-cameron-pm-again-tory-plots-oust-sunak-2902018?ico=most_popular",
        "title": "Why it’s unlikely Lord Cameron would become PM again despite Tory plots to oust Sunak",
        "description": "One MP told i the Foreign Secretary has been floated by some Tory plotters as a potential &#39;unity candidate&#39; to lead the party into the general election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/conservatives-labour-party-countryside-seats-election/",
        "title": "Tories ‘could lose more than half of England’s 100 most rural seats’",
        "description": "The Conservatives could lose more than half of the 100 most rural seats in England at the election, according to a poll that has dealt another blow to Rishi Sunak. The Survation survey showed that Labour holds a lead in the polls in the seats, which have traditionally formed Conservative heartlands."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/rishi-sunak-latest-news-labour-rochdale-elections-rwanda/",
        "title": "Politics latest news: Tories need &#39;best campaigners&#39; like Boris Johnson at <b>election</b>, says minister",
        "description": "The Labour Party now holds a poll lead over the Tories in England’s 100 most rural constituencies in a fresh blow for Rishi Sunak. A Survation survey put Labour on 37 per cent of the vote in the traditionally Tory heartlands with the Conservatives now three points behind on 34 per cent."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13074281/Tracey-Crouch-joins-Tory-exodus-former-sports-minister-announces-quit-Commons-general-election-breast-cancer-battle-caused-pause-reflect-seek-new-challenge.html",
        "title": "Tracey Crouch joins the Tory exodus as former sports minister announces she will quit the Commons at the <b>general election</b> after breast cancer battle caused her to &#39;pause and ...",
        "description": "The Chatham and Aylesford MP revealed she will not compete again for her Kent constituency when voters go to the polls later this year."
    },
    {
        "url": "https://www.thetimes.co.uk/article/will-labour-win-next-general-election-2024-keir-starmer-bf7s6qbdq",
        "title": "Will Labour win the <b>general election</b>? The challenges Keir Starmer faces",
        "description": "Their biggest strength is not being the Tories or led by Rishi Sunak — but can the superiority Labour enjoys be sustained over months of scrutiny?"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hbgp1t",
        "title": "Who will govern Pakistan",
        "description": "With most of the results now declared in Pakistan&#39;s general election, no political force has a clear majority, as two former PMs are claiming they have the votes to govern. Kate Adie presents stories from Pakistan, Syria, Gaza, Trinidad and Tobago and Ivory Coast."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13073645/Democrats-panic-doddery-Biden-dump-stop-Trump.html",
        "title": "Why Joe Biden may be clinging to power so he can install Michelle Obama as his replacement: Democrats are panicking over the increasingly doddery 81-year-old President. But he ...",
        "description": "Left-wing newspapers have been full of doom-laden pieces about Joe Biden&#39;s age and election prospects and how he must let another candidate with a better chance stand against Donald Trump."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tracey-crouch-mp-quit-tory-party-b2494807.html",
        "title": "Former sports minister becomes latest Tory MP to quit",
        "description": "Tracey Crouch said she would pursue ‘a new professional challenge’, and that her reasons for not standing were ‘entirely personal and positive’"
    },
    {
        "url": "https://edition.cnn.com/2024/02/12/politics/trump-biden-election-2024/index.html",
        "title": "The 2024 campaign gets grimmer, with Trump’s extremism on full display alongside concerns over Biden’s age",
        "description": "The events of recent days have shown just how grim the likely choice between President Joe Biden and former President Donald Trump may appear to many voters."
    },
    {
        "url": "https://www.ft.com/content/1e3e0e40-57fe-4da2-b792-95efddbbf1ac",
        "title": "Live news: Diamondback Energy to buy Endeavor in $26bn deal",
        "description": "Diamondback Energy has announced the $26bn acquisition of Endeavor Energy Resources, one of America’s most sought-after private oil producers. Diamondback has agreed to offer 117mn of its shares and $8bn of cash for Endeavor,"
    },
    {
        "url": "https://www.historytoday.com/archive/history-matters/end-britains-weeks-long-general-elections",
        "title": "The End of Britain’s Weeks-Long <b>General</b> <b>Elections</b>",
        "description": "General elections in Britain were once weeks-long affairs of corruption and chaos. The shift to one-day polling was slow."
    },
    {
        "url": "https://www.fool.co.uk/2024/02/12/history-suggests-the-stock-market-will-do-this-after-the-next-uk-general-election-in-2024/",
        "title": "History suggests the stock market will do this after the next UK <b>general election</b> in 2024",
        "description": "What might happen to the stock market after the next general election? Ben McPoland takes a look and highlights one FTSE 100 share he&#39;d buy regardless."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/lib-dems-announce-worthing-general-election-candidates-4514059",
        "title": "Lib Dems announce Worthing <b>general election</b> candidates",
        "description": "The party has selected Morag Chugg, a youth support worker, to contest Worthing West. David Batchelor, a chartered surveyor from Shoreham, will contest East Worthing &amp; Shoreham. The seats are currently held by Conservatives Sir Peter Bottomley and Tim Loughton respectively."
    },
    {
        "url": "https://www.huffpost.com/entry/robert-f-kennedy-jr-super-bowl-ad_n_65c9f9f6e4b067c6b73da056",
        "title": "Robert F. Kennedy Jr. Apologizes For Controversial $7 Million Super Bowl Ad",
        "description": "The independent candidate told his family he was sorry after the campaign spot, produced by a super PAC, aired during the game."
    },
    {
        "url": "https://news.yahoo.com/presidential-knox-county-primary-elections-211022412.html",
        "title": "Presidential and Knox County primary <b>elections</b> are coming in March. Here&#39;s what to know",
        "description": "Election Day for the presidential partisan primary and county primary election is March 5, but there are plenty of other dates to note, too."
    },
    {
        "url": "https://www.usnews.com/news/world/articles/2024-02-12/uk-labour-party-withdraws-support-for-candidate-after-israel-conspiracy-comments",
        "title": "UK Labour Party Withdraws Support for Candidate After Israel Conspiracy Comments",
        "description": "LONDON (Reuters) - Britain&#39;s opposition Labour Party has withdrawn support for its candidate to become a member of parliament in a special election after he was recorded espousing conspiracy theories about Israel."
    },
    {
        "url": "https://www.forbes.com/sites/alisondurkee/2024/02/12/trump-goes-to-supreme-court-over-jan-6-immunity-fight-heres-what-happens-next/",
        "title": "Trump Goes To Supreme Court Over Jan. 6 Immunity Fight—Here’s What Happens Next",
        "description": "The ex-president had to ask the Supreme Court to weigh in on the case by Monday, or else the case would have started moving forward again."
    },
    {
        "url": "https://thehill.com/homenews/4463356-trump-supreme-court-jan-6-immunity-appeal/",
        "title": "Trump urges Supreme Court to delay Jan. 6 case amid immunity appeal",
        "description": "Former President Trump on Monday urged the Supreme Court to keep his federal election subversion criminal trial on hold as he appeals a ruling that he doesn’t have immunity from the charges."
    },
    {
        "url": "https://abcnews.go.com/538/election-replace-george-santos-competitive/story?id=107158179",
        "title": "Why the <b>election</b> to replace George Santos is so competitive",
        "description": "George Santos in December became just the sixth representative in history to be expelled from Congress. But it&#39;s not the scandal-plagued former congressman that makes the special election to replace him so special;"
    },
    {
        "url": "https://www.politico.com/newsletters/national-security-daily/2024/02/12/the-world-war-iii-election-00140938",
        "title": "The World War III <b>election</b>",
        "description": "We are on the brink of World War III,” Trump said in January following an Iran-backed militia killing three U.S. soldiers in Jordan."
    },
    {
        "url": "https://finance.yahoo.com/news/cummins-elects-john-h-stone-200000139.html",
        "title": "Cummins Elects John H. Stone to its Board of Directors",
        "description": "COLUMBUS, Ind., February 12, 2024 -- ( BUSINESS WIRE )--Today, Cummins Inc. (NYSE: CMI) announced the election of John H. Stone to its Board of Directors."
    },
    {
        "url": "https://www.yahoo.com/news/britain-almost-bankrupt-pm-starmer-193128276.html",
        "title": "Britain is almost bankrupt. PM Starmer will be the final nail in the nation’s coffin",
        "description": "With the Conservatives set to be routed at the next general election, the idea that Britain couldn’t sink any lower than it has under this inept Government is rapidly becoming received wisdom. It’s a tempting attitude."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/long-island-voters-are-embarrassed-george-santos-split-replace-rcna138409?ref=upstract.com",
        "title": "Long Island voters are embarrassed by George Santos and split on who should replace him",
        "description": "Voters in New York&#39;s Third Congressional District will head to the polls for a special election on Tuesday between former Democratic Rep. Tom Suozzi and Republican Mazi Pilip."
    },
    {
        "url": "https://www.nytimes.com/2024/02/12/world/asia/pakistan-election-key-figures.html",
        "title": "Who Are the Major Players After Pakistan’s Stunning <b>Election</b>?",
        "description": "Politicians and the military are jockeying to lead the country after the success of the party of Imran Khan, a jailed former prime minister."
    },
    {
        "url": "https://apnews.com/article/virginia-glenn-youngkin-washington-sports-arena-c1b8fe38718a2560feef6baee7207faf",
        "title": "Top Virginia Senate Democrats deal setback to legislation to relocate Washington Capitals, Wizards",
        "description": "A leading Democratic Virginia legislator says proposed legislation to help pave the way for the NBA’s Washington Wizards and NHL’s Washington Capitals to relocate to northern Virginia is dead."
    },
    {
        "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-immunity-60bd61263299a88e48d4005d70b6094f",
        "title": "Trump faces Monday deadline to ask the Supreme Court for a delay in his <b>election</b> interference trial",
        "description": "The filing would grant a delay on what would be a landmark criminal trial of a former president while the nation’s highest court decides what to do."
    },
    {
        "url": "https://news.yahoo.com/feel-endless-elections-voters-san-181613459.html",
        "title": "It will feel like endless <b>elections</b> this year for some voters in San Joaquin Valley",
        "description": "We may be setting a record for the most elections in a single year. For many in Fresno, Kern, Kings and Tulare counties, it will feel like a civics lesson in electoral law. Four crucial races have no incumbent running, for four different reasons; and they will show up on your ballots in four different ways."
    },
    {
        "url": "https://nypost.com/2024/02/12/news/kamala-harris-insists-shes-ready-to-serve-touts-her-capacity-to-lead/",
        "title": "Kamala Harris insists she’s ‘ready to serve,’ touts her ‘capacity to lead’",
        "description": "Vice President Kamala Harris claimed she is “ready to serve’’ and touted her “capacity to lead” when asked last week about boss Joe Biden’s elderly age and voters’ concerns over"
    },
    {
        "url": "https://thehill.com/opinion/international/4462875-pakistans-election-sends-the-country-into-a-deeper-crisis/",
        "title": "Pakistan’s <b>election</b> sends the country into a deeper crisis",
        "description": "Ironically, although voters may have wanted to rebuke the military elite, the behavior of various political actors, including Imran Khan, might set the stage for continuing the military’s"
    },
    {
        "url": "https://www.cbc.ca/news/politics/auditor-general-report-arrivecan-1.7111043",
        "title": "Total cost of ArriveCan &#39;impossible to determine&#39; due to poor record-keeping, AG report finds",
        "description": "The final cost of the controversial ArriveCan app is impossible to determine due to poor financial record-keeping, a new auditor general report has found."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/can-imran-khan-backed-candidates-form-a-truly-independent-government-in-pakistan/articleshow/107625358.cms",
        "title": "Can Imran Khan-backed candidates form a truly &#39;independent&#39; government in Pakistan?",
        "description": "Against all odds, independent candidates backed by Imran Khan&#39;s Pakistan Tehreek-i-Insaf (PTI) have won around 100 seats in the controversy."
    },
    {
        "url": "https://www.bbc.com/news/world-africa-68253255",
        "title": "Senegal <b>election</b> crisis: &#39;We feel betrayed by President Macky Sall&#39;",
        "description": "&quot;We feel betrayed by Macky Sall,&quot; say a group of imams meeting in a mosque in the capital, Dakar, about the political crisis that hit the country a week ago when MPs backed President Sall&#39;s decision to delay this month&#39;s presidential election until December."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68271462?at_campaign=KARANGA&at_medium=RSS",
        "title": "Pakistan <b>election</b>: What comes next and who will be prime minister?",
        "description": "Pakistanis still do not know which party will form their next government or who their next prime minister will be four days after the hotly-contested general elections. Despite former PM Imran Khan&#39;s detention and the many hurdles thrown at his Pakistan Tehreek-e-Insaf (PTI),"
    },
    {
        "url": "https://www.ft.com/video/37793bc4-f7bd-46c9-953c-3b8317566193?playlist-name=latest&playlist-offset=0",
        "title": "Sketchy Politics: the rules of the electoral race",
        "description": "The FT&#39;s UK chief political commentator Robert Shrimsley and deputy opinion editor Miranda Green discuss how outlying runners in the electoral race could affect the election result, and how the rules"
    }
]