[
    {
        "url": "https://www.cnn.com/2024/01/20/politics/new-hampshire-primary-what-matters/index.html",
        "title": "What to know about New Hampshire’s first-in-the-nation primary",
        "description": "New Hampshire, which has conducted the first presidential primary for more than 100 years, is clinging to its spot on the 2024 election calendar."
    },
    {
        "url": "https://news.yahoo.com/congolese-president-tshisekedi-sworn-second-141952878.html",
        "title": "Congolese President Tshisekedi sworn in for second term after disputed vote",
        "description": "Democratic Republic of Congo President Felix Tshisekedi was sworn in for a second five-year term on Saturday after a landslide victory his opponents have refused to recognise due to widespread irregularities over the December general election."
    },
    {
        "url": "https://news.yahoo.com/former-congressman-pete-hoekstra-elected-183223651.html?ref=upstract.com",
        "title": "Former congressman Pete Hoekstra elected MIGOP chair by anti-Karamo activists",
        "description": "Hoekstra was elected on the second ballot over Lena Epstein and Vance Patrick. Kristina Karamo does not recognize Hoekstra&#39;s election as lawful."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68040611.amp",
        "title": "Pro-Palestinian supporters disrupt speech by David Lammy",
        "description": "The Labour Party will go ahead with its £28bn green investment plan if it wins the next general election, the shadow foreign secretary has insisted. Dismissing suggestions that Labour was trying to row back from the pledge, David Lammy told the BBC the party was &quot;committed to the plan by the second half of the next term&quot;."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/20/felix-tshisekedi-sworn-in-second-term-drc-democratic-republic-congo-president?ref=mc.news",
        "title": "Tshisekedi sworn in for second term as DRC president after disputed poll",
        "description": "Protests break out in two eastern cities as incumbent takes oath of office at stadium"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-boris-tories-labour-poll-election-b2481977.html",
        "title": "Rishi Sunak now more unpopular than Boris Johnson and Jeremy Corbyn",
        "description": "Rishi Sunak is now more unpopular than both Boris Johnson and Jeremy Corbyn at the peak of their unpopularity, a new survey shows. The Conservative PM is struggling to reverse his party’s dire polling fortunes, and his own personal standing with the British public has a hit a new low."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/20/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-hunt-budget-mortgages-deposits-b2481536.html",
        "title": "Sunak considers radical plan for 99% mortgages to help first-time buyers",
        "description": "Exclusive: Treasury discussing bold move to help young Britons onto property ladder with only 1% deposits – but experts warn ‘short-term political fix’ could backfire"
    },
    {
        "url": "https://www.telegraph.co.uk/art/architecture/how-to-fix-parliament-architecture-fobert-levete-asif-khan/",
        "title": "How do you fix a decaying, rat-infested Parliament? These leading architects have a plan",
        "description": "I asked three leading contemporary architects what they believe should be the future of Parliament.  The Houses of Parliament from Millbank by David Roberts, 1861 Credit: wikipedia One school of thought is that the Palace of Westminster should be abandoned altogether,"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68041203",
        "title": "Laura Kuenssberg: Why is Humza Yousaf predicting &#39;inevitable&#39; Keir Starmer victory?",
        "description": "Polls suggest Humza Yousaf is yet to convince the Scottish public he&#39;s an effective leader - could that change?"
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/20/russia-ukraine-war-live-kyiv-accused-of-drone-attack-on-russian-oil-depot-in-klintsy?page=with:block-65abbe768f082472faf43930",
        "title": "Russia-Ukraine war live: Kyiv accused of drone attack on Russian oil depot in Klintsy",
        "description": "Strike on Friday targeted a Rosneft oil storage facility about 50km from the Ukrainian border, in Russian town of Klintsy, officials saidAt a glance: what we know on day 696"
    },
    {
        "url": "https://www.huffpost.com/entry/georgia-election-indictment-wade_n_65ab177ae4b076abd7aba989",
        "title": "Lawyer Hired To Prosecute Trump In Georgia Is Thrust Into The Spotlight Over Affair Claims",
        "description": "Allegations of a romantic relationship between a Georgia district attorney and an outside lawyer she hired has roiled the 2020 election case against Donald Trump."
    },
    {
        "url": "https://edition.cnn.com/2024/01/19/india/india-modi-ayodhya-ram-mandir-explainer-hnk-intl/",
        "title": "A decades long Hindu nationalist dream is about to be achieved. What does this mean?",
        "description": "Ornate gifts have started arriving in the Indian city of Ayodhya as the country’s Prime Minister Narendra Modi prepares to inaugurate a vast Hindu temple that he hopes will firm his chances for a rare third election win in just a few months’ time."
    },
    {
        "url": "https://www.bbc.com/news/world-us-canada-68027344",
        "title": "March for Life: Anti-abortion movement stalls as <b>election</b> year politics loom",
        "description": "Reproductive rights have won every abortion-related ballot measure over the last two years, even in Republican-controlled states. And abortion is thought to have handed Democrats a series of unexpected electoral wins, including the 2022 midterms, the Virginia state elections and the Wisconsin Supreme Court."
    },
    {
        "url": "https://www.politico.com/news/2024/01/20/trumps-feral-close-to-the-new-hampshire-primary-00136707",
        "title": "Trump’s feral close to the New Hampshire primary",
        "description": "By the time he got to New Hampshire, the old Trump had roared back."
    },
    {
        "url": "https://www.nytimes.com/2024/01/20/us/nathan-wade-trump-prosecutor-atlanta.html",
        "title": "How Allegations of an Office Romance Came to Complicate the Case Against Trump",
        "description": "The claims involving Fani Willis and Nathan Wade, the special prosecutor she hired to manage the sprawling case in Georgia, have led to new questions about Mr. Wade’s qualifications."
    },
    {
        "url": "https://www.cnn.com/politics/live-news/election-campaign-new-hampshire-01-20-24/index.html",
        "title": "Final sprint to the New Hampshire primary",
        "description": "GOP candidates Donald Trump, Nikki Haley and Ron DeSantis are making their final appeals to New Hampshire voters with just days until the state&#39;s pivotal 2024 primary contest. Follow here for the latest updates from the campaign trail."
    },
    {
        "url": "https://www.reuters.com/world/africa/congolese-president-tshisekedi-sworn-second-term-2024-01-20/",
        "title": "Congolese President Tshisekedi sworn in for second term",
        "description": "Democratic Republic of Congo&#39;s President Felix Tshisekedi was sworn in for a second five-year term on Saturday after a landslide victory his opponents have refused to recognise due to widespread irregularities in the December general election."
    },
    {
        "url": "https://news.yahoo.com/much-presidential-debates-everyone-except-120136705.html",
        "title": "So much for presidential debates. Everyone (except DeSantis) has given up on them",
        "description": "Opinion: Who wants to hear candidates talk about issues? After a nearly five-decade run, presidential debates might be a thing of the past."
    },
    {
        "url": "https://www.forbes.com/sites/mikeosullivan/2024/01/20/what-will-a-labour-government-in-the-uk-look-like/",
        "title": "What Will A Labour Government In The UK Look Like?",
        "description": "Labour have not given great detail on the policy program, as they wait for the Tories to self-destruct. The election is Labour&#39;s to lose."
    },
    {
        "url": "https://www.yahoo.com/news/trust-labour-uphold-green-investment-110850513.html",
        "title": "Trust Labour to uphold green investment plan, David Lammy says",
        "description": "Mr Lammy told BBC Breakfast that investing in green projects &quot;is the only route for growth for the UK,&quot; adding it would be &quot;borrowing to invest in the jobs of the future&quot;. Speaking to Radio 4&#39;s Today programme, Mr Lammy said it was a commitment voters could trust Labour to uphold."
    },
    {
        "url": "https://finance.yahoo.com/news/gm-gives-tip-hat-lions-110630833.html",
        "title": "GM gives a tip of the hat to the Lions with special lighting a top the RenCen this weekend",
        "description": "After months of darkness atop the RenCen as GM installed new LED technology, get ready for a Detroit Lions display on GM&#39;s world headquarters Saturday."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/columns/2024/01/20/kerr-things-to-remember-when-youre-voting-in-tuesdays-nh-primary/72274447007/",
        "title": "Kerr: Things to remember when you&#39;re voting in Tuesday&#39;s New Hampshire primary",
        "description": "When it comes down to the wire, even folks who aren’t enamored of Biden will not want another dose of the national migraine which is Donald Trump."
    },
    {
        "url": "https://www.yahoo.com/news/battleground-states-watch-2024-election-090125604.html",
        "title": "Battleground states to watch in the 2024 <b>election</b>",
        "description": "As the 2024 presidential election inches closer, there are a number of states where the race for the White House could go in either direction. Battleground states played key roles in deciding the presidential outcomes in both 2016 and 2020, and based on recent polls, are likely to do the same again this November."
    },
    {
        "url": "https://apnews.com/article/haley-republican-party-trump-269b2932a65cc12a2efe864d3a2a93c1",
        "title": "Nikki Haley has spent 20 years navigating Republican Party factions. Trump may make that impossible",
        "description": "Nikki Haley has spent her political career trying to navigate Republicans’ traditional party establishment and the increasingly powerful conservative base that gave rise to Donald Trump."
    },
    {
        "url": "https://www.reuters.com/world/us/haley-makes-final-sprint-new-hampshire-trump-steps-up-attacks-2024-01-20/",
        "title": "Haley makes final sprint in New Hampshire as Trump steps up attacks",
        "description": "Former South Carolina Governor Nikki Haley was set to campaign across New Hampshire this weekend in a final push against Republican rival Donald Trump ahead of Tuesday&#39;s nominating contest, as the former U."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/andrew-cuomo-sues-attorney-general-records-sexual-harassment-106528629",
        "title": "Andrew Cuomo sues attorney <b>general</b> for records in sexual harassment probe that led to his downfall",
        "description": "Former New York Gov. Andrew Cuomo is suing state Attorney General Letitia James seeking to force her to release interviews from the sexual misconduct investigation that led to his resignation"
    },
    {
        "url": "https://apnews.com/article/primary-louisiana-election-congress-jungle-4d6c11151549c26811db28a0114e2c96",
        "title": "Louisiana reshapes primary system for congressional <b>elections</b>",
        "description": "Louisiana lawmakers have passed a bill that will change the state’s election process for certain primary races, including Congress and the state Supreme Court."
    },
    {
        "url": "https://www.statista.com/chart/31610/perceptions-of-most-important-problems-in-india/",
        "title": "Ahead of India’s <b>Election</b>, What Do People Care About?",
        "description": "This chart shows the share of Indian respondents who identified selected issues as among the most important in their country."
    }
]