[
    {
        "url": "https://www.thetimes.co.uk/article/14-amendment-stop-donald-trump-run-president-us-election-2024-x652nskcr",
        "title": "Can the 14th Amendment stop Donald Trump from running for president?",
        "description": "Judges are divided over whether the amendment can disqualify him from appearing on the US election 2024 ballot, setting the stage for a Supreme Court showdown"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/31/government-minister-stand-down-election-death-threats-mike-freer",
        "title": "Government minister to stand down at next <b>election</b> owing to death threats",
        "description": "Mike Freer of the Ministry of Justice says the threats to his safety are ‘too much’ and may be related to his pro-Israel views"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/mike-freer-mps-ali-harbi-ali-finchley-conor-burns-b2488408.html",
        "title": "Tory minister to step down at <b>election</b> as threats to personal safety ‘too much’",
        "description": "A Government minister has said he will stand down at the next general election after a series of death threats and an arson attack on his constituency office. Conservative justice minister Mike Freer said that “by the skin of my teeth I avoided being murdered” by Ali Harbi Ali, who went on to kill Southend West MP Sir David Amess."
    },
    {
        "url": "https://edition.cnn.com/2024/01/31/politics/union-voters-election-trump-biden/index.html",
        "title": "The union vote is becoming more Republican",
        "description": "This can also be seen in the fact that Americans hold largely favorable views of unions. About two-thirds of Americans approve of labor unions, which ranks among the highest percentages recorded since 1967. Just 15 years ago, only 48% of Americans approved of unions."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/31/the-guardian-view-on-rishi-sunaks-tax-plans-stop-trying-to-buy-votes?ref=biztoc.com",
        "title": "The Guardian view on Rishi Sunak’s tax plans: stop trying to buy votes",
        "description": "Downing Street is taking a foolish risk by putting tax cuts before public spending"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/brexit-dup-border-northern-ireland-news-b2487883.html",
        "title": "Brexit news - live: Checks make it ‘easier to trade with China than France’ as food producers brace for cost rise",
        "description": "New post-Brexit checks on food and drink imports have come into force today amid concerns the fresh checks at the border will lead to increased costs for businesses."
    },
    {
        "url": "https://edition.cnn.com/2024/01/31/politics/teamsters-trump-union-voters-biden/index.html",
        "title": "Trump meets with Teamsters as he looks to peel off union voters from Biden",
        "description": "Former President Donald Trump will meet Wednesday with Teamsters union leaders and members in Washington as his campaign tries to drive a wedge between President Joe Biden and one of his most loyal constituencies: organized labor."
    },
    {
        "url": "https://www.thesun.co.uk/news/25633974/pmqs-sketch-rishi-sunak-starmer-kate-ferguson/",
        "title": "Commons class scolded for being unruly – and even Starmer was cracking jokes, writes Kate Ferguson",
        "description": "MPs were put firmly on the naughty step in PMQs yesterday. Commons Speaker Sir Lindsay Hoyle was furious at his unruly class of politicians for being too noisy, rude and downright obnoxious in"
    },
    {
        "url": "https://www.huffpost.com/entry/donald-trump-pac-legal-fees-50-million_n_65b9d93ae4b01c5c3a38c1cd",
        "title": "Donald Trump PACs Reportedly Spent $50 Million In Donor Funds On Legal Fees Last Year",
        "description": "Former President Donald Trump spent around $50 million of donor funds on legal bills and expenses last year, a staggering sum following his indictment in four separate cases, according to The New York Times."
    },
    {
        "url": "https://www.thesun.co.uk/money/25524238/buy-now-pay-later-klarna-regulation-fca/",
        "title": "‘Alarm bells’ as huge change to Buy Now, Pay Later delayed AGAIN over fears interest-free loans may be axed for millions",
        "description": "SHOPPERS are at risk of being left out of pocket over delayed plans to regulate the Buy Now, Pay Later (BNPL) sector. The government has postponed plans to regulate BNPL products following"
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/31/ukraine-russia-war-live-counter-offensive-spring-drone/",
        "title": "Kremlin mocks Zelensky for attempted sacking of military chief",
        "description": "Ukraine will launch a new counter-offensive in the spring, its army spy chief has suggested. Kyrylo Budanov, head of the HUR military intelligence agency, said on Tuesday night that Russia’s current offensive would be “completely exhausted” by “early spring”."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68150959",
        "title": "Imran Khan: Former Pakistan PM and wife Bushra Bibi jailed for corruption",
        "description": "Imran Khan and his wife Bushra Bibi have been sentenced to 14 years in prison, a day after the former Pakistan prime minister was jailed for 10 years. Khan, who was ousted as PM by his opponents in 2022, is already serving a three-year jail term after being convicted of corruption."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/31/rishi-sunak-latest-news-wales-farage-rees-mogg-mordaunt/?utmsource=email",
        "title": "Politics latest news: Sunak accuses Starmer of deploying &#39;politics of envy&#39;",
        "description": "Rishi Sunak accused Sir Keir Starmer of deploying the “politics of envy” as they clashed over the cost of living crisis during Prime Minister’s Questions. Sir Keir claimed the Tories were responsible for households facing rising mortgage payments and suggested Mr Sunak did not understand the financial strain being felt by some families."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13028155/Tell-youll-pay-Rishi-Sunak-pressures-Keir-Starmer-28bn-green-spending-splurge-PM-hits-Labour-sniping-Tory-mortgage-chaos-minister-quit-120k-year-job-afford-repayments.html",
        "title": "Tell us how you&#39;ll pay for it! Rishi Sunak pressures Keir Starmer over his £28bn green spending splurge - as PM hits back at Labour sniping at Tory mortgage &#39;chaos&#39; after ...",
        "description": "The Prime Minister warned it was &#39;incumbent&#39; on the Labour leader to explain to voters how he would pay for his spending plans ahead of the general election."
    },
    {
        "url": "https://www.ft.com/content/ed960d70-6248-4254-b688-76275c5324b2",
        "title": "Rishi Sunak’s ‘Italian Job’ moment",
        "description": "Wobbles damage the prime minister but Tory critics have no solutions — and are implicated in the years of chaos"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13027941/Sir-U-Turn-strikes-Labour-WONT-reinstate-cap-bankers-bonuses-despite-Keir-Starmer-raging-against-Tories-scrapping-policy-boost-City.html",
        "title": "Sir U-Turn strikes again! Labour WON&#39;T reinstate cap on bankers&#39; bonuses despite Keir Starmer raging against the Tories scrapping the policy to boost the City",
        "description": "Shadow chancellor Rachel Reeves said Labour &#39;don&#39;t have any intention of bringing that back&#39; as she vowed to be a &#39;champion&#39; of the City of London ."
    },
    {
        "url": "https://www.mirror.co.uk/money/tata-steel-giant-executives-questioned-32008921",
        "title": "Tata steel giant executives to be questioned over Port Talbot closure plans",
        "description": "Bosses at steel giant Tata will be quizzed on Wednesday following the company&#39;s decision to close the blast furnaces at their biggest UK plant, risking up to 2,800 jobs."
    },
    {
        "url": "https://www.ft.com/content/471f23da-8222-4a9d-bfa7-fb5b7af31e88",
        "title": "Tories will struggle to square tax cuts with political reality",
        "description": "Hunt’s “headroom” for tax giveaways is vulnerable to change and is in reality a projection that he will be less deep in debt, rather than he will have a surplus to play with. The Treasury’s internal analysis put this figure at £14bn, lower than that forecast by independent analysts."
    },
    {
        "url": "https://www.mirror.co.uk/money/average-uk-house-price-rose-32008124",
        "title": "Average UK house price rose by 0.7% in Janauary, but buyers remain cautious",
        "description": "This comes amid a &quot;little more positive&quot; outlook for the property market. Property values were down by 0.2% compared with a year earlier, Nationwide Building Society said. The average UK house price in January was £257,656. Housing market experts said the report adds to evidence that house price declines are &quot;bottoming out&quot;."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68146241",
        "title": "Joe Biden v Donald Trump - where contest will be won and lost",
        "description": "The Trump campaign has every motivation to go on the attack against Mr Biden, in part to distract from his own weaknesses - including his legal troubles, his divisive rhetoric and his attempts to undermine the 2020 election results, which contributed to the January 2021 attack on the US Capitol."
    },
    {
        "url": "https://finance.yahoo.com/news/metro-announces-voting-results-election-230300605.html",
        "title": "METRO announces the voting results on the <b>election</b> of its directors",
        "description": "General Meeting of shareholders of METRO INC. held on January 30, 2024, METRO INC. is announcing the voting results obtained at the Annual General Meeting of Shareholders for the election of its directors."
    },
    {
        "url": "https://abcnews.go.com/538/shortest-presidential-primary/story?id=106819031",
        "title": "This could be the shortest presidential primary ever",
        "description": "New York Yankees great Yogi Berra purportedly once said &quot;it ain&#39;t over till it&#39;s over&quot; — that an outcome isn&#39;t final until a competition&#39;s participants have played out the entire contest."
    },
    {
        "url": "https://www.politico.com/news/2024/01/31/gender-poll-2024-biden-trump-00138882",
        "title": "Gender gap expands between Biden and Trump, new poll shows",
        "description": "More women said they would support Biden over Trump in this latest survey, with 58 percent backing Biden and 36 percent backing Trump. Last month, the Quinnipiac poll found 53 percent of women supported the incumbent Democrat, compared to 41 percent for the Republican challenger."
    },
    {
        "url": "https://www.politico.com/news/2024/01/31/kari-lake-qanon-fundraiser-00138886",
        "title": "QAnon supporters to host fundraiser for Kari Lake",
        "description": "Former Vice President Mike Pence once backed out of a fundraiser with the couple after their QAnon ties were revealed."
    },
    {
        "url": "https://www.foxnews.com/politics/biden-tops-trump-new-poll-lead-shrinks-third-party-candidates",
        "title": "Biden tops Trump in new poll, but lead shrinks against third-party candidates",
        "description": "President Biden leads Donald Trump in a likely November election rematch, a new national poll suggests. But the advantage shrinks in a multi-candidate field and Nikki Haley tops Biden."
    },
    {
        "url": "https://www.nytimes.com/2024/01/31/us/politics/haley-trump-donors.html",
        "title": "Some Major G.O.P. Donors Begin a Slow Turn Toward Trump",
        "description": "A meeting of the influential American Opportunity Alliance this week reflected weakening support for Nikki Haley in a previously Trump-resistant donor class."
    },
    {
        "url": "https://nypost.com/2024/01/31/news/trump-prosecutor-under-probe-for-misuse-of-taxpayer-funds-fired-worker-who-exposed-federal-grant-abuse-report/",
        "title": "Trump prosecutor under probe for ‘misuse’ of taxpayer funds fired worker who exposed federal grant abuse: report",
        "description": "Fulton County DA Fani Willis, who is under investigation for allegedly spending taxpayer funds on lavish trips with an attorney she hired while the two were having an affair, is being called out"
    },
    {
        "url": "https://www.foxnews.com/politics/virginia-capital-suspends-early-voting-heating-failure-smokes-elections-office",
        "title": "Virginia capital suspends early voting after heating failure smokes out <b>elections</b> office",
        "description": "Richmond, Virginia, suspended early voting Wednesday after a heating system failure released smoke and fumes into the city&#39;s Office of Elections."
    },
    {
        "url": "https://news.yahoo.com/us-city-councils-increasingly-call-144034317.html",
        "title": "US city councils increasingly call for Israel-Gaza ceasefire, analysis shows",
        "description": "Some 70 U.S. cities have passed resolutions on the Israel-Gaza war with most calling for a ceasefire, a Reuters analysis of city data shows, placing more pressure on President Joe Biden ahead of November&#39;s general election to help end the fighting."
    },
    {
        "url": "https://timesofindia.indiatimes.com/business/budget/budget-2024-live-updates-union-budget-highlights-income-tax-slabs-railway-budget-itr-education-infrastructure-healthcare-auto-fm-nirmala-sitharaman/liveblog/107302607.cms",
        "title": "Budget 2024 Live Updates: Infrastructure, income tax, fiscal deficit, job creation - all eyes on FM Sitharaman’s Union Budget",
        "description": "Finance Minister Nirmala Sitharaman will present Union Budget 2024 on February 1, 2024 and expectations are high on the inf"
    },
    {
        "url": "https://finance.yahoo.com/news/financial-returns-registered-political-parties-193100696.html",
        "title": "Financial Returns of Registered Political Parties for the Fourth Quarter of 2023 Now Online",
        "description": "The financial returns of registered political parties for the fourth quarter of 2023 are now available on Elections Canada&#39;s website."
    },
    {
        "url": "https://www.marketwatch.com/story/trump-meets-with-teamsters-union-in-effort-to-cut-into-bidens-union-support-ec897e2c",
        "title": "Trump meets with Teamsters union in effort to cut into Biden’s union support",
        "description": "As he looks past the GOP primary and toward a likely general election rematch against President Joe Biden, Donald Trump is meeting with members"
    },
    {
        "url": "https://economictimes.indiatimes.com/industry/cons-products/liquor/diageo-ab-inbev-say-prepared-for-disruptions-during-elections/articleshow/107302829.cms",
        "title": "Diageo, AB InBev say prepared for disruptions during <b>elections</b>",
        "description": "Diageo and AB InBev are confident in navigating sales and supply chain disruptions during the upcoming general elections in India, which typically involve temporary restrictions on alcohol sales."
    },
    {
        "url": "https://www.reuters.com/world/us/trump-meet-with-teamsters-fight-with-biden-over-union-support-2024-01-31/",
        "title": "Trump meets with Teamsters in fight with Biden over union support",
        "description": "Donald Trump is due to meet with one of America&#39;s biggest unions on Wednesday as he competes for the support of labor groups ahead of a likely general election rematch with Democratic President Joe Biden in November."
    },
    {
        "url": "https://thehill.com/newsletters/campaign-report/4440525-biden-super-pac-launches-historic-250m-ad-blitz/",
        "title": "Biden super PAC launches historic $250M ad blitz",
        "description": "Welcome to The Hill’s Campaign newsletter {beacon} Campaign Report Campaign Report The Big Story Biden super PAC launches historic $250M ad blitz A colossal effort from"
    },
    {
        "url": "https://news.yahoo.com/arizona-gop-fake-elector-proposes-181153802.html",
        "title": "Arizona GOP fake elector proposes bill to let politicians overturn <b>elections</b>",
        "description": "Republican Arizona state Sen. Anthony Kern recently filed a legislative proposal that would allow lawmakers to overturn elections."
    },
    {
        "url": "https://www.usnews.com/news/best-states/pennsylvania/articles/2024-01-31/editorial-roundup-pennsylvania",
        "title": "Editorial Roundup: Pennsylvania",
        "description": "Pennsylvania has some of the most restrictive open records laws in America, needlessly slowing or stopping the public from accessing documents and information that, by right, belong to them. The purpose of public records rules is to enhance accountability and trust, but here they foster suspicion between the government and its citizens."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4440268-trump-meets-with-teamsters-officials-washington-dc/",
        "title": "Trump meets with Teamsters officials in DC",
        "description": "Former President Trump was set to meet Wednesday with leaders of the Teamsters union as he seeks the group’s endorsement in the 2024 election. “Will be meeting with the Teamsters in"
    },
    {
        "url": "https://timesofindia.indiatimes.com/business/budget/union-budget-need-to-make-upi-the-global-payment-solution/articleshow/107301815.cms",
        "title": "Union Budget: Need to make UPI the global payment solution",
        "description": "The upcoming Union Budget is expected to focus on the importance of UPI as a global payment solution. The CEO of Wibmo-A PayU company highlights the potential of UPI and the need for policy changes to support the digital payments industry."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68146241?at_medium=RSS&amp%3Bat_campaign=KARANGA",
        "title": "Joe Biden v Donald Trump - where contest will be won and lost",
        "description": "The contest between Joe Biden and Donald Trump will be unique in modern history as a rematch between the current president and his immediate predecessor. &quot;Having two presidents running changes the nature of the race,&quot; says Todd Belt, a politics professor at George Washington University."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68150959?zephr-modal-register",
        "title": "Imran Khan: Former Pakistan PM and wife Bushra Bibi jailed for corruption",
        "description": "The man tipped to win is three-time former PM Nawaz Sharif, who returned from self-imposed exile in the autumn. He was a thorn in the side of the powerful military for much of his long career and was jailed for corruption ahead of the 2018 election that Imran Khan won."
    },
    {
        "url": "https://www.espn.com/cricket/story/_/id/39426856/imran-khan-sentenced-14-years-prison-toshakhana-case",
        "title": "Imran Khan sentenced to 14 years in prison in &#39;Toshakhana&#39; case",
        "description": "The Pakistan Tehreek-e-Insaaf (PTI), the party Imran founded and led to power in Pakistan&#39;s most recent <b>general</b> <b>elections</b>, said the proceedings &quot;exposed a complete disregard of law by a trial court&quot;, and that &quot;such a sham trial belonged to the dustbin&quot;."
    },
    {
        "url": "https://www.ft.com/content/e998703a-4285-4a3a-9c43-2f4bc16644e1",
        "title": "Rachel Reeves says Labour would ‘unashamedly champion’ the City",
        "description": "Shadow chancellor Rachel Reeves has said she has no plans to restore a cap on bankers’ bonuses, as she vowed to “unashamedly champion” Britain’s financial services sector if Labour wins the general election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-tories-election-tax-cuts-immigration-b2487561.html",
        "title": "Rishi Sunak’s fading <b>election</b> hopes hit by triple whammy",
        "description": "IMF rules out tax cuts, minister Kemi Badenoch caught in ‘Evil Plotters’ row, while Tory right claims six million rise in population makes mockery of Brexit"
    },
    {
        "url": "https://www.espn.com/cricket/story/_/id/39427076/mashrafe-mortaza-takes-break-bpl-focus-politics-work",
        "title": "Mashrafe Mortaza takes break from BPL to focus on political work",
        "description": "Sylhet Strikers captain Mashrafe Mortaza has taken a break from this season&#39;s BPL to concentrate on his political career. Mashrafe is a member of parliament - he was elected for a second time in the country&#39;s general elections earlier this month. His party, the Awami League, has appointed him as the party&#39;s whip in parliament."
    },
    {
        "url": "https://edition.cnn.com/2024/01/31/asia/pakistan-imran-khan-sentence-14-years-intl-hnk/index.html",
        "title": "Pakistan’s former leader Imran Khan sentenced to 14 years in prison, a day after being jailed for 10 years",
        "description": "Pakistan’s incarcerated former Prime Minister Imran Khan has been sentenced to 14 years in prison for corruption, his Pakistan Tehreef-e-Insaaf (PTI) party said Wednesday, in the second legal blow to beset the beleaguered politician this week."
    },
    {
        "url": "https://www.huffpost.com/entry/anthony-kern-overturn-elections-bill-arizona_n_65b95883e4b0102bd2d673f7",
        "title": "Arizona Republican Proposes Bill That Would Allow Politicians To Overturn <b>Elections</b>",
        "description": "Arizona state Sen. Anthony Kern (R), a “fake elector” for Donald Trump in 2020 who was also photographed on Capitol grounds during the Jan. 6 attack, has filed a longshot proposal to allow Arizona politicians to overturn the will of voters in presidential elections."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/half-gen-z-voters-want-32002956",
        "title": "Half of Gen Z voters want to rejoin EU and think <b>election</b> day should be Bank Holiday",
        "description": "A poll of 2,000 18 to 26 year olds found that over half want to reverse Brexit, while the NHS, the environment and the economy are their top concerns ahead of the general election"
    },
    {
        "url": "https://www.thesun.co.uk/news/25616088/rishi-sunak-this-morning-rylan-clark-rochelle-humes/",
        "title": "Rishi Sunak bats away tough questions during This Morning chat with Rylan Clark and Rochelle Humes",
        "description": "RISHI Sunak faces a roasting from This Morning’s Rylan Clark and Rochelle Humes as he joins them while they cook. The trio were in the ITV show’s kitchen tasting chicken as the PM talked about his"
    }
]