[
    {
        "url": "https://edition.cnn.com/2024/02/15/politics/white-house-letter-special-counsel/index.html",
        "title": "Biden lawyers wrote to AG Garland objecting to aspects of Hur’s report",
        "description": "Special Counsel Robert Hur released the findings of his 15-month investigation into President Biden’s handling of classified documents, the White House wrote to Attorney General Merrick Garland to vehemently object to aspects of the report – including its “multiple denigrating statements” about the president’s memory."
    },
    {
        "url": "https://www.cnn.com/2024/02/15/politics/donald-trump-campaign-trial/index.html",
        "title": "Trump’s team facing a new conundrum: How to stay on the trail during a weekslong criminal trial",
        "description": "One of Donald Trump’s longstanding complaints will become a reality on March 25: His legal peril will force him off the campaign trail – at least during the day."
    },
    {
        "url": "https://edition.cnn.com/2024/02/15/politics/donald-trump-ny-defense-what-matters/index.html",
        "title": "Trump’s self-defense, annotated",
        "description": "The coming months are going to provide former President Donald Trump with the reality of campaigning from outside a courtroom."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-donors-next-general-election-donation-limit-zj2nw8t6h?ilc=timesradio:morefromthetimes",
        "title": "Labour donors will max out £35m limit for <b>general election</b> funds",
        "description": "Dale Vince, Gary Lubner and Lord Sainsbury of Turville — will help the party reach higher limit set by the Conservative government"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/nigel-farage-threatens-scupper-natwest-share-sale-culture/",
        "title": "Nigel Farage threatens to scupper NatWest share sale unless it changes culture",
        "description": "Reform UK president says he will make life ‘very, very difficult’ for the bank’s incoming boss unless he receives a ‘fuller apology’"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/15/arizona-maricopa-clint-hickman-reelection-republican-trump",
        "title": "Arizona Republican who resisted pro-Trump pressure in 2020 to stand down",
        "description": "Maricopa county supervisor who faced threats for doing his job to confirm votes in 2020 won’t run for re-election"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-prison-jail-time-trial-b2497046.html",
        "title": "Will Donald Trump go to prison?",
        "description": "While Mr Trump is also accused of a host of minor to moderately serious felonies in the state, it is his charge of violating Georgia’s RICO statute that should have him the most worried. It carries a minimum prison term of five years, with a maximum of 20 behind bars."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088643/joe-biden-donald-trump-supporters-party-candidates-michigan.html",
        "title": "Biden&#39;s supporters are MORE willing than Trump fans to back third party candidates like Robert F. Kennedy Jr. in dire poll for president, 81, in swing state of Michigan",
        "description": "Biden&#39;s supporters are more willing to break with their candidate than those backing Trump when third party candidates are considered in Michigan&#39;s 2024 race, according to a new poll."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/15/the-guardian-view-on-indonesias-elections-prabowos-win-is-dismal-news-for-democracy",
        "title": "The Guardian view on Indonesia’s <b>elections</b>: Prabowo’s win is dismal news for democracy",
        "description": "Editorial: Outgoing president Joko Widodo’s support for the former general has further tarnished his very mixed legacy"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088625/Stop-Boats-stop-Reform-UK-Poll-finds-immigration-priority-insurgent-partys-backers-Rishi-Sunak-faces-fifth-2019-Tory-voters-defecting-Nigel-Farage-outfit.html",
        "title": "&#39;Stop the Boats&#39; to stop Reform UK? Poll finds immigration is top priority for insurgent party&#39;s backers - as Rishi Sunak faces a fifth of 2019 Tory voters defecting to Nigel ...",
        "description": "A YouGov survey of more than 4,000 people revealed 19 per cent of those who previously supported the Tories would switch to the party founded by Nigel Farage."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/recession-latest-news-rishi-sunak-tories-rachel-reeves-live/",
        "title": "Politics latest news: Nigel Farage blames recession on Bank of England",
        "description": "Rachel Reeves, the shadow chancellor, said: “Rishi Sunak’s promise to grow the economy is now in tatters. The Prime Minister can no longer credibly claim that his plan is working or that he has turned the corner on more than fourteen years of economic decline under the Conservatives that has left Britain worse off."
    },
    {
        "url": "https://www.ft.com/content/42e73a60-ee3d-4881-a8e7-0ba3d78fe1c9",
        "title": "UK’s ‘technical’ recession is politically toxic for Rishi Sunak",
        "description": "Britain’s recession was variously described by economists on Thursday as “technical” and “shallow”, but in the brutal political arena ahead of a general election it was given a different name: “Rishi’s recession”."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-byelection-results-peter-bone-b2496497.html?page=3",
        "title": "By-<b>elections</b> – LIVE: Polls open for Wellingborough and Kingswood in test for Sunak despite Labour chaos",
        "description": "Helen Harrison is running for the Conservative Party in Wellingborough, after her disgraced partner Peter Bone lost the seat in a recall petition having been suspended over bullying and sexual misconduct claims he denies."
    },
    {
        "url": "https://www.ft.com/content/77c92c62-68a1-48b0-9c8b-73ba85e56f74",
        "title": "What Prabowo Subianto’s presidential <b>election</b> win means for Indonesia",
        "description": "Former general expected to adopt more populist stance than predecessor Widodo for south-east Asia’s biggest economy"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/general-election-2024-poll-tracker-32123308",
        "title": "<b>General election</b> 2024 poll tracker: How do the UK political parties compare",
        "description": "Britain is gearing up for a general election this year after 14 years of Tory rule. Here are the latest polls and odds on Labour, the Conservatives, Reform UK, Lib Dems and more"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/poll-only-a-third-of-2019-conservative-voters-will-back-tories-at-next-general-election_uk_65cde54be4b0087d43c93acb",
        "title": "Only A Third Of 2019 Conservative Voters Will Back Tories At Next <b>General Election</b>, Says Poll",
        "description": "Only a third of voters who backed the Conservatives in 2019 will vote for the party again at the next general election, according to a new poll. On Thursday, YouGov and WPI Strategy revealed that out of 4,000 voters who supported the Tories, just 37% would support them again if an election were held tomorrow."
    },
    {
        "url": "https://apnews.com/article/orioles-mets-phillies-astros-55230dd81cd7a2f90cc770173e9fcda1",
        "title": "Orioles &#39; Kyle Bradish will miss start of season with elbow sprain",
        "description": "It didn’t take long for spring training to provide its first injury reports. The Baltimore Orioles announced Thursday that pitcher Kyle Bradish would open the season on the injured list with a sprained ulnar collateral ligament."
    },
    {
        "url": "https://www.nytimes.com/2024/02/15/world/asia/trump-trial-israel-hospital-gaza.html",
        "title": "Friday Briefing: Trump to Go on Trial",
        "description": "A New York judge rejected Donald Trump’s bid for a dismissal of the criminal charges against him stemming from a hush-money payment to a porn star, Stormy Daniels, clearing the way for his prosecution, the first of a former U.S. president."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/delay-tactics-quick-trips-takeaways-trump-case-hearings-107271362",
        "title": "Delay tactics and quick trips: Takeaways from two Trump case hearings in New York and Georgia",
        "description": "Donald Trump’s unprecedented tangle of overlapping cases was on full display Thursday with simultaneous court hearings in New York and Georgia"
    },
    {
        "url": "https://www.heraldscotland.com/news/24123396.humza-yousaf-mocked-snp-campaign-broadcast-fails-mention-indy/?ref=rss",
        "title": "Humza Yousaf mocked as SNP campaign broadcast fails to mention Indy",
        "description": "Humza Yousaf has been criticised by fellow Yes supporters after the SNP’s new general election broadcast failed to mention independence."
    },
    {
        "url": "https://www.huffpost.com/entry/jimmy-fallon-george-santos-tom-suozzi_n_65cde750e4b0087d43c93baa",
        "title": "Jimmy Fallon Compares Resumes Of George Santos And The Guy Who Replaced Him",
        "description": "Jimmy Fallon on Wednesday spotted key differences between the resumes of fallen fabulist George Santos and Tom Suozzi, the Democrat who replaced him in the House of Representatives."
    },
    {
        "url": "https://www.latimes.com/california/newsletter/2024-02-15/california-politics-template-ca-politics",
        "title": "Sleepy California Senate race is getting a wee bit livelier",
        "description": "On Monday night in San Francisco, the top four candidates in the race squared off in their second debate, spending an hour fielding some pretty cutting questions — including whether they thought President Biden and former President Trump were too old to run."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-news/trump-new-york-criminal-trial-set-1234968841/",
        "title": "Trump’s First Criminal Trial Is Starting Next Month",
        "description": "A Manhattan judge ruled on Thursday that Donald Trump&#39;s criminal fraud trial in New York will begin on March 25."
    },
    {
        "url": "https://www.nytimes.com/2024/02/15/nyregion/trump-hush-money-hearing-takeaways.html",
        "title": "What we learned at Thursday’s hearing.",
        "description": "Justice Juan M. Merchan set a March 25 trial date for the first criminal trial of Donald J. Trump, which will have ramifications far beyond his Manhattan courtroom."
    },
    {
        "url": "https://www.yahoo.com/news/california-primary-election-2024-meet-194145939.html",
        "title": "California primary <b>election</b> 2024: Meet the 27th state Senate District candidates",
        "description": "Incumbent Henry Stern and challengers Susan A. Collins and Lucie Volotzky are running for the 27th District seat in the California Senate."
    },
    {
        "url": "https://www.foxnews.com/politics/haley-spotlights-trump-chaos-judge-sets-former-presidents-hush-money-trial-start-march",
        "title": "Haley spotlights Trump &#39;chaos&#39; as judge sets former president&#39;s hush money trial start for March",
        "description": "Nikki Haley spotlights Donald Trump&#39;s &quot;chaos&quot; as New York City judge sets March 25 start date in his hush money case. It will be the first criminal trial of a former president in U.S. history."
    },
    {
        "url": "https://inews.co.uk/news/politics/budget-tories-shittery-2908776?ico=related_stories",
        "title": "PM faces ‘perfect storm of sh**tery’ with Budget his last chance, pollsters say",
        "description": "Next month’s Budget will mark the Conservative Party ’s last chance to turn around its chances at the general election, with the Prime Minister facing a “perfect storm of shittery” later this week, polling experts have said."
    },
    {
        "url": "https://thehill.com/regulation/court-battles/4469752-trump-new-york-hush-money-case-trial/",
        "title": "Trump’s New York hush money case to proceed to trial, judge says",
        "description": "A judge on Thursday rejected former President Trump’s bid to toss his hush money charges, paving the way for the first criminal trial of a former president to begin next month. Judge"
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/sonia-gandhis-emotional-letter-to-voters-hints-at-priyanka-gandhis-debut/articleshow/107732779.cms",
        "title": "Sonia Gandhi&#39;s emotional letter to voters hints at Priyanka Gandhi&#39;s debut",
        "description": "Former Congress President Sonia Gandhi wrote an emotional letter to the people of her Lok Sabha seat Rae Bareli on Thursday, a day after filing her ca"
    },
    {
        "url": "https://news.yahoo.com/video-now-former-indonesian-general-191900354.html",
        "title": "VIDEO NOW: Former Indonesian <b>general</b> linked to human rights abuses claims victory in presidential <b>election</b>",
        "description": "A former general linked to past human rights abuses claimed victory Wednesday in Indonesia’s presidential election, a result that would raise questions about the commitment to democratic values in the sprawling island nation that is the world’s third-largest democracy."
    },
    {
        "url": "https://news.yahoo.com/county-supervisor-declines-seek-reelection-191551421.html",
        "title": "County supervisor declines to seek reelection after voting conspiracies, citing family",
        "description": "The news blows the race for Hickman&#39;s seat wide open and adds to the list of election officials leaving their posts amid misinformation and threats."
    },
    {
        "url": "https://www.latimes.com/world-nation/story/2024-02-15/who-is-prabowo-subianto-the-ex-general-claiming-to-win-indonesias-presidency",
        "title": "Who is Prabowo Subianto, the ex-<b>general</b> claiming to win Indonesia’s presidency?",
        "description": "An ex-general with ties to Indonesia’s popular outgoing president as well as the country&#39;s brutal dictatorial past looks set to be its next leader."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-will-not-review-election-candidates-azhar-ali-turmoil-2908696?ico=related_article_inline",
        "title": "Labour will not review <b>election</b> candidates after Azhar Ali turmoil",
        "description": "The party has faced turmoil this week after being forced to suspend Rochdale by-election candidate Azhar Ali and their Hyndburn general election nominee Graham Jones after they made controversial comments at a private meeting of Lancashire Labour activists last year."
    },
    {
        "url": "https://thehill.com/homenews/senate/4470752-mcconnell-will-be-involved-in-montana-senate-gop-primary/",
        "title": "McConnell ‘will be involved’ in Montana Senate GOP primary",
        "description": "Senate Republican Leader Mitch McConnell (Ky.) says he will be involved in the Senate Republican primary in Montana to help businessman Tim Sheehy, who now faces a challenge from Rep. Matt"
    },
    {
        "url": "https://www.yahoo.com/news/voters-poll-more-likely-raise-185352564.html",
        "title": "Voters in new poll more likely to raise concerns about Biden stamina than Trump’s",
        "description": "President Biden is just four years older than former President Trump, but a new poll found voters are much more concerned about Biden’s stamina than Trump’s heading into the November election. About half of voters surveyed in Thursday’s Monmouth University poll (51 percent) said they are at least “somewhat confident” that Trump,"
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/breaking-news-live-february-15/liveblog/107732457.cms",
        "title": "Breaking News Live: Seven people died in fire that broke out at main market of Alipur, Delhi",
        "description": "Delhi fire update: Seven people died in the fire that broke out at the main market of Alipur, Narela, says Police Delhi Fire Service officials said they received a call at 5.25pm and rushed 22 fire tenders to the site. The fire, which broke out from the ground floor of the factory, was brought under control after four hours."
    },
    {
        "url": "https://www.wsj.com/articles/antisemitism-rises-again-in-the-british-labour-party-starmer-corbyn-israel-ed6b93a9",
        "title": "Antisemitism Rises Again in the British Labour Party",
        "description": "Kier Starmer seemed to have solved the problem but turned out to have merely suppressed it."
    },
    {
        "url": "https://time.com/6695374/pakistan-election-hina-jilani/",
        "title": "Pioneering Human Rights Lawyer Hina Jilani Warns of Pakistan’s Unstable Future",
        "description": "H ina Jilani, a leading human rights lawyer and pro-democracy activist from Pakistan, acutely recognizes the power of the military in deciding the fate of her country’s elections. “The military has the unique tendency of not doing the right thing by interfering in politics,” she tells TIME."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/15/fazl-accuses-gen-bajwa-faiz-for-orchestrating-no-trust-move-against-imran/",
        "title": "Fazl accuses Gen Bajwa, Faiz for ‘orchestrating no-trust move against Imran",
        "description": "Emir Maulana Fazlur Rehman on Thursday opened a Pandora&#39;s box about no-confidence motion that ousted former prime minister Imran Khan, alleging that the no conf"
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/15/us-repeats-call-for-probe-into-rigging-allegations-in-pakistan-elections/",
        "title": "US repeats call for probe into rigging allegations in Pakistan <b>elections</b>",
        "description": "WASHINGTON: The United States has once again called for conducting an investigation into the rigging allegations in Pakistan’s general elections as it termed the exercise “competitive”, reported"
    },
    {
        "url": "https://www.cyclinguk.org/general-election-2024",
        "title": "<b>General Election</b> 2024",
        "description": "It&#39;s widely expected that the next General Election will take place this year. To make cycling a safe and obvious choice for all, it needs political support. At Cycling UK we are championing this cause, and will continue to do so in the lead up to the election."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/donald-trumpand8217s-trial-date-set-as-he-faces-charge-over-money-paid-to-adult-film-star/",
        "title": "Donald Trump’s trial date set as he faces charge over money paid to adult film star",
        "description": "A trial date has been set in Donald Trump&#39;s hush-money case, which centres on the claim he paid off two women - including an adult film star - after they said he had affairs with them."
    },
    {
        "url": "https://www.countypress.co.uk/news/24122288.isle-wight-general-election-candidates-announced-lib-dems/",
        "title": "Isle of Wight <b>general election</b> candidates announced by Lib Dems",
        "description": "Cllr Lilley will do battle for Isle of Wight East, while Cllr Stuart will fight for Isle of Wight West in the next general election. The last Isle of Wight Liberal Democrat MP was Peter Brand, who served between 1997 and 2001 and died last year."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/crawleys-ps260m-cost-of-living-bombshell-4520368",
        "title": "Crawley’s £260m cost of living &#39;bombshell&#39;",
        "description": "Latest Office for National Statistics figures reveal that families across Crawley have experienced a cost of living increase of over £260m each year since the 2019 General Election."
    },
    {
        "url": "https://www.politicshome.com/news/article/recession-rishi-sunak-ons-by-election-economy-budget-labour",
        "title": "Recession Marks The Start Of A Difficult Weekend For Rishi Sunak",
        "description": "Confirmation that the UK has entered a recession brought what felt like a brief period of renewed Tory momentum to a halt as voters went to the"
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24121938.lib-dems-admit-error-labour-victory-political-literature/",
        "title": "Lib Dems admit error over Labour victory in political literature",
        "description": "In a pamphlet from General Election candidate Danny Chambers, delivered to hundreds of Winchester homes, they claim “Labour has NEVER won here”. In fact George Jeger won for Labour in 1945, holding the seat for four years as part of the post-war Attlee government."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24122337.young-reporter--gcses-worth---yehia-alsaedi-wilsons-school/",
        "title": "Young Reporter- Are GCSEs worth it?- Yehia Alsaedi, Wilson&#39;s School",
        "description": "In an August 2023 report by the Tony Blair Institute for Global Change (TBI), it called for GCSEs, the qualification undertaken by all students"
    },
    {
        "url": "https://www.express.co.uk/finance/personalfinance/1867106/Recession-pensions-savings-mortgage",
        "title": "UK enters recession - what it means for your pensions, savings and mortgage",
        "description": "EXCLUSIVE: How long the economic slump will last is unknown but consumers can take action to protect their finances."
    },
    {
        "url": "https://wingsoverscotland.com/nothing-changes-here/",
        "title": "Nothing Changes Here",
        "description": "One year ago today, Nicola Sturgeon suddenly resigned as First Minister. And what a spectacular 12 months it’s been for the Yes movement since her departure. That, of course, is a somewhat"
    },
    {
        "url": "https://www.itv.com/news/2024-02-15/kingswood-and-wellingborough-voters-head-to-polls-in-two-key-by-elections",
        "title": "Kingswood and Wellingborough: Voters head to polls in two key by-<b>elections</b>",
        "description": "Polling stations will close at 10pm in Kingswood, near Bristol, and in the Northamptonshire seat of. | ITV National News"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/recession-could-last-straw-voters-32130195",
        "title": "Recession could be last straw for voters as Tories face <b>general election</b> wipeout",
        "description": "Critics have lashed out over the &#39;Rishi recession&#39; announced this morning - just hours after a mega-poll showed the Tories could be left with just 80 MPs after the election"
    },
    {
        "url": "https://www.ft.com/content/fbcf7514-191a-453c-878f-fc47581bf1ac",
        "title": "Tough by-<b>elections</b> for Tories may reignite criticism from Sunak’s right",
        "description": "Labour favourite to win as voters show discontent with prime minister’s leadership, migration and public services"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13086513/Rishi-Sunak-byelection-Tories-Kingswood-Wellingborough-Keir-Starmer-Gaza-Labour.html",
        "title": "Rishi Sunak faces double by-<b>election</b> disaster TODAY as nervous Tories brace for defeat in Kingswood and Wellingborough despite Keir Starmer&#39;s Gaza chaos",
        "description": "Tories are voicing gloom about their prospects in the Kingswood and Wellingborough contests - previously regarded as very safe seats."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/15/ftse-100-markets-news-latest-uk-in-recession-live/?utmsource=email",
        "title": "Britain falls into recession in blow to Rishi Sunak - latest updates",
        "description": "Britain has fallen into recession in a blow to Rishi Sunak as he prepares to fight a general election this year. The economy shrank 0.3pc in the final three months of 2023, according to the Office for National Statistics (ONS)."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68297927.amp",
        "title": "Kingswood and Wellingborough by-<b>elections</b>: Voters go to the polls",
        "description": "Voters are going to the polls to elect new MPs in Kingswood and Wellingborough. The by-elections will decide who will replace former Conservative MPs Chris Skidmore and Peter Bone, with both seats won by the Tories at the last general election in 2019."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68271254?at_medium=RSS&at_campaign=KARANGA",
        "title": "Prabowo Subianto: What can Indonesia expect from its new strongman leader?",
        "description": "Where the president is famously soft-spoken and conciliatory, Mr Prabowo has a reputation for ill-tempered outbursts and abrasive opinions. He takes pride in the long career he had as an officer in the Indonesian special forces, despite allegations of serious human rights abuses made against both him and the unit in the past."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68237141",
        "title": "Prabowo Subianto: The tainted ex-military chief who will be Indonesia&#39;s new leader",
        "description": "After two failed attempts, Prabowo Subianto has finally clawed his way into Indonesia&#39;s ultimate seat of power. The ex-military general, accused of rights abuses and war crimes during the dark days of the Suharto regime has triumphed in a modern-day democratic vote."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68301697",
        "title": "Newspaper headlines: &#39;Worst antisemitism for 40 years&#39; and &#39;NHS nurses crisis&#39;",
        "description": "The Daily Mail also reports that British Jews suffered an &quot;explosion in hatred&quot; in the wake of the Hamas attack. The paper says that for the first time, the CST recorded at least one antisemitic incident for every police force in the UK, with the majority - more than 2,400 - in London."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-byelections-peter-bone-results-b2496002.html",
        "title": "By-<b>elections</b> - LIVE: Peter Bone’s girlfriend aims for Wellingborough seat as Kingswood faces axe",
        "description": "Helen Harrison is running for the Conservative Party in Wellingborough, after her disgraced partner Peter Bone lost the seat in a recall petition having been suspended over bullying and sexual misconduct claims he denies."
    },
    {
        "url": "https://www.scoop.co.nz/stories/PA2402/S00047/have-your-say-on-the-inquiry-into-the-2023-general-election.htm",
        "title": "Have Your Say On The Inquiry Into The 2023 <b>General Election</b>",
        "description": "The Justice Committee has opened an inquiry into the 2023 <b>General Election</b> and is now seeking public submissions. The committee has issued the following terms of reference for the inquiry: The inquiry will examine the law and administrative procedures for ..."
    },
    {
        "url": "https://www.theglobeandmail.com/investing/markets/indices/TXSI/pressreleases/24096202/uk-fell-into-recession-at-the-end-of-2023-as-economy-takes-center-stage-in-runup-to-general-election/",
        "title": "UK fell into recession at the end of 2023 as economy takes center stage in runup to <b>general election</b>",
        "description": "In what is a blow for the governing Conservative Party ahead of a <b>general election</b> this year, the Office for National Statistics estimated that economic activity, as measured by gross domestic product, declined by 0.3% in the fourth quarter of the year ..."
    },
    {
        "url": "https://www.modernghana.com/news/1292951/what-do-you-want-to-achieve-mpiani-quizzes.html",
        "title": "‘What do you want to achieve?’— Mpiani quizzes Akufo-Addo over last minute reshuffle",
        "description": "Kwadwo Mpiani, a former Chief of Staff under the erstwhile Kufuor government, has questioned President Nana Addo Dankwa Akufo-Addo rsquo;s motive for reshuffling his appointees eight months to the general elections."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/16/pti-names-omar-ayub-candidate-for-pms-slot-aslam-iqbal-as-punjab-cm/",
        "title": "PTI names Omar Ayub candidate for PM’s slot, Aslam Iqbal as Punjab CM",
        "description": "Barrister Gohar invites public to a peaceful protest on Saturday afternoon against poll riggingISLAMABAD: Former premier Imran Khan on Thursday nominated Omer Ayub as the PTI candidate for pri"
    },
    {
        "url": "https://inews.co.uk/news/politics/hunt-funding-tax-cuts-spending-cuts-2908665?ico=in-line_link",
        "title": "Hunt warned against funding tax giveaway with future spending cuts",
        "description": "Economists have urged Jeremy Hunt not to make spending reductions to fund tax cuts in the Budget, warning that the UK is “not in a good place” to do so. Mr Hunt is considering funding tax cuts in the March Budget with future spending cuts, as part of efforts to bring down the tax burden, and turn around Tory fortunes before the general election."
    },
    {
        "url": "https://www.whitehavennews.co.uk/news/24123179.lib-dem-plastic-free-cumberland-proposals-sent-committee/",
        "title": "Lib Dem &#39;plastic free Cumberland&#39; proposals sent to committee",
        "description": "SENIOR councillors have criticised the way a motion to make north and west Cumbria plastic free was put forward."
    },
    {
        "url": "https://apnews.com/article/north-carolina-election-governor-primaries-180dd949d31c7e26a50bc5947de3d6e7",
        "title": "Steady ascent or sudden splash? North Carolina governor’s race features men who took different paths",
        "description": "Front-runners for North Carolina&#39;s major-party nominations for governor in next month&#39;s primaries have taken dramatically different paths to prominence."
    },
    {
        "url": "https://www.businessinsider.com/trump-lawyers-manhattan-trial-jurors-election-stolen-2024-2",
        "title": "Trump lawyers don&#39;t want prospective jurors in &#39;hush-money&#39; case to be asked if 2020 <b>election</b> was stolen",
        "description": "Manhattan DA prosecutors and Donald Trump&#39;s lawyers sparred over potential jury questions in his hush-money case."
    },
    {
        "url": "https://apnews.com/article/alabama-legislature-gambling-bill-c2eca3457a36fdd1c967bc2591915b6d",
        "title": "Lottery, casino bill passes key vote in Alabama House",
        "description": "Lottery and casino legislation passed a key test Thursday in the Alabama Legislature. The House of Representatives approved the proposed constitutional amendment to allow up to 10 casino sites with table games and slot machines,"
    },
    {
        "url": "https://inews.co.uk/news/politics/hunt-pressure-bank-england-cut-interest-rates-recession-2908431?ico=above_article_ticker",
        "title": "Hunt leads pressure on Bank of England to cut interest rates as UK tips into recession",
        "description": "Jeremy Hunt has put further pressure on the Bank of England to start bringing down interest rates after official figures showed the UK economy had tipped into recession."
    },
    {
        "url": "https://www.standard.co.uk/business/build-to-rent-housing-michael-gove-john-lewis-brownfield-b1139422.html",
        "title": "We must unlock a build-to-rent revolution in London to help house our young people",
        "description": "Planning reform is urgently needed before Michael Gove’s stark warning about the threat to democracy comes true"
    },
    {
        "url": "https://morningstaronline.co.uk/article/voters-wellingborough-and-kingswood-took-polling-booths-yesterday",
        "title": "Voters in Wellingborough and Kingswood take to the polling booth",
        "description": "VOTERS in Wellingborough and Kingswood headed to the polls to select their new MP today in two key by-elections. The polling closed late at night and the results were expected early this morning in the seats being defended by the Tories, with Labour expected to take both contests."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/housebuilder-mj-gleeson-sees-positive-signs-of-recovery-despite-drop-in-profits-4520118",
        "title": "Housebuilder MJ Gleeson sees ‘positive signs’ of recovery despite drop in profits",
        "description": "Housebuilder MJ Gleeson has said that it sees signs of a recovery in demand for homes despite the firm’s pre-tax profits more than halving year-on-year."
    },
    {
        "url": "https://news.sky.com/story/donald-trumps-trial-date-set-as-he-faces-charge-over-money-paid-to-adult-film-star-13072276",
        "title": "Donald Trump&#39;s trial date set as he faces charge over money paid to adult film star",
        "description": "The case centres on the years-old claim that Donald Trump paid off women who said they&#39;d had affairs with him - one of whom is Stormy Daniels."
    },
    {
        "url": "https://www.thenational.scot/news/24122627.talktv-charity-outraged-guest-labels-muslim-voters-anti-jewish/",
        "title": "TalkTV: Charity outraged as guest labels Muslim voters &#39;anti-Jewish&#39;",
        "description": "A CHARITY has hit out after a guest on TalkTV claimed that all Muslim voters are “by definition anti-Jewish”. Speaking to the broadcaster’s Talk Today with Jeremy Kyle and Rosie Wright show, political columnist Trevor Kavanagh was discussing antisemitism within the Labour Party."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13087023/Chancellor-Jeremy-Hunt-lines-deep-public-spending-cuts-slash-taxes-ahead-general-election.html",
        "title": "Chancellor Jeremy Hunt &#39;lines up deep public spending cuts&#39; so he can slash taxes ahead of the <b>general election</b>",
        "description": "The Chancellor has repeatedly talked up the prospect of tax cuts prior to next month&#39;s Budget as the Tories look to reverse their dire poll ratings among voters."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68297927",
        "title": "Kingswood and Wellingborough by-<b>elections</b>: Voters go to the polls",
        "description": "Voters are going to the polls to elect new MPs in Kingswood and Wellingborough. The by-elections will decide who will replace former Conservative MPs Chris Skidmore and Peter Bone, with both seats won by the Tories at the last general election in 2019."
    },
    {
        "url": "https://www.bbc.com/news/av/world-latin-america-68286893",
        "title": "Rare video shows inmates in their cells in El Salvador&#39;s mega-jail",
        "description": "Just days after El Salvador&#39;s general election, the BBC was invited on a carefully orchestrated, guided tour of the country&#39;s controversial mega-jail that holds thousands of inmates."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/chief-election-commissioner-reaches-odisha-to-review-poll-preparedness/articleshow/107731462.cms",
        "title": "Chief <b>Election</b> Commissioner reaches Odisha to review poll preparedness",
        "description": "Members and officials of the Election Commission of India (ECI) led by chief election commissioner (CEC), who are on a three-day Odisha v."
    },
    {
        "url": "https://www.politico.com/news/2024/02/15/manchin-romney-president-2024-00141654",
        "title": "Manchin floats Romney or Portman as hypothetical VP picks for a third party bid",
        "description": "Hypothetically, if I was picking my running mate, really who I would ask right now is Mitt Romney,” the West Virginia Democrat said."
    },
    {
        "url": "https://www.nytimes.com/2024/02/15/opinion/donald-trump-biden-election.html",
        "title": "We’re Running Out of Names for Trump. At Least Polite Ones.",
        "description": "Well, not all of us: Trump is conducting an experiment in unbound narcissism with no room for anybody else. It’s bonkers, it’s unscrupulous, it’s terrifying. Pick your put-down. It won’t be sufficiently heard because it won’t be remotely fresh."
    }
]