[
    {
        "url": "https://www.theguardian.com/society/2024/jan/27/sunak-facing-pre-election-disaster-if-childcare-expansion-plan-fails-in-autumn",
        "title": "Sunak ‘facing pre-<b>election</b> disaster’ if childcare expansion plan fails in autumn",
        "description": "Persistent fears over staffing and funding could lead to promises being broken to parents weeks before likely poll date"
    },
    {
        "url": "https://www.insidethegames.biz/articles/1143515/",
        "title": "Boban quits UEFA over Ceferin&#39;s possible re-<b>election</b>",
        "description": "This was supposed to be his last term, but in December he submitted a proposal for an amendment that would allow him to stand for re-<b>election</b>. This will be put ... I would be going against the principles and <b>general</b> values in which I deeply believe."
    },
    {
        "url": "https://www.ctvnews.ca/mobile/politics/trudeau-and-singh-s-teams-quietly-planning-electoral-reform-legislation-1.6744379?clipId=104056",
        "title": "Trudeau and Singh&#39;s teams quietly planning electoral reform legislation",
        "description": "Specifically, the Liberals and New Democrats agreed to explore: Allowing an &quot;expanded&quot; three-day voting period during <b>general</b> <b>elections</b>; Allowing voters to cast their ballots at any polling place within their riding; and Improving the mail-in ballot ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/27/farmers-streets-europe-net-zero-protests/",
        "title": "Farmers take to streets across Europe in net zero revolt that threatens EU policy as <b>elections</b> loom",
        "description": "Protests sweeping the continent take their cue from tractor demos that delivered resounding success at the polls in the Netherlands"
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-68116535",
        "title": "&#39;Nice guy but weak&#39;: Voters on Rishi Sunak and Sir Keir Starmer",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts on the Prime Minister, Rishi Sunak, and the leader of the opposition, Sir Keir Starmer. They&#39;re all from areas that swung from Labour to Conservative in the last general election, and have been speaking to the BBC&#39;s Laura Kuenssberg."
    },
    {
        "url": "https://edition.cnn.com/2024/01/27/politics/biden-haley-trump-election-campaign/",
        "title": "Trump faces two-front fight as Biden and Haley hit campaign trail",
        "description": "Nikki Haley. Both Trump and Biden are treating this weekend as the opening salvo of the <b>general election</b>, traveling to states where they are assured of winning their parties’ early-February nominating contests — Trump in Nevada, Biden in South Carolina ..."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-01-27/vaughan-gething-pledges-education-and-childcare-boost-in-bid-for-wales-top-job",
        "title": "Vaughan Gething pledges education and childcare boost in First Minister manifesto",
        "description": "Welsh Labour leadership candidate Vaughan Gething says he&#39;ll focus on education as he sets his sights on taking over from Mark Drakeford as First Minister. | ITV News Wales"
    },
    {
        "url": "https://www.thetimes.co.uk/article/chancellor-prepares-a-public-sale-of-natwest-shares-but-should-you-buy-them-rcgjr2rkz",
        "title": "Chancellor prepares a public sale of NatWest shares – but should you buy them?",
        "description": "Jeremy Hunt is preparing the ground for a multibillion-pound public sale of shares in NatWest as soon as June in a move that would evoke Margaret Thatcher’s “Tell Sid” privatisation spirit ahead of a"
    },
    {
        "url": "https://edition.cnn.com/2024/01/27/politics/bidens-gaza-problem/index.html?ref=mc.news",
        "title": "Biden’s Gaza problems are deeper than just being interrupted in public",
        "description": "The silence from Muslim leaders on the president’s 2024 reelection bid is speaking volumes as Biden continues to back Israel in its war against Hamas in Gaza."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.chesterstandard.co.uk/news/24069274.hoping-way-can-found-save-many-jobs/",
        "title": "&#39;Hoping that a way can be found to save the many jobs&#39;",
        "description": "COULD the inevitable ongoing challenge to the highly controversial Rwandan deportation plan provide the kickstart for this year’s <b>General Election</b>? That is one of the scenarios that is being actively contemplated by various politicians, myself included."
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/27/hywel-williams-westminster-must-now-consider-wales-constitutional-future-including-independence/",
        "title": "Hywel Williams: ‘Westminster must now consider Wales’ constitutional future — including independence’",
        "description": "It highlights a more urgent need than ever for the people of Wales to force Westminster to care about Wales by electing a strong group of Plaid Cymru MPs in the <b>general election</b>. Politics.co.uk is the UK’s leading digital-only political website ..."
    },
    {
        "url": "https://inews.co.uk/news/world/lawyers-donald-trump-ballot-2874774?ico=most_popular",
        "title": "The lawyers trying to force Trump off the ballot, and why they think they will win",
        "description": "In a high-profile victory, the top court in Colorado in December judged Mr Trump was ineligible to serve and said his name should not appear on the state’s primary election ballots"
    },
    {
        "url": "https://www.radio.gov.pk/27-01-2024/electioneering-picks-up-momentum-ahead-of-general-elections",
        "title": "Electioneering picks up momentum ahead of <b>general</b> <b>elections</b>",
        "description": "Electioneering is picking up momentum ahead of the <b>general</b> <b>elections</b> 2024 to be held on February 8. The political parties are holding public gatherings in order to win the support of voters. PML (N) is holding a public meeting in Rawalpindi today which ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/politico-confidential/trump-freaks-europe-out/",
        "title": "POLITICO Confidential: Trump freaks Europe out",
        "description": "Host Sarah Wheaton talks to POLITICO’s Aitor Hernández-Morales and Sorcha Edwards, secretary-<b>general</b> of Housing Europe, about the causes of the crisis, its impact across the bloc (including far-right parties using it as an <b>election</b> platform) and ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/27/tuvalus-pro-taiwan-prime-minister-kausea-natano-loses-seat-in-partial-election-results?ref=mc.news",
        "title": "Tuvalu’s pro-Taiwan prime minister Kausea Natano loses seat in partial <b>election</b> results",
        "description": "The results fuel concern that the micronation could switch diplomatic recognition to Beijing, as votes continue to be counted"
    },
    {
        "url": "https://uk.news.yahoo.com/crawford-county-needs-poll-workers-144800056.html",
        "title": "Crawford County needs poll workers for April primary <b>election</b>",
        "description": "Those interested in serving as a <b>general</b> poll worker or to schedule a training class can contact the Crawford County Office of <b>Election</b> and Voter Services at (814) 333-7307."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-norfolk-68037584?at_link_type=web_link&at_bbc_team=editorial&at_campaign_type=owned&at_link_id=6B7EF5C6-BCDE-11EE-8452-9B59D0B4AF07&at_format=link&at_link_origin=BBCPolitics&at_ptr_name=twitter",
        "title": "YMCA calls on MPs to focus on youth ahead of next <b>election</b>",
        "description": "John Lee, the chief executive officer of YMCA Norfolk, said youth ambassadors from Norfolk travelled to London to talk to MPs. &quot;We are passionate about making sure those in power hear the voices of young people,&quot; he said."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860103/nigel-farage-general-election-poll",
        "title": "POLL: Do you think Nigel Farage could win a <b>general election</b>? Vote here",
        "description": "Nigel Farage has revealed his aim would be to win a general election if he makes a political comeback. Speculation is high over whether the former Ukip leader, who is currently honorary president of Reform UK, will return to frontline politics."
    },
    {
        "url": "https://www.countytimes.co.uk/news/24071904.liberal-democrats-reveal-montgomeryshire-candidate/",
        "title": "Liberal Democrats reveal Montgomeryshire candidate",
        "description": "The Liberal Democrats have revealed their candidate for Montgomeryshire in the upcoming <b>general election</b>. Councillor Glyn Preston has represented Llanidloes ward on Powys County Council alongside veteran Councillor Gareth Morgan since 2022 will be the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68098173?at_campaign=Social_Flow&at_link_id=7D9971FC-BC5F-11EE-A6F5-7BF054826ABF&at_ptr_name=twitter&at_medium=social&at_bbc_team=editorial&at_link_origin=BBCPolitics&at_link_type=web_link&at_campaign_type=owned&at_format=link",
        "title": "Council tax bands need overhauling, northern business group says",
        "description": "In a letter to Mr Hunt, he said the Treasury should carry out a revaluation of all homes in England before the next <b>general election</b>, expected later this year. The NPP&#39;s suggested overhaul would also include higher bands for expensive foreign-owned ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/suspended-presenter-huw-edwards-too-102825215.html",
        "title": "Suspended presenter Huw Edwards ‘too unwell to discuss future at BBC’",
        "description": "Speculation remains about his future at the Corporation as it prepares for a <b>general election</b> this year. Vicky Flind, Mr Edwards’s wife, who named him as the presenter at the centre of the scandal after the allegations were first reported in The Sun ..."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/mps-demand-online-platforms-break-9041304",
        "title": "MPs demand online platforms to break filter bubbles and stop fake news",
        "description": "A new duty of balance and undue prominence is proposed by MPs to make online platforms expose users to diverse and balanced views and prevent the spread of online misinformation and disinformation"
    },
    {
        "url": "https://www.heraldscotland.com/news/24075782.daniel-hough-another-year-financial-volatility-awaits/",
        "title": "Daniel Hough: Another year of financial volatility awaits",
        "description": "With the vast majority of the year still in front of us, there is still plenty of time for people to take control of their finances"
    },
    {
        "url": "https://www.radio.gov.pk/27-01-2024/general-election-would-bring-political-stability-in-country-pm",
        "title": "<b>General election</b> would bring political stability in country: Caretaker PM",
        "description": "Caretaker Prime Minister Anwaar-ul-Haq Kakar has said that the <b>general election</b> on February 8 would bring political stability in the country. In an interview with a private television channel, he said the caretaker government successfully achieved most of ..."
    },
    {
        "url": "https://uk.news.yahoo.com/everyone-knows-tories-failed-says-001711017.html",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "&quot;IT IS time for change&quot;. Those are the words from the man who pollsters are tipping as favourite to become the country&#39;s next Prime Minister when the <b>general election</b> takes place later this year. Sir Keir Starmer paid a visit to Tilehurst in Reading on ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rochdale-getting-new-mp-voters-28516824",
        "title": "Rochdale is getting a new MP - but some voters couldn&#39;t care less",
        "description": "&quot;I&#39;ve felt that way before,&quot; she said, &quot;but I&#39;ve got a postal vote, so it&#39;s easy.&quot; Voter turnout in Rochdale was around 60 per cent at the last <b>general election</b> in 2019 - lower than the overall turnout across the UK, but far from the lowest which was 10 ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-elections-2024-date-primary-gop-trump-live-updates-b2485950.html?page=6",
        "title": "US <b>election</b> 2024 live updates: Trump rejects resolution to make him Republican ‘presumptive nominee’",
        "description": "With Trump appearing to have a cemented himself as the Republican Party’s preferred candidate in their effort to retake control of the White House, President Joe Biden’s re-<b>election</b> campaign is moving into a <b>general election</b> mode that will see him and ..."
    },
    {
        "url": "https://www.thestockdork.com/make-america-great-again-raises-a-mammoth-46-million-in-late-2023/",
        "title": "Make America Great Again Raises a Mammoth $46 Million in Late 2023",
        "description": "As the 2024 <b>general election</b> draws nearer, Make America Great Again Inc. (MAGA Inc.), a super PAC supporting former President Donald Trump, has demonstrated formidable fundraising prowess. With over $46 million raised in the second half of 2023 ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/huge-rally-to-mark-40th-anniversary-of-ban-on-unions-at-gchq-b1135201.html",
        "title": "Huge rally to mark 40th anniversary of ban on unions at GCHQ",
        "description": "“The GCHQ workers had to wait 13 years for justice, but we expect Labour to live up to its commitment to repeal the Strikes Act within 100 days of winning the <b>general election</b>. “What really depresses me is that despite the big issues facing the country ..."
    },
    {
        "url": "https://www.palatinate.org.uk/labour-on-cronyism-time-for-a-crackdown/",
        "title": "Labour on cronyism: time for a crackdown?",
        "description": "It may be correct to say that Sir Keir does not need to define the changes he will make to the state apparatus to clinch victory at a <b>general election</b>. But the very fact of not doing so dilutes his message of integrity and reform. Whereas once the House of ..."
    },
    {
        "url": "https://www.huffpost.com/entry/trump-colorado-ballot_n_65b2b37ce4b0166fc7713de3?ncid=engmodushpmg00000003",
        "title": "Republicans Are Grasping At Straws To Promise Retribution If Trump Is Taken Off The Ballot",
        "description": "After former president and current GOP presidential front-runner Donald Trump ’s disqualification from the ballots in Colorado and Maine for engaging in insurrection on Jan. 6, it didn’t take long for Republicans to respond with retributive calls to do the same to President Joe Biden, among other Democrats."
    },
    {
        "url": "https://www.nytimes.com/2024/01/27/us/politics/trump-2024-nevada-caucus.html",
        "title": "Trump Campaigns in Nevada, Where He Has Virtually No Rival",
        "description": "As much as Donald Trump has sought to pivot to a general election message, his Republican opponent, Nikki Haley, is still in the race. But she won’t challenge him in Nevada."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4433234-newsom-calls-trump-damaged-goods-2024/",
        "title": "Newsom calls Trump ‘damaged goods’ and ‘more unhinged’ than ever",
        "description": "California Gov. Gavin Newsom (D) took a swing at former President Trump Friday, claiming he is “more unhinged” than ever, as a rematch between Trump and former President Biden becomes"
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-trump-rematch-senators/",
        "title": "On Trump-Biden rematch, many senators say bring it on",
        "description": "While most voters continue to hope for alternatives, Republicans and Democrats in the Senate see the rematch of 2020 nominees as historic moment pitting clearly different visions."
    },
    {
        "url": "https://news.yahoo.com/tory-capitulation-soft-left-orthodoxy-130000016.html",
        "title": "Tory capitulation to the soft-Left orthodoxy has ruined Britain",
        "description": "Rishi Sunak is doomed and the party that he leads may not survive his electoral collapse. That is the consensus accepted with varying degrees of despair, or glee, within conservative circles. There are two quite separate grounds for this belief."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-elections-2024-date-primary-gop-trump-live-updates-b2485950.html?page=5",
        "title": "US <b>election</b> 2024 live updates: Trump rejects resolution to make him Republican ‘presumptive nominee’",
        "description": "Donald Trump has rejected a draft resolution submitted to the Republican National Committee (RNC) hoping to recognise him as the GOP’s “presumptive nominee” in the wake of his victory in the New Hampshire presidential primary on Tuesday over his last remaining opponent Nikki Haley."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/27/how-biden-hopes-to-win-independents-turned-off-by-trump/72351232007/",
        "title": "How New Hampshire exposed Trump&#39;s vulnerabilities and Biden&#39;s path to beat him",
        "description": "Donald Trump is romping his way to the Republican nomination but showing a weakness with independent voters that could doom him against Biden."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/jan/27/election-worker-training-abuse?ref=mc.news",
        "title": "‘Every noise makes you jumpy’: US <b>election</b> workers confront threats and abuse with resilience training",
        "description": "Nearly half of all officials have been insulted, a third harassed, and nearly one in five threatened, according to CivicPulse"
    },
    {
        "url": "https://www.cnn.com/2024/01/27/politics/biden-haley-trump-election-campaign/index.html",
        "title": "Trump faces two-front fight as Biden and Haley hit campaign trail",
        "description": "Donald Trump was pulling up to his plane at LaGuardia Airport, set to travel to Nevada for a campaign rally Saturday, when the news came: A Manhattan jury said the former president should pay the writer E."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/ppp-chief-bilawal-hits-out-at-sharifs-pml-n-says-will-hunt-the-lion-with-arrow/articleshow/107185521.cms",
        "title": "PPP chief Bilawal Bhutto hits out at Nawaz Sharif&#39;s PML-N: Says will hunt the &#39;Lion&#39; with &#39;Arrow&#39;",
        "description": "Bilawal Bhutto-Zardari challenges PML-N leaders to make efforts for the February 8 polls. He vows to hunt the &#39;Lion&#39; with &#39;Arrow&#39; by voting for the PP"
    },
    {
        "url": "https://news.yahoo.com/vote-sc-primary-voters-only-100000732.html",
        "title": "Who will you vote for in SC primary? Voters can only choose one party primary",
        "description": "Here’s a primer on what you need to know for the upcoming primary election and where to go vote. Horry County will be combining some of its precincts."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4432304-haley-moves-on-to-south-carolina-despite-pressure/",
        "title": "Haley moves on to South Carolina despite GOP pressure to drop out",
        "description": "Nikki Haley is facing broadening calls to drop out of the GOP primary even as she publicly signals no intention to do so ahead of South Carolina’s contest next month. The head of the"
    },
    {
        "url": "https://www.nbcnews.com/news/world/dior-bag-scandal-south-korea-first-lady-gift-rcna135441",
        "title": "Why a scandal over a Dior handbag is consuming a key U.S. ally",
        "description": "Hidden camera footage that appeared to show South Korea’s first lady accepting a $2,000 handbag as a gift has left President Yoon Suk Yeol facing mounting public pressure."
    },
    {
        "url": "https://www.foxnews.com/politics/schumer-aligned-super-pac-meddling-gop-primary-key-senate-race",
        "title": "Schumer-aligned super PAC meddling in GOP primary of key Senate race: &#39;Terrified of conservative outsider&#39;",
        "description": "Democrats are buying ads boosting GOP Rep. Matt Rosendale ahead of his expected Senate bid, a campaign tactic dug up from the 2022 midterms."
    },
    {
        "url": "https://www.reuters.com/world/asia-pacific/tuvalus-pro-taiwan-leader-loses-seat-national-election-2024-01-26/",
        "title": "Tuvalu&#39;s pro-Taiwan leader loses seat in national <b>election</b>",
        "description": "The pro-Taiwan leader of the Pacific islands nation of Tuvalu, Kausea Natano, lost his seat in an election closely watched by Taiwan, China and the U.S., partial results showed on Saturday."
    },
    {
        "url": "https://www.hollywoodreporter.com/news/general-news/taylor-swift-ai-nudes-twitter-x-1235806979/",
        "title": "Taylor Swift AI Nudes Provoke Fandom Uproar on X: “Disgusting as Hell”",
        "description": "The singer is the victim of several graphic AI-generated pornographic images circulating on social media platforms."
    },
    {
        "url": "https://timesofindia.indiatimes.com/business/budget/budget-2024-expectations-live-updates-interim-budget-income-tax-slabs-itr-education-infrastructure-railways-healthcare-auto-nirmala-sitharaman/liveblog/107162921.cms",
        "title": "Budget 2024 Expectations Live Updates: Income tax cheer for common man, infrastructure boost on the cards?",
        "description": "Finance Minister Nirmala Sitharaman will present the Budget 2024 for financial year 2024-25 on February 1, 202"
    },
    {
        "url": "https://www.usnews.com/news/best-states/south-carolina/articles/2024-01-27/biden-returns-to-south-carolina-to-show-his-determination-to-win-back-black-voters-in-2024",
        "title": "Biden Returns to South Carolina to Show His Determination to Win Back Black Voters in 2024",
        "description": "President Joe Biden is spending the weekend in South Carolina, intent on driving home two messages: He’s loyal to the state that saved his campaign in 2020 and he’s determined to win back Black voters"
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/live-blog/election-2024-live-updates-rcna135509",
        "title": "Nikki Haley hits Trump over E. Jean Carroll defamation damages verdict: Highlights",
        "description": "Nikki Haley is ramping up her attacks on Donald Trump ahead of the 2024 Republican South Carolina presidential primary election."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68114676.amp",
        "title": "Defamation defeat a double-edged sword for Trump",
        "description": "A New York jury has said Donald Trump must pay $83.3m (£65.6m) to E Jean Carroll, a writer he was found to have defamed by denying her allegation of sexual assault. Legal experts say the award is a message to the former president to stop smearing her. But will it work?"
    },
    {
        "url": "https://www.huffpost.com/entry/arab-and-muslim-leaders-in-michigan-cancel-meeting-with-biden-campaign_n_65b40a19e4b077c17ab51e2e",
        "title": "Arab and Muslim Leaders In Michigan Cancel Meeting With Biden Campaign",
        "description": "Community leaders rejected attempts to hold the meeting, saying that the damage had already been done by Joe Biden&#39;s administration."
    },
    {
        "url": "https://www.marketwatch.com/story/biden-urges-congress-to-pass-border-bill-as-house-speaker-suggests-it-may-be-dead-on-arrival-2b8a84ed",
        "title": "Biden urges Congress to pass border bill as House speaker suggests it may be ‘dead on arrival’",
        "description": "President Joe Biden on Friday pressed Congress to embrace a bipartisan Senate deal to pair border-enforcement measures with Ukraine aid, but House"
    },
    {
        "url": "https://www.nytimes.com/article/nevada-caucus-primary-explainer.html",
        "title": "What to Know About Nevada’s Primary and Caucus",
        "description": "The presidential candidates may have turned their attention to South Carolina, but the next contests on the calendar are in the Silver State. The process there is complex and confusing."
    },
    {
        "url": "https://apnews.com/article/tennessee-deny-bail-amendment-5b6dfff1487c41d5189cc835581a7f02",
        "title": "Bipartisan Tennessee proposal would ask voters to expand judges’ ability to deny bail",
        "description": "A bipartisan group of Tennessee lawmakers have announced support for a proposed constitutional amendment that would give judges more latitude to hold someone without bail before trial for certain violent criminal charges."
    },
    {
        "url": "https://www.economist.com/graphic-detail/2024/01/26/ten-charts-reveal-narendra-modis-actual-record-in-office",
        "title": "Ten charts reveal Narendra Modi’s actual record in office",
        "description": "N ARENDRA MODI says India is now in the midst of amrit kaal, a golden age. Over the past ten years, the prime minister’s braggadocious language has proven popular with voters. Such talk will only increase as he seeks a third term in the next general election, slated to take place between April and May. But has his governance matched his rhetoric?"
    },
    {
        "url": "https://www.yahoo.com/news/venezuela-supreme-court-upholds-ban-225448010.html",
        "title": "Venezuela supreme court upholds ban on opposition candidate Machado’s presidential run",
        "description": "The government-controlled Venezuelan Supreme Court ruled on Friday that opposition leader Maria Corina Machado will not be allowed to run in the presidential elections set for later this year, dealing a significant blow to the democratic transition roadmap that leader Nicolás Maduro agreed to with the Biden administration in Barbados last year."
    },
    {
        "url": "https://edition.cnn.com/politics/live-news/election-2024-campaign-news-01-26-24/index.html",
        "title": "The latest on the 2024 campaign",
        "description": "Former President Donald Trump continues to advance toward securing the GOP nomination as Nikki Haley vows to stay in the race. Meanwhile, President Joe Biden gears up for a possible rematch with Trump."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/coal-ceo-don-blankenship-win-senate-seat-gop-106722247",
        "title": "Ex-coal CEO Don Blankenship couldn&#39;t win a Senate seat with the GOP. He&#39;s trying now as a Democrat",
        "description": "Former West Virginia coal executive Don Blankenship has filed paperwork to run for Joe Manchin&#39;s U.S. Senate seat"
    },
    {
        "url": "https://www.politico.com/newsletters/politico-influence/2024/01/26/covington-lobbying-for-release-of-radio-free-europe-journalist-detained-in-russia-00138176_1",
        "title": "Covington lobbying for release of Radio Free Europe journalist detained in Russia",
        "description": "U.S.-funded media outlet Radio Free Europe/Radio Liberty has retained Covington &amp; Burling for help securing the release of one of its journalists who was detained in Russia last year on charges of failing to register as a foreign agent."
    },
    {
        "url": "https://www.yahoo.com/news/election-2024-10-california-congressional-213306398.html",
        "title": "<b>Election</b> 2024: 10 California Congressional races to watch",
        "description": "Nonpartisan elections tracker The Cook Political Report this week released its latest assessment of all 435 House elections in 2024, featuring 10 California races considered competitive or potentially competitive."
    },
    {
        "url": "https://www.cbsnews.com/miami/news/florida-abortion-measure-moves-big-step-closer-to-appearing-on-the-november-ballot/",
        "title": "Florida abortion measure moves big step closer to appearing on the November ballot",
        "description": "The Florida Supreme Court must still weigh in on the matter before the measure makes it to the November ballot."
    },
    {
        "url": "https://nypost.com/2024/01/26/opinion/un-court-ruling-against-israel-is-a-corrupt-moral-joke/",
        "title": "UN fires workers for Hamas terrorism as court rules against Israel: What a corrupt joke!",
        "description": "The UN court ruling against Israel Friday proves yet again that the ICJ is a moral joke. Meanwhile the UN had to fire employees for allegedly participating in terrorism on Oct. 7."
    },
    {
        "url": "https://www.politico.com/newsletters/new-york-playbook-pm/2024/01/26/cuomo-harassment-women-00138157",
        "title": "More woes for Cuomo",
        "description": "Thirteen women who worked for state government were sexually harassed by former Gov. Andrew Cuomo over the course of an eight-year period, a civil rights settlement announced today by the Department of Justice found."
    },
    {
        "url": "https://www.usnews.com/news/national-news/articles/2024-01-26/which-top-republicans-havent-endorsed-trump-yet",
        "title": "Which Top Republicans Haven’t Endorsed Trump – Yet",
        "description": "Trump has a long list of national lawmakers who have endorsed him. So while the holdouts might bother him on a personal level, they likely don’t have much influence over the Republican nomination in 2024."
    },
    {
        "url": "https://www.foxnews.com/opinion/new-hampshire-message-haley-trump-phillips-desantis",
        "title": "New Hampshire sent message, but it wasn&#39;t about Haley, Trump, Phillips or DeSantis",
        "description": "The first presidential primary of 2024 was held on Tuesday in New Hampshire. Democrats didn&#39;t officially participate. But, still, when it was all over there were important suprises."
    },
    {
        "url": "https://apnews.com/article/georgia-brad-raffensperger-elections-voting-f3f6d81d74f204facd1ee092d5930358",
        "title": "Georgia senators vote for board to oversee secretary of state despite constitutional questions",
        "description": "Georgia’s Senate is backing a plan to give the state’s appointed election board the power to investigate Secretary of State Brad Raffensperger’s handling of elections."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lord-frost-donor-plot-rishi-clock-ticking-b2485618.html",
        "title": "Tory peer behind ‘Labour landslide’ poll told to reveal shadowy backers or be expelled from party",
        "description": "A defiant Lord Frost’s refusal to name names has increased fears in No 10 that the megapoll is linked to donors"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/26/iowa-bill-14th-amendment-challenges/72367822007/",
        "title": "Iowa bill aims to clear path for Trump by banning 14th Amendment primary ballot challenges",
        "description": "The bill would also eliminate Iowa&#39;s requirement that candidates for Congress and president be disqualified if they have been convicted of a felony."
    },
    {
        "url": "https://www.forbes.com/sites/meglittlereilly/2024/01/26/what-the-nh-primaries-reveal-about-the-future-of-political-journalism/",
        "title": "What The NH Primaries Reveal About The Future Of Political Journalism",
        "description": "In their coverage of NH primaries, student reporters observed emerging trends that could impact political journalism in the future."
    },
    {
        "url": "https://www.bloomberg.com/news/articles/2024-01-26/labour-to-unveil-plans-to-forge-deeper-ties-with-city-of-london",
        "title": "Labour Party to Unveil Plans to Forge Deeper Ties With City of London",
        "description": "Labour is slated to pledge close communication with business and backing for pro-growth City reforms as part of a fresh series of announcements next week."
    },
    {
        "url": "https://www.axios.com/2024/01/26/biden-lng-export-approvals-climate",
        "title": "Biden eyes &quot;pause&quot; of new LNG export facilities",
        "description": "The Biden administration will pause approvals of new liquefied natural gas export facilities, partly to more fully consider each project&#39;s potential climate change consequences, President Biden announced Friday morning."
    },
    {
        "url": "https://nypost.com/2024/01/26/news/rnc-bid-to-call-trump-presumptive-nominee-dropped-after-ex-prez-disapproves/",
        "title": "RNC member drops bid to call Trump ‘presumptive nominee’ after ex-prez’s disapproval",
        "description": "A draft Republican National Committee resolution that would have labeled Donald Trump the presumptive GOP presidential nominee was withdrawn late Thursday after Trump himself publicly expressed"
    },
    {
        "url": "https://www.rferl.org/a/bosnia-muslims-jews-holocaust-srebrenica/32794484.html",
        "title": "Muslims, Jews Gather In Bosnia To Mark Holocaust, 1995 Genocide",
        "description": "Muslims and Jews from across Bosnia-Herzegovina traveled to the Srebrenica region -- site of a 1995 genocide during the Yugoslav war -- to jointly mark International Holocaust Remembrance Day and to sign an initiative designed to promote mutual understanding and dialogue between the two communities."
    },
    {
        "url": "https://fortune.com/2024/01/27/ai-firm-elevenlabs-bans-account-for-biden-audio-deepfake/",
        "title": "Biden audio deepfake spurs AI startup ElevenLabs—valued at $1.1 billion—to ban account: ‘We’re going to see a lot more of this’",
        "description": "A spokesperson for the New Hampshire Attorney <b>General</b> said at the time that the messages appeared “to be an unlawful attempt to disrupt the New Hampshire Presidential Primary <b>Election</b> and to suppress New Hampshire voters.” The agency has opened an ..."
    },
    {
        "url": "https://www.yahoo.com/news/crawford-county-needs-poll-workers-144800056.html",
        "title": "Crawford County needs poll workers for April primary <b>election</b>",
        "description": "With Pennsylvania&#39;s 2024 primary election set for April 23, Crawford County needs poll workers in several precincts. Anyone may be a poll worker provided they are a registered voter in Crawford County — regardless of party affiliation,"
    },
    {
        "url": "https://apnews.com/article/iraq-us-talks-to-end-coalition-mission-f782db4c6550ab31ef02ef3c1793ee7b",
        "title": "Iraq and US begin formal talks to end coalition mission formed to fight the Islamic State group",
        "description": "Iraq&#39;s prime minister says his government and the United States have held a first session of formal talks in Baghdad aimed at winding down the mission of a U.S."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-mind-labour-163619181.html",
        "title": "Voices: Keir Starmer is about to make up his mind about Labour’s £28bn albatross – its green manifesto",
        "description": "Patrick Maguire of The Times, who is writing a book about Labour’s not-so-long march to (presumed) <b>election</b> victory, reported that at Tuesday’s shadow cabinet meeting, “there were complaints by Emily Thornberry and Louise Haigh that this background ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68098173?at_medium=RSS",
        "title": "Council tax bands need overhauling, northern business group says",
        "description": "In a letter to Mr Hunt, he said the Treasury should carry out a revaluation of all homes in England before the next <b>general election</b>, expected later this year. The NPP&#39;s suggested overhaul would also include higher bands for expensive foreign-owned ..."
    },
    {
        "url": "https://inews.co.uk/news/world/lawyers-donald-trump-ballot-2874774",
        "title": "The lawyers trying to force Trump off the ballot, and why they think they will win",
        "description": "In a high-profile victory, the top court in Colorado in December judged Mr Trump was ineligible to serve and said his name should not appear on the state’s primary election ballots"
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-tory-plot-threat-2876230?ico=editors_picks",
        "title": "The plot against Sunak: Why ‘second rate’ Tories could still pose threat to PM",
        "description": "Despite the latest bout of Conservative infighting, some in Labour are still nervous about potential weakness in the so-called &#39;Red Wall&#39;"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/national/24078667.huge-rally-mark-40th-anniversary-ban-unions-gchq/",
        "title": "Huge rally to mark 40th anniversary of ban on unions at GCHQ",
        "description": "A huge protest will be held on Saturday to mark the 40th anniversary of the controversial ban on trade unions at the GCHQ communications headquarters. Thousands of trade unionists will march through Cheltenham and hear speeches by senior union officials, many of whom are currently embroiled in long-running disputes with the Government."
    },
    {
        "url": "https://arynews.tv/ctd-arrests-terrorist-of-banned-outfit-in-jamshoro/",
        "title": "CTD arrests terrorist of banned outfit in Jamshoro",
        "description": "As per details, CTD has foiled a terrorist attack in Jamshoro ahead of the <b>general election</b> 2024. The operation was conducted by the CTD Hyderabad, arrested the terrorist and recovered 600 kg explosives, a detonator, anti-state pamphlets, and banners from ..."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-south-carolina-clyburn-trump-democrats/88e19e3a-bcd3-11ee-b176-fe5fd794e716_story.html",
        "title": "Biden returns to South Carolina to show his determination to win back Black voters in 2024",
        "description": "President Joe Biden is spending the weekend in South Carolina, intent on driving home two messages: He’s loyal to the state that saved his campaign in 2020 and he’s determined to win back Black voters"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/donald-trump-must-pay-e-jean-carroll-83-3m-in-defamation-case/",
        "title": "Donald Trump must pay E Jean Carroll $83.3m in defamation case",
        "description": "Donald Trump has been ordered to pay $83.3m in a defamation case to a woman who accused him of sexual assault - with the former US president saying her allegation was a lie."
    },
    {
        "url": "https://www.usnews.com/news/best-states/tennessee/articles/2024-01-26/bipartisan-tennessee-proposal-would-ask-voters-to-expand-judges-ability-to-deny-bail",
        "title": "Bipartisan Tennessee Proposal Would Ask Voters to Expand Judges&#39; Ability to Deny Bail",
        "description": "A bipartisan group of Tennessee lawmakers have announced support for a proposed constitutional amendment that would give judges more latitude to hold someone without bail before trial for certain viol"
    },
    {
        "url": "https://www.huffpost.com/entry/joe-kent-capitol-riot-defendant-carlos-ayala_n_65b31315e4b014b873b094c0",
        "title": "MAGA Republican Joe Kent Got Donations From Alleged Jan. 6 Rioter",
        "description": "Joe Kent, a right-wing Republican who is vying for a rematch against Rep. Marie Gluesenkamp Perez (D-Wash.), received $8,600 in campaign donations from an accused Jan. 6, 2021, U.S. Capitol rioter facing felony and misdemeanor charges."
    }
]