[
    {
        "url": "https://www.thetimes.co.uk/article/rishi-sunak-will-not-ask-boris-johnson-to-help-on-campaign-trail-wxdj3drj5",
        "title": "Rishi Sunak will not ask Boris Johnson to help on campaign trail",
        "description": "Prime minister has no plans to reach out to his predecessor, despite allies making it clear that former leader is waiting for a ‘personal approach’"
    },
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/12/australia-politics-live-offshore-detention-richardson-review-home-affairs-clare-o-neil-peter-dutton-anthony-albanese-question-time?page=with:block-65c94aa58f087c3c326277d1",
        "title": "Australia politics live: Barnaby Joyce confesses to ‘big mistake’ over Canberra footpath incident",
        "description": "Follow live"
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/12/president-urges-respect-for-public-mandate/",
        "title": "President urges respect for public mandate",
        "description": "Says people in election &#39;have not only spoken but shouted out their will&#39;ISLAMABAD: Pakistan President Arif Alvi on Sunday said on Sunday that a &quot;true mandate&quot; is essential to steer the countr"
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/11/michael-gove-says-no-fault-evictions-will-be-banned-this-year",
        "title": "Michael Gove says no-fault evictions will be banned this year",
        "description": "UK housing minister promises section 21 evictions in England will have ended by time of general election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/11/sunak-must-swallow-some-pride-bring-back-boris-kwarteng/",
        "title": "Sunak must swallow some pride and bring back Boris, says Kwarteng",
        "description": "Rishi Sunak should “swallow some pride” and bring back Boris Johnson to help boost the Tories’ electoral fortunes, ex-chancellor Kwasi Kwarteng has said. Mr Kwarteng, who is quitting Parliament at the general election, also said the Prime Minister needed to “work on his outreach with backbenchers” to prevent more from standing down."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13070949/Young-people-abandon-democracy-afford-homes-warns-Michael-Gove.html",
        "title": "Young people may &#39;abandon democracy&#39; if they can&#39;t afford homes, warns Michael Gove as he vows to build tens of thousands of homes in cities and ban &#39;no fault&#39; evictions before ...",
        "description": "The Housing Secretary said he is doing everything he can &#39;short of laying siege&#39; to the Chancellor&#39;s home to persuade him to put more money into housing in the spring Budget."
    },
    {
        "url": "https://www.ft.com/content/58a7ddaa-28cd-4950-a53b-f9f52c699dd2",
        "title": "Michael Gove promises to bring in ban on no-fault evictions before <b>election</b>",
        "description": "Levelling-up secretary woos younger voters with pledge to put long-delayed plan in place with investment in court system"
    },
    {
        "url": "https://www.newsandstar.co.uk/news/national/24112496.trump-putting-safety-us-troops-allies-risk-says-nato-chief/",
        "title": "Trump is putting safety of US troops and allies at risk, says Nato chief",
        "description": "Mr Trump had said he would allow Russia ‘to do what it wanted’ to any Nato country that did not spend its fair share on defence."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/24112426.pm-bring-back-boris-johnson-says-kwasi-kwarteng/",
        "title": "PM should bring back Boris Johnson, says Kwasi Kwarteng",
        "description": "Rishi Sunak should be &quot;swallowing some pride&quot; and bringing back Boris Johnson to help boost the Tories&#39; electoral"
    },
    {
        "url": "https://inews.co.uk/news/world/biden-counsel-political-adviser-sister-2900985",
        "title": "After tough week, Biden seeks counsel in de facto political adviser – his sister",
        "description": "Speculation has grown over the future of Biden&#39;s re-election campaign after his unscheduled lunch with Valerie Biden Owens, his influential sibling"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/trump-johnson-james-graham-politics-b2493681.html",
        "title": "Top playwright blames Boris Johnson and Donald Trump for ‘madness’ in modern politics",
        "description": "Britain’s top political playwright James Graham has accused Boris Johnson and Donald Trump of taking politics to “a new level of madness”. Graham, who wrote the hit TV drama about Brexit, The Uncivil War, starring Benedict Cumberbatch, is renowned for his even-handed approach and for avoiding revealing his own political stance."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/more-than-100-migrants-cross-channel-in-three-small-boats/",
        "title": "More than 100 migrants cross Channel in three small boats",
        "description": "A total of 124 migrants on board three small boats made the dangerous crossing of the English Channel on Saturday, the Home Office has confirmed. The latest arrivals bring the total for the year to 1,506 which is down from the 2,072 by the same point in 2023 but up from 1,339 in 2022."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68266845",
        "title": "Pakistan <b>election</b>: Final results give Khan-backed candidates lead",
        "description": "Both Mr Khan&#39;s party, which was barred from taking part, and his rival Nawaz Sharif are vying to form a government."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24112408.sunak-swallow-pride-bring-back-johnson-says-kwarteng/",
        "title": "Sunak should ‘swallow some pride’ and bring back Johnson, says Kwarteng",
        "description": "Rishi Sunak should be “swallowing some pride” and bringing back Boris Johnson to help boost the Tories’ electoral fortunes, ex-chancellor Kwasi Kwarteng has said."
    },
    {
        "url": "https://edition.cnn.com/2024/02/11/politics/new-york-democrats-special-election-3rd-district/index.html",
        "title": "New York Democrats are worried about Tuesday’s special <b>election</b>. They have good reason to be",
        "description": "How bad were the 2022 midterm elections for Democrats in New York? One way to explain it: Republican George Santos’ victory in the state’s 3rd Congressional District might have been the highlight of their year."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/by-election-rules-azhar-ali-b2494375.html",
        "title": "Why a parliamentary candidate can’t be removed by a party in the weeks up to an <b>election</b>",
        "description": "The withdrawal notice must be signed by the candidate, attested by a witness and delivered by 4pm on the 19th working day before the poll. In this instance, since the by-election is on the 29 Feburary, the notice would have to have been delivered by 2 February. The short answer is you can’t."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071357/Fury-Labour-frontbencher-Lisa-Nandy-pictured-conspiracy-theorist-Rochdale-candidate.html",
        "title": "Fury as Labour frontbencher Lisa Nandy is pictured with conspiracy theorist Rochdale candidate Azhar Ali hours after he is forced to apologise for claiming Israel allowed Hamas ...",
        "description": "Shadow international development minister Lisa Nandy was photographed at an event alongside Azhar Ali hours after he apologised for claiming Israel allowed Hamas to kill 1,400 Jews on Oct 7."
    },
    {
        "url": "https://www.ft.com/content/1d5df29b-c0e1-470d-8abf-50c33cd33641",
        "title": "Labour by-<b>election</b> candidate sparks fresh row over antisemitism",
        "description": "Rochdale hopeful was recorded claiming Israel allowed October 7 attacks to take place to justify Gaza invasion"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68268817",
        "title": "Trump on Nato: Dangerous talk at a dangerous time",
        "description": "Mr Trump&#39;s throwaway comments still constitute dangerous talk at a dangerous time, for Nato and for the Western world. Ukraine&#39;s summer 2023 offensive has failed."
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/charlie-whelan-watch-out-for-some-monkey-business-in-genera-341945/",
        "title": "CHARLIE WHELAN: Watch out for some monkey business in <b>General Election</b> polls",
        "description": "• A few weeks ago a number of folk including yours truly gathered in Lossiemouth to commemorate the 100th anniversary of the election of Labour’s first Prime Minister, Ramsay MacDonald, who was born in a tiny old fisherman’s house in the town."
    },
    {
        "url": "https://indianexpress.com/article/india/dont-see-govt-role-in-enforcing-tech-laws-expanding-it-will-diminish-rajeev-chandrasekhar-9156516/",
        "title": "‘Don’t see govt role (in enforcing tech laws) expanding… it will diminish’: Rajeev Chandrasekhar",
        "description": "We are heading towards this year’s <b>general election</b>, which is when a lot of objectionable activity on social media platforms escalates. Are you equipped to deal with that? The <b>Election</b> Commision is determined to make sure there is no intervention of any ..."
    },
    {
        "url": "https://www.livemint.com/industry/for-news-channels-a-pre-election-blessing-in-ram-temple-consecration-11707649429499.html",
        "title": "For news channels, a pre-<b>election</b> blessing in Ram temple consecration",
        "description": "The spike in advertising rates and viewership leading up to and during the ceremony was comparable to a general election counting day"
    },
    {
        "url": "https://www.thesun.co.uk/news/25871798/let-extremist-azhar-ali-rochdale-by-election-starmer-bigots/",
        "title": "No strong leader would let extremist Azhar Ali run in Rochdale by-<b>election</b> – Keir Starmer still embraces bigots",
        "description": "Labour liar IT is appalling that the lying extremist Azhar Ali remains a Labour member, let alone its Rochdale by-election candidate. He is precisely the sort of crank conspiracy theorist Keir"
    },
    {
        "url": "https://apnews.com/article/europe-trump-nato-277d1b30ba6fd0ee37ca626c59ab05ed",
        "title": "NATO leader says Trump puts allies at risk by saying Russia can ‘do whatever the hell they want’",
        "description": "WARSAW, Poland (AP) — The head of the NATO military alliance warned Sunday that Donald Trump was putting the safety of U.S. troops and their allies at risk after the Republican presidential front-runner said Russia should be able to do “whatever the hell they want” to NATO members who don’t meet their defense spending targets."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/even-opposition-now-knows-it-will-be-400-paar-for-nda-pm-modi/articleshow/107607639.cms",
        "title": "Even opposition now knows it will be ‘400 paar’ for NDA: PM Modi",
        "description": "Prime Minister Modi on Sunday exuded confidence that BJP on its own will win more than 370 seats in the coming Lok Sabha elections. Addressing at rall"
    },
    {
        "url": "https://www.nytimes.com/2024/02/11/world/asia/imran-khan-artificial-intelligence-pakistan.html",
        "title": "Imran Khan’s ‘Victory Speech’ From Jail Shows A.I.’s Peril and Promise",
        "description": "It was not the first time the technology had been used in Pakistan’s notably repressive election season, but this time it got the world’s attention."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/ppp-wants-bilawal-as-pm-in-talks-with-sharifs-party/articleshow/107607315.cms",
        "title": "PPP wants Bilawal as PM in talks with Sharif’s party",
        "description": "Pakistan People’s Party (PPP) adopted Sunday a firm stand in negotiations with Pakistan Muslim League-Nawaz (PML-N) led by former three-time PM Nawaz"
    },
    {
        "url": "https://theconversation.com/cute-grandpa-or-authoritarian-in-waiting-who-is-prabowo-subianto-the-favourite-to-win-indonesias-presidential-election-221858",
        "title": "Cute grandpa or authoritarian in waiting: who is Prabowo Subianto, the favourite to win Indonesia’s presidential <b>election</b>?",
        "description": "The general has repeatedly said Indonesia’s democratic system is not working and the country should return to its original 1945 constitution, which could unravel many democratic reforms."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/bidens-legal-team-justice-dept-viewed-cherry-picked-107141037",
        "title": "Biden&#39;s legal team went to Justice Dept. over what they viewed as unnecessary digs at his memory",
        "description": "President Joe Biden’s personal attorney said Sunday that they went to both the special counsel and the attorney general to register concerns over what they viewed to be pejorative and unnecessary digs"
    },
    {
        "url": "https://www.washingtonpost.com/world/2024/02/11/pakistan-election-results-khan-lessons/",
        "title": "The powerful lesson behind Pakistan’s stunning <b>election</b> result",
        "description": "This was supposed to be the most predetermined election in Pakistani history,” said Omar Waraich, special advisor at the Open Society Foundations. “Instead, it became a peaceful revolt against the powerful military establishment."
    },
    {
        "url": "https://www.reuters.com/world/european-officials-criticize-trumps-nato-comments-2024-02-11/",
        "title": "Trump&#39;s NATO comments draw scorn, White House calls them &#39;unhinged&#39;",
        "description": "Two European officials criticized Donald Trump on Sunday after comments the former U.S. president made about not protecting NATO allies who aren&#39;t paying enough from a potential Russian invasion."
    },
    {
        "url": "https://www.ludlowadvertiser.co.uk/news/national/24112496.trump-putting-safety-us-troops-allies-risk-says-nato-chief/",
        "title": "Trump is putting safety of US troops and allies at risk, says Nato chief",
        "description": "Mr Trump had said he would allow Russia ‘to do what it wanted’ to any Nato country that did not spend its fair share on defence."
    },
    {
        "url": "https://metro.co.uk/video/michael-gove-promises-no-fault-eviction-ban-general-election-3121491/",
        "title": "Video: Michael Gove promises no-fault eviction ban by next <b>general election</b>",
        "description": "Share this article via messenger Share this article via email Share this article via sms Share this article via flipboard"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865510/124-migrants-make-dangerous-Channel-crossing-on-Saturday",
        "title": "Three boats loaded with 124 migrants make dangerous Channel crossing on Saturday",
        "description": "The latest arrivals brings the total for the year to 1,506 which is down from the 2,072 by the same point in 2023 but up from 1,339 in 2022."
    },
    {
        "url": "https://edition.cnn.com/2024/02/11/politics/nikki-haley-immigration-policy/index.html?ref=mc.news",
        "title": "As governor, Haley took on Obama on immigration. Now she’s fighting Trump",
        "description": "A few months into her first term as governor, Nikki Haley signed one of the strictest immigration bills in the country."
    },
    {
        "url": "https://www.thenational.scot/politics/24111508.treaty-union-says-can-leave--/",
        "title": "Treaty of Union says Scotland can leave – so let’s do it",
        "description": "AS a reader of The National, I find it enjoyable reading the comments from people on all topics but particularly those related to getting"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/11/three-boats-carrying-124-migrants-cross-the-channel/",
        "title": "Three boats carrying 124 migrants cross the Channel",
        "description": "A total of 124 migrants on board three small boats made the dangerous crossing of the English Channel on Saturday, the Home Office has confirmed. The latest arrivals brings the total for the year to 1,506 which is down from the 2,072 by the same point in 2023 but up from 1,339 in 2022."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/michael-gove-government-reform-jeremy-hunt-tories-b2494304.html",
        "title": "Michael Gove promises end to no-fault evictions by next <b>general election</b>",
        "description": "There have been continuous delays to the plan to ban section 21 evictions, first promised by the Tories in 2019."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/housing-secretary-no-fault-evictions-general-election-b2494302.html",
        "title": "Michael Gove pledges to end no-fault evictions before <b>general election</b>",
        "description": "The renters reform bill has been delayed multiple times due to opposition in and outside of the Conservative party"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68267106.amp",
        "title": "No-fault eviction ban by next <b>election</b>, Michael Gove promises",
        "description": "No-fault evictions will be &quot;outlawed&quot; in England by the next general election, Housing Secretary Michael Gove has told the BBC. The Conservatives first promised to end the right of landlords to evict tenants without needing a reason in 2019."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/liz-truss-campaigning-conservative-party-election-reaction_uk_65c8b4e0e4b0fb721d616dc3",
        "title": "Liz Truss Is Back To Door-Knocking For The Conservatives And People Can&#39;t Believe It",
        "description": "Liz Truss was back on the campaign trail for the Conservatives this weekend – and the internet thought it was unbe-leaf-able. The former PM and current backbencher posted a photo of herself on a residential pavement with eight other people on X (formerly Twitter ), on Saturday."
    },
    {
        "url": "https://inews.co.uk/news/government-delays-uk-energy-summit-2899716?ico=related_stories",
        "title": "Government delays ‘essential’ energy summit by a year despite 1.5°C warning",
        "description": "The London Energy Security Conference - designed to protect consumers from spikes in bills - has been pushed to 2025 amid a bumper election year"
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/national/24112021.pope-president-embrace-francis-canonises-argentinas-first-female-saint/",
        "title": "Pope and president embrace as Francis canonises Argentina’s first female saint",
        "description": "Argentina’s libertarian president, Javier Milei, sat in the front row in St Peter’s Basilica during the Mass to declare Mama Antula a saint."
    },
    {
        "url": "https://www.ft.com/content/ad0b201d-c761-42ba-be75-a66a8d6fed82",
        "title": "‘Hemmed in’: Labour stores up trouble with long list of tax pledges",
        "description": "Party risks being forced to embrace current trajectory of brutal spending cuts if it wins the election, experts warn"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13069991/Rishi-Sunak-urged-cut-stamp-duty-March-Budget.html",
        "title": "Rishi Sunak urged to cut stamp duty in March Budget to give voters &#39;immediate&#39; benefit ahead of the next <b>General Election</b>",
        "description": "The tax cut is a &#39;golden opportunity&#39; to win back voters, senior Conservative MP and former Housing Secretary Robert Jenrick argues."
    },
    {
        "url": "https://news.yahoo.com/finland-elects-president-geopolitical-landscape-063210258.html",
        "title": "Former PM Stubb wins Finland presidential <b>election</b>",
        "description": "Former conservative prime minister Alexander Stubb won Sunday&#39;s Finnish presidential election, assuming a role that has gained importance in light of the country&#39;s NATO membership and rising tensions with neighbouring Russia."
    },
    {
        "url": "https://www.marketwatch.com/story/u-s-allies-fear-a-trump-win-would-continue-to-destabilize-the-world-94d48e10",
        "title": "U.S. allies fear a Trump win would continue to destabilize the world",
        "description": "As chances rise of a Joe Biden-Donald Trump rematch in the U.S. presidential election, America’s allies are bracing for a bumpy ride."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan-election-results-2024-live-updates-nawaz-sharif-imran-khan-army-bilawal-bhutto-zardari/liveblog/107607361.cms",
        "title": "Pakistan <b>Election</b> Results 2024 Live Updates: PPP demands Prime Minister post for Bilawal Bhutto Zardari",
        "description": "As Pakistan&#39;s national election has thrown up a fractured mandate, making way for the hung assembly, parties in the f"
    },
    {
        "url": "https://finance.yahoo.com/news/pekka-ala-pietil-proposed-sap-192000484.html",
        "title": "Pekka Ala-Pietilä Proposed by SAP Supervisory Board as Designated Successor to Chairman Hasso Plattner",
        "description": "The Supervisory Board of SAP SE (NYSE: SAP) has nominated Mr. Pekka Ala-Pietilä to stand for election as a new member of the Supervisory Board and proposes Mr. Ala-Pietilä as the designated successor to Chairman Prof."
    },
    {
        "url": "https://www.economist.com/international/2024/02/11/the-2024-democracy-test",
        "title": "The 2024 democracy test",
        "description": "In one respect democracy is being modernised: a technological revolution is taking place as short-form videos and group messaging transform political campaigning around the world (artificial intelligence,"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/11/virginia-governor-voting-2024/72439772007/",
        "title": "Virginia governor&#39;s rollback of rights restoration has disenfranchised thousands of voters",
        "description": "Virginia&#39;s governors have used the commonwealth&#39;s constitution to change restoration of rights requirements. Now, lawmakers and advocates hope to amend the constitution to take the power out of the governor&#39;s hands."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68266845",
        "title": "Pakistan <b>election</b>: Pact may shut out Imran Khan supporters",
        "description": "The final results in Pakistan&#39;s general election have put independent candidates backed by jailed ex-PM Imran Khan&#39;s PTI party in the lead. Independents won 101 of the National Assembly seats. BBC analysis shows 93 of them went to PTI-backed candidates."
    },
    {
        "url": "https://www.nytimes.com/2024/02/11/world/asia/pakistan-election.html",
        "title": "<b>Election</b> Shocker in Pakistan: Where the Country Goes From Here",
        "description": "As supporters of Imran Khan lodge complaints of vote rigging in hopes of increasing their lead, his opponents are jockeying to form a government."
    },
    {
        "url": "https://apnews.com/article/us-election-biden-trump-uneasy-allies-36e0d605c5fadd2887f6fe4c60f945a1",
        "title": "American allies worry the US is growing less dependable, whether Trump or Biden wins",
        "description": "With a divided electorate and gridlock in Congress, the next American president could easily become consumed by manifold challenges at home."
    },
    {
        "url": "https://www.politico.com/news/2024/02/11/biden-defends-nikki-haleys-husband-bashes-trump-attack-00140862",
        "title": "Biden defends Nikki Haley’s husband, bashes Trump",
        "description": "President Joe Biden on Sunday defended Nikki Haley’s husband, after former President Donald Trump dragged the former South Carolina governor’s spouse into the swirl of personal attacks he lobbed against her over the weekend."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/nikki-haley-challenges-donald-trump-home-turf-south-107127533",
        "title": "Haley challenges Trump on her home turf in South Carolina as the Republican primary looms",
        "description": "With two weeks to go before the South Carolina Republican primary, Nikki Haley is trying to challenge Donald Trump on her home turf while the former president tries to quash his last major rival’s nar"
    },
    {
        "url": "https://www.newsweek.com/joe-biden-betting-odds-falling-sharply-after-miserable-week-1868874",
        "title": "Joe Biden Betting Odds Falling Sharply After Miserable Week",
        "description": "Biden&#39;s age once again came to the forefront following a special counsel report, which the White House strongly condemned."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4461575-trump-says-theres-no-way-taylor-swift-will-endorse-biden/",
        "title": "Trump says ‘there’s no way’ Taylor Swift will endorse Biden",
        "description": "Former President Trump on Sunday poured cold water over the idea global superstar Taylor Swift would endorse President Biden amid swirling speculation the incumbent’s campaign team is trying"
    },
    {
        "url": "https://finance.yahoo.com/video/pakistan-jailed-ex-leader-imran-171000535.html",
        "title": "Pakistan’s Jailed Ex-Leader Imran Khan’s Party Calls for Protests",
        "description": "Independent candidates who were mostly for the party of the jailed opposition leader Imran Khan won the most seats in Pakistan’s general election. The party called for protests against the authorities and demanded to form a government this weekend."
    },
    {
        "url": "https://news.yahoo.com/best-stuff-week-defied-description-164343642.html",
        "title": "Our Best Stuff From a Week That Defied Description",
        "description": "Oral arguments at the Supreme Court, a ruling from the D.C. Circuit Court of Appeals, and a damaging special counsel report for Joe Biden."
    },
    {
        "url": "https://www.foxnews.com/media/fellow-80-year-olds-weigh-in-president-bidens-age-abilities-ahead-election-you-dont-bounce-back",
        "title": "83-year-old retired nurse Jan Kallheim told the NYT, &#39;you don&#39;t bounce back&#39;",
        "description": "Several 80-year olds weighed in on questions surrounding President Biden&#39;s ability to serve another term in the White House following the release of the Special Counsel report."
    },
    {
        "url": "https://nypost.com/2024/02/11/opinion/biden-hides-his-climate-agenda-from-congress-and-voters/",
        "title": "Biden hides his climate agenda —from Congress and voters",
        "description": "With the departure of John Kerry as “climate czar,” President Biden has announced that he will be replaced by John Podesta. Podesta, however, will take the power and not the title."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/protests-rock-pakistan-as-imran-khans-pti-alleges-vote-rigging-in-general-elections/articleshow/107605185.cms",
        "title": "Protests rock Pakistan as Imran Khan&#39;s PTI alleges vote rigging in <b>general</b> <b>elections</b>",
        "description": "Protests rock Pakistan as Imran Khan&#39;s PTI alleges vote rigging in general elections. Pakistan Tehreek-e-Insaf (PTI) workers initiated protests in various cities across Pakistan, opposing alleged electoral irregularities in the general elections held on February 8."
    },
    {
        "url": "https://www.yahoo.com/lifestyle/meet-survivor-46-cast-moriah-150000742.html",
        "title": "Meet the &#39;Survivor 46&#39; Cast! Moriah Gaynor Brings the Power of &quot;Subtle Influence&quot; from Politics to the Island",
        "description": "Moriah Gaynor. Despite being a self-proclaimed &quot;klutz,&quot; Moriah Gaynor balances a lot in her life. The 28-year-old has both a hyper-organized mind and a resume spanning multiple st"
    },
    {
        "url": "https://www.wsj.com/politics/elections/nato-leader-blasts-trumps-suggestion-he-would-encourage-russian-invasion-of-u-s-allies-3eb96a10",
        "title": "NATO Leader Blasts Trump’s Suggestion He Would Encourage Russian Invasion of U.S. Allies",
        "description": "NATO remains ready and able to defend all allies,” NATO Secretary-General Jens Stoltenberg said in a rebuke to the presidential candidate’s comments."
    },
    {
        "url": "https://www.theatlantic.com/ideas/archive/2024/02/pay-attention-politics-doomscrolling-civic-duty/677403/",
        "title": "Apathy Loses",
        "description": "Those of us who feel that way may be tempted to tune out this election year. To participate in politics is to encounter many otherwise lovely people at their most upset, angry, and uncharitable. To withdraw from it is, for many, to avoid stress, annoyance, and maybe even negative psychological outcomes associated with daily political engagement."
    },
    {
        "url": "https://www.newsweek.com/former-trump-official-issues-ominous-warning-about-potential-second-term-1868857",
        "title": "Former Trump Official Issues Ominous Warning About Potential Second Term",
        "description": "Mark Esper, who previously served as secretary of defense under former President Donald Trump, expressed grave concern on Saturday over the prospect of his former boss being reelected in November."
    },
    {
        "url": "https://www.usnews.com/news/politics/articles/2024-02-11/loser-biden-uses-trigger-words-to-bait-trump",
        "title": "‘Loser’: Biden Uses Trigger Words to Bait Trump",
        "description": "Biden, who long avoided referring to Trump by name, has taken to openly mocking his predecessor – even regularly calling him a ‘loser’ in public comments."
    },
    {
        "url": "https://www.usnews.com/news/best-countries/articles/2024-02-11/indonesias-upcoming-election-is-a-test-of-its-democracy",
        "title": "Indonesians Head to the Polls Amid a Slide Toward Autocracy",
        "description": "The U.S. sees Indonesia’s democracy as critical to regional stability, yet the election takes place against a backdrop of increasing democratic fragility."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/11/bring-back-boris-johnson-kwasi-kwarteng-tells-rishi-sunak?ref=mc.news",
        "title": "Bring back Boris Johnson, Kwasi Kwarteng tells Rishi Sunak",
        "description": "Ex-chancellor calls on Sunak to ‘swallow some pride’ and bring back ‘electoral force’ that is former PM"
    }
]