[
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/22/biden-border-crackdown-migrants-us-latest-trump-republicans-congress-updates?page=with:block-65d7a86b8f086f23f6db15cd",
        "title": "Biden calls ‘disregard’ for reproductive rights in conservative push ‘outrageous’ – as it happened",
        "description": "Biden says Alabama embryo ruling is a ‘direct result of the overturning of Roe v Wade’"
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-23/south-korea-hospitals-red-alert-doctors-protest-government/103501566",
        "title": "South Korea hospitals on red alert as doctors ramp up protests and patients urge resolution",
        "description": "Three days of a mass walkout by trainee doctors in South Korea has plunged the country&#39;s hospitals into red alert, causing nationwide delayed surgeries and emergency rooms turning away patients."
    },
    {
        "url": "https://www.latimes.com/world-nation/story/2024-02-22/dueling-pro-trump-factions-in-michigan-throw-the-swing-states-republicans-into-disarray",
        "title": "Dueling pro-Trump factions in Michigan throw the swing state’s Republicans into disarray",
        "description": "Pro-Trump factions in Michigan and elsewhere are fighting over how best to represent his &#39;Make America Great Again&#39; movement."
    },
    {
        "url": "https://thehill.com/opinion/international/4483278-what-the-u-s-u-k-relationship-would-look-like-with-keir-starmer-in-power/",
        "title": "What the U.S.-U.K. relationship would look like with Keir Starmer in power",
        "description": "Unless there is a seismic political upset, the Labour Party will win in Britain after 14 years in opposition, and Keir Starmer will become prime minister. What can America expect of him, and how would he react to a Democratic or a Republican triumph?"
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68349957?src_origin=BBCS_BBC",
        "title": "Sunak says Speaker&#39;s actions on Gaza ceasefire vote &#39;very concerning&#39;",
        "description": "The SNPs motion calls for an “immediate ceasefire” in Gaza, saying it is the “only way to stop the slaughter of innocent civilians”. It also condemns the “collective punishment” of Palestinians. If passed, the opposition day motion would be non-binding on the government"
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/22/biden-border-crackdown-migrants-us-latest-trump-republicans-congress-updates?page=with:block-65d7ad5d8f086f23f6db15f1",
        "title": "Biden calls ‘disregard’ for reproductive rights in conservative push ‘outrageous’ – live",
        "description": "Biden says Alabama embryo ruling is a ‘direct result of the overturning of Roe v Wade’"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869792/reform-uk-conservative-general-election-polling",
        "title": "Reform UK surge in bombshell poll as gap closes with Tories on brink of landslide defeat",
        "description": "Reform UK has narrowed the gap with the Conservatives in a bombshell new poll, that saw the Tories sink to new lows in the latest voting intention poll. The latest YouGov/Times poll shows the Tories on 20 percent, a four percentage point drop from the last poll on February 14-15."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68354552",
        "title": "Kettering Lib Dem candidate steps down over stammer abuse",
        "description": "Mr Nelson was first selected as the Lib Dem candidate for Kettering in 2010. He later ran again in the 2019 election, both times finishing in the top three candidates, reported the Local Democracy Reporting Service. He said the &quot;final straw&quot; had come in August when a politician mocked his stammer in the street."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/22/lib-dem-manifesto-2024-ed-davey-policy-predictions/",
        "title": "Lib Dem manifesto 2024: Ed Davey’s policy predictions for the <b>general election</b>",
        "description": "The party is expected to campaign for closer ties with the EU as it tries to regain status as third largest party in Westminster"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13113593/Ron-DeSantis-rules-Trumps-vice-president.html",
        "title": "Ron DeSantis rules OUT being Trump&#39;s vice president: Florida governor tells supporters Donald has &#39;too much baggage&#39;",
        "description": "Ron DeSantis says he isn&#39;t interested in being Donald Trump&#39;s vice president after the 2024 frontrunner didn&#39;t rule out the Florida governor joining his general election ticket."
    },
    {
        "url": "https://edition.cnn.com/2024/02/22/politics/cpac-trump-republican-president-election/index.html",
        "title": "CPAC or TPAC? This year’s conservative gathering is all about Trump",
        "description": "This year’s Conservative Political Action Conference, which began Wednesday, is scheduled to be a four-day fete with one man at the center: Donald Trump."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68349957/page/3",
        "title": "50 MPs call for Lindsay Hoyle to quit as Speaker after Gaza vote chaos",
        "description": "&quot;Today was a chance for Parliament to unite and speak with one voice on the horrendous situation in Gaza and Israel. It was in that spirit that Labour put forward an amendment calling for an immediate humanitarian ceasefire,&quot; the Labour leader said in a statement. He called it a &quot;serious plan&quot; for an incredibly serious situation."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-news-2024-today-supreme-court-b2500352.html?page=4",
        "title": "Trump threatened by New York AG over payment of civil fraud fine: Live",
        "description": "Letitia James issues warning to Trump after he struggles with questions on Navalny, illegal immigration and classified documents at Fox town hall in South Carolina"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/22/rishi-sunak-lee-anderson-lindsay-hoyle-gaza-vote-labour/",
        "title": "Politics latest news: Sunak criticises Hoyle’s ‘very concerning’ actions over Gaza vote",
        "description": "Sir Lindsay Hoyle was put under “intolerable pressure” by the Labour Party, Sir Iain Duncan Smith claimed as the Commons Speaker fights for his political life. Tory and SNP MPs have launched an attempt to oust Sir Lindsay after his controversial handling of yesterday’s debate on a Gaza ceasefire plunged the Commons into chaos."
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/24133290.opinion-suffolk-gears-years-general-election/",
        "title": "Opinion: Suffolk gears up for this year&#39;s <b>general election</b>",
        "description": "The party held Wellingborough from 1997-2005 and Kingswood from 1997-2010. Kingswood will cease to exist in the <b>general election</b> - it is being split four was in boundary changes - and what will happen to Labour&#39;s 6,500 majority in Wellingborough at the ..."
    },
    {
        "url": "https://www.bbc.co.uk/sport/rugby-union/68362720",
        "title": "Six Nations 2024: Why Wales are such underdogs in Dublin",
        "description": "Statistics show the scale of the challenge facing Wales against defending Six Nations champions Ireland on Saturday."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13111525/Queenslands-health-minister-Covid-pandemic-Yvette-DAth-announces-resignation-politics-election.html",
        "title": "Queensland&#39;s health minister during the Covid pandemic Yvette D&#39;Ath announces her resignation from politics at next <b>election</b>",
        "description": "Queensland Attorney-General Yvette D&#39;Ath - who became a national figure as the state&#39;s health minister during the Covid pandemic - will quit politics and not contest the next state election."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/nigel-farage-religious-sectarianism-cpace-b2500339.html",
        "title": "Nigel Farage tells right-wing US event that ‘religious sectarianism’ is new threat in UK",
        "description": "Former Brexit Party leader tells CPAC event that ‘by the 2029 general election, we will have a radical Islamic party represented in Westminster’"
    },
    {
        "url": "https://metro.co.uk/2024/02/21/happened-house-commons-gaza-ceasefire-vote-chaos-explained-20323752/?ico=trending-module_author_katie-boyden_item-2",
        "title": "Chaos in the Commons: Who is Sir Lindsay Hoyle and why is he facing calls to resign?",
        "description": "Sir Lindsay has been a member of the Labour party since a young age, and was chosen to stand as the Labour candidate for the Chorley constituency at the 1997 <b>general election</b>. He won the <b>election</b> with a majority of 9,870, becoming the first Labour MP for ..."
    },
    {
        "url": "https://www.yahoo.com/news/primary-2024-candidates-familiar-ventura-183146946.html",
        "title": "Primary 2024: Candidates are familiar, but Ventura County&#39;s 3rd District looks different",
        "description": "The borders and demographics of the 3rd District have changed in ways that could make this election tougher than the last for Supervisor Kelly Long."
    },
    {
        "url": "https://www.foxnews.com/politics/justice-department-taps-former-kamala-harris-adviser-first-ever-artificial-intelligence-officer",
        "title": "Justice Department taps former Kamala Harris adviser as 1st-ever artificial intelligence officer",
        "description": "Vice President Kamala Harris&#39; former adviser, Jonathan Mayer, was named the Justice Department&#39;s first chief AI officer and will advise AG Merrick Garland."
    },
    {
        "url": "https://thehill.com/newsletters/morning-report/4482447-gop-biden-impeachment-probe-teeters/",
        "title": "Morning Report — GOP’s Biden impeachment probe teeters",
        "description": "House Republicans are pursuing impeachment of President Biden. By one constitutional yardstick, they’ve been challenged to produce evidence of high crimes or misdemeanors. In an election year,"
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/22/trump-second-term-extremism/",
        "title": "What might happen after another inauguration of Donald Trump",
        "description": "As a general rule, Donald Trump’s articulated plans for his presidency are nebulous. This is partly tactical; he has in the past suggested that offering specifics ties his hands in ways he doesn’t like."
    },
    {
        "url": "https://www.cnn.com/2024/02/22/politics/biden-congress-republicans-strom-thurmond/index.html",
        "title": "Biden says Republicans in Congress are worse than former segregationist senator",
        "description": "President Joe Biden called out Republicans in Congress as “the party of chaos and division” and said they are “worse” than Strom Thurmond, a former South Carolina senator who ran for president as a segregationist in 1948."
    },
    {
        "url": "https://www.politico.com/news/2024/02/22/biden-gaza-arab-american-voters-michigan-00142596",
        "title": "Biden’s ‘uncommitted’ problem in Michigan worries Democrats looking to November",
        "description": "But inside the critical battleground state of Michigan, some Democrats fear the president’s team doesn’t appreciate the depths of discontent from Arab American and young voters over Biden’s response to the Israel-Hamas war. And they worry that even a widely expected protest vote in next week’s primary won’t give them the wakeup call that’s needed."
    },
    {
        "url": "https://news.yahoo.com/two-newcomers-enter-race-represent-140036626.html",
        "title": "Two newcomers enter race to represent fast-growing north Palm Desert on city council",
        "description": "Two first-time candidates are running to represent fast-growing north Palm Desert on the city council. There are still months to enter the race."
    },
    {
        "url": "https://www.economist.com/britain/2024/02/22/a-memo-to-britains-chancellor-jeremy-hunt",
        "title": "A memo to Britain’s chancellor, Jeremy Hunt",
        "description": "Jeremy Hunt, the chancellor of the exchequer, presents what should be the last budget before the general election. The governing Conservatives trail Labour by 20 points in the opinion polls. His backbenchers are demanding tax cuts in a bid to close the gap,"
    },
    {
        "url": "https://www.forbes.com/sites/zengernews/2024/02/22/pakistan-election-suggests-women-playing-a-new-role-in-public-life/",
        "title": "Pakistan <b>Election</b> Suggests Women Playing A New Role In Public Life",
        "description": "Against the backdrop of this pivotal election, one of the most striking phenomena was the increased participation of women in the electoral process."
    },
    {
        "url": "https://news.yahoo.com/news/lose-ballot-california-primary-election-130000197.html",
        "title": "Lose your ballot for California’s primary <b>election</b>? Here’s what you need to know",
        "description": "A reader asked The Sacramento Bee if losing your ballot for March’s primary election will prevent you from getting one in the future."
    },
    {
        "url": "https://www.nytimes.com/2024/02/22/us/politics/biden-michigan-gaza.html",
        "title": "Will Biden’s Gaza Stance Hurt Him in 2024? Michigan Is the First Test.",
        "description": "With the state’s primary election set to gauge Democratic anger over the president’s position on Israel, some of his supporters worry about lasting political fallout."
    },
    {
        "url": "https://www.theatlantic.com/ideas/archive/2024/02/republican-primaries-south-carolina-trump-haley/677526/",
        "title": "The Case for Nikki Haley",
        "description": "“Nikki Haley is leading President Biden by 13 points in a new poll of a hypothetical head-to-head match-up,” The Hill reported earlier this month. In other words, she can win the general election, and she can do that without bringing out the worst in all of us."
    },
    {
        "url": "https://www.businessinsider.com/history-select-presidential-candidates-biden-primary-system-elections-2024-2",
        "title": "The chaotic history of how we elect presidential candidates",
        "description": "Because of how we pick presidential candidates using a primary system, Democrats are likely stuck with Biden as their candidate."
    },
    {
        "url": "https://www.latimes.com/california/story/2024-02-22/2024-california-senate-election-women-female-katie-porter-barbara-lee-dianne-feinstein",
        "title": "California’s streak of female senators may be ending — and women appear to be a reason",
        "description": "At least one woman has represented California in the U.S. Senate for the last three decades. That streak may come to an end after the 2024 Senate election."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/columnists/2024/02/22/testing-the-trope-about-how-food-gas-prices-motivate-voters-opinion/72635964007/",
        "title": "Testing the trope about how food and gas prices influence voters | Opinion",
        "description": "In 2022 voting, the journalistic conventional wisdom of inflation being a predictive factor in elections did not hold true."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/columns/2024/02/22/as-usual-indianas-presidential-primary-will-probably-mean-nothing/72673321007/",
        "title": "Colwell: Indiana&#39;s presidential primary is no contest",
        "description": "Indiana’s presidential primary on May 7 is expected to mean nothing in national politics, coming as it will after the vast majority of delegates for the Republican and Democratic Conventions already have been selected."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/22/trump-letitia-james-fraud-lawsuit-judgment-verdict/29968d9c-d140-11ee-ac8b-765284b5203e_story.html",
        "title": "New York AG says she’ll seize Donald Trump’s property if he can’t pay $454 million civil fraud debt",
        "description": "Donald Trump could be at risk of losing some of his prized properties if he can’t pay his staggering New York civil fraud penalty"
    },
    {
        "url": "https://finance.yahoo.com/news/nestl-proposes-geraldine-matchett-independent-062000605.html",
        "title": "Nestlé proposes Geraldine Matchett as new independent member of its Board of Directors",
        "description": "Ad hoc announcement pursuant to Art. 53 LR] This press release is also available in Français (pdf) and Deutsch (pdf) ............. Nestlé proposes Geraldine Matchett as new independent member of its Board of Directors Nestlé announced today that it proposes Geraldine Matchett,"
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-22/qld-yvette-d-ath-to-quit-politics/103497526",
        "title": "Queensland Attorney-<b>General</b> Yvette D&#39;Ath to quit politics at the end of the year",
        "description": "Yvette D&#39;Ath says after almost 17 years in state and federal politics, she needs to find more balance in her life and won&#39;t be contesting the October election."
    },
    {
        "url": "https://www.cbc.ca/news/canada/calgary/danielle-smith-alberta-budget-heritage-fund-billions-analysis-1.7121703",
        "title": "Danielle Smith bets Albertans would rather save than spend — finally",
        "description": "Premier Danielle Smith is shelving a promised tax cut and reining in program spending. In exchange, she&#39;s thinking big about saving in Alberta&#39;s Heritage Fund."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/kanpur/shyam-narayan-singh-elected-as-new-president-of-lawyers-association-kanpur/articleshow/107898940.cms",
        "title": "Shyam Narayan Singh elected as new prez of Lawyer Association",
        "description": "Shyam Narayan Singh has been elected as the new president of the Lawyers Association in Kanpur. Abhishek Tiwari has been elected as the general secretary. Read more about their election and plans for the future."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/ranchi/psu-officials-urged-to-generate-voter-awareness-a-news-article/articleshow/107898257.cms",
        "title": "PSU officials urged to generate voter awareness",
        "description": "A Systematic Voters&#39; Education and Electoral Participation (SVEEP) cell has amplified its endeavours in Bokaro to increase the voting percentage in the upcoming Lok Sabha general elections of 2024. PSU officials were urged to generate voter awareness and ensure full registration of their officials and employees and their families in the voter list."
    },
    {
        "url": "https://www.usnews.com/news/top-news/articles/2024-02-21/lara-trump-says-rnc-needs-to-raise-500-million-does-not-rule-out-paying-trump-legal-fees",
        "title": "Lara Trump Says RNC Needs to Raise $500 Million, Sees Interest in Paying Trump Legal Fees",
        "description": "NORTH CHARLESTON, South Carolina (Reuters) - Lara Trump, who Donald Trump has endorsed to be the new co-chair of the Republican National Committee, said on Wednesday that the organization needed to raise $500 million for the 2024 general election and did not rule out using raised funds to pay her father-in-law&#39;s mounting legal fees."
    },
    {
        "url": "https://www.politico.com/news/2024/02/21/biden-trump-campaign-finance-00142555",
        "title": "The presidential money machine is stalling out, and there are warning signs for both Biden and Trump",
        "description": "Trump is spending significant amounts on legal services, while Biden is lagging behind both Trump and Obama as an incumbent."
    },
    {
        "url": "https://www.yahoo.com/news/march-primary-texas-often-more-003258348.html",
        "title": "The March primary in Texas is often more important than the November <b>general election</b>",
        "description": "AUSTIN (KXAN) — Early voting is now underway for the Texas primaries on March 5. Voters will be choosing their party nominees for everything from the president of the United States to justice of the peace in your local county."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/nikki-haley-presidential-race-trump-b2500108.html",
        "title": "What happens if Nikki Haley drops out of the presidential race?",
        "description": "Nikki Haley, the former South Carolina governor and US ambassador to the United Nations, has been the last remaining challenger to Donald Trump for the Republican Party’s presidential nomination since Ron DeSantis dropped out of the race on Sunday 21 January, just before the New Hampshire primary."
    },
    {
        "url": "https://apnews.com/article/election-pennsylvania-trump-biden-republicans-investigation-e932c95738bace33480a0e6047e01b49",
        "title": "Pennsylvania’s high court throws out GOP lawmakers’ subpoena in 2020 presidential <b>election</b> case",
        "description": "Pennsylvania&#39;s highest court ruled Wednesday that Republican state lawmakers can no longer try to enforce a subpoena for election records they issued in 2021 in a quest inspired by former President Donald Trump’s baseless claims of fraud in the 2020 presidential election."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/trump-abortion-plan-leak-inflamed-campaign-1234973014/",
        "title": "Trump’s Abortion Plan Leak Inflamed His Campaign and Energized Democrats",
        "description": "Donald Trump’s plan for a 16-week, national abortion ban wasn’t supposed to be public. Democrats are ready to pounce."
    }
]