[
    {
        "url": "https://finance.yahoo.com/news/global-education-communities-corp-reports-000000639.html",
        "title": "Global Education Communities Corp. Reports Director <b>Election</b> Results",
        "description": "VANCOUVER, BC / ACCESSWIRE / February 23, 2024 / Global Education Communities Corp. (TSX:GEC)(OTCQX:GECSF) (&quot;GECC&quot;) reports the director election voting results from its annual general meeting held today."
    },
    {
        "url": "https://www.nytimes.com/2024/02/23/us/politics/trump-voting-message-candidate.html",
        "title": "The Race Trump Can’t Disappear Behind",
        "description": "But as Trump has moved closer to becoming the Republican nominee, such a cushion has become harder to maintain. There is barely a primary race for him to disappear behind. And as the race shifts to a new phase, he is creating hurdles his allies wish he would avoid."
    },
    {
        "url": "https://www.thetimes.co.uk/article/who-could-will-replace-rishi-sunak-tory-leader-candidates-conservatives-v88xlwt6m",
        "title": "Who could replace Rishi Sunak? These are the agents of change",
        "description": "Potential Conservative Party leadership candidates are on manoeuvres, hosting drinks and plotting war on spreadsheets and social media while giving Sunak their ‘full support’"
    },
    {
        "url": "https://edition.cnn.com/2024/02/23/politics/gavin-newsom-cnntv/index.html?ref=mc.news",
        "title": "California Gov. Gavin Newsom says Haley is a strong surrogate for Democrats",
        "description": "California Gov. Gavin Newsom joked Friday that Nikki Haley — the onetime South Carolina governor and the last remaining major rival to Donald Trump in the GOP presidential primary — is a strong surrogate for Democrats."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68388232",
        "title": "Trump calls on Alabama to protect availability of IVF treatment",
        "description": "Donald Trump has said he supports the availability of IVF treatment, joining a growing number of Republicans seeking to distance themselves from an Alabama court ruling on the issue. The state&#39;s top court ruled last week that frozen embryos have the same legal rights as children."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119519/james-cleverly-police-power-protect-mps-face-fear.html",
        "title": "James Cleverly: Police must use their powers to protect MPs - the only fear they must face... is the ballot box",
        "description": "The Home Secretary said that security minister Tom Tugendhat had written to chief constables urging them to step up after the Dorset home of Tobias Ellwood was targeted by pro-Palestinian protesters."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/23/election-updates-south-carolina-primary-trump-haley-politics-latest",
        "title": "Trump announces ‘strong support’ for IVF care after Alabama ruling curbing access – as it happened",
        "description": "Polls show Donald Trump tipped to win South Carolina, where Nikki Haley was once governor"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/23/reform-raise-40p-income-tax-threshold-70k/",
        "title": "Reform would raise 40p income tax threshold to £70k",
        "description": "Draft manifesto unveiled by party leader Richard Tice piles pressure on Chancellor to go further with tax cuts in spring Budget"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/23/reform-uk-to-unveil-new-policies-and-election-candidates-at-doncaster-rally",
        "title": "Reform UK to unveil new policies and <b>election</b> candidates at Doncaster rally",
        "description": "Far-right party is trying to capitalise on third place finishes in recent byelections and is cleaning up social media histories of prospective MPs"
    },
    {
        "url": "https://edition.cnn.com/politics/live-news/election-news-south-carolina-02-23-24/index.html",
        "title": "The latest on the 2024 campaign ahead of South Carolina primary",
        "description": "Donald Trump and Nikki Haley are hitting the campaign trail in South Carolina Friday to make their final pitch to voters ahead of the state&#39;s 2024 Republican presidential primary. Follow here for the latest live news updates on the campaign."
    },
    {
        "url": "https://www.ft.com/content/de28864d-bb66-4e38-a31b-6744fc9e2dab",
        "title": "Tories ‘going backwards’ on gender equality target for candidates",
        "description": "About 70% of parliamentary candidates selected so far are male with most having a background in local government"
    },
    {
        "url": "https://www.ft.com/content/21c8ab0e-af39-4ff5-b0da-9ac610fe746f",
        "title": "Democrats are too scared of a contested convention",
        "description": "The odds that this coming August we will have the first Democratic contested convention since 1968 are non-trivial"
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/ukraine-war-us-russia-sanctions-putin-latest-b2501471.html?page=3",
        "title": "Russia-Ukraine latest: US targets Putin’s war machine with more than 500 new sanctions ahead of anniversary",
        "description": "Increased UK exports to third-party countries, such as Kyrgyzstan, suggest Russia are circumventing sanctions to purchase British parts for military equipment"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13117891/Awkward-moment-Rishi-Sunak-Welsh-rugby-banter-falls-flat.html",
        "title": "The awkward moment Rishi&#39;s Welsh banter falls flat: Sunak woos principality Tories with rugby chat about being the hooker in a &#39;political scrum&#39; and insists the team around him ...",
        "description": "The slightly built PM suggested he was a hooker - one of the beefier positions in a XV - for Team Tory as he addressed the party&#39;s spring spring conference in Llandudno."
    },
    {
        "url": "https://www.bbc.com/news/articles/cp9weyvevvjo",
        "title": "MP to retire after 41 years in politics",
        "description": "A Labour MP has announced his retirement after 41 years in politics. Ian Mearns, who represents Gateshead, will be stepping down from his role at the next general election. He said: “I have always been, from the perspective of a trade unionist, speaking up for people’s right to retire. I think it would be hypocritical of me to carry on.&quot;"
    },
    {
        "url": "https://www.bbc.com/news/blogs-the-papers-68377236",
        "title": "Newspaper headlines: &#39;Two years of lunacy&#39; and possible &#39;new Brexit deal&#39;",
        "description": "A variety of stories make the front pages today, including the two-year anniversary of Russia&#39;s invasion of Ukraine."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68377136",
        "title": "Alabama IVF ruling a political gift for Democrats, headache for Republicans",
        "description": "Democrats have already seized on the issue, which could complicate Republican plans to win back suburban women."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-documents-fraud-trial-gofundme-latest-news-b2501136.html?page=2",
        "title": "Trump asks court to dismiss charges accusing him of illegally holding on to classified documents: Live",
        "description": "Letitia James issues warning to Trump after he struggles with questions on Navalny, illegal immigration and classified documents at Fox town hall in South Carolina"
    },
    {
        "url": "https://www.thetimes.co.uk/article/fork-bending-magician-deepfaked-joe-bidens-voice-to-dupe-voters-2zt3vvqxq",
        "title": "Fork-bending magician ‘deepfaked Joe Biden’s voice to dupe voters’",
        "description": "Robocall intended to reduce New Hampshire primary turnout was allegedly at the behest of a campaign operative for Dean Phillips, the president’s challenger"
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/trump-strongly-supports-ivf-calls-alabama-lawmakers-protect-107495724",
        "title": "Trump says he strongly supports IVF after Alabama court ruling puts new pressure on Republicans",
        "description": "Former President Donald Trump says he would “strongly support the availability&quot; of in vitro fertilization for couples and women who are trying to have a baby"
    },
    {
        "url": "https://www.politico.com/news/2024/02/23/porter-list-fire-sale-00143018",
        "title": "‘You must act fast:’ Katie Porter is selling her fundraising list — at a discount",
        "description": "The California Democrat is trying to quickly scoop up cash to spend in the final sprint of her U.S. Senate campaign."
    },
    {
        "url": "https://www.reuters.com/world/us/alabamas-attorney-general-wont-prosecute-ivf-clinics-families-2024-02-23/",
        "title": "Alabama&#39;s attorney <b>general</b> won&#39;t prosecute IVF clinics, families",
        "description": "The Alabama Attorney General&#39;s office had &quot;no intention&quot; of prosecuting providers of in vitro fertilization or families who use their services, it said on Friday after the state&#39;s top court ruled that frozen embryos are considered children."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4486049-trump-rallies-maga-south-carolina-finish-haley/",
        "title": "The Memo: Trump rallies the MAGA base in South Carolina, aiming to finish Haley",
        "description": "Former President Trump rallied a packed, raucous crowd here on Friday afternoon as he sought to deliver a final blow in the battle for the GOP nomination. Around 6,000 people"
    },
    {
        "url": "https://news.yahoo.com/gop-bankrolling-mass-deception-democratic-221535616.html",
        "title": "GOP bankrolling ‘mass deception’ in Democratic primary, Jeff Jackson says. What we know.",
        "description": "A super PAC spending big in the Democratic race for attorney general appears to have ties to Republicans. Here’s what to know before you vote."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-24/dath-miles-queensland-government-upcoming-election/103505546",
        "title": "Queensland Labor&#39;s departure lounge is filling up as Attorney-<b>General</b> Yvette D&#39;Ath announces resignation",
        "description": "Ministerial resignations can spark questions of &quot;rats fleeing a sinking ship&quot;, but aren&#39;t that surprising at this stage in the election cycle."
    },
    {
        "url": "https://www.cnn.com/politics/live-news/election-news-south-carolina-02-23-24/h_d8884de4030ee1132131b42a3b66ea66",
        "title": "The latest on the 2024 campaign ahead of South Carolina primary",
        "description": "Donald Trump and Nikki Haley are hitting the campaign trail in South Carolina Friday to make their final pitch to voters ahead of the state&#39;s 2024 Republican presidential primary. Follow here for the latest live news updates on the campaign."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/magician-says-political-consultant-hired-him-to-create-ai-biden-robocall-ahead-of-new-hampshire-primary",
        "title": "Magician says political consultant hired him to create AI Biden robocall ahead of New Hampshire primary",
        "description": "The robocalls went to thousands of people ahead of New Hampshire&#39;s primary in January and were intended to discourage people from voting."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/23/adam-schiff-katie-porter-california-senate-debate/72664896007/",
        "title": "At risk of slipping behind, Katie Porter lashes out in final Senate debate",
        "description": "Republican Steve Garvey is surpassing Democratic Rep. Katie Porter in new poll, and all four candidates make last-ditch appeal to Latino voters"
    },
    {
        "url": "https://nypost.com/2024/02/23/opinion/tish-james-and-other-trump-persecutors-are-perverting-the-american-legal-system/",
        "title": "Tish James and other Trump persecutors are perverting the American legal system",
        "description": "The lawsuits against Donald Trump are a perversion of the American justice system undertaken for political reasons."
    },
    {
        "url": "https://www.cbc.ca/news/canada/new-brunswick/nb-power-ceo-releived-province-changed-rate-hikes-1.7124019",
        "title": "N.B. Power CEO says she felt &#39;relief&#39; when province changed debt target",
        "description": "A year after blaming artificially low power rates for N.B. Power’s dire finances, the utility’s CEO says she was relieved when the Higgs government pre-empted a major hike designed to tackle its massive debt."
    },
    {
        "url": "https://www.nytimes.com/article/2024-election-biden-trump-questions-answers.html",
        "title": "What If a Candidate Dies? Your 2024 <b>Election</b> Questions, Answered.",
        "description": "Which presidential candidate is going to win in November? Then there are lots and lots of other related questions. “The Run"
    },
    {
        "url": "https://www.yahoo.com/news/trump-looks-whatley-plans-reshape-195522816.html",
        "title": "Trump looks to Whatley as he plans to reshape RNC",
        "description": "Even though he hasn’t officially clinched the 2024 Republican nomination for president, Donald Trump has looked to reshape the structure of the national party to better suit his desires for the general election and beyond."
    },
    {
        "url": "https://news.yahoo.com/election-2024-candidates-issues-whats-194400779.html?ref=upstract.com",
        "title": "<b>Election</b> 2024: Candidates, issues and what&#39;s at stake in March 19 Statehouse primaries",
        "description": "Early voting is underway in a slew of contested Statehouse races in the region and candidates are making their rounds to convince their neighbors that they are the best suited to represent their district&#39;s and party&#39;s interests in Columbus."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/23/nikki-haley-south-caroline-gop-primary/",
        "title": "What is Nikki Haley even doing?",
        "description": "Today, that moment is the potential beginning of the end for Nikki Haley. Or perhaps the continuation of a drawn-out ending. Whatever you want to call it, this weekend is unlikely to be a happy one for her and is likely to reinforce that her path to victory in the GOP presidential nomination contest is somewhere between vanishing and non-existent."
    },
    {
        "url": "https://www.cbsnews.com/texas/news/texas-ag-ken-paxton-sues-denton-principals-for-electioneering-on-district-emails/",
        "title": "AG Ken Paxton sues Denton principals for electioneering on district emails: Texas Tribune",
        "description": "Texas Attorney General Ken Paxton has sued the Denton Independent School District, alleging that two elementary school principals violated state law by encouraging their staffs to vote against opponents of school vouchers in the primary election."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/9-california-races-decide-battle-house-2024-rcna139683",
        "title": "9 California races that could decide the battle for the House in 2024",
        "description": "Democrats will likely need to win four new seats across the country to take control of the House in the 2024 elections. California offers multiple opportunities."
    },
    {
        "url": "https://www.cbsnews.com/texas/news/denton-isd-responds-to-attorney-general-ken-paxtons-lawsuit/",
        "title": "Denton ISD responds to Attorney <b>General</b> Ken Paxton&#39;s lawsuit",
        "description": "DENTON - Attorney General Ken Paxton is accusing Denton ISD of violating the Texas Election Code in emails with &quot;illegal electioneering.&quot;"
    },
    {
        "url": "https://thehill.com/homenews/campaign/4485226-dean-phillips-campaign-denounces-ex-consultants-alleged-involvement-in-fake-biden-robocall/",
        "title": "Dean Phillips campaign denounces ex-consultant’s alleged involvement in fake Biden robocall",
        "description": "The presidential campaign of Rep. Dean Phillips (D-Minn.) is denouncing one of its former consultant’s alleged involvement in the fake robocalls of President Biden that were made to New Hampshire"
    },
    {
        "url": "https://www.foxnews.com/us/california-man-arrested-and-accused-of-threatening-arizona-election-worker-after-2022-vote",
        "title": "San Diego man charged for threats to Arizona <b>election</b> worker: &#39;run&#39; and &#39;hide&#39;",
        "description": "A man from San Diego, California, was arrested on suspicion of leaving threatening messages for an Arizona election worker who he accused of rigging the 2022 election results."
    },
    {
        "url": "https://finance.yahoo.com/news/minutes-extraordinary-general-meeting-163900466.html",
        "title": "Minutes from Extraordinary <b>General</b> Meeting",
        "description": "Announcement no. 2-2024 On 23 February 2024, at 16:00, an Extraordinary General Meeting of Hypefactors A/S was conducted at the company’s address, with the following agenda: 1. Election of Chairman of the Meeting 2."
    },
    {
        "url": "https://nypost.com/2024/02/23/us-news/magician-says-democratic-consultant-paid-him-to-fake-biden-robocalls-report/",
        "title": "Magician says Dean Phillips operative hired him to create AI deepfake Biden robocalls ahead of NH primary",
        "description": "A New Orleans-based magician says a Democratic consultant paid him $150 to create fake robocalls of President Biden that discouraged voter turnout in the New Hampshire primary, according to a new"
    },
    {
        "url": "https://www.foxnews.com/politics/haley-2024-female-president-either-herself-kamala-harris",
        "title": "Haley says US will have &#39;female president&#39; — either herself or Kamala Harris",
        "description": "Republican presidential candidate Nikki Haley said in a Thursday interview with CNN that either herself or Vice President Kamala Harris is going to be the first woman in the Oval Office."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/agartala/bjp-constituted-a-core-committee-for-tripura-ahead-of-lok-sabha-poll/articleshow/107948867.cms",
        "title": "BJP constituted a Core Committee for Tripura ahead of Lok Sabha poll",
        "description": "BJP National General Secretary Arun Singh formed a State Core Committee in Tripura for the Lok Sabha elections. The committee includes leaders from BJ"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/23/hawaii-voting-faq/72435252007/",
        "title": "Hawaii voting FAQ",
        "description": "Hawaii is among eight states nationwide with universal mail-in voting . Every registered voter will receive a mail ballot at least 18 days before the state primary and general election. To ensure your vote will count, your ballot must be submitted to your city or county clerk at least seven days before the election."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/23/virginia-minimum-wage-increase/3d219536-d290-11ee-ac8b-765284b5203e_story.html",
        "title": "Virginia lawmakers send Youngkin bills to increase the minimum wage to $15 an hour",
        "description": "Democrats who control the Virginia General Assembly have sent Republican Gov. Glenn Youngkin legislation that would increase the state’s minimum wage to $15 per hour in 2026"
    },
    {
        "url": "https://www.usnews.com/news/business/articles/2024-02-23/indonesia-and-australia-hold-defense-talks-as-both-nations-move-toward-signing-a-security-agreement",
        "title": "Indonesia and Australia Hold Defense Talks as Both Nations Move Toward Signing a Security Agreement",
        "description": "Indonesia and Australia have held high-level talks in Jakarta as the neighboring countries seek to strengthen security ties by signing a defense cooperation agreement in the coming months"
    },
    {
        "url": "https://theconversation.com/the-south-carolina-primary-is-likely-to-reveal-the-eventual-republican-presidential-nominee-3-points-to-understand-223687",
        "title": "The South Carolina primary is likely to reveal the eventual Republican presidential nominee - 3 points to understand",
        "description": "While Nikki Haley trails Donald Trump in polling ahead of the South Carolina primary, the estimates don’t capture the Democrats and independents who are also able to vote in the Republican primary."
    },
    {
        "url": "https://www.yahoo.com/news/haley-says-trump-wouldn-t-133343671.html",
        "title": "Haley says Trump wouldn’t win <b>general election</b>: ‘Mark my words’",
        "description": "GOP presidential candidate Nikki Haley predicted Thursday that former President Trump would not win in the general election if he is the GOP nominee. “Donald Trump will not win the general election,” Haley said on CNN’s “The Lead” during an interview with anchor Jake Tapper."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-retribution-fear-rcna139497",
        "title": "Fight or flight: Fearful Trump critics weigh the risk of retribution if he&#39;s re-elected",
        "description": "Some are considering leaving the country if Trump returns to the White House or saving money to handle the expected legal costs."
    },
    {
        "url": "https://apnews.com/article/bridgeport-mayor-ganim-gomes-redo-election-connecticut-666146a2a75efeecf605afc9e2fccef5",
        "title": "AP Decision Notes: What to expect in Bridgeport’s do-over mayoral <b>election</b>",
        "description": "For the fourth time in five months, Bridgeport, Connecticut, Mayor Joe Ganim will face challenger John Gomes at the ballot box in his quest for an eighth term."
    },
    {
        "url": "https://www.usnews.com/news/politics/articles/2024-02-23/ap-decision-notes-what-to-expect-in-michigans-presidential-primary",
        "title": "AP Decision Notes: What to Expect in Michigan&#39;s Presidential Primary",
        "description": "President Joe Biden and former President Donald Trump are strong favorites to win the Michigan primaries on Tuesday, but there are complications on both sides"
    },
    {
        "url": "https://edition.cnn.com/2024/02/23/politics/republicans-alabama-embryo-ruling/index.html",
        "title": "Republicans struggle to respond to Alabama embryo ruling",
        "description": "A court decision prompting some Alabama fertility clinics to curtail IVF treatments shows how top Republicans are still struggling to navigate a post-Roe v. Wade world."
    },
    {
        "url": "https://ca.news.yahoo.com/texas-ag-paxton-sues-denton-235844383.html",
        "title": "Texas AG Paxton sues Denton school district over electioneering allegations",
        "description": "“Denton ISD has been in conversation with the Texas Attorney <b>General</b>’s Office, and we agree that <b>election</b> laws should be followed,” the district wrote. The school board sets policies on electioneering and board members and administrators are trained ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/",
        "title": "Adam Hills rages that government should be ‘f***ing ashamed’ over Gaza in blistering rant",
        "description": "‘But, at the end of the day, the whole thing became a game of party politics that wasn’t about Gaza, it was about the <b>General Election</b> that’s coming up.’ Adam isn’t the only celebrity calling out the government this week – far from it, in fac"
    },
    {
        "url": "https://www.yahoo.com/lifestyle/presidential-candidate-nikki-haley-seems-212342755.html",
        "title": "Presidential candidate Nikki Haley seems unable to connect with young voters",
        "description": "Although former Gov. Nikki Haley is on the ballot in Saturday&#39;s GOP primary, none of the dozen South Carolina young people interviewed recently said they would vote for her in the 2024 presidential election."
    },
    {
        "url": "https://bromsgrovestandard.co.uk/news/in-pictures-home-secretary-in-bromsgrove-to-back-conservative-candidate-bradley-thomas/",
        "title": "IN PICTURES - Home Secretary in Bromsgrove to back Conservative candidate Bradley Thomas",
        "description": "THE HOME Secretary came to Bromsgrove to show his support for Conservative general election candidate Bradley Thomas and talk about policing."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-legal-news-brief-trump-seeks-dismissal-of-classified-documents-case-saying-he-is-entitled-to-immunity-175247373.html",
        "title": "Trump legal news brief: Trump seeks dismissal of classified documents case, saying he is ‘entitled to immunity’",
        "description": "Lawyers for former President Donald Trump ask Judge Aileen Cannon to dismiss all criminal charges stemming from his handling of classified documents after leaving the White House on the grounds that he is “entitled to immunity” from being prosecuted."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7275786",
        "title": "Politics latest: Why Speaker Sir Lindsay Hoyle appears safe for now - as minister criticises &#39;real culprit&#39; for Commons chaos",
        "description": "With the <b>general election</b> approaching, how is Mr Sunak doing on delivering his other promises? You can see the progress for yourself below. Ahead of our first proper Electoral Dysfunction next week, we thought it&#39;s time to share what Beth, Jess and Ruth ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24140244.ross-challenges-yousaf-sarwar-oil-gas-debate/?ref=rss",
        "title": "Ross challenges Yousaf and Sarwar to oil and gas debate",
        "description": "Both First Minister Humza Yousaf and Scottish Labour leader Anas Sarwar said they could not wait to campaign against each other at the next <b>general election</b>. That prompted Aberdeen and Grampian Chamber of Commerce to tweet all three party leaders to say it ..."
    },
    {
        "url": "https://uk.yahoo.com/news/dentist-sentenced-threatening-kill-mp-121946122.html",
        "title": "Labour&#39;s Barry Gardiner slams &#39;lamentably poor&#39; security for MPs amid threats to British politicians",
        "description": "Labour MP Barry Gardiner hit out at “lamentably poor” security measures for British politicians, as a disgruntled dentist was sentenced for threatening to behead him. Amit Kerai, 34, bombarded a father and daughter with abuse, violent threats, and harassment after he was suspended by the General Dental Council in 2018."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24139454.burglaries-car-thefts-rife-roads-near-winchmore-hill/",
        "title": "Burglaries and car thefts rife in roads near Winchmore Hill",
        "description": "“I welcome the new officers which have recently joined the team as a result of the Government funding the recruitment of 20,000 additional police officers as pledged in the 2019 <b>General Election</b> manifesto.”"
    },
    {
        "url": "https://www.cbsnews.com/news/wisconsin-trump-save-america-pac-campaign-finance-law/",
        "title": "Wisconsin Ethics Commission refers Trump joint fundraising committee for felony campaign finance law violations",
        "description": "The bipartisan Wisconsin Ethics Commission is recommending prosecutors pursue felony charges against a fundraising group allied with former President Donald Trump."
    }
]