[
    {
        "url": "https://news.yahoo.com/2024-south-carolina-democratic-primary-full-results-200024796.html",
        "title": "2024 South Carolina Democratic primary: Full results",
        "description": "Live, town-by-town presidential election results from the 2024 New Hampshire primary. It’s the former president’s second victory in a row after winning last week’s Iowa caucuses. The former president scored another win in his bid for the GOP nomination, but Haley vowed to stay in the race."
    },
    {
        "url": "https://www.thesun.co.uk/news/25704604/nigel-farage-general-election-reform-uk/",
        "title": "Nigel Farage ‘not getting involved in <b>general election</b> battle for Reform’",
        "description": "NIGEL Farage has told colleagues he is not getting involved in the general election battle for Reform UK, sources told The Sun on Sunday. The Brexit supremo is thought to have privately decided to"
    },
    {
        "url": "https://www.thesun.co.uk/news/25702086/tony-parsons-labour-crime-sadiq-khan/",
        "title": "Labour will be even worse than the Tories at cracking down on crime – just look at clueless Sadiq Khan",
        "description": "WHEN a young mother, 31, and her daughters, aged eight and three, were taken to hospital after a chemical substance was thrown at them, the appalling attack was described on the BBC’s breaking"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "Labour vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "Labour ditches radical reforms as it prepares ‘bombproof’ <b>election</b> manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041615/biden-seeks-south-carolina-primary-win.html",
        "title": "Biden looks for a big win in South Carolina&#39;s Democratic primary after pushing for state to go first",
        "description": "President Joe Biden is looking for an easy victory Saturday in South Carolina´s Democratic primary that officially kicks off his party&#39;s nominating process."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-should-learn-labour-32038747",
        "title": "Rishi Sunak &#39;should learn from Labour&#39; and stamp out Liz Truss&#39; party within a party",
        "description": "Ms Truss, who was the least popular British Prime Minister since records began, will launch a group named “Popular Conservatism” this week"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/03/shock-election-result-this-year-could-turn-you-into-a-sore-loser?ref=mc.news",
        "title": "The sting of losing an <b>election</b> hurts worse when it comes as a big surprise",
        "description": "We’ll find out this year if new research is borne out by reality when Britain and America go to the polls"
    },
    {
        "url": "https://edition.cnn.com/2024/02/03/politics/rnc-meeting-trump-nominee/index.html",
        "title": "Pro-Trump and anti-Trump Republicans agree on one thing: He will be the nominee",
        "description": "The consensus at the 2024 Republican National Committee winter meeting in Las Vegas this week was clear among the pro-Trump and anti-Trump factions alike : Donald Trump will be the party’s presidential nominee this year."
    },
    {
        "url": "https://www.huffpost.com/entry/nikki-haley-donald-trump-south-carolina-democrats_n_65bd85cbe4b0102bd2d937f5",
        "title": "Some Democrats Want To Help Nikki Haley As A Way To Mess With Trump",
        "description": "&quot;Haley isn’t someone who will inspire an insurrection or who would deny the election,&quot; said a Democrat leading a campaign to get crossover votes for Haley."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13041009/DAN-HODGES-Gaza-shadow-George-Galloway-prompt-Rishi-snap-election.html",
        "title": "DAN HODGES: Could Gaza and the shadow of George Galloway prompt Rishi into a snap <b>election</b>?",
        "description": "The Tory MP leapt up and did a jig of joy around the House of Commons Strangers&#39; Bar. &#39;Really? That&#39;s been confirmed?&#39; he asked. &#39;Is George Galloway standing in Rochdale?&#39;"
    },
    {
        "url": "https://edition.cnn.com/2024/02/03/politics/south-carolina-democratic-primary-biden/index.html",
        "title": "South Carolina primary kicks off Biden’s march to 2024 Democratic nomination",
        "description": "South Carolina, the state that launched Joe Biden to the Democratic nomination four years ago, is set Saturday to deliver the president his first official primary victory of the 2024 campaign."
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68192196",
        "title": "Imran Khan: Pakistan ex-PM and wife Bushra Bibi jailed for illegal marriage",
        "description": "A Pakistani court has jailed Imran Khan and his wife for seven years after voiding their marriage, in the latest sentence against the ex-prime minister. The court ruled that Khan&#39;s 2018 marriage with Bushra Bibi, a faith healer, was un-Islamic and illegal."
    },
    {
        "url": "https://www.telegraph.co.uk/money/tax/income/labour-to-review-controversial-tax-loan-charge/",
        "title": "Labour to review controversial tax crackdown on the self-employed",
        "description": "Rachel Reeves has said a new Labour government would carry out a new and independent review of HM Revenue &amp; Customs’ “loan charge” – a tax charge levied against some 60,000 workers including nurses, teachers and IT contractors accused of dodging tax via complex avoidance schemes."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082?ico=more_from_this_author",
        "title": "Tories planning for two back-to-back <b>general</b> <b>elections</b>",
        "description": "The Conservatives are preparing for the possibility of a tight election result leading to a second being called quickly afterwards"
    },
    {
        "url": "https://www.independent.co.uk/asia/india/india-alliance-elections-bjp-narandra-modi-opposition-b2487059.html",
        "title": "The opposition alliance pitching itself as India’s last chance to avoid ‘dictatorship’ is in turmoil",
        "description": "Two key politicians have left the opposition INDIA bloc, leaving it in disarray just months ahead of general elections that Narendra Modi is predicted to win by a potentially historic margin. Maroosha"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68190390.amp",
        "title": "Sir Bob Neill: Former Tory minister to stand down at next <b>general election</b>",
        "description": "A former Tory minister has announced he will stand down as an MP at the next election to spend more time with his wife, who has suffered a stroke. Sir Bob Neill, 71, was first elected in 2006, and served as a junior minister in the coalition government."
    },
    {
        "url": "https://www.thetimes.co.uk/article/frances-barber-interviewi-thought-id-be-lounging-on-a-yacht-by-this-age-8tjxx8tzq",
        "title": "Frances Barber: I thought I’d be lounging on a yacht by this age",
        "description": "T he actress Frances Barber is talking to me from her fabulous loft in Clerkenwell, central London. It’s 10.30am. “I’m actually still in bed,” she says with a throaty chuc"
    },
    {
        "url": "https://edition.cnn.com/2024/02/03/politics/merrick-garland-resumes-duties-back-procedure/index.html",
        "title": "Attorney <b>General</b> Merrick Garland resumes duties following ‘minimally invasive back procedure’",
        "description": "Attorney General Merrick Garland has resumed his official duties after undergoing a “minimally invasive back procedure” Saturday, according to a Department of Justice spokesperson."
    },
    {
        "url": "https://www.foxnews.com/politics/democrats-hold-vast-fundraising-advantage-republicans-face-cash-problems-disarray-crucial-swing-states",
        "title": "Democrats hold vast fundraising advantage as Republicans face cash problems, disarray in crucial swing states",
        "description": "The DNC has achieved a significant fundraising head start over the RNC to start the 2024 election year, as the GOP deals with disarray in some of its swing state parties."
    },
    {
        "url": "https://www.bostonglobe.com/2024/02/03/nation/biden-looks-big-win-voters-head-polls-south-carolina-primary/",
        "title": "Biden looks for big win as voters head to polls in South Carolina primary",
        "description": "Voters in South Carolina headed to the polls Saturday to cast the first official votes in the Democratic presidential nominating contest, registering their preferences in a primary that President Biden is widely expected to win easily."
    },
    {
        "url": "https://www.cbsnews.com/pittsburgh/news/ohio-attorney-general-given-until-monday-to-explain-rejection-of-voting-rights-amendment-to-court-3/",
        "title": "Ohio Attorney <b>General</b> given until Monday to explain rejection of voting rights amendment to court",
        "description": "The Ohio Supreme Court has given Republican Attorney General Dave Yost until Monday to respond to the legal claims of the coalition of civil rights organizations that is challenging his rejection of a package of proposed voter protections they are working to place on November&#39;s ballot."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-elections-2024-polls-trump-biden-latest-news-b2489469.html",
        "title": "South Carolina primary: Joe Biden hopes for big win in Democrat’s first <b>election</b>",
        "description": "President Joe Biden is hoping for a big win in South Carolina today as voters head to the poll to vote in the first official primary. Mr Biden is expected to win over his political rivals: Representative Dean Phillips and self-help author Marianne Williamson. But by how much is the question."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/with-imran-in-doghouse-is-pakistan-poll-result-a-done-deal-not-really/",
        "title": "With Imran in doghouse, is Pakistan poll result a done deal? Not really",
        "description": "Déjà vu is the predominant sense that hangs over the forthcoming general election in Pakistan on Feb 8. A principal protagonist, former PM Imran Khan, is in jail, barred from contesting. He has been"
    },
    {
        "url": "https://www.chicagotribune.com/2024/02/03/can-trump-be-on-the-ballot-its-the-supreme-courts-biggest-election-test-since-bush-v-gore/",
        "title": "Can Trump be on the ballot? It’s the Supreme Court’s biggest <b>election</b> test since Bush v. Gore",
        "description": "A case with the potential to disrupt Donald Trump’s drive to return to the White House is putting the Supreme Court uncomfortably at the center of the 2024 presidential campaign. The"
    },
    {
        "url": "https://www.livemint.com/news/world/us-election-2024-joe-biden-hopes-to-win-big-as-democrats-hold-first-presidential-primary-in-south-carolina-11706977878328.html",
        "title": "US <b>election</b> 2024: Joe Biden hopes to win big as Democrats hold first presidential primary in South Carolina",
        "description": "US President Joe Biden is looking for an easy victory in the South Carolina’s Democratic primary that officially kicked off the party&#39;s presidential nomination process."
    },
    {
        "url": "https://www.thenational.scot/news/24095368.scottish-labour-mps-will-lack-experience-keir-starmer-cabinet/",
        "title": "Scottish Labour MPs ‘will lack experience’ for Keir Starmer Cabinet",
        "description": "THE voices in Keir Starmer’s Cabinet will “almost all be those of English MPs” if Labour win the keys to Downing Street at the <b>General Election</b>, a top <b>elections</b> expert has said. Richard Rose - a leading psephologist and expert on party ..."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-takes-swing-prosecutors-legal-215555292.html",
        "title": "Trump takes a swing at prosecutors in legal cases: ‘Bad people who hate our country’",
        "description": "Former President Trump took a dig at the prosecutors in his legal cases in a post online Saturday, calling them “bad people who hate our country.” “Deranged Jack Smith, Letitia “Peekaboo” James, Alvin Bragg,"
    },
    {
        "url": "https://www.nytimes.com/2024/02/03/us/politics/trump-ronna-mcdaniel-rnc.html",
        "title": "At R.N.C. Meeting, Talk Is of Coming Trump Merger and Chairwoman’s Fate",
        "description": "Donald Trump has long worked closely with Ronna McDaniel, the head of the Republican National Committee. In private, he has begun to question its direction under her leadership."
    },
    {
        "url": "https://www.nytimes.com/2024/02/03/us/politics/kamala-harris-biden-south-carolina-primary.html",
        "title": "Kamala Harris Bolsters Biden for 2024 and Lays Groundwork for 2028",
        "description": "Stumping for the president ahead of South Carolina’s Democratic primary, Ms. Harris has been working to shore up his vulnerabilities with Black voters and younger voters."
    },
    {
        "url": "https://www.yahoo.com/news/sc-nikki-haley-betting-big-143456220.html",
        "title": "SC’s Nikki Haley betting big on her home state in primary fight vs. Trump. Will it work?",
        "description": "Haley trails Trump in South Carolina in Republican primary polls by a margin of 32.1% to 62.7%, according to FiveThirtyEight’s polling averages. In national primary polls, Trump’s lead is even bigger: 72.2% to Haley’s 17.3%, per FiveThirtyEight."
    },
    {
        "url": "https://abcnews.go.com/International/wireStory/indonesians-flock-presidential-campaign-rallies-criticism-government-mounts-106920849",
        "title": "Indonesians flock to presidential campaign rallies as criticism against the government mounts",
        "description": "Tens of thousands of Indonesians have flocked to presidential campaign rallies to air their concerns over the state of democracy in the country"
    },
    {
        "url": "https://news.yahoo.com/last-chance-register-south-africa-141611817.html",
        "title": "Last chance to register as South Africa awaits <b>election</b> date",
        "description": "South African politicians were trying to mobilise their supporters on Saturday, the last chance for citizens to register to vote before an imminent announcement of general elections.The general election must be held within 90 days of the end of Ramaphosa&#39;s term in May,"
    },
    {
        "url": "https://www.aljazeera.com/news/2024/2/3/pakistans-imran-khan-wife-now-get-7-years-jail-for-marriage-law-violation",
        "title": "Pakistan’s Imran Khan, wife now get 7 years jail for marriage law violation",
        "description": "Verdict follows another case in which Khan and Bushra Bibi were sentenced to 14 years in prison for corruption."
    },
    {
        "url": "https://www.cnn.com/2024/02/03/americas/el-salvador-nayib-bukele-election-analysis-intl/index.html",
        "title": "In El Salvador, self-styled ‘world’s coolest dictator’ Nayib Bukele heads for re-<b>election</b> amid human rights concerns",
        "description": "When Jocelyn Zelaya was caught in a hail of gunfire on the streets of San Salvador in 2017, the young mother was simply “in the wrong place, at the wrong time,” says her aunt Jackelyne."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/03/us-travel-advisory-urges-caution-during-pakistan-elections/",
        "title": "US travel advisory urges caution during Pakistan <b>elections</b>",
        "description": "ISLAMABAD: The US State Department on Saturday cautioned American citizens to exercise vigilance during the upcoming general elections, scheduled for 8.In a travel advisory, it highlighte"
    },
    {
        "url": "https://www.sfgate.com/news/article/bridgeport-absentee-ballot-election-monitor-18644206.php",
        "title": "Bridgeport <b>election</b> monitor flags more reports of mishandled ballots for investigation, email shows",
        "description": "An election monitor assigned to Bridgeport flagged new claims of mishandled absentee ballots for investigation days before latest mayoral primary, email shows."
    },
    {
        "url": "https://www.radio.gov.pk/03-02-2024/ecp-completes-all-arrangements-for-general-elections",
        "title": "ECP completes all arrangements for <b>general</b> <b>elections</b>",
        "description": "Election Commission has completed all arrangements for general elections being held on Thursday. Over one hundred and twenty millions registered voters will cast vote for National Assembly and four Provincial Assemblies. The Election Commission has established ninety thousand six hundred seventy-five polling stations in all four provinces."
    },
    {
        "url": "https://www.livemint.com/politics/news/jharkhand-political-crisis-ranchi-court-allows-hemant-soren-to-vote-in-floor-test-on-5-feb-10-things-you-need-to-know-11706962855358.html",
        "title": "Jharkhand political crisis: Ranchi court allows Hemant Soren to vote in floor test on 5 Feb | 10 things you need to know",
        "description": "Jharkhand Advocate General Rajiv Ranjan said that the Enforcement Directorate vehemently objected to any such permission to Hemant Soren, but the court allowed our plea"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/03/president-biden-to-visit-las-vegas-for-campaign-event-sunday/72458054007/",
        "title": "President Biden to visit Las Vegas for campaign event on <b>election</b> stakes Sunday",
        "description": "President Joe Biden will visit Las Vegas on Sunday ahead of Nevada&#39;s Presidential Preference Primary election on Tuesday. The campaign event will be in Las Vegas’ historic Westside, an area where black citizens created their own casinos and clubs about 100 years ago because of segregation barring them from most establishments in the gambling mecca."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/lk-advanis-journey-from-ram-rath-yatra-to-bharat-ratna-how-the-stalwart-played-key-role-in-bjps-rise/articleshow/107380024.cms",
        "title": "LK Advani&#39;s journey from Ram Rath Yatra to Bharat Ratna: How the stalwart played key role in BJP&#39;s rise",
        "description": "Senior BJP leader LK Advani is poised to be honoured with the Bharat Ratna, India&#39;s highest civilian award, according to an announcement by Prime Minister Narendra Modi. Modi expressed joy and commended Advani&#39;s significant contributions to India&#39;s development,"
    },
    {
        "url": "https://www.politico.com/news/2024/02/03/democrats-south-carolina-black-voters-00139434",
        "title": "Biden surrogate’s appeals to Black voters fall on the ears of white Danish tourists",
        "description": "Harrison ticked through the list of things Biden has done for Black communities from student loan debt cancellation, to rural broadband access, to replacing lead pipes. Vice President Harris made a trip to the state on Friday in Orangeburg, making a similar pitch to a crowd of about 250."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/valuable-contribution-opposition-leaders-congratulates-lk-advani-on-being-awarded-bharat-ratna/articleshow/107382580.cms",
        "title": "&quot;Valuable contribution&quot;: Opposition leaders congratulates LK Advani on being awarded Bharat Ratna",
        "description": "Advani is widely regarded as an individual of great intellectual ability, strong principles, and unwavering support for the idea of a strong and prosperous India. As confirmed by Atal Bihari Vajpayee,"
    },
    {
        "url": "https://www.yahoo.com/news/welcome-texas-where-dominate-elections-113100850.html",
        "title": "Welcome to Texas, where we dominate <b>elections</b> even without being a swing state | Opinion",
        "description": "Texas is headed for sleepy, anticlimactic presidential primaries. Democrat Joe Biden Get info without leaving the page. has no serious opposition, and Republican Donald Trump will cruise to victory here on a Super Tuesday that will end the GOP battle, if it’s not already over. And no one expects Texas to be a Trump-Biden battleground."
    },
    {
        "url": "https://uk.movies.yahoo.com/south-carolina-2024-democratic-primary-112056191.html",
        "title": "South Carolina 2024 Democratic primary results",
        "description": "The presidential primaries are held in February in South Carolina -- starting with the Democratic race on Saturday. The Republican primary is Feb. 24. Voters must bring a photo ID to their polling place."
    },
    {
        "url": "https://www.theglobeandmail.com/world/us-politics/article-south-carolina-primary-will-test-president-bidens-support-with-black/",
        "title": "South Carolina primary will test President Biden’s support with Black voters",
        "description": "Biden is hoping for an overwhelming victory with the heavily Black electorate in South Carolina to quiet doubts about his age and concerns about high consumer costs"
    },
    {
        "url": "https://thehill.com/homenews/campaign/4445715-haley-swipes-at-trump-biden-over-age/",
        "title": "Haley swipes at Trump, Biden over age in new ad",
        "description": "Former United Nations Ambassador Nikki Haley’s presidential campaign took aim at President Biden and former President Trump’s ages in a new digital ad rolled out on Saturday. The"
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/telangana-former-deputy-cm-thatikonda-rajaiah-resigns-from-brs/articleshow/107383135.cms",
        "title": "Telangana: Former deputy CM Thatikonda Rajaiah resigns from BRS",
        "description": "In a big setback for the Bharat Rashtra Samiti (BRS) ahead of the Lok Sabha elections, former deputy chief minister and MLA, Thatikonda Raj."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4445440-biden-south-carolina-primary/",
        "title": "Biden looks for primary payoff after investing in South Carolina",
        "description": "South Carolina goes to the polls Saturday, offering the first official primary test for President Biden. The president has invested heavily in the state and comes off a win in New Hampshire’s"
    },
    {
        "url": "https://www.usnews.com/news/top-news/articles/2024-02-03/northern-ireland-to-elect-first-irish-nationalist-first-minister",
        "title": "Northern Ireland to Elect First Irish Nationalist First Minister",
        "description": "Northern Ireland lawmakers were poised to elect an Irish nationalist as First Minister for the first time on Saturday, a historic milestone in a province established a century ago to ensure the dominance of pro-British unionists."
    },
    {
        "url": "https://uk.news.yahoo.com/editorial-voting-045900556.html",
        "title": "EDITORIAL: Voting is a right; use it",
        "description": "Voting is a right provided by our Founding Fathers and secured with the sacrifice of the many men and women of our military. It is not something to be taken lightly. Voters in Muskogee have an opportunity to show their patriotism and love of country by voting in upcoming municipal elections."
    },
    {
        "url": "https://www.huffpost.com/entry/fani-willis-relationship-trump-georgia-case-prosecutor_n_65bd3117e4b05c8779f913a8",
        "title": "Fani Willis Admits Relationship With Trump Georgia Case Prosecutor She Appointed",
        "description": "The Fulton County district attorney denies her “personal relationship” with prosecutor Nathan Wade had any impact on the case."
    },
    {
        "url": "https://www.thetimes.co.uk/article/general-election-2024-uk-tories-polls-vznpgwjqn",
        "title": "<b>General election</b> 2024: polls show history is not on Tories’ side",
        "description": "With the Tories trailing Labour by about 20 points, a study of polling records going back to 1951 reveals that no government has successfully closed such a large gap this close to a general elec­tion."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12753979.michael-ancram-stand/",
        "title": "Michael Ancram to stand down",
        "description": "Former Tory chairman Michael Ancram is to stand down at the next <b>General Election</b> for health reasons. Party grandee Mr Ancram, the Marquis of Lothian, was caught up in the expenses scandal and repaid almost £100 he claimed to have his swimming pool boiler ..."
    },
    {
        "url": "https://www.nzherald.co.nz/world/can-donald-trump-be-on-the-ballot-supreme-courts-biggest-election-test-since-bush-v-gore/6O7FVYVD5ZDAFBAP7I7QEF7RWE/",
        "title": "Can Donald Trump be on the ballot? Supreme Court’s biggest <b>election</b> test since Bush v. Gore",
        "description": "A case with the potential to disrupt Donald Trump’s drive to return to the White House is putting the Supreme Court uncomfortably at the centre of the 2024 presidential campaign. In arguments, the justices will,"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-13041071/MIDAS-SHARE-TIPS-UPDATE-tip-Idox-vote-winner.html",
        "title": "MIDAS SHARE TIPS UPDATE: Our tip Idox is still a vote winner",
        "description": "<b>General</b> <b>elections</b> are an expensive undertaking, costing more than £100 million to organise and orchestrate. Technology firm Idox helps to ensure that everything runs smoothly, so electoral registers are up to date, ballot papers are sent out on time and ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/israel-edinburgh-scottish-parliament-hamas-rishi-b1136844.html",
        "title": "Thousands gather in Edinburgh to call for immediate ceasefire in Gaza",
        "description": "Thousands of pro-Palestine supporters gathered in Edinburgh on Saturday in support of an immediate ceasefire in Gaza. Carrying Palestinian flags and placards, they marched from Edinburgh Castle down the Royal Mile to the Scottish Parliament, shouting slogans such as: “No Justice, No Peace”, and: “Ceasefire now!”"
    },
    {
        "url": "https://thehill.com/opinion/campaign/4445691-democratic-and-republican-elites-fear-rfk-jr-s-growing-path-to-victory/",
        "title": "Democratic and Republican elites fear RFK Jr.’s growing path to victory",
        "description": "In what is shaping up to be a three-person contest between President Joe Biden, former President Donald Trump, and independent candidate Robert F. Kennedy Jr., the question becomes: Which"
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/imran-khans-punishments-and-ptis-challenges-speaking-out-against-the-establishment-in-pakistan/articleshow/107386191.cms",
        "title": "3 jail terms in 1 week: How Establishment has run out Imran Khan before Pakistan polls",
        "description": "Former Pakistan prime minister Imran Khan has faced numerous setbacks and punishments after speaking out against the establishment. This article highlights his legal woes and the challenges faced by his party,"
    },
    {
        "url": "https://leftfootforward.org/2024/02/how-the-uk-profits-from-war/",
        "title": "How the UK profits from war",
        "description": "As allies look sorrowfully on at our underfunded and shrinking armed forces, Britain’s arms trade is making a killing, with billions of pounds of taxpayers’ money being handed to arms manufacturers that give investors rich returns."
    },
    {
        "url": "https://news.yahoo.com/senate-democrats-face-steep-odds-143530853.html?ref=upstract.com",
        "title": "Senate Democrats face steep odds in trying to hold majority in November",
        "description": "Democrats, who hold a 51-49 majority in the Senate, will be defending 22 incumbents and face the near certain loss of West Virginia, with Joe Manchin&#39;s retirement."
    },
    {
        "url": "https://uk.news.yahoo.com/last-chance-register-south-africa-141611733.html",
        "title": "Last chance to register as South Africa awaits <b>election</b> date",
        "description": "South African politicians were trying to mobilise their supporters on Saturday, the last chance for citizens to register to vote before an imminent announcement of general elections.The general election must be held within 90 days of the end of Ramaphosa&#39;s term in May,"
    },
    {
        "url": "https://www.aljazeera.com/news/2024/2/3/pakistans-imran-khan-wife-now-get-7-years-jail-for-marriage-law-violation?traffic_source=rss",
        "title": "Pakistan’s Imran Khan, wife now get 7 years jail for marriage law violation",
        "description": "Verdict follows another case in which Khan and Bushra Bibi were sentenced to 14 years in prison for corruption."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/polling-disaster-terrify-team-trump-criminal-1234959962/",
        "title": "The Polling ‘Disaster’ That’s Starting To Terrify Team Trump",
        "description": "In a number of national and state polls, this variable — whether Trump is criminally convicted — puts what has been a moderate Trump lead in peril. For several months, this trend has continued to appear in a variety of high-quality polls, both public and private, including as recently as this week ."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/india/one-nation-one-election-to-improve-govt-efficiency-foster-economic-development-cii/articleshow/107387691.cms",
        "title": "One Nation, One <b>Election</b> to improve govt efficiency, foster economic development: CII",
        "description": "The Confederation of Indian Industry (CII) expressed support for simultaneous elections, stating that it would enhance governance efficiency and foster economic development. CII presented its views to the High-Level Committee on One Nation One Election (ONOE),"
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-03/welsh-labour-leadership-election-difference-without-division",
        "title": "Welsh Labour leadership <b>election</b>: Difference without division?",
        "description": "Labour’s leadership election rules have changed a lot from the days when trades unions welded block votes - when Unite backed Vaughan Gething last week it was welcome support for his campaign, but individual members can vote for whomever they choose."
    },
    {
        "url": "https://www.investing.com/news/world-news/south-carolina-primary-tests-biden-support-with-black-voters-3291874",
        "title": "South Carolina primary tests Biden support with Black voters",
        "description": "South Carolina has not backed a Democrat for president in the general election since 1976. But because Black people make up more than half of the Democratic electorate in this southern state, it is an important test of Biden&#39;s appeal with a voting base that supports Democrats nine-to-one in presidential races."
    },
    {
        "url": "https://inews.co.uk/news/civil-service-richard-tice-reform-2886189?ico=more_from_this_author",
        "title": "‘No-one, especially the Tories, is laughing at us now,’ says Reform leader",
        "description": "In an interview with i, the Reform Party leader says his &#39;medium-term&#39; plan to take the Tories&#39; place as the threat from the right to Labour"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/south-carolina-2024-democratic-primary-112056191.html",
        "title": "South Carolina 2024 Democratic primary results",
        "description": "Trump won the state in the 2020 <b>general election</b>, with 55% of the vote. Republican officials in the state voted in 2019 to cancel their presidential nominating contest in 2020, virtually paving a smooth pathway to the nomination for Trump. Trump also won ..."
    },
    {
        "url": "https://www.devonlive.com/news/devon-news/tory-mp-will-fight-every-9075267",
        "title": "Tory MP &#39;will fight for every single vote&#39;",
        "description": "The Conservative candidate for the newly created Honiton and Sidmouth seat, Simon Jupp, says he will be &quot;fighting for every single vote&quot; at the next <b>general election</b>. Both have small majorities. Richard Foord won a by-<b>election</b> by 6,144 votes after the ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12502067.tory-chairman-michael-ancram-retire/",
        "title": "Tory chairman Michael Ancram to retire",
        "description": "In his letter to constituency chairman Ken Carter, Mr Ancram said: “It is with genuine sadness that I have decided to stand down from Parliament at the coming <b>general election</b>. This decision has been forced upon me by considerations of health."
    },
    {
        "url": "https://www.telegraph.co.uk/us/politics/2024/02/03/border-mexico-immigrant-chaos-votes-democrats-trump/",
        "title": "Many Democrats blame Biden for border chaos as issue threatens to cost him votes",
        "description": "While no draft has yet been released, it has been described as one of the most restrictive border bills in a century: likely to expand expulsion powers, raise the bar for asylum claims and shut down the border altogether when a daily threshold is exceeded."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/trump-ballot-supreme-courts-biggest-election-test-bush-106919503",
        "title": "Can Trump be on the ballot? It&#39;s the Supreme Court&#39;s biggest <b>election</b> test since Bush v. Gore",
        "description": "A case with the potential to disrupt Donald Trump’s drive to return to the White House is putting the Supreme Court uncomfortably at the center of the 2024 presidential campaign"
    },
    {
        "url": "https://www.nytimes.com/2024/02/03/world/canada/china-election-interference.html",
        "title": "A Public Inquiry Into Foreign <b>Election</b> Meddling Comes Up Against Secrecy",
        "description": "The first week of hearings by a special commission focused on the question of how top-secret intelligence can be made public."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-authorities-complete-all-arrangements-for-feb-8-general-elections/articleshow/107383068.cms",
        "title": "Pakistan authorities complete all arrangements for Feb 8 <b>general</b> <b>elections</b>",
        "description": "Pakistani authorities have completed all arrangements for the general elections on February 8, including printing over 260 million ballot papers. Ther"
    },
    {
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/telangana-former-deputy-cm-thatikonda-rajaiah-resigns-from-brs/articleshow/107383038.cms",
        "title": "Telangana: Former deputy CM Thatikonda Rajaiah resigns from BRS",
        "description": "Former deputy chief minister and MLA, Thatikonda Rajaiah, resigned from the Bharat Rashtra Samiti (BRS) ahead of the Lok Sabha elections. Rajaiah cited a lack of responsiveness as the reason for his resignation."
    },
    {
        "url": "https://www.reuters.com/world/us/south-carolina-primary-tests-biden-support-with-black-voters-2024-02-03/",
        "title": "South Carolina primary tests Biden support with Black voters",
        "description": "U.S. President Joe Biden&#39;s re-election bid goes before voters for the first time on Saturday, when Democrats hold their inaugural 2024 primary in South Carolina."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/2024/02/03/threats-against-election-workers/72328609007/",
        "title": "Threats against <b>election</b> workers spiked after 2020, fueling concerns about recruiting, retaining key workers",
        "description": "Threats against election workers remain high after 2020, raising concerns about finding and keeping staffers to collect and count ballots."
    },
    {
        "url": "https://www.foxnews.com/politics/boebert-stiff-competition-colorado-house-race-switching-districts-should-very-concerned",
        "title": "Boebert faces stiff competition in Colorado House race after switching districts: &#39;should be very concerned&#39;",
        "description": "Colo., is facing serious competition in the race to represent Colorado&#39;s 4th Congressional District after announcing she would switch districts last year."
    }
]