[
    {
        "url": "https://news.yahoo.com/trump-wins-iowa-hampshire-don-221619243.html",
        "title": "What Trump’s wins in Iowa and New Hampshire don’t tell us about South Carolina",
        "description": "After wins in both the Iowa caucuses and the New Hampshire primary, former President Donald Trump has momentum on his side as he seeks to transition from GOP frontrunner to the party’s presumptive 2024 nominee."
    },
    {
        "url": "https://news.yahoo.com/white-house-gives-maduro-april-220153349.html",
        "title": "White House gives Maduro an April deadline on democratic reform before sanctions snap back",
        "description": "The Biden administration warned the Nicolás Maduro regime on Monday that it has until April to fulfill its commitment to free political prisoners, and to allow all presidential candidates to compete in this year’s elections,"
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/nikki-haleys-dilemma-south-carolina-winning-voters-love-106773343",
        "title": "Nikki Haley&#39;s dilemma in South Carolina: winning over voters who like her, but love Trump",
        "description": "For South Carolina’s conservatives, deciding whether Nikki Haley’s record warrants a promotion to the Oval Office seems less about her experience and abilities and more about the man standing in her w"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7148689",
        "title": "Politics latest: Tory MP quit six-figure minister role because he &#39;couldn&#39;t afford mortgage&#39;",
        "description": "Last week, the outgoing head of the British Army, <b>General</b> Sir Patrick Sanders ... Rochdale will hold a by-<b>election</b> on 29 February, the local council has just confirmed. The seat is vacant following the sad death of veteran Labour MP Sir Tony Lloyd earlier ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-norfolk-68133873?at_link_id=2B0D3134-BECC-11EE-9E20-CAA0D0B4AF07&at_ptr_name=twitter&at_link_origin=BBCNews&at_campaign_type=owned&at_bbc_team=editorial&at_link_type=web_link&at_format=link",
        "title": "George Freeman quit as minister as he &#39;couldn&#39;t afford&#39; mortgage",
        "description": "A Tory MP said he quit his ministerial role because he could not afford to pay his mortgage on a salary of £118,300. Mid Norfolk MP George Freeman resigned as science minister in November."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/jan/29/biden-border-immigration-abortion-republicans-trump-2024-election-latest?page=with:block-65b7e3ea8f08610684b79e69",
        "title": "White House prepares counterattack to Republican attempt to kill immigration talks and impeach Mayorkas – live",
        "description": "Biden administration hits back at Republican attempts to kill compromise legislation intended to curb migrant arrivals at the southern border"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861005/rishi-sunak-immigration-referendum-general-election",
        "title": "Rishi Sunak handed blueprint for shock <b>election</b> win with &#39;radical offer&#39; on immigration",
        "description": "A leading academic said the PM could &quot;pull off one of the biggest shocks&quot; in the history of general elections by promising a referendum on reducing immigration."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-africa-68129365?at_medium=RSS&amp%3Bat_campaign=KARANGA",
        "title": "South Africa: ANC suspends ex-President Jacob Zuma after rival party launch",
        "description": "South Africa&#39;s former President Jacob Zuma has been suspended from the party he once led, after refusing to vote for it and launching a rival organisation. The governing African National Congress (ANC) announced its decision on Monday."
    },
    {
        "url": "https://www.ft.com/content/c7b4fa91-3601-4b82-b766-319af3c261a5",
        "title": "UK <b>general election</b> poll tracker",
        "description": "The FT’s main UK poll tracker uses data from every new national voting intention poll by a member of the British Polling Council. Voting intentions in demographic subsamples use data from Deltapoll, Ipsos, Omnisis, Opinium, PeoplePolling, Redfield and Wilton, Savanta, Survation, Techne and YouGov."
    },
    {
        "url": "https://www.huffpost.com/entry/snoop-dogg-donald-trump-love-and-respect_n_65b62718e4b077c17ab57ae8",
        "title": "Snoop Dogg Has Stunning Change Of Opinion On Trump",
        "description": "Snoop Dogg dropped the artwork for his “Make America Crip Again” EP later that year that featured a corpse tagged with the name “Trump” and covered by an America flag. The artwork is a reference to Ice Cube’s cover art for his album “Death Certificate.”"
    },
    {
        "url": "https://www.bbc.com/news/world-africa-68129365",
        "title": "Jacob Zuma: ANC suspends ex-South Africa president after rival party launch",
        "description": "South Africa&#39;s former President Jacob Zuma has been suspended by the ANC he used to lead, after refusing to vote for them and launching a rival party. The governing African National Congress (ANC) announced its decision on Monday."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-elections-2024-date-gop-trump-haley-live-updates-b2486589.html?page=5",
        "title": "US <b>election</b> 2024 live updates: Haley attacks Trump for ‘hiding’ and refusing to debate her",
        "description": "Challenger continues to hit back at front-runner as she concentrates on picking up support in her native South Carolina following his victory in New Hampshire"
    },
    {
        "url": "https://www.theguardian.com/society/2024/jan/29/vote-claims-king-charles-backed-actors-benevolent-fund-charity-reported-police",
        "title": "Vote fraud claims at King Charles-backed actors’ charity reported to police",
        "description": "Actors’ Benevolent Fund says it has disregarded 156 online votes cast at board elections after internal inquiry"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/tory-minister-george-freeman-mortgages-sunak-b2486715.html",
        "title": "Sunak minister says he quit government because he could not afford mortgage hike on £120k salary",
        "description": "Former science minister George Freeman said he ‘simply could not afford’ his monthly payments on a ministerial salary"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13019003/Keir-Starmer-hints-reward-Tory-defector-Iceland-Richard-Walker-government-job.html",
        "title": "Keir Starmer hints he will reward Tory defector Richard Walker with a government job if he wins power - as it is revealed Iceland boss&#39;s DAD begged Conservatives to give him a ...",
        "description": "Iceland&#39;s executive chairman Richard Walker, 43, was unveiled by the opposition as a supporter today, months after he quit the Conservatives when they wouldn&#39;t hand him a safe seat."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/next-general-election-labour-tories-31940247",
        "title": "When is the next <b>general election</b> and are Labour or the Tories more likely to win?",
        "description": "Dithering Rishi Sunak is under pressure to call the next general election as fed-up voters demand a chance to deliver their verdict on 14 years of Conservative rule"
    },
    {
        "url": "https://www.newsletter.co.uk/business/northern-ireland-solicitor-chosen-to-observe-general-elections-in-pakistan-4496665",
        "title": "Northern Ireland solicitor chosen to observe <b>general</b> <b>elections</b> in Pakistan",
        "description": "Scheduled for February 8, the Bangor native will join the 13-member Commonwealth Observer Group (COG) to offer an independent and comprehensive assessment of the electoral process. Did you know with a Digital Subscription to Belfast News Letter, you can ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/british-expats-vote-labour-lib-dems-next-general-election-tories-n8mzzrx5d?ilc=timesradio:morefromthetimes",
        "title": "Millions of expats given vote by Tories ‘will punish party for Brexit’",
        "description": "Labour and Liberal Democrats expected to reap benefit from franchise rule changes and frustration over visa restrictions"
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-peer-secret-polls-2878400?ico=editors_picks",
        "title": "We must crack down on secretly funded polls, Tory peer says after Sunak coup",
        "description": "Lord Hayward said: “In light of the imminence of a <b>General Election</b> may I ask that the Electoral Commission look at the matters raised above and whether they are worth considering in more detail.” Last week, i revealed that the Tory party had launched ..."
    },
    {
        "url": "https://www.standard.co.uk/news/tech/elon-musk-taylor-swift-michelle-donelan-twitter-swift-b1135443.html",
        "title": "X blocks searches for Taylor Swift after deepfake image spread",
        "description": "Searching for the singer’s name now prompts an error message on X, with the platform confirming it had halted searches while it tackles the issue."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68079726.amp",
        "title": "<b>General election</b> 2024 poll tracker: How do the parties compare?",
        "description": "The last possible date a <b>general election</b> can be held is 28 January 2025, writes BBC senior political analyst Peter Barnes. Rishi Sunak, who as prime minister can call it, has said his &quot;working assumption&quot; is the <b>general election</b> will take place in the ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-slates-two-bad-governments-as-party-overtakes-snp-3dncp9sgw",
        "title": "Labour slates ‘two bad governments’ as party overtakes SNP",
        "description": "Scottish Labour slates ‘two bad governments’ and voters want change, deputy leader Jackie Baillie says as poll gives her party a three-point lead over the SNP"
    },
    {
        "url": "https://www.modernghana.com/news/1288758/ec-to-meet-political-parties-today-over-2024-elect.html",
        "title": "EC to meet political parties today over 2024 <b>election</b> date change proposal",
        "description": "The Electoral Commission (EC) will today, Monday, January 29, 2024 meet the various political parties at its Inter-Party Advisory Committee (IPAC) meeting to continue deliberations on its proposal for the change of date for the <b>general</b> <b>elections</b>."
    },
    {
        "url": "https://edition.cnn.com/2024/01/28/opinions/trump-terrorism-threat-southern-border-bergen/",
        "title": "Opinion: Trump is wrong. This is the real terror threat in America",
        "description": "Former President Donald Trump says the US faces a terrorism risk from people crossing the border. Peter Bergen points to what he says is the real security threat Americans face."
    },
    {
        "url": "https://www.lowellsun.com/2024/01/29/trump-ballot-question-comes-too-soon-for-massachusetts-high-court/",
        "title": "Trump ballot question comes too soon for Massachusetts high court",
        "description": "A move to see the state’s highest court weigh in on the election commission’s authority to determine whether former President Donald Trump should be tossed from the Massachusetts Republican"
    },
    {
        "url": "https://apnews.com/article/toyota-takata-air-bag-explode-shrapnel-3c03be0d9454856cf52e48aaa6bda711",
        "title": "Toyota urges owners of old Corolla, Matrix and RAV4 models to park them until air bags are replaced",
        "description": "Toyota and General Motors are telling the owners of about 61,000 older Corolla, Matrix, RAV4 and Pontiac Vibe models to stop driving them because their Takata air bag inflators are at risk of exploding and hurling shrapnel."
    },
    {
        "url": "https://www.thetimes.co.uk/article/expats-voting-general-election-campaign-swdl7vgr3",
        "title": "Tories hunt polling-day proxies to make most of expat vote",
        "description": "Conservative associations have been told to build up a bank of proxy voters to take advantage of new rules allowing an extra two million British expats to vote in the <b>general election</b>. The move follows a change in the law that removed the requirement on ..."
    },
    {
        "url": "https://www.newsweek.com/donald-trumps-new-theory-stock-market-boom-1865041",
        "title": "Donald Trump&#39;s New Theory for Stock Market Boom",
        "description": "Former President Donald Trump claimed on Monday that it was his own influence that was responsible for the recent boom in the stock market."
    },
    {
        "url": "https://www.reuters.com/world/americas/venezuelas-machado-rejects-possibility-substitute-opposition-candidate-2024-01-29/",
        "title": "Venezuela must lift ban on opposition candidate or face oil sanctions, US says",
        "description": "The U.S. will reinstate sanctions on Venezuela&#39;s oil sector if the Venezuelan government does not lift its ban on a leading opposition candidate running for president later this year, a White House official said on Monday."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/jan/29/biden-border-immigration-abortion-republicans-trump-2024-election-latest?page=with:block-65b7dec68f088df6e69e4c19&filterKeyEvents=false",
        "title": "White House criticizes wrangling over border deal, urging Congress to authorize funding – as it happened",
        "description": "Biden spokeswoman says if Republicans want to address illegal immigration they should authorize ‘funding needed to secure the border’"
    },
    {
        "url": "https://thehill.com/homenews/4435862-trump-claims-credit-record-stock-market-biden/",
        "title": "Trump claims credit for record-high stock market under Biden",
        "description": "Former President Trump, who has predicted economic doom if he’s not elected back to the White House, said Monday he should get credit for the stock market’s recent record highs, more"
    },
    {
        "url": "https://www.modernghana.com/news/1288940/south-africa-poll-battle-heats-up-as-anc-suspends.html",
        "title": "South Africa poll battle heats up as ANC suspends Zuma",
        "description": "South Africa&#39;s former President Jacob Zuma was suspended from the ruling African National Congress (ANC) on Monday, weeks after he backed another party ahead of this year&#39;s <b>general</b> <b>elections</b>. The decision, which was widely expected, will be seen as a ..."
    },
    {
        "url": "https://www.usnews.com/news/business/articles/2024-01-29/venezuelan-opposition-candidate-blocked-by-court-calls-it-judicial-criminality-wont-abandon-race",
        "title": "Venezuelan Opposition Candidate Blocked by Court Calls It &#39;Judicial Criminality,&#39; Won&#39;t Abandon Race",
        "description": "Venezuelan opposition leader María Corina Machado says the court ruling blocking her presidential candidacy represents “judicial criminality"
    },
    {
        "url": "https://apnews.com/article/serbia-mass-shooting-trial-weapons-7fe91a270fb01e92adee53702fadaf70",
        "title": "Trial opens in Serbia for parents of a teenager who fatally shot 10 people at a school last year",
        "description": "A trial has started in Serbia for the parents of a teenager who is accused of killing 10 people and injuring six in a mass shooting at his school last May that left the Balkan nation in shock."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/more-expats-to-vote-2024-but-will-it-change-much_uk_65b7af35e4b077c17ab5e886",
        "title": "Millions Of Expats Could Penalise Tories In The Next <b>Election</b> – But There&#39;s A Catch",
        "description": "More expats will be able to vote in the next <b>general election</b> due to a new Conservative policy – but how much of an impact will that actually have? Although Rishi Sunak is yet to confirm the date of the next <b>general election</b> – expected in the second ..."
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/uk-covid-inquiry-nicola-sturgeons-cross-examination-could-be-the-day-her-independence-dream-dies-john-mclellan-4497258",
        "title": "UK Covid Inquiry: Nicola Sturgeon&#39;s cross-examination could be the day her independence dream dies – John McLellan",
        "description": "who can’t remember from one day to the next if he can find phone messages or not (and whose Health Secretary has similar amnesia about his iPad use), and who needs to get his party fit for a <b>general election</b> when barely a day goes by without a new ..."
    },
    {
        "url": "https://thehill.com/opinion/campaign/4435335-the-problem-with-primaries/",
        "title": "The problem with primaries",
        "description": "The U.S. primaries system, used to determine the presidential nominees for each party during election season, is broken."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860950/mark-drakeford-eu-single-market-Jeremy-Miles?ruid=bc3e2d11-9006-4d35-98de-21b0c2919b41",
        "title": "Frontrunner to replace Mark Drakeford sparks fury over EU single market demand",
        "description": "Jeremy Miles, who is the favourite to take over from Mr Drakeford as Wales&#39;s first minister in March, said he would push &quot;strongly&quot; for that position if Sir Keir Starmer wins the next <b>general election</b>. But Welsh Conservatives leader Andrew RT Davies said ..."
    },
    {
        "url": "https://www.netmums.com/child/disposable-vapes-banned-by-government-to-protect-kids-health",
        "title": "Disposable vapes BANNED by government to protect kids&#39; health",
        "description": "Disposable vapes will be banned in the UK, and new powers to restrict vape flavours and introduce plain packaging will also come into force, the prime minister Rishi Sunak announced today (29 January). The crackdown aims to tackle a rise in youth vaping and protect children’s health."
    },
    {
        "url": "https://www.radio.gov.pk/29-01-2024/cm-punjab-in-meeting-with-provincial-ec-assures-of-caretaker-govts-full-support-in-holding-free-fair-elections-in-province",
        "title": "CM Punjab in meeting with provincial EC assures of caretaker govt&#39;s full support in holding free &amp; fair <b>elections</b> in province",
        "description": "Your browser does not support HTML5 video. Provincial <b>Election</b> Commissioner Punjab, Ijaz Anwar Chohan, called on caretaker Punjab Chief Minister Mohsin Naqvi in ..."
    },
    {
        "url": "https://news.yahoo.com/meet-germantown-school-board-candidates-110318750.html",
        "title": "Meet the Germantown School Board candidates running in the February primary",
        "description": "All school board seats in Germantown are elected &quot;at-large,&quot; which means all voters in the school district can vote for each seat. The other five school board members, who hold staggered three-year terms, are not up for election this spring."
    },
    {
        "url": "https://inews.co.uk/opinion/this-is-kemi-badenochs-most-dangerous-moment-2877606",
        "title": "This is Kemi Badenoch’s most dangerous moment",
        "description": "The likely beneficiary was the ambitious Business Secretary Kemi Badenoch, who is now in the promising position of candidate most likely to benefit from a Sunak ouster or a crushing Conservative defeat, should recovery remain elusive by the general election."
    },
    {
        "url": "https://www.modernghana.com/news/1288732/41-year-old-lawyer-ralph-poku-adusei-beats-retired.html",
        "title": "41-year-old Lawyer Ralph Poku-Adusei beats retired Police COP in Bekwai NPP Primaries",
        "description": "New Patriotic Party NPP delegates in the Bekwai constituency in the Ashanti Region have chosen a new path to progress and development in their constituency by electing young Ghanaian lawyer and an indigene of Bekwai,"
    },
    {
        "url": "https://theconversation.com/el-salvador-voters-set-to-trade-democracy-for-promise-of-security-in-presidential-election-221092",
        "title": "El Salvador voters set to trade democracy for promise of security in presidential <b>election</b>",
        "description": "Mass arrests and the suspension of constitutional rights have been a feature of President Nayib Bukele’s tenure. A fresh mandate from voters will likely entrench his hardline approach."
    },
    {
        "url": "https://www.forbes.com/sites/alisondurkee/2024/01/29/biden-reportedly-plans-to-use-trump-attacks-abortion-and-hopefully-taylor-swift-to-win-2024-election/",
        "title": "Biden Reportedly Plans To Use Trump Attacks, Abortion—And Hopefully Taylor Swift—To Win 2024 <b>Election</b>",
        "description": "President Joe Biden’s campaign is gearing up for November’s general election by putting former President Donald Trump—the all but assured to be the GOP nominee—in its crosshairs and planning a reelection bid dominated by abortion rights, with the help of influencers and, it hopes, potentially Taylor Swift, the New York Times reported Monday."
    },
    {
        "url": "https://www.abc.net.au/listen/programs/radionational-breakfast/tuvalu-election-fallout-security-deal/103402132",
        "title": "Tuvalu&#39;s PM has lost his seat, what does that mean for Australia?",
        "description": "The future of a monumental security and migration pact between Australia and Tuvalu is now being questioned after the country&#39;s PM lost his seat in the weekend&#39;s general election."
    },
    {
        "url": "https://www.westerntelegraph.co.uk/news/24081427.general-election-crabb-fight-mid-south-pembrokeshire/",
        "title": "<b>General election</b>: Crabb to fight Mid and South Pembrokeshire",
        "description": "The battle for the new Westminster seat of Mid and South Pembrokeshire has heated up with the current Preseli Pembrokeshire MP throwing his hat"
    },
    {
        "url": "https://www.northumberlandgazette.co.uk/news/politics/labour-confirms-emma-foody-as-candidate-for-cramlington-and-killingworth-4496598",
        "title": "Labour confirms Emma Foody as candidate for Cramlington and Killingworth",
        "description": "The Labour Party has selected its candidate for the new Cramlington and Killingworth constituency at the next general election."
    },
    {
        "url": "https://www.latimes.com/politics/story/2024-01-29/column-will-double-haters-determine-the-outcome-of-the-2024-presidential-election",
        "title": "Column: Will ‘double haters’ determine the outcome of the 2024 presidential <b>election</b>?",
        "description": "Polls suggest that if the election were held tomorrow, Trump would narrowly win. But his unpopularity rivals Biden&#39;s, and a lot could change in the next nine months."
    },
    {
        "url": "https://www.politico.com/newsletters/playbook/2024/01/29/can-dems-flip-the-border-script-00138304",
        "title": "Playbook: Can Dems flip the border script?",
        "description": "DEMS PUNCH BACK ON THE BORDER — For months now, polls have shown voters putting the migrant crisis at the southern border among their top concerns — and blaming Democrats for the mess. Could that be about to change?"
    },
    {
        "url": "https://www.yahoo.com/news/seven-candidates-running-two-seats-110343954.html",
        "title": "Seven candidates running for two seats on Cudahy School Board",
        "description": "Seven candidates, six of them challengers, are running for two open seats on the Cudahy School Board. A primary will be held Feb. 20."
    },
    {
        "url": "https://www.investing.com/news/economy/pakistan-central-bank-holds-key-rate-at-22-says-inflation-still-high-3285748",
        "title": "Pakistan central bank holds rates at 22%, revises up inflation forecast",
        "description": "KARACHI (Reuters) - Pakistan&#39;s central bank on Monday held its key rate at 22% for the fifth policy meeting in a row due to elevated inflation levels, the governor of the State Bank of Pakistan said."
    },
    {
        "url": "https://metro.co.uk/2024/01/29/iceland-boss-donated-tories-switched-backing-labour-20186890/?ico=trending-post-strip_item_4",
        "title": "Iceland boss who donated to Tories has switched his backing to Labour",
        "description": "Mr Walker now says he will vote Labour at the next <b>general election</b>, praising Sir Keir for having ‘transformed’ the party after Jeremy Corbyn’s leadership. Writing in The Guardian, he said: ‘Labour is the right choice for the communities across ..."
    },
    {
        "url": "https://news.sky.com/story/iceland-boss-and-former-tory-donor-richard-walker-switches-support-to-labour-13059184",
        "title": "Iceland boss and former Tory donor Richard Walker switches support to Labour",
        "description": "Mr Walker said while he would be supporting Labour at the next <b>general election</b>, he would not become a party member. Writing in the Guardian, Mr Walker said: &quot;Labour is the right choice for the communities across the country where Iceland operates - and ..."
    },
    {
        "url": "https://www.politico.com/news/2024/01/29/democratic-2024-senate-tv-ad-reservations-montana-nevada-00138184",
        "title": "Dems make early ad reservations in key Senate races",
        "description": "Senate Majority PAC is booking early to lock in lower rates in Montana and Nevada, two states that are crucial to a brutal Senate map."
    },
    {
        "url": "https://www.usatoday.com/story/news/world/2024/01/29/joe-biden-political-pressure-drone-deaths-iran/72389262007/",
        "title": "War and politics: Joe Biden faces campaign pressure over drone deaths and response to Iran",
        "description": "Republican nomination frontrunner Donald Trump and challenger Nikki Haley - and prominent GOP lawmakers - blamed Biden policy for the drone attack"
    },
    {
        "url": "https://www.usatoday.com/story/opinion/columnist/2024/01/29/trump-republican-party-conservative-2024-election/72351317007/",
        "title": "If bowing to Trump is the GOP&#39;s new &#39;conservatism,&#39; good luck winning any more <b>elections</b>",
        "description": "Similarly, Trump has made a point of calling out his last remaining GOP rival – Nikki Haley – for rightly making a case for reforming entitlements like Social Security and Medicare. Those programs are going bankrupt (and fast), but Trump has mocked Haley for speaking the truth."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/rishi-sunak-latest-news-atkins-labour-starmer-rwanda/",
        "title": "Politics latest news: ‘As a nation, we can do better than damaging Rwanda Bill’, says Welby",
        "description": "A phased ban on smoking will be “popular” with the public, the Health Secretary insisted this morning amid a Tory revolt. Victoria Atkins said banning young people from buying cigarettes will one day be viewed in the same way as the ban on smoking in pubs and in cars with children present."
    },
    {
        "url": "https://timesofindia.indiatimes.com/sports/cricket/news/pcb-to-have-full-time-chairman-next-month-sources/articleshow/107224572.cms",
        "title": "PCB to have full-time chairman next month: Sources",
        "description": "Pakistan Cricket Board (PCB) is set to appoint a new chairman next month, with sources indicating that Mohsin Naqvi, the caretaker chief minister of P"
    },
    {
        "url": "https://www.reuters.com/world/india/indias-modi-bet-popularity-over-populism-budget-ahead-polls-2024-01-29/",
        "title": "India&#39;s Modi to bet on popularity over populism in budget ahead of polls",
        "description": "Indian Prime Minister Narendra Modi is expected to buck a trend of spending big on new welfare programmes in a budget before a general election to instead focus on infrastructure to keep the economy humming while narrowing the budget gap."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-secret-plan-expand-presidential-140000268.html",
        "title": "Trump’s Secret Plan to Expand Presidential Immunity To ‘King George’ Levels",
        "description": "Trump plans to appoint a reliably loyal and pliable attorney <b>general</b> and stack the DOJ with a pre-vetted ... memo would seek to settle when it rules on whether the special counsel <b>election</b> subversion case can move forward to trial. An OLC memo may also ..."
    },
    {
        "url": "https://www.cnn.com/2024/01/29/politics/trump-border-middle-east-election/index.html",
        "title": "Trump seizes on US troops killed and border crisis to sell <b>general election</b> message",
        "description": "Donald Trump’s core general election argument is that President Joe Biden is weak and incapable as events spin out of control at home and abroad."
    },
    {
        "url": "https://www.nytimes.com/2024/01/29/opinion/biden-trump-abortion-election.html",
        "title": "How Trump Could Institute a Backdoor Federal Abortion Ban",
        "description": "But it’s odd how the Biden-Harris campaign has chosen to speak about this issue, with a heavy focus on their plan to “codify Roe.” Bold congressional action on abortion is unlikely from either side: A federal abortion ban under a second Trump administration is implausible,"
    },
    {
        "url": "https://www.dailymail.co.uk/sciencetech/article-13017481/Robots-local-accents-appear-trustworthy-competent-users-research-suggests.html",
        "title": "Robots with local accents appear more trustworthy and competent to users, research suggests",
        "description": "A study has found that speaking in a local accent can - in certain circumstances - make robots seem more trustworthy and competent."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/bhopal/congress-gears-up-for-ls-polls-begins-brainstorming-to-shortlist-candidates/articleshow/107214680.cms",
        "title": "Congress gears up for LS polls, begins brainstorming to shortlist candidates",
        "description": "Bhopal: State Congress bigwigs who lost the assembly elections could be fielded for the upcoming Lok Sabha elections."
    },
    {
        "url": "https://www.nytimes.com/2024/01/28/us/illinois-trump-ballot-insurrection.html",
        "title": "Illinois Hearing Officer, Ex-G.O.P. Judge, Says Trump Engaged in Insurrection",
        "description": "But the hearing officer said the State Board of Elections should let the courts decide whether Mr. Trump’s conduct disqualified him from the ballot."
    },
    {
        "url": "https://arynews.tv/elections-2024-shehbaz-sharif-address-in-rajanpur/",
        "title": "South Punjab’s development PML-N’s top priority, says Shehbaz Sharif",
        "description": "Former three-time prime minister Nawaz Sharif, Maryam Nawaz, Hamza Shehbaz and other PML-N leaders are carrying out vigorous <b>election</b> campaigns across Punjab ahead of the <b>general</b> <b>elections</b>. Shehbaz Sharif reached Rajanpur to address a public gathering in ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-iceland-prime-minister-breakfast-the-guardian-b1135390.html",
        "title": "Iceland boss and ex-Tory donor switches backing to Labour",
        "description": "Iceland’s Executive Chairman Richard Walker has backed Labour ahead of the next <b>general election</b> (John Nguyen/PA) The executive chairman of Iceland supermarket has given his backing to Labour, saying the party was the “right choice” for business and ..."
    },
    {
        "url": "https://www.business-live.co.uk/manufacturing/average-house-price-wales-continues-28530833",
        "title": "The average house price in Wales continues to fall",
        "description": "Potentially, UK Government budget measures (on March 6th) might seek to stimulate market activity which would add further momentum, and of course housing will loom large in the manifestos being readied for the approaching <b>General Election</b> when it is called."
    },
    {
        "url": "https://www.indcatholicnews.com/news/49017",
        "title": "UK Catholics call on Chancellor to tackle poverty",
        "description": "In what is likely to be the last Budget before the next <b>General Election</b>, Catholic organisations have made a joint representation to the Treasury on the need to help people escape poverty both at home and abroad. The letter contains a number of policy ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13179526.farage-coming-glasgow-today-say-indy-really-separation-england/",
        "title": "Farage: I&#39;m coming to Glasgow today to say indy is really about separation from England",
        "description": "In May 2013, the Ukip leader, who hopes to become a Kent MP at the <b>General Election</b>, had to seek refuge in an Edinburgh pub as police protected him from an angry mob, whom he later described as &quot;fascist scum&quot;. Mr Farage made it clear Police Scotland had ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145835.milband-tories-warning-following-by-election/",
        "title": "Milband in Tories warning following by-<b>election</b>",
        "description": "The eurosceptic party&#39;s success and the 11% decline in the Tory vote was yet another by-<b>election</b> blow to Prime Minister David Cameron, who saw his candidate defeated by Ukip for the sixth time since the 2010 <b>general election</b>. The Liberal Democrats were ..."
    },
    {
        "url": "https://www.foxnews.com/media/the-view-co-hosts-panicked-possible-third-party-spoiler-biden-theres-no-room",
        "title": "&#39;The View&#39; co-hosts panicked over possible third-party spoiler for Biden: &#39;There&#39;s no room&#39;",
        "description": "&quot;The View&quot; co-hosts appeared panicked on Monday over the possibility of a third-party spoiler for President Biden, and argued that there was &quot;no room&quot; in the race."
    },
    {
        "url": "https://www.foxnews.com/politics/gina-swoboda-activist-trump-becomes-new-arizona-republican-party-chair",
        "title": "Gina Swoboda, activist endorsed by Trump, becomes new Arizona Republican party chair",
        "description": "Gina Swoboda is an election activist who was endorsed by former President Donald Trump. She has become the new chair of the Arizona Republican Party following Jeff DeWit&#39;s resignation."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/trumps-secret-plan-expand-presidential-immunity-1234955710/",
        "title": "Trump’s Secret Plan to Expand Presidential Immunity to ‘King George’ Levels",
        "description": "Trump and his allies are planning to expand presidential immunity to ‘King George’ levels if he beats Joe Biden in the 2024 election."
    },
    {
        "url": "https://apnews.com/article/austin-prostate-cancer-pentagon-return-work-857738bc68539c2825c6a4aed730dd2e",
        "title": "Defense Secretary Lloyd Austin returns to work at the Pentagon after cancer surgery complications",
        "description": "Defense Secretary Lloyd Austin has returned to work at the Pentagon after nearly a month’s absence because of prostate cancer and has been meeting with NATO Secretary General Jens Stoltenberg."
    },
    {
        "url": "https://www.nytimes.com/2024/01/29/us/politics/trump-uaw-shawn-fain.html",
        "title": "Trump Rages at U.A.W. President After Biden Endorsement",
        "description": "The provocation for the former president’s comments appeared to be remarks that Shawn Fain, the union’s leader, made on Sunday."
    },
    {
        "url": "https://www.newsweek.com/fani-willis-georgia-ethics-complaint-wade-1864768",
        "title": "Fani Willis Stung by Ethics Complaint",
        "description": "The Fulton County district attorney has been marred by controversy over an alleged relationship with a member of her staff."
    },
    {
        "url": "https://www.politico.com/newsletters/weekly-score/2024/01/29/the-big-questions-we-have-ahead-of-this-weeks-blockbuster-fundraising-deadline-00138297",
        "title": "The big questions we have ahead of this week’s blockbuster fundraising deadline",
        "description": "Plenty of questions are still hovering over the 2024 cycle. Some clues will be revealed this week. The latest campaign finance reports are due to the Federal Election Commission this Wednesday, covering the final quarter of 2023 for major presidential and congressional campaigns."
    },
    {
        "url": "https://www.yahoo.com/news/wisconsin-redo-election-signals-growing-111052860.html",
        "title": "A Wisconsin redo <b>election</b> signals growing ballot scrutiny in US",
        "description": "A judge tossed out a close Presque Isle vote in Vilas County after discovery of ballot errors, one of at least four such elections in 2023."
    },
    {
        "url": "https://edition.cnn.com/videos/world/2024/01/29/exp-russia-egg-crisis-clare-sebastian-pkg-012912aseg2-cnni-world.cnn?ref=upstract.com",
        "title": "Russian social media trolls ‘egg crisis’ forcing Putin into damage control mode",
        "description": "In the run-up to Russia’s elections in March, President Vladimir Putin wants to project an image of economic stability. But a sharp rise in egg prices tells a different story. CNN’s Clare Sebastian reports."
    },
    {
        "url": "https://www.nytimes.com/2024/01/29/us/politics/biden-trump-election-taylor-swift.html",
        "title": "Inside Biden’s Anti-Trump Battle Plan (and Where Taylor Swift Fits In)",
        "description": "Watching Donald Trump ascend, the newly energized Biden campaign is aiming to make the general election all about him. It’s also hoping for some big endorsements."
    },
    {
        "url": "https://www.cbc.ca/news/politics/trudeau-leadership-review-formal-mechanism-1.7096351",
        "title": "There&#39;s no formal mechanism to make Trudeau face a leadership review — even if MPs wanted one",
        "description": "Even if Liberal MP Ken McDonald had stuck with his initial call for a leadership review of Justin Trudeau, there&#39;s no formal way to make it happen."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13017197/cia-boss-gaza-ceasefire-israel-qatar-egypt-paris.html",
        "title": "CIA boss holds Gaza ceasefire talks with Israeli, Qatari and Egyptian intelligence chiefs in Paris",
        "description": "CIA officials met at a summit in Paris, including CIA director William Burns, Mohammed bin Abdulrahman Al Thani, the prime minister of Qatar , and Mossad chief Dadi Barnea."
    }
]