[
    {
        "url": "https://www.mirror.co.uk/news/politics/critics-say-its-long-rollercoaster-32152067",
        "title": "&#39;Critics say it&#39;s a long rollercoaster ride ahead for Labour - but the panic is over&#39;",
        "description": "Labour secured a double by-election victory on Thursday after a &#39;catastrophic&#39; handling of an anti-semitism row. Keir Mudie believes the party &#39;can hold things together and keep focus&#39;"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-<b>elections</b>: Tory gloom deepens after double poll blow",
        "description": "The results underline the current likelihood, if the mood of the electorate does not shift, of Labour winning the <b>general election</b>. But Labour leader Sir Keir Starmer is going out of his way to avoid even the merest whiff of complacency. More to do despite ..."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/02/17/labour-ready-for-difficult-decisions-in-new-age-of-insecurity-starmer-says/",
        "title": "Labour ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "<b>General election</b> is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the party must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-62064552?at_ptr_name=facebook_page&at_campaign=Social_Flow&at_format=link&at_link_type=web_link&at_bbc_team=editorial&at_link_id=64B0A2A4-CCFF-11EE-90BB-60A2D9B5F045&at_link_origin=BBC_Wales_News&at_campaign_type=owned&at_medium=social",
        "title": "<b>General election</b>: When is the next one and who decides?",
        "description": "Speculation is growing about when the next <b>general election</b> will take place, after the Conservatives lost another two by-<b>elections</b> to Labour. In January, Prime Minister Rishi Sunak said he had expected to call the <b>election</b> &quot;in the second half&quot; of 2024."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/keir-starmer-reportedly-wanted-to-quit-after-2021-byelection-defeat",
        "title": "Keir Starmer reportedly wanted to quit after 2021 byelection defeat",
        "description": "Labour leader thought loss to Tories in Hartlepool meant party going backward, according to new biography"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867902/Nicola-Sturgeon-SNP-supporters-Humza-Yousaf-crisis",
        "title": "Nicola Sturgeon downfall triggers exodus of SNP supporters in crisis for Humza Yousaf",
        "description": "A glaring weakness has been revealed in the SNP’s election chances following the resignation of Nicola Sturgeon. Key to the SNP ’s previous road to Holyrood was a policy focus on middle-class voters. But recent polling analysis shows that that same target group are leaving the party in droves ever since Ms Sturgeon’s resignation."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/keir-starmer-biography-extracts-highlights-b2498023.html",
        "title": "Keir Starmer nearly quit after Hartlepool by-<b>election</b> defeat, says new biography",
        "description": "The by-election loss in May 2021 in the Co Durham constituency was a bitter blow to Sir Keir Starmer and his top team."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-ready-difficult-decisions-age-223000094.html",
        "title": "Labour ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867694/rishi-sunak-general-election-tories-keir-starmer",
        "title": "‘Tory MPs hunting for jobs because they sense humiliating defeat is inevitable’ – pollster",
        "description": "“In American sports parlance (thanks, Taylor Swift), Rishi Sunak is now 1/6 in Conservative by-election defences, his sole victory coming in Boris Johnson ’s symbolic former seat, while the five defeats (four to Labour and one to the Lib Dems) rank as the 2nd, 3rd, 4th, 7th and 9th worst by-election Conservative swings to Labour since the war.”"
    },
    {
        "url": "https://www.heraldscotland.com/news/24126466.ian-murray-labour-can-turn-glasgow-red-next-election/",
        "title": "Ian Murray: Labour can turn Glasgow red at next <b>election</b>",
        "description": "Labour’s shadow Scottish secretary challenged Rishi Sunak to put the country “out of this Tory misery” and call a general election now."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/17/senior-pakistan-official-admits-vote-rigging-election-khan/",
        "title": "Senior Pakistani official admits helping to rig <b>election</b>",
        "description": "A senior Pakistani official on Saturday admitted he helped rig the country’s elections, a week after polls marred by allegations of manipulation returned no clear winner. Liaqat Ali Chattha, commissioner of the garrison city of Rawalpindi, where the country’s powerful military has its headquarters, said he would hand himself over to police."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68326119?at_medium=RSS&at_campaign=KARANGA",
        "title": "Laura Kuenssberg: Tory by-<b>election</b> disaster shows power of ‘sofa vote’",
        "description": "The results this week are as much about Conservative voters staying home as it is about them turning to Labour."
    },
    {
        "url": "https://www.politics.co.uk/5-minute-read/2024/02/17/friend-or-foe-the-conservative-party-misjudges-nigel-farage-at-its-peril/",
        "title": "Friend or foe? The Conservative Party misjudges Nigel Farage at its peril",
        "description": "As they are busy engaging with Nigel Farage, are Conservatives misreading the very threat that he poses to their party."
    },
    {
        "url": "https://uk.yahoo.com/news/trump-heads-york-stormy-daniels-094107651.html",
        "title": "Trump fined $350m in civil fraud trial as judge blasts ‘pathological’ lack of remorse: Live",
        "description": "Former president and co-defendants owe a total of $463.9m including interest after judge rules in favour of New York Attorney General Letitia James"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/ian-murray-scottish-labour-rishi-sunak-mps-scottish-b2497956.html",
        "title": "Labour’s Ian Murray challenges Sunak to name the day for <b>general election</b>",
        "description": "Labour’s shadow Scottish secretary challenged Rishi Sunak to put the country “out of this Tory misery” and call a general election now. Ian Murray said Labour had now set its sights “firmly on first place”."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-bristol-68311119",
        "title": "1990s: Are they coming back?",
        "description": "Andy Howard looks at some of the west country trends from 30 years ago that have been making a comeback."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-<b>election</b> losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/rishi-sunak-conservatives-reform-party-unity-byelection-defeats",
        "title": "Sunak urges right-leaning voters to unite to keep Starmer out of No 10",
        "description": "Prime minister calls for unity after heavy losses to Labour and Reform UK electoral gains"
    },
    {
        "url": "https://www.huffpost.com/entry/trump-debt-legal-losses_n_65d03728e4b0f7fbe7b2c04e",
        "title": "Trump&#39;s Legal Debts Top A Half-Billion Dollars. Will He Have To Pay?",
        "description": "NEW YORK (AP) — Donald Trump ’s legal debts might now exceed a half-billion dollars. A New York judge ordered Trump and his companies Friday to pay $355 million in fines, plus interest, after ruling that he had manipulated his net worth in financial statements."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68323136?at_link_id=5FCCC172-CD5F-11EE-BB70-1B8C4B3AC5C4&at_bbc_team=editorial&at_format=link&at_ptr_name=twitter&at_link_type=web_link&at_campaign_type=owned&at_link_origin=BBCNorthampton",
        "title": "Wellingborough by-<b>election</b>: Five things we learned",
        "description": "The dust has settled, 30,000-odd votes have been counted and Wellingborough has a new MP. The election was called after a recall petition ousted the former member Peter Bone, whose partner was chosen as the Conservative candidate. But what have we learned during the Northamptonshire constituency&#39;s by-election?"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13094013/Reform-UK-leader-Richard-Tice-rejects-pact-Rishi-Sunak.html",
        "title": "Reform UK leader Richard Tice rejects pact with Rishi Sunak as Conservative rebels warn they face &#39;extinction-level event&#39; at <b>election</b> - while Nigel Farage predicts Tory Right ...",
        "description": "Richard Tice ruled out any talk of a deal and said that Tory MPs deserved to lose their jobs due to their &#39;woeful performance&#39;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13094055/Sir-Keir-Starmer-course-35MILLION-war-chest-election-former-Just-Stop-Oil-backer-Dale-Vince-donates-5million-Labour.html",
        "title": "Sir Keir Starmer on course for a £35MILLION war chest for the <b>election</b> as former Just Stop Oil backer Dale Vince donates £5million to Labour",
        "description": "Labour believes it will secure a massive £35million campaign war chest this year, with much of the funds coming from three &#39;mega donors&#39; including from Dale Vince (pictured, right)."
    },
    {
        "url": "https://www.cbc.ca/news/trump-has-been-ordered-to-pay-355-million-us-what-happens-if-he-doesn-t-1.7118701",
        "title": "Trump has been ordered to pay $355 million US. What happens if he doesn&#39;t?",
        "description": "Donald Trump has been ordered to pay nearly $355 million US in penalties for fraudulently overstating his net worth, a New York judge ruled on Friday. But does the former U.S. president have enough money to pay it off?"
    },
    {
        "url": "https://news.yahoo.com/uks-conservatives-track-lose-next-181643468.html",
        "title": "UK&#39;s Conservatives on track to lose next <b>election</b>, critics blast poor migration policy: &#39;People have given up&#39;",
        "description": "By-election results and polling data indicate an increasingly dire picture for the Conservative Party, with the Labour Party likely to win this year&#39;s General Election."
    },
    {
        "url": "https://apnews.com/article/gaza-israel-palestinians-united-nations-unrwa-refugees-3400ea1f1ce125ed2cb4e47cc39bf105",
        "title": "The head of the UN’s lead agency helping Palestinians accuses Israel of seeking to destroy it",
        "description": "The head of the main United Nations agency supporting people in Gaza alleges that Israel is intent on “destroying” the organization along with the idea that Palestinians are refugees who have a right to return home one day."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistans-interim-pm-anwaar-ul-haq-warns-against-anarchy-and-disorder-as-imran-khans-pti-launches-nationwide-agitations/articleshow/107783891.cms",
        "title": "Pakistan&#39;s interim PM Anwaar-ul-Haq warns against &#39;anarchy and disorder&#39; as Imran Khan&#39;s PTI launches nationwide agitations",
        "description": "Pakistan&#39;s interim Prime Minister warns against &#39;anarchy and disorder&#39; during Imran Khan&#39;s nationwide agitation against alleged rigging in recent poll"
    },
    {
        "url": "https://www.nytimes.com/2024/02/17/us/politics/haley-trump-troops-veterans.html",
        "title": "Haley’s Attacks on Trump Over Veterans Aren’t Working, and Could Help Biden",
        "description": "The former governor has sought to link Donald Trump’s disparaging comments about her about husband’s military service to his history of disrespectful comments about a key Republican voting bloc."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4473118-lara-trump-steps-into-political-spotlight-with-rnc-role/",
        "title": "Lara Trump steps into political spotlight with RNC role",
        "description": "Lara Trump is in the political spotlight after her father-in-law Donald Trump tapped her to be co-chair of the Republican National Committee (RNC). She is no stranger to politics, having served as"
    },
    {
        "url": "https://www.cnbc.com/2024/02/17/trump-will-quit-nato-hillary-clinton-says-as-us-commitment-in-question.html",
        "title": "Trump will quit NATO, Hillary Clinton says, as anxiety mounts over U.S. commitment to the alliance",
        "description": "NATO members on Saturday weighed the U.S.&#39;s possible withdrawal from the military alliance if Donald Trump returns to the White House."
    },
    {
        "url": "https://www.foxnews.com/politics/wisconsin-legislature-passes-laws-restricting-ai-produced-deepfake-campaign-materials",
        "title": "Wisconsin legislature passes laws restricting AI-produced deepfake campaign materials",
        "description": "States gear up for general election with new bills regulating AI &quot;deepfakes&quot; in campaign materials, amid a surge in AI integration in campaign ads and voter engagement efforts."
    },
    {
        "url": "https://www.latimes.com/politics/story/2024-02-17/porter-garcia-long-beach",
        "title": "Porter defends ad highlighting little-known GOP rival in Senate race",
        "description": "Porter&#39;s digital ads argue that little-known GOP attorney Eric Early is the true Republican in the Senate race."
    },
    {
        "url": "https://apnews.com/article/south-africa-elections-anc-democratic-alliance-3df5ca5aaf213349b8e929bc4408c69c",
        "title": "South Africa’s main opposition party lays out plans to unseat the African National Congress",
        "description": "Hundreds of South Africans have gathered in the capital to show support for the country’s biggest opposition party as it prepares for a much-anticipated national election."
    },
    {
        "url": "https://www.yahoo.com/news/europe-must-stop-whining-trump-142133993.html",
        "title": "Europe must stop ‘whining about a Trump presidency’, says Netherlands’ PM",
        "description": "Referring to the forthcoming US election, Mr Rutte, who is said to be positioning himself to become the next Nato secretary-general, said the EU had to work with “whoever is on the dancefloor”."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/saving-democracy-central-bidens-campaign-messaging-resonate-swing-107316507",
        "title": "Saving democracy is central to Biden&#39;s campaign messaging. Will it resonate with swing state voters?",
        "description": "As President Joe Biden campaigns for reelection, he&#39;s warning that Donald Trump will be a grave threat to American democracy if he&#39;s in the White House"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/17/senior-pakistan-official-admits-election-rigging-as-protests-grip-country?ref=upstract.com",
        "title": "Senior Pakistan official admits <b>election</b> rigging as protests grip country",
        "description": "Confession by Punjab commissioner exacerbates tension over legitimacy of February general election results"
    },
    {
        "url": "https://www.foxnews.com/world/ukraine-makes-major-troop-withdrawal-key-win-putin-russia",
        "title": "Ukraine makes major troop withdrawal in key win for Putin and Russia",
        "description": "Ukrainian has withdrawn from the town of Avdiivka in the east of the country as it faces acute shortages of ammunition with U.S. military aid delayed for months in Congress."
    },
    {
        "url": "https://www.politico.com/news/2024/02/17/downballot-primary-action-analysis-00141982",
        "title": "Move over GOP presidential primary. The real action is down-ballot.",
        "description": "Massively important primary races lurk just below the surface next month, including fights for House, Senate and governor."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-elections-nawaz-sharifs-pml-n-criticizes-imran-khans-pti-for-requesting-us-intervention-in-rigged-elections/articleshow/107777252.cms",
        "title": "Pakistan <b>elections</b>: Nawaz Sharif&#39;s PML-N criticizes Imran Khan&#39;s PTI for seeking US intervention in &#39;rigged&#39; <b>elections</b>",
        "description": "The Pakistan Muslim League-Nawaz (PML-N) has criticized imprisoned former PM Imran Khan and his party, Pakistan Tehreek-e-Insaf (PTI), for involving t"
    },
    {
        "url": "https://abcnews.go.com/Business/tech-giants-combat-deceptive-deepfakes-ahead-2024-elections/story?id=107296901",
        "title": "Tech giants come together to combat deceptive deepfakes ahead of 2024 <b>elections</b>",
        "description": "Twenty technology companies, including Google, Meta, Microsoft, OpenAI and TikTok vowed to help prevent deceptive uses of AI from interfering with global elections."
    },
    {
        "url": "https://www.nytimes.com/2024/02/17/us/ohio-transgender-candidates-deadname.html",
        "title": "Ohio Law Forces Transgender Candidate to Use Deadname on Ballot",
        "description": "A decades-old rule that requires candidates to list previous names on election paperwork has become an obstacle for all four transgender people seeking state office in Ohio."
    },
    {
        "url": "https://www.marketwatch.com/story/trump-is-backed-further-into-a-financial-corner-after-losing-control-of-his-company-85aa467e",
        "title": "Trump is backed further into a financial corner after losing control of his company",
        "description": "Former President Donald Trump’s ability to maneuver financially will be severely hampered by a ruling against his company that ordered him to pay"
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/17/rfk-jr-super-bowl-ad/72576184007/",
        "title": "RFK Jr&#39;s Super Bowl campaign ad raised candidate profile, but also brings scrutiny",
        "description": "Robert F. Kennedy&#39;s $7 million ad drew attention to his independent presidential campaign, but also criticism for his policies, trading on his legacy."
    },
    {
        "url": "https://news.yahoo.com/people-really-fed-conservative-joins-090251312.html",
        "title": "&#39;People are really fed up&#39;: Conservative joins the race for District 2",
        "description": "Jordan Jurritsma decided to run after a series of controversial decisions made by the current board, controlled by far-right fundamentalist group Ottawa Impact."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/17/biden-israel-support-cost-arab-american-vote/72506837007/",
        "title": "Arab Americans feel &#39;a bone-deep sense of betrayal.&#39; And they want Joe Biden defeated in 2024",
        "description": "Many of Michigan’s Arab Americans are not only vowing to vote against Joe Biden – they are actively campaigning against him."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/rishi-sunak-urged-to-block-convicted-of-sexual-offences-mp",
        "title": "Sunak urged to block anyone convicted of sexual offences from standing as MP",
        "description": "Formal rules to block relevant candidates will make it easier to ‘weed out the bad apples’, politicians say"
    },
    {
        "url": "https://www.bloomberg.com/news/articles/2024-02-17/labour-s-lead-is-firm-reform-gains-five-lessons-from-uk-by-elections",
        "title": "Labour’s Lead Is Firm, Reform Gains: Five Lessons From UK By-<b>Elections</b>",
        "description": "The UK Labour Party handed the governing Conservatives two thumping defeats in a pair of special elections on Thursday in a setback for Prime Minister Rishi Sunak that reinforces the sense that the opposition is on course to win power at a general election due in the next year."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13092843/ANDREW-NEIL-shattering-election-results-Tories-one-option-growth.html",
        "title": "ANDREW NEIL: In the wake of the shattering by-<b>election</b> results, the Tories have only one option: go for growth",
        "description": "The week started rather well for Rishi Sunak and the Conservatives: not a sentence anybody has been able to write for quite some time."
    },
    {
        "url": "https://news.yahoo.com/democrats-blowing-2024-election-110000653.html",
        "title": "The Democrats Are Blowing the 2024 <b>Election</b>",
        "description": "What do Democrats need to do to win in November? The New Republic took up that question this month in a series in which some of the brightest minds offered their best advice to President Biden and his party."
    },
    {
        "url": "https://thehill.com/regulation/court-battles/4473793-trumps-finances-take-massive-hit-legal-blows/",
        "title": "Trump’s finances take massive hit from ‘double whammy’ of legal blows",
        "description": "Donald Trump’s fortune, which he rode to fame and is closely tied to his public identity, could take a massive hit from back-to-back verdicts in two New York civil cases that have resulted in"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13094075/Trump-corrupt-New-York-migrants-fraud-verdict.html",
        "title": "Trump slams &#39;corrupt&#39; New York for letting &#39;the migrants come in and take over&#39; while he gets fined $355million - as he warns the Democrat-run state &#39;is gone and people are ...",
        "description": "Speaking outside his Mar-a-lago resort in Palm Beach, Florida , the 77-year-old went on the offense and lashed out at Engoron and Attorney General Letitia James as well as New York."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68310764.amp",
        "title": "Labour &#39;will put Scotland at heart of government&#39; - Anas Sarwar",
        "description": "Anas Sarwar said the <b>general election</b> would be an opportunity to change Scotland and its fortunes Scotland will be at the heart of the next UK government if Labour are elected, Anas Sarwar has said. The Scottish Labour leader told delegates at his party ..."
    }
]