[
    {
        "url": "https://timesofindia.indiatimes.com/india/negotiations-on-seat-sharing-will-be-on-state-by-state-basis-shashi-tharoor/articleshow/107209389.cms",
        "title": "&quot;Negotiations on seat-sharing will be on state-by-state basis&quot;, Shashi Tharoor",
        "description": "Congress MP Shashi Tharoor says negotiations on seat-sharing for the 2024 Lok Sabha elections between INDIA bloc allies will be taking place on a state-by-state basis. He doubts the ruling BJP-led NDA regime&#39;s prospects to increase their vote share."
    },
    {
        "url": "https://news.yahoo.com/disillusioned-true-blue-tory-stand-171422081.html",
        "title": "‘Disillusioned true blue Tory’ to stand as MP for Richard Tice’s Reform UK",
        "description": "During his two decades as a paid-up member of the Conservative Party, David White could never have imagined he would ever support another party – let alone stand for Parliament with one."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/ed-miliband-blairs-team-dubbed-profanity-prone-brown-office/",
        "title": "Ed Miliband: profanity-prone Gordon Brown’s office was known as ‘Planet F---’",
        "description": "Sir Tony Blair’s team dubbed Gordon Brown’s office “Planet F---” because he swore so much, Ed Miliband has claimed. The former Labour Party leader from 2010 to 2015, Mr Miliband, 54, has been the shadow secretary of state for energy security and net zero since 2021."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/the-threatened-return-of-donald-trump-endangers-the-uk-most-vital-interests",
        "title": "The threatened return of Donald Trump endangers the UK’s most vital interests",
        "description": "British politicians are deluding themselves if they think that the so-called ‘special relationship’ will protect us"
    },
    {
        "url": "https://finance.yahoo.com/news/trump-vs-biden-how-the-2024-election-could-affect-exxon-nvidia-and-other-stocks-150001815.html",
        "title": "Trump vs. Biden: How the 2024 <b>election</b> could affect Exxon, Nvidia, and other stocks",
        "description": "Wall Street isn’t wasting any time contemplating how past policies and priorities from the two leading candidates may impact market performance in the years ahead."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-fundraiser-president-bill-clinton-barack-obama-rcna136020",
        "title": "First-of-its-kind campaign fundraiser in the works with Bill Clinton, Barack Obama and Biden",
        "description": "The Biden campaign is planning a spring fundraiser for the president to appear with his two Democratic predecessors."
    },
    {
        "url": "https://nypost.com/2024/01/28/news/donald-trump-nikki-haley-jockey-for-delegates-in-the-us-virgin-islands/",
        "title": "Donald Trump, Nikki Haley jockey for delegates in the US Virgin Islands",
        "description": "For most of us, an island getaway in winter is the perfect vacation. For surrogates of Donald Trump and Nikki Haley, it’s serious business. The US Virgin Islands’ new caucus system"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/livestream-biden-south-carolina-2024-voters-b2485959.html",
        "title": "Watch live: Joe Biden campaigns in South Carolina as he attempts to woo voters",
        "description": "Watch live as President Joe Biden campaigns in South Carolina as the race for the White House heats up. President Biden will make a pitch to appeal to voters in the state as he kicks off the Democratic Party’s calendar on Sunday, 28 January."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/gop-legislatures-states-seek-ways-undermine-voters-ability-106743539",
        "title": "GOP legislatures in some states seek ways to undermine voters&#39; ability to determine abortion rights",
        "description": "Legislative efforts in Missouri and Mississippi are attempting to prevent voters from having a say over abortion rights"
    },
    {
        "url": "https://nypost.com/2024/01/28/news/senior-trump-campaign-adviser-rules-out-rfk-jr-joining-ticket/",
        "title": "Senior Trump campaign adviser rules out RFK Jr. joining ticket",
        "description": "A top aide to former President Donald Trump ruled out the possibility of tapping environmental lawyer Robert F. Kennedy Jr. as a running mate."
    },
    {
        "url": "https://edition.cnn.com/2024/01/28/politics/trump-republican-senate-leadership/index.html",
        "title": "Trump poses dilemma for Senate GOP leaders after years of battling with McConnell",
        "description": "Speaker Mike Johnson speaks regularly with former President Donald Trump. One member of his leadership team stumped for Trump in New Hampshire. And all the top House leaders have made crystal clear: They are on Team Trump."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/uk-general-election-poll-tracker-conservative-labour/",
        "title": "<b>General election</b> poll tracker",
        "description": "R eform UK is now polling consistently in joint third alongside the Liberal Democrats amid anger at the Conservatives over their handling of illegal migration, The Telegraph’s tracker shows. Richard Tice’s party is holding on to a 10 per cent share of national voting intention, which puts it on an equal footing with the Lib Dems."
    },
    {
        "url": "https://news.yahoo.com/next-general-election-dates-rishi-110844615.html",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "Rishi Sunak attempted to dampen down speculation over the timing of a general election by stating his “working assumption” was that the poll would take place in the second half of the year."
    },
    {
        "url": "https://www.nytimes.com/2024/01/28/us/politics/trump-biden-general-election.html",
        "title": "Trump and Biden Get Ready for the Very Long Haul",
        "description": "The 2024 general election campaign is set to be one of the longest in modern history. There will be no spring break."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/columns/2024/01/28/now-that-desantis-isnt-running-for-president-florida-needs-him/72340908007/",
        "title": "DeSantis ends his bid for president, and Florida awaits | R. Bruce Anderson",
        "description": "There are massive problems facing Florida, and a governor can build a record by finding and implementing the solutions."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/28/rural-voters-favor-trump/72337833007/",
        "title": "Rural voters are (mostly) Trump voters, new poll shows: Why Biden suffers outside cities",
        "description": "With a potential rematch loomimg, rural voters heavily favor former president Donald Trump over President Biden, according to a Colby College poll."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-south-yorkshire-68097394",
        "title": "Rother Valley: Red wall voters look set to perform about-turn",
        "description": "Since its creation in 1918, the parliamentary seat of Rother Valley had always returned a Labour MP, but all that changed when the so-called red wall crumbled in 2019. With another election due later in 2024, the BBC asked voters in the constituency whether time had changed their voting intentions."
    },
    {
        "url": "https://www.cbc.ca/news/politics/ed-broadbent-funeral-1.7091098",
        "title": "Former NDP leader Ed Broadbent will be laid to rest today with a state funeral",
        "description": "Former NDP leader Ed Broadbent — a respected and well-loved figure in Canadian politics for decades — will be laid to rest today in a state funeral in Ottawa."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-trial-defamation-e-jean-carroll-b2486173.html?page=2",
        "title": "Trump news live: E Jean Carroll ‘elated’ after $83m defamation verdict",
        "description": "A jury has determined that Donald Trump must pay E Jean Carroll more than $83m in damages for his defamatory statements about the former Elle magazine writer, marking the year’s first federal court verdict against the former president as he campaigns for his return to the White House."
    },
    {
        "url": "https://www.nytimes.com/2024/01/27/us/politics/south-carolina-biden-speech.html",
        "title": "In South Carolina, Biden Tries to Persuade Black Voters to Reject Trump",
        "description": "President Biden sought to energize his base in the state that propelled him to the White House, but some local leaders said he needed to do more to highlight his achievements."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68120451?at_medium=RSS&at_campaign=KARANGA",
        "title": "Newspaper headlines: &#39;Rwandans get UK asylum&#39; and PM wants &#39;Saga vote&#39;",
        "description": "A former rear admiral suggested it meant the UK was unable to &quot;go toe-to-toe&quot; with Chinese and Russian warships. Meanwhile, the paper&#39;s main image is of Queen Camilla, pictured smiling leaving a central London private hospital where the King is recuperating after a prostate operation."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/28/if-we-win-we-have-to-be-ready-labour-prepares-for-first-100-days-as-tories-slide-into-chaos?ref=mc.news",
        "title": "‘If we win, we have to be ready’: Labour prepares for first 100 days as Tories slide into chaos",
        "description": "In the week an unruly former Conservative minister was slapped down for suggesting yet another change of leader, the opposition was readying itself for government under Starmer’s rigid control"
    },
    {
        "url": "https://www.reuters.com/world/us/trump-says-he-feels-mentally-sharp-after-haley-attacks-his-age-gaffes-2024-01-27/",
        "title": "Trump says he feels mentally sharp after Haley attacks his age, gaffes",
        "description": "Trump has recently made some verbal slip-ups. During a speech on Jan. 19 he confused his rival Nikki Haley with Nancy Pelosi. On occasion he has appeared to slur his words, and he suggested Barack Obama was still in office."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/visakhapatnam/jagan-blows-election-bugle-from-north-ap/articleshow/107196501.cms",
        "title": "Jagan blows <b>election</b> bugle from North AP",
        "description": "Visakhapatnam: Chief minister Y S Jagan Mohan Reddy blew the election bugle from Sangivalasa in Bheemili constituency on Saturday."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/biden-returns-south-carolina-show-determination-win-back-106729473",
        "title": "Biden returns to South Carolina to show his determination to win back Black voters in 2024",
        "description": "President Joe Biden is spending the weekend in South Carolina, intent on driving home two messages: He’s loyal to the state that saved his campaign in 2020 and he’s determined to win back Black voters here and elsewhere who were central to his"
    },
    {
        "url": "https://www.politico.com/news/2024/01/27/youre-the-reason-i-am-president-biden-embraces-black-voters-in-s-c-00138224",
        "title": "‘You’re the reason I am president’: Biden embraces Black voters in S.C.",
        "description": "The president sought to solidify his standing with the key Democratic bloc — and cement the state’s first-in-the-nation status."
    },
    {
        "url": "https://www.thetimes.co.uk/article/snp-should-realise-house-of-lords-not-rotten-comment-nhxfhh0bp",
        "title": "SNP must see it’s not all rotten in the House of Lords",
        "description": "Participating in an effective second chamber would give the Nationalists a toehold at Westminster if they are wiped out in the next general election"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13014553/tory-lee-anderson-party-unite-rishi-sunak-nigel-farage-reform.html",
        "title": "&#39;Stick with Rishi or lose the <b>election</b>&#39;: Ex-deputy Tory chairman Lee Anderson calls for party to &#39;unite&#39; and claims he turned down £400,000 offer to defect to Nigel Farage&#39;s ...",
        "description": "The Tory hardman bailed as deputy party chairman earlier this month so he could go against the government in voting for amendments to the Rwanda bill - despite later admitting he couldn&#39;t do it."
    },
    {
        "url": "https://apnews.com/article/abortion-ballot-initiatives-voters-democracy-2024-602ebb8a74d7ae45163d79c065a23ef0",
        "title": "GOP legislatures in some states seek ways to undermine voters’ ability to determine abortion rights",
        "description": "Legislative efforts in Missouri and Mississippi are attempting to prevent voters from having a say over abortion rights."
    },
    {
        "url": "https://www.usatoday.com/story/opinion/2024/01/28/trump-biden-2024-election-president/72282807007/",
        "title": "Biden vs. Trump inevitable rematch will test the strength and patience of America",
        "description": "It seems inevitable that Donald Trump will face a rematch with President Joe Biden in November. What will it mean for our nation and the world?"
    },
    {
        "url": "https://www.yahoo.com/news/gop-golden-opportunity-nj-governors-053225986.html",
        "title": "GOP has golden opportunity in NJ governor&#39;s race. But will they pick a winner? | Stile",
        "description": "Jon Bramnick wants to reclaim the party&#39;s respect for courts - and elections. But one GOP leader says his Never Trump message is &#39;not going to fly.&#39;"
    },
    {
        "url": "https://apnews.com/article/biden-israel-hamas-hostage-negotiations-progress-dc453b98aea58c87a8c115237cc4e09f",
        "title": "US sees signs of progress on deal to release hostages, bring temporary pause to Israel-Hamas war",
        "description": "U.S. negotiators are making progress on a potential deal in which Israel would pause military operations against Hamas for two months in exchange for the release of more than 100 hostages."
    },
    {
        "url": "https://news.yahoo.com/news/hampshire-exposed-trumps-vulnerabilities-bidens-131805037.html",
        "title": "How New Hampshire exposed Trump&#39;s vulnerabilities and Biden&#39;s path to beat him",
        "description": "Donald Trump is romping his way to the Republican nomination but showing a weakness with independent voters that could doom him against Biden."
    },
    {
        "url": "https://www.politico.com/news/2024/01/27/nikki-haley-donors-00138220",
        "title": "Koch-aligned group tells donors Haley faces steep climb",
        "description": "At a retreat in California, two top advisers with Americans for Prosperity’s political spending group, AFP Action, told donors the Koch-aligned organization will continue with its current ad buys for Haley in South Carolina, according to an AFP Action official with knowledge of the meeting."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-trump-rematch-senators/",
        "title": "On Trump-Biden rematch, many senators say bring it on",
        "description": "While most voters continue to hope for alternatives, Republicans and Democrats in the Senate see the rematch of 2020 nominees as historic moment pitting clearly different visions."
    },
    {
        "url": "https://www.cnn.com/2024/01/27/politics/biden-haley-trump-election-campaign/index.html",
        "title": "Trump faces two-front fight as Biden and Haley hit campaign trail",
        "description": "Donald Trump was pulling up to his plane at LaGuardia Airport, set to travel to Nevada for a campaign rally Saturday, when the news came: A Manhattan jury said the former president should pay the writer E."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4433594-rfk-jr-signals-open-running-as-libertarian-2024/",
        "title": "RFK Jr. signals he’s open to running as Libertarian in 2024",
        "description": "Robert F. Kennedy Jr. signaled he is open to running as a Libertarian Party candidate in 2024 as he continues his quest of getting on the ballot in all 50 states come November. During his"
    }
]