[
    {
        "url": "https://news.yahoo.com/fake-biden-robocall-tells-voters-233945197.html",
        "title": "Fake Biden robocall tells voters to skip New Hampshire primary <b>election</b>",
        "description": "A fake robocall claiming to be from US President Joe Biden Get info without leaving the page. has called voters urging them to stay away from Tuesday&#39;s primary election in New Hampshire. The state&#39;s justice department has opened an investigation into the calls, which are suspected to have been artificially generated."
    },
    {
        "url": "https://www.ibtimes.co.uk/bbc-charter-mid-term-review-calls-better-complaints-handling-diversity-1722911",
        "title": "BBC Charter Mid-Term Review Calls for Better Complaints Handling &amp; Diversity",
        "description": "The UK government has set the pace for BBC reforms by publishing a mid-term review of the 11-year BBC Charter to regain viewers&#39; trust as shown by reduced faith in BBC complaints handling."
    },
    {
        "url": "https://edition.cnn.com/politics/live-news/election-campaign-new-hampshire-01-22-24/index.html",
        "title": "It&#39;s the final day before the New Hampshire primary",
        "description": "GOP candidates Donald Trump and Nikki Haley are making their final appeals to New Hampshire voters with just one day until the state&#39;s pivotal 2024 primary contest. Follow here for the latest updates from the campaign trail."
    },
    {
        "url": "https://www.ibtimes.co.uk/uk-economic-revival-predicted-falling-inflation-tax-cuts-set-stage-growth-1722908",
        "title": "UK Economic Revival Predicted: Falling Inflation and Tax Cuts Set Stage for Growth",
        "description": "A recent study conducted by the EY Item Club, a prominent forecasting body sponsored by EY, suggests that the nation is poised for a resurgence in the latter half of the year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12993387/president-biden-menthol-ban-democrat-states-california-gavin-newsom.html",
        "title": "President Biden is pressured to enact menthol cigarettes ban by over 20 Democrat states including Gavin Newsom&#39;s California as proponents held FUNERAL for flavored tobacco ...",
        "description": "Democrat states are urging President Biden to ban flavored tobacco as his proposal is hanging in limbo due to the threat of alienating black voters ahead of the 2024 election."
    },
    {
        "url": "https://www.ft.com/content/7db6f3f7-d1e7-4c2d-871b-b93e14abf0dd",
        "title": "Voter ID rules could be seen to benefit Conservatives, warns <b>elections</b> watchdog",
        "description": "John Pullinger says forcing voters to carry identification could disenfranchise certain groups at the general election"
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/jan/22/new-hampshire-trump-haley-primary-election-campaign-latest-updates?filterKeyEvents=false&page=with:block-65aeccd68f081fd80444f660",
        "title": "Biden campaign calls for investigation of New Hampshire robocalls impersonating US president – live",
        "description": "A fake robocall circulating New Hampshire uses a voice that sounds like Biden to encourage voters not to participate in Tuesday’s primary"
    },
    {
        "url": "https://www.expressandstar.com/news/world-news/2024/01/22/ai-generated-robocall-impersonates-biden-in-apparent-bid-to-suppress-votes/",
        "title": "AI-generated robocall impersonates Biden in apparent bid to suppress votes",
        "description": "The New Hampshire attorney general’s office said it is investigating reports of an apparent robocall that used artificial intelligence (AI) to mimic US President Joe Biden’s voice and discourage voters in the state from coming to the polls during Tuesday’s primary election."
    },
    {
        "url": "https://uk.pcmag.com/ai/150566/ai-powered-robocall-deepfakes-bidens-voice-to-discourage-primary-voting",
        "title": "AI-Powered Robocall Deepfakes Biden&#39;s Voice to Discourage Primary Voting",
        "description": "The robocall is targeting residents in New Hampshire, which will hold a presidential primary on Tuesday. &#39;Your vote makes a difference in November, not this Tuesday,&#39; it falsely states."
    },
    {
        "url": "https://www.ft.com/content/6b985704-fc5c-4cf8-b7df-9a2719a63bc5",
        "title": "Storm clouds gather across Europe",
        "description": "Guayaquil, home to Ecuador’s largest port and an important hub for the export of bananas and shrimp — as well as illicit cocaine — is being ravaged by violence. Cartels fighting to control trafficking routes are in open rebellion against a government crackdown."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/22/26-per-cent-of-voters-see-sunak-asasset-to-tories/",
        "title": "Only 26 per cent of voters see Sunak as a benefit to Tories",
        "description": "Those closest to Red Wall demographically believe Prime Minister is a liability ‘by a large margin’, think tank poll finds"
    },
    {
        "url": "https://edition.cnn.com/2024/01/22/politics/new-hampshire-trump-voters/index.html",
        "title": "These New Hampshire voters don’t love everything Trump says. But here’s why they’re planning to back him",
        "description": "Andrew Konchek has a long list of complaints about Donald Trump. But there’s one reason he is ready, again, to set all those worrisome things aside."
    },
    {
        "url": "https://www.nottinghampost.com/news/local-news/labour-predicted-win-one-nottinghamshire-9050392",
        "title": "Labour predicted to win all but one Nottinghamshire seat at <b>general election</b> in YouGov poll",
        "description": "The majority of Nottinghamshire could turn red at the next general election, according to the latest YouGov data on voting intentions by constituency. Most voters in seven out of the eight Conservative-held constituencies in the county have said that they would vote for Labour in the upcoming elections."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/truss-sunak-tory-election-manifesto-b2482875.html",
        "title": "Liz Truss to launch ‘Popular Conservatism’ group in bid to shape Tory manifesto",
        "description": "Ms Truss’ latest association joins an extremely crowded field of Conservative groups and factions. It comes hot on the heels of gatherings by the so-called “five families” of the Tory right who tried to toughen up the Rwanda deportation bill."
    },
    {
        "url": "https://www.dailymail.co.uk/news/us-politics/article-12991471/january-6-committee-deleted-files-republican-probe-house-majority.html",
        "title": "Former Jan. 6 Select Committee &#39;deleted more than 100 encrypted files from its probe in the days before Republicans took over the House majority&#39;",
        "description": "The chair of the investigation, Rep. Barry Loudermilk said that the files have been recovered and he&#39;s demanding Democrats hand over the passwords."
    },
    {
        "url": "https://www.thetimes.co.uk/article/britain-cant-build-without-a-trade-revolution-tb7zc8s7w",
        "title": "Britain can’t build without a trade revolution",
        "description": "Target of 300,000 new homes a year remains a myth unless we can plug the serious skills shortfall in UK construction"
    },
    {
        "url": "https://uk.news.yahoo.com/judge-blocks-tighter-rule-same-183830902.html",
        "title": "Judge blocks tighter rule on same-day registraton in North Carolina <b>elections</b>",
        "description": "The preliminary injunction from U.S. District Judge Thomas Schroeder tells <b>elections</b> workers they can&#39;t nullify ballots by screening citizens who register and immediately vote during a 17-day period before a primary or <b>general election</b> through an altered ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/22/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "Rishi Sunak attempted to dampen down speculation over the timing of a <b>general election</b> by stating his “working assumption” was that the poll would take place in the second half of the year. The announcement was intended to head off a planned Labour ..."
    },
    {
        "url": "https://www.lettingagenttoday.co.uk/breaking-news/2024/1/election-year-political-updates-for-agents-from-propertymark",
        "title": "<b>Election</b> Year political updates for agents from Propertymark",
        "description": "Propertymark’s monthly political and government update webinars are set to continue in 2024 - <b>General Election</b> year. A statement from the trade body doesn’t hold back on its self-confidence, saying: “Propertymark has a formidable reputation for ..."
    },
    {
        "url": "https://www.independent.co.uk/business/hunt-will-be-chancellor-at-time-of-election-sunak-says-b2482637.html",
        "title": "Hunt will be Chancellor at time of <b>election</b>, Sunak says",
        "description": "Jeremy Hunt will still be Chancellor at the time of the <b>general election</b> expected later this year, Rishi Sunak has said. The Prime Minister said his finance minister was doing a “fantastic job” at managing the economy after mounting speculation ahead ..."
    },
    {
        "url": "https://www.politico.com/news/2024/01/22/nikki-haley-gender-gop-trump-00137060",
        "title": "Nikki Haley made strides for women in politics. There’s just one problem: Trump",
        "description": "Jennifer Horn, the former chair of the New Hampshire Republican Party, said Haley faces a dilemma on abortion in a GOP primary. But she doesn’t believe Haley went far enough to champion women’s rights in a way that would win over the state’s women and centrist voters."
    },
    {
        "url": "https://abcnews.go.com/538/haley-win-new-hampshire/story?id=106574651",
        "title": "Sure, Haley could win New Hampshire. But then what?",
        "description": "In New Hampshire, however, former U.N. Ambassador Nikki Haley has momentum on her side. Her support in New Hampshire has nearly doubled since December, a trend that puts her in position to win a significant chunk of the state’s 22 delegates,"
    },
    {
        "url": "https://thehill.com/newsletters/technology/4422677-fake-robocalls-in-new-hampshire-stoke-election-misinformation-fears/",
        "title": "Fake robocalls in New Hampshire stoke <b>election</b> misinformation fears",
        "description": "Welcome to The Hill’s Technology newsletter{beacon} Technology Technology   The Big Story Fake Biden robocall spreads in New Hampshire A robocall that appears to be an"
    },
    {
        "url": "https://www.latimes.com/opinion/story/2024-01-22/nikki-haley-ron-desantis-donald-trump-gop-primary",
        "title": "Opinion: The Republican presidential primary has been nothing but a giant grift",
        "description": "After Nikki Haley, Ron DeSantis and other candidates said they would support Donald Trump even if he was convicted, it was obvious they weren&#39;t in the race to defeat Trump."
    },
    {
        "url": "https://abcnews.go.com/538/desantis-shake-trumps-hold-gop/story?id=106557334",
        "title": "DeSantis couldn&#39;t shake Trump&#39;s hold on the GOP",
        "description": "In January 2023, Florida Gov. Ron DeSantis looked like the Republican contender most likely to give former President Donald Trump a serious challenge for the party&#39;s 2024 presidential nomination. But one year later, he didn&#39;t even make it to the first-in-nation New Hampshire primary: On Sunday, DeSantis announced he was suspending his campaign."
    },
    {
        "url": "https://www.washingtonpost.com/washington-post-live/2024/01/22/transcript-election-2024-post-political-roundtable/",
        "title": "Transcript: <b>Election</b> 2024: The Post Political Roundtable",
        "description": "SULLIVAN: [In progress]--everyone, and welcome back to “Election 2024: The Post Political Roundtable.” I’m Sean Sullivan, campaign editor here at The Washington Post, and today we continue our discussion about the 2024 election with some of the top journalists in our newsroom."
    },
    {
        "url": "https://www.yahoo.com/news/deepfake-joe-biden-robocall-told-205615257.html",
        "title": "A deepfake &#39;Joe Biden&#39; robocall told voters to stay home for primary <b>election</b>",
        "description": "According to a statement issued by the New Hampshire attorney general’s office on Monday, a robocall campaign deployed over the weekend used an imitation of President Joe Biden’s voice to urge recipients not to vote in the state’s January 23 presidential primary."
    },
    {
        "url": "https://www.yahoo.com/news/longtime-harlem-lawmaker-inez-dickens-203800630.html",
        "title": "Longtime Harlem lawmaker Inez Dickens to retire as candidates angle to replace her",
        "description": "Assemblywoman Inez Dickens, a Democrat and longtime fixture in Harlem politics, said Monday that she intends to retire, capping a political career that included a stint in the leadership of the New York City Council."
    },
    {
        "url": "https://arstechnica.com/tech-policy/2024/01/robocall-with-artificial-joe-biden-voice-tells-democrats-not-to-vote/",
        "title": "Robocall with artificial Joe Biden voice tells Democrats not to vote",
        "description": "An anti-voting robocall that seems to use an artificially generated version of President Joe Biden&#39;s voice is being investigated by the New Hampshire Attorney General&#39;s office. The calls sent on Sunday told Democrats to avoid voting in the Presidential Primary on January 23."
    },
    {
        "url": "https://apnews.com/article/north-carolina-elections-registration-voting-lawsuits-00c7fc4dc7db53506ebb019de8886e42",
        "title": "Judge blocks tighter rule on same-day registraton in North Carolina <b>elections</b>",
        "description": "A federal judge has blocked for now a new law approved by North Carolina legislators that tightens a rule on when a ballot cast by someone who is simultaneously registering to vote is removed from election counts."
    },
    {
        "url": "https://www.nytimes.com/2024/01/22/business/media/biden-robocall-ai-new-hampshire.html",
        "title": "New Hampshire officials to investigate A.I. robocalls mimicking Biden.",
        "description": "Voters in New Hampshire received robocall messages over the weekend in a voice that was most likely artificially generated to impersonate President Biden’s, urging them not to vote in Tuesday’s primary election, according to the state attorney general’s office."
    },
    {
        "url": "https://www.foxnews.com/media/andrew-yang-casts-doubt-bidens-chances-beat-trump-calls-age-massive-handicap-wrong-candidate",
        "title": "Andrew Yang casts doubt on Biden&#39;s chances to beat Trump, calls age a &#39;massive handicap&#39;: &#39;Wrong candidate&#39;",
        "description": "Former Democratic presidential candidate Andrew Yang called Biden the &#39;wrong candidate&#39; for 2024, casting doubt on the likelihood he could beat Trump in the general election"
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/anti-trump-forces-look-new-hampshires-unique-voter-mix-salvation-rcna134747",
        "title": "Anti-Trump forces look to New Hampshire’s unique voter mix for salvation",
        "description": "New Hampshire’s large population of independent voters has long led to different results than in Iowa. Nikki Haley is counting on them on Tuesday."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/ai-robocalls-impersonate-president-biden-in-an-apparent-attempt-to-suppress-votes-in-new-hampshire",
        "title": "AI robocalls impersonate President Biden in an apparent attempt to suppress votes in New Hampshire",
        "description": "The apparent attempt at voter suppression using generative AI is one example of what experts warn will make 2024 a year of unprecedented election disinformation around the world."
    },
    {
        "url": "https://www.politico.com/news/2024/01/22/dccc-salas-california-election-00136988",
        "title": "Fearing November lockout, DCCC boosts one Dem for California seat",
        "description": "With former President Donald Trump on the ballot, Democrats don’t want to take any chances in this Central Valley swing district."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4422147-trump-federal-jan-6-conviction-impact-poll/",
        "title": "Federal Jan. 6 conviction would hurt Trump most against Biden: Poll",
        "description": "A conviction in former President Trump’s federal trial concerning efforts to overturn the 2020 presidential election would hurt him more than being found guilty in his other cases, a new poll"
    },
    {
        "url": "https://nypost.com/2024/01/22/opinion/democrats-want-to-subvert-the-supreme-court-in-their-war-against-donald-trump/",
        "title": "Democrats want to subvert the Supreme Court in their war against Donald Trump",
        "description": "The biggest threat to the Constitution in 2024 is the “lawfare” being waged against Donald Trump — and the Supreme Court is as much its target as Trump is."
    },
    {
        "url": "https://www.cbsnews.com/news/when-do-polls-open-close-new-hampshire-primary-2024/",
        "title": "When do New Hampshire primary polls open and close? Here&#39;s what time you can vote in tomorrow&#39;s 2024 <b>election</b>",
        "description": "Polling places that close earlier can announce their results once they have them and do not have to wait for other communities to wrap up voting, according to the New Hampshire secretary of state&#39;s office. For example, results in Dixville Notch are typically reported before polling sites are even open elsewhere in the state."
    },
    {
        "url": "https://www.reuters.com/legal/judge-blocks-republican-backed-north-carolina-provision-same-day-voter-2024-01-22/",
        "title": "Judge blocks Republican-backed North Carolina provision on same-day voter registration",
        "description": "A federal judge has blocked North Carolina from implementing a more restrictive verification for voters who register and cast ballots on the same day, agreeing with the state Democratic Party that doing so would cause eligible votes to be thrown out."
    },
    {
        "url": "https://www.bloomberg.com/professional/blog/uk-regulatory-outlook-2024/",
        "title": "UK Regulatory Outlook 2024",
        "description": "With the general election looming, a brand-new regulatory architecture for UK financial services, and a proliferation of issues that require a robust regulatory response, 2024 is set to be a significant year for the UK’s financial regulatory framework."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/22/florida-elections-registration-dates-deadlines-mail-ballots/72312516007/",
        "title": "Florida <b>elections</b>: Add these important dates to your 2024 calendar",
        "description": "Here are the standout dates to add to your calendar ahead of Florida&#39;s 2024 Presidential Preference Primary, Primary and General Election."
    },
    {
        "url": "https://www.usatoday.com/story/news/factcheck/2024/01/22/iowa-caucus-winners-president-success/72288171007/",
        "title": "Claim Iowa voters haven&#39;t picked winning candidate in 24 years overreaches | Fact check",
        "description": "Iowa voters have selected candidates who went on to win the presidency in both GOP and Democratic caucuses, as well as general elections."
    },
    {
        "url": "https://news.yahoo.com/nh-attorney-general-probing-fake-175350202.html",
        "title": "NH Attorney <b>General</b> Probing Fake Joe Biden Voice Urging Dems Not To Vote In Primary",
        "description": "The state&#39;s Election Law Unit is investigating the call, which sounded like a robocall from Biden but was apparently fraudulent."
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/01/22/biden-robocall-new-hampshire-primary/",
        "title": "Fake Biden robocalls urge voters not to vote in New Hampshire primary",
        "description": "The New Hampshire attorney general’s office is investigating complaints of robocalls impersonating President Biden telling voters not to vote in Tuesday’s primary."
    },
    {
        "url": "https://www.forbes.com/sites/greatspeculations/2024/01/22/trump-and-haleys-election-battle-forecasts-defense-industry-trends/",
        "title": "Trump And Haley’s <b>Election</b> Battle Forecasts Defense Industry Trends",
        "description": "It’s important for investors to consider the potential market ramifications of a possible second Trump term. One sector that has come into focus is defense."
    },
    {
        "url": "https://www.cbsnews.com/news/fake-biden-robocall-new-hampshire-primary/",
        "title": "Fake Biden robocall encourages voters to skip New Hampshire Democratic primary",
        "description": "In the recording, a voice sounding like Biden tells Democratic New Hampshire voters to &quot;save&quot; their vote for the November general election."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/biden-justice-department-trump-election-threats-terrorism-fontes-1234950693/",
        "title": "Top Arizona Dem: Biden’s DOJ Is Failing to Protect <b>Election</b> Workers From ‘Domestic Terrorism’",
        "description": "Biden’s Justice Department is too “worried about political blowback” to protect election workers, says Arizona Secretary of State Adrian Fontes."
    },
    {
        "url": "https://www.nbcnews.com/politics/2024-election/fake-joe-biden-robocall-tells-new-hampshire-democrats-not-vote-tuesday-rcna134984",
        "title": "Fake Joe Biden robocall tells New Hampshire Democrats not to vote on Tuesday",
        "description": "The call, an apparent imitation or digital manipulation of the president&#39;s voice, says, &quot;Voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again.&quot;"
    },
    {
        "url": "https://www.nytimes.com/2024/01/22/us/politics/harris-reproductive-rights-tour.html",
        "title": "Biden and Harris Announce Abortion Protections on 51st Anniversary of Roe",
        "description": "Officials said the new steps would help Americans get contraceptives and abortions under an emergency care law as the administration sharpened its message on abortion ahead of the election."
    },
    {
        "url": "https://www.reuters.com/world/us/fake-biden-robo-call-tells-new-hampshire-voters-stay-home-2024-01-22/",
        "title": "Fake Biden robo-call tells New Hampshire voters to stay home",
        "description": "As New Hampshire voters prepared to cast their votes in the state&#39;s first-in-the nation primary Tuesday, a robo-call is circulating in the state urging Democrats to stay home - using a fake audio of U."
    },
    {
        "url": "https://www.foxnews.com/politics/north-dakota-gov-doug-burgum-former-presidential-candidate-wont-seek-third-term",
        "title": "North Dakota Gov. Doug Burgum, former presidential candidate, won&#39;t seek third term",
        "description": "Two-term North Dakota Gov. Doug Burgum, a former presidential candidate, will not seek a third term in office, the governor announced Monday morning."
    },
    {
        "url": "https://www.businessinsider.com/new-hampshire-democrats-received-deep-faked-calls-from-joe-biden-2024-1",
        "title": "New Hampshire voters are getting bogus robocalls with an imitation of Biden&#39;s voice telling them not to vote in the state&#39;s primary",
        "description": "The source of the calls, which pushed Democratic voters to skip the New Hampshire primary, has not been uncovered."
    },
    {
        "url": "https://nypost.com/2024/01/22/news/fake-joe-biden-robocalls-tell-new-hampshire-democrats-to-skip-primary/",
        "title": "Fake ‘Joe Biden’ robocalls tell New Hampshire Democrats not to vote in primary",
        "description": "Deepfakes have arrived at the New Hampshire primary. Ahead of Tuesday’s vote, Granite State Democrats are receiving messages from a voice purporting to be"
    },
    {
        "url": "https://edition.cnn.com/2024/01/22/politics/fake-joe-biden-robocall/index.html",
        "title": "Fake Joe Biden robocall urges New Hampshire voters not to vote in Tuesday’s Democratic primary",
        "description": "A robocall that appears to be an AI voice resembling President Joe Biden is reaching out to New Hampshire residents, advising them against voting in the upcoming Tuesday’s presidential primary and saving their vote for the November general election."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-12990835/Rishi-Sunak-tax-cuts-election-childcare-Budget-Labour-Starmer.html",
        "title": "Rishi Sunak admits &#39;practical issues&#39; with plans to expand free childcare to nine month-olds but says the vow WILL be delivered by September - as he guarantees Jeremy Hunt will ...",
        "description": "Rishi Sunak conceded there are difficulties but played down mounting concerns that the planned expansion of free childcare faces delays."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/jeremy-hunt-rishi-sunak-budget-prime-minister-buckinghamshire-b2482637.html",
        "title": "Hunt will be Chancellor at time of <b>election</b>, Sunak says",
        "description": "It comes after mounting speculation about how long Jeremy Hunt will last in the role ahead of the spring Budget."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68051757?at_medium=RSS&;at_campaign=KARANGA",
        "title": "Ron DeSantis drops out of presidential race and backs Trump",
        "description": "The Florida governor ends his bid for the Republican nomination and endorses Donald Trump ahead of New Hampshire vote."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68051757.amp",
        "title": "Ron DeSantis drops out of presidential race",
        "description": "The Florida governor ends his bid for the Republican nomination and endorses Donald Trump ahead of New Hampshire vote."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-12989885/Theresa-talks-way-millions-club-writes-ANDREW-PIERCE.html",
        "title": "Theresa May talks her way into the millions club, writes ANDREW PIERCE",
        "description": "Despite still being a serving MP, May found time in the last financial year to the end of March 2023 to amass assets of £1.54 million, according to newly released figures."
    },
    {
        "url": "https://www.thetimes.co.uk/article/tories-labour-next-general-election-campaigning-spending-6vzktwqkt",
        "title": "How the Tories and Labour have spent millions on next <b>general election</b>",
        "description": "Both parties have splashed the cash on digital campaigning in a bid to gain traction on platforms such as Facebook and Instagram"
    }
]