[
    {
        "url": "https://edition.cnn.com/politics/live-news/ny-special-election-santos-02-13-24/h_f881eec40932a558f2bd48efa4ef6322",
        "title": "House GOP&#39;s majority shrinks as Democrats flip Santos&#39; New York seat",
        "description": "Democrat Tom Suozzi will win the special election in New York to succeed disgraced former Republican Rep. George Santos, CNN projects, shrinking the House GOP&#39;s narrow majority. Follow here for live news updates,"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sturgeon-resignation-accelerated-snp-s-poll-decline-say-experts-110553/",
        "title": "Sturgeon resignation accelerated SNP’s poll decline, say experts",
        "description": "The year since Nicola Sturgeon’s resignation announcement has accelerated a decline in the SNP’s opinion poll leads, experts have said. However, support for Scottish independence has hardly changed at all in the 12 months since Ms Sturgeon’s Bute House announcement, and has instead proved “stubbornly unwilling to fall”."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/02/15/sunak-braced-for-double-by-election-test-in-wellingborough-and-kingswood/",
        "title": "Sunak braced for double by-<b>election</b> test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/sturgeons-legacy-one-year-since-political-big-fish-resigned-as-first-minister/",
        "title": "Sturgeon’s legacy: One year since political big fish resigned as first minister",
        "description": "Nicola Sturgeon’s name is still at the forefront of Scottish politics one year on from her resignation. A year on from her shock resignation as Scotland’s first minister, Nicola Sturgeon’s legacy has been put under the microscope."
    },
    {
        "url": "https://www.heraldscotland.com/news/24120430.timeline-turbulent-year-snp-sturgeons-shock-exit/",
        "title": "Timeline: Turbulent year for SNP after Sturgeon&#39;s shock exit",
        "description": "The aftermath of her exit saw a fiery leadership battle, a police investigation and a looming <b>general election</b>. Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland&#39;s longest serving first minister told broadcasters she had &quot;plenty ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24120922.timeline-turbulent-year-snp-following-sturgeons-resignation/",
        "title": "Timeline: Turbulent year for SNP following Sturgeon’s resignation",
        "description": "The aftermath of her exit saw a fiery leadership battle, a police investigation and a looming <b>general election</b>. Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland’s longest serving first minister told broadcasters she had “plenty ..."
    },
    {
        "url": "https://www.thenational.scot/news/24120096.general-election-watch-uncertainty-election-certainty/",
        "title": "<b>General Election</b> Watch: Uncertainty is the only <b>election</b> certainty",
        "description": "Welcome to the first edition of General Election Watch. This week we look at what we know so far as the race to get keys to Downing Street underway."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1866789/Rochdale-Labour-Azhar-Ali-leaflet?ref=todayheadlines.live",
        "title": "Labour embarrassment as leaflets praising disgraced candidate Azhar Ali lands on doorsteps",
        "description": "If elected, Mr Ali will sit as an independent MP and will not receive the party whip. The decision means that Labour will also need to find a new candidate to contest the seat at the upcoming <b>general election</b>."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/general-election-2024-poll-tracker-32123308",
        "title": "<b>General election</b> 2024 poll tracker: How do the UK political parties compare",
        "description": "Britain is gearing up for a general election this year after 14 years of Tory rule. Here are the latest polls and odds on Labour, the Conservatives, Reform UK, Lib Dems and more"
    },
    {
        "url": "https://www.politics.co.uk/campaigns/manifestos-general-election-2024/",
        "title": "Manifestos – <b>General Election</b> 2024",
        "description": "As we prepare for a General Election later in 2024, membership bodies and charities will be focusing on their priorities for the next government and the newly elected cohort of MPs. Many of these organisations will publish manifesto documents of their setting out their key policy asks,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1866832/Reform-UK-tory-switchers-one-in-five",
        "title": "Reform UK popularity surges with 2019 Tory voters, with double the support of Labour",
        "description": "Just 37 percent of 2019 Tory voters say they would definitely vote for Mr Sunak if there were an <b>election</b> tomorrow. 22 percent haven’t made up their minds yet. In contrast to one poll on Wednesday morning suggesting Labour’s lead had plummeted by 7 ..."
    },
    {
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/council-bypoll-high-court-restricts-dry-days-to-february-16-and-20-in-bengaluru/articleshow/107704757.cms",
        "title": "Council bypoll: High court restricts dry days to February 16 and 20 in Bengaluru",
        "description": "In a big relief to members of the Bruhat Bengaluru Hotels Association (BBHA) and other stakeholders in the hospitality industry, the high court on Wednesday passed an interim order to partially ease the liquor ban imposed on the city in view of the February 16 byelection to Karnataka Legislative Council for the Bengaluru Teachers constituency."
    },
    {
        "url": "https://theconversation.com/prabowo-subianto-is-likely-to-succeed-in-lifelong-quest-to-become-indonesias-president-what-kind-of-leader-will-he-be-223637",
        "title": "Prabowo Subianto is likely to succeed in lifelong quest to become Indonesia’s president. What kind of leader will he be?",
        "description": "As the former general settles into office, a further gradual dismantling of democratic checks and balances, institutions and individual freedoms is very likely."
    },
    {
        "url": "https://finance.yahoo.com/news/indonesia-stocks-gain-prabowo-win-005402843.html",
        "title": "Indonesia Stocks to Gain as a Prabowo Win Removes <b>Election</b> Risk",
        "description": "Indonesian stocks are set to advance as traders bet on policy continuity after Defense Minister Prabowo Subianto declared victory in Wednesday’s presidential vote.Most Read from BloombergThe Brutal Reality of Plunging Office Values Is HereDip Buyers Wade Back In to Fuel Wall Street Gains: Markets WrapIsrael Pulls Out of Peace Talks Over ‘Delusional’ Hamas DemandsLyft’s CEO Says ‘My Bad’ on Margin Error,"
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-news/tom-suozzi-mazi-pilip-new-york-border-1234967744/",
        "title": "Maybe Killing the Border Deal Wasn’t a Political Masterstroke for the GOP, After All",
        "description": "Democrat Tom Suozzi defeated Republican Mazi Pilip to win back George Santos&#39; vacant seat largely by running on the GOP&#39;s inaction on the border."
    },
    {
        "url": "https://www.axios.com/2024/02/15/tom-suozzi-border-biden-democrats",
        "title": "Democrats see 2024 border blueprint in Suozzi&#39;s New York win",
        "description": "The backdrop: Suozzi is on track to beat Republican Mazi Melesa Pilip by a healthy margin in the race to succeed expelled Republican Rep. George Santos. The election result represented a flip from 2022, when Santos won the seat by eight percentage points. Biden also won it by eight points in 2020."
    },
    {
        "url": "https://www.reuters.com/world/asia-pacific/north-koreas-kim-jong-un-oversees-test-surface-to-sea-missile-kcna-2024-02-14/",
        "title": "North Korea&#39;s Kim Jong Un oversees test of surface-to-sea missile",
        "description": "North Korean leader Kim Jong Un oversaw the inspection test of a new surface-to-sea missile on Wednesday, KCNA said on Thursday."
    },
    {
        "url": "https://www.cbc.ca/radio/asithappens/indonesia-election-human-rights-1.7115596",
        "title": "This former <b>general</b> may be Indonesia&#39;s next president. Human rights advocates are worried",
        "description": "Former general Prawbowo Subianto is on track to win Indonesia’s presidential race, but his controversial human rights allegations is a problem, according to Andreas Harsono, a researcher with Human Rights Watch."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24120922.timeline-turbulent-year-snp-following-sturgeons-resignation/",
        "title": "Timeline: Turbulent year for SNP following Sturgeon’s resignation",
        "description": "Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland’s longest serving first minister told broadcasters she had “plenty left in the tank” as leader. But she closed the chapter on her tenure in charge after more than eight years in the job, on February 15 2023."
    },
    {
        "url": "https://apnews.com/usa-biden-trump-election-2024",
        "title": "Winner of likely rematch between Biden and Trump could have major ramifications around the world",
        "description": "DATE OF ELECTION Nov. 5 TYPE OF ELECTION National, state and local WHO&#39;S RUNNING President Joe Biden and former President Donald Trump are the leading candidates for the Democratic and Republican presidential nominations and will likely face each other in a rematch of 2020 in the general election in November."
    },
    {
        "url": "https://www.politico.com/newsletters/politico-nightly/2024/02/14/nikki-haleys-long-shadow-00141548",
        "title": "Nikki Haley’s long shadow",
        "description": "In 2024, Haley’s version of the progressive left would be the Republican Party’s old establishment. To have such an impact, she’d have to grit her teeth and endorse Trump at some point, as Sanders did with Clinton, and then do just enough to shut down accusations that her supporters cost Trump the election."
    },
    {
        "url": "https://www.yahoo.com/news/virginia-beach-school-board-accepting-223900712.html",
        "title": "Virginia Beach school board accepting applications for vacant seat, plans for special <b>election</b>",
        "description": "The Virginia Beach School Board has begun the process of filling the newly vacant District 4 seat. Within the next 45 days, the board will appoint someone to replace Staci Martin, whose resignation is effective today."
    },
    {
        "url": "https://thehill.com/regulation/court-battles/4468789-trump-special-counsel-jack-smith-supreme-court-jan-6-trial/",
        "title": "Jack Smith urges Supreme Court to reject Trump’s bid to delay Jan. 6 trial",
        "description": "Special counsel Jack Smith quickly voiced opposition to former President Trump’s request for the Supreme Court to delay his federal election subversion trial by freezing a ruling that rejected"
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/will-need-3-4-lakh-paramilitary-personnel-for-lok-sabha-election-ec/articleshow/107702209.cms",
        "title": "Will need 3.4 lakh paramilitary personnel for Lok Sabha <b>election</b>: EC",
        "description": "The Election Commission has requested 3,400 companies of central armed police forces (CAPFs) for the upcoming general elections. The maximum chunk of"
    },
    {
        "url": "https://www.politico.com/newsletters/inside-congress/2024/02/14/surveillance-punt-adds-to-johnsons-losing-streak-00141541",
        "title": "Surveillance punt adds to Johnson’s losing streak",
        "description": "Another day, another headache for Speaker Mike Johnson. This time, it’s deep divisions within his own party that forced him to scrap his plan to bring legislation reauthorizing controversial spy powers to the floor — the second time he’s face-planted on this particular tripwire."
    },
    {
        "url": "https://www.reuters.com/legal/special-counsel-urges-us-supreme-court-rebuff-trump-immunity-fight-2024-02-14/",
        "title": "Special counsel urges US Supreme Court to rebuff Trump in immunity fight",
        "description": "The special counsel prosecuting Donald Trump on federal charges involving the former president&#39;s efforts to overturn his 2020 election loss urged the U.S. Supreme Court on Wednesday to reject Trump&#39;s bid to further delay trial proceedings as he presses his claim of immunity."
    },
    {
        "url": "https://news.yahoo.com/white-house-slams-election-conspiracy-215700938.html",
        "title": "White House slams <b>election</b> conspiracy theories, but won&#39;t talk about Taylor Swift",
        "description": "The White House said Wednesday it wants protecting democracy -- not conspiracy theories -- to be a key message heading into the general election, mentioning the recent conspiracy that alleged Taylor Swift was part of a psyop plot to help President Joe Biden win reelection."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/2024/02/14/tennessee-u-s-rep-mark-green-wont-seek-reelection-to-congress/72605302007/",
        "title": "Tennessee&#39;s U.S. Rep. Mark Green won&#39;t seek reelection to Congress",
        "description": "Clarksville, represents Tennessee&#39;s 7th Congressional District, which includes Montgomery County and parts of Nashville."
    },
    {
        "url": "https://apnews.com/article/phoenix-attorney-state-legislature-ca5f85b3660283c189b08180912f9a70",
        "title": "Phoenix attorney appointed to Arizona Legislature; will fill vacant seat through November <b>election</b>",
        "description": "The Maricopa County Board of Supervisors has appointed Phoenix attorney Charles Lucking to fill a vacancy in the Arizona Legislature."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-15/tasmanian-leaders-agree-state-has-problems/103467408",
        "title": "Tasmanian <b>election</b> to focus on cost of living, health and housing, with minority government and stadium lurking in background",
        "description": "The Liberals, Labor and the Greens have started the Tasmanian election campaign in furious agreement — the state has many problems that need solving."
    },
    {
        "url": "https://news.yahoo.com/conservative-group-tells-judge-no-210624851.html",
        "title": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing",
        "description": "A conservative group has told a Georgia judge that it doesn&#39;t have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later. Texas-based True the Vote filed complaints with Georgia Secretary of State Brad Raffensperger in 2021,"
    },
    {
        "url": "https://www.ft.com/content/2853910d-f654-4344-b4a0-948d8564e1a9",
        "title": "Hunt explores fresh squeeze on public spending to fund tax cuts",
        "description": "Paul Johnson, director of the Institute for Fiscal Studies think-tank, said at the time that funding tax cuts by instigating a bigger squeeze on public service budgets posed a “material risk that those plans prove undeliverable and today’s tax cuts will not prove to be sustainable”."
    },
    {
        "url": "https://www.washingtonpost.com/elections/2024/02/14/democrats-new-york-suozzi-win-immigration/",
        "title": "Democrats see 2024 blueprint in N.Y. <b>election</b> that centered on immigration",
        "description": "But the run-up to November is still strewn with obstacles for President Biden and his party, some strategists and nonpartisan analysts said."
    },
    {
        "url": "https://www.nytimes.com/2024/02/14/world/asia/indonesia-vote-pakistan-coalition-asia.html",
        "title": "Thursday Briefing: Indonesia’s New Leader",
        "description": "Prabowo Subianto was ejected from the military in the late 1990s for his involvement in the torture and abduction of pro-democracy activists. Now, he is projected to win Indonesia’s presidency."
    },
    {
        "url": "https://thehill.com/opinion/4468457-americans-want-action-on-guns-but-republicans-dont-have-a-plan/",
        "title": "Americans want action on guns, but Republicans don’t have a plan",
        "description": "Donald Trump owes us answers for how he plans to solve this public health crisis. Over 300 Americans are shot in the United States every single day. Whether these shootings are intentional or"
    },
    {
        "url": "https://www.nytimes.com/2024/02/13/world/asia/indonesia-election-jokowi-role.html",
        "title": "A Feared Ex-<b>General</b> Appears Set to Become Indonesia’s New Leader",
        "description": "Today’s vote is seen as a referendum on President Joko Widodo, who focused on economic growth but eventually curtailed liberties, critics say."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/14/block-asylum-seekers-from-work-to-make-uk-less-attractive/",
        "title": "Block asylum seekers from working to make UK less attractive, says Robert Jenrick",
        "description": "Bans on asylum seekers working in the UK should be extended to make the country less attractive to illegal migrants, the former immigration minister said."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-byelections-peter-bone-results-b2496002.html",
        "title": "By-<b>elections</b> - LIVE: Peter Bone’s girlfriend aims for Wellingborough seat as Kingswood faces axe",
        "description": "Helen Harrison is running for the Conservative Party in Wellingborough, after her disgraced partner Peter Bone lost the seat in a recall petition having been suspended over bullying and sexual misconduct claims he denies."
    },
    {
        "url": "https://www.huffpost.com/entry/deepfake-porn-taylor-swift-victims_n_65c0979be4b00a3fe367401d",
        "title": "The Issue Of Sexually Explicit Deepfakes Is Far Larger Than Taylor Swift",
        "description": "The pop star&#39;s case is a reminder that bad actors can easily create fake pornographic content without consent, while victims have few legal options."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13084173/Fresh-headache-Keir-Starmer-SNP-force-Commons-vote-Gaza-ceasefire-three-months-Labour-leader-suffered-huge-revolt-partys-MPs-Israel-stance.html",
        "title": "Fresh headache for Keir Starmer as SNP force another Commons vote on a Gaza ceasefire - three months after the Labour leader suffered a huge revolt by his party&#39;s MPs over his ...",
        "description": "It has left the Labour leader facing the prospect of another revolt by his MPs over his stance on the Middle East conflict ahead of the Rochdale by-election."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68285297",
        "title": "What next for the Rochdale by-<b>election</b>?",
        "description": "When the Rochdale by-election was called following the death of the town&#39;s MP Sir Tony Lloyd, it was clear there would be an eventful few weeks ahead. But who could have predicted the twists and turns we&#39;ve seen so far?"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hbxmrc",
        "title": "Indonesia’s <b>General Election</b>",
        "description": "Indonesia’s voters are waiting to learn who has won the Presidential election."
    },
    {
        "url": "https://www.bbc.com/news/world-68295845",
        "title": "AI could &#39;supercharge&#39; <b>election</b> disinformation, US tells the BBC",
        "description": "Artificial intelligence (AI) threatens to &quot;supercharge&quot; disinformation and incite violence at elections, the US deputy attorney general has warned. Speaking exclusively to the BBC, Lisa Monaco described AI as the &quot;ultimate double-edged sword&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13083775/Kieran-Mullan-8th-Tory-MP-elected-Boris-Johnsons-landslide-2019-stand-just-one-term-Parliament-Conservative-exodus-Commons-nears-60-MPs-total.html",
        "title": "Kieran Mullan becomes the 8th Tory MP elected as part of Boris Johnson&#39;s landslide in 2019 to stand down after just one term in Parliament - as Conservative exodus from the ...",
        "description": "The Crewe and Nantwich MP revealed he won&#39;t be seeking re-election in his Cheshire constituency due to redrawn electoral boundaries and &#39;changes in my personal life&#39;."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68295796?at_medium=RSS&at_campaign=KARANGA",
        "title": "Analysis: Tough week tests Keir Starmer&#39;s leadership",
        "description": "Labour will be hoping voters think Sir Keir has shown decisiveness but the crisis in Rochdale has raised questions."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/14/labour-conservatives-rochdale-kingswood-wellingborough-rishi-sunak-keir-starmer-uk-politics-live?page=with:block-65cce5eb8f08140417ebbc4c",
        "title": "Ken Clarke says government is setting an ‘extremely dangerous precedent’ with Rwanda bill – UK politics live",
        "description": "Former Tory home secretary tells House of Lords he hopes the bill will be struck down as ‘unconstitutional’"
    },
    {
        "url": "https://edition.cnn.com/2024/02/14/politics/new-york-special-election-takeaways/index.html",
        "title": "Takeaways from New York’s high-stakes special <b>election</b>",
        "description": "Democrat Tom Suozzi is heading back to Congress after defeating Republican Mazi Pilip in the special election to replace serial fabulist and expelled former GOP Rep. George Santos. The result will further narrow the GOP’s already thin House majority and hand President Joe Biden’s party a boost as the general election campaign comes into focus."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/14/nikki-haley-interview-trump-unhinged-military?ref=upstract.com",
        "title": "Trump is ‘unhinged’ and ‘diminished’, says Nikki Haley",
        "description": "Republican’s last rival for presidential nomination tells NBC News’s Today ‘he is not the same person he was in 2016’"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/14/tory-mp-58th-quit-next-election-conservatives-kieran-mullan/",
        "title": "Tory MP becomes 58th to quit at next <b>election</b> as Conservatives near 1997 record",
        "description": "More Tory MPs are quitting at the next election than at any point since 1997, when 75 stood aside in advance of a contest that saw Labour win a landslide victory under Sir Tony Blair. Rishi Sunak is widely expected to trigger the next national poll in the second half of this year, meaning the threshold could well be reached in the coming months."
    },
    {
        "url": "https://edition.cnn.com/2024/02/14/asia/indonesia-election-prabowo-subianto-intl-hnk/index.html",
        "title": "Ex-army strongman leader claims victory in Indonesian presidential <b>election</b>",
        "description": "A former army general is on course to win Indonesia’s election, securing the majority of votes needed for an outright victory, early unofficial results showed."
    },
    {
        "url": "https://www.ft.com/content/8ce2066f-ed8a-4114-9dae-700ca7ebecd6",
        "title": "Former <b>general</b> Prabowo Subianto projected to win Indonesia presidential <b>election</b>",
        "description": "Indonesians began voting on Wednesday to elect a successor to popular president Joko Widodo, with a former general leading the race to lead the resource-rich nation and its youthful democracy."
    },
    {
        "url": "https://www.huffpost.com/entry/katie-porter-adam-schiff-california_n_65cba631e4b01f4a8b0288fc",
        "title": "Katie Porter Battles For Survival In California Senate Race",
        "description": "The progressive congresswoman is facing a multimillion-dollar barrage of advertising, funded by wealthy donors seeking to end her campaign."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/george-santos-special-election-seat-replacement-b2495036.html",
        "title": "Democrat Tom Suozzi wins New York special <b>election</b> for George Santos’ former seat",
        "description": "Tom Suozzi has delivered a crucial House seat back into the Democrat column after defeating Republican Mazi Pilip in Tuesday’s special election to replace George Santos in New York ’s 3rd district."
    },
    {
        "url": "https://news.yahoo.com/clerk-recorders-office-pushes-back-004600915.html",
        "title": "Clerk and recorder&#39;s office pushes back against budget cuts",
        "description": "The Denver Clerk and Recorder&#39;s Office said it will not be cutting its budget ahead of the general election in November. FOX31&#39;s Vicente Arenas learned details of why the budget cuts would be &quot;concerning."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24120922.timeline-turbulent-year-snp-following-sturgeons-resignation/",
        "title": "Timeline: Turbulent year for SNP following Sturgeon’s resignation",
        "description": "Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland’s longest serving first minister told broadcasters she had “plenty left in the tank” as leader. But she closed the chapter on her tenure in charge after more than eight years in the job, on February 15 2023."
    },
    {
        "url": "https://news.yahoo.com/hunt-considers-uk-public-spending-230412091.html",
        "title": "Hunt Considers UK Public Spending Squeeze to Fund Tax Giveaways",
        "description": "UK Chancellor of the Exchequer Jeremy Hunt is considering cuts to public spending to make room for voter-friendly tax giveaways in his spring Budget, as the governing Conservative Party seeks a boost ahead of a general election expected later this year."
    },
    {
        "url": "https://abcnews.go.com/Politics/white-house-slams-election-conspiracy-theories-talk-taylor/story?id=107236583",
        "title": "White House slams <b>election</b> conspiracy theories, but won&#39;t talk about Taylor Swift",
        "description": "The White House wants protecting democracy -- not conspiracy theories -- to be a key message heading into the general election."
    },
    {
        "url": "https://www.theguardian.com/world/video/2024/feb/14/controversial-former-general-prabowo-subianto-claims-victory-in-indonesia-election-video",
        "title": "Controversial former <b>general</b> Prabowo Subianto claims victory in Indonesia <b>election</b> – video",
        "description": "More than 200 million people were eligible to vote in the election in what was the largest single day vote in the world"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68293800?at_medium=RSS&amp%3Bat_campaign=KARANGA",
        "title": "Prabowo Subianto on track to win Indonesia presidential race - early results",
        "description": "Indonesia&#39;s defence minister Prabowo Subianto is on course to become the country&#39;s next president after early results showed him winning more than half of votes cast in the first round. &quot;This victory is victory for all Indonesians,&quot; he told cheering supporters, hours after polls closed."
    },
    {
        "url": "https://www.ft.com/content/4ece02cc-f58c-4b67-80de-5ed453eb5429",
        "title": "‘Tumbleweed’ Tory campaign leaves Labour hopeful of victory in Wellingborough",
        "description": "Main opposition party hopes to seize on discontent with governing Conservatives in Midlands by-election on Thursday"
    }
]