[
    {
        "url": "https://www.barrons.com/news/tanzania-mps-approve-electoral-reforms-despite-opposition-3307a3d4",
        "title": "Tanzania MPs Approve Electoral Reforms Despite Opposition",
        "description": "Tanzanian lawmakers on Friday approved electoral reforms despite an outcry by the main opposition Chadema party, which has vowed to protest the legislation."
    },
    {
        "url": "https://www.thetimes.co.uk/article/can-labours-poll-lead-transfer-to-scottish-success-at-the-ballot-box-jd6g52hr2",
        "title": "Can Labour’s poll lead transfer to Scottish success at the ballot box?",
        "description": "Sir Keir Starmer’s party is riding high as a general election looms, but there are worries about whether his policies are attractive enough to voters north of the border"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/02/congress-border-bill-trump-georgia-biden-election-politics-latest-updates?filterKeyEvents=false&page=with%3Ablock-65bd17a08f087d8b7094e79f",
        "title": "Fani Willis criticizes ‘wild and reckless’ speculation in conflict of interest claims by former Trump staffer – live",
        "description": "Fulton DA who leads election case against Trump confirms relationship with prosecutor but denies wrongdoing amid ‘extraordinary’ invasion of privacy"
    },
    {
        "url": "https://www.bbc.com/news/world-us-canada-68185611",
        "title": "Times Square attack on police allegedly by migrants stirs immigration row",
        "description": "An attack on police officers in New York City&#39;s Times Square, allegedly by a group of migrants, most of whom were released on bail, has sparked a US election-year political furore. At least 12 suspects were allegedly involved in last weekend&#39;s attack. Six have been arrested."
    },
    {
        "url": "https://www.huffpost.com/entry/nikki-haley-donald-trump-costume_n_65bc902fe4b05c8779f8b0af?ncid=engmodushpmg00000003",
        "title": "Nikki Haley Trolls Donald Trump With Perfect Dress-Up Costume",
        "description": "GOP presidential candidate Nikki Haley taunted her rival, Donald Trump, with a spoof dress-up costume on Thursday. Haley shared an image on X (formerly Twitter) of the parody outfit for “Weakest General Election Candidate Ever.”"
    },
    {
        "url": "https://edition.cnn.com/2024/02/02/politics/economy-jobs-biden-what-matters/index.html?ref=mc.news",
        "title": "Why isn’t the growing economy helping public perception of Biden?",
        "description": "If Punxsutawney Phil saw no shadow, suggesting an early Spring, will Americans look at these new bonkers jobs numbers and begin to warm to “Bidenomics?”"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/",
        "title": "Politics latest news: Labour starts pre-<b>election</b> talks with civil service",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-elections-2024-polls-trump-biden-latest-news-b2489469.html",
        "title": "<b>Election</b> 2024 live updates: Rival polls show Trump and Biden closely matched as Haley hits back",
        "description": "Mr Trump has yet to formally secure the Republican nomination and his challenger Nikki Haley is going after both him and the incumbent president in her latest attack ads, capitalising on the lack of appetite for a rematch of the 2020 contest by characterising the 77 and 81-year-olds as “grumpy old men”."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/02/russia-says-dead-souls-found-among-anti-war-candidate-boris-nadezhdin-backers?ref=mc.news",
        "title": "Russia finds ‘errors’ in paperwork of candidate hoping to stand against Putin",
        "description": "Election commission finding could disqualify Boris Nadezhdin from running in election"
    },
    {
        "url": "https://www.ft.com/content/ba53e42b-14fc-49ce-b971-3072d23ea977",
        "title": "Who still votes Conservative?",
        "description": "Gender, age, religion: the new faultlines in how the UK votes"
    },
    {
        "url": "https://www.independent.co.uk/voices/tories-wrong-tax-business-keir-starmer-b2489494.html",
        "title": "It’s not just the Tories getting it badly wrong on tax and business...",
        "description": "Despite its 20-point lead, Labour is badly faltering on the issues that matter, writes Andrew Grice. Are Keir Starmer’s critics right to say that he represents a continuation of the same old status quo?"
    },
    {
        "url": "https://www.mirror.co.uk/money/labour-refuses-say-still-supports-32027652",
        "title": "Labour refuses to say if it still supports £28bn green investment pledge",
        "description": "Shadow chancellor Rachel Reeves has repeatedly refused to set out whether she is standing by her commitment to spend £28 billion a year on green investment"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68076729?at_link_type=web_link&at_link_origin=BBCNews&at_ptr_name=twitter&at_link_id=4157BCB2-C196-11EE-98E3-F5AFD0B4AF07&at_format=link&at_bbc_team=editorial&at_campaign_type=owned",
        "title": "Wellingborough by-<b>election</b>: Who will make a splash?",
        "description": "Wellingborough voted 62.4% in favour of Brexit in the 2016 EU referendum. Ben Habib, Reform UK&#39;s candidate, said this could give the party, which was formerly the Brexit Party, a good foundation in the by-election. Mr Habib said those who voted to leave the EU &quot;voted for a new social contract which they have not received&quot;."
    },
    {
        "url": "https://edition.cnn.com/2024/02/02/politics/haley-trump-age-morals-wealth-2024-analysis",
        "title": "Haley attacks Trump’s morals, age and wealth as she looks to stave off home state loss",
        "description": "Nikki Haley now says Donald Trump is too old, too confused, too chaotic, and too tantrum-prone to be president — and in a jab likely to especially infuriate her rival, warns he even lacks the money to mount a proper White House run."
    },
    {
        "url": "https://www.barrons.com/news/eu-sanctions-guatemalan-officials-for-undermining-democracy-df189c36",
        "title": "EU Sanctions Guatemalan Officials For &#39;Undermining Democracy&#39;",
        "description": "The European Union on Friday imposed visa bans and asset freezes on five Guatemalan justice officials accused of &quot;undermining democracy&quot; in the Central American country."
    },
    {
        "url": "https://news.yahoo.com/scott-walker-said-college-voters-190602203.html",
        "title": "Scott Walker said college voters’ top issue is the economy, not abortion. Is he right?",
        "description": "Former Wisconsin Gov. Scott Walker said the top issue for college students is the economy, not abortion. What do the polls say?"
    },
    {
        "url": "https://www.yahoo.com/news/election-season-registered-vote-stanislaus-190000512.html",
        "title": "<b>Election</b> season is here, but are you registered to vote in Stanislaus County? What to know",
        "description": "The primary election is on March 5, this guide will provide help if you need to register or have questions about voting."
    },
    {
        "url": "https://www.politico.com/news/2024/02/02/min-weiss-ad-porter-seat-00139366",
        "title": "The race to succeed Katie Porter is getting nasty. Really nasty.",
        "description": "The race for California’s 47th District is considered one of the most competitive in the country and could determine control of the House."
    },
    {
        "url": "https://www.yahoo.com/news/times-square-attack-police-allegedly-184452658.html",
        "title": "Alleged migrant attack on NYC police sparks political uproar",
        "description": "An attack on police officers in New York City&#39;s Times Square, allegedly by a group of migrants, most of whom were released on bail, has sparked a US election-year political furore. At least 12 suspects were allegedly involved in last weekend&#39;s attack. Six have been arrested."
    },
    {
        "url": "https://news.yahoo.com/judge-dismisses-election-officials-mail-164911052.html",
        "title": "Judge dismisses <b>election</b> official&#39;s mail ballot lawsuit in North Dakota",
        "description": "A federal judge in North Dakota has dismissed a lawsuit challenging the acceptance of mail-in ballots after Election Day brought by a county election official and backed by a legal group aligned with former President Donald Trump."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/why-is-nevada-holding-both-a-caucus-and-a-primary",
        "title": "Why is Nevada holding both a caucus and a primary?",
        "description": "A new state law requires Nevada to hold a primary election next week, but the Nevada GOP voted to hold their own caucuses, or party-run meetings open to Republicans only."
    },
    {
        "url": "https://www.livemint.com/industry/infrastructure/for-foreign-capital-to-rush-in-india-must-execute-infra-projects-apace-11706898208683.html",
        "title": "For foreign capital to rush in, India must execute infra projects apace",
        "description": "However, the government should focus on expediting project execution to attract foreign capital to India’s infrastructure sector and speed up the country’s development journey, R. Shankar Raman, the finance chief of the engineering and construction major,"
    },
    {
        "url": "https://www.scmp.com/news/china/military/article/3250764/chinese-military-provincial-heads-unusual-flurry-visits-eastern-theatre-command-support-war-planning",
        "title": "Chinese military: provincial heads in unusual flurry of visits to Eastern Theatre Command to support war planning",
        "description": "Eastern Theatre Command, which is responsible for the East China Sea and Taiwan, received provincial-level party secretaries around time of Taiwan election."
    },
    {
        "url": "https://www.sfgate.com/news/politics/article/ohio-attorney-general-given-until-monday-to-18644832.php",
        "title": "Ohio Attorney <b>General</b> given until Monday to explain rejection of voting rights amendment to court",
        "description": "- Ohio Republican Attorney General Dave Yost speaks during an election night watch party, Nov. 8, 2022, in Columbus, Ohio. A coalition of voting-rights groups is vowing to fight on after Yost issued his second rejection Thursday,"
    },
    {
        "url": "https://nypost.com/2024/02/02/news/da-willis-admits-to-relationship-with-prosecutor-trump-nathan-wade/",
        "title": "Nathan Wade admits to ‘relationship’ with lead prosecutor in Trump <b>election</b> fraud case",
        "description": "Embattled Fulton County District Attorney Fani Willis admitted to having a “personal relationship” with lead prosecutor Nathan Wade."
    },
    {
        "url": "https://www.foxnews.com/politics/haley-trump-trade-shots-over-whos-weakest-general-election-candidate-ever-take-biden",
        "title": "Haley and Trump trade shots over who&#39;s &#39;the weakest <b>general election</b> candidate ever&#39; to take on Biden",
        "description": "GOP presidential candidates Nikki Haley and former President Trump both argue that they&#39;d be the stronger 2024 Republican nominee to take on President Biden in November&#39;s general election"
    },
    {
        "url": "https://thehill.com/homenews/campaign/4444634-trump-cpac-february-conference/",
        "title": "Trump to speak at CPAC this month",
        "description": "Former President Trump is set to speak at the annual Conservative Political Action Conference (CPAC) later this month, the group announced on Friday. Trump was added to the list of confirmed"
    },
    {
        "url": "https://www.cbc.ca/news/canada/new-brunswick/mike-holland-nb-natural-resources-election-bowing-out-politics-1.7102144",
        "title": "Top Saint John minister quitting Higgs cabinet, legislature seat",
        "description": "A top minister in Premier Blaine Higgs’s government says she is resigning from cabinet immediately and will also quit as a member of the legislature &#39;in the near term.&#39;"
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/02/once-again-general-election-vote-is-driven-by-views-trump/",
        "title": "Once again, the <b>general-election</b> vote is driven by views of Trump",
        "description": "Even at the time, the dynamic in the 2020 presidential contest was obvious and uncomplicated. Voters liked Joe Biden well enough but they really didn’t like President Trump. So Republicans mostly turned out to keep Trump in office while Democrats mostly turned out to send him packing."
    },
    {
        "url": "https://abcnews.go.com/Politics/wireStory/haley-insists-shes-staying-gop-race-cause-problems-106888940",
        "title": "Haley insists she&#39;s staying in the GOP race. That could cause problems for Trump.",
        "description": "B.J. Hopper, an 81-year-old self-described “Never Trumper, is doubtful that Haley will catch Trump, but she attended Thursday’s stop in South Carolina’s capital city because she&#39;s trying to be hopeful."
    },
    {
        "url": "https://www.forbes.com/sites/alisondurkee/2024/02/02/will-trumps-criminal-charges-hurt-him-in-the-election-polling-suggests-yes-but-its-unclear-if-cases-will-go-to-trial-in-time/",
        "title": "Will Trump’s Criminal Charges Hurt Him In The <b>Election</b>? Polling Suggests Yes—But It’s Unclear If Cases Will Go To Trial In Time.",
        "description": "Trump’s federal election trial, initially scheduled for March, was taken off the court’s calendar as Trump tries to have it thrown out, which resulted in the case being paused; an appeals court is still deciding how to rule on Trump’s motion, with the issue likely to go to the Supreme Court once they do."
    },
    {
        "url": "https://finance.yahoo.com/news/correction-convocation-extraordinary-general-meeting-160000087.html",
        "title": "Correction: Convocation of the Extraordinary <b>General</b> Meeting of Shareholders of Snaigė AB",
        "description": "Correction: The Meeting’s accounting day – 13 February 2024. On 21 February 2024 the Extraordinary General Meeting of Shareholders of Snaigė AB, the address of head office Pramonės str. 6, Alytus, the company code 249664610 (hereinafter,"
    },
    {
        "url": "https://abcnews.go.com/Politics/presidential-debates-2024-make-difference/story?id=106767559",
        "title": "There may be no more presidential debates in 2024, but will it make much difference?",
        "description": "The 2024 presidential race is barely underway and the last debate may have already happened. Republican front-runner Donald Trump declined to attend any of the five primary debates so far, indicating that he saw no point because of his large polling lead."
    },
    {
        "url": "https://www.newsweek.com/joe-biden-donald-trump-polling-1866413",
        "title": "Joe Biden is Finally Beating Donald Trump in Polls Again",
        "description": "Biden has faced low approval ratings among the American electorate since the withdrawal from Afghanistan in August 2021. Poll analysis website FiveThirtyEight puts Biden on just a 39 percent approval rating, with 54.9 percent disapproving of his presidency."
    },
    {
        "url": "https://www.newsweek.com/donald-trump-jack-smith-election-fraud-trial-delay-judge-tanya-chutkan-supreme-court-1866250",
        "title": "Why Jack Smith&#39;s Trial Date for Donald Trump Case Has Been Delayed",
        "description": "Trump has been seeking to delay his election interference trial until after the presidential election—he may have succeeded"
    },
    {
        "url": "https://nymag.com/intelligencer/2024/02/fani-willis-has-problems-upon-problems.html",
        "title": "Fani Willis Has Problems (Upon Problems)",
        "description": "For over a year now, Fulton County district attorney Fani Willis’s prosecution of former president Donald Trump has been headed toward the shoals. In the past few weeks, the wind has picked up, and it looks like the whole case might run aground. The situation is already bad down in Georgia, but it’s about to get worse."
    },
    {
        "url": "https://www.pbs.org/newshour/politics/what-you-need-to-know-about-nevadas-presidential-primary-and-caucuses",
        "title": "What you need to know about Nevada’s presidential primary and caucuses",
        "description": "Nevada again holds the coveted first-in-the-West slot in the presidential campaign calendar, but this year’s showdown in the Silver State won’t look like it did in previous years."
    },
    {
        "url": "https://www.forbes.com/sites/alisondurkee/2024/02/02/trumps-2024-legal-cases-heres-when-the-ex-president-could-go-to-trial-this-year-as-jack-smiths-election-case-gets-delayed/",
        "title": "Trump’s 2024 Legal Cases: Here’s When The Ex-President Could Go To Trial This Year—As Jack Smith’s <b>Election</b> Case Gets Delayed",
        "description": "The ex-president&#39;s federal election case has been wiped off the court&#39;s calendar, and it&#39;s unclear if it will take place before Election Day."
    },
    {
        "url": "https://www.politico.com/newsletters/politico-pulse/2024/02/02/feds-plan-fall-vax-push-for-older-americans-00139225",
        "title": "Feds plan fall vax push for older Americans",
        "description": "Federal officials are asking groups representing older Americans what they can do to improve Covid-19 vaccine uptake during the next respiratory illness season."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-india-68125968",
        "title": "India&#39;s opposition challenge to Modi may be imploding",
        "description": "In India&#39;s &quot;first past the post&quot; multiparty system where the winner takes it all, a fragmented opposition always benefits a ruling incumbent - in the 2019 general election, Mr Modi&#39;s party received 37% of the popular ballot, but mopped up a whopping 303 of the 543 seats."
    },
    {
        "url": "https://www.huffpost.com/entry/adam-schiff-katie-porter-california_n_65bbe26ee4b05c8779f84e72",
        "title": "Adam Schiff Releases Ad Boosting GOP Opponent In California Senate Race",
        "description": "Schiff holds a lead in the race, according to several polls conducted recently, while Garvey and Rep. Katie Porter (D-Calif.) are battling for second place, and Rep. Barbara Lee (D-Calif.) trails behind them."
    },
    {
        "url": "https://www.thetimes.co.uk/article/why-the-uks-foreign-homebuyers-will-have-to-pay-more-tax-bdbk2r6kp",
        "title": "Why the UK’s foreign homebuyers will have to pay more tax",
        "description": "Whoever wins the election, a stamp duty hike for overseas purchases is due. Plus, how the UK compares with other countries on property taxes"
    },
    {
        "url": "https://edition.cnn.com/2024/02/01/politics/biden-trump-rematch-poll-what-matters/index.html",
        "title": "A Biden-Trump rematch would be mostly about Trump",
        "description": "President Joe Biden may be the incumbent in the White House, but rather than a referendum on Biden and his policies, the coming general election is shaping up to be yet another referendum on former President Donald Trump."
    },
    {
        "url": "https://www.ft.com/content/490ecef0-5b54-4a39-94dd-8be8ffee7a00",
        "title": "FirstFT: Bank losses revive concerns over US commercial real estate",
        "description": "Also in today’s newsletter, Modi’s government promises record level infrastructure spending and US to sanction Israeli settlers"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-68166050.amp",
        "title": "Christopher Steele: Orbis welcomes High Court victory over Trump",
        "description": "A British consultancy that compiled a salacious dossier linking Donald Trump to Russia has welcomed a UK High Court decision to throw out a lawsuit by the former US president. Orbis Business Intelligence - run by ex-MI6 officer Christopher Steele - said it was &quot;delighted&quot; by the ruling."
    },
    {
        "url": "https://edition.cnn.com/2024/02/01/politics/cnn-poll-trump-biden-election-2024/index.html?Date=20240201&Profile=CNN",
        "title": "CNN Poll: Trump narrowly leads Biden in <b>general election</b> rematch",
        "description": "With presidential primaries underway and a 2020 general election rematch seemingly the most likely outcome, a new CNN poll conducted by SSRS shows former President Donald Trump narrowly ahead of President Joe Biden in a matchup shaping up to be a close contest nationally."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13035157/arson-attack-Tory-MP-Mike-Freers-constituency-office-safety.html",
        "title": "Couple appear in court over arson attack at Tory MP Mike Freer&#39;s constituency office as government minister announces he is stepping down because of concerns for his safety",
        "description": "Paul Harwood, 42, and Zara Kasory, 32. were charged last month for setting a shed on fire at the justice minister&#39;s office in North Finchley, London, on Christmas Eve."
    }
]