[
    {
        "url": "https://news.webindia123.com/news/Articles/World/20240218/4169978.html",
        "title": "Pak <b>elections</b>: JUI-F to launch protest against &#39;rigging&#39; in Khyber Pakhtunkhwa",
        "description": "JUI-F provincial president Maulana Ataur Rahman, while addressing a press conference, said his party will stage a protest in Khyber Pakhtunkhwa against the Pakistan Tehreek-e-Insaf (PTI) and the institutions for their bid to push JUIF to the wall and impose &#39;elements&#39;, who &#39;plundered&#39; the province for 10 years."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-sinking-feeling-58-mps-32156072",
        "title": "&#39;Tories sinking feeling as 58 MPs announce plans to abandon Conservative ship&#39;",
        "description": "Some 58 Tory MPs have already announced they are quitting next time around but the figure could top 100 – by some counts even 150"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-patten-prime-minister-nigel-farage-labour-neil-kinnock-b1139917.html",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/football/article-13098215/SPORTS-AGENDA-Man-United-Dan-Ashworth-Labour-candidate-Burnley-Danny-Drinkwater.html",
        "title": "SPORTS AGENDA: Man United may have to share Dan Ashworth, disgraced Labour candidate causes Burnley a headache... while Danny Drinkwater kicks off a row with his neighbours",
        "description": "The former FA director of elite development is set to join the Ineos revolution as sporting director in the coming days, although there will be a period of gardening leave."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/18/evm-a-path-to-transparency/",
        "title": "EVM: A path to transparency",
        "description": "Pakistan&#39;s electoral history has been a tale of challenges and aspirations, with each election cycle presenting an opportunity for progress. With the recent General Election on February 8, Pakistan fi"
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/18/pti-demands-judicial-probe-into-pindi-commissioners-revelations/",
        "title": "PTI demands judicial probe into Pindi commissioner’s ‘revelations’",
        "description": "Barrister Gohar regrets despite winning 180 NA seats, party’s success was not reflected in resultsOmar Ayub Khan asserts party would form govts in Centre, provincesISLAMABAD: The Pakista"
    },
    {
        "url": "https://www.itv.com/watch/news/badenoch-hits-back-at-ex-post-office-chair-who-says-he-was-told-to-slow-payments-to-help-tories/vq2fzl9",
        "title": "Badenoch hits back at ex-Post Office chair who says he was told to &#39;slow payments&#39; to help Tories",
        "description": "Watch the latest from ITV News - Henry Staunton has claimed he was told by a senior civil servant to &#39;stall&#39; compensation payouts so that the government could &#39;limp&#39; to the general election."
    },
    {
        "url": "https://inews.co.uk/news/politics/tax-cuts-without-slashing-public-spending-hunt-2912540?ico=more_from_this_author",
        "title": "Tax cuts still possible without slashing public spending, Hunt believes",
        "description": "Mr Hunt and Rishi Sunak are still eyeing up tax cuts in the 6 March Budget, a key moment for Tory poll prospects"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/18/former-post-office-boss-stall-horizon-compensation-payouts",
        "title": "Ministers deny claims government wanted to stall Post Office Horizon scandal payouts",
        "description": "Henry Staunton claims request was made so government could ‘limp into’ the next general election"
    },
    {
        "url": "https://uk.news.yahoo.com/haley-bashes-trump-continued-silence-162801848.html",
        "title": "Haley bashes Trump for continued silence on Navalny death",
        "description": "Donald Trump&#39;s last remaining Republican rival for the US election in November bashed the ex-president Sunday for his continued silence over the death of Russian opposition leader Alexei Navalny and his recent outburst over NATO."
    },
    {
        "url": "https://www.gg2.net/protests-erupt-in-pakistan-as-imran-khan-supporters-clash-with-police/",
        "title": "Protests erupt in Pakistan as Imran Khan supporters clash with police",
        "description": "SUPPORTERS of Pakistan’s jailed former prime minister Imran Khan’s party have clashed with police in various cities across the country as they staged protests"
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/national/24127254.labour-cant-stop-fighting-second-ahead-general-election---starmer/",
        "title": "Labour ‘can’t stop fighting for a second’ ahead of <b>general election</b> – Starmer",
        "description": "The Labour leader warned his party that the ‘volatile’ nature of politics means the Tories could still win another term in power."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/kemi-badenoch-post-office-government-jonathan-reynolds-house-of-commons-b2498204.html",
        "title": "Kemi Badenoch hits out at former Post Office chairman in Horizon row",
        "description": "The Government has denied Henry Staunton’s claim that he was told by a senior civil servant to ‘stall’ spending on compensation to subpostmasters."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/michael-tomlinson-guarantee-flights-rwanda-election-b2498158.html",
        "title": "Minister claims he can guarantee flights to Rwanda before <b>general election</b>",
        "description": "Illegal migration minister Michael Tomlinson has said he can guarantee flights carrying asylum seekers to Rwanda will take off before the next election as he defended the government&#39;s floundering plans to ‘stop the boats ’. Rishi Sunak has repeatedly refused to go that far, saying his aim is to get planes in the air."
    },
    {
        "url": "https://uk.news.yahoo.com/michigan-gop-nominating-process-appears-151719935.html",
        "title": "Michigan’s GOP Nominating Process Appears Headed For Chaos",
        "description": "As early in-person voting began on Saturday in Michigan, a fight for control of the GOP in the crucial battleground state plunged Republicans there deeper into a political maelstrom, with rival factions potentially barreling toward hosting dueling nominating conventions."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68325984",
        "title": "Kuenssberg to quiz minister after Tory by-<b>election</b> losses",
        "description": "Michael Tomlinson will appear on Sunday with Laura Kuenssberg after the Conservatives&#39; by-election losses this week."
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "<b>General election</b> is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the party must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/poll-only-a-third-of-2019-conservative-voters-will-back-tories-at-next-general-election_uk_65cde54be4b0087d43c93acb?mc_cid=5e83b15a6f",
        "title": "Only A Third Of 2019 Conservative Voters Will Back Tories At Next <b>General Election</b>, Says Poll",
        "description": "Only a third of voters who backed the Conservatives in 2019 will vote for the party again at the next <b>general election</b>, according to a new poll. On Thursday, YouGov and WPI Strategy revealed that out of 4,000 voters who supported the Tories, just 37% would ..."
    },
    {
        "url": "https://news.sky.com/story/kemi-badenoch-hits-back-at-former-post-office-boss-in-horizon-compensation-row-13075008",
        "title": "Kemi Badenoch hits back at former Post Office boss in Horizon compensation row",
        "description": "Business Secretary Kemi Badenoch has hit out at the former Post Office chairman after he alleged he was told to &quot;stall&quot; spending on compensation for Horizon scandal victims ahead of the next general election."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "Rishi Sunak warned against &#39;playing footsie&#39; with Nigel Farage and Reform UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://www.politico.com/news/2024/02/18/john-bolton-trump-russia-putin-00142078",
        "title": "John Bolton: ‘If Trump is elected there will be celebrations in the Kremlin’",
        "description": "White House National Security Advisor John Bolton (right), listens to President Donald Trump as he and Dutch Prime Minister Mark Rutte talk to reporters in the Oval Office at the White House July 18, 2019, in Washington, D.C. | Chip Semodevilla/Getty Images"
    },
    {
        "url": "https://www.cbsnews.com/pittsburgh/news/saving-democracy-is-central-to-bidens-campaign-messaging-will-it-resonate-with-swing-state-voters-2/",
        "title": "Saving democracy is central to Biden&#39;s campaign messaging. Will it resonate with swing state voters?",
        "description": "As President Joe Biden campaigns for reelection, he&#39;s warning that Donald Trump will be a grave threat to American democracy if he&#39;s in the White House."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/19/now-pindi-rpo-moves-on-15-day-leave-amidst-poll-rigging-allegations/",
        "title": "‘Now’ Pindi RPO moves on 15-day leave amidst poll rigging allegations",
        "description": "RAWALPINDI: A day after Rawalpindi Commissioner Liaquat Ali Chattah confession to having been involved in rigging the recently concluded general elections, the Garrison city&#39;s regional police officer,"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/post-office-chairman-slow-payments-tories-limp-election/",
        "title": "Badenoch accuses former Post Office boss of lying in Horizon row",
        "description": "Business Secretary, who sacked Henry Staunton, rejects his claims that Government wanted to delay compensation payouts to sub-postmasters"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/general-election-conservative-tory-boris-johnson-leadership/",
        "title": "Tory Party under Boris Johnson could regain votes of ‘lost Conservatives’",
        "description": "Among the “lost Conservatives”, who said they won’t vote Tory at the next election but don’t know who to vote for, 52 per cent said they would vote for Mr Johnson over Sir Keir. This is compared to 39 per cent saying they would vote for the current Prime Minister over the Labour leader."
    },
    {
        "url": "https://news.yahoo.com/hillary-clinton-warns-trump-seek-185926558.html",
        "title": "Hillary Clinton warns Trump will seek to withdraw U.S. from NATO if elected",
        "description": "Former Secretary of State Hillary Clinton warned Saturday that former President Donald Trump will seek to withdraw the U.S. from NATO if he wins a second term in the White House."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868055/Pollster-john-curtice-Labour-government",
        "title": "Pollster John Curtice predicts &#39;trouble&#39; for Labour within months of getting keys to No10",
        "description": "A renowned political scientist predicts that Labour will be “in trouble” within a year and a half of forming the next Government if they win the <b>general election</b>. Sir Keir Starmer is widely predicted to be entering No10 following the next <b>general</b> ..."
    },
    {
        "url": "https://www.itv.com/watch/news/full-of-lies-badenoch-hits-back-at-ex-post-office-chair-who-says-he-was-told-to-stall-payouts/vq2fzl9",
        "title": "&#39;Full of lies&#39;: Badenoch hits back at ex-Post Office chair who says he was told to &#39;stall&#39; payouts",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://news.stv.tv/politics/anas-sarwar-calls-on-scottish-labour-to-build-on-future-uk-general-election-victory",
        "title": "Sarwar calls on Labour to ‘build on’ future UK <b>general election</b> victory",
        "description": "Scottish Labour leader Anas Sarwar said a win for Labour in the UK general election could help the party return to power at Holyrood."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13097021/Post-Office-Staunton-Horizon-government-compensation-postmasters-election.html",
        "title": "Ex-Post Office chair claims government told him to delay compensation for postmasters until after the <b>election</b>",
        "description": "The Government has flatly denied claims by the former Post Office chairman that he was told to &#39;stall&#39; on compensation ahead of the general election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/scottish-labour-tories-snp-humza-yousaf-downing-street-b2498201.html",
        "title": "Labour ‘can’t stop fighting for a second’ ahead of <b>general election</b> – Starmer",
        "description": "The Labour leader warned his party that the ‘volatile’ nature of politics means the Tories could still win another term in power."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/18/neil-kinnock-says-he-is-convinced-labour-general-election",
        "title": "Neil Kinnock says he is ‘convinced’ Labour will win <b>general election</b>",
        "description": "Former party leader says he won’t compare race to 1992 or 1997, but he is ‘convinced now that we’re not going to lose’"
    },
    {
        "url": "https://edition.cnn.com/2024/02/18/politics/kamala-harris-biden-reelection-effort/index.html",
        "title": "Inside Kamala Harris’ quiet effort to break through the Biden campaign’s information bubble",
        "description": "With Democratic leaders around the country panicking over President Joe Biden’s reelection campaign, Vice President Kamala Harris has quietly been adding meetings, phone calls, deliberate run-ins made to feel happenstance."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13095069/PETER-HITCHENS-General-Election-vote.html",
        "title": "PETER HITCHENS: At the coming <b>General Election</b>, vote for &#39;None of The Below&#39;. It&#39;s the only way to get the parties we deserve",
        "description": "At the coming Election, nobody will get what they vote for, even if their party wins. Tory voters will not get a conservative government, or even a Conservative one."
    },
    {
        "url": "https://www.ft.com/content/8867cf98-9c8f-48de-b8fa-2a4ed8002132",
        "title": "English private schools focus on recruiting overseas as Labour VAT hit looms",
        "description": "Private schools in England are seeking to attract more overseas students as they prepare for the prospect of Labour imposing a sales tax on their fees if it wins the next general election."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68329702",
        "title": "Newspaper headlines: Starmer &#39;attacks Trump&#39; and &#39;No way back for Harry&#39;",
        "description": "Comments by the Labour leader on Nato and Prince Harry&#39;s reported offer to return to royal duties lead the papers."
    },
    {
        "url": "https://www.thetimes.co.uk/article/reform-uk-threat-tories-party-by-election-2024-rstz5nl59",
        "title": "Tories fear Reform already — but Nigel Farage would make it terror",
        "description": "The party can’t win many seats, it has little money and its leader has a low profile. But the Conservatives are still nervous about the Farage effect following a bruising by-election"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/i-call-keir-1001-election-32155887",
        "title": "&#39;I will call Keir at 10.01 on <b>election</b> night to make sure the North gets what it deserves&#39;",
        "description": "Choosing his words carefully, he says: “I think the <b>general</b> feeling is that people are particularly ... Now 62, Steve fondly recalls being a toddler during the 1966 <b>election</b> victory of Harold Wilson – who knew his dad, Labour councillor Harry ..."
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-19/familiar-candidates-rear-heads-tasmanian-election/103476268",
        "title": "Candidates are being finalised for Tasmania&#39;s <b>election</b> — with no shortage of familiar faces",
        "description": "Former federal candidates Simon Davis and Chris Lynch are running for the lower house, having missed in Clark and Braddon at the most recent federal election. Three more candidates are on local councils. But Labor has also been able to secure the first-time candidacy of several high-profile community members."
    },
    {
        "url": "https://news.yahoo.com/cruz-says-doesn-t-know-180835530.html",
        "title": "Cruz says he doesn’t know if McConnell runs for reelection if Trump wins White House",
        "description": "Sen. Ted Cruz (R-Texas) on Sunday said he is unsure if Senate Minority Leader Mitch McConnell (R-Ky.) will run for reelection if former President Trump takes back the White House in November, given the frequent tension between the two men."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68330465",
        "title": "Post Office scandal: Kemi Badenoch hits back at Henry Staunton",
        "description": "The government says it &quot;utterly refutes&quot; claims by the Post Office&#39;s former chairman that he was ordered to delay compensation payments to victims in the Horizon scandal. Henry Staunton told the Sunday Times he was given instructions to &quot;stall&quot; payments ahead of the election."
    },
    {
        "url": "https://nypost.com/2024/02/18/us-news/nikki-haley-wont-say-shell-back-trump-if-he-wins-the-nod-despite-debate-pledge/",
        "title": "Nikki Haley won’t say she’ll back Trump if he wins the nod — despite debate pledge",
        "description": "Republican presidential hopeful Nikki Haley sidestepped whether she is still committed to backing former President Donald Trump should he clinch the GOP nomination."
    },
    {
        "url": "https://inews.co.uk/news/politics/tax-cuts-without-slashing-public-spending-hunt-2912540?ITO=msn",
        "title": "Tax cuts still possible without slashing public spending, Hunt believes",
        "description": "Mr Hunt and Rishi Sunak are still eyeing up tax cuts in the 6 March Budget, a key moment for Tory poll prospects"
    },
    {
        "url": "https://news.stv.tv/politics/tories-could-still-win-next-uk-election-starmer-warns-in-glasgow-speech",
        "title": "Tories could still win next <b>election</b>, Starmer warns in Glasgow speech",
        "description": "Keir Starmer has warned the Tories could still win the next UK general election – despite the party consistently polling around 20 points ahead of their rivals. Speaking to Scottish Labour members on the last day of the party’s conference in Glasgow, the Labour leader took aim at the SNP for claiming Labour is almost certain to win the next ballot."
    },
    {
        "url": "https://www.newsweek.com/rashida-tlaib-slammed-urging-voters-withhold-support-joe-biden-1871006",
        "title": "Rashida Tlaib Slammed for Urging Voters to Withhold Support for Joe Biden",
        "description": "Tlaib told the people of Michigan to vote &quot;uncommitted&quot; in the primary if they want their calls for a ceasefire in Gaza heard."
    },
    {
        "url": "https://www.cityam.com/uk-hints-at-fresh-sanctions-after-navalnys-death-in-russia/",
        "title": "UK hints at fresh sanctions after Navalny’s death in Russia",
        "description": "The UK could launch fresh sanctions against Russia after the death of Russian dissident Alexei Navalny, the foreign secretary has hinted."
    },
    {
        "url": "https://abcnews.go.com/Politics/charlamagne-tha-god-trump-biden-rematch-threat-democracy/story?id=107320336",
        "title": "Charlamagne tha God on Trump-Biden rematch: A &#39;threat to democracy&#39; vs. &#39;uninspiring candidate&#39;",
        "description": "Charlamagne tha God said on ABC News&#39; &quot;This Week&quot; that &quot;nobody is inspired&quot; by the 2024 election and &quot;nobody wants to see&quot; the likely rematch between Biden and Trump."
    },
    {
        "url": "https://nypost.com/2024/02/18/us-news/donald-trump-speaks-of-new-n-word/",
        "title": "Trump speaks of new ‘N-word,’ compares himself to Al Capone in off-script moment at rally in wake of legal woes",
        "description": "Former President Donald Trump lashed out at the slew of judges and prosecutors targeting him during a rally in Waterford Township, Michigan Saturday."
    },
    {
        "url": "https://www.politico.com/newsletters/playbook/2024/02/18/piercing-the-biden-bubble-00142066",
        "title": "Playbook: Piercing the Biden ‘bubble’",
        "description": "President JOE BIDEN “makes his debut in our rankings at No. 14, putting him in the top third of American presidents,” Justin Vaughn and Brandon Rottinghaus, two academics who lead the project, write in the L."
    },
    {
        "url": "https://news.yahoo.com/local-election-officials-prepping-busy-151100790.html",
        "title": "Local <b>election</b> officials prepping for busy presidential <b>election</b> year",
        "description": "Local election officials are gearing up for a busy election year, though voter turnout for the March 19 election may not be as high as anticipated, given the narrowing down of presidential candidates ahead of Election Day."
    },
    {
        "url": "https://www.scotsman.com/news/politics/sir-keir-starmer-says-north-sea-oil-and-gas-will-continue-for-decades-to-come-4523081",
        "title": "Sir Keir Starmer says North Sea oil and gas will continue ‘for decades to come’",
        "description": "Sir Keir Starmer has insisted work in the North Sea oil and gas sector will continue “for decades to come” as his party continues to face criticism from the industry. It came as the UK Labour leader made a direct appeal to Scots who “have found a new political home with the SNP” to return to his party."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/national/24127264.sarwar-calls-scottish-labour-build-on-future-uk-general-election-victory/",
        "title": "Sarwar calls on Scottish Labour to ‘build on’ future UK <b>general election</b> victory",
        "description": "Scottish Labour leader Anas Sarwar has said his party needs to “build on” a Labour <b>general election</b> victory to help it return to power at Holyrood. With Labour widely expected to form the next UK government after the <b>election</b> – due to take place ..."
    },
    {
        "url": "https://www.forbes.com/sites/maryroeloffs/2024/02/18/users-report-x-down-in-pakistan-after-official-admits-election-rigging/",
        "title": "Users Report X Down In Pakistan After Official Admits <b>Election</b> Rigging",
        "description": "There was no clear winner in Pakistan&#39;s election earlier this month and, on Saturday, a senior bureaucrat admitted to helping rig the results."
    },
    {
        "url": "https://www.yahoo.com/news/california-city-voter-id-law-130000968.html",
        "title": "A California city has a voter ID law on the ballot. It’s MAGA hogwash | Opinion",
        "description": "The Southern California city famous for its surf culture is asking voters to approve a law that would permit poll workers to ask voters to show an ID. It’s another attempt to undermine confidence in our elections by falsely implying that voter fraud is rampant in California, even in conservative-leaning Orange County."
    },
    {
        "url": "https://www.yahoo.com/news/el-paso-district-attorney-candidates-120303181.html",
        "title": "El Paso District Attorney candidates fight to return office to Democratic leadership",
        "description": "For the first time in more than three decades Democrats are fighting to take back the district attorney&#39;s office."
    },
    {
        "url": "https://www.businessinsider.com/california-senate-candidates-housing-homelessness-porter-schiff-barbara-lee-garvey-2024-2",
        "title": "How the candidates running for Dianne Feinstein&#39;s Senate seat say they&#39;ll solve California&#39;s housing crisis",
        "description": "Housing affordability and homelessness are two of the top issues on California voters&#39; minds. It could inform their decision in the March 5th Senate primary."
    },
    {
        "url": "https://abcnews.go.com/International/wireStory/former-thai-prime-minister-thaksin-released-parole-after-107322391",
        "title": "Thai ex-Prime Minister Thaksin gets free on parole, but can he restore his old political luster?",
        "description": "Former Thai Prime Minister Thaksin Shinawatra has been released on parole from a Bangkok hospital where he spent six months serving time for corruption-related offenses"
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/amid-allegations-of-mass-vote-rigging-could-2024-pakistan-election-results-be-declared-null-and-void/articleshow/107796285.cms",
        "title": "Amid allegations of mass vote rigging, could 2024 Pakistan <b>election</b> results be declared null and void?",
        "description": "Amid allegations of mass vote rigging, could the 2024 Pakistan election results be declared null and void? Read more to find out."
    },
    {
        "url": "https://www.latimes.com/california/story/2024-02-18/la-congressional-district-30-election-candidates",
        "title": "Inside the crowded field of L.A. congressional candidates in the race to replace Schiff",
        "description": "Rep. Adam Schiff&#39;s decision to run for Senate opened the floodgates, with 15 people vying to replace him and represent a district that includes a wide swath of Los Angeles, all of West Hollywood, Glendale and Burbank,"
    },
    {
        "url": "https://www.latimes.com/world-nation/story/2024-02-18/thai-ex-prime-minister-thaksin-is-free-on-parole-but-can-he-restore-old-political-luster",
        "title": "Thai ex-Prime Minister Thaksin is free on parole, but can he restore old political luster?",
        "description": "Former Thai Prime Minister Thaksin Shinawatra has been released on parole from a hospital where he spent months serving time for corruption-related offenses."
    },
    {
        "url": "https://www.bbc.com/news/live/uk-politics-68325984/page/2",
        "title": "By-<b>election</b> losses came against &#39;very difficult backdrop&#39;, says Tory minister",
        "description": "Prime Minister Rishi Sunak responded to the defeats on Friday morning saying there were “particularly challenging” circumstances surrounding the two-by-elections, while Labour leader Sir Keir Starmer said the results showed the country wanted change."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/2024/02/18/presidents-day-from-truman-to-trump-florida-has-presidential-landmarks/72596923007/",
        "title": "Presidents Day: From FDR to Truman to Trump, Florida has list of presidential landmarks",
        "description": "The Sunshine State, which has not seen a favorite son ever elected to the Oval Office, has a rich presidential history trail nonetheless."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/18/trump-waterford-speech-highlights/72583897007/",
        "title": "&#39;If we win Michigan, we win the <b>election</b>&#39;: 5 things Trump focused on in pre-primary speech",
        "description": "What stood out about the speech given by former President Trump in Oakland County on Saturday? Here&#39;s a quick rundown."
    },
    {
        "url": "https://thehill.com/homenews/campaign/4472379-who-is-michael-whatley-trumps-pick-to-lead-rnc/",
        "title": "Who is Michael Whatley, Trump’s pick to lead RNC",
        "description": "North Carolina Republican Party Chair Michael Whatley has been thrust into the national spotlight after former President Trump backed him to serve as the next leader of the Republican National"
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/jamiat-ulema-e-islam-fazl-jui-f-to-launch-protest-against-rigging-in-khyber-pakhtunkhwa/articleshow/107794494.cms",
        "title": "Pak <b>elections</b>: JUI-F to launch protest against &#39;rigging&#39; in Khyber Pakhtunkhwa",
        "description": "Khyber Pakhtunkhwa chapter rejects the poll results and announces a protest campaign against alleged rigging in the February 8 general elections. Get the latest updates on the protest and the party&#39;s stance."
    },
    {
        "url": "https://www.foxnews.com/politics/trump-trials-to-make-gop-frontrunners-daytime-campaign-events-a-challenge-but-nothing-will-stop-him",
        "title": "Trump trials will make GOP frontrunner&#39;s daytime campaign events a challenge, but &#39;nothing will stop him&#39;",
        "description": "Former President Trump will be on trial in New York City next month to defend himself against charges brought by Manhattan District Attorney Alvin Bragg."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/sir-john-curtice-election-polls-conservatives-labour-reform/",
        "title": "Sir John Curtice: In some ways, Reform is as big a problem as Labour for Sunak now",
        "description": "The nation’s foremost political polling guru explains how Rishi is losing on two fronts – and why Sir Keir shouldn’t jump for joy just yet"
    },
    {
        "url": "https://apnews.com/article/trump-michigan-2024-campaign-fraud-ruling-f264eac7cbba97c4e83919642d42bc97",
        "title": "Trump rails against New York fraud ruling as he faces fines that could exceed half-a-billion dollars",
        "description": "That penalty came days after Trump was ordered to pay $83.3 million to the writer E. Jean Carroll for damaging her reputation after she accused him of sexual assault."
    },
    {
        "url": "https://www.thetimes.co.uk/article/scottish-labour-still-has-work-to-do-to-win-over-middle-class-voters-ngqhbc9c0",
        "title": "Scottish Labour still has work to do to win over middle-class voters",
        "description": "Many are turning away from the SNP but Anas Sarwar must try harder to convince them that his party is ready to lead"
    }
]