[
    {
        "url": "https://www.thehindu.com/news/national/telangana/cpi-leader-wants-secular-democratic-forces-to-expedite-seat-sharing-agreement-for-lok-sabha-polls/article67811107.ece",
        "title": "CPI leader wants secular, democratic forces to expedite seat sharing agreement for Lok Sabha polls",
        "description": "CPI <b>general</b> secretary D. Raja has advised the secular and democratic forces to finalise seat-sharing agreements for the ensuing Lok Sabha <b>elections</b> at the earliest and be prepared to work for the defeat of the Bharatiya Jana Party (BJP) at the hustings."
    },
    {
        "url": "https://www.huffpost.com/entry/george-stephanopoulos-shuts-down-interview-jd-vance_n_65bfe743e4b05c8779f9d708",
        "title": "George Stephanopoulos Shuts Down Interview With Sen. J.D. Vance",
        "description": "During an appearance on ABC’s “This Week” with Sen. J.D. Vance (R-Ohio) Sunday, George Stephanopoulos abruptly ended the interview after Vance implied that Donald Trump can defy Supreme Court rulings."
    },
    {
        "url": "https://www.bbc.com/news/av/world-asia-68163521",
        "title": "Watch: How a Pakistani woman is making history this <b>election</b>",
        "description": "Rehana Magsi is the first woman to ever contest an election in Balochistan, the largest but least populous province of Pakistan. Despite breaking tradition and facing threats from powerful political rivals, Rehana says she will not &quot;give into fear and intimidation&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68185435",
        "title": "Former Scottish Labour leader Kezia Dugdale admits voting SNP",
        "description": "A former leader of the Labour Party in Scotland has admitted voting SNP. Kezia Dugdale told a new BBC documentary she was &quot;so mad about Brexit&quot; she backed the party at the European Parliament election in 2019. She said she had voted Labour at every election since."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13044719/supreme-court-donald-trump-2024-ballot-election-january-6-insurrection.html",
        "title": "Supreme Court may look back to the CIVIL WAR over 150 years ago to decide whether Donald Trump can be on the ballot for 2024 <b>general election</b>",
        "description": "The Supreme Court will hear arguments on February 8 as to whether Colorado acted lawfully in barring Donald Trump from being on the ballot, with 1860s rulings from Salmon Chase at the heart."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/05/2024-indonesia-general-election-everything-you-need-to-know",
        "title": "Indonesia <b>election</b>: everything you need to know",
        "description": "More than 200 million eligible voters can decide on 14 February between a former general, a former academic and a own-to-earth public servant"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/warning-over-ireland-threat-uk-as-sunak-visits-ulster/",
        "title": "Warning over Ireland’s threat to UK as Sunak visit Ulster",
        "description": "Ireland would be “no friend” to the UK under Sinn Fein, a report backed by two former defence secretaries warned as Rishi Sunak visited Northern Ireland to mark the restoration of power to Stormont."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-race-equal-pay-equality-b2490399.html",
        "title": "Labour ‘to extend equal pay rights to ethnic minorities’ in draft Race Equality Act",
        "description": "Labour first committed to introducing a new Race Equality Act back in October 2020, after a review by Baroness Doreen Lawrence into the disproportionate impact of Covid on ethnic minorities found the virus had “thrived on” a situation created by decades of structural discrimination by the British state and society."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13044529/ANDREW-PIERCE-Independents-jittery-Keir-Gaza.html",
        "title": "ANDREW PIERCE: Independents take on jittery Keir over Gaza",
        "description": "With a 20-point lead in the polls, you might think that Sir Keir Starmer is blissfully awaiting the General Election."
    },
    {
        "url": "https://uk.investing.com/news/stock-market-news/will-trumps-electability-concerns-help-haley-catch-up-with-expresident-heres-what-majority-of-gop-voters-in-south-carolina-say-3322879",
        "title": "Will Trump&#39;s Electability Concerns Help Haley Catch Up With Ex-president? Here&#39;s What Majority Of GOP Voters In South Carolina Say",
        "description": "The former president is facing multiple civil and criminal lawsuits in federal and state courts related to fraudulent business practices, <b>election</b> subversion and the mishandling of classified documents. If Trump’s name appears on the <b>general election</b> ..."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/04/labour-plans-extend-equal-pay-rights-black-asian-minority-ethnic-staff",
        "title": "Labour plans to extend equal pay rights to black, Asian and minority ethnic staff",
        "description": "Exclusive: Radical changes in a draft race equality act would give same protections as women now receive"
    },
    {
        "url": "https://www.radio.gov.pk/04-02-2024/people-to-decide-countrys-future-by-voting-in-upcoming-general-elections-shehbaz",
        "title": "People to decide country’s future by voting in upcoming <b>general</b> <b>elections</b>: Shehbaz",
        "description": "President of Pakistan Muslim League-Nawaz and former Prime Minister Shehbaz Sharif has said that people will decide the future of the country by voting in upcoming general elections."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/04/ecp-set-to-complete-nationwide-distribution-of-ballot-papers-tomorrow/",
        "title": "ECP set to complete nationwide distribution of ballot papers tomorrow",
        "description": "ISLAMABAD: The Election Commission of Pakistan (ECP) is set to conclude the distribution of 260 million ballot papers to the Returning Officers (ROs) of 859 constituencies nationwide by Monday (tomorr"
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/04/political-rivals-poses-challenge-to-aftab-sherpao-aimal-wali-in-charsadda/",
        "title": "Political rivals poses challenge to Aftab Sherpao, Aimal Wali in Charsadda",
        "description": "PESHAWAR: As only five days left in the General Election 2024, the candidates of various political parties and independents geared campaign on NA 24 Charsadda-1 where political stalwarts are posing a"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/general-hospital-vet-antonio-sabato-171814202.html",
        "title": "<b>General</b> Hospital Vet Antonio Sabato Jr. Weighs In on Jagger Recast, If His Politics Are to Blame",
        "description": "General Hospital vet Antonio Sabato Jr. is speaking out after his character John “Jagger” Cates was recast in an episode of the ABC soap that aired on Friday. The role is now being played by Adam J. Harrington."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-africa-68198049",
        "title": "Zimbabwe&#39;s governing Zanu-PF party wins two-thirds majority",
        "description": "Zimbabwe&#39;s governing Zanu-PF party has won all six of Saturday&#39;s parliamentary by-elections meaning it now holds a two-thirds majority in parliament. The victories give President Emmerson Mnangagwa the power to change key provisions in the constitution."
    },
    {
        "url": "https://www.thetimes.co.uk/article/worlds-coolest-dictator-election-el-salvador-r06vzk3f0",
        "title": "Nayib Bukele, self-styled ‘cool dictator’, heads for El Salvador re-<b>election</b>",
        "description": "Nayib Bukele, El Salvador’s president, is set to win an overwhelming victory in the country’s general election, held on Sunday, which will secure the leader who once boasted he was the “world’s coolest dictator” another five years in power."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/04/zimbabwe-zanu-pf-emmerson-mnangagwa-president/",
        "title": "Zimbabwe’s ruling party by-<b>election</b> victory set to keep Emmerson Mnangagwa in power",
        "description": "Zanu-PF&#39;s parliamentary majority means it can now amend the constitution and remove a two-term limit on the presidency"
    },
    {
        "url": "https://www.marketoracle.co.uk/Article71147.html",
        "title": "New Hints of US <b>Election</b> Year Market Interventions &amp; Turmoil",
        "description": "After a sluggish January for precious metals, gold and silver markets saw a rally during the first day of February trading, only to see it reverse here today on the 2nd day of the month, after a strong U.S. jobs report, to continue the lackluster performance we’ve seen in early 2024."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-is-not-scaling-back-28bn-green-investment-plan-says-chris-bryant-368115/",
        "title": "Labour is not scaling back £28bn green investment plan says Chris Bryant",
        "description": "Labour Shadow minister Sir Chris Bryant said the Opposition party ‘intends to deliver’ on its so-called Green investment plan."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/president-biden-worried-over-embarrassing-32043694.amp",
        "title": "President Biden worried over &#39;embarrassing details&#39; in report that could help Trump win",
        "description": "Joe Biden&#39;s team is reportedly worried that a report by special counsel Robert Hur on the president&#39;s handling of classified documents that could damage his re-election chances"
    },
    {
        "url": "https://arynews.tv/balochistan-imposes-restrictions-public-meetings-gatherings/",
        "title": "Balochistan imposes restrictions on public meetings, gatherings",
        "description": "“We are aware of the importance of the <b>election</b> campaign, but protection of <b>general</b> public is the foremost priority,” he said. It is to be mentioned here that Pakistan’s next <b>general election</b> is few days ahead on February 08."
    },
    {
        "url": "https://arynews.tv/bilawal-bhutto-pledges-hyderabads-development-if-voted-into-power/",
        "title": "Bilawal Bhutto pledges Hyderabad’s development if voted into power",
        "description": "HYDERABAD: Pakistan People’s Party (PPP) Chairman Bilawal Bhutto-Zardari on Sunday called on the people of Hyderabad to vote for his party in the February 8 <b>general</b> <b>elections</b>, pledging the city’s development if voted into power, ARY News reported."
    },
    {
        "url": "https://www.livemint.com/politics/jharkhand-news-ruling-alliance-led-by-cm-champai-soren-to-face-floor-test-today-section-144-imposed-hemant-soren-11707094313843.html",
        "title": "Jharkhand news: Ruling alliance led by CM Champai Soren to face floor test today, Section 144 imposed | 10 Points",
        "description": "Jharkhand Assembly to witness floor test of Champai Soren Government on Monday. Hemant Soren allowed to participate in trust vote despite objections by the Enforcement Directorate."
    },
    {
        "url": "https://www.livemint.com/economy/full-budget-will-follow-fiscal-journey-set-out-in-interim-budget-11707066786205.html",
        "title": "‘Full budget will follow fiscal journey set out in interim budget’",
        "description": "The fiscal journey for FY25 set out in the interim budget will be maintained despite a full budget slated in July after the general elections, finance ministry officials said. The numbers are unlikely to change even if a different government comes to power, the officials said on the condition of anonymity."
    },
    {
        "url": "https://abcnews.go.com/US/wireStory/biden-sets-sights-las-vegas-days-nevadas-primary-106931464",
        "title": "Biden sets his sights on Nevada&#39;s primary, with November also high on his mind",
        "description": "President Joe Biden’s latest campaign swing has taken him to Nevada, where the first-in-the-West primaries are underway with early and absentee voting"
    },
    {
        "url": "https://www.washingtonpost.com/politics/2024/02/04/nra-trial-new-york-election-influence/",
        "title": "Luxury spending, internal strife leave NRA staggering into 2024 <b>election</b>",
        "description": "Ex-NRA leader Wayne LaPierre’s civil corruption trial in New York highlights the deep struggles the gun-rights group faces in keeping its political power."
    },
    {
        "url": "https://finance.yahoo.com/news/trump-2-0-tops-chinese-220000986.html",
        "title": "Trump 2.0 Tops Chinese Investors’ Concerns, Goldman Sachs Says",
        "description": "On top of tumbling stocks, an embattled property market and a struggling economy, there’s at least one more thing keeping domestic Chinese investors up at night: a potential win by former US president Donald Trump in the November general election."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/04/labour-party-mps-backlash-israel-gaza-war-general-election/",
        "title": "Labour MPs face <b>election</b> backlash by Muslim voters over party’s stance on Israel-Gaza war",
        "description": "Pro-Palestine supporters angry over how long it took Sir Keir Starmer to call for ceasefire after Israel struck Gaza following Hamas attack"
    },
    {
        "url": "https://www.foxnews.com/politics/trump-focuses-trial-strategy-delay-election-day-creeps-closer-legal-experts",
        "title": "Trump seeks to run out the clock as delays push trials closer to <b>Election</b> Day: legal expert",
        "description": "Timing could benefit former President Donald Trump as he faces criminal trials as Election Day 2024 creeps closer, legal experts say."
    },
    {
        "url": "https://www.axios.com/2024/02/04/biden-south-carolina-primary-takeaways",
        "title": "Biden&#39;s South Carolina show of force",
        "description": "Rep. Jim Clyburn (D-S.C.), Biden&#39;s top surrogate in South Carolina, said on CNN that the president&#39;s dominance in heavily Black areas &quot;demonstrates to me what I have been saying all the time: that Joe Biden has not lost any support among African Americans.&quot;"
    },
    {
        "url": "https://www.thesun.co.uk/news/25717113/trevor-kavanagh-uncontrolled-immigration-election/",
        "title": "Uncontrolled immigration is the Tories’ fault – and it will cost them the <b>election</b>",
        "description": "THE Tories’ last pale hope of victory expired on Tuesday. It was put out of its misery by official figures showing the bulging UK population is set to soar by 6.6million over 12 years. If this"
    },
    {
        "url": "https://www.abc.net.au/news/2024-02-05/tasmania-on-the-brink-of-an-early-election/103424974",
        "title": "Premier Jeremy Rockliff&#39;s stand-off with independents continues — but is an <b>election</b> in their interests?",
        "description": "Australia&#39;s last Liberal government has been on the brink of an early election for nine months. So how does Jeremy Rockliff keep surviving? The answer could be a fear of what comes next."
    },
    {
        "url": "https://theconversation.com/should-donald-trump-be-disqualified-from-state-ballots-in-presidential-election-heres-how-the-us-supreme-court-might-rule-221209",
        "title": "Should Donald Trump be disqualified from state ballots in presidential <b>election</b>? Here’s how the US Supreme Court might rule",
        "description": "The Colorado Supreme Court ruled in December that Trump was disqualified from holding the office of president under Section 3 of the 14th Amendment to the Constitution because he engaged in an insurrection on January 6, 2021."
    },
    {
        "url": "https://www.rollingstone.com/politics/politics-features/corporate-america-republican-minority-rule-1234959739/",
        "title": "Blame These Companies for the GOP’s Minority Rule",
        "description": "And it is a dynamic fueled by some of America’s most recognizable brands — companies that have donated tens of millions of dollars to the organization behind REDMAP, and the group most responsible for engineering minority rule in this country: the Republican State Legislative Committee."
    },
    {
        "url": "https://www.economist.com/united-states/2024/02/04/trumps-lead-over-biden-may-be-smaller-than-it-looks",
        "title": "Trump’s lead over Biden may be smaller than it looks",
        "description": "To survey-watchers who think that all polls are created equal, Mr Trump has opened a modest but growing lead nationwide. But to those who maintain that pollsters’ historical accuracy predicts future accuracy, Messrs Trump and Biden are in a dead heat. ■"
    },
    {
        "url": "https://www.barrons.com/news/zimbabwe-ruling-party-wins-super-majority-in-by-elections-1a209d54",
        "title": "Zimbabwe Ruling Party Wins Super-majority In By-<b>elections</b>",
        "description": "Zimbabwe&#39;s ruling ZANU-PF now commands a two-thirds majority in parliament and could amend the constitution and prolong President Emmerson Mnangagwa&#39;s control, after by-election results released Sunday."
    },
    {
        "url": "https://www.yahoo.com/entertainment/general-hospital-vet-antonio-sabato-171814202.html",
        "title": "<b>General</b> Hospital Vet Antonio Sabato Jr. Weighs In on Jagger Recast, If His Politics Are to Blame",
        "description": "General Hospital vet Antonio Sabato Jr. is speaking out after his character John “Jagger” Cates was recast in an episode of the ABC soap that aired on Friday. The role is now being played by Adam J. Harrington."
    },
    {
        "url": "https://nypost.com/2024/02/04/news/trump-scores-the-biggest-lead-yet-against-biden-in-new-nbc-poll/",
        "title": "Trump scores ‘the biggest lead’ yet against Biden in new NBC poll",
        "description": "Former President Donald Trump scored his largest lead yet against President Biden Sunday in a new NBC poll, as voters gave the incumbent poor marks across the board."
    },
    {
        "url": "https://news.yahoo.com/why-matters-election-campaign-long-170000398.html",
        "title": "Why it matters that this year’s <b>election</b> campaign will be so long",
        "description": "Get ready for the longest general election campaign in memory. It is already odds-on that November’s election will be a rematch between President Biden and former President Trump. Biden faces no serious challenge for the Democratic nomination,"
    },
    {
        "url": "https://apnews.com/article/trump-republicans-2024-campaign-desantis-haley-biden-99438e2097ce24f052ac390fbb39e152",
        "title": "How Donald Trump went from a diminished ex-president to the GOP’s dominant front-runner",
        "description": "When Donald Trump left the White House three years ago, he was a one-term president whose refusal to accept his reelection defeat culminated in an insurrection at the U.S."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/world-news/new-party-face-of-hafiz-saeeds-banned-group-to-participate-in-pakistan-general-election/articleshow/107406360.cms",
        "title": "New party, face of Hafiz Saeed&#39;s banned group, to participate in Pakistan <b>general election</b>",
        "description": "Pakistan Markazi Muslim League, a new political party believed to be associated with banned groups led by Hafiz Saeed, will participate in the upcoming general elections in Pakistan. Some of the party&#39;s candidates have ties to banned organizations such as Lashkar-e-Taiba,"
    },
    {
        "url": "https://thehill.com/homenews/campaign/4447389-trump-calls-gavin-newsom-bulls/",
        "title": "Trump calls Gavin Newsom ‘bulls—-‘",
        "description": "Former President Trump on Sunday dug into California Gov. Gavin Newsom (D), arguing he is “so much bulls—” when asked how he would do up against the governor in a hypothetical"
    },
    {
        "url": "https://www.washingtonpost.com/national-security/2024/02/04/trump-trials-tracker-latest-news/",
        "title": "Trump Trials: Supreme Court showdown, awaiting D.C. immunity decision",
        "description": "The latest in Donald Trump’s criminal and civil trials, including the Supreme Court’s hearing on the Colorado ballot case, and what else to watch for this week."
    },
    {
        "url": "https://nypost.com/2024/02/04/news/speaker-johnson-insists-trump-is-not-calling-the-shots-on-the-border-deal/",
        "title": "Speaker Johnson insists Trump not calling the shots on the border deal: ‘Of course not’",
        "description": "House Speaker Mike Johnson was adamant that former President Donald Trump is not calling the shots for congressional Republicans’ opposition to the Senate border deal."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nigel-farage-liz-truss-popcon-tory-b2490208.html",
        "title": "Nigel Farage to attend Liz Truss’s latest comeback bid with launch of ‘Popular Conservatism’",
        "description": "Nigel Farage is planning to attend the launch of Liz Truss’s new “Popular Conservatism” project this week, as the former prime minister attempts to rally right-wing Tory MPs."
    },
    {
        "url": "https://time.com/6645347/biden-wins-south-carolina-democratic-primary-reelection-bid/",
        "title": "Biden Wins South Carolina’s Democratic Primary as He Gears Up For Reelection Bid",
        "description": "COLUMBIA, S.C. — President Joe Biden easily won South Carolina’s Democratic primary on Saturday, clinching a state he pushed to lead off his party’s nominating process after it revived his then-struggling White House bid four years ago."
    },
    {
        "url": "https://www.ft.com/content/e7935e2e-acd9-4f61-bc6d-f0b3b5c07357",
        "title": "Labour delays plans to abolish House of Lords",
        "description": "Labour is delaying plans to abolish the House of Lords as Britain’s main opposition party hones its policy platform ahead of the general election expected this year."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-supreme-court-courts-must-exercise-caution-in-dealing-with-poll-matters-to-safeguard-democracy/articleshow/107404015.cms",
        "title": "Pakistan Supreme Court says courts must deal with poll matters with &#39;circumspection&#39; to guard democracy",
        "description": "The Supreme Court ruled in favor of enfranchisement by interpreting electoral laws to ensure maximum choices for voters in Pakistan&#39;s upcoming general"
    },
    {
        "url": "https://news.yahoo.com/gov-katie-hobbs-says-gops-120143018.html",
        "title": "Gov. Katie Hobbs says GOP&#39;s fix for Arizona&#39;s potential <b>election</b> logjam &#39;dead on arrival&#39;",
        "description": "A draft bill from Republican lawmakers would fix a potential election logjam. Gov. Katie Hobbs thinks it&#39;s &quot;unacceptable.&quot; Here&#39;s why."
    },
    {
        "url": "https://www.politico.com/news/magazine/2024/02/04/1960-election-jfk-nixon-nuclear-war-00136763",
        "title": "How Kennedy Narrowly Defeated Nixon — and Why the Alternative History Would Have Been Devastating",
        "description": "Here is the third article in a series named “The Closest Calls,” where author and journalist Jeff Greenfield looks at the most narrowly decided presidential elections and explores how small changes in the race would have altered the outcome — and changed American history forever."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/balochistan-govt-imposes-ban-on-public-meetings-election-gatherings-ahead-of-pakistan-general-elections/articleshow/107403158.cms",
        "title": "Balochistan government imposes ban on public meetings, <b>election</b> gatherings ahead of Pakistan <b>general</b> <b>elections</b>",
        "description": "Ahead of the February 8 general elections in Pakistan, the government of Balochistan has implemented a ban on public meetings and election ga."
    },
    {
        "url": "https://www.thesun.co.uk/news/25707083/britain-weapons-counter-threat-russian-army/",
        "title": "Britain’s ‘hollowed out’ Armed Forces would only last a couple of months in war with Putin, damning report warns",
        "description": "BRITAIN’S Army is not prepared for a full-blown war with Russia, MPs have warned in a damning new report. The armed forces would only last a “couple of months” in battle as fears"
    },
    {
        "url": "https://www.yahoo.com/news/sparkers-soapbox-florida-primary-election-110527522.html",
        "title": "Sparker&#39;s Soapbox: Florida’s primary <b>election</b> process explained",
        "description": "A 1998 amendment to the Florida Constitution provides an exception to Florida’s closed primary rule. It says that all voters, regardless of the party they are registered with, may vote in any party&#39;s primary election if the winner of that primary will face no opposition in the general election."
    },
    {
        "url": "https://www.latimes.com/politics/story/2024-02-04/kamala-harris-presidential-reelection-campaign-biden-abortion",
        "title": "Column: How Kamala Harris found her groove. And why being vice president is still tough",
        "description": "After a historic ascent to the vice presidency and humbling descent into disdain, Harris seems to have found her footing in a familiar role: prosecuting attorney."
    },
    {
        "url": "https://www.newyorker.com/magazine/2024/02/12/joe-bidens-weird-perception-problem",
        "title": "Joe Biden’s Weird Perception Problem",
        "description": "For the President and his campaign staff, the problem is tactical. How can he pull this off? There is no shortage of advice."
    },
    {
        "url": "https://www.huffpost.com/entry/election-2024-trump-insurrection-amendment-supreme-court_n_65bf1aeee4b0102bd2d9c0e5?ncid=engmodushpmg00000003",
        "title": "Can Trump Be On The Ballot? It&#39;s The Supreme Court&#39;s Biggest <b>Election</b> Test Since Bush V. Gore",
        "description": "A case with the potential to disrupt Trump’s drive to return to the White House is putting the Supreme Court uncomfortably at the center of the 2024 campaign."
    },
    {
        "url": "https://www.foxnews.com/politics/swing-district-democrat-close-ties-largest-teachers-union-silent-calls-rescind-biden-endorsement",
        "title": "Swing district Democrat with close ties to largest teachers union silent on calls to rescind Biden endorsement",
        "description": "Conn., is remaining silent over calls from within the NEA, with which she has close ties, to rescind its endorsement of President Biden over the war in Gaza."
    },
    {
        "url": "https://www.sfgate.com/recordjournal/article/local-politics-ct-durham-teen-book-voting-18641910.php",
        "title": "Durham student pens book to get other teens involved in politics: &#39;You are throwing away your voice&#39;",
        "description": "Diya Patel, a Coginchaug Regional High School senior, is trying to show teens can have an impact on issues in town by voting in her book &quot;America Starts Local.&quot;"
    },
    {
        "url": "https://apnews.com/article/el-salvador-election-bukele-gang-violence-democracy-dc9f65f450875c5841f937753cd3101a",
        "title": "El Salvador votes in presidential <b>election</b> that the ‘world’s coolest dictator’ has clear path to win",
        "description": "Salvadorans are headed out to vote in a presidential and legislative election that’s largely about the tradeoff between security and democracy."
    },
    {
        "url": "https://economictimes.indiatimes.com/news/international/world-news/public-gatherings-have-potential-us-cautions-citizens-against-visiting-pakistan-during-polls/articleshow/107398393.cms",
        "title": "&quot;Public gatherings have potential...&quot;: US cautions citizens against visiting Pakistan during polls",
        "description": "The statement said, &quot;U.S. citizens should remain vigilant and aware of the locations of political rallies occurring in areas they intend to visit. On February 8, election day, areas around polling stations may be crowded,"
    },
    {
        "url": "https://www.nytimes.com/2024/02/03/us/politics/biden-win-south-carolina-primary.html",
        "title": "Biden Wins His First Primary in South Carolina, Where His 2020 Victory Began",
        "description": "Black voters in the state revitalized President Biden’s political fortunes. But Saturday’s repeat win is an uncertain measure of wider enthusiasm for his re-election bid."
    },
    {
        "url": "https://www.newsweek.com/joe-biden-wins-south-carolina-democratic-primary-ap-projects-1866657",
        "title": "Joe Biden Wins South Carolina Democratic Primary",
        "description": "With 97 percent, President Joe defeated Representative Dean Phillips and author Marianne Williamson, according to Associated Press projections."
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/pakistan/new-party-linked-to-hafiz-saeed-to-run-in-pakistan-general-elections/articleshow/107406696.cms",
        "title": "New party linked to Hafiz Saeed to run in Pakistan <b>general</b> <b>elections</b>",
        "description": "Pakistan Markazi Muslim League, linked to banned organizations associated with Hafiz Saeed, will participate in upcoming general elections. Candidates"
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/president-biden-worried-over-embarrassing-32043694",
        "title": "President Biden worried over &#39;embarrassing details&#39; in report that could help Trump win",
        "description": "Joe Biden&#39;s team is reportedly worried that a report by special counsel Robert Hur on the president&#39;s handling of classified documents that could damage his re-election chances"
    }
]