[
    {
        "url": "https://www.dailynews.com/2024/02/16/give-up-street-lanes-in-l-a-for-bikes-and-buses-measure-hla-is-on-the-ballot/",
        "title": "Give up street lanes in L.A. for bikes and buses? Measure HLA is on the ballot",
        "description": "Councilmember Traci Park worries LA will ‘end up with a system of road diets to nowhere just in time for the Olympics.’"
    },
    {
        "url": "https://www.huffpost.com/entry/trump-reaction-civil-fraud-trial-verdict_n_65cfc695e4b043f1c0ab2161",
        "title": "Trump Loses It Over $355 Million Judgment In Civil Fraud Trial",
        "description": "&quot;A crooked New York state judge... has just fined me $355 Million based on nothing other than having built a GREAT COMPANY,&quot; Trump wrote on Truth Social."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/16/trump-trial-fraud-fani-willis-election-geogia-updates?filterKeyEvents=false&page=with:block-65cfebf98f08dfb189f4ed2c",
        "title": "Trump ‘perfected the art of the steal’, New York attorney <b>general</b> says after $350m ruling – live",
        "description": "Letitia James says judgment of more than $350m shows Trump ‘engaged in incredible financial fraud to enrich himself’ – follow the latest"
    },
    {
        "url": "https://www.ft.com/content/7dfa734c-0f15-421a-bc24-47fe42e96174",
        "title": "Transcript: Tories reel from by-<b>election</b> blows",
        "description": "Lucy Fisher talks to George Parker, Rafe Uddin, elections guru Professor Sir John Curtice and the FT’s foreign editor Alec Russell"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/humza-yousaf-scotland-scottish-labour-douglas-ross-moray-b2497790.html",
        "title": "Yousaf to campaign in Scottish Tory leader’s seat",
        "description": "First Minister Humza Yousaf will campaign in the Moray seat of Scottish Tory leader Douglas Ross as he pushes to make Scotland “Tory-free” after the next election. The SNP has set its sights on Mr Ross’ party, with Labour riding high in the polls ahead of an election expected this year."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867734/nigel-farage-tory-leader-rish-sunak-wellingborough-by-election",
        "title": "Nigel Farage declares: Tory members want ME as their leader, not Rishi Sunak",
        "description": "Nigel Farage says grassroots Conservatives would prefer him to lead the party instead of Rishi Sunak in the wake of two crushing by-election drubbings."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-wellingborough-conservatives-labour-government-b2497777.html",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-<b>election</b> blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/reform-uk-richard-tice-rishi-sunak-election-pact-reject/",
        "title": "Reform leader rejects an <b>election</b> pact with Conservatives",
        "description": "Richard Tice rules out a collaboration with Rishi Sunak as Tories fear the general election becoming a ‘slow-moving car crash’"
    },
    {
        "url": "https://inews.co.uk/news/politics/grassroots-tories-election-wipeout-fears-2910698?ito=facebook_share_article-top",
        "title": "‘It’s a sinking ship’: Grassroots Tories fear <b>general election</b> wipeout",
        "description": "Grassroots Tories fear a <b>general election</b> wipeout if Rishi Sunak cannot convince Conservative supporters to turn out and vote after the party suffered a double by-<b>election</b> defeat. Councillors told i the by-<b>election</b> results in Wellingborough and Kingswood ..."
    },
    {
        "url": "https://inews.co.uk/opinion/labour-by-election-victory-historic-shallow-2910758?ico=more_from_this_author",
        "title": "Labour’s by-<b>election</b> victories are historic, but ultimately shallow",
        "description": "Fortunately for the party, the two seats duly delivered. Kingswood was always likely to deliver a Labour victory – and the seat is one of those that, if the next general election were being held on the current parliamentary boundaries,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/what-labour-by-election-wins-mean-next-general-election-wellingborough-kingswood-3jd6d63zj?ilc=timesradio:morefromthetimes",
        "title": "What Labour’s by-<b>election</b> wins mean for the <b>general election</b>",
        "description": "The 37.6 per cent drop in its vote in Wellingborough is the biggest decline the Conservative Party has ever suffered in a by-election it was defending. This brought us all back to reality. After a diverting couple of weeks needling Sir Keir Starmer about his failure to wipe out antisemitism within the party or to deal with Labour’s conspiracy theorist candidate in Rochdale as swiftly as he should have,"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527.amp",
        "title": "By-<b>elections</b>: Tory gloom deepens after double poll blow",
        "description": "Tory candidate Helen Harrison had a night to forget So, another two whopping by-election victories for Labour. What is most striking about the results in Wellingborough and Kingwood is that they feel almost unsurprising,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nigel-farage-reform-uk-by-election-results-wellingborough-kingswood-b1139580.html",
        "title": "Nigel Farage says he &#39;might&#39; return to lead Reform UK after by-<b>election</b> results",
        "description": "Nigel Farage has said he “might” make a return to frontline politics to lead Reform UK after the party’s record by-election results. The Conservatives suffered a double defeat in the Kingswood and Wellingborough votes, with Labour over turning large Tory majorities in the seats."
    },
    {
        "url": "https://news.sky.com/story/these-by-election-results-could-be-consequential-and-dramatic-heres-why-13072730",
        "title": "These by-<b>election</b> results could be consequential and dramatic - here&#39;s why",
        "description": "As the choice in the general election looms, these two by-elections were more hammerings which confirmed Labour&#39;s momentum - and made for a terrible night for Rishi Sunak and the Conservatives."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next <b>general election</b>? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867322/by-election-results-reform-uk",
        "title": "Pollster offers by-<b>election</b> verdict as Reform UK surges – and it&#39;s bad news for everyone",
        "description": "The Tories have taken a kicking, Labour have two new MPs and Reform are flying high - but Professor Sir John Curtice warns that the real losers were everyone."
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/election-results-2019-labour-takes-9103752",
        "title": "By-<b>election</b> results since 2019 as Labour takes two more seats from Tories",
        "description": "The latest by-elections mean the Conservatives have suffered more by-election defeats than in any single Parliament since the Second World War"
    },
    {
        "url": "https://www.thesun.co.uk/news/25997621/tories-general-election-by-election/",
        "title": "The Tories ‘must adapt’ if they want <b>General Election</b> hope after two by-<b>election</b> drubbings",
        "description": "RISHI Sunak has been urged to “change course” by his Tory MPs to give them hope for the <b>General Election</b>. The warning to the PM came after two by-<b>election</b> drubbings. Both Wellingborough, in Northants, and Kingswood, Gloucs, were lost to Labour — with ..."
    },
    {
        "url": "https://www.cwmbranlife.co.uk/automatic-voter-registration-in-wales-moves-a-step-closer/",
        "title": "Automatic voter registration in Wales moves a step closer",
        "description": "Mick Antoniw said the <b>Elections</b> and Elected Bodies bill is an important step ... Mr Antoniw – who is counsel <b>general</b>, the Welsh Government’s chief legal adviser – stressed the importance of protecting vulnerable voters through anonymous registration."
    },
    {
        "url": "https://thehill.com/regulation/court-battles/4473139-trump-354-million-civil-fraud-decision-read/",
        "title": "Read: Judge’s $354 million civil fraud decision against Trump",
        "description": "A New York judge on Friday afternoon ordered former President Trump to pay more than $350 million in penalties as part of the civil fraud case focused on the Trump family’s business empire."
    },
    {
        "url": "https://www.foxnews.com/world/court-overturns-senegalese-presidential-election-delay",
        "title": "Court overturns Senegalese presidential <b>election</b> delay",
        "description": "Senegal will hold its next presidential election as soon as possible following the overturning of incumbent Macky Sall&#39;s postponement of the vote."
    },
    {
        "url": "https://www.nytimes.com/2024/02/16/us/politics/presidential-election-voters.html",
        "title": "Are There Any Persuadable Voters Left?",
        "description": "But that’s not universal. Murray of Monmouth said that there were still some voters whose identities were not closely tied to their politics — and they might be up for grabs. “Those are the persuadable voters,” he said, “that don’t buy into kind of these doomsday scenarios that both parties are putting out if the other party wins.”"
    },
    {
        "url": "https://www.politico.com/newsletters/politico-nightly/2024/02/16/the-gathering-storm-at-your-dinner-table-00142015",
        "title": "The gathering storm at your dinner table",
        "description": "FAMILY FEUD — New research suggests a fascinating trend with implications for politics — and family dinners: Daughters from conservative families are voting for Democrats at levels much higher than sons."
    },
    {
        "url": "https://finance.yahoo.com/news/shareholders-led-yi-zhang-announce-223600011.html",
        "title": "Shareholders Led by Yi Zhang Announce Successful Results of Removal of Directors and <b>Election</b> of New Directors of YS Biopharma Co., Ltd.",
        "description": "Yi Zhang and shareholders representing over 59.2% of the outstanding shares of YS Biopharma Co., Ltd. (the &quot;Company&quot; or &quot;YS&quot;) (NASDAQ: YS) (the &quot;Convening Shareholders&quot;) today announced the successful approval of all resolutions at the YS Extraordinary General Meeting of Shareholders (&quot;EGM&quot;) held today."
    },
    {
        "url": "https://timesofindia.indiatimes.com/india/electoral-bonds-bank-rules-may-impede-revealing-poll-bond-information-say-government-sources/articleshow/107764097.cms",
        "title": "Electoral Bonds: Bank rules may impede revealing poll bond information, say government sources",
        "description": "Prevailing banking standards may impede the disclosure of the names of electoral bond subscribers, according to government sources, who claim the prog"
    },
    {
        "url": "https://news.yahoo.com/divided-michigan-republicans-plan-dueling-220008712.html",
        "title": "Divided Michigan Republicans plan dueling meetings to choose presidential nominee",
        "description": "Warring factions within the Michigan Republican Party are planning to hold separate meetings next month to choose the party&#39;s presidential nominee, the latest sign of the turmoil gripping the party in the key battleground state."
    },
    {
        "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/live-updates-da-fani-willis-faces-misconduct-allegations-trump-georgia-rcna139166",
        "title": "Live updates: Trump ordered to pay over $350M after fraud trial; Fani Willis hearing adjourns",
        "description": "Updates and news coverage on what&#39;s at stake in Trump&#39;s misconduct allegations against DA Fani Willis, who is prosecuting the the Georgia election interference case."
    },
    {
        "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/16/maine-voting-faq/72429429007/",
        "title": "Maine voting FAQ",
        "description": "Another way to register to vote is to download and print a Maine voter registration application from the Secretary of State’s website or contact your town clerk to have a voter registration card mailed to you. You can hand deliver or mail the completed voter registration application or card to your town office or city hall."
    },
    {
        "url": "https://www.reuters.com/legal/trumps-civil-fraud-verdict-appeal-may-hinge-no-victims-defense-2024-02-16/",
        "title": "Trump&#39;s civil fraud verdict appeal may hinge on &#39;no victims&#39; defense",
        "description": "Donald Trump&#39;s planned appeal of a $355 million judgment against him in his civil fraud case may focus on the former president&#39;s contention that there were no actual victims from his conduct at issue in the case,"
    },
    {
        "url": "https://www.ft.com/content/80f99501-dc76-4bd1-9a9e-6729da1a584d",
        "title": "Rishi Sunak faces mutinous Tory party after by-<b>election</b> losses",
        "description": "Danny Kruger and Miriam Cates, the co-leaders of the New Conservatives faction of right-wing Tory MPs, also issued a damning statement accusing Sunak of presiding over “consensus politics” that centred on “high taxes, low security, managed decline”."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/16/rishi-sunak-conservative-tory-path-forward-byelections-analysis",
        "title": "Sunak faces conflicting calls over Tory path forward after bruising byelections",
        "description": "Loudest voices urge further tack to right after Reform UK gains but moderates argue general election can only be won on centre ground"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68313421.amp",
        "title": "Wellingborough and Kingswood by-<b>elections</b>: Job not done despite huge wins, says Starmer",
        "description": "The party came third in both by-elections, picking up 13% of the vote in Wellingborough and 10.4% in Kingswood. Labour secured a majority of 2,501 over Tory candidate Sam Bromiley in the South Gloucestershire seat of Kingswood, near Bristol."
    },
    {
        "url": "https://edition.cnn.com/2024/02/16/politics/trump-legal-drama-complications/index.html?ref=mc.news",
        "title": "A tempestuous day in multiple courts deepens Trump’s legal imbroglio",
        "description": "Trump’s lawyers made a final, beseeching plea to the Supreme Court to stop the clock in a federal trial over his attempt to overturn the 2020 election. Justices must now decide whether to take up one of the most profound cases in the body’s history."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-by-election-results-egan-kitchen-b2497238.html?page=6",
        "title": "Byelection results - live: Boost for Starmer after Rochdale ‘shambles’ as Labour clinches two major victories",
        "description": "Labour overturns two large majorities to take seats in Northamptonshire and South Gloucestershire on a bad night for the Conservative party"
    },
    {
        "url": "https://www.huffpost.com/entry/larry-hogan-maryland-abortion-senate_n_65ce8506e4b04daca696508d?ncid=engmodushpmg00000003",
        "title": "Why Abortion Matters In This Suddenly Competitive Blue-State Senate Race",
        "description": "Larry Hogan has managed to make his anti-abortion rights views irrelevant in Maryland. That’ll be a tough sell as he runs for Senate."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13092235/Nigel-Farage-says-Tories-Jacob-Rees-Mogg-party-point-urges-right-wing-unity-general-election.html",
        "title": "Nigel Farage says he and Tories such as Jacob Rees-Mogg &#39;will have to be in the same party at some point&#39; as he urges right-wing unity - but only after the <b>general election</b>",
        "description": "The Brexit architect, the former leader of UKIP , predicted a coming together of right-wing politicians in the wake of two more by-election defeats for the Tories."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68316527",
        "title": "By-<b>elections</b>: Tory gloom deepens after double poll blow",
        "description": "And in Kingswood, near Bristol, they got a share of the vote greater than the gap between the victorious Labour candidate and the Tory runner-up. That is a double dose of the heebie-jeebies delivered in one day to nervous Tories."
    },
    {
        "url": "https://edition.cnn.com/2024/02/16/uk/sunak-conservatives-by-election-losses-intl/index.html",
        "title": "Problems mount for UK PM Rishi Sunak as his party suffers heavy defeat in two parliamentary <b>elections</b>",
        "description": "British Prime Minister Rishi Sunak is facing a weekend of difficult questions after his governing Conservative policy lost two seats in parliament on Thursday."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68314949",
        "title": "Could Reform UK surge sink Tory <b>election</b> hopes?",
        "description": "Reform UK leader Richard Tice has said he wants to &quot;smash&quot; and &quot;destroy&quot; the Tory Party at the general election. He insisted Reform UK would never consider repeating the Brexit Party&#39;s 2019 deal with the Conservatives - which saw it withdraw candidates in 317 constituencies after then-Tory leader Boris Johnson committed to leaving the EU by 2020."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13091275/Reform-UK-surge-best-election-result-threat-pose-general-election-Nigel-Farage-return-leader-tax-cutting-net-zero-immigration-plans.html",
        "title": "Reform UK surge to their best ever by-<b>election</b> result - but how much of a threat do they pose at the <b>general election</b>? Will Nigel Farage return as leader? And what are their ...",
        "description": "Election experts said the by-election results &#39;backed up&#39; Reform&#39;s national opinion polling, which has seen the party hover around 10 per cent for a number of weeks."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-reform-labour-conservative-party-richard-tice-b2497398.html",
        "title": "‘A vote for Reform is a vote for Starmer’, says Sunak",
        "description": "Prime Minister Rishi Sunak said the ‘actual choice’ at the general election is ‘between me and him’, referring to the Labour leader."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-bristol-68308476.amp",
        "title": "Kingswood by-<b>election</b>: Labour&#39;s Damien Egan overturns large Tory majority",
        "description": "Tory MP Jacob Rees-Mogg, whose North East Somerset constituency borders Kingswood, blamed the result on a low turnout and insisted Rishi Sunak&#39;s leadership is &quot;solid&quot; and &quot;by-elections don&#39;t change that&quot;. However he added, his party &quot;needs some fresh ideas&quot;."
    },
    {
        "url": "https://www.huffpost.com/entry/trump-indictments-takeaways-delays_n_65ceceeae4b0f7fbe7b21db7",
        "title": "Delay Tactics And Quick Trips: Takeaways From Two Trump Case Hearings In New York And Georgia",
        "description": "Donald Trump’s unprecedented tangle of overlapping cases was on full display Thursday with simultaneous court hearings in New York and Georgia."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/conservatives-lose-two-elections-after-28643455",
        "title": "Conservatives lose two by-<b>elections</b> after huge swings towards Labour",
        "description": "The twin blows will compound the Prime Minister&#39;s woes, coming the day after it was officially announced that the UK had entered a recession at the end of 2023, and mean the Conservatives have suffered more by-election defeats than in any single Parliament since the Second World War."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/conservatives-by-election-scorecard-since-2019-general-election-110655/",
        "title": "Conservatives’ by-<b>election</b> scorecard since 2019 <b>general election</b>",
        "description": "The Conservatives’ share of the vote slumped from 62% at the 2019 general election to just 25%, the largest drop recorded by the Tories at any by-election since 1945. The Conservatives have made one by-election gain during this parliament: Hartlepool in County Durham, which the party took from Labour on a swing of 16.0 percentage points."
    }
]