[
    {
        "url": "https://www.usnews.com/news/politics/articles/2024-02-09/democrats-rally-around-biden-after-special-counsel-report-questions-his-fitness",
        "title": "Democrats Rally Around Biden After Special Counsel Report Questions His Fitness",
        "description": "The vice president led the charge in refuting accusations that Biden has trouble remembering things, dismissing the report as ‘politically motivated.’"
    },
    {
        "url": "https://www.bbc.com/news/world-asia-68256017?at_bbc_team=editorial&at_campaign_type=owned&at_format=link&at_link_id=155CC14E-C794-11EE-9310-EB46D0B4AF07&at_link_origin=BBCWorld&at_link_type=web_link&at_ptr_nam",
        "title": "Pakistan <b>election</b>: Imran Khan and Nawaz Sharif each claim advantage",
        "description": "Imran Khan posted an AI-generated victory speech on X. The jailed former Pakistani Prime Minister Imran Khan has claimed victory in Thursday&#39;s general election and called on his s"
    },
    {
        "url": "https://www.bbc.co.uk/news/world-asia-68256017",
        "title": "Pakistan <b>election</b>: Rival parties each claim advantage",
        "description": "The jailed former Pakistani Prime Minister Imran Khan has claimed victory in Thursday&#39;s general election and called on his supporters to celebrate. Independent candidates linked to him have won most seats so far, with the majority of seats declared."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067045/Imprisoned-Imran-Khan-posts-AI-video-declaring-victory-Pakistani-election-independent-candidates-backing-win-seats-vote-marred-mobile-shutdown.html",
        "title": "Imran Khan posts AI video declaring victory in Pakistani <b>election</b> as candidates backed by his party win most seats despite him being behind bars and communications blackout",
        "description": "In the message, which is usually delivered by word through his lawyers, the AI version of Imran Khan rejected rival Nawaz Sharif&#39;s earlier claim to victory"
    },
    {
        "url": "https://www.ft.com/content/c642343b-589e-4347-9a7f-ff04b83728ff",
        "title": "The power of Europe’s rebellious farmers",
        "description": "The extraordinary concessions they won from Brussels this week illustrate their potential to reshape the bloc’s politics"
    },
    {
        "url": "https://www.ft.com/content/bfd4c9fe-3350-497f-99f9-59462ac055be",
        "title": "Could the Democrats replace Joe Biden?",
        "description": "Nikki Haley, Trump’s Republican rival, has repeatedly attacked Trump and Biden for being too old and mentally unfit for the presidency. But she has so far ruled out an independent bid. “I’m a Republican,” she told The Wall Street Journal this week. “A Republican primary is where Republicans run.”"
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/09/biden-memory-age-special-counsel-report-israel-ukraine-aid-bill-senate?filterKeyEvents=false&page=with:block-65c661368f089ae115b48fac",
        "title": "Former Obama adviser says special counsel report on Biden amounts to ‘partisan hit job’ – live",
        "description": "Special counsel report referenced Biden as ‘a sympathetic, well-meaning, elderly man with a poor memory’; Senate debates Israel and Ukraine aid bill"
    },
    {
        "url": "https://www.bbc.com/news/live/world-asia-68224671/page/4",
        "title": "Pakistan <b>election</b>: Rival parties each claim advantage as count continues",
        "description": "Welcome to our live coverage of Pakistan’s general election. Results have begun to trickle in after yesterday’s vote. Experts say the counting has been slower compared to previous elections."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/09/tories-fiscally-competent-labour-28bn-green-plan",
        "title": "The frightening thing is not that Tories are paraded as more fiscally competent. It’s that even Labour believes it",
        "description": "Abandoning its £28bn green plan betrays a lack of self-belief that has long bedevilled the party, says Guardian columnist Andy Beckett"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/rishi-sunak-latest-news-labour-green-pledge-starmer-live/",
        "title": "Politics latest news: Labour in fresh green U-turn over windfall tax",
        "description": "Rachel Reeves insisted she will still be the UK’s “first green chancellor” despite tearing up Labour’s flagship £28 billion investment pledge. Ms Reeves originally made the statement during her speech at Labour Party conference in 2021."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066175/Pensioners-abandon-Tories-just-quarter-65s-planning-vote-Conservative-Reform-Labour.html",
        "title": "Pensioners abandon the Tories with just a quarter of over-65s planning to vote Conservative at the next <b>election</b> - down from 60% in 2019 - with a surge in support for Reform ...",
        "description": "Just 26 per cent of over-65s say they plan to vote for the Tories at the next election, down from an estimated 60 per cent who backed the party under Boris Johnson at the 2019 election."
    },
    {
        "url": "https://edition.cnn.com/2024/02/08/politics/biden-age-concerns-analysis/index.html",
        "title": "Biden tries to lay to rest age concerns, but may have exacerbated them",
        "description": "A probe that spared President Joe Biden from criminal charges paradoxically dealt him a threatening political blow."
    },
    {
        "url": "https://www.independent.co.uk/asia/south-asia/imran-khan-pti-nawaz-sharif-pakistan-election-results-b2493465.html",
        "title": "Imran Khan’s party on course for stunning Pakistan <b>election</b> victory as its independents lead count",
        "description": "Contentious results are almost certain to be contested, analysts say, after lengthy delays in the count and amid uncertainty over fate of PTI and its jailed leader"
    },
    {
        "url": "https://www.thetimes.co.uk/article/can-labour-win-the-next-general-election-bf7s6qbdq",
        "title": "Can Labour win the next <b>general election</b>?",
        "description": "Their biggest strength is not being the Conservatives — but whether the superiority the party enjoys can be sustained over months of scrutiny is the question"
    },
    {
        "url": "https://www.independent.co.uk/arts-entertainment/music/news/rod-stewart-keir-starmer-labour-general-election-tory-b2493452.html",
        "title": "Rod Stewart blasts ‘lying public schoolboy’ Boris Johnson and says Labour should win next <b>election</b>",
        "description": "Long-time Tory Rod Stewart has thrown his weight behind Labour’s Keir Starmer ahead of a general election this year. The British rocker, 79, slammed “lying f***ing public schoolboy” Boris Johnson and called for the Conservatives to be booted out of No10 following a string of unelected prime ministers."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/chris-bryant-labour-mp-interview-death-threats-gay/",
        "title": "Sir Chris Bryant: ‘David Cameron used the Gaydar thing against me a couple of times’",
        "description": "The Labour MP talks receiving death threats, torrents of social media abuse for being gay – and why he feels less and less safe"
    },
    {
        "url": "https://www.huffpost.com/entry/white-house-officials-arab-muslim-leaders-michigan_n_65c55b04e4b093b2e782f247?ncid=engmodushpmg00000003",
        "title": "Top White House Officials Meet With Arab And Muslim Leaders To Reconcile",
        "description": "State Rep. Abraham Aiyash, the majority floor leader and the second-ranking Democrat in Michigan; Abdullah Hammoud, the mayor of Dearborn; and Assad Turfe, the deputy county executive of Wayne County, were among those who attended the meeting."
    },
    {
        "url": "https://uk.news.yahoo.com/may-too-stop-great-election-121912050.html",
        "title": "It may be too late to stop the great <b>election</b> disinformation campaigns of 2024 but we have to at least try",
        "description": "With an unprecedented number of votes happening around the world, the information environment will be chaotic, to say the least."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68248731",
        "title": "US <b>election</b>: Donald Trump wins huge victory in Nevada caucus",
        "description": "Former President Donald Trump has won the Nevada Republican caucus by a large margin. The only other person whose name was on the ballot was Ryan Binkley, a pastor and businessman. It means Mr Trump will take all Nevada&#39;s 26 delegates, the system used by the parties to determine their presidential candidate."
    },
    {
        "url": "https://edition.cnn.com/2024/02/09/politics/nevada-battleground-trump/index.html",
        "title": "Trump flexes his dominance of Nevada GOP but cracks are forming in this crucial battleground",
        "description": "Varlin Higbee traveled more than two hours from his Lincoln County, Nevada, home to see Donald Trump in person last month, but when he arrived at the former president’s Las Vegas rally, he was stopped at the door."
    },
    {
        "url": "https://www.thetimes.co.uk/money-mentor/investing/how-will-the-uk-and-us-elections-this-year-impact-investments",
        "title": "How will the UK and US <b>elections</b> this year impact investments?",
        "description": "In 2024 we will certainly see a highly contentious presidential <b>election</b> in the United States, scheduled for 5 November. We are also likely to have a <b>general election</b> in the United Kingdom around the same time. Here we explain what both could mean for your ..."
    },
    {
        "url": "https://kashmirreader.com/2024/02/10/96-88-cr-people-registered-to-vote-for-2024-ls-election-eci/",
        "title": "96.88 Cr People Registered To Vote For 2024 LS <b>Election</b>: ECI",
        "description": "The Election Commission (EC) on Friday announced that 96.88 crore people are registered to vote for the forthcoming General Elections, marking it the largest electorate. It also added over two crore youth electors in the age group of 18 to 29 years have been added in the voters’ list."
    },
    {
        "url": "https://news.yahoo.com/voting-mail-massachusetts-presidential-primary-212400217.html",
        "title": "Voting by mail in Massachusetts&#39; presidential primary? Here&#39;s what you need to know",
        "description": "The Bay State is a &quot;no excuse&quot; early voting/mail-in ballot state, meaning there is no need for a voter to provide a reason for voting by mail."
    },
    {
        "url": "https://www.yahoo.com/news/deadline-passes-heres-everyone-whos-194319887.html",
        "title": "Deadline passes: Here&#39;s everyone who&#39;s running in the May primary <b>elections</b>.",
        "description": "The primary winner will face Democrat Charlotte Wolfe in the fall. Wolfe, who’s marking her first foray into politics, runs Prairie Winds Nature Farm at her Lakeville home, hosting visitors who experience the care of horses, farm animals and gardens."
    },
    {
        "url": "https://timesofindia.indiatimes.com/videos/international/nawaz-sharif-delivers-victory-address-despite-imran-khans-pti-leading-vote-count-in-pakistan-election/videoshow/107567103.cms",
        "title": "Nawaz Sharif delivers victory address despite Imran Khan&#39;s PTI leading vote count in Pakistan <b>Election</b>",
        "description": "Former Pakistan Prime Minister Nawaz Sharif claims victory in ongoing general elections before vote count completion. Sharif expresses hope for improved relations with neighbors, including India, and tasks his brother Shehbaz Sharif with forming a coalition government."
    },
    {
        "url": "https://arynews.tv/tag/pti-arsalan-khalid/",
        "title": "Tag: PTI Arsalan Khalid",
        "description": "ARY NEWS brings you 24/7 Live Streaming, Headlines, Bulletins, Talk Shows, Infotainment, and much more. Watch minute-by-minute updates of current affairs and happenings from Pakistan and all around the world!"
    },
    {
        "url": "https://timesofindia.indiatimes.com/videos/toi-original/5-things-about-pakistan-election-that-you-must-know/videoshow/107567016.cms",
        "title": "5 Things about Pakistan <b>Election</b> that you Must Know",
        "description": "Former Pakistan Prime Minister Nawaz Sharif claims victory in ongoing general elections before vote count completion, despite Imran Khan&#39;s PTI leading vote count. Sharif expresses hope for improved relations with neighbors,"
    },
    {
        "url": "https://news.yahoo.com/pakistans-jailed-ex-pm-imran-190834325.html",
        "title": "Pakistan&#39;s jailed ex-PM Imran Khan claims <b>election</b> victory",
        "description": "Pakistan&#39;s jailed former Prime Minister Imran Khan on Friday claimed victory in the country&#39;s general election in an audio-visual message created using artificial intelligence and shared on his X social media account."
    },
    {
        "url": "https://www.modernghana.com/news/1291660/election-2024-we-dont-underestimate-alan-kyerema.html",
        "title": "<b>Election</b> 2024: We don’t underestimate Alan Kyerematen’s capabilities – George Opare Addo",
        "description": "The opposition National Democratic Congress NDC National Youth Organizer, George Opare Addo, has said the party doesn rsquo;t underestimate the capabilities of Independent Presidential aspirant Alan Kwadwo Kyerematen in the 2024 general election."
    },
    {
        "url": "https://www.foxnews.com/politics/dnc-alleges-rfk-jr-campaign-violating-election-law-fec-complaint-party-circles-wagons-around-biden",
        "title": "DNC alleges RFK Jr. campaign violating <b>election</b> law in FEC complaint, as party circles wagons around Biden",
        "description": "The Democratic National Committee alleges that Robert F. Kennedy Jr.&#39;s presidential campaign illegally coordinated with the American Values 2024 super PAC."
    },
    {
        "url": "https://nypost.com/2024/02/09/news/kamala-harris-rips-into-robert-hur-over-biden-questioning/",
        "title": "Kamala Harris rips special counsel report on Biden’s mental capacity, suggests Oct. 7 attack prompted bumbling Biden deposition",
        "description": "Vice President Kamala Harris tore into special counsel Robert Hur on Friday for questioning President Biden’s mental fitness in a stunning report on his handling of classified"
    },
    {
        "url": "https://www.theatlantic.com/ideas/archive/2024/02/supreme-court-colorado-oral-argument-trump-disqualify/677408/",
        "title": "What the Colorado Oral Argument Missed",
        "description": "The justices seem ready to leave the issue of Donald Trump’s eligibility up to Congress. Here’s why they shouldn’t."
    },
    {
        "url": "https://apnews.com/article/alpena-michigan-women-killed-trial-8a20482e3cbfd88a88798938af160bfc",
        "title": "Jury convicts northern Michigan man in murders of teen and woman",
        "description": "A jury has convicted a man of murder in the deaths of a teenage girl and a woman in northern Michigan. The body of one victim was buried in a backyard."
    },
    {
        "url": "https://www.cbsnews.com/news/top-election-officials-threats-election-denialism-the-takeout/",
        "title": "Two states&#39; top <b>election</b> officials talk about threats arising from <b>election</b> denialism — on &quot;The Takeout&quot;",
        "description": "Kansas Secretary of State Scott Schwab and Arizona Secretary of State Adrian Fontes joined Major Garrett this week on &quot;The Takeout&quot; podcast."
    },
    {
        "url": "https://www.barrons.com/news/turkey-s-pro-kurdish-party-enters-istanbul-mayor-s-race-5e03aad8",
        "title": "Turkey&#39;s Pro-Kurdish Party Enters Istanbul Mayor&#39;s Race",
        "description": "Turkey&#39;s pro-Kurdish party on Friday selected two low-profile candidates to run for mayor of Istanbul after the wife of the repressed community&#39;s jailed elder statesman dropped out of the March 31 vote."
    },
    {
        "url": "https://www.usnews.com/news/world/articles/2024-02-09/imran-khan-supporters-here-to-stay-as-young-pakistanis-turn-out-to-vote",
        "title": "Imran Khan Supporters &#39;Here to Stay&#39; as Young Pakistanis Turn Out to Vote",
        "description": "Volunteers for former Prime Minister Imran Khan&#39;s party Pakistan Tehreek-e-Insaf (PTI) look on as they watch results on TV screens after the end of the polling during a general election at the party&#39;s main office in Islamabad, Pakistan, February 8, 2024. REUTERS/Charlotte Greenfield"
    },
    {
        "url": "https://www.usatoday.com/story/news/local/maryland/2024/02/09/senate-run-by-larry-hogan-comes-as-surprise-upends-maryland-race/72538271007/",
        "title": "Larry Hogan makes surprise jump into Maryland Senate race, upending contest",
        "description": "Larry Hogan, Maryland&#39;s former two-term governor, has announced he&#39;s running for U.S. Senate. Here&#39;s what he had to say and how it upends race."
    },
    {
        "url": "https://inews.co.uk/news/world/biden-behind-scenes-white-house-2899483?ico=in-line_link",
        "title": "Biden row gives rare behind-the-scenes look at tightly controlled White House",
        "description": "The president is allowed barely any press briefings and even fewer interviews, with even wife Jill stepping in to ensure he is protected"
    },
    {
        "url": "https://uk.news.yahoo.com/china-increasing-political-influence-south-165028608.html",
        "title": "China’s increasing political influence in the south Pacific has sparked an international response",
        "description": "China is asserting itself in the South Pacific, prompting efforts from the US and its allies to contain its influence."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/02/09/saad-rafique-loses-against-latif-khosa-in-lahore/",
        "title": "Saad Rafique loses against Latif Khosa in Lahore",
        "description": "LAHORE: Pakistan Tehreek-e-Insaf (PTI) backed independent candidate Latif Khosa secured victory against PML-N candidate Khawaja Saad Rafique in NA-122 Lahore in general election 2024.According to"
    },
    {
        "url": "https://inews.co.uk/news/world/trump-biden-coherent-candidate-2898811?ico=related_stories",
        "title": "Donald Trump is incoherent – but it’s Joe Biden who looks doddery",
        "description": "While both Joe Biden and Donald Trump have a reputation for rambling, the President is getting the most flak for it"
    },
    {
        "url": "https://www.investing.com/news/world-news/bruised-and-betrayed-nikki-haley-defies-trump-juggernaut-3298821",
        "title": "Bruised and betrayed, Nikki Haley defies Trump juggernaut",
        "description": "The pressure on Team Haley, after heavy primary defeats in Iowa and New Hampshire last month, ratcheted up in Nevada on Tuesday when Haley was trounced by a &quot;none of these candidates&quot; option in a primary that Trump didn&#39;t contest."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/national/24108460.labour-defends-ditching-green-spending-pledge-tory-attacks-continue/",
        "title": "Labour defends ditching green spending pledge as Tory attacks continue",
        "description": "Labour is facing criticism after it ditched its pledge to spend £28 billion a year on green projects, as party figures sought to defend the move."
    },
    {
        "url": "https://www.ardrossanherald.com/news/24108425.north-ayrshire-general-election-candidates-clash-housing/",
        "title": "North Ayrshire <b>general election</b> candidates clash on housing",
        "description": "Todd Ferguson, the Tories&#39; candidate for North Ayrshire and Arran at the forthcoming <b>general Election</b>, claims the area&#39;s MP has &quot; run out of excuses trying to deflect from years of SNP failure to build enough houses. But Patricia Gibson, who is ..."
    },
    {
        "url": "https://www.ft.com/content/16011adf-94a6-415b-8d3a-78f4cbbddc58",
        "title": "Ministers cut performance targets for biggest UK rail franchise",
        "description": "Ministers have lowered performance standards for the UK’s largest rail franchise after its operator Govia Thameslink Railway failed on most measures of service quality in the first year of its contract."
    },
    {
        "url": "https://www.independent.co.uk/asia/south-asia/pakistan-election-results-counting-delays-win-imran-khan-b2492953.html",
        "title": "Pakistan <b>election</b> credibility already marred by internet blackout and slow count amid anxious wait for results",
        "description": "Analysis: With results slowly trickling in, analysts say the past two years of political turmoil show the Pakistani military’s grip on power is as tight as ever. Shweta Sharma reports"
    },
    {
        "url": "https://www.huffpost.com/entry/biden-classified-documents-special-counsel_n_65c2decbe4b069b665dd3c30",
        "title": "Biden &#39;Willfully&#39; Kept Classified Documents But Won&#39;t Face Charges, Special Counsel Says",
        "description": "Special counsel Robert Hur said in his report that while Biden “willfully retained and disclosed classified materials after his vice presidency when he was a private citizen,” no criminal charges were warranted."
    }
]