[
    {
        "url": "https://uk.style.yahoo.com/events-week-curb-enthusiasm-grammys-191750647.html",
        "title": "Events of the Week: ‘Curb Your Enthusiasm,’ Grammys Parties and More",
        "description": "Here’s a look at this week’s biggest premieres, parties and openings in Los Angeles and New York, including events for Curb Your Enthusiasm, Mr. &amp; Mrs. Smith and the Grammys. Curb Your Enthusiasm premiere Larry David,"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/parties-united-in-tackling-unfinished-business-of-finance-for-ni-donaldson-BKKI5EPOQ5NODLE5ZHC2NDKRE4/",
        "title": "Parties united in tackling unfinished business of finance for NI – Donaldson",
        "description": "Northern Ireland political leaders met at Stormont Castle on Friday ahead of the return of devolved government on Saturday."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-deal-with-intimidation-mps-angela-rayner/",
        "title": "Sunak vows to tackle intimidation faced by ‘too many’ MPs",
        "description": "Rishi Sunak has vowed to “deal with” the intimidation that many MPs face after Mike Freer, the Tory MP, announced that he was stepping down following death threats."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-merseyside-68182057",
        "title": "Liverpool City Council to repay millions after jobs target missed",
        "description": "A council is to give millions of pounds back to the government after a jobs target for a waterfront regeneration project was not met. Liverpool City Council has blamed a car park fire for the inability to create hundreds of jobs on Kings Dock."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68181089",
        "title": "Eleven candidates announced for Rochdale by-election",
        "description": "Eleven candidates have been announced in a by-election which was called after the death of a veteran Labour MP. The poll in Rochdale was triggered after Sir Tony Lloyd died in January, days after announcing he had an incurable form of leukaemia."
    },
    {
        "url": "https://www.thenational.scot/politics/24094733.labours-quaint-tradition-scrapping-28bn-green-pledge/",
        "title": "Labour&#39;s quaint tradition of scrapping their £28bn <b>green</b> pledge",
        "description": "For those mercifully shielded from the tedium of Labour <b>Party</b> policy, a short recap. The policy was first announced by Rachel Reeves in 2021, who boasted of her ambition of being the “first <b>green</b> chancellor”. READ MORE: &#39;What&#39;s the point?&#39;:"
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/relaunch-party-celebrates-returning-licensee-9064165",
        "title": "Pub relaunch <b>party</b> tonight - and you&#39;ll recognise who&#39;s behind the bar",
        "description": "A Kidsgrove pub is celebrating a change of ownership with a relaunch party. Licensee Ian Cooper has reopened The Clough Hall. The 50-year-old already ran the Clough Hall Road venue for nearly three years."
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/politics/junior-minister-dublin-airport-cap-32033902",
        "title": "Junior Transport Minister &#39;fully supports&#39; raising Dublin Airport cap as coalition divided",
        "description": "As a spokeswoman for Transport Minister Eamon Ryan said that he &quot;cannot and would not intervene in that independent process in any way&quot;, Junior Minister Jack Chambers backed the daa&#39;s plan to increase"
    },
    {
        "url": "https://news.sky.com/story/labour-will-look-for-radicalism-through-reform-13062317?dcmp=snt-sf-twitter",
        "title": "Labour will look for &#39;radicalism&#39; through reform rather than risk fiscal slip-up",
        "description": "In a week of row backs from her <b>party</b> over reinstating the cap on bankers&#39; bonuses and pouring up to £28bn a year into <b>green</b> energy, Angela Rayner is one Labour politician standing her ground. In Scotland to promote her &quot;new deal for workers&quot;, the deputy ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-indictment-pronounciation-b2489646.html",
        "title": "Marjorie Taylor Greene mocked for struggling to pronounce indictable or read a long number",
        "description": "Ms Greene’s gaffe occurred on Tuesday while the House Homeland Security Committee debated whether or not the homeland security secretary Alejandro Mayorkas should be impeached"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/safeguarding-the-union-deal-dup-leader-sir-jeffrey-donaldson-says-parties-united-in-tackling-unfinished-finance-for-northern-ireland-4503772",
        "title": "Safeguarding the union deal: DUP leader Sir Jeffrey Donaldson says parties united in tackling unfinished finance for Northern Ireland",
        "description": "The new Stormont powersharing executive will be united in dealing with the “unfinished business” of funding for public services in Northern Ireland, DUP leader Sir Jeffrey Donaldson has said."
    },
    {
        "url": "https://news.sky.com/story/labour-deputy-leader-doubles-down-on-workers-rights-pledges-amid-backtracking-reports-13062223?dcmp=snt-sf-twitter",
        "title": "Labour deputy leader doubles down on workers&#39; rights pledges after backtracking reports",
        "description": "Angela Rayner reiterated a commitment to introduce draft legislation within 100 days of a Labour victory to enshrine its employment promises in law. It comes following claims the party had rowed back on some of its pledges."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/labour-is-in-the-worst-of-all-worlds-with-confused-messaging-on-its-28bn-pledge",
        "title": "Labour is in the worst of all worlds with confused messaging on its £28bn pledge",
        "description": "Tories watch on delighted as Starmer continues to talk about the figure while the shadow Treasury team distances itself from it"
    },
    {
        "url": "https://morningstaronline.co.uk/article/dishing-out-licences-climate-criminals-tory-donor-fined-illegal-gas-flaring-given",
        "title": "‘Dishing out licences to climate criminals’",
        "description": "CAMPAIGNERS attacked the government for “dishing out licences to climate criminals” today after a Tory donor-owned firm, previously fined for illegal flaring, secured a licence to drill for fossil fuels. The government green lit new licences to 17 oil and gas companies in the North Sea in the last week."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/02/keir-starmer-ditching-28bn-climate-plan-cowardly-labour",
        "title": "A message to Starmer from the US: ditching your £28bn climate plan isn’t just cowardly – it’s bad politics",
        "description": "However, at the very least, the Biden administration has set a bar for the scale of <b>green</b> investment that centre-left parties should undertake. The same can’t be said of the Labour <b>party</b>, which has reportedly now scrapped its laudable £28bn <b>green</b> ..."
    },
    {
        "url": "https://www.thenational.scot/news/24094646.far-right-homeland-party-registers-elections-watchdog/",
        "title": "Far-right Homeland <b>Party</b> registers with elections watchdog",
        "description": "A FAR-RIGHT group which splintered from the “UK’s most dangerous” nationalist organisation has been registered with the election"
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155023/everyone-who-is-standing-in-the-rochdale-byelection",
        "title": "Everyone who is standing in the Rochdale by-election",
        "description": "On 29 February, residents of the Rochdale constituency will have their chance to say who they want to represent them"
    },
    {
        "url": "https://inews.co.uk/news/politics/business-fear-tax-rises-labour-2886820",
        "title": "Business bosses fear ‘sting in the tail’ on taxes from Labour, says insider",
        "description": "In front of bosses from companies including Microsoft and Aviva, shadow Chancellor Rachel Reeves pledged that Labour would freeze corporation tax for five years if it wins the next election."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/power-sharing-northern-ireland-set-32033049",
        "title": "Power sharing in Northern Ireland set to be resurrected two years after collapse",
        "description": "In a historic moment Sinn Fein&#39;s Michelle O&#39;Neill will become the first republican First Minister after the DUP ended a two-year political paralysis at Stormont"
    },
    {
        "url": "https://stratfordobserver.co.uk/news/green-party-candidate-to-meet-southam-residents-48144/",
        "title": "<b>Green Party</b> candidate to meet Southam residents",
        "description": "THERE is a chance to meet the Green Party candidate for Kenilworth and Southam. Coun Zoe Leventhal is inviting residents for tea and cakes at the Grange Hall in Southam tomorrow (Saturday). The event runs from 12."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13038521/Shish-thats-expensive-Spiralling-cost-doner-kebabs-debated-German-parliament-producers-warn-price-national-dish-soon-pass-ten-euros.html",
        "title": "Shish, that&#39;s expensive: Spiralling cost of doner kebabs is debated in German parliament as producers warn price of national dish will soon pass ten euros",
        "description": "Germany &#39;s well-publicised &#39;winter of discontent&#39; has just taken yet another turn for the wurst as the price of a doner kebab continues to climb - with some warning it could soon reach ten euros"
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/24093919.labour-not-committed-arbitrary-numbers-green-investment---rayner/",
        "title": "Labour not committed to ‘arbitrary’ numbers on <b>green</b> investment – Rayner",
        "description": "Labour deputy leader Angela Rayner has said the <b>party</b> is not committed to “arbitrary” numbers on its pledge to ultimately invest £28 billion a year in the <b>green</b> economy. She said the money will depend on sticking to fiscal rules and Labour will ..."
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24092880.donaldson-will-hold-governments-feet-fire-stormont-deal/",
        "title": "Donaldson ‘will hold Government’s feet to the fire’ over Stormont deal",
        "description": "<b>Party</b> leaders are meeting at Stormont Castle on Friday afternoon ... The paper commits to replacing the Windsor Framework’s <b>green</b> lane process at Northern Ireland ports, which requires percentages of goods to be checked as they arrive from Great Britain ..."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "Lucy Fisher And in favour of Labour. Miranda <b>Green</b> Very much in favour of Labour. So it’s another part of that puzzle of where does the Tory <b>party</b> think its future voters are coming from. Lucy Fisher I just want to move on to one more group quickly ..."
    },
    {
        "url": "https://www.thesun.ie/news/12121612/leo-varadkar-ryanair-michael-oleary-minister-dublin-airport/",
        "title": "Leo Varadkar weighs into Ryanair spat and tells Michael O’Leary Minister ‘not an idiot’ in Dublin Airport passenger row",
        "description": "Ryanair are now calling for the Transport Minister to step down over the <b>Green Party</b>’s opposition to the cap on passengers being lifted from 32 million to 40 million over the next two years. Airport operator daa are seeking permission from the local ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/council-row-over-new-60000-gates-to-close-south-belfast-park-at-night/a107557121.html",
        "title": "Council row over new £60,000 gates to close south Belfast park at night",
        "description": "Alliance councillor Michael Long asked about the “competence” of the <b>Green Party</b> proposal, and said: “We have absolutely no idea what the details of this would be. I am all for having things like this, I would just need to know a little more about it ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/dup-leader-sir-jeffrey-donaldson-parties-united-in-tackling-unfinished-business-of-finance-for-northern-ireland-4503772",
        "title": "DUP leader Sir Jeffrey Donaldson: Parties united in tackling unfinished business of finance for Northern Ireland",
        "description": "The new Stormont powersharing executive will be united in dealing with the “unfinished business” of funding for public services in Northern Ireland, DUP leader Sir Jeffrey Donaldson has said."
    },
    {
        "url": "https://www.heraldscotland.com/news/24094366.angela-rayner-casts-doubt-labours-28bn-green-investment-vow/",
        "title": "Angela Rayner casts more doubt on Labour&#39;s £28bn <b>green</b> investment vow",
        "description": "Angela Rayner has cast further doubt on Labour’s plan to invest up to £28billion a year in the green economy if it wins power, calling the"
    },
    {
        "url": "https://news.sky.com/story/labour-deputy-leader-doubles-down-on-workers-rights-pledges-amid-backtracking-reports-13062223",
        "title": "Labour deputy leader doubles down on workers&#39; rights pledges after backtracking reports",
        "description": "Angela Rayner reiterated a commitment to introduce draft legislation within 100 days of a Labour victory to enshrine its employment promises in law. It comes following claims the party had rowed back on some of its pledges."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/senior-mp-confirms-labour-has-dropped-28bn-target-for-green-investment",
        "title": "Senior MP all but confirms Labour has dropped £28bn <b>green</b> investment target",
        "description": "Darren Jones says party will decide budget based on state of economy and individual projects if it wins election"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/02/labour-28bn-green-investment-pledge-keir-starmer-rachel-reeves-uk-politics-live",
        "title": "Rayner says Labour still wants to spend £28bn on <b>green</b> investment but won’t be bound by ‘arbitrary’ number – as it happened",
        "description": "Labour deputy leader says green spending would depend on state of public finances during visit to Scotland"
    },
    {
        "url": "https://www.ohmymag.co.uk/news/rachel-reeves-the-labour-mps-whopping-five-figure-salary-revealed_art21014.html",
        "title": "Rachel Reeves: The Labour MP’s whopping five-figure salary revealed",
        "description": "However, there has been a major update today during the course of another Sky News interview: a senior MP has confirmed Labour is dropping the £28bn target for green investment. Darren Jones, the shadow chief secretary to the Treasury, revealed this morning that the party has already ditched the plan."
    },
    {
        "url": "https://inews.co.uk/opinion/labour-core-supporters-betrayed-haunt-keir-starmer-2886058?ico=most_popular",
        "title": "Labour’s core supporters have been betrayed. And it will haunt Keir Starmer",
        "description": "You can see why Labour has decided to keep things as they are in this regard. The party is desperately keen to be seen as supportive of business and financial services, and they do not want to shake up or alienate those sectors in an election year, at an extremely difficult economic juncture."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/",
        "title": "Politics latest news: Labour starts pre-election talks with civil service",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://www.scotsman.com/news/politics/angela-rayner-labour-not-committed-to-arbitrary-figures-on-green-investment-4503410",
        "title": "Angela Rayner: Labour not committed to ‘arbitrary’ figures on <b>green</b> investment",
        "description": "Drew Hendry, the SNP’s economy spokesman, said: &quot;This latest U-turn by Sir Keir Starmer, which mirrors the economic negligence of the Tories, is a deeply damaging move that threatens jobs, investment and economic growth in Scotland – at a time when it&#39;s needed more than ever.”"
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/304631/green-party-welcomes-decision-to-save-promote-learning-disability-service",
        "title": "<b>Green Party</b> Welcomes Decision To Save Promote Learning Disability Service",
        "description": "The Green Party has welcomed the decision by charity &amp; social, Orchardville, to run the Promote Learning Disability Service in Bangor after it was under threat of closure. Although delighted by the news,"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-snp-jobs-scotland-scottish-government-b1136698.html",
        "title": "Labour not committed to ‘arbitrary’ numbers on <b>green</b> investment – Rayner",
        "description": "Labour deputy leader Angela Rayner has said the party is not committed to “arbitrary” numbers on its pledge to ultimately invest £28 billion a year in the green economy. She said the money will depend on sticking to fiscal rules and Labour will “ramp up” to this figure if in government."
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/politics/ryanairs-michael-oleary-calls-environment-32031269",
        "title": "Ryanair&#39;s Michael O&#39;Leary calls Environment Minister Eamon Ryan &#39;useless&#39; over Dublin Airport row",
        "description": "It is reported that there were at least 380 submissions to Fingal County Council about the plan to increase the cap at Dublin Airport, with Green Party Junior Minister Joe O’Brien, Limerick TD Brian L"
    },
    {
        "url": "https://www.northwichguardian.co.uk/news/national/24092880.donaldson-will-hold-governments-feet-fire-stormont-deal/",
        "title": "Donaldson ‘will hold Government’s feet to the fire’ over Stormont deal",
        "description": "The leader of the DUP has warned the Government he will hold its “feet to the fire” on delivering on the deal to restore Stormont as he admitted he did not fully trust it. Sir Jeffrey Donaldson said independent monitoring mechanisms built into the agreement meant there were means to ensure the Government was doing what it has pledged to do."
    },
    {
        "url": "https://www.4ni.co.uk/northern-ireland-news/304632/alliance-calls-for-swifter-implementation-on-gynaecological-services",
        "title": "Alliance Calls For Swifter Implementation On Gynaecological Services",
        "description": "The <b>Green Party</b> has welcomed the decision by charity &amp; social, Orchardville, to run the Promote Learning Disability Service in Bangor after it was under threat of closure. Although delighted by the news, Councillor McKee said that it was &quot;disgraceful&quot; that ..."
    }
]