[
    {
        "url": "https://www.iredellfreenews.com/news-features/2024/in-person-early-voting-for-2024-primary-underway-in-iredell-county/",
        "title": "In-person early voting for 2024 primary underway in Iredell County",
        "description": "RALEIGH — In-person early voting for the 2024 primary election began Thursday and runs through Saturday, March 2, at early voting locations across North Carolina. Statewide, more than 340 early voting sites will be open for early voting ahead of the March 5 primary election."
    },
    {
        "url": "https://www.northamptonchron.co.uk/news/politics/wellingborough-by-election-live-hour-by-hour-coverage-from-the-count-as-voters-choose-their-next-mp-4520722",
        "title": "Wellingborough by-election LIVE - hour-by-hour coverage from the count as voters choose their next MP",
        "description": "Voters in Wellingborough have gone to the polls to choose their next MP. A by-election is being held after constituents booted out former Conservative Peter Bone, who had held the seat for 18 years, in a recall petition."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867260/bbc-question-time-labour-uturn",
        "title": "BBC Question Time audience member skewers Labour over &#39;track record&#39; of U-turns",
        "description": "A BBC Question Time audience member hit out at Labour&#39;s &quot;track record&quot; of U-turns in a fiery moment during tonight&#39;s show. The moment came as the panel in Lancashire debated whether Labour&#39;s biggest challenge to winning the next election is the party itself."
    },
    {
        "url": "https://www.thesun.co.uk/news/25971154/keir-starmer-green-policy-anti-semitism-row-labour/",
        "title": "Bungled <b>green</b> policy &amp; anti-Semitism row…after worst 2 weeks as Labour boss, Starmer shouldn’t open the bubbly yet",
        "description": "IN the dying days of Boris ­Johnson’s government, an image of crates of fizz being wheeled in the back door of Downing Street could not be more perfect for an eagle-eyed snapper. Torpedoed by"
    },
    {
        "url": "https://uk.news.yahoo.com/house-republicans-giving-congress-despite-191527978.html",
        "title": "House Republicans are giving up on Congress despite holding the majority: &#39;This place is so broken&#39;",
        "description": "Several GOP committee chairs are retiring, and younger Republicans in particular seem to be giving up on public service."
    },
    {
        "url": "https://www.bbc.com/news/articles/c89n5vg1zx7o",
        "title": "Councils vote to freeze tax rates",
        "description": "Glasgow City Council and North Lanarkshire Council have voted to freeze council tax for the coming year. The budgets were approved after councillors at the respective local authorities met to discuss budgets for the next three years. Other councils will discuss their budgets in the coming weeks, with some actively considering council tax rises."
    },
    {
        "url": "https://www.heraldscotland.com/news/24122741.labour-windfall-tax-hike-could-see-100-000-jobs-lost/",
        "title": "Labour windfall tax hike &#39;could see 100,000 jobs lost&#39;",
        "description": "Labour’s plans for a 78 windfall tax on the profits of energy firms would &quot;cast tens of thousands of hard-working men and women on"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/rochdale-by-election-voters-urged-teach-keir-starmer-lesson/",
        "title": "Rochdale by-election voters urged to ‘teach Starmer a lesson’ in attack adverts",
        "description": "Supporters of suspended candidate Azhar Ali depict Labour leader as a clown in virtual posters believed to be shared on WhatsApp"
    },
    {
        "url": "https://www.thenational.scot/news/24123372.scottish-young-labour-calls-members-join-pro-palestine-rally/",
        "title": "Scottish Young Labour calls on members to join pro-Palestine rally",
        "description": "SCOTTISH Young Labour have called on members to join them in leaving the parties annual conference to call for an immediate ceasefire."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24123356.north-east-labour-candidate-kim-mcguinness-accused-racial-slur/",
        "title": "North East Labour candidate Kim McGuinness accused of ‘racial slur’",
        "description": "Labour’s candidate for North East mayor Kim McGuinness has been accused of using a “racial slur” in a historic social media post."
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/15/rishi-sunak-warned-against-fresh-austerity-drive-to-finance-tax-cuts?ref=biztoc.com",
        "title": "Rishi Sunak warned against fresh austerity drive to finance tax cuts",
        "description": "Unions outraged as Jeremy Hunt said to be considering cutting public spending to balance books in next month’s budget"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-north-east-mayor-candidate-28642025",
        "title": "Labour North East mayor candidate Kim McGuinness accused of using &#39;racial slur&#39; in historic social media post",
        "description": "Northumbria Police and Crime Commissioner Kim McGuinness, who is standing to be North East mayor, has apologised for an &quot;offensive&quot; online remark made in 2011"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13088643/joe-biden-donald-trump-supporters-party-candidates-michigan.html",
        "title": "Biden&#39;s supporters are MORE willing than Trump fans to back third <b>party</b> candidates like Robert F. Kennedy Jr. in dire poll for president, 81, in swing state of Michigan",
        "description": "Biden&#39;s supporters are more willing to break with their candidate than those backing Trump when third party candidates are considered in Michigan&#39;s 2024 race, according to a new poll."
    },
    {
        "url": "https://www.thenational.scot/news/24123012.scottish-labour-welcome-banking-boss-parliament-discuss-cost-living/",
        "title": "Scottish Labour welcome banking boss to Parliament ... to discuss cost of living",
        "description": "A LABOUR MSP is facing criticism from within his own party after inviting a banking chief to Holyrood to share his “unique perspective”"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-holiday-hunger-programme-extra-28642227",
        "title": "Glasgow holiday hunger programme to get extra £1.5m after row over Labour &#39;cut&#39;",
        "description": "Glasgow City Council is to invest a further £1.5 million into its Holiday Food programme this financial year as part of its budget deal - after claims the Labour budget has scrapped it &#39;by mistake&#39;."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/two-thirds-brits-back-labours-32136427",
        "title": "Two thirds of Brits back Labour&#39;s plan for public owned <b>green</b> energy - with only 6% opposed",
        "description": "It comes after a study by Common Wealth found Labour’s <b>green</b> investment plan would make Britain’s transition to clean energy cheaper. The report, released on Wednesday, suggests the <b>party</b>&#39;s plan to create GB Energy will save up to £1bn in interest ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/11921424.all-aboard-for-the-1990-celebrations-everything-from-bolshoi-to-deacon-blue/",
        "title": "All aboard for the 1990 celebrations Everything from Bolshoi to Deacon Blue",
        "description": "The all-embracing 1990 programme also incorporates resident programmes seasons, and festivals like Musica Nova -- but will include additional programmes in the City Hall by the BBC Scottish Symphony Orchestra, portraying him as the European composer of the twentieth century."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/call-for-reform-to-prevent-future-stormont-powersharing-collapses-SVBIJKTJI5DURO5TPQ6DGFMVB4/",
        "title": "Call for reform to prevent future Stormont powersharing collapses",
        "description": "Micheal Martin spoke of his desire to see changes to the Stormont system as he addressed the Dail on Wednesday."
    },
    {
        "url": "https://www.birminghammail.co.uk/black-country/teen-killers-who-stabbed-schoolboy-28641449",
        "title": "Teen killers who stabbed schoolboy, 16, in daytime machete horror can be named for first time",
        "description": "These are the faces of two killer teens who slaughtered a schoolboy in a horror daytime stabbing. Corey Burkitt and Leroy Robinson can be named for the first time today after they were locked up for life for murdering 16-year-old Joseph Riches."
    },
    {
        "url": "https://www.thesun.co.uk/news/25957439/rishi-sunak-by-elections-results-updates-starmer/",
        "title": "By-election polls updates: Rishi Sunak and Keir Starmer face a double electoral test in two previously safe Tory seats",
        "description": "RISHI Sunak and Sir Keir Starmer face a double electoral test today as voters go to the polls in two previously safe Tory seats.  The by-elections in Kingswood and Wellingborough will decide"
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155169/houses-evacuated-after-police-find-%E2%80%9Csuspicious-items%E2%80%9D-inside-house-on-ashfield-road",
        "title": "Houses evacuated after police find “suspicious items” inside house on Ashfield Road",
        "description": "Several houses in the Ashfield Road area of Rochdale have been evacuated and the bomb disposal team is in attendance"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11987400/anas-sarwar-claims-labour-u-turns-show-political-bravery/",
        "title": "Anas Sarwar claims Labour U-turns show ‘political bravery’",
        "description": "LABOUR’s list of recent policy u-turns is an example of “political bravery”, Anas Sarwar claimed today. The Scottish Labour leader – speaking ahead of his party’s conference –"
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/ryanair-eamon-ryan-airport-cap-32133807",
        "title": "Ryanair calls on Eamon Ryan to lift Dublin Airport traffic cap or quit",
        "description": "Dublin Airport has lost three aircraft, 16 routes and over 200 jobs to southern Italy as a direct result of the traffic cap"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/readers-anti-semitism-labour-keir-starmer-israel/?utmsource=email",
        "title": "‘For every Muslim vote Starmer loses, there are a lot of people who support him’",
        "description": "The anti-Semitic views expressed by the former Labour candidate, Mr Ali, are supported by a large chunk of the electorate in certain constituencies. Readers weighed in on how this might impact the party’s electoral success, including whether support for its most Left-wing members may be resurrected."
    },
    {
        "url": "https://news.sky.com/story/rachel-reeves-accepted-donation-from-lord-donoughue-linked-to-climate-sceptic-group-gwpf-13072147?dcmp=snt-sf-twitter",
        "title": "Rachel Reeves accepted donation from Lord Donoughue, linked to climate sceptic group GWPF",
        "description": "There is no suggestion the donation is linked with Labour&#39;s decision to row back on green plans, but the timing of it is unfortunate, coming just weeks before the party announced it would ditch its proposed £28bn investment in the green economy."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13086319/Khlo-Kardashian-celebrates-Valentines-Day-plenty-personalized-party-balloons-daughter-True-son-Tatum.html",
        "title": "Khloé Kardashian celebrates Valentine&#39;s Day with plenty of personalized <b>party</b> balloons for daughter True and son Tatum",
        "description": "Khloé Kardashian, 39, celebrated Valentine&#39;s Day on Wednesday with personalized party balloons for her daughter True, five, and 18-month-old son Tatum."
    },
    {
        "url": "https://www.hampshirechronicle.co.uk/news/24121938.lib-dems-admit-error-labour-victory-political-literature/",
        "title": "Lib Dems admit error over Labour victory in political literature",
        "description": "In a pamphlet from General Election candidate Danny Chambers, delivered to hundreds of Winchester homes, they claim “Labour has NEVER won here”. In fact George Jeger won for Labour in 1945, holding the seat for four years as part of the post-war Attlee government."
    },
    {
        "url": "https://metro.co.uk/2024/02/15/lord-dave-told-kiss-ass-us-republican-20284741/?ico=trending-post-strip_item_4",
        "title": "Lord Dave told to ‘kiss my ass’ by US Republican",
        "description": "A reporter asked Congresswoman <b>Green</b>: ‘He (Cameron) likened you to an appeaser to ... forces has been turned into a political flashpoint for the American conservative <b>party</b>. Republicans have fired back and said the UK is not doing their fair share ..."
    },
    {
        "url": "https://www.countypress.co.uk/news/24122288.isle-wight-general-election-candidates-announced-lib-dems/",
        "title": "Isle of Wight general election candidates announced by Lib Dems",
        "description": "Cllr Lilley will do battle for Isle of Wight East, while Cllr Stuart will fight for Isle of Wight West in the next general election. The last Isle of Wight Liberal Democrat MP was Peter Brand, who served between 1997 and 2001 and died last year."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/stormont-northern-ireland-dup-sinn-fein-dublin-b1139390.html",
        "title": "Call for reform to prevent future Stormont powersharing collapses",
        "description": "Micheal Martin spoke of his desire to see changes to the Stormont system as he addressed the Dail on Wednesday."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/teens-who-filmed-dying-boy-32133645.amp",
        "title": "Teens who filmed dying boy after machete attack locked up for more than 72 years",
        "description": "Joseph Riches bled to death after being ambushed by four boys who attacked him with a 2ft long blade after he came at them with a screwdriver in Stourbridge town centre"
    },
    {
        "url": "https://news.sky.com/story/tory-economic-plan-is-a-tough-sell-to-voters-13072189",
        "title": "Tory economic plan is a tough sell to voters",
        "description": "A low growth economy that is now in recession will have consequences for the upcoming budget - and that could play a part in the outcome of the next election."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/green-party-announces-ex-police-28638753",
        "title": "<b>Green Party</b> announces ex-police officer and campaigner as candidate for Tees Valley Mayor",
        "description": "Environmental campaigner Sally Bunce has launched her campaign as the Green Party candidate for Tees Valley Mayor."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/labour-wellingborough-peter-bone-rishi-sunak-government-b2496453.html",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.leicestermercury.co.uk/news/leicester-news/greens-pick-leicester-parliamentary-candidates-9099058",
        "title": "Greens pick Leicester parliamentary candidates to battle for city&#39;s three seats at election",
        "description": "The all female line up includes the Leicester branch of the party’s mayoral candidate at the local elections last year and a former Labour city councillor"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-suffolk-68304233",
        "title": "Council approves £2.4m sports facilities for Stowmarket",
        "description": "Mid Suffolk Council&#39;s planning committee has unanimously approved the Stowmarket Health, Education and Leisure Facilities (SHELF). The £2.4m project will include a new 3G pitch, a multi-use games area and community running track. Green Party councillor Tim Weller said: &quot;This is a huge milestone for such an ambitious project.&quot;"
    },
    {
        "url": "https://www.expressandstar.com/news/crime/2024/02/15/phone-footage-of-the-moment-joseph-riches-was-stabbed-in-stourbridge-was-played-at-party-later-that-night/",
        "title": "Phone footage of the moment Joseph Riches was stabbed in Stourbridge was played at <b>party</b> later that night",
        "description": "The four men jailed for the murder of teenager Joseph Riches went to a party later that evening where footage of the moment he was stabbed with a machete was &#39;played to the crowd.&#39;"
    },
    {
        "url": "https://inews.co.uk/opinion/profound-shock-around-corner-keir-starmer-2905287?ico=best_of_opinion",
        "title": "There’s a profound shock around the corner for Keir Starmer",
        "description": "Starmer has a number of power bases to deal with, including shadow Chancellor Rachel Reeves, who has grown in confidence and authority over the past year to the extent that she gets more interest than Starmer from business figures and the sort of people in Westminster who fly like iron filings to a magnet towards the most powerful force around."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/15/rishis-recession-reeves-seizes-her-moment-to-take-the-economic-high-ground",
        "title": "‘Rishi’s recession’: Reeves seizes her moment to take the economic high ground",
        "description": "Shadow chancellor’s No 10-style press conference given extra credence by decision to drop £28bn green pledge, Labour sources say"
    },
    {
        "url": "https://inews.co.uk/news/politics/wellingborough-kingswood-by-election-2907271?ico=in-line_link",
        "title": "Four things to look out for in the Wellingborough and Kingswood by-election results",
        "description": "Tory MPs are threatening an attempt to oust Rishi Sunak if Reform secures a decent share of the vote in the by-elections"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/regional-news/kingswood-election-2024-live-voters-9099248",
        "title": "Kingswood by-election 2024 LIVE: Voters head to the polls today after MP resigns",
        "description": "To win, the <b>party</b> needs a swing in the share of the vote of 11.4 percentage ... Sam Bromiley (Conservative), Andrew Brown (Liberal Democrat), Damien Egan (Labour), Lorraine Francis (<b>Green</b>), Rupert Lowe (Reform) and Nicholas Wood (Ukip)."
    }
]