[
    {
        "url": "https://www.thenorthernecho.co.uk/news/24073918.yorkshire-vet-julian-norton-scotches-mayoral-race-claims/",
        "title": "Yorkshire vet Julian Norton scotches mayoral race claims",
        "description": "Other candidates who have been selected or may put themselves forward next month for the mayoral contest include David Skaith for the Labour <b>Party</b>, Conservative candidate Keane Duncan, <b>Green</b> candidate Kevin Foster and Independent Keith Tordoff. Earlier ..."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24075869.tiktok-stars-among-new-acts-announced-trnsmt-festival/",
        "title": "TikTok stars among new acts announced for TRNSMT Festival",
        "description": "Sugababes, Liam Gallagher and Garbage are all on the bill for the festival on Glasgow Green between July 12 and 14."
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/24075442.newquay-cornwall-council-increase-precept-27/",
        "title": "Newquay, Cornwall, council to increase precept by 27%",
        "description": "The town’s <b>Green Party</b> councillors spearheaded what they say is a “challenging decision” after “years of Tory austerity and poor management of the town council finances”. However, Labour councillor Stephen Hick, who represents Newquay Trenance ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-councillor-embarrassed-towns-obscene-163658306.html",
        "title": "Labour councillor &#39;embarrassed&#39; by town&#39;s &#39;obscene and cruel&#39; 27% tax increase",
        "description": "The town’s <b>Green Party</b> councillors spearheaded what they say is a “challenging decision” after “years of Tory austerity and poor management of the town council finances”. However, Labour councillor Stephen Hick, who represents Newquay Trenance ..."
    },
    {
        "url": "https://uk.news.yahoo.com/greenpeace-activists-unfurl-banner-madrid-211443254.html",
        "title": "Greenpeace activists unfurl banner at Madrid museum to demand Gaza ceasefire",
        "description": "Greenpeace activists unfurled an illustration by US artist Obey on the outside of Madrid’s Reina Sofia art museum on Wednesday 24 January, to call for an immediate ceasefire in Gaza. Police, ambulances and fire service were called to the scene as the ..."
    },
    {
        "url": "https://www.standard.co.uk/culture/music/calvin-harris-tiktok-liam-gallagher-garbage-scottish-b1134912.html",
        "title": "TikTok stars among new acts announced for TRNSMT Festival",
        "description": "Sugababes, Liam Gallagher and Garbage are all on the bill for the festival on Glasgow Green between July 12 and 14."
    },
    {
        "url": "https://www.richmondshiretoday.co.uk/keane-duncans-campervan-quest-a-load-of-tripe-says-political-rival/",
        "title": "Keane Duncan’s campervan quest ‘a load of tripe’, says political rival",
        "description": "The battle to become York and North Yorkshire’s first mayor has started to heat up with independent candidate Keith Tordoff suggesting Keane Duncan will be secretly ordering fish and chips on his campervan tour of"
    },
    {
        "url": "https://www.politico.eu/article/germany-mp-renate-kunast-win-case-meta-meme/",
        "title": "German MP wins court case against Meta over fake meme",
        "description": "Court obliges Facebook to do more against defamatory posts. A German court on Thursday ordered Meta to do more to combat defamatory posts, rejecting an appeal by the Facebook parent company after a lower court had ruled in favor of the plaintiff."
    },
    {
        "url": "https://www.sloughobserver.co.uk/news/24075137.slough-windsor-election-predictions-lot-change/",
        "title": "Slough and Windsor election predictions: Could a lot change?",
        "description": "The Conservative party face the prospect of large-scale losses in key battlegrounds across the UK if there was a general election"
    },
    {
        "url": "https://www.eurogamer.net/five-nights-at-freddys-game-leaks-creator-says-crack-on-and-chat-about-it",
        "title": "Five Nights at Freddy&#39;s game leaks, creator says crack on and chat about it",
        "description": "A new Five Nights at Freddy&#39;s game leaked online, but rather than getting upset about it, series creator Scott Cawthon"
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/news/24073691.enough-enough-backlash-grows-green-agenda/",
        "title": "&#39;Enough is enough&#39; as backlash grows against <b>green</b> agenda",
        "description": "The Scottish Government refutes claims that the First Minister and Green Minister canceled a scheduled launch event in the Highlands to evade"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/hastings-council-leader-voices-support-for-palestinian-town-twinning-4492971",
        "title": "Hastings council leader voices support for Palestinian town twinning",
        "description": "The new leader of Hastings Borough Council has voiced support for a campaign seeking to establish a “town twinning” with a community in Gaza."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/politics/reform-uk-wont-field-candidate-for-york-and-north-yorkshire-mayor-4492856",
        "title": "Reform UK won&#39;t field candidate for York and North Yorkshire mayor",
        "description": "Reform UK has confirmed that it will not field a candidate in May’s York and North Yorkshire’s mayoral election."
    },
    {
        "url": "https://www.camdennewjournal.co.uk/article/grooves-back-to-black-johnny-lloyd-the-last-dinner-party-billy-childish-the-sleeping-souls",
        "title": "Grooves: Back To Black; Johnny Lloyd; The Last Dinner <b>Party</b>; Billy Childish; The Sleeping Souls",
        "description": "• Rough Trade East has a pretty decent line-up of in-store appearances coming up – definitely worth taking a look: Brad Stank (Jan 26); Tom Odell (Jan 27); Future Islands (Jan 28); Gruff Rhys (Jan 29); Frank Carter &amp; The Rattlesnakes (Jan 30); His Lordship (Jan 31); The Last Dinner Party (Feb 3)."
    },
    {
        "url": "https://www.intellinews.com/czech-senate-fails-to-ratify-istanbul-convention-309481/",
        "title": "Czech Senate fails to ratify Istanbul Convention",
        "description": "The Czech Senate has failed to ratify the Istanbul Convention against violence against women and domestic violence.Only 34 of the 71 present"
    },
    {
        "url": "https://www.counterfire.org/article/antifascist-eruption-in-germany-can-it-advance/",
        "title": "Antifascist eruption in Germany – can it advance?",
        "description": "In the wake of mass protests against the fascist-like AfD, the radical left has opportunities to take the initiative, but it must not tail the establishment left, argues Kevin Ovendon Hundreds of thousands of protesters have taken to the streets across Germany for nearly two weeks against the extreme right Alternative for Germany party (AfD)."
    },
    {
        "url": "https://www.wilmslow.co.uk/news/article/23786/council-to-consider-policy-for-maintaining-green-spaces",
        "title": "Council to consider policy for maintaining <b>green</b> spaces",
        "description": "Cheshire East Council has updated its proposals for how green spaces will be maintained in future in response to feedback from the public. The environment and communities committee will be presented with a report which recommends they approve a policy that introduces a maintenance framework for Cheshire East&#39;s green spaces,"
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/jan/25/france-farmers-protests-europe-latest-updates-ursula-von-der-leyen?ref=upstract.com",
        "title": "Swedish PM agrees to meet Viktor Orbán as Hungary holds up Nato membership – Europe live",
        "description": "Ulf Kristersson says dialogue between countries is needed amid frustrations following Budapest’s failure to ratify Sweden’s Nato membership"
    },
    {
        "url": "https://www.hackneycitizen.co.uk/2024/01/25/gaza-hackney-council-calls-cessation-hostilities/",
        "title": "Gaza: Hackney Council calls for cessation of hostilities",
        "description": "Hackney Council has called for a “cessation of hostilities” in Gaza – with the ruling Labour group admitting that it had a “very, very challenging time” in deciding whether it should support a Green party motion on the issue. Councillors urged an “an immediate and sustainable humanitarian ceasefire on all sides” and for the release of all hostages."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/local-news/labour-unveils-candidate-looking-take-28508600",
        "title": "Labour unveils candidate looking to take Bedworth seat in General Election",
        "description": "Labour has unveiled the candidate who will be looking to take the Bedworth and North Warwickshire seat in the General Election. While no date for the election has yet to be revealed, one is set to be held this year."
    },
    {
        "url": "https://www.politico.eu/article/czech-industry-minister-eu-energy-chief-elections/",
        "title": "Czech industry minister vies to become EU’s next energy chief",
        "description": "Jozef Síkela previously acted as a key power broker during the EU’s energy crisis — but political hurdles stand between him and the energy job."
    },
    {
        "url": "https://www.politicshome.com/news/article/chris-skidmore-mayor-election-tracy-brabin-net-zero",
        "title": "Climate Protest MP Tells Voters To Use Locals To Shift Net Zero Plans",
        "description": "Former Conservative MP Chris Skidmore, who resigned over the government&#39;s plans to offer new oil and gas drilling licences, believes voters should"
    },
    {
        "url": "https://bylinetimes.com/2024/01/25/ireland-takes-uk-government-to-european-court-over-controversial-northern-ireland-legislation-in-little-noticed-move/",
        "title": "Ireland Takes UK Government to European Court Over Controversial Northern Ireland Legislation in Little-Noticed Move",
        "description": "A law granting immunity to perpetrators during The Troubles was passed despite overwhelming opposition from parties in Northern Ireland and the Irish Government"
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/londons-lime-bike-epidemic-badly-parked-pavements-b1134736.html",
        "title": "London&#39;s Lime bike epidemic: badly parked cycles are a scourge on the capital&#39;s streets",
        "description": "They have transformed the way we get about in our city but the sheer amount of discarded cycles strewn on our pavements has become an increasing menace. Robbie Griffiths reports"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13005263/Keir-Starmer-flounders-28bn-green-investment-plan-blames-Tories-salting-ground-Labours-spending-splurge-cutting-taxes-IFS-warns-burden-likely-rise-again.html",
        "title": "Keir Starmer flounders over £28bn <b>green</b> investment plan as he blames the Tories for &#39;salting the ground&#39; for Labour&#39;s spending splurge by cutting taxes… while IFS warns the ...",
        "description": "But the Tories hit back that Sir Keir was &#39;getting his excuses in early&#39; for hiked taxes, should he enter No10, to pay for his £28billion a year <b>green</b> investment plan. The political row came as a top thinktank warned, whichever <b>party</b> wins the general ..."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24072976.budget-cuts-will-cost-yorks-poorest-500-year-lib-dems-claim/",
        "title": "Budget cuts will cost York&#39;s poorest £500 a year, Lib Dems claim",
        "description": "On green bins, they say that under their proposals, York tenants on low income and in receipt of council tax support will get a 50 per cent discount on the charge for collecting green bins – so they’d only pay £23.25 a year."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-68093074.amp",
        "title": "DUP leader Sir Jeffrey Donaldson steps up with House of Commons speech",
        "description": "On Wednesday, that key moment arrived inside the Commons when Sir Jeffrey Donaldson &quot;stepped up&quot; and faced down his challengers both inside and outside his party. It was the moment when the Democratic Unionist Party (DUP) leader grabbed hold of the process with both hands and warned his opponents he won&#39;t be bullied."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1859664/Reform-UK-polling-Tories-record-high",
        "title": "Reform UK now just seven points behind the Tories as they explode forwards in polls",
        "description": "EXCLUSIVE: Richard Tice says his party is making further progress while the Tories&#39; backing falls off a cliff."
    },
    {
        "url": "https://www.huntspost.co.uk/news/national/24072417.labour-mp-apologises-saying-pm-blood-hands-israel-gaza-war/",
        "title": "Labour MP apologises after saying PM has ‘blood on hands’ over Israel-Gaza war",
        "description": "Tahir Ali, MP for Birmingham Hall <b>Green</b>, made the claim during Prime Minister’s Questions in the House of Commons. The Labour leadership quickly distanced itself from Mr Ali’s initial comments, with a <b>party</b> spokesman branding them “clearly ..."
    }
]