[
    {
        "url": "https://5pillarsuk.com/2024/02/12/labour-party-withdraws-support-for-rochdale-candidate-azhar-ali/",
        "title": "Labour <b>Party</b> withdraws support for Rochdale candidate Azhar Ali",
        "description": "had apologised after the Mail on Sunday reported he had said Israel “allowed” the Hamas attacks of October 7th in order to get a “<b>green</b> light to do whatever they bloody want.” But a Labour <b>party</b> spokesperson said on Monday night: “Following new ..."
    },
    {
        "url": "https://www.ft.com/content/73e64287-e84e-4933-ae88-12fcdcc5be35",
        "title": "Labour drops support for by-election candidate after Hamas-Israel claims",
        "description": "Party withdraws backing for Rochdale hopeful Azhar Ali after comments he made to newspaper over October 7 attack"
    },
    {
        "url": "https://www.lep.co.uk/news/politics/azhar-ali-labours-former-rochdale-by-election-candidate-criticised-by-preston-jewish-faith-leader-over-israel-attack-comments-4515431",
        "title": "Azhar Ali: Labour&#39;s former Rochdale by-election candidate criticised by Preston Jewish faith leader over Israel attack comments",
        "description": "A Jewish community leader in Preston says comments made by a senior Lancashire county councillor alleging Israel deliberately allowed the 7th October terrorist attack have given fuel to “demons” on social media spreading other unsubstantiated claims about the state."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rochdale-byelection-azhar-ali-mp-israel-gaza-b1138734.html",
        "title": "Starmer withdraws support for Rochdale by-election candidate after &#39;deeply offensive&#39; anti-Israel rant",
        "description": "Labour finally acts after spending much of Monday trying to defend Azhar Ali - with party suspending him pending an investigation"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865978/rishi-sunak-keir-stamer-labour-conservatives-general-election",
        "title": "Rishi Sunak issues warning over Labour as Brits urged not to fall for Keir Starmer&#39;s &#39;con&#39;",
        "description": "Rishi Sunak vowed to fix the social care system, slash NHS waiting lists and continue to ease the cost of living crisis if the Tories win the next general election."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-remarks/",
        "title": "Rochdale by-election: Labour withdraws support for candidate Azhar Ali after &#39;antisemitism&#39; remarks",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving an official complaint over his antisemitic remarks."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-row/",
        "title": "Rochdale by-election: Labour withdraws support for candidate Azhar Ali after &#39;antisemitism&#39; row",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving an official complaint over his antisemitic remarks."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/labour-withdraws-support-rochdale-candidate-by-election/",
        "title": "Labour withdraws support for Rochdale by-election candidate",
        "description": "Sir Keir Starmer had faced pressure to cut ties with Azhar Ali, who claimed Israel had allowed Oct 7 attacks to take place"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/labour-drop-rochdale-mp-candidate-28619786",
        "title": "Labour drop Rochdale MP candidate over Israel comments",
        "description": "that massacre that gives them the <b>green</b> light to do whatever they bloody want.&quot; Mr Ali also said Keir Starmer had &#39;lost the confidence&#39; of Labour MPs over the <b>party</b>&#39;s initial reluctance to back a ceasefire, according the paper. It comes after Shadow ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/breaking-labour-ditches-rochdale-election-32110350",
        "title": "Labour ditches Rochdale by-election candidate Azhar Ali over offensive Israel claims",
        "description": "Azhar Ali had been picked as Labour&#39;s candidate for the Rochdale by-election on February 29, but has been dumped over his claim Israel allowed the October 7 attacks"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13063201/australian-woman-love-paralyzed-man-haters-green-card.html",
        "title": "Able-bodied Australian woman who fell in love with a paralyzed man slams trolls who accuse her of dating him for a <b>green</b> card or &#39;easy money&#39;",
        "description": "Rocky, from Michigan, became paralyzed after breaking his neck at 19 while wrestling with one of his friends. Although the incident transformed his life, it helped him meet the love of his life, Jacquelyn."
    },
    {
        "url": "https://news.sky.com/story/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-row-13070338",
        "title": "Rochdale by-election: Labour received &#39;new information&#39; about Azhar Ali before withdrawing support",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving &quot;new information&quot; about comments he is alleged to have made."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/12/labour-withdraws-support-for-rochdale-candidate-after-israel-gaza-remarks?ref=mc.news",
        "title": "Labour withdraws support for Rochdale candidate after Israel-Gaza remarks",
        "description": "Party no longer campaigning for Azhar Ali, who suggested Israel had allowed 7 October attack to happen"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-gb-news-today-updates-b2494979.html",
        "title": "Rishi Sunak GB News – live: Rwanda scheme is ‘right thing to do’ insists Prime Minister in live TV grilling",
        "description": "Rishi Sunak is set to be grilled by the UK public as pressure continues to mount on the prime minister in one of the most challenging weeks of his premiership. Mr Sunak is facing questions from undecided and swing voters in County Durham during the People&#39;s Forum event, which kicks off at 8pm on GB News."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13075461/tv-choice-awards-2024-strictly-ellie-leach-bobby-brazier-romance.html",
        "title": "TV Choice Awards 2024: Strictly&#39;s Ellie Leach puts on a leggy display in olive <b>green</b> mini dress with a feathered trim as she arrives separately from Bobby Brazier amid romance ...",
        "description": "Ellie Leach showed off her glamorous sense of style as she arrived separately from rumoured boyfriend Bobby Brazier at the TV Choice Awards at the London Hilton on Park Lane on Monday."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/labour-withdraws-support-azhar-ali-rochdale_uk_65ca74f4e4b0fb721d62356c",
        "title": "Labour Withdraws Support For Rochdale By-Election Candidate After Anti-Israel Comments",
        "description": "The Labour Party has withdrawn its support for Rochdale by-election candidate Azhar Ali after a backlash over his remarks about Israel, a party spokesperson has said. It comes after The Mail on Sunday reported the councillor allegedly said Israel deliberately allowed 1,400 people to be killed on its own soil on October 7."
    },
    {
        "url": "https://news.sky.com/story/rochdale-by-election-formal-complaint-filed-against-labour-candidate-after-antisemitic-remarks-13070291",
        "title": "Rochdale by-election: Formal complaint filed against Labour candidate after &#39;antisemitic&#39; remarks",
        "description": "Campaign group Labour Against Antisemitism is demanding that Councillor Azhar Ali be suspended as a party member after he suggested Israel let the 7 October Hamas attack go ahead so it could invade Gaza."
    },
    {
        "url": "https://www.devonlive.com/news/celebs-tv/bbc-strictly-come-dancing-stars-9095402",
        "title": "BBC Strictly Come Dancing star leaves wrap <b>party</b> in tears after &#39;breaking down&#39; in co-star&#39;s arms",
        "description": "Strictly Come Dancing stars were seen leaving the wrap party in London on Sunday night after the live tour ended at the O2 Arena, with some looking more emotional than others"
    },
    {
        "url": "https://www.lbc.co.uk/news/labour-withdraws-support-for-rochdale-candidate-after-israel-conspiracy-theory-r/",
        "title": "Labour withdraws support for Rochdale candidate after Israel conspiracy theory remarks",
        "description": "Labour has withdrawn its support for Rochdale by-election candidate Azhar Ali after criticism of remarks about Israel, a party spokesperson said."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-sussex-68276324",
        "title": "Hastings Borough Council is not going bankrupt, new leader says",
        "description": "Eight Labour councillors, including the council leader and deputy leader, quit the <b>party</b> in December and formed a coalition as independents with the <b>Green Party</b>. It came months after HBC was told it faced imminent effective bankruptcy. The cabinet ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24115178.slashing-public-investment-downturn-worst-thing/",
        "title": "Slashing public investment during a downturn is the worst thing to do",
        "description": "ENGLISH Labour’s pledge to spend £28 billion – really £20 billion, since it included £8 billion already spent – is gone in a poof,"
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/12/natural-gas-greenwashing-democrats?ref=upstract.com",
        "title": "Certified natural gas is ‘dangerous greenwashing scheme’, Democrats say",
        "description": "Group of Democratic senators led by Ed Markey call for crackdown on certified natural gas in letter to US federal regulators"
    },
    {
        "url": "https://www.politico.eu/article/austria-looks-at-early-exit-from-russian-gas-deal-as-reliance-on-moscow-deepens/",
        "title": "Austria looks at early exit from Russian gas deal as reliance on Moscow deepens",
        "description": "Austria has faced broader criticism for maintaining close commercial ties with Russia. In December, Vienna threatened to torpedo Brussels’ 12th sanctions package after Ukraine labeled Austrian banking group Raiffeisen a “war sponsor” for refusing to exit Russia."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/rochdale-george-galloway-labour-byelection-b2494939.html",
        "title": "What is happening in the Rochdale by-election?",
        "description": "With Labour’s candidate falling foul of conspiracy theories, the Rochdale vote may not be a sure thing for Keir Starmer, with trouble ahead even if they were to win. What’s more, a controversial but familiar political player has stepped in to cause even more trouble."
    },
    {
        "url": "https://socialistworker.co.uk/news/disaster-looms-for-tories-and-labour-in-rochdale/",
        "title": "Disaster looms for Tories and Labour in Rochdale",
        "description": "Labour’s campaign for the Rochdale by-election has collapsed after its candidate managed to enrage both Zionists and pro-Palestine voters. Azhar Ali was already facing potential defeat at the election set for 29 February. Thousands of people in the constituency are enraged by the Labour Party’s support for Israel in Gaza."
    },
    {
        "url": "https://www.hvnplus.co.uk/features/uk-politicians-warned-against-backtracking-on-low-carbon-heat-12-02-2024/",
        "title": "Heating and Ventilation News",
        "description": "The UK’s two largest political parties are coming under fire over their long-term policy commitments for incentivising lower carbon heat. Both the"
    },
    {
        "url": "https://www.cotswoldjournal.co.uk/news/24115066.green-party-announce-candidate-north-cotswolds-seat/",
        "title": "<b>Green Party</b> announce candidate for North Cotswolds seat",
        "description": "The Green Party has selected Cllr Chloe Turner - who currently represents Minchinhampton on both Stroud District Council and Gloucestershire County Council - as its parliamentary candidate for the new North Cotswolds constituency seat."
    },
    {
        "url": "https://www.hvnplus.co.uk/news/uk-politicians-warned-against-backtracking-on-low-carbon-heat-12-02-2024/",
        "title": "UK politicians warned against ‘backtracking’ on low carbon heat",
        "description": "The UK’s two largest political parties are coming under fire over their long-term policy commitments for incentivising lower carbon heat. Both the"
    },
    {
        "url": "https://www.thenational.scot/news/24115058.anas-sarwar-holyrood-too-focused-social-justice-not-economy/",
        "title": "Anas Sarwar: Holyrood &#39;too focused on social justice, not economy&#39;",
        "description": "ANAS Sarwar has been criticised after he suggested the Scottish Parliament had focused too much on social justice and not the economy"
    },
    {
        "url": "https://uk.news.yahoo.com/keir-starmer-stands-conspiracy-theory-164601031.html",
        "title": "Keir Starmer stands by ‘conspiracy theory’ candidate in Labour antisemitism row",
        "description": "Shadow minister said Azhar Ali ‘fell for an online conspiracy theory’ when he suggested Israel had allowed the October 7 Hamas attack to happen"
    },
    {
        "url": "https://www.middleeasteye.net/news/war-gaza-apartheid-campaigner-andrew-feinstein-challenge-starmer-upcoming-election",
        "title": "UK: Anti-apartheid campaigner Andrew Feinstein set to challenge Starmer in upcoming elections",
        "description": "The former Nelson Mandela advisor is among a wave of independents seeking to unseat Labour candidates who failed to vote for a ceasefire in Gaza"
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24114699.new-nato-member-finland-elects-president-set-keep-hard-line-russia/",
        "title": "New Nato member Finland elects president set to keep up hard line on Russia",
        "description": "The final tally from Sunday’s runoff shows Mr Stubb, of the centre-right National Coalition <b>Party</b>, had 51.6% of the votes, while independent candidate and former foreign minister Pekka Haavisto from the <b>green</b> left got 48.4% of the votes. The two were the ..."
    },
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/02/12/tea-drinkers-warned-over-supply-issues-facing-supermarkets/",
        "title": "Tea drinkers warned over ‘supply issues’ facing supermarkets",
        "description": "British shoppers have been warned they could struggle to find tea on the shelves due to “supply issues” facing supermarkets. Sainsbury’s has cautioned shoppers in some stores that there are “nationwide” problems which could impact the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/when-next-byelections-dates-labour-conservatives-mps-b1107076.html",
        "title": "When are the next by-elections? Labour stands by Rochdale candidate after &#39;offensive&#39; comments about Israel",
        "description": "Mr Al apologises unreservedly to the Jewish community after saying Israel had ‘allowed’ the deadly Hamas attack on October 7"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68272820?at_medium=RSS",
        "title": "Azhar Ali: Labour defends standing by Rochdale by-election candidate",
        "description": "Mr Thomas-Symonds confirmed Labour would continue to campaign for Mr Ali in Rochdale, who he said had &quot;fallen for a conspiracy theory&quot; but that there was a need to &quot;do a tremendous amount of work to rebuild trust with the Jewish community&quot;. He pointed to comments from former MP Louise Ellman, who has backed Mr Ali."
    },
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/itv-strictly-come-dancing-stars-32108399?int_source=amp_continue_reading&int_medium=amp&int_campaign=continue_reading_button",
        "title": "ITV Strictly Come Dancing stars let loose at boozy <b>party</b> as Annabel Croft in tears as tour ends",
        "description": "Strictly Come Dancing stars were in high spirits as they celebrated the end of the live tour at the wrap party in London on Sunday night"
    },
    {
        "url": "https://www.expressandstar.com/news/world-news/2024/02/12/new-nato-member-finland-elects-president-set-to-keep-up-hard-line-on-russia/",
        "title": "New NATO member Finland elects president set to keep up hard line on Russia",
        "description": "The country’s head of state commands the military – a key role after Finland joined NATO in April 2023 in the aftermath of Russia’s attack on Ukraine."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1865880/labour-rochdale-anti-israel",
        "title": "Labour has shown it will prioritise political gain over fighting Israel haters",
        "description": "On hearing this wild conspiracy theory, Starmer should have booted Ali into political oblivion - scratching him from the ballot paper at the February 29 by-election and from the Labour <b>Party</b> with immediate effect. Starmer, the man who would be PM ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/royal-society-arts-boycotted-internationally-renowned-speakers-amid-staff-pay-dispute",
        "title": "Royal Society of Arts boycotted by internationally renowned speakers amid staff pay dispute",
        "description": "INTERNATIONALLY renowned speakers are pulling out of engagements with the Royal Society of Arts (RSA) in support of a boycott called by staff in a pay dispute. Members of the Independent Workers of Great Britain (IWGB) employed by the RSA launched a boycott of the institution today."
    },
    {
        "url": "https://westbridgfordwire.com/green-party-candidate-for-east-midlands-mayor-announced/",
        "title": "<b>Green Party</b> candidate for East Midlands mayor announced",
        "description": "The <b>Green Party</b> has selected its candidate to run in the East Midlands mayoral race in May. Frank Adlington-Stringer, who was born in Chesterfield and is North East Derbyshire’s first-ever <b>Green Party</b> councillor, has promised he will not be whipped like ..."
    }
]