[
    {
        "url": "https://www.chron.com/culture/article/houston-roller-rink-discovery-green-18658371.php",
        "title": "Houston&#39;s only outdoor roller rink reopens at Discovery <b>Green</b>",
        "description": "Houston&#39;s only outdoor roller rink, The Rink at Discovery Green, will reopen on Feb. 9 with a party featuring skate instructors, lessons and music by DJ Yung Chris."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030",
        "title": "‘Shit politics’ – Starmer allies urge him to get <b>party</b> ready for government",
        "description": "Business leaders sympathetic to Labour are pushing for a change to the party’s investment rules which would make it easier to spend money on projects which will boost long-term growth without breaking the Treasury’s fiscal rules."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/ed-miliband-borrowed-time-labour-28bn-green-pledge-u-turn/",
        "title": "Ed Miliband ‘on borrowed time’ after Labour’s £28bn <b>green</b> pledge climbdown",
        "description": "Shadow climate secretary angers backbenchers and activists by backing Sir Keir Starmer’s climbdown on flagship policy"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68251300",
        "title": "Ed Miliband: I didn&#39;t think of quitting over Labour&#39;s <b>green</b> U-turn",
        "description": "Ed Miliband has insisted he did not consider quitting over Labour&#39;s decision to junk its pledge to spend £28bn a year on green projects. Labour&#39;s shadow net zero secretary, a key backer of the policy, said the party&#39;s plans still met his criteria of &quot;moving the dial&quot; on climate change."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066809/Ed-Miliband-insists-DIDNT-consider-quitting-Labours-green-U-turn-Keir-Starmer-Rachel-Reeves-junk-28bn-spending-plans-plunge-party-chaos.html",
        "title": "Ed Miliband insists he DIDN&#39;T consider quitting over Labour&#39;s <b>green</b> U-turn after Keir Starmer and Rachel Reeves junk £28bn spending plans to plunge <b>party</b> into chaos",
        "description": "Ed Miliband tonight insisted he didn&#39;t consider quitting over Labour&#39;s <b>green</b> U-turn after the <b>party</b> junked its £28billion a year spending plans. The shadow climate secretary was thought to be on resignation watch as Labour leader Sir Keir Starmer and ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/c101qd4952vo",
        "title": "Starmer pledges West Midlands gigafactory",
        "description": "Sir Keir Starmer said Labour would build a gigafactory in the West Midlands, if the party wins the next general election. Speaking on a visit to Coventry a day after insisting he had no choice but to ditch Labour&#39;s £28bn-a-year green investment pledge, he said one of eight new gigafactories in his scaled back proposals would be in the region."
    },
    {
        "url": "https://www.scotsman.com/news/politics/scottish-budgetlocal-authorities-call-for-flexibility-to-hike-council-tax-by-up-to-5-per-cent-4513090",
        "title": "Scottish BudgetLocal authorities call for ‘flexibility’ to hike council tax by up to 5 per cent",
        "description": "Local authorities in Scotland have asked for the flexibility to hike council tax by up to 5 per cent while still receiving cash intended to fund a freeze. Council leaders have demanded an urgent meeting with Shona Robison, the deputy first minister and finance secretary, amid a growing row over the issue."
    },
    {
        "url": "https://morningstaronline.co.uk/article/former-green-deputy-leader-wins-discrimination-case-against-gender-critical-beliefs",
        "title": "Former <b>Green</b> deputy leader wins discrimination case over his gender-critical beliefs",
        "description": "THE Green Party lost a legal battle against its former deputy leader today over its discrimination against his gender-critical beliefs. Dr Shahrar Ali launched the action against the party, the first of its kind, after being forced out of his role as policing and domestic safety spokesman in February 2022."
    },
    {
        "url": "https://inews.co.uk/news/politics/rachel-reeves-labour-green-pledge-2899692",
        "title": "Rachel Reeves won Shadow Cabinet ‘war’ on £28bn U-turn, insiders say",
        "description": "Shadow Chancellor Rachel Reeves won an internal battle at the top of Labour that resulted in Sir Keir Starmer deciding to U-turn on a pledge to spend £28bn on green investment."
    },
    {
        "url": "https://morningstaronline.co.uk/article/pressure-growing-starmer-scrap-two-child-limit",
        "title": "Pressure growing on Sir Keir to scrap two-child limit under Labour government",
        "description": "PRESSURE is growing on Sir Keir Starmer to commit to scrapping the two-child limit under a Labour government amid ongoing criticism of its recent green pledge U-turn."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/coventry-news/keir-starmer-visits-coventry-labour-28605116",
        "title": "Keir Starmer visits Coventry as Labour say they&#39;re &#39;still committed&#39; to funding gigafactory in the West Midlands",
        "description": "The West Midlands &quot;will get a gigafactory&quot; if Labour wins power, the shadow chancellor has claimed. Funding pledged for the scheme by the party last year has not been hit by it ditching a flagship £28bn-a-year investment target for green projects, Rachel Reeves said today (9 February.)"
    },
    {
        "url": "https://www.gg2.net/india-awards-top-honour-to-former-prime-ministers-green-revolution-pioneer/",
        "title": "India awards top honour to former prime ministers, <b>green</b> revolution pioneer",
        "description": "THE decision to award India’s Bharat Ratna to former prime ministers P V Narasimha Rao and Charan Singh and green revolution pioneer M S Swaminathan has taken"
    },
    {
        "url": "https://www.thenational.scot/news/24110560.keir-starmers-4-7-billion-pledge-matches-scotland-spends-alone/",
        "title": "Keir Starmer&#39;s £4.7 billion pledge &#39;matches what Scotland spends alone&#39;",
        "description": "KEIR Starmer has been accused of a “total lack of ambition” after he slashed a pledge of £28 billion in green investment each year to"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/labour-green-pledge-policy-starmer-reeves-b2493704.html",
        "title": "After the great U-turn, what exactly is Labour’s <b>green</b> policy now?",
        "description": "Keir Starmer has dropped a £28bn pledge that no one really understood. So, asks John Rentoul, is the party’s net zero plan any clearer?"
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24109496.john-glen-mp-i-done-best-will-continue-so/",
        "title": "John Glen MP: &#39;I have done my best and will continue to do so&#39;",
        "description": "Mr Glen, who has been Salisbury&#39;s MP for nearly 14 years, said: &quot;I think I have a deep understanding of Salisbury and the surrounding area, its people and the opportunities and challenges that are ongoing."
    },
    {
        "url": "https://www.telegraph.co.uk/food-and-drink/features/what-your-choice-of-crisps-says-about-you/",
        "title": "What your choice of crisps says about you",
        "description": "If these are served at a <b>party</b>, small-talk is unnecessary ... arguing over the relative merits and demerits of Sir Keir Starmer ditching Labour’s £28bn <b>green</b> pledge over pudding. It’ll only end when someone accidentally knocks over the Perelló ..."
    },
    {
        "url": "https://www.thenational.scot/news/24110560.keir-starmers-4-7-billion-pledge-exactly-scotland-spends-alone/",
        "title": "Keir Starmer&#39;s £4.7 billion pledge &#39;exactly Scotland spends alone&#39;",
        "description": "Ross Greer, the <b>party</b>’s finance spokesperson at Holyrood ... The Labour leader has argued that his <b>green</b> investment U-turn was about being “straight” with voters. READ MORE: Top ranking Labour activist: &#39;I don&#39;t believe a word Keir Starmer says ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rachel-reeves-labour-ed-miliband-jonathan-reynolds-b1138206.html",
        "title": "Starmer: Ditching <b>green</b> spending pledge was about ‘being straight’ with voters",
        "description": "Environmental groups, trade union allies and energy industry figures have all expressed disappointment at the U-turn."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-ed-miliband-labour-britain-andrew-matthews-b1138271.html",
        "title": "Ed Miliband says he never considered quitting over axed £28bn <b>green</b> pledge",
        "description": "Ed Miliband has insisted he did not consider resigning over Labour’s junking of its pledge to spend £28 billion a year on green projects. The shadow climate secretary, seen as a key proponent of the policy, said the party’s plans still meet his criteria of moving the dial on climate."
    },
    {
        "url": "https://www.thegrocer.co.uk/politics/what-will-a-labour-government-mean-for-food-and-farming/688113.article",
        "title": "What will a Labour government mean for food and farming?",
        "description": "With the general election drawing near, there&#39;s a blossoming romance between Labour and big business. But where does it stand on the crucial issues affecting food retail and farming?"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865151/keir-starmer-labour-party-by-election-result",
        "title": "Keir Starmer told ‘no Labour seat is safe’ as Tories make gain in council by-election",
        "description": "The loss comes as Labour U-turns on an election pledge to spend £28 billion a year as part of the party&#39;s Green Prosperity Plan."
    },
    {
        "url": "https://www.politico.eu/article/oil-gas-company-lash-labour-party-windfall-tax-plan/",
        "title": "Oil and gas companies lash out at Labour’s new windfall tax plans",
        "description": "To help pay for its new pledge of a £23.7 billion uplift in <b>green</b> spending over five years, the <b>party</b> said it would increase the rate of the government’s existing windfall tax from 75 to 78 percent and would extend the levy by a year, to 2029."
    },
    {
        "url": "https://www.politico.eu/article/sweden-democrats-threaten-to-quit-right-wing-eu-group-erc-if-orban-joins/",
        "title": "Sweden Democrats threaten to quit right-wing EU group if Orbán joins",
        "description": "“It’s possible [that Orbán joins] but definitely his <b>party</b> has to change [its] position on Russia ... EU lawmaker Carlo Fidanza said that the next step is for Orbán to <b>green</b> light Sweden’s bid to join NATO. “We don’t want to lose anyone ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/09/labour-bombproof-manifesto-hits-first-deadline-with-green-spending-cuts",
        "title": "Keir Starmer’s ‘bombproof’ manifesto shows Labour is ready for an election",
        "description": "Labour’s mixed messages on £28bn <b>green</b> pledge put it in worst of all worlds Those meetings will happen later in the year and possibly into government, <b>party</b> officials say, and are likely to prove one of Gray’s most important contributions to the <b>party</b> ..."
    },
    {
        "url": "https://www.ft.com/content/f156f951-cad6-4b48-ad83-c734140766cd",
        "title": "Transcript: Will Labour’s <b>green</b> U-turn weaken Starmer?",
        "description": "Miranda <b>Green</b> And I guess, Jim, the only question is just wouldn’t the logical thing have been to do to wait till the Budget, which is in a matter of weeks? And that’d be the point to say, well, actually, look at the mess that the Tory <b>party</b> is leaving ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/09/labour-u-turn-keir-starmer-rachel-reeves-rishi-sunak-tory-conservatives-latest-politics-news-updates?page=with:block-65c60be88f08ddaeb791bc93",
        "title": "Kemi Badenoch says death threats have ‘intensified’ since publication of Nadine Dorries book – as it happened",
        "description": "Keir Starmer said he believes the British public “appreciate” Labour being “straight” about its plans for the economy, after the <b>party</b> announced a major U-turn on its <b>green</b> spending pledge. Rishi Sunak again refused to apologise for his transgender ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/campaigners-say-urgent-action-needed-28604729",
        "title": "Campaigners say &#39;urgent action&#39; needed over British Gas, EDF, OVO, Octopus bills",
        "description": "Campaigners have called for &quot;urgent action&quot; over rising British Gas, OVO, EDF, Octopus energy bills after a Labour <b>Party</b> U-turn as millions risk poverty ... Labour has cut its <b>green</b> investment plans by half, ending weeks of speculation."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tory-mp-laura-trott-skewered-32082113.amp",
        "title": "Tory MP Laura Trott skewered over <b>party</b>&#39;s U-turns in excruciating 60-second take down",
        "description": "Chief Secretary to the Treasury Laura Trott went on BBC Radio 4 to gloat about Keir Starmer&#39;s change to his <b>green</b> investment plan, but faced a bruising grilling from Evan Davies Laura Trott has become one of the Government&#39;s most high profile ministers ..."
    }
]