[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "Labour vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://uk.movies.yahoo.com/sofia-richies-latest-look-put-191116927.html",
        "title": "Sofia Richie&#39;s Latest Look Put a Maternity Twist on Latte Dressing",
        "description": "She&#39;s expecting her first child with husband Elliot Grainge."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/local-news/destroyed-countryside-hs2-pictures-spark-28560771",
        "title": "&#39;Destroyed countryside&#39; HS2 pictures spark fierce debate amid local building work",
        "description": "The sight of building hubs replacing green spaces in Warwickshire has stirred emotion on both sides of the debate"
    },
    {
        "url": "https://www.politico.eu/article/greens-try-to-flip-the-script-blame-conservatives-not-the-green-deal/",
        "title": "Greens try to flip the script: Blame conservatives, not the <b>Green</b> Deal",
        "description": "The farmers are protesting decades of conservative farming policy,’ one official argued. That case will be a hard sell amid a cacophony of green-bashing."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "Labour ditches radical reforms as it prepares ‘bombproof’ election manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13041595/Robbie-Williams-wife-Ayda-Field-dress-Mr-Mrs-Potato-Head-throw-son-Beau-Toy-Story-themed-party-fourth-birthday.html",
        "title": "Robbie Williams and wife Ayda Field dress up as Mr and Mrs Potato Head as they throw their son Beau a Toy Story themed <b>party</b> for his fourth birthday",
        "description": "Robbie Williams and his wife Ayda dressed up as Mr and Potato Head as they threw their son Beau a &#39;Toy Story&#39; themed party for his fourth birthday on Saturday, in pictures shared on Instagram."
    },
    {
        "url": "https://cherwell.org/2024/02/03/a-crash-course-in-british-politics-how-elections-work-week-1/",
        "title": "A crash course in British politics: How elections work (Week 1)",
        "description": "This week’s article will explain how British elections work, and hopefully will answer all your related questions."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/othersports/article-13041735/RIATH-AL-SAMARRAI-Olympic-sport-Russian-dopes-invited.html",
        "title": "RIATH AL-SAMARRAI: Olympic sport is worthless if you cannot believe your eyes - so why do Russian dopes keep being invited to the <b>party</b>?",
        "description": "Dogs seem to have a mixed reputation in Russia. I know this because it came up rather a lot during a surreal time in my life and returned to mind this week."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion <b>Green</b> Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://inews.co.uk/news/michelle-oneill-first-nationalist-leader-stormont-2888356",
        "title": "‘Historic day’ as Michelle O’Neill becomes first nationalist leader of Stormont",
        "description": "Northern Ireland ‘s Stormont Assembly returned on Saturday after a two-year hiatus with Sinn Fein vice president Michelle O’Neill becoming the country’s first nationalist first minister."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68192206",
        "title": "Laura Kuenssberg: When will politicians make their minds up on key plans?",
        "description": "No wonder voters are unconvinced when politicians may seem unclear on economic plans, writes Laura Kuenssberg."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/03/south-carolina-primary-democrats-joe-biden",
        "title": "Biden poised for boost as Democratic primaries begin in South Carolina",
        "description": "State holds party’s first official primary under new schedule, with president polling at 70%"
    },
    {
        "url": "https://uk.news.yahoo.com/greens-congress-choose-veteran-duo-211112454.html",
        "title": "Greens congress choose veteran duo to take them to EU elections",
        "description": "The European Green Party on Saturday chose two of its most well-known EU lawmakers to take them to the European Parliament elections in June. German MEP Terry Reintke and Dutch MEP Bas Eickhout were both backed by Green party congress delegates in Lyon — getting 55 percent and 57 percent of the votes,"
    },
    {
        "url": "https://www.politico.eu/article/michelle-oneill-sinn-fein-northern-ireland-protestant-stormont/",
        "title": "In Northern Ireland, ‘a Protestant state’ finally has a Catholic leader",
        "description": "Sinn Féin’s Michelle O’Neill vows to be ‘a first minister for all’ in a divided society where stable government has been a casualty of Brexit."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24095447.business-resumes-northern-ireland-assembly-historic-restoration-day/",
        "title": "Business resumes at Northern Ireland Assembly on historic restoration day",
        "description": "Business at the Northern Ireland Assembly has reconvened on a day when Sinn Fein’s Michelle O’Neill is set to become the first nationalist first minister following a two-year political collapse."
    },
    {
        "url": "https://uk.style.yahoo.com/joe-rogan-shares-15-hour-133224498.html",
        "title": "Joe Rogan Shares 15-Hour <b>Green</b> Room Spotify Playlist, an Idea Inspired by Dave Chappelle, to Celebrate Podcast Deal Renewal",
        "description": "Rogan started the <b>Green</b> Room playlist “when I realized it’s more fun to turn the <b>green</b> room into a <b>party</b>” — a tactic he copied from Dave Chappelle. “He would always come to the Comedy Store and bring a big Bluetooth speaker, and Dave has dope ..."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/business-resumes-at-northern-ireland-assembly-on-historic-restoration-day-99218/",
        "title": "Business resumes at Northern Ireland Assembly on historic restoration day",
        "description": "Business at the Northern Ireland Assembly has reconvened on a day when Sinn Fein’s Michelle O’Neill is set to become the first nationalist first minister following a two-year political collapse. MLAs took their seats in the Assembly chamber at Parliament Buildings,"
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/national/24095190.historic-day-devolved-government-returns-northern-ireland/",
        "title": "‘Historic day’ as devolved government returns in Northern Ireland",
        "description": "A “historic day” has been hailed as devolved government is expected to return in Northern Ireland. Sinn Fein vice president Michelle O’Neill is set to become the first nationalist first minister following a two-year political collapse."
    }
]