[
    {
        "url": "https://inews.co.uk/news/labour-drop-green-28bn-pledge-starmer-2895718?ico=related_article_inline",
        "title": "Labour to confirm dropping £28bn a year <b>green</b> investment pledge",
        "description": "Labour will confirm it is dropping a pledge to spend £28bn a year on green investment if it enters government, following weeks of confusion about the flagship policy. Sir Keir Starmer had originally promised in 2021 to invest £28bn annually until 2030 on green projects if Labour came to power."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rachel-reeves-keir-starmer-laura-trott-gdp-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year <b>green</b> pledge’",
        "description": "An announcement on the <b>party</b>’s flagship <b>green</b> prosperity plan is expected to be made on Thursday. Sir Keir Starmer is due to confirm that the pledge is being scaled back due to the changed economic landscape since it was first unveiled in 2021 ..."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155094/severe-weather-alert-for-snow-across-northern-and-central-england-as-national-highways-urges-road-users-to-%E2%80%98be-prepared%E2%80%99",
        "title": "Severe weather alert for snow across northern and central England as National Highways urges road users to ‘be prepared’",
        "description": "Further information is available on National Highway&#39;s travelling in winter web page. 5Rochdale by-election: <b>Green Party</b> candidate no longer endorsed by <b>party</b> just weeks before voters go... To contact the Rochdale Online news desk, email news@ ..."
    },
    {
        "url": "https://www.hollywoodreporter.com/news/music-news/clive-davis-2024-grammys-party-class-photo-1235817692/",
        "title": "Clive Davis Grammy <b>Party</b> Class Photo: Where Public Enemy, <b>Green</b> Day, Tom Hanks and Andra Day Mingle",
        "description": "Before the music legend’s pre-Grammy gala, performers and presenters including Victoria Monét, Dionne Warwick, Jelly Roll, Rita Wilson, the Isley Brothers, Maluma and Lainey Wilson posed for a legendary group shot,"
    },
    {
        "url": "https://www.sandiegouniontribune.com/news/nation-world/story/2024-02-07/broken-congress-it-cant-fix-the-border-fund-allies-or-impeach-mayorkas-as-as-gop-revolts",
        "title": "Broken Congress: It can’t fix the border, fund allies or impeach Mayorkas as as GOP revolts.",
        "description": "Al <b>Green</b> of Texas, surprised colleagues by leaving his hospital ... Republicans shelved the border package, filibustering, on a <b>party</b>-line vote Wednesday, though senators did begin discussing a smaller $95 billion aid package for Ukraine, Israel, Taiwan ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rachel-reeves-labour-keir-starmer-gdp-treasury-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year <b>green</b> pledge’",
        "description": "An announcement on the party’s flagship green prosperity plan is expected to be made on Thursday. Sir Keir Starmer is due to confirm that the pledge is being scaled back due to the changed economic landscape since it was first unveiled in 2021, according to multiple reports."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-republican-faceplants-not-funny-210920828.html",
        "title": "Voices: The Republican faceplants are not (as) funny anymore",
        "description": "A series of GOP belly flops might seem hilarious and an example of karma ultimately coming back for McConnell and Johnson. But they spell bad news for the ability to govern"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-sunak-ends-disaster-of-a-day-with-invitation-to-family-of-brianna-ghey-12593360",
        "title": "Politics latest: Sunak ends &#39;disaster&#39; of a day with invitation to family of Brianna Ghey",
        "description": "In joint third are the Lib Dems and Reform on 9.5%. The <b>Green Party</b> stands at 5.5%, and the SNP on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. As the next general election draws closer ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68232133",
        "title": "Labour ditches £28bn <b>green</b> investment pledge",
        "description": "Labour is ditching its policy of spending £28bn a year on its green investment plan in a major U-turn, sources have told the BBC. An official announcement will be made on Thursday. The sources insist the party&#39;s Green Prosperity Plan, which includes creating a publicly-owned green power firm, is not being dropped altogether."
    },
    {
        "url": "https://www.ft.com/content/abb231af-bb95-4264-9209-3864fac0e464",
        "title": "Labour set to ditch target to spend £28bn a year on <b>green</b> investment",
        "description": "Starmer is poised to use a set piece event to drop the £28bn figure from Labour’s “green prosperity plan”, blaming the worsening public finances under the Conservative government. “There will be an announcement tomorrow,” said a Labour spokesperson."
    },
    {
        "url": "https://www.thesun.co.uk/news/25793766/electric-vehicles-truth-tackle-climate-change/",
        "title": "<b>Green</b> tech like EVs turns out to be a very uncunning plan… we need the truth to tackle climate change",
        "description": "SALES of electric cars are falling sharply. Monthly forecourt purchases of these vehicles, which will save the world from burning to bits, fell 17 per cent at the end of last year when compared"
    },
    {
        "url": "https://news.sky.com/story/labour-to-scale-back-16328bn-green-prosperity-plan-sky-news-understands-13066410",
        "title": "Labour to scale back £28bn <b>green</b> prosperity plan, Sky News understands",
        "description": "Labour will announce tomorrow that it is scaling back its flagship green prosperity plan, Sky News understands."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/dup-fails-to-block-irish-language-sign-in-south-belfast-after-residents-split-over-proposal/a628906739.html",
        "title": "DUP fails to block Irish language sign in south Belfast after residents split over proposal",
        "description": "The DUP has failed to block an Irish language street sign being approved in south Belfast, after a consultation showed a 50-50 split between residents over the new sign."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/keir-starmers-labour-abandon-28-billion-green-investment/",
        "title": "Keir Starmer set to abandon £28 billion <b>green</b> investment pledge",
        "description": "Sir Keir Starmer is set to formally abandon his £28 billion green investment pledge on Thursday, arguing that Labour can no longer promise to borrow that amount a year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13057893/republicans-frustration-johnson-two-failed-bills.html",
        "title": "The Republican circus returns to the House three months after McCarthy was ousted: Inside the frustration of GOP members demanding to know why TWO bills failed and already ...",
        "description": "Republican frustration is breaking out into the open after two major pieces of legislation failed Tuesday night, with some members demanding GOP leadership &#39;explain&#39; their thought process."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/belfast-news/dup-fails-block-irish-signs-28589307",
        "title": "DUP fails to block Irish signs for South Belfast street where response showed a 50/50 split",
        "description": "The DUP have failed to block an Irish language street sign being approved in South Belfast, after a consultation showed as many residents objected to the new sign as did support it."
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/politics/fine-gael-mep-maria-walsh-32069010",
        "title": "Fine Gael MEP Maria Walsh criticises &#39;male, pale and stale&#39; politics",
        "description": "Fine Gael MEP Maria Walsh has said the European Parliament can be “male, pale and stale” following Fianna Fáil’s decision to run three male candidates in their mid-50s."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24104468.darlington-council-responds-government-funding-settlement/",
        "title": "Darlington Council responds to government funding settlement",
        "description": "Yes, we know residents are struggling, but if we don’t raise council tax we face further cuts.” <b>Green Party</b> leader Cllr Matthew Snedker said mystery surrounds how the council will fare financially in the future and it could be determined by a ‘toss ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/07/fluoride-added-drinking-water-teeth-dental-health/?n=@",
        "title": "Fluoride to be added to drinking water under new legal powers",
        "description": "Move is part of plans to improve the nation’s teeth, however campaigners raise concerns about possible negative health effects"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864329/Keir-Starmer-green-investment-plan-scrapped",
        "title": "Sir Keir Starmer expected to confirm scaling back of £28bn <b>green</b> pledge",
        "description": "Sir Keir Starmer is set to confirm on Thursday that Labour is scaling back a £28 billion green investment pledge following weeks of uncertainty. The Labour leader will announce the latest u-turn despite insisting for weeks that he intended to meet the commitment."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1864319/british-countryside-racist-colonial-woke-wildlife-charities",
        "title": "British countryside labelled ‘racist and colonial’ by woke wildlife charities",
        "description": "The report comes as attempts are made to make the British countryside more inclusive, including by adding signs pointing to Mecca on hiking trails."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13057085/Whip-Tom-Emmer-says-Republican-leadership-KNEW-Mayorkas-impeachment-vote-fail-floor.html",
        "title": "Whip Tom Emmer says Republican leadership KNEW Mayorkas impeachment vote would fail on the floor but &#39;hoped&#39; some members would change their minds",
        "description": "Emmer insisted he knew Tuesday night&#39;s impeachment and Israel votes would result in dual blunders but leadership was &#39;hopeful&#39; they could change the minds of their colleagues."
    },
    {
        "url": "https://uk.news.yahoo.com/us-assistance-ukraine-something-resolved-191000062.html",
        "title": "US assistance to Ukraine. Will something be resolved this week?",
        "description": "Senators are to consider a document based on a bipartisan agreement that will include both changes to the legislation on the US border and illegal migrants, as well as an aid package for Ukraine, Israel,"
    },
    {
        "url": "https://www.independent.co.uk/voices/republicans-mayorkas-impeachment-border-bill-b2492406.html",
        "title": "The Republican faceplants are not (as) funny anymore",
        "description": "A series of GOP belly flops might seem hilarious and an example of karma ultimately coming back for McConnell and Johnson. But they spell bad news for the ability to govern"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68232370.amp",
        "title": "Row erupts over cost of Labour&#39;s home insulation plan",
        "description": "Labour has rejected as &quot;bogus&quot; an analysis by government officials that its plan to improve home energy efficiency would cost £12-15bn a year. The party has said the measures, part of a wider £28bn green investment plan, would be capped at £6bn a year."
    },
    {
        "url": "https://www.newsandstar.co.uk/news/24103621.questions-arise-carlisles-orange-marked-trees-removal-plan/",
        "title": "Questions raised over Carlisle&#39;s orange-marked trees removal plan",
        "description": "THE council is looking to alleviate community concerns over the fate of trees in Carlisle&#39;s city centre marked with orange dots."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24105085.multi-billion-north-east-devolution-deal-laid-parliament/",
        "title": "Multi-billion North East devolution deal laid in Parliament",
        "description": "Legislation to establish a new North East mayor and ratify a multi-billion pound devolution deal has been laid in Parliament."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/07/keir-starmer-to-announce-scaling-back-of-28bn-green-investment-plan",
        "title": "Starmer to announce scaling back of £28bn <b>green</b> investment plan",
        "description": "Labour leader to say move is down to economic uncertainty caused by Tory government, sources say"
    },
    {
        "url": "https://www.politico.eu/article/eu-pesticides-row-exposes-green-deal-rift-in-belgiums-messy-coalition/",
        "title": "EU pesticides row exposes <b>Green</b> Deal rift in Belgium’s messy coalition",
        "description": "Withdrawal of key EU pesticides bill was greeted by PM Alexander De Croo, but slammed by his Green coalition partners."
    },
    {
        "url": "https://www.thenational.scot/news/24104973.can-scotland-learn-ireland-launches-deposit-return-scheme/",
        "title": "What can Scotland learn as Ireland launches deposit return scheme?",
        "description": "THE Republic of Ireland has launched a deposit return scheme (DRS) despite some teething problems and “loud naysayers”"
    },
    {
        "url": "https://uk.sports.yahoo.com/news/exclusive-events-concerts-stars-athletes-170115252.html",
        "title": "From exclusive events to concerts: Stars and athletes plan to flock Las Vegas for Super Bowl events",
        "description": "Instead of raising the rate, O&#39;Neal decided to offer potential attendees more bang for their buck to the NBA legend&#39;s sixth annual event planned for Friday in Sin City. &quot;We&#39;re not going to do that to the people,"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/minister-warns-over-a-computer-says-no-stance-to-buy-now-pay-later-b1137790.html",
        "title": "Minister warns over a ‘computer says no’ stance to buy now, pay later",
        "description": "<b>Green Party</b> peer Baroness Bennett of Manor Castle highlighted research that found nearly a quarter of buy now, pay later users had been landed with late payment fees, with that figure rising to 34% for younger consumers. She said: “Is this not just one ..."
    }
]