[
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13115267/EDEN-CONFIDENTIAL-Royal-revamp-hooligans-clobber-Stone-Island-Cassius-Taylor-hired-help-transform-brands-image.html",
        "title": "EDEN CONFIDENTIAL: Royal revamp for hooligans&#39; top clobber Stone Island as Cassius Taylor is hired to help transform the brand&#39;s image",
        "description": "I can disclose that Cassius Taylor has been recruited by Stone Island, the brand beloved of football hooligans."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-accusations-against-starmer-complete-garbage-speaker-probably-safe-in-role-12593360",
        "title": "Politics latest: Accusations against Starmer &#39;complete garbage&#39;; Speaker &#39;probably safe&#39; in role",
        "description": "In third are the Lib Dems on 9.7%, followed by Reform on 9.2%. The <b>Green Party</b> stands at 6.3%, and the SNP on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. Parents in England who have lost a baby ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68373939",
        "title": "Rochdale by-election candidates discuss the town&#39;s needs",
        "description": "Reform UK&#39;s Simon Danczuk said his &quot;only priority&quot; was Rochdale and tackling crime in the town was vital. George Galloway of the Workers Party for Britain said he wanted to save Rochdale AFC and reopen the market. A number of the 11 candidates standing in the by-election had been due to take part in the debate."
    },
    {
        "url": "https://www.herefordtimes.com/news/24138656.herefordshire-featured-green-party-political-broadcast/",
        "title": "Herefordshire featured in <b>Green Party</b> political broadcast",
        "description": "HEREFORDSHIRE featured on national television this evening as part of a Green Party political broadcast. Dr Ellie Chowns has been tasked by the party to try and claim Sir Bill Wiggin&#39;s North Herefordshire seat."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-sussex-68371594",
        "title": "Starmer determined to build on <b>green</b> belt land in South East",
        "description": "Last year, the Labour <b>Party</b> announced it would build on the <b>green</b> belt to boost housing if it won the next general election. Sir Keir&#39;s visit to the Siemens train depot comes the morning after Crawley Borough Council declared a housing emergency due to ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869795/cpac-christian-terhes-donald-trump-romania",
        "title": "Meet Romania&#39;s Donald Trump who has come to CPAC warning Europe is being turned into China",
        "description": "EXCLUSIVE: Even a veteran of fighting the undemocratic European Union elites for years like Nigel Farage is impressed by Christian Terhes."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/22/what-the-greens-said-at-the-annual-budget-council-meeting/",
        "title": "What the Greens said at the annual budget council meeting",
        "description": "<b>Green</b> councillor Sue Shanks criticised Labour for announcing ... that we can talk but do not have a vote on issues at cabinet. It’s just like a one-<b>party</b> state.” So, when we had the chance – thanks Eric Pickles – all parties agreed to revert ..."
    },
    {
        "url": "https://www.telegraph.co.uk/money/investing/how-to-get-rich-invest-keir-starmer-labour/",
        "title": "How to get rich from Keir Starmer in Number 10",
        "description": "The Chinese Communist <b>Party</b> announced restrictions on the incentives that gaming ... the need to offer business a predictable legislative framework, or to support <b>green</b> energy, are forgotten in the face of public calls for immediate but costly state ..."
    },
    {
        "url": "https://www.politico.eu/article/eu-conservatives-bend-to-von-der-leyen-ditching-car-ban-fight-in-draft-manifesto-epp/",
        "title": "EU conservatives bend to von der Leyen, ditching car ban fight in draft manifesto",
        "description": "The EPP has been divided over von der Leyen&#39;s European <b>Green</b> Deal climate policy, pushing to roll back some elements. However, the <b>party</b>&#39;s manifesto maintains a promise to advance the project further even as governments across Europe wrestle with how to ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/22/it-blunder-physician-associates-illegally-prescribe-opiates/",
        "title": "IT blunder allowed physician associates to illegally prescribe opiates",
        "description": "Mistake fuels fears that workers with limited medical training could be handed responsibilities that place patients in danger"
    },
    {
        "url": "https://news.met.police.uk/news/five-convicted-following-fatal-stabbing-at-halloween-party-479896",
        "title": "Five convicted following fatal stabbing at Halloween <b>party</b>",
        "description": "Despite the immediate intervention of paramedics, 21-year-old Givani Espeut died of his injuries after being stabbed 11 times"
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24138483.york-lib-dems-organise-rally-council-library-cuts/",
        "title": "York Lib Dems organise rally against council library cuts",
        "description": "A rally has been staged in York city centre against planned cuts to library services. Members of the Liberal Democrats and <b>Green Party</b> staged the event outside York Explore Library at 4.30pm today (February 22), ahead of a crunch City of York Council ..."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24138480.york-lib-dems-urge-labour-use-whitehall-1-6m-protect-services/",
        "title": "York Lib Dems urge Labour to use Whitehall £1.6m to &#39;protect services&#39;",
        "description": "and a £46.50-a-year charge for emptying <b>green</b> bins. The <b>party</b> says the cuts are needed to set a balanced budget - and save the authority from bankruptcy. But the Liberal Democrats say Labour could use an extra £1.6 million of cash just earmarked to the ..."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmers-gaza-problem-whole-messier-2921175?ico=most_popular",
        "title": "Keir Starmer’s Gaza problem just got a whole lot messier",
        "description": "Hoyle’s miscalculation broke common practice. It was a request Keir Starmer had pressed with him personally – and that does not look great in hindsight either. The Labour leader has since felt obliged to clarify that he did not “threaten the Speaker in any way” (which sounds like a pretty minimum requirement in a non-mafioso political setup)."
    },
    {
        "url": "https://bylinetimes.com/2024/02/22/clean-air-activists-accuse-london-mayor-sadiq-khan-of-burying-his-controversial-silvertown-tunnel-project-as-election-nears/",
        "title": "Clean Air Activists Accuse London Mayor Sadiq Khan of ‘Burying’ his Controversial Silvertown Tunnel Project as Election Nears",
        "description": "The £1.2 billion tunnel is arguably the biggest infrastructure project Khan has approved – but he rarely brings it up"
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/irish-government-criticised-over-public-transport-funding-VBENPXNLCJFC3CNPVGPVXG6REA/",
        "title": "Irish government criticised over public transport funding",
        "description": "The Irish government has been criticised for allocating just 1.5% of its multimillion-euro funding package for Northern Ireland to public transport."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/22/net-zero-requires-new-ways-of-thinking-about-how-we-supply-and-use-energy",
        "title": "Net zero requires new ways of thinking about how we supply and use energy",
        "description": "Letters: Do away with centralised companies in favour of localised generation and saving more energy, writes Charles Harris of the Green party"
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/arts-and-culture/save-the-date-for-the-big-lunch-on-1-2-june-set-to-be-the-greenest-yet-4529858",
        "title": "Save the date for The Big Lunch on 1 - 2 June set to be the greenest yet",
        "description": "Eden Project Communities is launching The Big Lunch 2024 with brand new resources packed with ideas to get the party started and make this year’s Big Lunch the greenest yet!"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/south-tyneside-councils-new-opposition-28686100",
        "title": "South Tyneside Council&#39;s new opposition <b>Green</b> Group to present alternative budget plans",
        "description": "The Green Party recently became the official opposition on South Tyneside Council and will present alternative budget plans at a meeting this week"
    },
    {
        "url": "https://www.thetimes.co.uk/article/9ed4f3fc-14c7-4636-b570-685c81d8fb9e?shareToken=7eb4e24fbcc63f1847aa5128add18198",
        "title": "Liz Truss: Civil service run by ‘trans activists and <b>green</b> extremists’",
        "description": "The Conservative Political Action Conference (Cpac) has long been a fixture in the Republican <b>Party</b> calendar. This year’s theme is that Cpac is where “globalism comes to die”. In recent years it has become a platform for Trump’s supporters to give ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/national/24137950.sir-lindsay-hoyle-under-fire-speaker-sought-return-respect-commons/",
        "title": "Sir Lindsay Hoyle: Under-fire Speaker who sought to return ‘respect’ to Commons",
        "description": "First elected MP for Chorley in 1997, he had been Mr Bercow’s most senior deputy since 2010, meaning he was no stranger to tackling boisterousness on the <b>green</b> benches ... businessman won back the seat for the <b>party</b> after it had been in Tory hands ..."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/24137554.sinn-fein-says-open-reform-ability-block-powersharing-stormont/",
        "title": "Sinn Fein says it is open to reform on ability to block powersharing at Stormont",
        "description": "The Economy Minister said his <b>party</b> recognised that the veto was a “continued problem ... In 2017, Sinn Fein collapsed the ministerial executive amid a furore about a botched <b>green</b> energy scheme. It was down for three years. The SDLP, the Assembly ..."
    },
    {
        "url": "https://uk.news.yahoo.com/province-needs-more-control-immigration-193328204.html",
        "title": "Province needs more control of immigration following federal cap, MLA says",
        "description": "A <b>Green Party</b> MLA says New Brunswick should have more control over immigration numbers in response to the federal government&#39;s new cap on international study permits. Megan Mitton says Ottawa&#39;s &quot;one-size-fits-all&quot; decision is &quot;going to have a negative ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/22/final-fantasy-7-rebirth-review-remade-remodelled-reborn-20323101/?ico=trending-post-strip_item_4",
        "title": "Final Fantasy 7 Rebirth review – remade, remodelled and reborn",
        "description": "Each of those locations has a very distinct vibe – <b>green</b> coastal area, mountains ... with the introduction of synergy moves that allow two members of each three-person battle <b>party</b> to combine their skills. The synergy system has two levels: in basic ..."
    },
    {
        "url": "https://uk.news.yahoo.com/libraries-much-more-books-rally-174006067.html",
        "title": "&#39;Libraries are so much more than books&#39;: Rally against cuts to Explore budget",
        "description": "A rally has been staged in York city centre against planned cuts to library services. Members of the Liberal Democrats and <b>Green Party</b> staged the event outside York Explore Library at 4.30pm today (February 22), ahead of a crunch City of York Council ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mps-environmental-audit-committee-philip-dunne-commons-william-wragg-b1140979.html",
        "title": "More than 60 MPs call for Speaker to quit over Gaza vote",
        "description": "Senior Conservatives and Scottish National <b>Party</b> MPs have put their names to the “early day ... Sir James Duddridge (Con)Jo Gideon (Con)Chris <b>Green</b> (Con)Bob Blackman (Con)Tom Randall (Con)Jonathan Lord (Con)Karl McCartney (Con)Derek Thomas (Con)Jack ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68354801.amp",
        "title": "Deadlock as Bristol City Council fails to approve budget",
        "description": "Requiring a majority to pass, both the Conservative and <b>Green Party</b> groups voted against next year&#39;s financial plan. <b>Green Party</b> group leader, Emma Edwards, said: &quot;This Labour administration&#39;s final budget, which they will not be around to see carried out ..."
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/opinion/24136832.scottish-governments-farm-plans-remain-mysterious/",
        "title": "Scottish government&#39;s farm plans remain mysterious",
        "description": "The promise of 70 of future agriculture support payments post-2027 being targeted on Tier 1 and Tier 2 payments had already been announced in"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869718/Gaza-Lindsay-Hoyle-SNP",
        "title": "Lindsay Hoyle and SNP leader standoff in the Wild West saloon of Westminster",
        "description": "On the <b>green</b> benches, Penny Mordaunt, did her best to rile Labour MPs for their <b>party</b>’s role in events. The Commons Leader blamed &quot;<b>party</b> politics on behalf of the Labour <b>Party</b>&quot; for the previous day’s chaotic scenes. Sir Keir Starmer is &quot;not fit&quot; to ..."
    },
    {
        "url": "https://www.expressandstar.com/news/politics/2024/02/22/conservative-party-chooses-its-parliamentary-candidate-for-wolverhampton-west/",
        "title": "Conservative <b>Party</b> chooses its parliamentary candidate for Wolverhampton West",
        "description": "&quot;I will be a strong voice for Wolverhampton, fighting for safer neighbourhoods; the regeneration of our city and local areas; and the protecting of our vital <b>green</b> belt.&quot;"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-john-bercow-mps-labour-speaker-b2500785.html",
        "title": "Sir Lindsay Hoyle: Under-fire Speaker who sought to return ‘respect’ to Commons",
        "description": "Sign up to our free Brexit and beyond email for the latest headlines on what Brexit is meaning for the UK Sir Lindsay Hoyle’s future as House of Commons Speaker is ..."
    },
    {
        "url": "https://thebristolcable.org/2024/02/bristol-mayor-marvin-rees-last-council-budget-voted-down/",
        "title": "Bristol councillors vote down Marvin Rees’ final budget after bad-tempered debate",
        "description": "Tory councillor Geoff Gollop said: “I find it baffling the <b>Green Party</b> doesn’t want to even put forward amendments to show a flavour of what you care about… Where’s your passion? Your passion is in criticising everybody and standing up for nothing ..."
    }
]