[
    {
        "url": "https://www.bbc.com/news/uk-politics-68352103",
        "title": "Labour pledges to cut red tape for British farmers",
        "description": "Farming minister Mark Spencer said Labour&#39;s promise to spend billions on <b>green</b> projects &quot;will mean higher taxes on ... schools and prisons is British. The <b>party</b> is keen to win over voters in rural communities ahead of a general election, which is expected ..."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-ill-stay-on-as-scotlands-first-minister-if-snp-loses-seats-at-the-uk-general-election",
        "title": "Yousaf: I&#39;ll stay on as FM if SNP loses seats at general election",
        "description": "If the <b>party</b> returned a majority of 29 MPs at the next election that ... “We can do that on lifting the two-child limit, we can do that by making sure they don’t dump their £28bn <b>green</b> property fund which they now say they are doing and on a whole ..."
    },
    {
        "url": "https://www.investing.com/news/world-news/factboxwho-are-the-candidates-running-in-the-2024-us-presidential-election-3309005",
        "title": "Factbox-Who are the candidates running in the 2024 US presidential election?",
        "description": "The political activist, philosopher and academic said in June he would launch a third-<b>party</b> bid for president that is likely to appeal to progressive, Democratic-leaning voters. West, 70, initially ran as a <b>Green Party</b> candidate, but in October he said ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106509/New-Zealand-Greens-MP-Efeso-Collins-49-suddenly-collapses-dies-charity-event-ChildFund-Water-Run-Auckland.html",
        "title": "New Zealand Greens MP Efeso Collins, 49, suddenly collapses and dies at charity event ChildFund Water Run in Auckland",
        "description": "New Zealand Greens MP Efeso Collins has died after running in a charity event in Auckland. The 49-year-old collapsed on Wednesday morning in Auckland after running in the ChildFund Water Run, a fundraiser for Pacific communities."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106329/voters-tough-immigration-political-parties-preserve-right.html",
        "title": "Voters are tougher on immigration than all of the main political parties and back policies often seen as the preserve of the Right, poll finds",
        "description": "A survey of more than 13,000 adults found that almost two-thirds want more restrictions on immigration, including slim majorities of Labour and Liberal Democrat voters."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68354801",
        "title": "Deadlock as Bristol City Council fails to approve budget",
        "description": "Bristol City Council has failed to approve its budget for the next financial year. Councillors voted against the plans during a full council meeting at City Hall which lasted about three hours. Outgoing Labour mayor Marvin Rees&#39;s final budget proposed more than £24m of cutbacks and a 4.99% council tax hike."
    },
    {
        "url": "https://leftfootforward.org/2024/02/how-every-mp-voted-on-the-offshore-petroleum-licensing-bill/",
        "title": "How every MP voted on the Offshore Petroleum Licensing Bill",
        "description": "Despite the warnings from climate campaigners, the Offshore Petroleum Licensing Bill passed its third reading with 285 votes for and 218 votes against. As a result, the legislation will now continue its journey through parliament, firstly by being debated in the House of Lords."
    },
    {
        "url": "https://www.ft.com/content/cae5c81e-e2d0-481b-9b5e-bbb4dec6a040",
        "title": "Rishi Sunak should resist a swerve to the right",
        "description": "Bleeding support on that scale on its right flank, they say, could compound its losses in an election. They are urging Sunak to tack further to the right in cutting taxes, slowing climate goals and hardening his line on “illegal” migration,"
    },
    {
        "url": "https://www.thenational.scot/politics/24131449.scottish-labour-conference-left-us-questions-answers/",
        "title": "Scottish Labour conference left us with more questions than answers",
        "description": "THE Labour Party in Scotland has now had its spring conference, and what have we learned? It seems Sarwar lied when he told the BBC’s"
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/daily-mail-high-court-london-labour-labour-party-b1140078.html",
        "title": "Dale Vince ‘seriously defamed’ by Daily Mail article, High Court told",
        "description": "Green energy industrialist Dale Vince was “seriously defamed” by a Daily Mail article which falsely suggested he was the subject of harassment allegations, the High Court has heard."
    },
    {
        "url": "https://uk.movies.yahoo.com/emma-stone-talks-star-yorgos-172238379.html",
        "title": "Emma Stone in Talks to Star in Yorgos Lanthimos’ ‘Save the <b>Green</b> Planet’ Remake (EXCLUSIVE)",
        "description": "Emma Stone, who just won a BAFTA for her performance in “Poor Things” and is nominated for an Oscar, is in talks to reunite with Yorgos Lanthimos on his remake of South Korean fantasy comedy “Save the Green Planet."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/20/joe-biden-economy-voters-opinion",
        "title": "Voters may at last be coming round to Biden’s sunny view of the economy",
        "description": "America’s robust economic indicators under the president have not been reflected in opinion polls – but that could be changing"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-labour-westminster-scotland-tories-b1140414.html",
        "title": "SNP heaps pressure on Labour by calling for commitment to £28bn <b>green</b> spending",
        "description": "The SNP at Westminster accused the Tories and Labour of blocking ‘Scotland’s entry to the green renewables goldrush’."
    },
    {
        "url": "https://kelo.com/2024/02/20/new-zealand-parliamentarian-dies-during-charity-race/",
        "title": "New Zealand parliamentarian dies during charity race",
        "description": "WELLINGTON (Reuters) – New Zealand parliamentarian and <b>Green Party</b> member Efeso Collins died during a charity event in Auckland on Wednesday, the <b>Green Party</b> said in a statement. Collins, 49, was participating in a ChildFund Water Run to raise money to ..."
    },
    {
        "url": "https://news.sky.com/story/politics-live-lord-david-cameron-vows-to-help-protect-falklands-during-visit-to-islands-12593360?postid=7259542",
        "title": "Politics live: Labour&#39;s Lammy asked five times for details of Gaza ceasefire call",
        "description": "In third are the Lib Dems on 9.7%, followed by Reform on 9.2%. The <b>Green Party</b> stands at 6.3%, and the SNP on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. Labour&#39;s shadow foreign secretary ..."
    },
    {
        "url": "https://uk.movies.yahoo.com/michael-keaton-beetlejuice-2-felt-163000550.html",
        "title": "Michael Keaton: ‘Beetlejuice 2’ Felt ‘Handmade’ After ‘Years’ in Front of a <b>Green</b> Screen on Superhero Movies",
        "description": "&quot;I was totally not interested in doing something where there was too much technology,&quot; Keaton said of returning to the iconic character."
    },
    {
        "url": "https://inews.co.uk/news/consumer/lyles-golden-syrup-emblem-changing-2916055?ITO=msn",
        "title": "Why is the Lyle’s Golden Syrup emblem changing and what will replace it?",
        "description": "Then at a wedding <b>party</b> he asked guests to solve a riddle relating to the ... branding is a good idea as people tend to remember brands through visual codes – the <b>green</b> colour, the lion – which remind people, ‘That’s the product I buy, that ..."
    },
    {
        "url": "https://sg.news.yahoo.com/dublin-set-announce-major-cross-073501680.html",
        "title": "A5 and Casement Park get share of €800m funding from Dublin",
        "description": "Both governments are committed.” Mr Varadkar made the overall funding announcement along with his partners in government, Tánaiste (Deputy Prime Minister) Micheál Martin and <b>Green Party</b> leader Eamon Ryan, at a press conference in Dublin. He said it was ..."
    },
    {
        "url": "https://www.yourthurrock.com/2024/02/19/tea-party-at-asda-hosted-by-community-group/",
        "title": "Tea <b>party</b> at Asda hosted by community group",
        "description": "ASDA’S Tilbury store was the latest venue for a Re-engage tea party. The locally-based charity which supports local and vulnerable people once again were hosted at the Tilbury store cafe, which frequently plays host to all the Thurrock groups organised by Re-engage."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/special-features/ultimate-wedding-guide-manc-couples-28640312",
        "title": "The ultimate wedding guide for Manc couples",
        "description": "There’s even a private bridal parlour where the bridal <b>party</b> can prepare and relax both before and after ... Harrington and Hallworth is an official stockists of Charles <b>Green</b> wedding rings, one of the oldest ring makers in the UK. It carries this ..."
    },
    {
        "url": "https://www.ft.com/content/86073030-84c1-471e-93a0-4b696116030a?sharetype=gift",
        "title": "Brussels bows to farmers’ protests by slashing environmental targets",
        "description": "The retreat by European Commission President Ursula von der Leyen is part of a wider scaling-back of her <b>green</b> ambitions in a bid to placate farmers, a critical constituency for her centre-right <b>party</b> that is seeking to remain the EU’s most powerful ..."
    },
    {
        "url": "https://www.sheppnews.com.au/world/new-zealand-greens-mp-dies-after-charity-run-2/",
        "title": "New Zealand Greens MP dies after charity run",
        "description": "New Zealand <b>Green Party</b> MP Efeso Collins has died after participating in a charity run. -PR Handout Image New Zealand Greens MP Efeso Collins has died after running in a charity event in Auckland. New Zealand Greens MP Efeso Collins has died after running ..."
    },
    {
        "url": "https://www.express.co.uk/news/world/1868822/ursula-von-der-leyen-re-election",
        "title": "Ursula von der Leyen&#39;s EU legacy &#39;could backfire on her&#39; if she is re-elected",
        "description": "Ursula von der Leyen&#39;s track record could work against her as she eyes another five years at the top of the European Union&#39;s most powerful institution."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-poll-nikki-haley-south-carolina-primary-news-b2499080.html?page=9",
        "title": "Haley hammers ‘unhinged’ Trump and ‘failed’ Biden in defiant speech vowing to stay in 2024 race: Live",
        "description": "In her remarks on Tuesday lunchtime, Ms Haley attacked both Mr Biden and Mr Trump for their respective ages and condemned their records in the White House — the former for inflation and the crisis at the border, and the latter for his myriad of legal problems and his callous insults directed at military heroes."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/rishi-sunak-faces-backlash-for-saying-farmers-work-for-love/",
        "title": "Sunak faces backlash for saying farmers work for love not money",
        "description": "Prime Minister, who was speaking at NFU conference, rebuked by union chief, as polling shows Tories face rural election woe"
    },
    {
        "url": "https://inews.co.uk/news/politics/the-shy-tory-candidates-who-seem-reluctant-to-tell-voters-theyre-conservative-2916056?ico=more_from_this_author",
        "title": "The shy Tory candidates who seem reluctant to tell voters they’re Conservative",
        "description": "Why some Tory MPs and candidates are distributing leaflets that are green rather than blue and barely mention the word Conservative"
    },
    {
        "url": "https://news.sky.com/story/politics-live-labours-lammy-asked-five-times-for-details-of-gaza-ceasefire-call-12593360",
        "title": "Politics live: Labour&#39;s Lammy asked five times for details of Gaza ceasefire call",
        "description": "In third are the Lib Dems on 9.7%, followed by Reform on 9.2%. The <b>Green Party</b> stands at 6.3%, and the SNP on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. Labour&#39;s shadow foreign secretary ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/first-minister-humza-yousaf-visits-moray-in-election-push-342755/",
        "title": "First Minister Humza Yousaf&#39;s priorities for Moray ahead of first General Election for new Moray West, Nairn and Strathspey constituency",
        "description": "Launching the battle for the new Moray West, Nairn and Strathspey constituency ahead of this year&#39;s General Election, Mr Yousaf was joined by SNP candidate Councillor Graham Leadbitter (Elgin City South). During the visit, party activists were handed signs which urged to public to: &quot;Give the Tories the red card&quot;."
    },
    {
        "url": "https://www.theguardian.com/politics/ng-interactive/2024/feb/20/general-election-uk-opinion-polls-seats-tories-lose",
        "title": "UK general election: the seats the Tories will lose if the polls are right",
        "description": "Guardian analysis reveals the Conservative seats most at risk to Labour in the next election, based on current national polls"
    },
    {
        "url": "https://socialistworker.co.uk/what-we-think/galloway-is-not-the-answer-for-rochdale/",
        "title": "Galloway is not the answer for Rochdale",
        "description": "If George Galloway wins the Rochdale by-election on Thursday next week it will be because of his support for the Palestinians. It will be a searing judgement on Keir Starmer and the Labour Party’s backing for genocide. But there are strong reasons why Socialist Worker can’t call for a vote for Galloway."
    },
    {
        "url": "https://uk.news.yahoo.com/extra-money-found-schools-says-180000159.html",
        "title": "Some extra money found for schools, says council leader ahead of budget meetings",
        "description": "EXTRA money will be found for schools, a council leader has said ahead of a crunch budget meeting. Monmouthshire County Council has been preparing a budget with £8.4 million of cuts for the coming financial year, including a demand schools find £854,000 in savings."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/lewes-district-council-supports-call-for-greater-transparency-over-contaminated-land-4525908",
        "title": "Lewes District Council supports call for greater transparency over contaminated land",
        "description": "Lewes District Council has become the first local authority to support Zane’s Law — prospective legislation calling for greater transparency over contaminated land."
    },
    {
        "url": "https://www.environmental-finance.com/content/the-green-bond-hub/taking-the-pulse-of-the-sustainable-bond-market.html",
        "title": "Taking the pulse of the sustainable bond market",
        "description": "In the Middle East and Africa, regional issuance more than doubled last year from 2022 levels, bolstered by the presence of sovereigns – for example, the government of Sharjah issued $1 billion in green bonds. In Latin America, high-volume issuers – including sovereigns such as Colombia, Chile and Mexico – will continue to dominate activity."
    },
    {
        "url": "https://www.hertsad.co.uk/news/24131198.tring-lib-dems-win-seat-harpenden-constituency/",
        "title": "Tring: Lib Dems win seat in Harpenden constituency",
        "description": "The Liberal Democrats have strengthened their grip on the Chiltern Hills after a vote in the future Harpenden and Berkhamsted constituency."
    },
    {
        "url": "https://www.walesonline.co.uk/news/politics/uk-government-minister-accuses-labour-28665989",
        "title": "UK Government minister accuses Labour and unions of offering &#39;false hope&#39; to Tata workers",
        "description": "In this opinion piece, Welsh Secretary David TC Davies says the deal struck by the UK Government is the only one on the table, and others are raising &#39;false hope with vague ideas&#39;"
    },
    {
        "url": "https://www.businessgreen.com/news/4176043/government-lead-green-finance-experts-unveil-blueprint-mobilising-net-zero-investment",
        "title": "&#39;Government needs to lead&#39;: <b>Green</b> finance experts unveil blueprint for mobilising net zero investment",
        "description": "Green Finance Institute and IPPR call for deeper collaboration between private and public sectors and sector-specific transition pathways to boost much needed green investment"
    },
    {
        "url": "https://leamingtonobserver.co.uk/news/its-time-for-change-says-green-party-candidate-for-warwick-and-leamington/",
        "title": "&quot;It&#39;s time for change&quot; says <b>green party</b> candidate for Warwick and Leamington",
        "description": "THE <b>GREEN party</b> parliamentary candidate for Warwick and Leamington says it’s time for change. Hema YellaPragada is a district councillor for Warwick Myton and Heathcote and lives on Warwick Gates. She will stand as a prospective MP for the area at the ..."
    },
    {
        "url": "https://www.thestar.co.uk/news/politics/sheffield-betting-shop-wants-to-expand-despite-concerns-over-crime-and-gambling-harm-4525504",
        "title": "Sheffield betting shop wants to expand despite concerns over crime and gambling harm",
        "description": "Among the objectors were the Sheffield Children Safeguarding Partnership, The Licensing Authority, The <b>Green Party</b> City Ward Councillors, a local resident from the Gambling with Lives charity and ChangingSheff. A safeguarding manager from Sheffield ..."
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/rte-exit-deals-capped-transparent-32166526",
        "title": "RTE exit deals must be capped and transparent, Media Minister insists",
        "description": "Minister Martin said she expressed her &quot;concern and frustration&quot; at the ongoing controversy and added it was &quot;undermining the good work&quot; being done to reform RTE and rebuild the public’s trust"
    },
    {
        "url": "https://www.carbonbrief.org/daily-brief/ursula-von-der-leyen-to-seek-second-term-as-head-of-european-commission/",
        "title": "Ursula von der Leyen to seek second term as head of European Commission",
        "description": "Ursula von der Leyen announced yesterday that she will seek a second term as president of the European Commission, the Guardian reports"
    },
    {
        "url": "https://uk.news.yahoo.com/pressure-group-says-york-bus-150000993.html",
        "title": "Pressure group says York bus improvements must make more progress",
        "description": "Read more: Council Executive to make decisions on York bus network City of York Council consults on bus service review <b>Green Party</b> calls on York council to speed up transport plan Council bosses in the administration will also be asked at the meeting to ..."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/council/plans-to-apply-for-land-between-horsham-and-crawley-to-be-designated-green-belt-being-explored-4525211",
        "title": "Plans to apply for land between Horsham and Crawley to be designated <b>Green</b> Belt being explored",
        "description": "Mr Milne, cabinet member for planning &amp; infrastructure, said: “If we get it, it will be the first <b>Green</b> Belt land in the Horsham district ... half of the north of Horsham District, despite his <b>party</b> going into last year’s local elections promising ..."
    },
    {
        "url": "https://www.itv.com/news/utv/2024-02-20/funding-for-cross-border-projects-to-be-announced",
        "title": "Funding for cross-border projects to be announced",
        "description": "The A5 major road scheme and the redevelopment of Casement Park GAA grounds in west Belfast are speculated to be among those to benefit | UTV News"
    },
    {
        "url": "https://www.bbc.com/news/articles/cg3ex8e26xxo.amp",
        "title": "Dublin set to announce major cross-border funding",
        "description": "The Irish government is set to announce substantial new funding for cross-border projects later. The cabinet in Dublin will meet to approve the plans, which will include the restoration of the £400m funding promise for the A5."
    },
    {
        "url": "https://www.thenational.scot/news/24130401.bbc-scotland-stephen-flynn-clash-presenter-windfall-tax/",
        "title": "BBC Scotland: Stephen Flynn in clash with presenter over windfall tax",
        "description": "THE SNP’s Westminster leader clashed with a BBC presenter over the SNP’s stance on a windfall tax during an interview on Tuesday morning."
    },
    {
        "url": "https://inews.co.uk/news/i-morning-briefing-julian-assanges-final-fight-against-extradition-to-the-us-2915021?ico=related_article_inline",
        "title": "i morning briefing: Julian Assange’s final fight against extradition to the US",
        "description": "The WikiLeaks founder goes to the High Court in a last-ditch attempt to avoid being sent to the US, where he faces serious charges"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24128222.darlington-council-tax-increase-five-per-cent/",
        "title": "Darlington council tax to increase by five per cent",
        "description": "Labour’s concerns were echoed by the <b>Green Party</b> at the meeting. Cllr Matthew Snedker, group leader, said: “If more help is not provided, we’re looking down the barrel of a gun. Without proper, fair funding settlements for local authorities ..."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/20/snp-accused-of-siding-with-the-energy-giants-with-opposition-to-labour-windfall-tax-plans/",
        "title": "SNP accused of ‘siding with the energy giants’ with opposition to Labour windfall tax plans",
        "description": "Humza Yousaf has been accused of “siding with the energy giants” after attacking Labour’s plans for an increased windfall tax on North Sea oil and gas. The Scottish first minister said the SNP would oppose Labour’s plan to lift the energy profits levy from 75 per cent to 78 per cent and extend it"
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/sunaks-farm-offensive/",
        "title": "Sunak’s farm offensive",
        "description": "ON THE OTHER HAND … Lib Dem leader Ed Davey reckons Sunak’s “cynical pre-election giveaway” won’t restore Tory relations with rural communities. Party advisers believe the farming vote was key in snatching the seats of North Shropshire, Tiverton and Honiton and Somerton and Frome at by-elections — though surely a few scandals played a part, too."
    },
    {
        "url": "https://www.thesun.co.uk/tvandshowbiz/26036947/kim-kardashian-swanky-ballerina-party-chicago-bff-birthday/",
        "title": "Kim Kardashian shows off swanky all-pink ballerina <b>party</b> for Chicago’s BFF Dove’s 4th birthday including huge ball pit",
        "description": "KIM Kardashian showed off a lavish ballerina party from her Los Angeles home. The Kardashian star celebrated the birthday of her daughter Chicago’s best friend, Dove, who turned four. Kim"
    },
    {
        "url": "https://www.newsandstar.co.uk/news/24129843.gavin-hawkton-petitions-councils-tree-removal-plan/",
        "title": "Gavin Hawkton petitions against council&#39;s tree removal plan",
        "description": "CARLISLE&#39;S <b>Green Party</b> parliamentary candidate has submitted a petition to the council calling for a stronger focus on protecting Carlisle town centre&#39;s trees. The petition, which has been signed by 362 people over two weeks, comes after concerns were ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rochdale-lib-dem-candidate-hopeful-28664006",
        "title": "Rochdale Lib Dem candidate hopeful suspended after campaigning for George Galloway",
        "description": "The <b>Green Party</b> candidate in the by-election has also pulled out of the race due to &#39;regrettable&#39; social media posts he made &#39;a number of years ago&#39;. However, both candidates will still appear on the ballot papers next to the logos of the parties which ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/02/exclusive-polling-nhs-save-labour",
        "title": "Matthew Elliott: we haven’t made the most of Brexit",
        "description": "Exclusive polling shows the <b>party</b>’s health plan is by far the most popular of its five missions for government. By Freddie Hayward Labour’s plan to invest £28bn in the <b>green</b> economy suffered a torturous death. The demise of the <b>party</b>’s flagship ..."
    },
    {
        "url": "https://www.environmental-finance.com/content/the-green-bond-hub/japan-leads-the-way-as-investors-turn-their-sights-to-transition-impact.html",
        "title": "Japan leads the way as investors turn their sights to transition impact",
        "description": "Jarek Olszowka: In November 2023, Japan published its Climate Transition Bond Framework, for which it received two second <b>party</b> opinions. They also launched their <b>Green</b> Transformation (GX) programme: a public private partnership which seeks to catalyse JPY ..."
    },
    {
        "url": "https://www.politico.eu/article/ursula-von-der-leyen-military-defense-slimate-second-term/",
        "title": "Von der Leyen’s 2nd-term pitch: More military might, less climate talk",
        "description": "But there’s little appetite for expanding the <b>Green</b> Deal: Von der Leyen’s own <b>party</b> is the loudest advocate for a pause in environmental lawmaking. In her press conference on Monday, climate was barely mentioned. Instead, von der Leyen stressed topics ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13415161.greens-carpetbagging-row-edinburgh-councillor-selected-fight-north-east-holyrood-seat/",
        "title": "Greens in carpetbagging row after Edinburgh councillor selected to fight north east Holyrood seat",
        "description": "but some <b>Green</b> members already in the north east are said to be upset at the decision with 20 signing a petition calling for her to be deselected. Signatories are said to include Shiona Baird, an ex-MSP and former co-convenor of the <b>party</b>. While the Greens ..."
    },
    {
        "url": "https://pressgazette.co.uk/media_law/daily-mail-faces-100k-claim-from-labour-donor-pictured-next-to-sex-harassment-headline/",
        "title": "Daily Mail faces £100K claim from Labour donor pictured next to ‘sex harassment’ headline",
        "description": "Mr Vince is suing the paper’s publisher, Associated Newspapers Limited (ANL), after the article headlined “Labour repays £100,000 to ‘sex harassment’ donor” was printed in June last year."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24128794.dont-fooled---snp-dont-care-childrens-education/",
        "title": "Don’t be fooled – SNP don’t care about children’s education",
        "description": "When questioned about the impact of education cuts, the SNP extolled how virtuous they had been in protecting education from potential cuts for years. The real reason however is much starker, they didn’t cut because there was no excess to cut."
    }
]