[
    {
        "url": "https://www.thesun.ie/news/12273493/rte-catherine-martin-defends-handling-exit-package-untenable/",
        "title": "Defiant Martin defends handling of ‘very difficult’ RTE exit pay saga as minsters give backing amid ‘untenable’ calls",
        "description": "MEDIA Minister Catherine Martin has defended her handling of the latest crisis to engulf RTE, which led to Siun Ni Raghallaigh resigning as the chairwoman of the network’s board. Minister Martin,"
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/politics/catherine-martin-siun-ni-raghallaigh-32199733",
        "title": "Catherine Martin at odds with RTE Board and Siun Ni Raghallaigh over exit payment controversy",
        "description": "Media Minister Catherine Martin stated she was “misinformed” on Monday and Wednesday when she asked Siun Ní Raghallaigh if she or the Board had signed off on Richard Collins’ exit payment in October"
    },
    {
        "url": "https://www.ft.com/content/820a4c91-675b-4000-a70b-940002e99ddb",
        "title": "Rishi Sunak touts ‘<b>green</b> shoots’ of UK economic recovery ahead of Budget",
        "description": "Sunak and chancellor Jeremy Hunt believe voters are starting to see evidence of a recovery, with real wages rising and unemployment rates below 4 per cent. Hunt is putting the finishing touches to the main measures he intends to put into his Budget on March 6, which he hopes to show voters a clear path to a brighter future."
    },
    {
        "url": "https://www.ft.com/content/79b7895b-590a-432f-941d-8e24f28f44af",
        "title": "Transcript: Why would anyone want to become an MP?",
        "description": "This is an audio transcript of the Political Fix podcast episode: ‘Why would anyone want to become an MP?’ Lucy Fisher Why would anyone want to become an MP? [MUSIC PLAYING] W"
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/northern-ireland-freedom-of-speech-green-party-and-dup-slam-plans-by-belfast-city-council-which-could-restrict-free-speech-and-right-to-protest-4531751",
        "title": "Northern Ireland freedom of speech: <b>Green Party</b> and DUP slam plans by Belfast City Council which could restrict free speech and right to protest",
        "description": "The Green Party and DUP have slammed plans by Belfast City Council which they believe will restrict free speech and the right to protest in the city centre."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/green-party-dublin-media-labour-party-sport-b1141244.html",
        "title": "Media Minister defends her handling of RTE crisis",
        "description": "Ireland’s Media Minister has defended her handling of the latest crisis to engulf RTE, which led to Siun Ni Raghallaigh resigning as the chairwoman of the network’s board. Catherine Martin, who is facing calls to step down from her position, said she is doing her best to manage a “very difficult situation”."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/sammy-wilson-quits-dup-chief-whip-role-as-divisions-simmer-within-party-4531179",
        "title": "Sammy Wilson quits DUP chief whip role as divisions simmer within <b>party</b>",
        "description": "The DUP’s Sammy Wilson has quit his role as chief whip of the party’s Westminster team. The East Antrim MP has been openly critical of the deal struck between his party and the government."
    },
    {
        "url": "https://www.shropshirestar.com/news/politics/2024/02/23/western-governments-will-be-on-the-wrong-side-of-history-in-gaza-war-says-telford-green-party/",
        "title": "Western governments will be on the &#39;wrong side of history&#39; in Gaza war, says Telford <b>Green Party</b>",
        "description": "The coordinator of Telford and Wrekin Green Party has expressed his fear and frustration that more isn’t being done to stop the “nightmare” in Gaza."
    },
    {
        "url": "https://www.tatler.com/article/who-are-the-gallery-girls-from-mayfair-to-bethnal-green-nepo-babies-to-new-kids-on-the-block",
        "title": "The Gallery Girls: from Mayfair to Bethnal <b>Green</b>, nepo-babies to new kids on the block. Who are the ‘gallerinas’ of today?",
        "description": "Gallery Girls have come a long way since the Sloane Rangers of Sotheby&#39;s in the ‘80s. Tatler catches up with Tamsin Golding Yee, Sarah Green, Ell Pennick, India Bhattacharjee and Lovisa Berntson on th"
    },
    {
        "url": "https://www.belfastlive.co.uk/news/belfast-news/sinn-fin-rejects-belfast-city-28694352",
        "title": "Sinn Féin rejects Belfast City Hall call for White House boycott over Palestine",
        "description": "Sinn Féin in Belfast has rejected a council call by People Before Profit to boycott the White House this St Patrick’s Day as an act of solidarity with Palestine."
    },
    {
        "url": "https://www.thetimes.co.uk/article/green-party-supporter-guilty-terrorism-kill-politicians-87slqjv77",
        "title": "<b>Green Party</b>-supporting student wanted to kill 50 politicians",
        "description": "A left-wing anarchist who said he wanted to kill at least 50 politicians has been found guilty of terrorism offences after compiling and sharing a bomb-making manual. Jacob Graham, 20, a computer science student at Hugh Baird College who modelled himself ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-llandudno-parliament-inflation-keir-starmer-b1141115.html",
        "title": "Sunak tells Welsh Tories economy is producing ‘<b>green</b> shoots’ of recovery",
        "description": "The public are seeing the “green shoots” of the economy improving, the Prime Minister has said. Speaking at the Welsh Conservative Conference in Llandudno on Friday, Rishi Sunak said the public are “feeling that the economy has turned the corner”,"
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-government-faces-first-council-tax-rebellion",
        "title": "Scottish government faces first council tax rebellion",
        "description": "COUNCILLORS in Argyll and Bute have become the first to defy the SNP-Green Scottish government’s council tax freeze. The rural council, led by a coalition of Liberal Democrat, T"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-mps-michael-martin-environmental-audit-committee-speaker-b2501514.html",
        "title": "More than 70 MPs sign motion urging Speaker to quit over Gaza vote",
        "description": "More than 70 MPs have now signed a motion expressing no confidence in the Speaker after angry scenes in the Commons on Wednesday. Senior Conservatives and Scottish National Party MPs have put their names to the “early day motion” proposed by senior Tory William Wragg in a move intended to pressure the Speaker, Sir Lindsay Hoyle, to step down."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155291/byelection-candidates-tell-us-how-they-would-help-rochdale-constituents",
        "title": "By-election candidates tell us how they would help Rochdale constituents",
        "description": "Rochdale has found itself at the centre of a national political storm. What was expected to be a straightforward by-election for Labour has turned into one of the strangest and most chaotic in recent memory."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/national/24132741.snp-heaps-pressure-labour-calling-commitment-28bn-green-spending/",
        "title": "SNP heaps pressure on Labour by calling for commitment to £28bn <b>green</b> spending",
        "description": "The SNP at Westminster accused the Tories and Labour of blocking ‘Scotland’s entry to the green renewables goldrush’."
    },
    {
        "url": "https://www.politico.eu/article/hungary-nato-sweden-viktor-orban-ulf-kristersson/",
        "title": "Stroking the ego: Hungary’s Orbán gives his nod to Sweden’s NATO bid",
        "description": "Hungary&#39;s Prime Minister Viktor Orbán kept Sweden&#39;s bid to join NATO in the deep freeze for a long, long time. It took a final climbdown by Swedish PM Ulf Kristersson, plus some jet fighters, to thaw the Hungarian leader."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13118117/Border-spike-Chinese-migrants-Republican-military-men-spies-war-Taiwan.html",
        "title": "Border has seen a 7,000% spike in Chinese migrants since 2021: Top Republican warns of &#39;military-age men&#39; and spies entering US who would wreak havoc in any war over Taiwan",
        "description": "On X/Twitter, <b>Green</b> has said they include large numbers of &#39;military age men,&#39; and that &#39;no doubt some have ties to&#39; the Chinese Communist <b>Party</b> and the country&#39;s armed forces, the People&#39;s Liberation Army. &#39;I&#39;m not suggesting that China is going to be ..."
    },
    {
        "url": "https://www.itv.com/news/granada/2024-02-23/labours-antisemitism-problem-is-a-million-miles-from-where-it-was",
        "title": "Granada Debate: Labour&#39;s antisemitism problem is &#39;a million miles&#39; from where it was, MP says",
        "description": "Labour&#39;s antisemitism problem is &quot;a million miles&quot; from where it was but everybody has a &quot;responsibility&quot; to ensure it does not become mainstream, an MP says. | ITV News Granada"
    },
    {
        "url": "https://www.meltontimes.co.uk/arts-and-culture/save-the-date-for-the-big-lunch-on-1-2-june-set-to-be-the-greenest-yet-4531314",
        "title": "Save the date for The Big Lunch on 1 - 2 June set to be the greenest yet",
        "description": "Eden Project Communities is launching The Big Lunch 2024 with brand new resources packed with ideas to get the party started and make this year’s Big Lunch the greenest yet!"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13117989/Lefty-anarchist-guilty-preparing-acts-terrorism-kill-politicians.html",
        "title": "Lefty anarchist who idolised the Unabomber guilty of preparing acts of terrorism after compiling and sharing a bomb-making manual, after boasting he wanted to kill over 50 ...",
        "description": "He said his ideal government would be the size of &#39;Merseyside or Liverpool&#39;, while also telling how he supported the <b>Green Party</b> and was an &#39;environmentalist&#39; who did not like the way &#39;corporations act and how they damage the earth.&#39; Graham said at his ..."
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24140003.acting-labour-leader-revealed-following-suspension-azhar-ali/",
        "title": "Acting Labour leader revealed following the suspension of Azhar Ali",
        "description": "The national <b>party</b> initially rebuked County Cllr Ali – who apologised ... they allowed… that massacre that gives them the <b>green</b> light to do whatever they bloody want.” County Cllr Ali, who represents the Nelson East division on the county council ..."
    },
    {
        "url": "https://news.sky.com/story/left-wing-anarchist-guilty-of-terror-offences-after-declaring-he-wanted-to-kill-mps-13072775?dcmp=snt-sf-twitter",
        "title": "Left-wing anarchist guilty of terror offences after declaring he wanted to kill MPs",
        "description": "His ideal government would be the size of &quot;Merseyside or Liverpool&quot;, he said, adding that he supported the <b>Green Party</b> and was an &quot;environmentalist&quot; who did not like the way that &quot;corporations act and how they damage the Earth.&quot; &quot;I think it is fair to say ..."
    },
    {
        "url": "https://news.sky.com/story/left-wing-anarchist-guilty-of-terror-offences-after-declaring-he-wanted-to-kill-mps-13072775",
        "title": "Left-wing anarchist guilty of terror offences after declaring he wanted to kill at least 50 people",
        "description": "His ideal government would be the size of &quot;Merseyside or Liverpool&quot;, he said, adding that he supported the <b>Green Party</b> and was an &quot;environmentalist&quot; who did not like the way that &quot;corporations act and how they damage the Earth.&quot; &quot;I think it is fair to say ..."
    },
    {
        "url": "https://uk.news.yahoo.com/europe-risks-paralysis-far-gains-115227919.html",
        "title": "Europe Risks Paralysis If Far Right Gains, <b>Party</b> Leader Warns",
        "description": "Their gain will likely come at the expense of socialists and <b>green</b> parties in the assembly ... according to a recent poll of polls by Europe Elects. The <b>party</b> has nominated fellow <b>party</b> member Ursula von der Leyen for a second term as president of the ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/belfast-news/police-investigating-sectarian-sticker-electric-28694611",
        "title": "Police investigating &#39;sectarian sticker&#39; on electric box in East Belfast as a hate incident",
        "description": "No other stickers have been located at this time. <b>Green Party</b> Councillor Anthony Flynn told Belfast Live: &quot;I want to condemn these vile sectarian stickers that have appeared in the area. East Belfast is a welcoming and diverse place with people from many ..."
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/nottingham-city-council-crisis-calls-9120112",
        "title": "Nottingham City Council crisis: Calls for councillors to resign over &#39;shambles&#39; as commissioners come in",
        "description": "This is a fact. Oh there is the mouldy decaying concrete bombsite called Broadmarsh...a dystopian vision of what Britain would be like if the <b>Green party</b> ruled it&quot; Pragmatictel said: &quot;Whoever was responsible for the financial mess in Nottingham I hope you ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/whats-on/west-brewery-throw-special-leap-28691020",
        "title": "WEST Brewery to throw special Leap Year Birthday for anyone turning &#39;18&#39; on February 29th",
        "description": "Set to celebrate its own 18th birthday <b>party</b> this year, WEST Brewery is looking for someone ... bar and restaurant based in a former carpet factory on Glasgow <b>Green</b> has become a Glasgow destination. Now managing director Matt Munro hopes they can give ..."
    },
    {
        "url": "https://www.malaymail.com/news/world/2024/02/24/german-parliament-votes-to-legalise-recreational-cannabis/119702",
        "title": "German parliament votes to legalise recreational cannabis",
        "description": "The German parliament voted yesterday to legalise the possession and controlled cultivation of cannabis starting in April, despite fierce objections from"
    },
    {
        "url": "https://radiojamaicanewsonline.com/local/jlp-and-pnp-still-locked-in-statistical-dead-heat-days-before-election",
        "title": "JLP and PNP still locked in statistical dead heat days before election",
        "description": "&quot;Tradition has been stronger for the People&#39;s National Party than it has been for the Jamaica Labour Party. Males are going to support PNP more, and more females are going to support Jamaica Labour Party. In the 25 to 34 age group, it is basically evenly split between the Jamaica Labour Party and the People&#39;s National Party,&quot; Mr. Anderson noted."
    },
    {
        "url": "https://mexiconewsdaily.com/politics/mexico-presidential-election-sheinbaum-lead/",
        "title": "As Mexico’s presidential election approaches, Sheinbaum holds a commanding lead",
        "description": "Claudia Sheinbaum retains a commanding lead over Xóchitl Gálvez in the race for the 2024 Mexican presidential election, a new poll shows."
    },
    {
        "url": "https://www.nytimes.com/2024/02/23/world/europe/sweden-hungary-nato.html",
        "title": "Orban Gives <b>Green</b> Light to Sweden’s NATO Bid",
        "description": "Viktor Orban, the Hungarian prime minister, said after a meeting with Sweden’s leader, and a deal for more fighter jets, that the two countries are “ready to fight for each other.”"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13118737/Tucson-Samaritans-hold-open-border-migrants-crossing.html",
        "title": "Volunteer from Tucson Samaritans is seen holding open hole in border fence and encouraging migrants to walk through as Republicans demand probe into the NGOs &#39;facilitating the ...",
        "description": "Republican rep Tom Tiffany said volunteers from Tucson Samaritans and Green Valley-Sahuarita Samaritans are &#39;aiding illegal immigration&#39;."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/23/bethnal-green-residents-shamima-begum-uk-citizenship/",
        "title": "‘We would welcome her back’: Bethnal <b>Green</b> residents say Shamima Begum was made scapegoat",
        "description": "Mosque volunteer says runaway IS bride should be &#39;given a second chance&#39; after losing appeal against the removal of her British citizenship"
    },
    {
        "url": "https://www.carolinacoastonline.com/regional/article_6196e86a-d288-11ee-8c56-a3b8b12e75b1.html",
        "title": "RFK Jr. and allies challenge two-<b>party</b> system in North Carolina elections",
        "description": "Robert F. Kennedy, Jr. is still campaigning for president in the 2024 election, but he’s now running under the We The People political party in North Carolina, a move that"
    },
    {
        "url": "https://news.sky.com/story/inside-the-ticking-time-bomb-camp-where-shamima-begum-was-held-13078932",
        "title": "Inside the &#39;ticking time bomb&#39; camp where Shamima Begum was held",
        "description": "The woman who ran away to join IS when she was just 15 is among the tens of thousands of people who human rights groups have long argued are being arbitrarily detained in the camps, without trial and in dangerous conditions."
    },
    {
        "url": "https://www.indiatoday.in/india/andhra-pradesh/story/jagan-reddy-government-siphoned-rs-50000-crore-sand-revenues-illegal-mining-tdp-pattabhi-kommareddy-2506364-2024-02-23",
        "title": "Andhra government siphoned off Rs 50,000 crore in illegal mining: Telugu Desam <b>Party</b>",
        "description": "Telugu Desam Party leader Pattabhi Ram Kommareddy said the Andhra Pradesh government under Chief Minister Jagan Mohan Reddy is involved in illegal mining happening in the state."
    },
    {
        "url": "https://www.desmog.com/2024/02/23/scientists-condemn-last-minute-push-to-overturn-eu-nature-law/",
        "title": "Scientists Condemn Last Minute Push to Overturn EU Nature Law",
        "description": "At the eleventh hour, right-wing politicians have launched a bid to block the passing of the EU’s flagship nature protection law, which scientists have described as a “cornerstone of food security and human health”."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24140805.rishi-sunak-speaks-welsh-conservative-conference-2024/",
        "title": "Rishi Sunak speaks at Welsh Conservative conference 2024",
        "description": "Mr Sunak spoke at Venue Cymru to a well-attended hall of Conservative members. The prime minister flew to Wales by plane, Downing Street said. Mr Sunak was introduced to the stage by David TC Davies, the secretary of state for Wales."
    },
    {
        "url": "https://www.taipeitimes.com/News/taiwan/archives/2024/02/24/2003814008",
        "title": "72 DPP, KMT lawmakers establish joint US caucus",
        "description": "The Democratic Progressive Party (DPP) and the Chinese Nationalist Party (KMT) were planning to establish separate US caucuses, but agreed to merge them into one after a week of negotiations, DPP Legislator Wang Ting-yu (王定宇) told reporters."
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/02/liz-truss-is-lost-in-her-own-contradictions",
        "title": "Revealed: the Tory peer linked to £3.8bn in government contracts",
        "description": "The former prime minister’s embrace of the Trumpian right is at odds with her traditional economic liberalism."
    },
    {
        "url": "https://www.independent.ie/regionals/carlow/news/145m-for-carlow-and-kilkenny-for-national-roads-active-travel-and-greenways/a2098933186.html",
        "title": "€14.5m for Carlow and Kilkenny for national roads, Active Travel and Greenways",
        "description": "Over €14.5m is headed to Carlow and Kilkenny this year for the improvement and maintenance of national roads and the design of greenways."
    },
    {
        "url": "https://madison.com/news/state-regional/government-politics/wisconsin-redistricting-maps/article_8f122a58-d002-11ee-b934-1b1308b2b471.html",
        "title": "Here are the 10 most competitive districts under Wisconsin&#39;s new legislative maps",
        "description": "Including much of <b>Green</b> Bay and Ashwaubenon ... Steve Doyle, R-Onalaska, who has sometimes bucked his <b>party</b> to vote with Republicans. Doyle stays in the district under Evers&#39; maps. Another one of the more viable seats that Democrats could flip, the ..."
    },
    {
        "url": "https://www.derbyshiretimes.co.uk/news/politics/council/power-to-the-people-councillors-agreed-to-rethink-plans-to-sell-off-derbyshire-green-space-for-development-4531305",
        "title": "“Power to the people” - councillors agreed to rethink plans to sell off Derbyshire <b>green</b> space for development",
        "description": "Power to the people” a campaigner exclaimed as councillors agreed to rethink plans to sell off part of a would-be nature reserve for potential development."
    },
    {
        "url": "https://www.euractiv.com/section/economy-jobs/news/rethinking-the-german-model-means-letting-go/",
        "title": "Rethinking the German model means letting go",
        "description": "Among other problems, Germany is plagued with severe labour shortages that will only get worse as ‘baby boomers’ retire. Still, politicians think they need to preserve jobs in industries where Germany is clearly uncompetitive,"
    },
    {
        "url": "https://www.heraldscotland.com/news/24140108.snp-lose-borders-council-by-election-conservatives/",
        "title": "SNP lose Borders council by-election to Conservatives",
        "description": "The <b>party</b> saw its share of the vote rise by 8.2% on the 2022 council election result, while the SNP’s vote share dropped by 5.7%. Mr Bathgate polled almost 1,000 first preference votes more than his SNP rival - Phil Dixon. But less than a third of the ..."
    },
    {
        "url": "https://nypost.com/2024/02/23/us-news/more-chinese-migrants-now-crossing-san-diego-border-than-mexicans-report/",
        "title": "More Chinese migrants now crossing San Diego border than Mexican nationals: report",
        "description": "The number of Chinese nationals crossing the southern border near San Diego has exceeded the number of Mexicans doing the same, new Customs and Border Protection data shows."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24139452.city-york-council-sets-budget-including-council-tax-hike/",
        "title": "City of York Council sets budget including council tax hike",
        "description": "The City of York Council’s budget for 2024/25 is approximately £150 million, but it has now saved around £14 million – £4 million of which in adult and children’s social care. Labour has blamed inadequate government funding and the exhaustion of reserves by previous administrations for the cuts."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24132741.snp-heaps-pressure-labour-calling-commitment-28bn-green-spending/",
        "title": "SNP heaps pressure on Labour by calling for commitment to £28bn <b>green</b> spending",
        "description": "The SNP at Westminster accused the Tories and Labour of blocking ‘Scotland’s entry to the green renewables goldrush’."
    },
    {
        "url": "https://ca.news.yahoo.com/energy-bills-labour-conservatives-proposing-105327610.html",
        "title": "Energy bills: How are Labour and Conservatives proposing to help households?",
        "description": "In October, the government’s Energy Act also received royal assent, which the government says incentivises the energy industry to invest in low-carbon heat pumps, and includes powers to deliver a planned smart meter rollout by 2028, which ministers claim could save households £5.6bn."
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/green-msp-speaks-out-against-fergus-ewing-at-aviemore-343084/",
        "title": "Highland MSP champions housing, not golf courses",
        "description": "Highland Green MSP Ariane Burgess had some advice at Aviemore yesterday for fellow local MSP Fergus Ewing (SNP): build houses here, not golf courses for American billionaires."
    },
    {
        "url": "https://www.inquirer.com/politics/election/petition-pennsylvania-democrat-challenge-pinsley-king-20240223.html",
        "title": "Two Pa. Democratic campaigns face allegations of forgeries on petitions ahead of primary",
        "description": "Democratic candidates Allen King and Mark Pinsley face questions over whether their campaign petitions include forgeries. The Chester County District Attorney&#39;s Office is investigating one case."
    },
    {
        "url": "https://guyanachronicle.com/2024/02/23/narrow-small-minded-games/",
        "title": "‘Narrow, small-minded games’",
        "description": "In a fervent response to Green’s remarks, President Ali outlined the People’s Progressive Party/Civic (PPP/C) administration&#39;s efforts to bridge historical"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/left-wing-anarchist-guilty-of-terror-offences-after-declaring-he-wanted-to-kill-mps/",
        "title": "Left-wing anarchist guilty of terror offences after declaring he wanted to kill MPs",
        "description": "A left-wing anarchist has been found guilty of preparing acts of terrorism by compiling and sharing a bomb-making manual, after declaring that he wanted to kill at least 50 politicians."
    },
    {
        "url": "https://www.businessgreen.com/news/4177879/worried-about-timescales-slipping-mps-warn-looming-election-risks-derailing-government-green-policies",
        "title": "&#39;We are worried about timescales slipping&#39;: MPs warn looming election risks derailing government <b>green</b> policies",
        "description": "Environmental Audit Committee says government could run out of Parliamentary time for several key, delayed pieces of net zero policy ahead of general election"
    },
    {
        "url": "https://ca.news.yahoo.com/affordability-housing-top-issues-many-090000206.html",
        "title": "Affordability and housing top issues for many as Durham residents prepare to vote in byelection",
        "description": "Affordability and housing are big issues for many in Durham Region as residents prepare for a federal byelection.The byelection was declared earlier this year to fill a seat left vacant by former Conservative leader Erin O&#39;Toole,"
    },
    {
        "url": "https://westbridgfordwire.com/clifton-campaign-to-change-traffic-route-as-265-home-village-approved/",
        "title": "Clifton campaign to change traffic route as 265-home ‘village’ approved",
        "description": "Campaigners in Clifton say they will “keep trying” to convince a developer to change a route for construction vehicles after a new 265-home project was given"
    },
    {
        "url": "https://www.placenorthwest.co.uk/tory-mps-call-on-gove-to-intervene-on-blackburn-local-plan/",
        "title": "Tory MP’s call on Gove to intervene on Blackburn local plan",
        "description": "Sir Jake Berry and Sara Britcliffe are bidding to block the redevelopment of a 48-acre Issa Brothers site off J5 of the M65 until concerns about the “most dangerous road in Lancashire” are addressed."
    },
    {
        "url": "https://www.echo-news.co.uk/news/24138337.basildon-council-debenhams-health-centre-plans-approved/",
        "title": "Basildon Council: Debenhams health centre plans approved",
        "description": "Now, the council is confident it will help create booming trade in the town centre alongside Basildon’s new cinema and plans to create hundreds"
    },
    {
        "url": "https://www.spectator.com.au/2024/02/germanys-new-anti-ukraine-party-unnerving-the-establishment/",
        "title": "Germany’s new anti-Ukraine <b>party</b> unnerving the establishment",
        "description": "Her party may be less than two months old, but already Sahra Wagenknecht has put a cat amongst the pigeons in Germany. She launched her eponymous party, the Bündnis Sahra Wagenknecht (BSW) on"
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24138858.two-men-guilty-murder-21-year-old-outside-wembley-club/",
        "title": "Two men guilty of murder of 21-year-old outside Wembley club",
        "description": "Two men have been found guilty of murder after a 21-year-old was stabbed to death after a row at a Wembley nightclub’s Halloween party in"
    },
    {
        "url": "https://www.foxnews.com/media/chicago-resident-defends-texas-gov-abbott-migrant-influx-shell-vote-republican-first-time",
        "title": "Chicago resident defends Texas Gov. Abbott over migrant influx, says she&#39;ll vote Republican for first time",
        "description": "Chicago native Cata Truss echoes the outrage from other residents over state and local officials&#39; handling of the migrant crisis on &#39;The Faulkner Focus.&#39;"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-york-north-yorkshire-68377266",
        "title": "York council taxpayers to see near-5% rise as budget approved",
        "description": "Council tax bills in York will go up by nearly 5% from April, the city council has confirmed. The increase, including 2% for social care, was signed off at Thursday&#39;s full meeting of City of York Council. It came as the Labour-run council&#39;s budget for the next financial year, including a package of cuts worth £14m, was approved."
    },
    {
        "url": "https://www.thelocal.dk/20240223/today-in-denmark-a-roundup-of-the-news-on-friday-114",
        "title": "Today in Denmark: A roundup of the news on Friday",
        "description": "Bilateral deal with India announced, Storm Rolf shakes up Denmark, decision date scheduled for future of far-right party and more news from Denmark on Friday."
    },
    {
        "url": "https://www.washingtonexaminer.com/premium/2844382/germany-falling-europes-problems-become-americas-problems/",
        "title": "Germany falling: Europe’s problems become America’s problems",
        "description": "Germany struggles to lead Europe, and Europe leads no one. Germany depends on the U.S. for its energy security and military defense."
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/24138184.1-000-new-trees-planted-ipswich-loves-trees-week/",
        "title": "1,000 new trees planted in &quot;Ipswich Loves Trees Week&quot;",
        "description": "Last week was ‘Ipswich Loves Trees Week and Martha the dog and I went to Bonny Crescent, Ravenswood, to get our hands - and paws - dirty. 1,000 trees were being planted by the dedicated Parks team supported by a brilliant band of volunteers - Martha ‘helpfully’ did much of the digging!"
    },
    {
        "url": "https://www.leitrimobserver.ie/news/home/1430867/green-party-candidate-adam-o-ceallaigh-discusses-broadband-for-leitrim-with-minister-ossian-smyth.html",
        "title": "<b>Green Party</b> candidate Adam Ó Ceallaigh discusses broadband for Leitrim with Minister Ossian Smyth",
        "description": "Adam Ó Ceallaigh, the <b>Green Party</b> candidate for the Ballinamore Local Electoral Area (LEA), engaged in a meeting on Monday, February 19, with Minister of State Ossian Smyth at Leinster House in Dublin. Minister Smyth, is responsible for Public Procurement ..."
    },
    {
        "url": "https://www.standard.co.uk/showbiz/celebrity-news/media-public-accounts-committee-green-party-government-ireland-b1141016.html",
        "title": "Minister wants urgent meeting with RTE chair after claims she was ‘misinformed’",
        "description": "The <b>Green Party</b> minister told the network on Thursday evening she wanted to check this information one more time on Wednesday. “(I found) out this morning that it was the incorrect information, that it was indeed approved by the remuneration committee in ..."
    }
]