[
    {
        "url": "https://www.theguardian.com/business/2024/feb/15/labour-urged-to-double-funding-in-publicly-owned-renewables?ref=biztoc.com",
        "title": "Labour urged to double funding in publicly owned renewables",
        "description": "In an intervention after the Labour leader scrapped the <b>party</b>’s £28bn <b>green</b> investment pledge in the most controversial U-turn of his leadership, the Common Wealth thinktank said a step-change in government backing for clean energy generation was still ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-faces-electoral-tests-risk-000100344.html",
        "title": "Sunak Faces Electoral Tests That Risk Encouraging Tory Plotters",
        "description": "Even so, Labour has not enjoyed an ideal buildup to the vote. A U-turn on Starmer’s flagship <b>green</b> spending pledge has angered those in the <b>party</b> who want Labour to lead the fight against climate change. Meanwhile in Rochdale, where a special election is ..."
    },
    {
        "url": "https://www.businessgreen.com/news/4174279/study-labours-clean-energy-plans-save-gbp1bn-interest-payments",
        "title": "Study: Labour&#39;s clean energy plans could save up to £1bn on interest payments alone",
        "description": "Energy transition will be slower, costlier, and less secure without major public investment in renewables, think tank Common Wealth argues"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/national/24120915.explosion-hatred-all-time-high-antisemitism-recorded-jewish-charity/",
        "title": "‘Explosion in hatred’ as all-time high antisemitism recorded by Jewish charity",
        "description": "For the first time ever, the Community Security Trust recorded at least one antisemitic incident in every single police region in the UK."
    },
    {
        "url": "https://www.thetimes.co.uk/article/elizabeth-mcglone-on-her-career-and-representing-greens-ex-deputy-over-trans-views-bcg29xkt2",
        "title": "Elizabeth McGlone on her career and representing Greens ex-deputy over trans views",
        "description": "Elizabeth McGlone, a partner at Didlaw, successfully represented Shahrar Ali, the former deputy leader of the Green Party. A county court found that he was improperly dismissed during a row over his"
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/15/labour-urged-to-double-funding-in-publicly-owned-renewables",
        "title": "Labour urged to double funding in publicly owned renewables",
        "description": "Cash injection in Great British Energy should be increased to £30bn, thinktank says after Keir Starmer U-turn"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13085085/Keir-Starmer-told-backbone-Grant-Shapps-urges-reveal-Rochdale-meeting.html",
        "title": "Keir Starmer is told to &#39;get a backbone&#39; by Grant Shapps who urges him to reveal who was at THAT Rochdale meeting",
        "description": "Sir Keir Starmer was told last night to &#39;get a backbone&#39; and come clean over who attended the Rochdale meeting where vile anti-Semitic remarks went seemingly unchallenged."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/14/tories-target-labour-keir-starmer-sutra-valentines-attack/",
        "title": "Tories target Labour with ‘Starmer Sutra’ Valentine’s attack ad",
        "description": "Mocking the Labour leader’s changing stances, the Conservatives&#39; ad follows Labour&#39;s about-turn on its green investment plan"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-80-seats-general-election-poll-2906688",
        "title": "Tories face being reduced to 80 seats, poll of 18,000 voters suggests",
        "description": "Cabinet ministers are predicted to lose their seats in total in what would mark the worst Conservative wipeout in history"
    },
    {
        "url": "https://www.thesun.co.uk/news/25947074/keir-starme-azhar-ali-labour-anti-semitism/",
        "title": "Sir Keir Starmer’s dithering over Azhar Ali’s racist lies mires the Labour <b>Party</b> in deeply shocking anti-Semitism",
        "description": "Silent on hate HATRED towards Jews is now at record levels in Britain. That the party aiming to lead our multicultural country should remain mired in anti-Semitism is deeply shocking. Yet that is"
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-urged-to-suspend-labour-members-who-attended-meeting-at-centre-of-antisemitism-row-13071708",
        "title": "Sir Keir Starmer urged to suspend Labour members who attended meeting at centre of antisemitism row",
        "description": "Mike Katz of the Jewish Labour Movement criticises those who failed to &quot;call out&quot; comments about Israel at a meeting."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/labour-party-pledges-manifesto-general-election-voters/",
        "title": "Labour <b>Party</b> manifesto 2024: Keir Starmer’s likely election promises",
        "description": "However, the <b>party</b> has explored closing a loophole for second homeowners. Bid for highest sustained growth in G7 Tough new fiscal rules and enhanced role for the Office for Budget Responsibility (OBR) New Office for Value for Money Invest heavily in <b>green</b> ..."
    },
    {
        "url": "https://www.ft.com/content/32149d15-793c-4a0c-8ebc-862ca7f0a3c8",
        "title": "Weak UK growth a potential pre-election boon for Labour",
        "description": "UK Prime Minister Rishi Sunak will learn on Thursday if Britain tipped into a technical recession at the end of last year, a statistical nicety that could hand Labour a valuable propaganda weapon ahead of an election."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/administration-budget-will-help-poor-and-homeless-and-the-roads/",
        "title": "Administration budget will help poor and homeless – and the roads",
        "description": "The Labour Group’s starting points in their 2022 manifesto of eradicating poverty and dealing with homelessness are priorities in their 2024/25 budget proposals. But more money will also be"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/wellingborough-kingswood-byelections-peter-bone-results-b2496002.html",
        "title": "By-elections - LIVE: Peter Bone’s girlfriend aims for Wellingborough seat as Kingswood faces axe",
        "description": "Helen Harrison is running for the Conservative Party in Wellingborough, after her disgraced partner Peter Bone lost the seat in a recall petition having been suspended over bullying and sexual misconduct claims he denies."
    },
    {
        "url": "https://nottstv.com/programme/team-talk-wednesday-14th-february/",
        "title": "Team Talk, Wednesday 14th February",
        "description": "‘I take responsibility for Robin Hood Energy’ says former Nottingham City Council leader Jon Collins Former Nottingham council leader says new Broadmarsh plans are ‘undeliverable’ Green Party candidate for East Midlands mayor pledges to represent communities ‘as honestly as possible’ Nottingham councillors refuse to back ‘devastating’ budget cuts amid £53m gap Mansfield business park approved despite fears over HGVs and sizes of warehouses"
    },
    {
        "url": "https://www.thenational.scot/news/24120096.general-election-watch-uncertainty-election-certainty/",
        "title": "General Election Watch: Uncertainty is the only election certainty",
        "description": "Welcome to the first edition of General Election Watch. This week we look at what we know so far as the race to get keys to Downing Street underway."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/14/starmer-facing-test-of-authority-as-immediate-gaza-ceasefire-vote-looms",
        "title": "Starmer facing test of authority as ‘immediate’ Gaza ceasefire vote looms",
        "description": "Labour leader already under fire over handling of two candidates who made derogatory remarks about Israel"
    },
    {
        "url": "https://www.thenational.scot/politics/24120766.anas-sarwar-offers-nothing-contempt-independence-supporters/",
        "title": "Anas Sarwar offers nothing but contempt to independence supporters",
        "description": "LAST night on STV, Labour&#39;s Scottish branch manager Anas Sarwar was finally grilled on what he is actually offering"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/green-bin-increase-further-burden-28634095",
        "title": "<b>Green</b> bin increase is &#39;further burden&#39; to &#39;struggling&#39; people",
        "description": "Cllr Alan Gibbons was one of a number of ex-Labour members who broke away from the ruling group over the policy and now leads the Liverpool Community Independents. He said the increased rate would add further pressure to household finances."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68285297",
        "title": "What next for the Rochdale by-election?",
        "description": "When the Rochdale by-election was called following the death of the town&#39;s MP Sir Tony Lloyd, it was clear there would be an eventful few weeks ahead. But who could have predicted the twists and turns we&#39;ve seen so far?"
    },
    {
        "url": "https://www.belfastlive.co.uk/news/belfast-news/new-belfast-city-centre-hotel-28634375",
        "title": "New Belfast City Centre hotel at site of old police station approved despite &quot;deep concern&quot; from the Greens and Alliance",
        "description": "Council&#39;s own conservation advice says the proposal would result in “substantial harm” to the character and appearance of the area."
    },
    {
        "url": "https://www.swlondoner.co.uk/news/14022024-london-mayoral-candidates-2024",
        "title": "Who are the candidates for the 2024 London Mayoral election?",
        "description": "London Mayoral Elections are in less than three months and here&#39;s our guide to who&#39;s running for the office of Mayor when the ballet boxes open on May 2nd 2024:"
    },
    {
        "url": "https://morningstaronline.co.uk/article/labour-lead-plummets-candidates-suspended",
        "title": "Labour lead plummets as candidates suspended",
        "description": "Mr Ali was eventually suspended, although he remains on the ballot paper, after prolonged vacillation by the leadership. He was recorded at a meeting in Lancashire last year spreading conspiracy theories and making anti-semitic remarks."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/strange-kingswood-election-campaign-featuring-9100552",
        "title": "The strange Kingswood by-election campaign featuring London buses and school days",
        "description": "The Kingswood by-election has seen the enthusiasm of campaigners and politicians not totally matched by residents of Kingswood, Hanham, Emersons Green, Cadbury Heath, Staple Hill and New Cheltenham, and turnout is not expected to be particularly high by the time polls close at 10pm on Thursday."
    },
    {
        "url": "https://www.mancunianmatters.co.uk/news/14022024-explainer-what-has-happened-to-labour-in-rochdale/",
        "title": "Explainer: What has happened to Labour in Rochdale?",
        "description": "The Labour Party is in crisis over the Rochdale by-election. Their candidate, Lancashire County Council leader Azhar Ali, has been"
    },
    {
        "url": "https://www.heraldscotland.com/news/24119957.keir-starmer-can-inspire-scottish-labour-voters---anas-sarwar/",
        "title": "Keir Starmer can inspire Scottish Labour voters - Anas Sarwar",
        "description": "Scottish Labour leader Anas Sarwar has said he believes Sir Keir Starmer is capable of inspiring voters north of the border to elect a"
    },
    {
        "url": "https://uk.news.yahoo.com/bombshell-poll-shows-rishi-sunak-201426360.html",
        "title": "Bombshell poll shows Rishi Sunak on course to hold just 80 Tory seats",
        "description": "The Liberal Democrats and <b>Green Party</b> are also set to make gains, while the poll suggested the SNP could lose eight seats to a resurgent Scottish Labour. The poll will offer some much-needed comfort for Sir Keir after he faced two of the most difficult ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68295796.amp",
        "title": "Analysis: Tough week tests Keir Starmer&#39;s leadership",
        "description": "There are parallels with the <b>party</b>&#39;s announcement last week that it was dropping the £28bn price tag on its programme of <b>green</b> investment. Uncertainty had been swirling for weeks before the decision eventually came. Critics of Sir Keir point to a national ..."
    }
]