[
    {
        "url": "https://www.devdiscourse.com/article/politics/2791229-centre-right-stubb-leads-finland-presidential-election-first-round",
        "title": "Centre-right Stubb leads Finland presidential election first round",
        "description": "Centre-right candidate Alexander Stubb of Finland&#39;s National Coalition <b>Party</b> led the first round of the country&#39;s presidential election on Sunday, with 28.3% support from advance ballots, justice ministry data showed as polls closed. The liberal <b>Green</b> ..."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/28/making-karachi-a-sustainable-city-still-a-distant-dream-shakoor/",
        "title": "Making Karachi a sustainable city still a distant dream: Shakoor",
        "description": "KARACHI: Despite having an Ideal location, good industrial base and a large educated workforce, making Karachi a sustainable city is still a distant dream, mainly due to lack of vision and commitment"
    },
    {
        "url": "https://inews.co.uk/news/politics/wealth-tax-labour-public-services-neil-kinnock-2877272?ico=related_article_inline",
        "title": "Wealth tax could be imposed by Labour to boost public services, says Neil Kinnock",
        "description": "“The purpose, the policy, the <b>green</b> transition – that is rooted and nailed in ... Thatcher at the despatch box and took on the left-wing Militant faction in his <b>party</b>. He was vice-president of the European Commission from 1999 to 2004."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13016193/Now-woke-Sussex-councillors-want-twin-historic-Hastings-war-torn-Gazas-Al-Mawasi-community.html",
        "title": "Now woke Sussex councillors want to twin historic Hastings with... war-torn Gaza&#39;s Al-Mawasi community",
        "description": "Asked by a fellow councillor about the &#39;strong local connection&#39; between Hastings and Al-Mawasi&#39; and what the council intended to do to show &#39;solidarity and support&#39;, The <b>Green Party</b> politician replied that twinning was an &#39;excellent idea&#39; but admitted she ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/cw0rjqyyegko",
        "title": "Councillors reject &#39;only focus on borough&#39; motion",
        "description": "Conservative Scott Durham tabled the motion at Darlington Borough Council after <b>Green Party</b> councillors urged opposition members to join its plea for a ceasefire in Gaza at a meeting in December. Mr Durham&#39;s motion said councillors were elected to &quot;focus ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-live-putin-nuclear-threat-uk-b2486136.html",
        "title": "Ukraine-Russia war - live: Kyiv ‘uncovers mass weapons fraud worth £32m’",
        "description": "Ukraine’s security services says five people have been charged, with one person detained while trying to cross the Ukrainian border"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/your-views-greens-blamed-for-highland-road-delays-20mph-li-340347/",
        "title": "YOUR VIEWS: Greens blamed for Highland road delays, 20mph limits and cold weather help",
        "description": "Greens holding back roads work Forget about the dualling of the A9 or the A96, they are not going to happen in the next 10 years and if the <b>Green Party</b> keep having their say then they will probably never get completely dualled. It’s what is happening on ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/labour-downing-street-starmer-brown-blair?ref=mc.news",
        "title": "Thinking small may get Labour into No 10. It could also stop it from staying there",
        "description": "To cap it all, after months of briefings about its possible demise, the <b>party</b>’s plan to spend £28bn a year on <b>green</b> investment may well be even further diluted and delayed. The leadership’s deep conviction is that this approach is the only way they ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/labour-s-28bn-green-investment-pledge-remains-level-of-ambition-reynolds-98647/",
        "title": "Labour’s £28bn <b>green</b> investment pledge remains ‘level of ambition’ – Reynolds",
        "description": "Labour had promised to invest £28 billion a year until 2030 in <b>green</b> projects if it came to power. However, <b>party</b> leader Sir Keir Starmer previously hinted he could scale down the investment given the financial picture he would inherit if he becomes prime ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labours-28bn-green-pledge-still-120000926.html",
        "title": "Labour&#39;s £28bn <b>green</b> pledge still the &#39;level of ambition&#39;, says shadow business secretary",
        "description": "Former shadow chancellor Ed Balls predicted this weekend that the Labour leader would ditch the <b>green</b> pledge, arguing the <b>party</b> should perform a &quot;big U-turn&quot; to halt Tory attacks, including Mr Sunak&#39;s claim that the spending commitment amounted to a &quot;tax ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/germanys-new-left-wing-party-calls-end-war-ukraine",
        "title": "Germany’s new left wing <b>party</b> calls for an end to the war in Ukraine",
        "description": "The <b>party</b>’s programme for June’s European Parliament elections says that the bloc is mired in the “regulatory frenzy of the EU technocracy.” Ms Wagenknecht blasted the governing SPD-<b>Green</b>-liberal coalition as the “stupidest government in Europe ..."
    },
    {
        "url": "https://www.palatinate.org.uk/north-east-mayoral-elections-register-to-vote-and-save-the-date/",
        "title": "North East mayoral elections: register to vote and save the date!",
        "description": "Andrew Gray, a <b>Green Party</b> candidate, now works as an archivist at Durham University. He stated that his top objective as mayor would be to remodel the houses to make them warmer and cheaper to heat. He also stated that he intends to improve public ..."
    },
    {
        "url": "https://news.sky.com/story/labours-28bn-green-pledge-still-the-level-of-ambition-says-shadow-business-secretary-13058508",
        "title": "Labour&#39;s £28bn <b>green</b> pledge still the &#39;level of ambition&#39;, says shadow business secretary",
        "description": "Former shadow chancellor Ed Balls predicted this weekend that the Labour leader would ditch the <b>green</b> pledge, arguing the <b>party</b> should perform a &quot;big U-turn&quot; to halt Tory attacks, including Mr Sunak&#39;s claim that the spending commitment amounted to a &quot;tax ..."
    },
    {
        "url": "https://www.nysun.com/article/oklahoma-republicans-wheel-on-senator-lankford-for-shepherding-immigration-reform-deal",
        "title": "Oklahoma Republicans Wheel on Senator Lankford for Shepherding Immigration Reform Deal",
        "description": "Some state <b>party</b> committee members say the vote was not legitimate because ... and an increase in the number of <b>green</b> cards issued by 50,000 a year. The deal would also restrict the entrance of migrants who fail to appear at a port of entry and provide ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-reynolds-keir-starmer-labour-government-sky-news-b1135299.html",
        "title": "Labour’s £28bn <b>green</b> investment pledge remains ‘level of ambition’ – Reynolds",
        "description": "Labour remains committed to invest £28 billion a year in green projects as its “level of ambition”, the shadow business secretary has said. Jonathan Reynolds conceded the investment may not be seen until the latter part of the next parliament and that “circumstances do change”."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/28/labour-downing-street-starmer-brown-blair",
        "title": "Thinking small may get Labour into No 10. It could also stop it from staying there",
        "description": "Unlike Brown and Blair, who made bold changes as soon as they entered Downing Street, Starmer seems determined to offer as little as possible, says Guardian columnist John Harris"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-stop-messing-around-badenoch-issues-warning-to-tory-rebels-the-pledge-haunting-labour-12593360",
        "title": "Politics latest: &#39;Stop messing around&#39; - Badenoch issues warning to Tory rebels; the pledge &#39;haunting&#39; Labour",
        "description": "Anne McElvoy, executive editor at Politico Europe, says the <b>party</b> want to say &quot;they are clearly different&quot;. She says the £28bn <b>green</b> pledge is becoming a figure that is &quot;haunting Labour&quot;. Former Labour adviser Ayesha Hazarika says &quot;we are all obsessed ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/jan/28/finland-goes-to-the-polls-as-border-tensions-with-russia-rise",
        "title": "Finland goes to the polls as border tensions with Russia rise",
        "description": "Two politicians lead the pack of nine candidates: the former conservative prime minister Alexander Stubb and the ex-foreign minister Pekka Haavisto of the <b>Green party</b>, who is running as an independent. Just behind the frontrunners are the far-right Finns ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-london-68109486?at_campaign=KARANGA&at_medium=RSS",
        "title": "Off-peak Friday fares trial to start for Tube and trains in London",
        "description": "Off-peak Tube and train fares all day on Fridays will be trialled by Transport for London (TfL) in a bid to boost passenger numbers and support the capital&#39;s economy. Sadiq Khan has asked TfL to launch a three-month trial in March. He said the organisation&#39;s usage data showed Fridays were quieter than any other week day."
    },
    {
        "url": "https://www.independent.com.mt/articles/2024-01-28/local-news/Parallels-and-divergences-How-the-upcoming-MEP-elections-compare-to-the-past-6736258140",
        "title": "Parallels and divergences: How the upcoming MEP elections compare to the past",
        "description": "It could be an opportunity for ADPD-The <b>Green Party</b> to make some inroads. Sandra Gauci, Ralph Cassar and Mina Jack Tolu are setting their sights on picking up votes from people unhappy with the two-<b>party</b> dominance. That third parties do well is not ..."
    },
    {
        "url": "https://www.leighjournal.co.uk/news/24067312.party-time-tyldesley-home-guard/",
        "title": "<b>Party</b> time for Tyldesley Home Guard",
        "description": "The black and white photograph shows members of the Tyldesley Home Guard having their concert <b>party</b> in Tyldesley theatre ... Lowton, Hindley, Hindley <b>Green</b>, Glazebury and surrounding areas from a different era. n To view pictures from the Wigan and ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-live-putin-nuclear-threat-uk-b2486136.html?page=2",
        "title": "Ukraine-Russia war - live: US ‘to station nuclear weapons in UK’ amid Putin threat",
        "description": "In his speech, Putin also lambasted the Baltic States over human rights. Estonia, Latvia and Lithuania - ruled from Moscow during the Cold War but now members of the European Union and NATO military alliance - have been among the strongest critics of Russia’s invasion of Ukraine."
    },
    {
        "url": "https://www.sundaytimes.lk/240128/columns/sanaths-death-leaves-rajapaksas-bereft-of-their-stoutest-lieutenant-546645.html",
        "title": "Sanath’s death leaves Rajapaksas bereft of their stoutest lieutenant",
        "description": "His tragic death at the untimely age of 48, would, no doubt, have struck a devastating blow to the flagging morale of the Rajapaksa clan and their party, the SLPP, for Sanath Nishantha was the stoutest lieutenant in the Rajapaksa camp to rouse the down-hearted troops to battle even when all was lost."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-8-billion-deliver-green-060000610.html",
        "title": "Labour Would Need £8 Billion to Deliver <b>Green</b> Plan Within Rules",
        "description": "(Bloomberg) -- The Labour <b>Party</b> needs to find at least £8 billion ($10 billion) to deliver its <b>green</b>-investment plan, a new analysis shows, underscoring why UK opposition leader Keir Starmer may be mulling changes to the initiative. Most Read from ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/covid-inquiry-tore-them-apart-snp-nicola-sturgeon-comment-smtpf6gr2",
        "title": "Covid inquiry tore them apart and the SNP is on thin ice",
        "description": "All eyes will be on Nicola Sturgeon as she gives evidence next week, although our cheeks are still burning after her sweary WhatsApp tirade"
    },
    {
        "url": "https://uk.news.yahoo.com/finland-elects-president-amid-tensions-015544026.html",
        "title": "Finland elects president amid tensions with Russia",
        "description": "Two top politicians lead the pack of nine candidates: former conservative prime minister Alexander Stubb, and ex-foreign minister Pekka Haavisto of the <b>Green Party</b> who is running as an independent. Just behind the frontrunners are far-right Finns <b>Party</b> ..."
    },
    {
        "url": "https://www.investing.com/news/world-news/finns-choose-new-president-for-nato-era-with-russia-in-mind-3285021",
        "title": "Finns choose new president for NATO era with Russia in mind",
        "description": "HELSINKI (Reuters) - Finland elects a new president on Sunday to lead the country in its new role within NATO after it broke with decades of non-alignment to join the Western defence alliance in response to Russia&#39;s invasion of Ukraine."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/27/justin-trudeau-luxury-jamaican-holiday/",
        "title": "Fury over Justin Trudeau’s £49,000 luxury Jamaican holiday",
        "description": "“Elitism is a real problem for the Liberal <b>Party</b> generally, but it’s especially a problem ... The Jamaican villa was loaned to Mr Trudeau by the family of Peter <b>Green</b>, a businessman whose friendship with Mr Trudeau’s father stretched back to the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/27/unionist-will-fight-against-irish-sea-border-jamie-bryson/?utmsource=email",
        "title": "Unionists will fight against Irish Sea border ‘every single day’, warns Jamie Bryson",
        "description": "But the former political wing of the IRA can’t take the position of First Minister because of the boycott of Stormont, which is run on a mandatory coalition between the largest unionist and nationalist <b>party</b> ... framework’s <b>Green</b> Lane, the ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/belfast-news/councillor-calls-castlebrook-investments-deliver-28510595",
        "title": "Councillor calls for Castlebrook Investments to &#39;deliver or move on&#39; with Tribeca development",
        "description": "<b>Green Party</b> councillor Brian Smyth has described the area as &quot;a gaping wound in the heart of the city centre&quot; and that Castlebrooke need to &quot;deliver the project or move on&quot; as there are a number of other developers within the UK and Ireland interested in ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/what-next-knowsley-race-represent-28519629",
        "title": "What next for Knowsley as race to represent borough gets going",
        "description": "There are some <b>green</b> shoots of this plan appearing ... Barring an inexplicable turn of events, that person will represent the Labour <b>Party</b>. That&#39;s because George Howarth, who has represented this part of the country for nearly 40 years will step down ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25547760/labour-teaching-white-privilege/",
        "title": "Labour’s idea to teach ‘divisive white privilege’ in UK schools could spark bitter conflict in classrooms like in the US",
        "description": "Left-leaning councils in the UK have already attempted to put CRT on the curriculum. In 2022, Brighton and Hove’s <b>Green Party</b>-controlled council came up with a five-year anti-racist education plan, which required all teachers to learn about CRT and ..."
    }
]