[
    {
        "url": "https://www.thenorthernecho.co.uk/news/24095132.tees-valley-mayor-pledges-free-swimming-11s/",
        "title": "Tees Valley Mayor pledges free swimming for under 11s",
        "description": "The Tees Valley Mayor has today (Monday, February 5) pledged to make swimming free for all children under 11. Since Mayor Ben Houchen launched his re-election campaign, he has announced plans to build a new hospital in Teesside, and to cap bus travel at £1 for all under 21s in a move to connect young people with jobs and training opportunities."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/went-first-ever-hello-kitty-231602356.html",
        "title": "I Went To The First-Ever Hello Kitty Cafe In The US For Afternoon Tea Service — Here&#39;s Everything I Ate, Ranked",
        "description": "&quot;Seeing this exact item for the first time felt equivalent to the first paleontologist finding a dinosaur fossil.&quot;"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/04/parisians-vote-in-favour-of-tripling-parking-costs-for-suvs?ref=mc.news",
        "title": "Parisians vote in favour of tripling parking costs for SUVs",
        "description": "The referendum comes as the city aims to reduce emissions by targeting wealthy drivers in large, polluting cars"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/04/labour-party-mps-backlash-israel-gaza-war-general-election/",
        "title": "Labour MPs face election backlash by Muslim voters over <b>party</b>’s stance on Israel-Gaza war",
        "description": "Pro-Palestine supporters angry over how long it took Sir Keir Starmer to call for ceasefire after Israel struck Gaza following Hamas attack"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13044529/ANDREW-PIERCE-Independents-jittery-Keir-Gaza.html",
        "title": "ANDREW PIERCE: Independents take on jittery Keir over Gaza",
        "description": "With a 20-point lead in the polls, you might think that Sir Keir Starmer is blissfully awaiting the General Election."
    },
    {
        "url": "https://uk.movies.yahoo.com/ice-spice-green-day-jelly-212050020.html",
        "title": "Ice Spice, <b>Green</b> Day, Jelly Roll, Tom Hanks and a Surreal Swoon of Stars Light Up Clive Davis Pre-Grammy Gala",
        "description": "Now in its 48 th year, the Clive Davis Pre-Grammy Gala remains the biggest party in the music world — the one that means you have arrived and can mix with a unique collection of the biggest names in the music and film worlds (unless you’re a journalist covering it and would never get in otherwise)."
    },
    {
        "url": "https://news.sky.com/story/rishi-sunak-to-meet-with-northern-irish-leaders-at-stormont-after-power-sharing-restored-13064099?dcmp=snt-sf-twitter",
        "title": "Rishi Sunak to meet with Northern Irish leaders at Stormont after power-sharing restored",
        "description": "Following changes to the agreement between the UK and EU, the Democratic Unionist Party dropped its opposition to an executive being formed in Northern Ireland, paving the way for power-sharing to restart."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862948/tory-members-survey-rishi-sunak-reform",
        "title": "Tory members threaten to vote Reform unless one of these three people replaces Rishi Sunak",
        "description": "EXCLUSIVE: A major survey of registered Conservative members when Rishi Sunak became leader suggests party activists will go on strike at the general election."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-must-ditch-28bn-pledge-to-be-heard-xnxgwtmtk",
        "title": "Labour must ditch £28bn pledge to be heard",
        "description": "Headline statistics such as the party’s target for green spending only give unnecessary ammunition to opponents"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/04/rishi-sunak-house-of-commons-vote-houthi-airstrikes-yemen/",
        "title": "Rishi Sunak faces fresh calls from MPs for vote on Houthi strikes",
        "description": "Rishi Sunak is facing fresh calls to give MPs a vote on future strikes against the Houthis in Yemen after the UK joined a third wave of bombings over the weekend. The most senior MP in both the Liberal Democrats and the Green Party issued statements on Sunday saying now was the time for the House of Commons to have a vote."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13044335/Lenny-Kravitz-59-stays-close-Charlotte-Lawrence-23-leaving-pre-Grammys-party-Bird-Street-Club-West-Hollywood.html",
        "title": "Lenny Kravitz, 59, stays close to Charlotte Lawrence, 23, while leaving a pre-Grammys <b>party</b> at The Bird Street Club in West Hollywood",
        "description": "Lenny Kravitz was joined by Charlotte Lawrence while leaving The Bird Street Club in West Hollywood on Saturday evening. The 59-year-old performer and the 23-year-old singer stayed close."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-prime-minister-red-sea-david-cameron-yemen-b1136962.html",
        "title": "Houthi Red Sea campaign is having economic consequences, Sunak says",
        "description": "The Prime Minister said the UK had acted in ‘self-defence’ when taking part in joint air strikes with the US to target rebel sites in Yemen."
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/25717966/super-bowl-high-protein-queso-dip-weight-loss-meal/",
        "title": "I’ve lost 35 lbs – your whole Super Bowl <b>party</b> will enjoy my high-protein queso dip and it won’t ruin your weight loss",
        "description": "A FIT MOM has shared a tasty recipe that won’t get in the way of your weight loss goals. She said her high-protein queso dip will be a hit at your next Super Bowl party. Health coach Bre"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1863013/Scotland-Yard-announces-breakthrough-on-spy-found-dead-in-bag",
        "title": "Major breakthrough in &#39;spy in the bag&#39; case in which man found dead in padlocked holdall",
        "description": "Police have now discovered MI6 operative Williams was likely alone when he died in August 2010, when his naked body was found in a North Face bag."
    },
    {
        "url": "https://edition.cnn.com/2024/02/04/politics/fact-check-trump-invade-iraq/",
        "title": "Fact check: Trump makes false claims about Iraq, Iran and Nikki Haley in new Fox interview",
        "description": "Former President Donald Trump repeated a variety of his previous false claims in an interview that aired Sunday morning on Fox News – notably including his years-old lie that he warned the US not to invade Iraq."
    },
    {
        "url": "https://www.thesun.co.uk/tv/25715068/rylan-clark-hot-mess-summer-contestants/",
        "title": "Rylan lifts the lid on his brutal new reality show Hot Mess Summer that left contestants speechless",
        "description": "RYLAN CLARK is ditching some of his Mr Nice Guy image for reality series Hot Mess Summer. He is the host for Prime Video’s new show in which eight party-loving single people fly off to Greece."
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/stoke-trent-billionaire-john-caudwell-9076844",
        "title": "Stoke-on-Trent billionaire John Caudwell accuses Britain of &#39;dithering&#39; in global <b>green</b> race",
        "description": "Phones4U founder John Caudwell, who grew up in Shelton, has criticised Britain&#39;s sluggishness in the green technology race"
    },
    {
        "url": "https://www.thesun.ie/sport/12133008/conor-murray-tadhg-beirne-birthday-johnny-sexton-laura/",
        "title": "Ireland stars Conor Murray and Tadhg Beirne and WAGs beam at lavish birthday celebrations for Johnny Sexton’s wife Laura",
        "description": "IRELAND heroes Tadhg Beirne and Conor Murray got suited up as they helped to celebrate the birthday of Johnny Sexton’s wife Laura. Laura Sexton turned 40 on Wednesday, and was the subject of"
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-lords-undiluted-labour-2889350?ico=related_stories",
        "title": "Reform of the Lords will go ahead undiluted, says Labour",
        "description": "Labour would not be drawn over which pledges would be in the manifesto but insisted it was not scaling back commitments"
    },
    {
        "url": "https://www.politico.eu/article/greens-push-for-eu-climate-neutrality-by-2040-in-election-manifesto/",
        "title": "Greens push for EU climate neutrality by 2040 in election manifesto",
        "description": "Despite growing discontent at the EU’s climate agenda, the Greens double down on their demand for ambitious sustainability measures."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-is-not-scaling-back-28bn-green-investment-plan-says-chris-bryant-368115/",
        "title": "Labour is not scaling back £28bn <b>green</b> investment plan says Chris Bryant",
        "description": "Labour Shadow minister Sir Chris Bryant said the Opposition party ‘intends to deliver’ on its so-called Green investment plan."
    },
    {
        "url": "https://www.thenational.scot/news/24096475.scottish-greens-announce-candidate-challenge-david-mundell/",
        "title": "Scottish Greens announce candidate to challenge David Mundell",
        "description": "THE Scottish Greens have announced their candidate set to challenge former Scottish secretary David Mundell for his seat in the House of Commons."
    },
    {
        "url": "https://www.independent.co.uk/news/ap-gladys-knight-serena-williams-ceo-jon-platt-b2490323.html",
        "title": "Gladys Knight, Stevie Wonder, Dionne Warwick rule at pre-Grammy gala hosted by Clive Davis",
        "description": "Clive Davis held his annual star-studded pre-Grammys gala Saturday at the Beverly Hilton in Beverly Hills, California"
    },
    {
        "url": "https://www.newsshopper.co.uk/news/national/24096418.labour-not-scaling-back-28bn-green-investment-plan---shadow-minister/",
        "title": "Labour is not scaling back £28bn <b>green</b> investment plan – shadow minister",
        "description": "“I am saying it (the <b>green</b> investment) will happen … and we will make it ... Richard Holden, Conservative <b>Party</b> chairman, said a Labour government would be “bad for the British people and would hammer them financially”. He said: “Labour’s ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/04/kerry-katona-celebrates-daughter-lilly-sue-mcfaddens-21st-birthday-20221066/?ico=more_text_links",
        "title": "Kerry Katona is near-identical to lookalike daughter Lilly-Sue McFadden during 21st birthday celebrations",
        "description": "Lilly looked fabulous in a short sequined <b>green party</b> dress, leather-look jacket and strappy black heels for the occasion. Kerry’s other daughters DJ and Heidi also attended the event, as the latter also rocked the leather jacket look with a red <b>party</b> dress."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/labour-considers-watering-down-plans-150022433.html",
        "title": "Labour considers watering down plans for a private equity tax raid",
        "description": "They are also eager to seduce venture funding, unlock pension capital and attract state-owned investment as a means of paying for the UK’s <b>green</b> energy transition. However, the <b>party</b> has attracted criticism for vacillating on its headline £28bn <b>green</b> ..."
    }
]