[
    {
        "url": "https://www.dailymail.co.uk/news/article-13101769/GRAHAM-GRANT-trust-SNP-loopy-Green-bedfellows-country-safe.html",
        "title": "GRAHAM GRANT: Would you trust the SNP and their loopy <b>Green</b> bedfellows to keep our country safe?",
        "description": "The North Sea oil and gas industry faces existential threats from numerous sources, not least Humza Yousaf&#39;s SNP Government and its Green partners."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/sadiq-khan-propaganda-fourth-plinth-trafalgar-square-art/",
        "title": "Sadiq Khan puts ‘anti-UK propaganda’ on a pedestal in Trafalgar Square",
        "description": "Sadiq Khan has been accused of promoting “anti-British propaganda” with a multicultural shortlist of sculptures for Trafalgar Square’s fourth plinth. The Mayor of London has resisted calls for a statue of Queen Elizabeth II to be erected in the space and instead launched a competition that will be decided by a public vote."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/taylor-wimpey-donating-25-glenboig-32159364",
        "title": "Taylor Wimpey donating £25 to Glenboig Development Trust for each home sold at Meadowside development",
        "description": "Latest tranche of £500 was donated took Taylor Wimpey&#39;s total to £925 - with £4025 set to be paid to Glenboig Development Trust as work at the Meadowside development progresses."
    },
    {
        "url": "https://www.lbc.co.uk/news/democracy-over-if-donald-trump-wins-next-usa-election/",
        "title": "&#39;My uncle is increasingly unhinged&#39;: Democracy will be &#39;over&#39; if Donald Trump gets in again, says Mary Trump",
        "description": "As Donald Trump is fined hundreds-of-millions of dollars for fraud, his niece, Mary Trump, says that democracy will be &quot;over&#39; if her &quot;unhinged&quot; uncle re-enters the White House."
    },
    {
        "url": "https://www.bristol247.com/news-and-features/news/greens-accused-ducking-budget-responsibilities/",
        "title": "Greens accused of ducking budget responsibilities",
        "description": "The Greens have been accused of “political cowardice” for failing to propose any changes to Marvin Rees’ final budget, which is due to be agreed at a full council meeting on Tuesday."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-weakness-exposed-again-2913720?ico=more_from_this_author",
        "title": "Keir Starmer’s weakness could soon be exposed again",
        "description": "Several shadow ministers have been heard using the formulation that Labour would “ban ‘exploitative’ zero-hours contracts”, which suggests that “non-exploitative’” zero-hours contracts will continue, despite the fact that many workers and trade unions see them as inherently exploitative."
    },
    {
        "url": "https://www.heraldscotland.com/news/24130061.humza-yousaf-full-energy-windfall-tax/?ref=rss",
        "title": "Humza Yousaf is full of energy about the windfall tax",
        "description": "Humza Yousaf is getting about. Over the weekend, while Scottish Labour had its conference in Glasgow and Anas Sarwar openly speculated about"
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-weakness-exposed-again-2913720?ico=most_popular",
        "title": "Keir Starmer’s weakness is about to be exposed again",
        "description": "Some dilutions to workers’ rights pledges have already taken place. In September 2022, Starmer told the TUC Congress that Labour would “extend parental leave”, but that pledge has now vanished from current briefing materials, and there is also concern about some muddying of the waters around banning zero-hours contracts."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/six-people-court-over-alleged-28662008",
        "title": "Six people in court over alleged DVLA driving licence medical forms fraud",
        "description": "The alleged fraud involves medical forms which bus and lorry drivers have to submit to the DVLA to get or keep a licence"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/darlington-council-tax-bills-rise-28663581",
        "title": "Darlington council tax bills to rise as Tory and Labour parties clash",
        "description": "The rise was approved by a majority of councillors, as the local authority takes urgent measures to stave off a financial crisis"
    },
    {
        "url": "https://www.edie.net/everything-you-need-to-know-about-the-eus-green-claims-directive/",
        "title": "Everything you need to know about the EU’s <b>Green</b> Claims Directive",
        "description": "Get informed on the EU&#39;s Green Claim Directive aimed to end greenwashing. Learn about claim verifications, penalties, and the impact on corporate sustainability."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/snp-accused-of-hypocrisy-for-attack-on-labour-windfall-tax/",
        "title": "Humza Yousaf accused of hypocrisy over attack on Labour’s North Sea windfall tax plans",
        "description": "Douglas Ross, the Scottish Tory leader, says SNP is masquerading as a friend of Scotland’s oil and gas industry"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/first-minister-humza-yousaf-visits-moray-in-election-push-342657/",
        "title": "First Minister Humza Yousaf&#39;s priorities for Moray ahead of first General Election for new Moray West, Nairn and Strathspey constituency",
        "description": "Launching the battle for the new Moray West, Nairn and Strathspey constituency ahead of this year&#39;s General Election, Mr Yousaf was joined by SNP candidate Councillor Graham Leadbitter (Elgin City South). During the visit, party activists were handed signs which urged to public to: &quot;Give the Tories the red card&quot;."
    },
    {
        "url": "https://www.yourthurrock.com/2024/02/19/tea-party-at-asda-hosted-by-community-group/",
        "title": "Tea <b>party</b> at Asda hosted by community group",
        "description": "ASDA’S Tilbury store was the latest venue for a Re-engage tea party. The locally-based charity which supports local and vulnerable people once again were hosted at the Tilbury store cafe, which frequently plays host to all the Thurrock groups organised by Re-engage."
    },
    {
        "url": "https://www.edp24.co.uk/news/national/24128576.ursula-von-der-leyen-seeking-second-term-head-eu-commission/",
        "title": "Ursula von der Leyen seeking second term as head of EU Commission",
        "description": "Germany’s Ursula von der Leyen will seek a second term as president of the European Union’s powerful Commission in a move that could make her the most significant politician representing the bloc’s 450 million citizens in a generation."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68339178.amp",
        "title": "SNP will oppose Labour&#39;s windfall tax plans",
        "description": "Starmer defends U-turn on £28bn <b>green</b> spending However, the first minister warned that the policy could sacrifice up to 100,000 jobs in the industry. In a speech at the HM Theatre in Aberdeen, Mr Yousaf said his <b>party</b> would oppose &quot;Labour&#39;s aggressive tax ..."
    },
    {
        "url": "https://www.snp.org/first-minister-humza-yousafs-speech-on-the-energy-sector-in-aberdeen/",
        "title": "First Minister Humza Yousaf’s speech on the energy sector in Aberdeen",
        "description": "Austerity whatever <b>party</b> is in number 10. Westminster is so broken ... And now two parties throwing away the golden economic opportunity of the <b>green</b> energy revolution. Repeating the mistakes of the past. The fact is that the Westminster consensus is ..."
    },
    {
        "url": "https://pressgazette.co.uk/media_law/daily-mail-faces-100k-claim-from-labour-donor-pictured-next-to-sex-harassment-headline/",
        "title": "Daily Mail faces £100K claim from Labour donor pictured next to ‘sex harassment’ headline",
        "description": "<b>Green</b> energy industrialist Dale Vince was “seriously defamed ... The story reported that the Labour <b>Party</b> was handing back money to donor Davide Serra, who has been accused of sexual harassment, while also referencing fellow donor Mr Vince."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24128576.ursula-von-der-leyen-seeking-second-term-head-eu-commission/",
        "title": "Ursula von der Leyen seeking second term as head of EU Commission",
        "description": "Germany’s Ursula von der Leyen will seek a second term as president of the European Union’s powerful Commission in a move that could make her the most significant politician representing the bloc’s 450 million citizens in a generation."
    },
    {
        "url": "https://www.standard.co.uk/lifestyle/fashion/best-and-worst-dressed-londoners-celebrities-2024-b1140040.html",
        "title": "The 40 best dressed Londoners of 2024 (and the 20 worst)",
        "description": "London has always punched above its weight when it comes to style and creative talent, but who are the purveyors of the very best looks? To mark LFW’s 40th year our fashion editors pick their 40"
    },
    {
        "url": "https://uk.news.yahoo.com/dale-vince-seriously-defamed-daily-145723028.html",
        "title": "Dale Vince ‘seriously defamed’ by Daily Mail article, High Court told",
        "description": "Green energy industrialist Dale Vince was “seriously defamed” by a Daily Mail article which falsely suggested he was the subject of sexual harassment allegations, the High Court has heard."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/19/humza-yousaf-labour-margaret-thatcher-oil-and-gas-windfall-tax-plans",
        "title": "Humza Yousaf likens Labour to Margaret Thatcher over oil and gas plans",
        "description": "Scotland’s first minister accused Labour of risking 100,000 jobs after Keir Starmer promised a “proper” windfall tax on oil and gas firms earlier this month when he scaled back his <b>party</b>’s £28bn <b>green</b> investment pledge. Yousaf, who later told ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/19/snp-accused-of-hypocrisy-for-attack-on-labour-windfall-tax/?n=@",
        "title": "Humza Yousaf accused of hypocrisy after attacking Labour’s North Sea windfall tax plans",
        "description": "Humza Yousaf has been accused of “breathtaking hypocrisy” after lambasting Labour’s plans for an increased windfall tax on North Sea oil and gas. The First Minister used a speech in Aberdeen to pledge the SNP would oppose Labour’s “aggressive” proposal to lift the energy profits levy from 75 per cent to 78 per cent, and extend it to 2029."
    }
]