[
    {
        "url": "https://www.financialexpress.com/business/industry-ingovern-okays-sanghi-industries-resolutions-3386278/",
        "title": "InGovern okays Sanghi Industries’ resolutions",
        "description": "Other resolutions include appointment of Ravi Kapoor, an independent director with Adani <b>Green</b> Energy (UP) since July 2021, as an independent director of SIL. Apart from a number related <b>party</b> transactions, InGovern also asked shareholders to approve ..."
    },
    {
        "url": "https://news.sky.com/story/popcons-seek-to-rally-tory-base-as-they-look-to-a-post-election-future-13065575",
        "title": "PopCons seek to rally Tory base as they look to a post-election future",
        "description": "Liz Truss may have been ousted from Number 10 after just 49 days. But she has support from certain Conservative MPs for her ideas to live on."
    },
    {
        "url": "https://www.politico.eu/article/europe-net-zero-industry-act-climate-change-green-technology/",
        "title": "EU finalizes <b>green</b> tech bill, responding to US effort",
        "description": "The Net-Zero Industry Act won’t match the US subsidy splurge, but it will offer incentives to local green tech manufacturers."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/06/keir-starmer-labours-28bn-green-investment-desperately-needed",
        "title": "Starmer ‘unwavering’ over Labour <b>green</b> pledge despite claims <b>party</b> dropping it",
        "description": "Labour leader says £28bn green investment ‘desperately needed’ after sources said last week Labour were planning to ditch policy"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/labour-28bn-green-pledge-confusion-tories-election/",
        "title": "Labour’s £28bn <b>green</b> pledge confusion ‘gives Tories election hope’",
        "description": "Strategists believe leadership’s uncertain approach could bode well for Conservatives if replicated in campaign"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68076729?at_medium=RSS&",
        "title": "Wellingborough by-election: Who will make a splash?",
        "description": "Ben Habib (left) and Reform UK&#39;s leader Richard Tice launched their campaign in Wellingborough Wellingborough voted 62.4% in favour of Brexit in the 2016 EU referendum. Ben Habib, Reform UK&#39;s candidate, said this could give the <b>party</b>, which was formerly ..."
    },
    {
        "url": "https://edition.cnn.com/2024/02/06/us/making-pregnancy-safer-for-black-women/index.html",
        "title": "Making pregnancy safer for Black women",
        "description": "Many women in the US often work all the way up until they give birth, usually in order to save up vacation days for after their child is born. But Dr. Slaughter says that practice can be especially dangerous for Black women. “I always say: ‘You know you’re not about to go on vacation, right?’”"
    },
    {
        "url": "https://www.salisburyjournal.co.uk/news/24101383.barney-norris-named-green-party-candidate-salisbury/",
        "title": "Barney Norris named <b>Green Party</b> candidate for Salisbury",
        "description": "Award-winning writer Barney Norris has been selected as the Green Party’s candidate for Salisbury at the coming General Election."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/06/chart-band-the-last-dinner-party-play-first-ever-acoustic-set/",
        "title": "Chart band The Last Dinner <b>Party</b> play first ever acoustic set",
        "description": "‘On Your Side’ was the first song played, with the acoustic guitars and keyboard, it really had a far softer feel compared to the album version. Absolutely beautifully sung by Abigail and ending with Aurora’s shimmering keyboard work, it was a fine start to the evening."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?filterKeyEvents=true&page=with:block-65c2566d8f08fa977b9e609b",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-county-council-tax-rise-28581723",
        "title": "Northumberland County Council facing £30m budgets savings as households are expected to by hit with a council tax rise",
        "description": "The Northumberland County Council budget will be voted on by full council later this month at County Hall in Morpeth"
    },
    {
        "url": "https://www.coventryobserver.co.uk/news/coventry-news-what-promises-has-the-greens-new-metro-mayor-candidate-made/",
        "title": "What pledges has the <b>Green</b>&#39;s new Metro Mayor candidate made?",
        "description": "THE <b>GREEN Party</b> have selected their candidate for the West Midlands Mayoral Election. Siobhan Harper-Nunes will be standing in May’s election and has vowed to give communities a voice if she comes out on top. She has worked both in the public and third ..."
    },
    {
        "url": "https://www.lbc.co.uk/opinion/views/government-needs-a-buoyant-private-sector-to-improve-public-services/",
        "title": "The government needs a buoyant private sector to improve public services and fix the NHS",
        "description": "Most people in the UK will be very surprised if a Labour administration is not returned at the next General Election, whenever it is held."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863801/lee-anderson-popular-conservatism-liz-truss-tory-party-latest",
        "title": "Lee Anderson got &#39;a two-word answer&#39; when he explained how to reduce energy bills",
        "description": "Lee Anderson raged about how politicians in Westminster do not lie awake about the things which give ordinary voters sleepless nights."
    },
    {
        "url": "https://morningstaronline.co.uk/article/truss-summons-secret-tories-fight-davos-and-left",
        "title": "Truss summons ‘Secret Tories’ to fight Davos and Left",
        "description": "SECRET Tories were summoned to the fight against “Davos man” and the global left at today’s launch of the Popular Conservatives movement. The new group is fronted by ex-premier Liz Truss, who used her speech to rail against “wokery,” obstructive institutions, left-wing “extremists” and environmentalists."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24101859.holocaust-denier-stands-hillhead-by-election-glasgow/",
        "title": "Holocaust denier stands in Hillhead by-election in Glasgow",
        "description": "A spokesperson for the Glasgow <b>Green Party</b>, said: “The far-right Independent <b>Green</b> Voice appear to be aiming to solidify their status as neo-fascist spoiler candidates, hoping to disrupt the outcome of this election. “Thankfully, voters in Hillhead ..."
    },
    {
        "url": "https://www.pharmiweb.com/press-release/2024-02-06/new-t-finder-platform-provides-deep-insights-into-t-cell-responses-against-novel-cancer-vaccine-1",
        "title": "New T-FINDER Platform Provides Deep Insights Into T Cell Responses Against Novel Cancer Vaccine",
        "description": "Researchers at the BioMed X Institute and the Universitätsmedizin Mannheim just published the results of their collaboration around a new neoepitope vaccine in diffuse midline glioma in Science"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/seven-takeways-popular-conservatives-truss-b2491549.html",
        "title": "The seven most bizarre takeaways from Liz Truss’s Popular Conservatism launch",
        "description": "The new conservative faction has called for a smaller state, lower taxes, net-zero rollbacks and a tougher stance on immigration"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/east-sussex-county-councillors-agree-council-tax-increase-4507630",
        "title": "East Sussex county councillors agree council tax increase",
        "description": "East Sussex council tax bills will increase again in April, after county councillors agreed their annual budget for the coming financial year."
    },
    {
        "url": "https://www.independent.co.uk/voices/popular-conservatism-liz-truss-nigel-farage-westminster-b2491486.html",
        "title": "Liz Truss’s ludicrous political comeback was straight out of Mean Girls",
        "description": "Not since that movie’s reboot has a bunch of cliquey, pretentious wannabes so deserved to be panned. Pravina Rudra watches the drama unfold at the launch of Popular Conservatism, the Tories’ latest sp"
    },
    {
        "url": "https://www.irishnews.com/news/ireland/ryanair-boss-was-personally-abusive-eamon-ryan-Y434KQNAKVIZNNAM6RPMZJ2J7Q/",
        "title": "Ryanair boss was ‘personally abusive’ – Eamon Ryan",
        "description": "Transport Minister Eamon Ryan has accused Ryanair boss Michael O’Leary of being “personally abusive”, after he called the Green minister “incompetent” and an “idiot”. The Ryanair boss also called on Mr Ryan to resign over the Green Party’s opposition to raising the cap on passenger numbers at Dublin Airport."
    },
    {
        "url": "https://uk.news.yahoo.com/hunt-claims-tax-rises-needed-195754252.html",
        "title": "Hunt claims tax rises needed to fund Labour’s £28bn <b>green</b> spending pledge",
        "description": "Mr Hunt’s remarks came as Labour leader Sir Keir Starmer said the funding package is “desperately needed” for his <b>party</b>’s mission to achieve clean power by 2030. Labour originally promised in 2021 to invest £28 billion a year until 2030 in <b>green</b> ..."
    },
    {
        "url": "https://www.mirror.co.uk/sport/golf/phoenix-open-liv-golf-hole-32059942",
        "title": "Phoenix Open chief plays down LIV Golf threat after <b>party</b> hole rivalry formed",
        "description": "The remarkable stadium hole boasts a ringed grandstand that wraps right around the tee and <b>green</b>, and has become synonymous with its <b>party</b> atmosphere. Some of the PGA Tour&#39;s most recognisable aces have been made at the Scottsdale par-three, as those in ..."
    },
    {
        "url": "https://uk.news.yahoo.com/heather-rae-tarek-el-moussa-195734219.html",
        "title": "Heather Rae and Tarek El Moussa Throw Under the Sea-Themed First Birthday <b>Party</b> for Son Tristan — See Photos!",
        "description": "His older siblings Taylor, 13, and Brayden, 8 — who Tarek shares with ex-wife Christina Hall — were also at the <b>party</b>, which featured blue, <b>green</b> and gold balloons, as well as blue cupcakes. &quot;Tristan’s ONEder the sea 🌊 🐠🦈 🐳 birthday <b>party</b> ..."
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/dublin-airport-greenhouse-gases-increase-32061407",
        "title": "Dublin Airport plans will &#39;increase greenhouse gases&#39; says emissions expert",
        "description": "It hopes the changes, if approved, will increase passenger numbers from 32 million to 40 million a year. READ MORE: <b>Green Party</b> MEP hits out at Fianna Fáil, Fine Gael and Ryanair boss in Dublin Airport cap row. &#39;They don&#39;t get it&#39; According to Al Gore’s ..."
    },
    {
        "url": "https://www.businessgreen.com/news/4170894/enormous-achievement-confirms-uk-emissions-halved-1990",
        "title": "&#39;Enormous achievement&#39;: Data confirms UK emissions have halved since 1990",
        "description": "Reports across the media last week had indicated the <b>Party</b> was poised to scrap or at least heavily scale back the <b>green</b> investment pledge. But the Labour leader reportedly told Times Radio today that the proposed £28bn climate investment was &quot;desperately ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?filterKeyEvents=true&page=with:block-65c223d98f085be9f686a6ef",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/rishi-sunak-latest-news-rwanda-bet-starmer-green-dup/",
        "title": "‘We’ve failed to take on Left-wing extremists,’ Truss tells Popular Conservatism group launch – live updates",
        "description": "Rishi Sunak said he was “taken totally by surprise” by a £1,000 bet with Piers Morgan on the Government’s Rwanda policy. Mr Morgan bet the Prime Minister £1,000 to a refugee charity that Rwanda migrant deportation flights would not take off before the next general election."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863748/Sir-Keir-Starmer-Tax-Bombshell-Green",
        "title": "Sir Keir Starmer&#39;s <b>green</b> plan risks landing families with £1,400 tax bombshell",
        "description": "Sir Keir Starmer’s £28 billion green plans would lead to a £1,400 tax bombshell for the average family, the Chancellor warned. Labour’s leader was accused of a “triple flip flop” after again changing course on his clean energy pledge."
    },
    {
        "url": "https://www.pharmiweb.com/press-release/2024-02-06/on-a-quest-to-make-all-chemistry-green-chemistry",
        "title": "On a Quest To Make All Chemistry <b>Green</b> Chemistry",
        "description": "NORTHAMPTON, MA / ACCESSWIRE / February 6, 2024 / How do you evaluate how green (or not) a chemical process is?For years there wasn&#39;t an easy way. Then, in 2019, a team of chemists and bioinformatic experts from MilliporeSigma,"
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/ciaran-cuffe-dublin-airport-cap-32059884",
        "title": "<b>Green Party</b> MEP hits out at Fianna Fáil, Fine Gael and Ryanair boss in Dublin Airport cap row. &#39;They don&#39;t get it&#39;",
        "description": "Controversy has arisen over Dublin Airport&#39;s desire to increase its yearly passenger cap from 32m to 40m to allow more people to transit through"
    },
    {
        "url": "https://inews.co.uk/news/politics/jacob-rees-mogg-lee-anderson-net-zero-2892370?ico=in-line_link",
        "title": "‘The poor are footing the bill’: Rees-Mogg and Anderson attack Net Zero at PopCon’s launch",
        "description": "Former cabinet minister Sir Jacob Rees-Mogg and ex-deputy Conservative Party chairman Lee Anderson have led attacks on efforts to get the UK to net zero emissions at the launch of the new Popular Conservatism pressure group."
    },
    {
        "url": "https://news.sky.com/story/who-are-the-popular-conservatives-and-how-do-they-compare-to-other-tory-movements-12964275",
        "title": "Who are the Popular Conservatives - and how do they compare to other Tory movements?",
        "description": "We look at the new group, led by former prime minister Liz Truss, and the other factions filling the Tory backbenches."
    },
    {
        "url": "https://leftfootforward.org/2024/02/exclusive-two-thirds-of-voters-say-britain-has-got-worse-under-the-tories-since-2010-poll-finds/",
        "title": "EXCLUSIVE: Two-thirds of voters say Britain has got worse under the Tories since 2010, poll finds",
        "description": "While half of 18-24 year olds say that Britain has got worse since 2010, the figure rises to 72% among those aged 65 and over. 71% of those aged 55-64 say they also think things have got worse, as do 66% of those aged between 35-44."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rachel-reeves-treasury-laura-trott-british-b1137347.html",
        "title": "Starmer: £28 billion investment ‘desperately needed’ for our clean power mission",
        "description": "Sir Keir Starmer said he had been ‘unwavering’ in relation to the <b>party</b>’s <b>green</b> energy plans. Labour leader Sir Keir Starmer has said the investment is ‘desperately needed’ to achieve clean power by 2030 (PA) Sir Keir Starmer has said £28 ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/february-by-election-wellingborough-peter-bone-kingswood-b2491278.html",
        "title": "February by-elections: Everything you need to know as Peter Bone’s seat up for grabs",
        "description": "The by-elections will also mark the first that Reform UK , previously the Brexit <b>Party</b>, put forward candidates ... Known for being an advocate of <b>green</b> issues, the former MP called the government’s bill a ‘tragedy’ for rowing back on key climate ..."
    },
    {
        "url": "https://www.tutor2u.net/politics/blog/is-starmers-labour-new-labour-mark-ii",
        "title": "Is Starmer&#39;s Labour New Labour Mark II?",
        "description": "The labor <b>party</b> now sees the city as something that needs to be controlled ... as a strong and capable Chancellor despite limited financial resources. 5. The <b>green</b> pledge is going by the wayside because it must be consistent with the fiscal rules."
    },
    {
        "url": "https://www.newstatesman.com/politics/labour/2024/02/cracks-keir-starmer-rachel-reeves-28bn",
        "title": "The ailing King and his public",
        "description": "But given it is one of Labour’s few substantive policies, it’s worth following – not least because it’s exposing some of the latent divides within the party. This morning Keir Starmer pledged himself to the figure yet again in an interview with Times Radio, describing the investment as “desperately needed”."
    },
    {
        "url": "https://www.lynnnews.co.uk/news/train-with-queen-on-board-delayed-and-any-questions-for-scho-9351709/",
        "title": "On this week in King’s Lynn, Hunstanton, Swaffham and Narborough: February 4 – 10, 1986",
        "description": "Norfolk ratepayers look set to fork out an extra 19 per cent on their rates for only 1.5 per cent increase in spending on the county’s services. If county councillors agree to the rise it would mean the average domestic ratepayer currently paying £250 a year in rates would be asked to fork out another £50 in the next financial year."
    },
    {
        "url": "https://www.politics.co.uk/news-feature/2024/02/06/is-keir-starmer-sleepwalking-into-a-conservative-trap-on-labours-28bn-green-pledge/",
        "title": "Is Keir Starmer sleepwalking into a Conservative trap on Labour’s £28bn <b>green</b> pledge?",
        "description": "On the surface, Labour’s £28 billion <b>green</b> pledge appears to be the soft underbelly of Starmerism. Even when it was announced in 2021, with the Labour <b>Party</b> traversing the narrowest of pathways on fiscal policy, eyebrows were raised by this notably ..."
    },
    {
        "url": "https://www.thesun.co.uk/money/25755608/labour-green-pledge-in-chaos-starmer-confusion/",
        "title": "Labour’s <b>green</b> pledge in CHAOS as Sir Keir Starmer appears at odds with his own shadow chancellor on £28bn spending",
        "description": "LABOUR’S flagship green pledge was thrown into fresh chaos today as Sir Keir Starmer appeared at odds with his own shadow chancellor.  The party leader said a £28billion-a-year spending spree"
    },
    {
        "url": "https://www.dailymail.co.uk/femail/article-13050601/sanna-marin-holiday-slammed-fans.html",
        "title": "Former PM of Finland Sanna Marin slammed by fans for showing off her holiday to Austrian alps - after starting new job with Tony Blair",
        "description": "The politician - who now works under Tony Blair in the London-based Institute for Global Change - shared a glimpse of her trip to Austria with her 1m Instagram followers earlier this week."
    },
    {
        "url": "https://www.heraldscotland.com/news/24100639.starmer-adds-confusion-labours-28bn-green-investment/?ref=rss",
        "title": "Starmer adds to confusion over Labour&#39;s £28bn <b>green</b> investment",
        "description": "Sir Keir Starmer has denied scaling back Labour’s commitment to green investment, despite the party moving away from their promise to spend"
    },
    {
        "url": "https://arynews.tv/elections-2024-pakistan-parties-manifesto-and-climate-change/",
        "title": "How <b>green</b> are Pakistan’s political manifestoes?",
        "description": "Pakistan’s national elections are scheduled for February 8, 2024, but election manifestoes by the major parties were only released at the end of January."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24100010.starmer-28-billion-investment-desperately-needed-clean-power-mission/",
        "title": "Starmer: £28 billion investment ‘desperately needed’ for our clean power mission",
        "description": "Sir Keir Starmer has said £28 billion is “desperately needed” for Labour’s mission to achieve clean power by 2030 amid confusion over the party’s commitment to the investment pledge. The Labour leader insisted he had been “unwavering” in relation to the party’s green energy plans and denied it was “scaling back” policies as this year’s general election looms."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13050845/Manchester-mayor-Andy-Burnham-lashes-Keir-Starmer-dropping-vow-abolish-House-Lords-left-wingers-demand-Labour-leader-bolder.html",
        "title": "Manchester mayor Andy Burnham lashes out at Keir Starmer for &#39;dropping&#39; vow to abolish the House of Lords as left-wingers demand Labour leader is &#39;bolder&#39;",
        "description": "Mr Burnham urged Sir Keir to &#39;stick to his guns&#39; and scrap the unelected chamber if he becomes prime minister."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/lee-anderson-net-zero-climate-weirdos-b2491403.html",
        "title": "Only ‘odd weirdos’ care about net zero, says senior Tory Lee Anderson",
        "description": "Right-winger tells Liz Truss’ PopCons event that push to tackle climate change ‘never comes up’ with voters on doorstep"
    },
    {
        "url": "https://www.carbonbrief.org/daily-brief/eu-backs-down-on-agricultural-emissions-after-farmers-protests/",
        "title": "EU backs down on agricultural emissions after farmers’ protests",
        "description": "EU&#39;s roadmap on how to cut emissions by 90% by 2040 no longer includes references to reductions in methane, nitrogen and other gases linked to farming"
    }
]