[
    {
        "url": "https://www.dailymail.co.uk/news/article-13069671/Outrage-Labour-candidate-claims-Israel-deliberately-allowed-1-400-citizens-massacred-October-7-order-green-light-invade-Gaza.html",
        "title": "Outrage after Labour candidate claims Israel deliberately allowed 1,400 of its citizens to be massacred on October 7 in order to give it the &#39;<b>green</b> light&#39; to invade Gaza",
        "description": "Azhar Ali, who is defending a Labour majority of more than 9,000 in Rochdale on February 29, claimed Israel allowed Hamas to massacre its own citizens."
    },
    {
        "url": "https://www.thesun.co.uk/news/25856920/king-charles-cancer-royal-future-prince-harry/",
        "title": "King Charles’ cancer is a sign of fragile royal future… with no Prince Harry in it",
        "description": "IT boggles the mind to reflect that if William became King tomorrow, then Harry would be fourth in line to the throne. And the only royals ahead of Harry in the queue for the crown would be"
    },
    {
        "url": "https://edition.cnn.com/2024/02/10/politics/mike-gallagher-reelection/index.html",
        "title": "GOP Rep. Mike Gallagher won’t seek reelection",
        "description": "GOP Rep. Mike Gallagher announced he will not seek re-election, just days after after bucking his own party to vote against impeaching Department of Homeland Security Secretary Alejandro Mayorkas."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24110929.attended-botanist-launch-event-sunderland/",
        "title": "We attended The Botanist launch event in Sunderland",
        "description": "Reporter Darcie Rawlings attended The Botanist launch <b>party</b> in Sunderland with her partner to celebrate ... its name following a botanical theme decked out with leafy plants, dark <b>green</b> murals and exposed brick walls. At the event, we tried out the four ..."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13069367/Megan-Fox-corset-Las-Vegas-Super-Bowl-party.html",
        "title": "Megan Fox showcases her curves in a plunging corset covered in spikes at Super Bowl LVIII <b>party</b> in Las Vegas",
        "description": "Megan Fox showcased her curves as she and boyfriend Machine Gun Kelly partied in Las Vegas ahead of Sunday&#39;s Super Bowl LVIII."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/labour-business-odd-combo-like-32096550",
        "title": "&#39;Labour and business is odd combo - like vodka and tomato juice or Crouch and Clancy&#39;",
        "description": "When you see Labour going down well with the City, austerity hero George Osborne praising them, it’s a slightly unsettling feeling. Turns out it’s not just me. It used to be you had to wait ages to see how policy was playing out."
    },
    {
        "url": "https://uk.movies.yahoo.com/big-city-greens-creators-ink-183000892.html",
        "title": "‘Big City Greens’ Creators Ink Overall Deal With Disney Branded Television",
        "description": "Chris Houghton and Shane Houghton, the creators and executive producers of the Disney Channel animated series “Big City Greens,” have signed an overall deal with Disney Branded Television. The announcement was made at the Television Critics Association winter press tour."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/keir-starmer-pledges-500000-new-32095906",
        "title": "Keir Starmer pledges 500,000 new <b>green</b> jobs &#39;where you live&#39; - full back to work plan",
        "description": "The Labour leader and Shadow Chancellor Rachel Reeves showed a united front - outlining the huge infrastructure investments still planned for the party&#39;s green plan, despite scaling back the headline"
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25857095/voters-angry-labour-28billion-eco-uturn-starmer/",
        "title": "Labour hit by furious voter backlash over his £28 billion eco U-turn",
        "description": "VOTERS reckon Sir Keir Starmer “flip flops too often” after his £28billion green U-turn, snap focus groups have revealed. Labour have been plunged into crisis after they announced they were"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/10/labour-green-pledge-u-turn-threatened-plan-for-growth",
        "title": "The Observer view: Labour’s <b>green</b> U-turn has threatened its plan for growth",
        "description": "The party’s decision to drop a commitment to spending £28bn a year will have a negative effect on its other investment plans"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/picture/2024/feb/10/labour-hides-as-28bn-green-pledge-goes-up-in-smoke-cartoon",
        "title": "Labour hides as £28bn <b>green</b> pledge goes up in smoke – cartoon",
        "description": "After weeks of prevarication, the party dramatically scales back its flagship environmental policy"
    },
    {
        "url": "https://www.thetimes.co.uk/article/tony-blair-meetings-sue-gray-labour-keir-starmer-vxtkxnz7l",
        "title": "Tony Blair and Sue Gray: the heavyweights fighting for Starmer’s ear",
        "description": "The former prime minister was a key player in the internal debate that led to the party leader’s decision to ditch its £28bn eco spending pledge"
    },
    {
        "url": "https://www.huffpost.com/entry/democrats-optimistic-2024-election-amid-gop-stumbles_n_65c69658e4b069b665df836b?ncid=engmodushpmg00000003",
        "title": "As Republicans Publicly Face-Plant, House Democrats Are Feeling Good About November",
        "description": "House Democrats will continue to defend our democracy. House Republicans continue to choose dysfunction,” said Democratic Leader Hakeem Jeffries (N.Y.) at the start of the co"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/labour-net-zero-target-not-achievable-experts-say-2030/",
        "title": "Labour&#39;s <b>green</b> target &#39;unachievable&#39; after ditching £28bn pledge, say experts",
        "description": "The commitment to decarbonising electricity generation by the end of the decade was already considered highly ambitious, but experts said that Sir Keir Starmer’s decision to ditch the party’s £28 billion green investment plan made it all but impossible."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24111615.labour-rejects-dodgy-civil-servant-costing-windfall-tax-plans/",
        "title": "Labour rejects ‘dodgy’ civil servant costing of windfall tax plans",
        "description": "The opposition party said the analysis ‘fundamentally misunderstands’ its policy to tax the excess profits of oil and gas giants."
    },
    {
        "url": "https://www.huffpost.com/entry/house-republicans-homeland-security-secretary-mayorkas-impeachment_n_65c278a0e4b0dbc806ae62c2?p3jg=",
        "title": "House Republicans Fail To Impeach DHS Secretary Alejandro Mayorkas",
        "description": "Al <b>Green</b> of Texas. He had been out following surgery ... that Mayorkas has committed,” McClintock said early Tuesday in a 10-page memo criticizing his <b>party</b>’s effort. “In effect, they stretch and distort the Constitution in order to hold the ..."
    },
    {
        "url": "https://www.thehindu.com/news/international/michelle-oneill-a-balancing-act/article67833352.ece",
        "title": "Michelle O’Neill | A Balancing Act",
        "description": "Michelle O&#39;Neill, Northern Ireland&#39;s new First Minister, discusses her role and the challenges facing the region."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-labour-party-keir-starmer-government-jeremy-hunt-b1138369.html",
        "title": "Labour rejects ‘dodgy’ civil servant costing of windfall tax plans",
        "description": "The opposition party said the analysis ‘fundamentally misunderstands’ its policy to tax the excess profits of oil and gas giants."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68261445",
        "title": "Kuenssberg: Are the politics of climate change going out of fashion?",
        "description": "One climate leader points to the package for cleaner steel at Port Talbot, or new laws on electric vehicles, for example, but adds that the government is &quot;green hushing&quot; - taking action but playing it down because &quot;they don&#39;t want any coverage of it&quot;."
    },
    {
        "url": "https://www.ok.co.uk/celebrity-news/eastenders-lacey-turn-son-birthday-32094384",
        "title": "Inside EastEnders&#39; Lacey Turner&#39;s incredible Marvel-themed birthday <b>party</b> for son Trilby",
        "description": "EastEnders star Lacey Turner threw an incredible Marvel-themed party to mark her son Trilby&#39;s third birthday, complete with extravagant decorations and a bouncy castle"
    },
    {
        "url": "https://www.independent.co.uk/politics/rishi-sunak-trans-brianna-ghey-by-election-tory-b2494034.html",
        "title": "Rishi Sunak braces for testing week of by-elections and economic woe after trans row",
        "description": "Party unity and the Conservative’s electoral prospects are under threat as two bruising by-elections and grim economic forecasts loom"
    },
    {
        "url": "https://www.ibtimes.co.uk/starmer-faces-rising-criticism-over-plans-drop-28-billion-green-investment-pledge-1723326",
        "title": "Starmer Faces Rising Criticism Over Plans To Drop £28 Billion <b>Green</b> Investment Pledge",
        "description": "Starmer is expected to argue that it will not affect specific pledges on improving home energy efficiency and decarbonising the national grid by 2030."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/10/labour-starmer-plan-new-storm-workers-rights-regulations/",
        "title": "Inside Labour’s plan for a storm of regulations at work",
        "description": "The proposed changes include introducing “day one” workers’ rights, ending zero-hour contracts, banning fire and rehire practices, bringing in a “right to switch off” for workers, increasing the minimum wage and beefing up laws that block companies from blacklisting union workers."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-68218414",
        "title": "Wellingborough by-election: Residents&#39; questions answered by candidates",
        "description": "Three of the candidates: Nick the Flying Brick, Alex Merola from Britain First and Ankit Love Jay Mala did not reply to our request to take part."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24109165.michael-mathesons-departure-just-start-problems-yousaf/",
        "title": "Michael Matheson&#39;s departure is just the start of problems for Yousaf",
        "description": "Humza Yousaf faces two fundamental and related challenges: how to placate the voters over the Matheson clanjamfrie; and how to"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-labour-conservatives-vogue-rishi-sunak-b1138327.html?ref=todayheadlines.live",
        "title": "Starmer says Labour needs to ‘fight like we’re five points behind’",
        "description": "Sir Keir Starmer has played down Labour’s heavy opinion poll lead against the Tories, saying the party has to “fight like we’re five points behind”. Labour holds an opinion poll lead of about 20 points over the Conservatives ahead of an election this year."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865253/keir-starmer-election-warning-labour-party?ref=todayheadlines.live",
        "title": "Keir Starmer says Labour must &#39;fight like we&#39;re five points behind&#39; in election warning",
        "description": "Labour holds an opinion poll lead of about 20 points over the Conservatives ahead of an election this year - but Sir Keir Starmer is not taking anything for granted."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/done-deal-despite-labours-latest-u-turn-is-the-election-result-already-decided_uk_65c5d06ee4b0fb721d608bf8?d_id=7286698&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Done Deal: Despite Labour&#39;s Latest U-Turn, Is The Election Result Already Decided?",
        "description": "Rishi Sunak and Keir Starmer have both had a week to forget, but voters seem to have already made up their minds."
    },
    {
        "url": "https://www.leighjournal.co.uk/news/24097342.party-time-tunnicliffes-cotton-spinning-mill-1914/",
        "title": "<b>Party</b> time at Tunnicliffe&#39;s Cotton Spinning Mill in 1914",
        "description": "The picture, which we dug out from the local archive collection, was taken more than a century ago, in 1914. Sticking with the party theme from recent weeks, this snap shows one from Tunnicliffe&#39;s Cotton Spinning Mill, in Leigh. Holden&#39;s Party at Tunnicliffe&#39;s Cotton Spinning Mill, Leigh, 1914."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-norfolk-68255110.amp",
        "title": "King&#39;s Lynn&#39;s Harding&#39;s Pits may be used to grow fruit for community",
        "description": "A green space could be used to grow fruit for the community under plans to plant an orchard. Harding&#39;s Pits by the River Great Ouse, south of King&#39;s Lynn, was developed 20 years ago and is used for recreation and conservation. The borough council has recommended it is designated a village green and put in a bid for funding for an orchard."
    },
    {
        "url": "https://www.ft.com/content/77d205f5-eb11-4648-ad33-06af1d1d9cc0",
        "title": "Labour’s political credibility questioned after <b>green</b> spending U-turn",
        "description": "Sir Keir Starmer on Friday was accused of shredding his political credibility and his hopes of converting Britain to “clean power” by 2030, after the Labour leader junked the <b>party</b>’s flagship £28bn <b>green</b> investment plan. The slow-motion scrapping of ..."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-says-spring-step-110724333.html",
        "title": "Rishi Sunak says he has ‘spring in my step’ after Labour’s £28m net-zero climbdown",
        "description": "Rishi Sunak has said that Labour’s <b>green</b> prosperity plan is now “in tatters” and the <b>party</b>’s u-turn on its financial commitment has given him a “spring in my step” in an interview with The Times. Labour confirmed it was cutting its <b>green</b> ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/all-labour-policies-election-manifesto-green-2899366?ico=related_stories",
        "title": "All of Labour’s policies so far, and whether they’ll make it into the manifesto",
        "description": "With an election on the horizon Sir Keir Starmer&#39;s party has already made dozens of pledges. Here is everything you need to know"
    },
    {
        "url": "https://wtmj.com/government-and-politics/2024/02/10/rep-mike-gallagher-will-not-seek-reelection/",
        "title": "Rep. Mike Gallagher will not seek reelection",
        "description": "A native of <b>Green</b> Bay, Rep. Gallagher has represented northeast Wisconsin since 2017. He currently serves as the Chairman of the Strategic Competition Between the United States and the Chinese Communist <b>Party</b> and Chairman of the House Armed Services ..."
    },
    {
        "url": "https://www.palatinate.org.uk/stormont-sectarianism-sparks-fears-of-violence/",
        "title": "Stormont sectarianism sparks fears of violence",
        "description": "The <b>party</b> has accepted a rebranding of the Red and <b>Green</b> Lanes that the Windsor Agreement created between the ensures, as Donaldson put it, “zero checks and zero customs paperwork” for goods moving from the UK to Northern Ireland and remaining there."
    },
    {
        "url": "https://inews.co.uk/opinion/ditching-green-pledge-not-hurt-labour-chances-2898786?ico=in-line_link",
        "title": "Ditching the £28bn <b>green</b> pledge won’t hurt Labour’s chances",
        "description": "Starmer&#39;s <b>party</b> isn’t going to lose the election because of a made ... t mention the war” vibe – that particular conflict being the flagship £28bn <b>green</b> policy. Everyone knew it was coming, but there was a gnawing sense of anxiety about how it ..."
    }
]