[
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-sinking-feeling-58-mps-32156072",
        "title": "&#39;Tories sinking feeling as 58 MPs announce plans to abandon Conservative ship&#39;",
        "description": "Some 58 Tory MPs have already announced they are quitting next time around but the figure could top 100 – by some counts even 150"
    },
    {
        "url": "https://www.vogue.co.uk/article/rosamund-pike-baftas-2024",
        "title": "“Take It Seriously, But Allow Time For Play”: Rosamund Pike’s Guide To The BAFTAs",
        "description": "Rosamund Pike and Dior deserved another awards season 2024 moment together after her “Elspeth at the funeral” look broke the internet. But if that inky black lace dress – and exquisitely moody face net – was a darkly romantic nod to Pike’s Saltburn character, her BAFTAs look is quintessentially Rosamund."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13098085/JK-Rowling-donates-Scottish-feminist-campaigners-help-Supreme-Court-appeal-against-definition-woman.html",
        "title": "JK Rowling donates £70,000 to Scottish feminist campaigners to help their Supreme Court appeal against the definition of &#39;woman&#39;",
        "description": "Harry Potter author JK Rowling has donated £70,000 to a feminist campaign to help their Supreme Court appeal against the definition of a woman."
    },
    {
        "url": "https://www.dailymail.co.uk/sciencetech/article-13078361/americas-home-appliances-ban-green-regulation-crackdown-evidence.html",
        "title": "From gas stoves to dishwashers and NOW laundry detergent: How home appliances are in the crosshairs of America&#39;s <b>green</b> crackdown... but what does the evidence actually show ...",
        "description": "Detergent pods are the latest everyday good to be targeted by &#39;green&#39; regulations limiting choices at the store or when building a new home. Here&#39;s the science - or lack of it - behind the rules."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/rochdale-by-election-referendum-gaza/?n=@",
        "title": "Rochdale by-election is referendum on Gaza, says Muslim charity boss",
        "description": "Mohammed Shafiq, CEO of the Ramadhan Foundation, says issue of Palestine will be ‘really powerful’ in the contest"
    },
    {
        "url": "https://metro.co.uk/2024/02/18/vera-wang-74-utterly-ageless-flaunts-abs-baftas-20302410/?ico=trending-module_tag_london_item-2",
        "title": "Vera Wang, 74, defies time on Baftas red carpet with truly ageless look",
        "description": "Vera looked gorgeous in her monochromatic look (Picture: Kate <b>Green</b>/BAFTA/Getty Images for BAFTA ... Boy, 17, stabbed to death in London <b>party</b> hotspot ‘I do eat McDonald’s, absolutely,’ she explained. ‘I order it every day, like two weeks on ..."
    },
    {
        "url": "https://uk.news.yahoo.com/where-do-uk-political-parties-stand-gaza-ceasefire-171714480.html",
        "title": "Where do the UK&#39;s political parties stand on a Gaza ceasefire?",
        "description": "With Labour changing its stance and backing an immediate ceasefire, here&#39;s where the main UK parties stand on the Gaza conflict."
    },
    {
        "url": "https://news.stv.tv/politics/tories-could-still-win-next-uk-election-starmer-warns-in-glasgow-speech",
        "title": "Tories could still win next election, Starmer warns in Glasgow speech",
        "description": "Keir Starmer has warned the Tories could still win the next UK general election – despite the party consistently polling around 20 points ahead of their rivals. Speaking to Scottish Labour members on the last day of the party’s conference in Glasgow, the Labour leader took aim at the SNP for claiming Labour is almost certain to win the next ballot."
    },
    {
        "url": "https://www.thenational.scot/news/24127352.alba-save-scotlands-oil-refinery-and-treble-profitability/",
        "title": "Alba: Save Scotland&#39;s only oil refinery &#39;and treble its profitability&#39;",
        "description": "SAVING Scotland’s only oil refinery from closure with government investment could see its profitability treble, Alba’s depute leader said"
    },
    {
        "url": "https://www.scotsman.com/news/politics/sir-keir-starmer-says-north-sea-oil-and-gas-will-continue-for-decades-to-come-during-scottish-labour-party-speech-4523081",
        "title": "Sir Keir Starmer says North Sea oil and gas will continue ‘for decades to come’ during Scottish Labour <b>Party</b> speech",
        "description": "Sir Keir Starmer has insisted work in the North Sea oil and gas sector will continue “for decades to come” as his party continues to face criticism from the industry. It came as the UK Labour leader made a direct appeal to Scots who “have found a new political home with the SNP” to return to his party."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/18/keir-starmer-pledges-north-sea-oil-and-gas-work-will-continue-for-decades-to-come-full-speech/",
        "title": "Keir Starmer pledges North Sea oil and gas work will continue for ‘decades to come’ — full speech",
        "description": "Keir Starmer has pledged North Sea oil and gas will continue to provide jobs in Scotland “for decades to come”. He also committed his party to creating a publicly-owned energy company headquartered in Scotland if it wins the general election later this year."
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/24120992.letters-encouraging-people-bathe-swale/",
        "title": "Letters: Should we be encouraging people to bathe in Swale?",
        "description": "I have to agree with NJL Gardener about the state of the River Swale and the misleading story about the River Swale on the"
    },
    {
        "url": "https://inews.co.uk/news/politics/were-fking-up-so-much-no-10-despair-after-tories-double-defeat-2911108",
        "title": "‘We’re f**king up so much’: No 10 despair after Tories’ double defeat",
        "description": "But in the immediate aftermath of the Tories’ double defeat, there was little evidence of any serious manoeuvres against Sunak. How long that will hold remains to be seen, particularly if next month’s Budget fails to shift the polls and flights to Rwanda do not take off."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-68330487",
        "title": "Farmers have right to protest peacefully, says Conservative MS",
        "description": "Farmers protesting against a new <b>green</b> scheme have the right to do so peacefully ... Similar moves by environmentalists led the conservative <b>party</b> to try and introduce anti-protest legislation at Westminster - but it was overturned by the House of Lords."
    },
    {
        "url": "https://uk.news.yahoo.com/save-scotlands-only-oil-refinery-160952357.html",
        "title": "Save Scotland&#39;s only oil refinery &#39;and treble its profitability&#39;, Alba say",
        "description": "SAVING Scotland’s only oil refinery from closure with government investment could see its profitability treble, Alba’s depute leader said as the party launched a new campaign"
    },
    {
        "url": "https://www.libdemvoice.org/a-great-gain-and-2-strong-hold-in-this-weeks-by-elections-74666.html",
        "title": "A great gain and 2 strong holds in this week’s by-elections",
        "description": "There were a couple of great results in this week&#39;s local government by-elections. In the Four Marks and Medstead ward of East Hampshire District Council, Roland Richardson held on to the seat with 62."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/new-belfast-city-centre-hotel-at-site-of-old-police-station-approved-despite-deep-concern-from-the-greens-and-alliance-4522954",
        "title": "New Belfast City Centre hotel at site of old police station approved despite “deep concern” from the Greens and Alliance",
        "description": "A new Belfast City Centre hotel has been approved at the site of a listed building despite concerns from the Green Party and Alliance Party."
    },
    {
        "url": "https://www.theguardian.com/world/live/2024/feb/18/europe-live-talks-continue-at-munich-security-conference?page=with:block-65d1e59c8f08fee2fe08d347",
        "title": "Europe live – EU needs to be more united if it wants role in Middle East, says foreign policy chief",
        "description": "Josep Borrell says many member states want to play their own game over Middle East and there needs to be a ‘clear prospect for the Palestinian people’"
    },
    {
        "url": "https://www.thenational.scot/news/24126908.unionist-peers-form-group-to-rein-snp-spending-independence/",
        "title": "Unionist peers form group &#39;to rein in SNP spending on independence&#39;",
        "description": "A CROSS-PARTY group of Unionist peers which includes a former deputy first minister is aiming to prevent the Scottish Government spending on"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/news-opinion/rishi-sunak-says-plan-working-28648350",
        "title": "Rishi Sunak says his plan is working - after another shambolic week, does anyone believe him?",
        "description": "The leader of the opposition was criticised for not acting quickly enough over the situation. He insisted that he took &quot;decisive action&quot;, but Martin Forde - who led the 2022 review into antisemitism in the Labour Party - said the handling of the Rochdale situation had been &quot;pretty shambolic&quot;. Matters were to get worse, however."
    },
    {
        "url": "https://www.forres-gazette.co.uk/news/town-hall-birthday-bash-supports-local-businesses-342439/",
        "title": "Lorna Creswell&#39;s Glitz &#39;n&#39; Glam birthday <b>party</b> at Forres Town Hall promotes local businesses and groups",
        "description": "A MUCH-loved volunteer, great-grandmother and former Moray Councillor used her birthday celebrations to promote local businesses and groups. Lorna Creswell BEM invited family, friends and associates to her ‘Glitz ‘n’ Glam’ party at Forres Town Hall to show off the venue and inspire ideas for similar fun, community events."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/18/keir-starmer-rishi-sunak-byelections-rochdale",
        "title": "Keir Starmer’s had a torrid fortnight, but the big picture is bleakest for Rishi Sunak",
        "description": "The double whammy of byelection humiliations for the Tories matters more than Labour’s horror show in Rochdale"
    },
    {
        "url": "https://www.cambridgeindependent.co.uk/news/protest-over-gaza-disrupts-cambridge-city-council-budget-mee-9353443/",
        "title": "Protest over Gaza disrupts Cambridge City Council budget meeting",
        "description": "Protesters disrupted the city council’s budget meeting to urge it to call for an immediate ceasefire in Gaza. Members of the public chanted “ceasefire now”, preventing the meeting last Thursday (February 15) from continuing."
    },
    {
        "url": "https://news.sky.com/story/adam-boulton-sunaks-by-election-nightmare-starmers-headache-in-rochdale-and-why-a-may-election-is-a-distinct-possibility-13074597",
        "title": "Adam Boulton: Sunak&#39;s by-election nightmare, Starmer&#39;s Rochdale headache, and why a May election is a distinct possibility...",
        "description": "Sir Keir Starmer&#39;s Labour Party has now broken into the record books with six by-election gains from the Conservatives following big wins in Kingswood and Wellingborough, but the tables will be turned at the upcoming Rochdale by-election."
    },
    {
        "url": "https://www.cambridgeindependent.co.uk/news/cambridge-city-council-agrees-2-99-council-tax-rise-after-l-9353439/",
        "title": "Cambridge City Council agrees 2.99% council tax rise after Labour knocks back Lib Dem proposals",
        "description": "Cambridge City Council has agreed a 2.99 per cent increase to its portion of the council tax bill in a budget that includes a £1million for a redesign of its Guildhall headquarters. It means the ‘average’ Band D household will pay £225.39 to the Labour-run council for the year from April, up £6.54."
    },
    {
        "url": "https://www.heraldscotland.com/news/24124563.starmers-five-problems-labour-try-win-back-scotland/?ref=rss",
        "title": "Starmer&#39;s five problems as Labour try to win back Scotland",
        "description": "Sir Keir Starmer will today close the three-day Scottish Labour conference in Glasgow with hopes high of victory at the general election"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/poll-only-a-third-of-2019-conservative-voters-will-back-tories-at-next-general-election_uk_65cde54be4b0087d43c93acb?mc_cid=5e83b15a6f",
        "title": "Only A Third Of 2019 Conservative Voters Will Back Tories At Next General Election, Says Poll",
        "description": "But, a week of turmoil for Labour – where it watered down a spending pledge on <b>green</b> energy projects and struggled with a row over controversial comments made by two of the <b>party</b>’s then by-election candidates – saw them slump back to a 12-point lead ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/top-15-democratic-socialist-countries-181857008.html",
        "title": "Top 15 Democratic Socialist Countries In Europe",
        "description": "In this article, we will look at the top 15 democratic socialist countries in Europe. We have also discussed the meaning and characteristics of a social democratic country. If you want to skip our detailed analysis,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/keir-starmer-pledges-north-sea-32153693.amp",
        "title": "Keir Starmer pledges North Sea oil and gas will continue to provide jobs for &#39;decades to come&#39;",
        "description": "Speaking at the Scottish Labour conference, Starmer also warned the Conservatives could still win the next general election."
    },
    {
        "url": "https://www.itv.com/news/2024-02-18/labour-ready-for-difficult-decisions-in-new-age-of-insecurity-keir-starmer-says",
        "title": "Labour ready for difficult decisions in new age of insecurity, Keir Starmer says",
        "description": "The UK Labour leader will use a speech to his party’s Scottish conference in Glasgow on Sunday to set out his credentials to be the UK’s next prime minister. | ITV National News"
    },
    {
        "url": "https://www.birminghammail.co.uk/black-country/how-schoolboys-shocking-daylight-execution-28645424",
        "title": "How schoolboy&#39;s shocking daylight execution filmed on mobile phone unfolded",
        "description": "It was a shocking execution in broad daylight, chillingly filmed on a mobile phone for all to see. As he stumbled to his feet after suffering a wound to his heart, schoolboy Joseph Riches clambered into a car in a desperate bid to flee his four attackers."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/george-galloway-celebrity-politician-big-28640076",
        "title": "George Galloway: The &#39;celebrity politician&#39; - and Big Brother cat - who fancies his chances in Rochdale",
        "description": "The former MP has been a thorn in Labour&#39;s side for decades. He&#39;s now hoping to embarrass the party at the Rochdale by-election. If he wins, it will be the fourth place he&#39;s represented in Parliament."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/18/sunak-is-warned-spending-squeeze-could-lead-to-conservative-party-wipeout-at-election",
        "title": "Sunak is warned spending squeeze could lead to Conservative <b>party</b> wipeout at election",
        "description": "As fresh party infighting erupts after two byelection losses, the right are targeting public service funding to pay for tax cuts while others urge restraint"
    },
    {
        "url": "https://www.kentonline.co.uk/ashford/news/council-cant-be-trusted-to-run-a-bath-let-alone-a-cinema-301902/",
        "title": "Concerns over Ashford Borough Council&#39;s takeover of Picturehouse cinema at Elwick Place",
        "description": "The council is now run by an Ashford Independents/<b>Green Party</b> coalition after the Conservative <b>Party</b>, which launched Elwick Place, lost out in last year’s local elections. The £75m Elwick Place development opened in 2018 Cllr Noel Ovenden (Ash Ind), the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/unionist-peers-form-cross-party-100643561.html",
        "title": "Unionist peers form cross-<b>party</b> group &#39;to rein in SNP spending on independence&#39;",
        "description": "A CROSS-PARTY group of Unionist peers which includes a former deputy first minister is aiming to prevent the Scottish Government spending on issues such as independence and foreign engagement"
    },
    {
        "url": "https://www.sundaytimes.lk/240218/columns/satellite-in-motion-549385.html",
        "title": "Satellite in motion",
        "description": "Still, here you go again! First, we heard you are trying to resurrect the <b>party</b> that swept you into power 30 years ago, ending 17 years of <b>Green</b> rule. That was the ‘Peoples’ Alliance’ or the ‘PA’. Its symbol was the chair. That <b>party</b> was later ..."
    },
    {
        "url": "https://www.thesun.co.uk/tvandshowbiz/25673377/kylie-jenner-teases-birthday-bash-for-kids-stormi-aire/",
        "title": "Kylie Jenner teases massive birthday bash for kids Stormi and Aire with big bag of balloons and presents at $36M mansion",
        "description": "KYLIE Jenner has teased a massive birthday bash for her kids Stormi and Aire with a big bag of balloons and presents inside her $36million mansion. On Wednesday, The Kardashians star posted a"
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "General election is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the <b>party</b> must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    }
]