[
    {
        "url": "https://uk.style.yahoo.com/throw-corned-beef-potato-salad-230125121.html",
        "title": "Throw Some Corned Beef In Your Potato Salad For A St. Patrick&#39;s Day Upgrade",
        "description": "For a delectable Saint Patrick&#39;s Day feast, consider adding corned beef to your potato salad to honor the culinary history and cultural heritage of Ireland."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/21/greens-urge-labour-to-switch-weedkiller-funding-to-community-services/",
        "title": "Greens urge Labour to switch weedkiller funding to community services",
        "description": "Green councillors want to use money that has been set aside to bring back weedkiller to help fund public services"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/gaza-ceasefire-vote-live-protesters-32176072",
        "title": "Gaza ceasefire vote LIVE: Commons Speaker comes close to tears as he apologises after MPs walk out",
        "description": "Large groups of protesters have congregated outside Parliament demanding a ceasefire in the Israel-Hamas war ahead of a tense Commons debate triggered by an SNP motion"
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?page=with:block-65d652fe8f08aff1ffae2c4e&filterKeyEvents=false",
        "title": "Speaker apologises after Commons descends into chaos over Gaza votes – UK politics live",
        "description": "Labour amendment calling for immediate Gaza ceasefire passes after government and SNP walkout"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fox-news-townhall-south-carolina-latest-b2499726.html",
        "title": "Trump threatened by New York AG over payment of civil fraud fine: Live",
        "description": "Letitia James issues warning to Republican after he struggles with questions on Navalny, illegal immigration and classified documents at Fox town hall in South Carolina"
    },
    {
        "url": "https://news.sky.com/story/gaza-ceasefire-debate-live-updates-speaker-apologises-after-tory-and-snp-mps-storm-out-of-commons-as-labour-amendment-passes-12593360",
        "title": "Politics latest: Motion of no confidence in Speaker after Gaza debate descends into chaos",
        "description": "This is partly because the Muslim community is one of Labour&#39;s most loyal voter bases, which has almost exclusively stuck with the <b>party</b> in recent elections. But potentially, no more. I&#39;m invited into the <b>Green</b> Lane mosque where there are several events ..."
    },
    {
        "url": "https://worcesterobserver.co.uk/news/worcester-news-worcester-council-to-delve-into-ways-of-tackling-floods/",
        "title": "Worcester council to delve into ways of tackling floods",
        "description": "The move defers a motion from <b>Green Party</b> Coun Karen Lewing at Tuesday’s full council meeting which would have asked for the authority’s managing director to call for more government aid to tackle the floods. But Labour Coun Richard Udall, who proposed ..."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24135620.oxfordshire-county-council-sets-budget-10-hour-debate/",
        "title": "Oxfordshire County Council budget slammed as &#39;nasty mess&#39;",
        "description": "Oxfordshire Liberal Democrat and <b>Green</b> Alliance councillors sided with the Labour <b>party</b> amendment over the Conservative one. Passage of the budget saw a 4.99 per cent council tax rise which is the maximum increase allowed. READ MORE: New homes planned ..."
    },
    {
        "url": "https://news.sky.com/story/the-view-of-the-ceasefire-vote-from-a-birmingham-mosque-13077710",
        "title": "The view of the ceasefire vote from a Birmingham mosque",
        "description": "Ever since the Hamas attack on Israel on 7 October, interested parties have been watching not only the government&#39;s response to Israel and Gaza, but the opposition&#39;s stance too."
    },
    {
        "url": "https://www.standard.co.uk/news/london/parliament-vote-gaza-ceasefire-palestine-israel-mps-commons-b1140690.html",
        "title": "&#39;Thousands&#39; rally outside Parliament urging MPs to vote for Gaza ceasefire",
        "description": "A large crowd of protesters gathered outside Parliament on Wednesday urging MPs to vote for an immediate ceasefire in Gaza as they debated a motion in the House of Commons. The Palestine Solidarity Campaign (PSC) said the group was made up of “thousands”, with people still “arriving in droves” as a line stretched down to Millbank."
    },
    {
        "url": "https://www.pharmiweb.com/press-release/2024-02-21/asia-green-biotechnology-corp-announces-agreement-to-acquire-burton-growers-ltd-and-green-sight-ag",
        "title": "Asia <b>Green</b> Biotechnology Corp. Announces Agreement to Acquire Burton Growers Ltd. and <b>Green</b> Sight Agri-Holdings Ltd.",
        "description": "CALGARY, AB / ACCESSWIRE / February 21, 2024 / ASIA GREEN BIOTECHNOLOGY CORP. (CSE:ASIA) (&quot;Asia Green&quot; or the &quot;Company&quot;) is pleased to announce that it has entered into a non-binding letter of intent (&quot;LOI&quot;) to acquire all of the issued and outstanding shares of"
    },
    {
        "url": "https://uk.news.yahoo.com/trump-tops-biden-age-mental-220640597.html",
        "title": "Trump tops Biden on age and mental and physical fitness in new poll",
        "description": "“When the hypothetical matchup is expanded to include independent and <b>Green Party</b> candidates, Biden receives 38 per cent support, Trump receives 37 per cent support, independent candidate Robert F. Kennedy, Jr. receives 15 per cent support, independent ..."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/lisburn--castlereagh-green-fingered-28678224",
        "title": "Lisburn &amp; Castlereagh <b>green</b> fingered project delivers tens of thousands of trees at same cost of NI Centenary and EU Xmas tree",
        "description": "The local authority is to deliver a forest of trees on a similar budget to NI Centenary plantings and a single Christmas tree"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/tributes-paid-to-brave-young-rustington-woman-molly-made-the-world-a-better-place-4528155",
        "title": "Tributes paid to brave young Rustington woman – ‘Molly made the world a better place’",
        "description": "Molly <b>Green</b> passed away on February 1 from pneumonia and flu ... Because of her love of people, Molly held a big birthday <b>party</b> every year. Last June, scores of people turned out for her 21st. Molly’s funeral, which was held on February 9 and followed ..."
    },
    {
        "url": "https://www.thenational.scot/news/24134998.labour-threatened-lindsay-hoyles-job-gaza-motion-rule-change/?nid=1457&u=6bd80b6c39f56141f0a52eb7ea3b54b6&date=210224",
        "title": "Labour &#39;threatened Lindsay Hoyle&#39;s job&#39; before Gaza motion rule change",
        "description": "LABOUR pressured Lindsay Hoyle to break with conventions governing the UK constitution and allow their amendment on the SNP’s Gaza motion to"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869257/Rishi-Sunak-pylons-countryside-Sir-John-Hayes",
        "title": "Veteran Tory MP warns of pylons &#39;blotting&#39; countryside as PM blasts Labour&#39;s <b>green</b> plan",
        "description": "“As he knows, all of that, including our <b>green</b> and pleasant land, would be put at risk by the Labour <b>party</b>, which not only does not want to back our farmers but wants to impose top-down planning targets, which would concrete over the countryside that he ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13109361/mitch-mcconnell-birthday-mayorkas-impeachment-trial-trump.html",
        "title": "Fury grows at Mitch McConnell after his 82nd birthday: Republicans demand he set Mayorkas impeachment trial and accuse him of throwing <b>party</b> &#39;under the bus&#39; with border vote ...",
        "description": "Trump said at a town hall Tuesday evening that he doesn&#39;t know if he can work with Mitch McConnell, as a group of GOP senators pushes him on the Mayorkas impeachment."
    },
    {
        "url": "https://uk.news.yahoo.com/advocates-call-provincial-bill-protect-204101164.html",
        "title": "Advocates call for provincial bill that would protect muncipal staff from violence, harassment",
        "description": "&quot;The solution is very simple. Pass legislation that will hold municipal elected officers accountable for perpetrating violence and harassment,&quot; said Stiles, adding her <b>party</b> would support such a bill. <b>Green Party</b> Leader Mike Schreiner said his <b>party</b> would ..."
    },
    {
        "url": "https://www.leaderlive.co.uk/news/24134886.flintshire-council-issues-update-electric-bus-plan/",
        "title": "Flintshire Council issues update on electric bus plan",
        "description": "In a joint-statement, Lee Lavery and Karl Macnaughton, the Wales <b>Green Party</b> candidates for the General Election in North East Wales said: &quot;When are these expensive buses going to be used? &quot;We cannot understand why the buses were purchased if there was ..."
    },
    {
        "url": "https://thebristolcable.org/2024/02/bristol-mayor-marvin-rees-last-council-budget-voted-down/",
        "title": "Bristol councillors vote down Marvin Rees’ final budget after bad-tempered debate",
        "description": "Tory councillor Geoff Gollop said: “I find it baffling the <b>Green Party</b> doesn’t want to even put forward amendments to show a flavour of what you care about… Where’s your passion? Your passion is in criticising everybody and standing up for nothing ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/labours-uneasy-victory-over-gaza",
        "title": "When the lights went out",
        "description": "Shadow cabinet ministers are asking why it took an SNP motion for the <b>party</b> to shift its position on a ceasefire ... There are parallels with Labour’s rushed decision to jettison its £28bn <b>green</b> pledge, which has prompted an internal hunt for the ..."
    },
    {
        "url": "https://www.desertsun.com/elections/voter-guide/2024-03-05/california",
        "title": "Your Guide to the 2024 Elections",
        "description": "Jill Stein, 73, announced in November 2023 that she will be seeking the <b>Green Party</b>’s nomination in the 2024 presidential election. Stein, a physician and environmental activist, previously ran for president in 2012 and 2016. In a video announcing her ..."
    },
    {
        "url": "https://www.inewsguyana.com/nandlall-notes-silence-from-pnc-apnu-afc-over-hamilton-greens-calls-for-rigged-elections/",
        "title": "Nandlall notes silence from PNC, APNU &amp; AFC over Hamilton <b>Green</b>’s calls for rigged elections",
        "description": "Interpret their silence as concurrence”, Attorney General and Legal Affairs Minister Anil Nandlall has urged amid the lack of condemnation from the Peoples National Congress (PNC), the A"
    },
    {
        "url": "https://home.nzcity.co.nz/news/article.aspx?id=393437",
        "title": "Many are still coming to terms with the death of <b>Green</b> MP Efeso Collins",
        "description": "Parliament has adjourned until Tuesday -- and the Green Party has approached the Speaker about having some bereavement leave for some of its MPs. The country hasn&#39;t seen a current MP die while the House has been sitting,"
    },
    {
        "url": "https://www.iheartradio.ca/virginradio/halifax/trending/p-e-i-green-opposition-status-unlikely-even-with-tied-seats-expert-1.21831587",
        "title": "P.E.I. <b>Green</b> opposition status unlikely, even with tied seats: expert",
        "description": "However, something has changed, the third place P.E.I. <b>Green Party</b> is now tied with the opposition Liberals at three seats apiece, and, along with the fact the Greens won more of the popular vote, that has prompted calls for official opposition status from ..."
    },
    {
        "url": "https://calgary.ctvnews.ca/2024-green-shirt-day-campaign-hoping-to-inspire-100k-people-to-become-organ-donors-1.6778193",
        "title": "2024 <b>Green</b> Shirt Day campaign hoping to inspire 100K people to become organ donors",
        "description": "You can visit the <b>Green</b> Shirt Day website for more details or to learn how ... The federal Conservatives have increased their support as the <b>party</b> Canadians would vote for and the Liberals are at a statistical tie with the New Democrats, according to ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/muslim-vote-gaza-israel-snp-keir-starmer-wes-streeting-b1140571.html",
        "title": "Muslim Vote group plans to &#39;punish&#39; Labour <b>party</b> over Gaza stance",
        "description": "The Labour party has been divided on the war on Gaza since it started in October. This week, a Scottish National Party motion calling for an immediate ceasefire has caused more Labour infighting."
    },
    {
        "url": "https://www.politico.eu/article/emmanuel-macron-france-big-housing-headaches-building-green-transition-olympics/",
        "title": "Macron has a big housing headache. Olympics are making it worse",
        "description": "The French government has made tackling the housing crisis a priority in an attempt to improve living conditions for the middle class."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/21/china-us-giving-green-light-slaughter-gaza-un-security-vote/",
        "title": "China says US is giving ‘<b>green</b> light to slaughter’ in Gaza",
        "description": "Nation’s UN ambassador issues harshest criticism yet of US policy in Gaza as he warns conflict ‘spillover’ could lead to wider war"
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/row-de-selected-ex-conservative-9113694",
        "title": "Row as de-selected ex-Conservative mayor joins the Liberal Democrats",
        "description": "A row has erupted at Gloucester City Council after a councillor was deselected by the Conservatives and joined the Liberal Democrats. Councillor Collette Finnegan, who represents Abbeydale, claims she resigned after becoming disillusioned with the Tories."
    },
    {
        "url": "https://www.yorkshireeveningpost.co.uk/whats-on/things-to-do/communities-cross-paths-to-inspire-joy-and-justice-4527961",
        "title": "Communities cross paths to inspire joy and justice",
        "description": "“Thanks to Leeds Sanctuary for hosting this event, and the great range of people who were part of it” said Ed Carlisle, <b>Green Party</b> councillor for Hunslet and Riverside. “The world’s in a mess, there’s a lot to do – but a key foundation for ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/polling/2024/02/george-galloway-rochdale-by-election",
        "title": "When the lights went out",
        "description": "In the annals of political history, Rochdale isn’t far off earning the epithet “cursed”. Once the seat of child abuser Cyril Smith, the current by-election, caused by the sad death of Labour MP Tony Lloyd, has seen candidates and parties left, right and centre humiliated. (See Anoosh’s report from the seat in this week’s NS .)"
    },
    {
        "url": "https://www.thesun.co.uk/fabulous/26086845/queen-of-supercars-dubai-baby-rich-kid-birthday-party/",
        "title": "My baby is the Princess of Supercars – she got a fleet of them for her first birthday, including a Lambo at her <b>party</b>",
        "description": "Videos from the bash show Donatella driving around in a white kid’s Bentley and lime <b>green</b> Lamborghini ... on Instagram that it was “the best day ever”. The birthday <b>party</b> was hosted by Pampa Events District, a brand that works with the likes ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/gaza-ceasefire-labour-tories-snp-133525709.html",
        "title": "What Labour, the Tories and the SNP say about a Gaza ceasefire",
        "description": "The SNP, which has consistently called for a ceasefire to the Hamas-Israel war, tabled the original motion that was being debated in parliament on Wednesday. This calls for an immediate ceasefire and “an end to the collective punishment of the Palestinian people”."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/arts-and-culture/save-the-date-for-the-big-lunch-on-1-2-june-set-to-be-the-greenest-yet-4527669",
        "title": "Save the Date for The Big Lunch on 1-2 June set to be the greenest yet!",
        "description": "Today (Wednesday 21 Feb) we’re launching The Big Lunch 2024 with brand new resources packed with ideas to get the party started and make this year’s Big Lunch the greenest yet!"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13108825/Green-Party-mayor-accused-outrageous-discrimination-cutting-meat-reception-buffets-help-save-planet.html",
        "title": "<b>Green Party</b> mayor is accused of &#39;outrageous&#39; discrimination for cutting meat from reception buffets to help save the planet",
        "description": "Louis Stephen was voted as Worcester City Council first Green mayor last May. But at a full council meeting on Tuesday night he was questioned on his decision to remove meat reception food menus."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24134208.easdale-brothers-slam-politicians-future-bus-sector/",
        "title": "Easdale brothers slam politicians over future of bus sector",
        "description": "THE owners of Greenock-based bus operator McGill’s have launched a blistering broadside at politicians demanding that they ‘put up or"
    },
    {
        "url": "https://www.businessgreen.com/news/4176697/court-hearing-granted-legal-challenge-uk-australia-free-trade-deal",
        "title": "High Court hearing granted in legal challenge against UK-Australia free trade deal",
        "description": "Environmental group Feedback granted initial hearing to present case that the government failed to adequately assess climate implications of trade agreement with Australia"
    },
    {
        "url": "https://www.socialistparty.org.uk/articles/121342/21-02-2024/marching-to-save-our-steel-nationalisation-not-devastation/",
        "title": "Marching to save our steel: Nationalisation not devastation!",
        "description": "Saturday 17 February saw steel towns of South Wales take to the streets in defiance of the multinational company Tata"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24131134.roza-salih-time-embrace-new-vision-glasgow/",
        "title": "Roza Salih: It&#39;s time to embrace a new vision for Glasgow",
        "description": "In the intricate dance of governance, few tasks are as fraught with complexity and moral weight as the allocation of funds."
    },
    {
        "url": "https://news.sky.com/story/politics-live-defence-secretary-to-make-commons-statement-after-failed-nuclear-deterrent-launch-12593360?postid=7263210",
        "title": "Politics latest: Big day for Keir Starmer as MPs set to vote on Gaza ceasefire",
        "description": "In third are the Lib Dems on 9.7%, followed by Reform on 9.2%. The <b>Green Party</b> stands at 6.3%, and the SNP on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. The list of MPs asking questions to Rishi ..."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-21/most-people-dont-know-who-theyd-prefer-to-be-the-next-fm-says-new-poll",
        "title": "Most people in Wales don&#39;t know who they&#39;d prefer to be the next First Minister, says new poll",
        "description": "General Election voting intention, the poll found that Labour has a 22-point lead over the Conservatives in Wales. Labour is on 45 points, the Conservatives on 23 points, Plaid Cymru on 10 points, Reform UK on 9 points, <b>Green Party</b> on 5 points."
    },
    {
        "url": "https://en.abna24.com/story/1439369",
        "title": "Campaign to ban Israel from intl. sports competitions gets impetus - #BanIsrael",
        "description": "In December last year, a report said at least 88 Palestinian athletes have been killed in Israeli bombings in Gaza since October 7, pointing to the impact of the war on the war-torn territory’s sports fraternity."
    },
    {
        "url": "https://www.lancasterguardian.co.uk/news/national/by-election-to-be-held-after-lancaster-councillor-stands-down-from-her-role-4527054",
        "title": "By-election to be held after Lancaster councillor stands down from her role",
        "description": "Four candidates will fight for a seat on Lancaster City Council in a by-election on Thursday March 14."
    },
    {
        "url": "https://www.independent.co.uk/news/world/australasia/efeso-collins-dies-new-zealand-green-party-member-b2499654.html",
        "title": "Efeso Collins: New Zealand MP, 49, dies during charity run",
        "description": "A 49-year-old New Zealand parliamentarian died after collapsing while participating in a charity event in central Auckland on Wednesday. Efeso Collins was participating in the ChildFund Water Run to raise funds to support local communities in the Pacific at 9am in Auckland’s Britomart when he collapsed. He reportedly died at the scene."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106509/New-Zealand-Greens-MP-Efeso-Collins-49-suddenly-collapses-dies-charity-event-ChildFund-Water-Run-Auckland.html",
        "title": "New Zealand Greens MP Efeso Collins, 49, suddenly collapses and dies at charity event ChildFund Water Run in Auckland",
        "description": "New Zealand Greens MP Efeso Collins has died after running in a charity event in Auckland. The 49-year-old collapsed on Wednesday morning in Auckland after running in the ChildFund Water Run, a fundraiser for Pacific communities."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68354801?at_medium=RSS&at_campaign=KARANGA",
        "title": "Deadlock as Bristol City Council fails to approve budget",
        "description": "Councillors voted against the plans during a full council meeting at City Hall which lasted about three hours. Outgoing Labour mayor Marvin Rees&#39;s final budget proposed more than £24m of cutbacks and a 4."
    },
    {
        "url": "https://www.scotsman.com/news/people/new-festival-to-celebrate-north-east-tin-whistle-tradition-4526825",
        "title": "New festival to celebrate North east tin whistle tradition",
        "description": "A new Festival inspired by a master whistler who revived interest in a north-east musical tradition which came close to dying out will take place in March."
    },
    {
        "url": "https://www.bbc.com/news/world/asia?page=19",
        "title": "Asia",
        "description": "Beijing suggests blocking calls for an immediate ceasefire gives a “<b>green</b> light to continued slaughter&quot;. It comes after a contentious election where the largest <b>party</b> led by former-PM Imran Khan alleged vote-rigging. Protesting Indian farmers have ..."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/greens-want-to-end-free-lunches-for-councillors/",
        "title": "Greens want to end free lunches for councillors",
        "description": "This has been proposed for a number of years now by a succession of <b>Green</b> councillors as an easy cash win. A further £1 million would be saved through reduced spend on outsourced services and agency workers. Meanwhile the Greens are the only <b>party</b> ..."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/24130999.worcester-mayor-says-no-meat-allowed-receptions/",
        "title": "Worcester mayor says &#39;no meat&#39; allowed at his receptions",
        "description": "Green mayor Louis Stephen cuts meat from receptions which former mayor Alan Amos has branded &#39;discrimination&#39; against meat eaters"
    },
    {
        "url": "https://www.scotsman.com/news/opinion/letters/readers-letters-could-scotlands-disaster-movies-make-the-cut-at-the-oscars-4526670",
        "title": "Readers&#39; letters: Could Scotland&#39;s disaster movies make the cut at the Oscars?",
        "description": "Their plans for energy supply include the cessation of oil and gas extraction from the North Sea. They are in partnership with the <b>Green Party</b>, who would turn off the oil and gas taps themselves given the chance.The SNP/<b>Green</b> stance over oil and gas ..."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/21/green-party-mp-efeso-collins-death-childfund-water-charity-run",
        "title": "Shock in New Zealand as <b>Green party</b> MP Efeso Collins dies after charity run",
        "description": "“It is with profound shock and sadness that we can confirm that <b>Green Party</b> MP Efeso Collins has died,” said a statement from the <b>Green party</b>. “We are absolutely devastated. A beautiful family has lost a dedicated father, husband, and community leader."
    },
    {
        "url": "https://www.devonlive.com/news/devon-news/north-devon-legend-peter-christie-9114711",
        "title": "North Devon legend Peter Christie dies, aged 73",
        "description": "Flags across Bideford are flying at half mast following the death of former mayor, historian and popular <b>Green Party</b> councillor Peter Christie. Mr Christie died following an illness aged 73 on Tuesday, February 20. A prolific author, he was Britain’s ..."
    },
    {
        "url": "https://www.bristol247.com/news-and-features/news/blame-game-budget-not-approved/",
        "title": "Blame game as budget not approved",
        "description": "<b>Green Party</b> councillors have refused to vote for Bristol’s new budget, calling its cuts to frontline services “cruel and unrealistic”. At a full council meeting on Tuesday evening, the Greens joined the Tories and Lib Dems to block the passing of the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/suspended-lib-dem-denies-claims-28668642",
        "title": "Suspended Lib Dem denies claims he was campaigning for George Galloway in Rochdale",
        "description": "The <b>Green Party</b> candidate in the by-election has also pulled out of the race due to &#39;regrettable&#39; social media posts he made &#39;a number of years ago&#39;. However, both candidates will still appear on the ballot papers next to the logos of the parties which ..."
    },
    {
        "url": "https://www.northdevongazette.co.uk/news/home/1429157/tributes-pour-in-for-popular-bideford-historian-and-councillor-peter-christie.html",
        "title": "Tributes pour in for popular Bideford historian and councillor Peter Christie",
        "description": "Flags across Bideford have been flying at half-mast for the popular <b>Green party</b> councillor, who served as mayor of the town four times as well as a Torridge district councillor for the past 33 years, as well as its chairman in 2014. Paying tribute to Peter ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/snp-piles-pressure-labour-over-28673716",
        "title": "SNP piles pressure on Labour over £28bn <b>green</b> spending pledge",
        "description": "The SNP in Westminster is putting pressure on Labour regarding its reduced £28 billion pledge for <b>green</b> spending, demanding a commitment to the initial investment. Earlier this month, Sir Keir Starmer&#39;s <b>party</b> announced a significant reduction in their ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cg6dg0qwz19o.amp",
        "title": "Residents to &#39;absolutely notice&#39; service cuts",
        "description": "<b>Green Party</b> group leader Julian Dean said he felt Shropshire deserved better. &quot;Years of under-funding by the Conservative <b>Party</b>, plus a cowardly refusal to tackle the funding of social care has led to this position,&quot; he added. &#39;We don&#39;t really have any ..."
    },
    {
        "url": "https://inews.co.uk/inews-lifestyle/pension-only-7k-year-retrained-keep-working-70s-2899800?ico=in-line_link",
        "title": "My pension is only £7k a year – I’ve retrained so I can keep working into my 70s",
        "description": "It was rubbish for building a rich pension pot. When I got back from my travels, I became a journalist, and eventually took a role as the head of communications for the <b>Green Party</b>. When I fell pregnant in my thirties, I thought I would set up a magazine ..."
    }
]