[
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-labour-green-manifesto-sunak-election-plans-b2485919.html",
        "title": "Keir Starmer is about to make up his mind about Labour’s £28bn albatross – its <b>green</b> manifesto",
        "description": "The party is likely to focus on what it wants to achieve instead of the arbitrary £28bn number, writes John Rentoul"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/27/farmers-streets-europe-net-zero-protests/",
        "title": "Farmers take to streets across Europe in net zero revolt that threatens EU policy as elections loom",
        "description": "Protests sweeping the continent take their cue from tractor demos that delivered resounding success at the polls in the Netherlands"
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-mind-labour-163619181.html",
        "title": "Voices: Keir Starmer is about to make up his mind about Labour’s £28bn albatross – its <b>green</b> manifesto",
        "description": "He is serious about “no complacency”, about fighting for every vote as if the <b>party</b> is five points behind ... to the Today programme in advance of a speech to economists and <b>green</b> think tanks in which she will say that Labour needs to focus on what ..."
    },
    {
        "url": "https://www.ft.com/content/ae26e6fe-59ea-4ee4-b531-a5e05b357261",
        "title": "Finland to elect president for troubled times after Nato entry",
        "description": "Stubb, a cosmopolitan Finn known for posting on social media about his Iron Man and triathlon exploits, has toned down his style, experts say, and instead focused on his eight years in government, including warning of the risks of Russian aggression back in 2008 when Moscow invaded Georgia."
    },
    {
        "url": "https://www.bbc.com/news/uk-northern-ireland-68113842",
        "title": "Stormont: Details of deal offered to DUP beginning to emerge",
        "description": "It is still unclear whether the Democratic Unionist Party (DUP) is prepared to accept a deal from the government and return to Stormont. But the contours of a possible deal are starting to emerge. The DUP has been boycotting devolved government in protest at Northern Ireland&#39;s Brexit deal, now called the Windsor Framework"
    },
    {
        "url": "https://news.sky.com/story/what-pms-north-sea-drill-plan-might-mean-for-jobs-and-the-transition-to-net-zero-13056903",
        "title": "What PM&#39;s North Sea drill plan might mean for jobs - and the transition to net zero",
        "description": "Tom Clarke, Sky News&#39; science and technology editor, looks at the proposed closure of Grangemouth, Scotland&#39;s last remaining oil refinery."
    },
    {
        "url": "https://www.irishnews.com/opinion/donaldson-finally-confronts-unionisms-brexit-100-percenters-newton-emerson-CS7TY3LHS5DPLNANXUXGY76L7Y/",
        "title": "Donaldson finally confronts unionism’s Brexit ‘100 percenters’ – Newton Emerson",
        "description": "Other parties backed the <b>Green Party</b> proposal due to lack of progress by Castlebrooke Investments, the developer that bought the site in 2016. Compulsory purchase remains unlikely for multiple reasons, including the length and complexity of the vesting ..."
    },
    {
        "url": "https://www.edp24.co.uk/news/24069905.norwich-councillors-call-action-child-poverty-city/",
        "title": "Norwich councillors call for action on child poverty in city",
        "description": "Several motions have been put forward by Labour, <b>Green Party</b> and Liberal Democrat members, urging the authority to address the growing issue and to put pressure on the government to do more to help. This includes lobbying to end the two-child benefit ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/opinion/columnists/sam-mcbride/donaldsons-in-too-deep-to-back-away-from-deal-but-with-his-party-restive-and-suspicious-hes-acutely-vulnerable/a1031001091.html",
        "title": "Donaldson’s in too deep to back away from deal – but with his <b>party</b> restive and suspicious, he’s acutely vulnerable",
        "description": "A fortnight before Christmas, a senior unionist rang about the DUP’s talks with the Government. At the end of the conversation, the individual said of the proposed deal on the Irish Sea border: “I do think if this goes through that it’s the end."
    },
    {
        "url": "https://www.politico.eu/article/teresa-ribera-climate-change-europe-conservatives-fueling-far-right-green-deal-crusade/",
        "title": "EU conservatives are fueling far right with <b>Green</b> Deal crusade, Spain’s deputy PM warns",
        "description": "They tried to emulate the far right to avoid the far right. At the end, everybody goes towards the far right,’ Teresa Ribera told POLITICO."
    },
    {
        "url": "https://uk.news.yahoo.com/everyone-knows-tories-failed-says-001711017.html",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "The Conservatives are yet to announce the candidate who will be replacing Alok Sharma. Meanwhile the Liberal Democrats have chosen Helen Belcher, while Carolyne Culver will be standing for the <b>Green Party</b>, and Adrian Abbs as an independent."
    },
    {
        "url": "https://www.taipeitimes.com/News/editorials/archives/2024/01/28/2003812719",
        "title": "EDITORIAL: What Wang Zhian fails to see",
        "description": "Online talk show The Night Night Show with Hello (賀瓏夜夜秀) sparked controversy with an episode aired on Monday, in which guest Wang Zhian (王志安), a Chinese journalist who lives in Tokyo after being blacklisted by Beijing,"
    },
    {
        "url": "https://www.salon.com/2024/01/27/so-much-for-moving-to-europe-allies-are-plotting-an-eu-takeover_partner/",
        "title": "So much for moving to Europe: Trump&#39;s allies are plotting an EU takeover",
        "description": "the architect of Europe’s <b>Green</b> Deal and the newly deputized leader of the Dutch center-left coalition. We need your help to stay independent To everyone’s surprise, however, Wilders’ <b>party</b> exceeded expectations, leading the field with 23% of the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/shock-extreme-poverty-affecting-children-060000644.html",
        "title": "Shock at &#39;extreme poverty&#39; affecting children in the city prompts call for action",
        "description": "Norwich councillors are calling for action following damning reports children are going hungry and are suffering from health issues caused by malnourishment."
    },
    {
        "url": "https://timesofmalta.com/articles/view/patients-bearing-cost-healthcare-failures-adpd.1080540",
        "title": "Patients bearing cost of healthcare failures – ADPD",
        "description": "A lack of support for some health conditions is forcing patients to turn to private healthcare for treatment, Malta’s <b>green party</b> said on Saturday. Addressing a press conference in Valletta, ADPD chairperson Sandra Gauci said a lack of access to ..."
    },
    {
        "url": "https://www.standard.co.uk/comment/state-crumbling-tories-conservative-party-pretend-tax-cuts-b1135033.html",
        "title": "Tax cuts in this economy? This Tory obsession is a fiscal scorched earth strategy aimed at Labour",
        "description": "The longer answer is the same, but involves several hundred words about the internal dynamics of the Conservative <b>Party</b>. Should there be money to ... public services and his flagship £28 billion of <b>green</b> investment, which is becoming something of ..."
    },
    {
        "url": "https://uk.yahoo.com/?_fsig=1mDUqZpB_Fvki2eGrvjX7g--~A",
        "title": "Yahoo UK | News, email and search",
        "description": "Protesters stood up and unfurled Palestinian flags in the public gallery at a Lambeth Council meeting after Labour councillors voted against a motion brought by the <b>Green Party</b>."
    },
    {
        "url": "https://www.billboard.com/music/music-news/primary-wave-billboard-no-1s-pre-grammy-party-date-details-1235589994/",
        "title": "Primary Wave to Celebrate Billboard No. 1s at Pre-Grammy <b>Party</b>: Date &amp; Details",
        "description": "Independent publishing company Primary Wave is teaming up with Billboard to celebrate Billboard No. 1s during Grammy Week with their 17th annual pre-Grammy party on Feb. 3."
    },
    {
        "url": "https://www.standard.co.uk/news/world/finland-election-2024-presidential-race-vote-date-candidates-b1135151.html",
        "title": "2024 Finnish presidential election: What you need to know",
        "description": "A Finnish president must be a native-born Finnish citizen and be directly elected by universal suffrage for a six-year term."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/tata-steel-port-talbot-swansea-28521383",
        "title": "Conservative councillors back motion calling on Tata Steel to keep a blast furnace open at Port Talbot",
        "description": "He said he and others were making their concerns known within the <b>party</b>. Labour councillor and deputy council ... innovation and collaborate with our varied customer base to supply <b>green</b> steel via electric arc furnace steel-making, using the abundance ..."
    },
    {
        "url": "https://www.insider.co.uk/news/scottish-government-starts-four-day-31955046?int_source=nba",
        "title": "Scottish Government starts four day week trial",
        "description": "Scottish <b>Green Party</b> finance spokesperson Ross Greer welcomed the announcement, having already adopted a four day working week within the <b>party</b> - reporting positive results. “We introduced a four day work for Scottish <b>Green</b> staff in 2022 and have seen ..."
    }
]