[
    {
        "url": "https://www.mandurahmail.com.au/story/8517619/centre-right-stubb-wins-finnish-presidential-election/",
        "title": "Centre-right Stubb wins Finnish presidential election",
        "description": "Centre-right Alexander Stubb has declared victory over liberal Green Party member Pekka Haavisto in Finland&#39;s presidential election."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13071201/Jermaine-Pennant-links-arms-actress-Charlotte-Kirk-ex-footballer-bounces-dumped-Jess-Impiazzi-cheating-dominatrix-Ibiza-stag-do.html",
        "title": "Jermaine Pennant links arms with actress Charlotte Kirk as ex-footballer bounces back after being dumped by Jess Impiazzi for &#39;cheating with a dominatrix on Ibiza stag do&#39;",
        "description": "Jermaine Pennant is back on the dating scene as he enjoyed a lunch date with Charlotte Kirk in London on Sunday."
    },
    {
        "url": "https://www.politico.eu/article/alexander-stubb-finland-election-nato-russia-eu-ukraine-war/",
        "title": "Former Finland PM Alexander Stubb wins presidential election",
        "description": "Stubb, who becomes commander-in-chief and will lead his country’s foreign policy, has vowed a hard line against Russia."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071997/Labours-green-plans-40-000-farming-jobs-Wales-England.html",
        "title": "Labour&#39;s controversial <b>green</b> plans could cost 40,000 farming jobs if expanded from Wales to England",
        "description": "Steve Barclay, the Environmental Secretary has labelled Labour&#39;s controversial green plans &#39;ill thought-out&#39; - amid fears the policy could cost 40,000 farming jobs"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/11/gove-overhaul-planning-laws-help-young-onto-property-ladder/",
        "title": "Gove to overhaul planning laws to help young onto property ladder",
        "description": "New rules scrap size and time limit on turning office blocks into homes and pressure councils to build in brownfield sites"
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/water-bosses-to-face-ban-on-bonuses-but-move-too-weak-and-feeble-say-liberal-democrats/",
        "title": "Water bosses to face ban on bonuses - but move &#39;too weak and feeble&#39;, say Liberal Democrats",
        "description": "Labour candidate &#39;wrong&#39; to say Israel allowed 7 October attack Labour&#39;s by-election candidate in Rochdale was &quot;completely wrong&quot; to say Israel deliberately allowed the 7 October massacre to give it the &quot;<b>green</b> light&quot; to invade Gaza, the <b>party</b>&#39;s UK campaign ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68257375",
        "title": "Wellingborough: Calls for action on gangs at by-election debate",
        "description": "Calls for more visible policing and new initiatives to draw young people away from gangs have been heard in a BBC East Wellingborough by-election discussion. The town, facing a by-election on Thursday, is still haunted by the death of teenager Dylan Holliday, who was stabbed 13 times."
    },
    {
        "url": "https://www.thesun.co.uk/news/25871500/sir-keir-starmer-azhar-ali-israel/",
        "title": "Fury as Sir Keir Starmer stands by candidate who blames Israel for October 7 massacre",
        "description": "SIR Keir Starmer has sparked fury by standing by a candidate who blamed Israel for the October 7 massacre. Labour’s leader was rapped for appeasing anti-Semitism. Sir Keir refused to withdraw"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-azhar-ali-rochdale-election-offensive-israel-claims-b1138450.html",
        "title": "Labour Rochdale by-election candidate apologises for ‘deeply offensive’ Israel claims",
        "description": "A Labour by-election candidate has apologised for his “deeply offensive” comments, after he reportedly said Israel allowed Hamas to carry out its October 7 attack to provide grounds to invade Gaza."
    },
    {
        "url": "https://news.sky.com/story/labour-candidate-wrong-to-say-israel-allowed-7-october-attack-13069105",
        "title": "Labour candidate &#39;wrong&#39; to say Israel allowed 7 October attack",
        "description": "Remarks made by Azhar Ali have been branded &quot;warped&quot; and &quot;disgraceful&quot; by the Jewish community, which fears they could further fuel hostility, but with the deadline for nominations closed it is too late for the party to replace him."
    },
    {
        "url": "https://uk.movies.yahoo.com/katie-holmes-sofia-richie-grainge-192610992.html",
        "title": "Katie Holmes, Sofia Richie Grainge and More Attend Prada Beauty <b>Party</b> During NYFW",
        "description": "There was Katie Holmes, dressed in a cozy gray cardigan and <b>green</b> shiny pencil skirt ... Launch Gallery: Katie Holmes and Sofia Richie Attend Prada Beauty <b>Party</b> at New York Fashion Week"
    },
    {
        "url": "https://www.irishnews.com/news/world/finns-choose-centre-right-stubb-as-president-preliminary-results-show-IDLL2DKHUVPOZLXKKYZHFLXU2I/",
        "title": "Finns choose centre-right Stubb as president, preliminary results show",
        "description": "Initial results suggested Alexander Stubb is likely to finish ahead of independent candidate Pekka Haavisto from the green left."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071759/eco-zealots-Monet-masterpiece-environmental-protest-soup-Mona-Lisa.html",
        "title": "Now eco-zealots target Monet masterpiece in environmental protest, splashing soup over Le Printemps just weeks after copycat art attack on Da Vinci&#39;s Mona Lisa in The Louvre",
        "description": "The Musee des Beaux-Arts in Lyon, France &#39;s third largest city, said in a statement that the attack on Claude Monet&#39;s &#39;Le Printemps&#39; (Spring) took place at 3.30pm local time on Saturday."
    },
    {
        "url": "https://www.investing.com/news/world-news/centreright-stubb-leads-finlands-presidential-vote-in-early-results-3300108",
        "title": "Centre-right Stubb leads Finland&#39;s presidential vote in early results",
        "description": "HELSINKI (Reuters) -Alexander Stubb of the centre-right National Coalition <b>Party</b> led in the run-off vote for Finland&#39;s next president on Sunday, with 52.7% support in early results, justice ministry data showed. The liberal <b>Green Party</b> member Pekka ..."
    },
    {
        "url": "https://uk.news.yahoo.com/stubb-leads-finlands-presidential-election-180503427.html",
        "title": "Stubb leads Finland&#39;s presidential election with 52.7% in early results",
        "description": "Centre-right Alexander Stubb of the National Coalition Party led in the run-off of Finland&#39;s presidential election on Sunday, with 52.7% support from ballots cast in advance, justice ministry data showed."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/11/starmer-and-reeves-should-listen-to-browns-call-for-action-on-child-poverty",
        "title": "Starmer and Reeves should listen to Brown’s call for action on child poverty",
        "description": "Letters: Susan Treagus thinks Labour’s top team should ask the former chancellor for policy help, Shelagh Young says destitute families deserve more, and Les Bonney advocates reading the poem Timothy"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24112551.celtic-humza-yousaf-charge-makes-green-around-gills/",
        "title": "Celtic: Humza Yousaf being in charge makes me <b>green</b> around the gills",
        "description": "It showcases ingenuity and a pleasing can-do attitude that doesn’t mess about if you want to access power very quickly."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/11/labour-donor-urges-party-borrow-billions-green-revolution/",
        "title": "Labour donor urges <b>party</b> to borrow billions for <b>green</b> revolution",
        "description": "Millionaire Labour donor Dale Vince is urging Sir Keir Starmer to borrow billions of pounds to boost net zero and rid fossil fuels from Britain’s energy infrastructure."
    },
    {
        "url": "https://www.mirror.co.uk/news/world-news/scientists-issue-terrifying-atlantic-ocean-32100566.amp",
        "title": "Scientists issue terrifying Atlantic Ocean warning that could cause European deep freeze",
        "description": "A study, published in Science Advances, has suggested a halt in Atlantic Ocean currents this century could see average temperatures in large areas of Europe get much colder and Arctic Ice extend much"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/11/the-ultimate-protest-against-labour-george-galloways-bid-to-win-rochdale",
        "title": "‘The ultimate protest against Labour’: George Galloway’s bid to win Rochdale",
        "description": "Labour’s 9,668 majority in Greater Manchester seat challenged by Galloway’s Gaza-focused campaign"
    },
    {
        "url": "https://uk.news.yahoo.com/finns-vote-president-guide-policy-080254371.html",
        "title": "Former PM Alexander Stubb wins Finnish presidency, narrowly defeating ex-top diplomat Pekka Haavisto",
        "description": "Former Prime Minister Alexander Stubb won Finland’s election runoff Sunday against ex-Foreign Minister Pekka Haavisto in a close race for the presidency and the task of steering the Nordic country’s foreign and security policy now that it is a member of NATO,"
    },
    {
        "url": "https://www.huffpost.com/entry/democrats-dreamers-shift-right-immigration_n_65c804bae4b0fb721d6153e6",
        "title": "Democrats Insist They Won’t Forget DREAMers As They Shift Right On Immigration",
        "description": "Senate Democrats insisted that they weren’t leaving Dreamers or other undocumented immigrants behind, and that, if anything, this year’s negotiations would allow them to build on their progress since they can now point to the GOP’s refusal to accept the deal as evidence of their hypocrisy on the issue."
    },
    {
        "url": "https://www.intellinews.com/orban-sacrifices-president-and-former-justice-minister-in-paedophile-cover-up-case-311901/",
        "title": "Orban sacrifices president and former justice minister in paedophile cover-up case",
        "description": "Hungary&#39;s radical rightwing leader Viktor Orban is facing his biggest political crisis since taking office in 2010 following the resignation"
    },
    {
        "url": "https://inews.co.uk/news/politics/michael-gove-rishi-sunak-right-trans-jibe-criticise-keir-starmer-2900881?ico=related_stories",
        "title": "Gove says PM was ‘absolutely right’ to use trans jibe to criticise Starmer",
        "description": "Michael Gove has defended Rishi Sunak over a transgender joke he made at PMQs this week, saying the Prime Minister was “absolutely right” to use it to criticise Labour leader Sir Keir Starmer for his past U-turns."
    },
    {
        "url": "https://www.itv.com/news/granada/2024-02-11/by-election-candidate-apologises-for-deeply-offensive-israel-claims",
        "title": "Labour&#39;s Rochdale by-election candidate apologises for ‘deeply offensive’ Israel claims",
        "description": "Labour candidate in the Rochdale by-election has apologised for his comments after he reportedly said Israel allowed Hamas to carry out the October 7 attack | ITV News Granada"
    },
    {
        "url": "https://www.ft.com/content/1d5df29b-c0e1-470d-8abf-50c33cd33641",
        "title": "Labour by-election candidate sparks fresh row over antisemitism",
        "description": "Rochdale hopeful was recorded claiming Israel allowed October 7 attacks to take place to justify Gaza invasion"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-manchester-68267951",
        "title": "Labour candidate Azhar Ali apologises for Israel comments",
        "description": "Labour&#39;s candidate in the Rochdale by-election has apologised for remarks he made about Israel in a local party meeting. In a secret recording obtained by the Mail on Sunday, Azhar Ali reportedly said Israel had &quot;allowed&quot; the deadly attack by Hamas gunmen on 7 October."
    },
    {
        "url": "https://www.gloucestershirelive.co.uk/news/gloucestershire-stories-you-missed-past-9088695",
        "title": "The Gloucestershire stories you may have missed in the past seven days",
        "description": "A potentially hazardous material has led to the indefinite closure of a library in Gloucestershire. Stroud Library was closed with immediate effect on Monday, February 5, following the discovery of RAAC (Reinforced Autoclaved Aerated Concrete) in the building."
    }
]