[
    {
        "url": "https://www.theguardian.com/australia-news/live/2024/feb/06/australia-politics-live-question-time-peter-dutton-anthony-albanese-stage-three-tax-cuts-cost-of-living-interest-rates-rba?page=with:block-65c16d508f0856364121ea92",
        "title": "Australia politics live: Coalition votes to back Labor’s changes to stage-three tax cuts",
        "description": "Follow live"
    },
    {
        "url": "https://www.ulster.ac.uk/news/2024/february/25@25-innovative-leadership-january",
        "title": "Host of Exceptional NI Leaders Share their Innovative Leadership Experiences with Ulster University’s 25@25 Cohort",
        "description": "Former Co-Chair of the <b>Green Party</b> and Director of Friends of the Earth Sir Jonathon Porritt CBE, a writer and campaigner on Sustainable Development; Former CEO of Kainos, Brendan Mooney; Chief Executive of NOW Group and Chair of Clanmil Housing ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/green-party-overtakes-tories-second-most-popular-voters-under-30-1723235",
        "title": "The <b>Green Party</b> Overtakes The Tories As The Second Most Popular For Voters Under 30",
        "description": "A YouGov poll revealed that for voters aged 18 to 24, the Green Party is nine per cent more popular than the Conservative Party and 12 per cent ahead of the Liberal Democrats."
    },
    {
        "url": "https://uk.news.yahoo.com/borden-kinkora-byelection-pushed-wednesday-212250705.html",
        "title": "Borden-Kinkora byelection pushed to Wednesday as storm fallout continues",
        "description": "Elections P.E.I. officials have confirmed another delay in filling Jamie Fox&#39;s vacated provincial seat in Borden-Kinkora, saying voting will now be delayed until Wednesday to let the area recover from a major winter storm."
    },
    {
        "url": "https://www.irishnews.com/news/northern-ireland/positive-discussions-continue-with-attorney-general-on-overdose-prevention-facility-in-belfast-Y45DUCUX2ZLYFKG5PGYA7EXIIE/",
        "title": "‘Positive’ discussions continue with Attorney General on overdose prevention facility in Belfast",
        "description": "A <b>Green Party</b> motion to support the establishment of an overdose prevention facility (OPF) in the city was passed unanimously by councillors last March. Such a facility would allow addicts to take drugs in a hygienic environment and provide early ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-king-and-pm-to-continue-weekly-audiences-as-concerned-biden-reveals-plans-to-call-12593360",
        "title": "Politics latest: King and PM to continue weekly audiences - as &#39;concerned&#39; Biden reveals plans to call",
        "description": "Lib Dem leader Sir Ed Davey said his <b>party</b> joins &quot;the rest of the nation in wishing a full and quick recovery to His Majesty&quot;. And a <b>Green Party</b> spokesperson said they &quot;hope his treatments are successful and we wish him a speedy recovery&quot;. &quot;King Charles ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-piers-morgan-talktv-nhs-tory-b2490614.html",
        "title": "Rishi Sunak: I can’t keep pledge to reduce NHS waiting lists",
        "description": "PM takes a huge political gamble by admitting he’s failed to deliver key election promise – and sparks outrage by accepting £1,000 bet on live TV that he won’t fail on Rwanda flights"
    },
    {
        "url": "https://www.ft.com/content/ad7d66f2-5fd6-4886-8ae3-982ce169930c",
        "title": "Labour struggles to hold on to Muslim votes ahead of by-election",
        "description": "UK party faces test of support in previously safe seat of Rochdale amid backlash over position on Gaza conflict"
    },
    {
        "url": "https://www.gg2.net/labour-party-aims-to-boost-trade-ties-with-india/",
        "title": "Labour <b>party</b> aims to boost trade ties with India",
        "description": "Labour party’s shadow foreign secretary David Lammy and shadow business and trade secretary Jonathan Reynolds on Monday (5) began a three-day visit to India"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/05/mark-carney-raises-10bn-back-net-zero-projects/",
        "title": "Carney raises $10bn to back net zero projects",
        "description": "Mark Carney has raised $10bn (£8bn) for an eco-friendly investment fund, as the former Bank of England governor seeks to boost funding for net zero projects."
    },
    {
        "url": "https://www.theguardian.com/us-news/2024/feb/05/john-fetterman-democrat-progressive-senator",
        "title": "John Fetterman: progressive senator perhaps not that progressive after all",
        "description": "The Pennsylvania Democrat’s support for Israel and for migrant restrictions at the border has irritated many on the left"
    },
    {
        "url": "https://www.thenational.scot/politics/24099432.david-mundell-will-pleased-greens-standing-constituency/",
        "title": "David Mundell will be pleased Greens are standing in his constituency",
        "description": "I WOULD not be surprised if Tory MP and former Scottish Secretary David Mundell was having a wee celebration and raising a glass to the"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7187022",
        "title": "Politics latest: Sunak wishes King &#39;full and speedy recovery&#39; after cancer diagnosis",
        "description": "The SNP&#39;s Westminster leader Stephen Flynn branded the bet &quot;depraved&quot; and <b>Green Party</b> MP Caroline Lucas has also criticised it. &quot;These are people&#39;s lives they’re gambling over,&quot; she wrote on X. &quot;Yet Sunak thinks nothing of agreeing a £1k bet."
    },
    {
        "url": "https://www.politico.eu/article/nuclear-reactors-germany-invest-gas-power-plants-energy/",
        "title": "After scrapping nuclear reactors, Germany to spend billions on new gas power plants",
        "description": "The fossil fuel expansion is needed to ensure long-term energy security, according to industry and the government."
    },
    {
        "url": "https://uk.news.yahoo.com/tried-28-trader-joes-popular-222721506.html",
        "title": "I tried 28 of Trader Joe&#39;s popular dips, and I&#39;d buy at least half of them again",
        "description": "From carmelized-onion dip to tomato-and-basil hummus, some of Trader Joe&#39;s spreads are sure to be a hit at any potluck or game-day party."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/megan-fox-debuts-pink-hair-203921756.html",
        "title": "Megan Fox Debuts Pink Hair in Chain Mail Minidress at Jam for Janie Grammys 2024 Viewing <b>Party</b>",
        "description": "Megan Fox made an edgy entrance on Sunday while attending the Jam for Janie Grammys viewing <b>party</b> in Los Angeles ... whom she shares with ex-husband Brian Austin <b>Green</b>. “I think because I have sons, it’s very important to me to raise boys who are ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/05/israel-hamas-gaza-war-palestine-red-sea-houthis-latest-news/?utmsource=email",
        "title": "Israel will eliminate Hamas leaders and end war &#39;in months&#39;, says Netanyahu",
        "description": "The most senior MP in both the Liberal Democrats and the <b>Green Party</b> issued statements on Sunday saying now was the time for the House of Commons to have a vote. Downing Street figures argued when the first air strikes were made on Houthi targets last ..."
    },
    {
        "url": "https://www.al.com/reckon/2024/02/dr-cornel-west-is-running-to-become-president-of-the-united-states-what-are-his-views-on-climate-change-and-the-environment.html",
        "title": "Dr. Cornel West is running to become President of the United States. What are his views on climate change and the environment?",
        "description": "In an interview, West discusses Alabama, “Green Reconstruction” and “Planetary Selma,” the intersection of white supremacy and ecological collapse."
    },
    {
        "url": "https://solihullobserver.co.uk/news/green-party-select-runner-for-west-midlands-mayor/",
        "title": "<b>Green Party</b> select runner for West Midlands Mayor",
        "description": "THE <b>GREEN Party</b> have selected their candidate for the West Midlands Mayoral Election. Siobhan Harper-Nunes will be standing in May’s election and has vowed to give communities a voice if she comes out on top. She has worked both in the public and third ..."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13047805/SZA-afterparty-celebrate-Grammy-wins-Chris-Brown.html",
        "title": "SZA dons a black trench coat as she heads to an afterparty to celebrate her Grammy wins - as Chris Brown also attends",
        "description": "The 34-year-old singer-songwriter — whose fans claim she was robbed by the awards show — wore a matte black raincoat and open-toe high heels. She braved the inclement Los Angeles weather as she was escorted by a man in a green suit who held an umbrella over her."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-merseyside-68182057.amp",
        "title": "Liverpool City Council to repay millions after jobs target missed",
        "description": "Only a portion of the jobs intended for Kings Dock was met. The blaze ripped through the car park after a Land Rover caught fire Leader of the <b>Green Party</b> group at the council, Tom Crone, said he did not accept the car park fire could have completely ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/05/british-muslims-losing-trust-in-labour-over-its-handling-of-israel-gaza-war",
        "title": "British Muslims losing trust in Labour over its handling of Israel-Gaza war",
        "description": "Party figure says it has work to do to retain support as poll shows drop in Starmer’s popularity"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-piers-morgan-talktv-nhs-tory-b2490614.html?soc_src=aolapp",
        "title": "Rishi Sunak: I can’t keep pledge to reduce NHS waiting lists",
        "description": "PM takes a huge political gamble by admitting he’s failed to deliver key election promise – and sparks outage by accepting £1,000 bet on live TV that he won’t fail on Rwanda flights"
    },
    {
        "url": "https://www.ipswichstar.co.uk/news/24097354.ex-green-leader-natalie-bennett-hits-ipswich-campaign-trail/",
        "title": "Ex-<b>Green</b> leader Natalie Bennett hits Ipswich campaign trail",
        "description": "A former <b>Green Party</b> leader and baroness joined campaigners in Ipswich this weekend in an attempt to have the town centre&#39;s first <b>Green</b> councillor elected in May. The campaign trail saw councillors meet independent businesses and knock on doors to hear the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/05/israel-hamas-gaza-war-palestine-red-sea-houthis-latest-news/",
        "title": "Israel will eliminate Hamas leaders and end war &#39;in months&#39;, says Netanyahu",
        "description": "American forces have carried out further air strikes in Yemen, the US military has confirmed. Five missiles, one designed for land attack and the others for targeting ships, were targeted on Sunday night."
    },
    {
        "url": "https://www.itv.com/news/2024-02-05/british-muslim-support-for-labour-halves-according-to-new-poll",
        "title": "British Muslim support for Labour falls drastically, according to new poll",
        "description": "Data produced by Survation and the Labour Muslim Network (LMN) has found support for the party from British Muslims has dropped to 43% having been at 86% during the 2019 general election."
    },
    {
        "url": "https://www.thenational.scot/politics/24096682.scottish-governments-policy-message-deletion-publicly-available/",
        "title": "Scottish Government&#39;s policy on message deletion is publicly available",
        "description": "THERE seemed to be some confusion during the recent Covid inquiry hearings as to whether the Scottish Government has an electronic messaging"
    },
    {
        "url": "https://socialistworker.co.uk/features/labour-bends-back-to-big-business/",
        "title": "Labour bends back to big business",
        "description": "A future Labour led government would cause hideous cuts for working class people and never-ending wealth for the rich."
    },
    {
        "url": "https://www.investing.com/news/world-news/analysisgreen-backlash-looms-over-eu-elections-3292933",
        "title": "Analysis-<b>Green</b> backlash looms over EU elections",
        "description": "But the overall EU &#39;<b>Green</b> Deal&#39; vision for tackling climate change remains ... an EU lawmaker from the centre-right European People&#39;s <b>Party</b>, the biggest political family in the EU parliament. &quot;If we want to be carbon neutral and still want to be ..."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/24097345.lib-dems-back-felicity-cunliffe-lister-new-mayor-role/",
        "title": "Lib Dems back Felicity Cunliffe-Lister for new mayor role",
        "description": "The Liberal Democrats have announced a businesswoman and councillor as their candidate for the first mayor of York and North Yorkshire."
    },
    {
        "url": "https://www.chardandilminsternews.co.uk/news/24098025.serena-wootton-welcomes-solar-farm-project-near-yeovil/",
        "title": "Serena Wootton welcomes solar farm project near Yeovil",
        "description": "Serena Wootton, the Green Party parliamentary candidate for Yeovil, said she was pleased this application for the land at Camp Road was approved. She said: “The generation of power has always been a contentious subject with people being divided on all forms of energy production."
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/covid-inquiry-hallett-and-dawson-have-shown-us-all-how-sturgeon-intentionally-broke-devolution-brian-monteith-4504601",
        "title": "Covid Inquiry: Hallett and Dawson have shown us all how Sturgeon intentionally broke devolution - Brian Monteith",
        "description": "By revealing over the last three weeks how the Scottish Government – with First Minister Nicola Sturgeon, Deputy John Swinney, and her chief advisor Liz Lloyd – were in command and often unaccountable even to Sturgeon’s own Cabinet, the UK Covid Inquiry has done Scotland a service before it reports."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/victory-cut-south-bristol-estate-9078313",
        "title": "Victory for cut-off South Bristol estate that was left with no buses",
        "description": "A community left without a bus service after recent cuts are celebrating after their long-running campaign to get it reinstated paid off. People in Ashton Vale have been fighting for years for a better bus service, but were left without one at all when First Bus pulled the number 24, and then its replacement the number 23."
    },
    {
        "url": "https://ifs.org.uk/articles/labours-green-investment-pledge-raises-so-many-questions",
        "title": "Labour&#39;s <b>green</b> investment pledge raises so many questions",
        "description": "The recent “confusion” tells us a lot about the tenor of the coming election campaign and the debate about fiscal policy."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/people/hastings-order-to-remove-dog-poo-bag-dispensers-around-town-branded-incredibly-petty-by-green-party-4505254",
        "title": "Hastings: Order to remove dog poo bag dispensers around town branded &#39;incredibly petty&#39; by <b>Green Party</b>",
        "description": "Organisers behind a scheme to place dog poo bag dispensers on lampposts around the town in a bid to tackle dog fouling have said they have been ordered to remove them by county council bosses."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13046511/Robbie-Williams-strips-pants-dances-wife-Ayda-Field-hilarious-social-media-clip.html",
        "title": "Robbie Williams strips down to his pants and dances with wife Ayda Field in hilarious social media clip",
        "description": "The former Take That singer, 49, showed off his inked skin as he moved his hips, while only wearing a beanie hat, scarf and snow boots from Ayda&#39;s high-end athleisure label called Ayda Activewear."
    },
    {
        "url": "https://uk.style.yahoo.com/cool-cats-tiki-treats-inside-110041580.html",
        "title": "Cool cats and tiki treats: Inside the outrageous Midcentury Modern Shag House in Palm Springs",
        "description": "The Shag House in Palm Springs is a joy-filled testament to midcentury optimism. It will be open to the public during Modernism Week, which runs Feb. 15-25."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/weekly-green-bin-collections-greater-28571019",
        "title": "Weekly <b>green</b> bin collections in Greater Manchester borough could be scrapped",
        "description": "Weekly green bin collections in Stockport could be scrapped as part of the council&#39;s plan to save money. The local authority is planning to make the collections fortnightly which is expected to save around £600,000 as part of a waste review."
    },
    {
        "url": "https://www.carbonbrief.org/daily-brief/uk-give-clear-view-of-net-zero-emissions-plan-cbi-tells-chancellor/",
        "title": "UK: Give clear view of net-zero emissions plan, CBI tells chancellor",
        "description": "One of the UK’s largest business lobby groups has called on the chancellor Jeremy Hunt to set out a clear net-zero emissions investment plan"
    },
    {
        "url": "https://www.ipe.com/news/opposition-slams-13th-month-pension-payout-swiss-proposal/10071453.article",
        "title": "Opposition slams 13th month pension payout Swiss proposal",
        "description": "Several stakeholders opposing the introduction of 13th month first pillar pension payout – 13. AHV-Rente – in Switzerland are pushing back on the proposal, raising funding questions but also pitching alternatives ahead of a referendum on 3 March, which according to recent polls could receive the support of the majority of voters."
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/05/eu-greens-pick-veteran-meps-to-lead-election-campaign?ref=mc.news",
        "title": "EU Greens pick veteran MEPs to lead election campaign",
        "description": "Terry Reintke and Bas Eickhout vow to fight for more equal and ecological Europe amid surge to far right The European <b>Green party</b> has picked Terry Reintke and Bas Eickhout as lead candidates to front its campaign ahead of elections in June that polls ..."
    },
    {
        "url": "https://www.lse.co.uk/news/uk-labour-party-not-scaling-back-gbp28-billion-green-plan-bryant-dteaomhg3h31oy3.html",
        "title": "UK Labour <b>party</b> not scaling back GBP28 billion <b>green</b> plan — Bryant",
        "description": "(Alliance News) - The UK Labour <b>party</b> is &quot;not scaling back&quot; its pledge to invest GBP28 billion annually into <b>green</b> projects in a bid to kickstart economic growth, a shadow minister has said. Senior Labour figures have been dogged by questions about its so ..."
    },
    {
        "url": "https://www.hellomagazine.com/hfm/fashion-trends/512740/the-best-celeb-outfit-changes-at-the-2024-grammy-awards/",
        "title": "2024 Grammys: Dua Lipa, Miley Cyrus, Olivia Rodrigo - The celeb outfit changes you might have missed",
        "description": "Songstress Olivia Rodrigo most definitely nailed the trending colourway brief for her performance, donning a subtle yet effortlessly chic cherry red slip gown. The Vampire singer paired her all-red gown with a matching lip and let her brunette locks cascade over her shoulders."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mike-freer-sarah-sackman-threats-election-finchley-and-golders-green-b1137075.html",
        "title": "Labour candidate in Finchley and Golders <b>Green</b> urges new offence to protect MPs as Mike Freer quits",
        "description": "Labour’s candidate in Finchley and Golders <b>Green</b> called on Monday for a new offence to outlaw ... The seat is back in play for Labour given the opposition <b>party</b>’s commanding lead in national polls. In selecting Ms Sackman, it has chosen a prominent ..."
    }
]