[
    {
        "url": "https://www.bbc.com/news/business-68145720",
        "title": "Bankers&#39; bonuses: No cap under Labour, says Reeves",
        "description": "The shadow chancellor has told the BBC Labour would not reinstate a bankers&#39; bonuses cap that was scrapped last year by the Conservative government. It comes as Ms Reeves set out Labour&#39;s plans to boost economic growth through the financial services sector."
    },
    {
        "url": "https://www.lbc.co.uk/news/irish-unification-within-touching-distance-sinn-fein-dup-stormont/",
        "title": "Irish unification &#39;within touching distance&#39; claims Sinn Fein leader after DUP agrees return to Stormont",
        "description": "Democratic Unionist <b>Party</b> (DUP) leader Jeffrey Donaldson speaks to the media ... Government would lead to goods which are destined for Northern Ireland through the <b>green</b> lane element of the Windsor Framework, flowing freely from the rest of the UK."
    },
    {
        "url": "https://www.eveningnews24.co.uk/news/24084023.norwich-city-council-control-homes-repairs/",
        "title": "Norwich City Council should have control over homes repairs",
        "description": "Yet the council’s leaders have given up control by outsourcing repairs to an &#39;arms-length&#39; private company - something that <b>Green Party</b> councillors are now trying to change. To be clear, there are many council homes that are in good condition ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-plotters-rishi-sunak-betrayed-brexit-northern-ireland-deal-2881299",
        "title": "Tory plotters ‘poised to claim Sunak has betrayed Brexit’ with NI deal, sources say",
        "description": "The Democratic Unionist Party (DUP) in the early hours of Tuesday morning dramatically revealed it had agreed a deal with the Government to end its boycott of Stormont institutions over the so-called Irish Sea trade border created by Brexit. The details are not due to be revealed until Wednesday."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68148519",
        "title": "Plans for more Senedd politicians move step closer",
        "description": "Plans for 36 more Senedd politicians cleared their first hurdle on Tuesday night. Senedd members voted to back in princip"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13025099/Queen-frontman-Adam-Lambert-confirmed-headline-Sydneys-2024-Gay-Lesbian-Mardi-Gras.html",
        "title": "Queen frontman Adam Lambert is confirmed to headline Sydney&#39;s 2024 Gay And Lesbian Mardi Gras",
        "description": "Queen frontman Adam Lambert will headline the 2024 Sydney Gay and Lesbian Mardi Gras Party. American singer Cece Peniston shared the news to Instagram on Friday when she revealed the line-up on her social media."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/caroline-lucas-create-firewall-between-politicians-and-fossil-fuel-industry-98863/",
        "title": "Caroline Lucas: Create ‘firewall’ between politicians and fossil fuel industry",
        "description": "The <b>Green Party</b> MP said governments have for years colluded in “frankly criminal” decisions that have led to more fossil fuel extraction despite warnings from scientists about climate change. The MP for Brighton, Pavilion warned of a “revolving door ..."
    },
    {
        "url": "https://uk.news.yahoo.com/marjorie-taylor-greene-claims-mayorkas-200041569.html",
        "title": "Marjorie Taylor Greene claims Mayorkas impeachment will pass in House",
        "description": "She first forced the vote on the House floor on 13 November, but it was sent to a committee, “where articles of impeachment go to die,” she said at the time and blasted the eight members of her own <b>party</b> who ... Chairman Mark <b>Green</b> and the other ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/caroline-lucas-government-brighton-mps-david-lynch-b1135902.html",
        "title": "Caroline Lucas: Create ‘firewall’ between politicians and fossil fuel industry",
        "description": "The MP for Brighton, Pavilion warned of a “revolving door” between parliamentarians and ministers and fossil fuel companies."
    },
    {
        "url": "https://www.theguardian.com/business/2024/jan/30/labour-vows-to-cut-financial-red-tape-and-unashamedly-champion-uk-sector?ref=biztoc.com",
        "title": "Labour vows to cut financial ‘red tape’ and ‘unashamedly champion’ UK sector",
        "description": "Report shows Labour move to scrap many rules and processes as party denies plan will dilute consumer protections"
    },
    {
        "url": "https://www.ft.com/content/e998703a-4285-4a3a-9c43-2f4bc16644e1",
        "title": "Rachel Reeves says Labour would ‘unashamedly champion’ the City",
        "description": "Shadow chancellor Rachel Reeves has vowed to “unashamedly champion” Britain’s financial services sector if Labour wins the general election, denouncing politicians who have been “embarrassed” by the City’s success."
    },
    {
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/live-dup-backs-deal-return-28535201",
        "title": "LIVE: DUP backs deal to return to Stormont as NI Secretary says &#39;all conditions now in place&#39;",
        "description": "Northern Ireland Secretary Chris Heaton-Harris believes &#39;all the conditions are now in place&#39; for Stormont to return"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/30/sinn-fein-irish-reunification-touching-distance-dup-return/",
        "title": "Sinn Fein claims Irish reunification is &#39;within touching distance&#39; after DUP ends Stormont deadlock",
        "description": "The reunification of Ireland is within “touching distance”, Sinn Fein has claimed, after the DUP ended its two-year boycott of Stormont over post-Brexit trading arrangements."
    },
    {
        "url": "https://www.itv.com/news/utv/2024-01-30/goods-flow-freely-into-ni-under-new-deal-donaldson",
        "title": "People ‘already beginning to see benefit of DUP deal over trading concerns’",
        "description": "as he said people are already beginning to see the benefits of the deal his <b>party</b> has struck with the Government. Sir Jeffrey also predicted the <b>green</b> lane element of the Windsor Framework “will go” as he expressed hope that the Stormont power-sharing ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/green-lane-element-of-the-windsor-framework-will-go-says-dup-leader-sir-jeffrey-donaldson-as-chris-heaton-harris-claims-all-the-conditions-are-now-in-place-for-stormont-to-return-4498899",
        "title": "<b>Green</b> lane element of the Windsor Framework ‘will go’, says DUP leader",
        "description": "Sir Jeffrey also predicted the <b>green</b> lane element of the Windsor Framework “will go” as he expressed hope that the Stormont powersharing institutions can be restored within days. Sinn Fein leader Mary Lou McDonald has said her <b>party</b> is satisfied that ..."
    },
    {
        "url": "https://www.bbc.com/news/av/uk-northern-ireland-68147959",
        "title": "DUP deal: &#39;<b>Green</b> lane will go and goods will flow freely&#39;",
        "description": "Sir Jeffrey Donaldson says the green lane proposed as part of post-Brexit rules for goods flowing between Great Britain and Northern Ireland &quot;will go&quot; as part of its deal with the government. On Monday, the Democratic Unionist Party (DUP) endorsed a deal to restore power sharing after a 23-month absence."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-mayorkas-impeachment-b2487591.html",
        "title": "Marjorie Taylor Greene claims Mayorkas impeachment will pass in House",
        "description": "Georgia Republican Rep Marjorie Taylor Greene said she believes that the impeachment of Alejandro Mayorkas, the Homeland Security Secretary, will pass the House — even without any support from Democrats."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861379/rishi-sunak-poll-tory-voters-reform-uk-defections",
        "title": "Rishi Sunak loses 1 in 5 of Boris Johnson&#39;s voters to Reform as Tory MPs mull defections",
        "description": "Another Conservative MP on the Right of the <b>party</b> who claimed to have been targeted by Reform ... as well as wedding itself to <b>green</b> policies. Reform’s deputy leader Ben Habib is currently trying to win the Wellingborough by-election, where former ..."
    }
]