[
    {
        "url": "https://www.huffingtonpost.co.uk/entry/bbc-question-time-migrant-boats_uk_6557a3d8e4b0998d69a01cfb",
        "title": "Question Time Audience Member Suggests Puncturing Migrant Boats Using Drones",
        "description": "The flagship policy – first announced when Boris Johnson was still PM last year – was a key plank of <b>Rishi Sunak</b>’s pledge to “stop the boats” carrying asylum seekers across the English Channel. Under the plan, people arriving in the UK by the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2023/11/15/rishi-sunak-jeremy-cut-inheritance-tax-autumn-statement/",
        "title": "<b>Sunak</b> and Hunt plan to cut inheritance tax at Autumn Statement",
        "description": "The pair have discussed lowering the rate from 40pc, a move that Treasury officials have deemed would not be inflationary"
    },
    {
        "url": "https://www.eadt.co.uk/news/national/23931051.starmer-suggests-gaza-position-readying-labour-government/",
        "title": "Starmer suggests Gaza position is about readying Labour for government",
        "description": "He said Labour’s work with allies on the Israel-Hamas war was ‘what you would expect from someone who wants to’ be prime minister."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/nov/17/jeremy-hunt-cutting-tax-stealth-raid-inheritance-tax-autumn-statement?ref=biztoc.com",
        "title": "Hunt warned against cutting tax for wealthy while making stealth raid on 36m workers",
        "description": "Hunt had been expected to hold back any tax cuts until next year as he and <b>Rishi Sunak</b> focus on reducing inflation. But after the UK’s annual inflation rate fell further than expected in October, and with Tory MPs clamouring for pre-election giveaways ..."
    },
    {
        "url": "https://www.newsandstar.co.uk/news/23925688.veteran-meets-rishi-sunak-downing-street-london/",
        "title": "Veteran meets <b>Rishi Sunak</b> at Downing Street in London",
        "description": "Mark Harding of Cumbria met Prime Minister Rishi Sunak at a ceremony in London over the Remembrance weekend. Mr Sunak praised Mark for his charity work and was presented with a commemorative pair of cufflinks by the veteran. Mr Harding said: &quot;I got invited down to Downing Street because of everything I&#39;ve done for the veterans community."
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/23931051.starmer-suggests-gaza-position-readying-labour-government/",
        "title": "Starmer suggests Gaza position is about readying Labour for government",
        "description": "He said Labour’s work with allies on the Israel-Hamas war was ‘what you would expect from someone who wants to’ be prime minister."
    },
    {
        "url": "https://inews.co.uk/news/politics/tony-blair-keir-starmer-middle-east-2761900?ITO=msn",
        "title": "Tony Blair is acting as Keir Starmer’s Middle East broker",
        "description": "The former Prime Minister is using his extensive contacts to help the Labour leader make diplomatic inroads in the region."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/23932072.rishi-sunak-bring-back-clegg-rather-cameron/",
        "title": "Should <b>Rishi Sunak</b> bring back Clegg rather than Cameron?",
        "description": "WHEN Dave Cameron was in government he ran the country for six years. For the first five years, he had Nick Clegg as his deputy. As soon as he no longer had Nick Clegg as his deputy he was in trouble. Cameron was out of office a year later despite winning a general election and having a working majority of 12."
    },
    {
        "url": "https://morningstaronline.co.uk/article/young-campaigners-call-pm-say-yes-school-food-all",
        "title": "Young campaigners call on PM to ‘Say Yes to School Food For All’",
        "description": "YOUNG campaigners have called on Prime Minister Rishi Sunak to “Say Yes to School Food For All” after they handed in a petition signed by parliamentarians, health groups and schools."
    },
    {
        "url": "https://www.opendemocracy.net/en/rishi-sunak-david-cameron-foreign-secretary-democratic-deficit-need-increased-devolution-jamie-driscoll-mayor/",
        "title": "Cameron’s return to politics highlights the UK’s democratic deficit",
        "description": "Cameron’s return to frontline politics is the plot twist nobody wanted in the ongoing Tory psychodrama. The past 13 years have been defined by Conservative Party manoeuvring and infighting, with any meaningful program for government pushed to the bottom of their to-do list."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-derbyshire-67450196",
        "title": "<b>Rishi Sunak</b> says HS2 axe not to blame for Alstom job loss fears",
        "description": "Prime Minister Rishi Sunak has said scaling back HS2 is not to blame for potential job cuts at the UK&#39;s largest rail assembly factory. Alstom, in Derby, is consulting on redundancies understood to be about 550 at their manufacturing site, while 780 contractors are also at risk. Unite said the cuts were a result of delays in HS2 construction."
    },
    {
        "url": "https://www.thenational.scot/news/23931960.trouble-bringing-back-david-cameron-win/",
        "title": "You&#39;re in trouble if bringing back David Cameron is a win",
        "description": "Tory right wingers wanted the PM to announce emergency legislation, they got assurances to that effect. They also wanted him to say he’d tear up international agreements and challenge European human rights judges if they attempted to further block flights. They also got that."
    },
    {
        "url": "https://www.thetimes.co.uk/article/david-cameron-to-take-title-of-lord-cameron-of-chipping-norton-sbzjhwn76",
        "title": "David Cameron to take title of Lord Cameron of Chipping Norton",
        "description": "The Chipping Norton set have acquired their own baron with the announcement that David Cameron will be styling himself Lord Cameron of Chipping Norton.The for"
    },
    {
        "url": "https://www.lbc.co.uk/news/sir-keir-starmer-prime-minister-undaunted-news-agents-government-family/",
        "title": "‘This for me is duty’: Keir Starmer says he’s ‘undaunted’ by prospect of becoming next prime minister",
        "description": "Keir Starmer has said he’s ‘undaunted’ by the prospect of becoming the UK’s next prime minister despite the challenges it will entail."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2023/nov/17/a-law-saying-rwanda-is-safe-doesnt-make-it-so",
        "title": "A law saying Rwanda is safe doesn’t make it so",
        "description": "Letters: Readers take issue with Rishi Sunak’s plan for emergency legislation to allow asylum seekers to be sent to the African country after the supreme court ruled that it was unlawful"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2023/11/17/friday-evening-news-briefing-hamas-military-system-israel/",
        "title": "Friday evening news briefing: Hamas military system nearly dismantled in northern Gaza, says Israel",
        "description": "Israel’s military says it is close to “dismantling the military system” set up by Hamas in northern Gaza. Herzi Halevi, the Israeli Defense Forces (IDF) chief of general staff, told forces in the enclave there “remains work to be completed” but praised them for “approaching it successfully.”"
    },
    {
        "url": "https://www.irishnews.com/paywall/tsb/irishnews/opinion/columnists/2023/11/18/news/newton_emerson_suella_braverman_s_sacking_and_more_tory_implosions_give_the_dup_another_stormont_boycott_headache-3777166/content.html",
        "title": "Newton Emerson: Suella Braverman&#39;s sacking and more Tory implosions give the DUP another Stormont boycott headache",
        "description": "Use precise geolocation data. Actively scan device characteristics for identification. Store and/or access information on a device. Personalised advertising and content, advertising and content measurement, audience research and services development. List of Partners (vendors)"
    },
    {
        "url": "https://www.thewestmorlandgazette.co.uk/news/national/23930576.pm-denies-plan-amounts-tinkering-rwanda-scheme-braverman-swipe/",
        "title": "PM denies plan amounts to ‘tinkering’ with Rwanda scheme after Braverman swipe",
        "description": "Speaking to broadcasters during a visit to a school in Bolsover, Rishi Sunak insisted he will ‘work night and day’ to get the policy running."
    },
    {
        "url": "https://inews.co.uk/news/politics/why-suella-braverman-plan-save-rwanda-plan-used-2763040?ico=editors_picks",
        "title": "Why Suella Braverman’s five-point plan to save the Rwanda policy won’t be used",
        "description": "Suella Braverman has revealed her five-point plan to save the Rwanda deal after judges found it unlawful as part of a week of broadsides against Rishi Sunak that allies have branded a “grid of shit”."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/schools-hospitals-starved-cash-tories-31466050",
        "title": "Schools and hospitals to be &#39;starved of cash&#39; if Tories cut taxes for richest",
        "description": "The TUC and Tax Justice UK have issued a last minute plea urging the Chancellor, Jeremy Hunt, not to slash inheritance tax in the Autumn Statement on Wednesday"
    },
    {
        "url": "https://www.opendemocracy.net/en/israel-gaza-is-a-ceasefire-possible-palestine-hamas-netanyahu-biden/",
        "title": "Is there any hope of a ceasefire in Gaza?",
        "description": "Global opinion appears to be shifting against Israel – but will that be enough to force an end to the bloodshed?"
    },
    {
        "url": "https://www.thesun.co.uk/news/24772344/chancellor-budget-autumn-tax-cuts/",
        "title": "Tax cuts to boost economy are ‘priority’ to generate wealth and fund NHS, says Chancellor",
        "description": "JEREMY Hunt is eyeing up “priority” tax cuts for business to help put rocket boosters under the economy. The Chancellor told The Sun ahead of the Autumn Statement he will help firms if he has room"
    },
    {
        "url": "https://www.politico.eu/article/scotland-national-party-make-fresh-pitch-to-undo-brexit/",
        "title": "Missing EU: Scotland’s nationalists make fresh pitch to undo Brexit",
        "description": "Scotland’s government wants to take the country independent and then join the EU. It’s a tricky path to get there."
    },
    {
        "url": "https://www.heraldscotland.com/news/23931807.hunt-eyes-inheritance-tax-cut-row-brews-benefits-clampdown/",
        "title": "Hunt eyes up inheritance tax cut as row brews over benefits clampdown",
        "description": "Inheritance tax is charged at 40% on a person’s estate above the threshold which currently sits at £325,000. Married couple can share their allowance, meaning parents can pass on £1 million to their children without any tax being paid."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/bradley-lowery-football-fan-dale-houghton-avoids-jail-after-mocking-death-of-child-mascot/",
        "title": "Bradley Lowery: Football fan Dale Houghton avoids jail after mocking death of child mascot",
        "description": "I will take them on&#39;: <b>Rishi Sunak</b> vows to challenge those &#39;standing in way&#39; of Rwanda plan <b>Rishi Sunak</b> has vowed to &quot;take on&quot; anyone who is &quot;standing in our way&quot; regarding the government&#39;s plan to send asylum seekers to Rwanda. David Cameron to be known as ..."
    },
    {
        "url": "https://uk.style.yahoo.com/rishi-sunak-prime-minister-visits-163005171.html",
        "title": "<b>Rishi Sunak</b>: Prime Minister visits school and speaks to pupils during Derbyshire visit",
        "description": "Prime Minister Rishi Sunak visited The Bolsover School this morning – where he was shown around by the school’s head prefects and spent time speaking with other students. Mark Fletcher, Conservative MP for Bolsover, said that meeting the PM was the “opportunity of a lifetime” for students at the school."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1836299/rishi-sunak-general-election-rwanda-migrant-deal",
        "title": "&#39;Whatever it takes!&#39;: <b>Rishi Sunak</b> hints at election to get Rwanda deal back on track",
        "description": "Prime minister Rishi Sunak has refused to rule out a general election after he promised to do &quot;whatever it takes&quot; to get his Rwanda deal back on track."
    },
    {
        "url": "https://www.stopwar.org.uk/article/never-underestimate-people-power/",
        "title": "Never Underestimate People Power",
        "description": "No worthwhile march ends politically when the placards are packed away and the microphones silenced. Street power is a serious political intervention, intersecting with other forms of struggle. The movement mobilised for Palestine has the breadth, energy, endurance and perspective to shake up the elite."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/suella-braverman-rwanda-rishi-sunak-b2449031.html",
        "title": "Braverman is a ‘dictator like Putin’ says top Tory after her latest outburst in Rwanda row",
        "description": "Sacked home secretary proposes introducing legislation that ‘excludes all avenues of legal challenge’ to deportation for small boat arrivals"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/video-news/number-of-illegal-migrants-crossing-to-the-uk-down-by-a-third-sunak-says/a902093515.html",
        "title": "Number of illegal migrants crossing to the UK down by a third, <b>Sunak</b> says",
        "description": "Prime Minister Rishi Sunak said the number of migrants crossing illegally into the UK is down by a third. &quot;People may not know this, but this year because of all the things that we&#39;ve done, the number of illegal migrants crossing to the UK is down by a third."
    },
    {
        "url": "https://www.cityam.com/its-the-year-of-the-pothole-and-britain-is-crazy/",
        "title": "It’s the Year of the Pothole and Britain is crazy",
        "description": "Britain’s automotive association has appointed itself responsible for assigning the symbol of the year. And they’ve chosen potholes."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-the-get-rwanda-done-election/",
        "title": "London Playbook PM: The Get Rwanda Done election?",
        "description": "Drums of war: In a TV clip around noon, Prime Minister <b>Rishi Sunak</b> refused to rule out calling an election if parliament thwarts his last-ditch bill to send small boats arrivals to the African nation. And he set up the narrative such an election could take."
    },
    {
        "url": "https://www.irishnews.com/news/northernirelandnews/2023/11/17/news/gerry_adams_court_case_can_be_used_as_a_precedent_to_change_rwanda_refugee_ruling_claims_jacob_rees-mogg-3780470/",
        "title": "Gerry Adams court case is a precedent for government to overturn Rwanda ruling, claims Jacob Rees-Mogg",
        "description": "Jacob Rees-Mogg has said the government can change the law to overturn a court ruling on deporting asylum seekers to Rwanda."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/pubs-jeremy-hunts-backyard-warn-31466362",
        "title": "Pubs in Jeremy Hunt&#39;s own backyard warn they face crisis if he hikes booze tax",
        "description": "The pubs include the Fox and Finch in Godalming, the Three Compasses in Cranleigh and the White Horse, Haslemere. In August, <b>Rishi Sunak</b> was heckled while pouring a pint at a beer festival in west London. Rudi Keyser, who runs a pub in Wimbledon ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/23930172.herald-diary-funny-knocks-star-footballers/",
        "title": "Herald Diary: Funny knocks for star footballers",
        "description": "A READER recalled the late Queen coming to Irvine in 1979. A row of derelict shops in the High Street opposite the Town Hall were painted specially for her visit. Further &quot;improvements&quot; took place a couple of weeks after she left. The shops were demolished for redevelopment."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1836287/dominic-cummings-boris-johnson-ukraine",
        "title": "&#39;A con to distract from partygate!&#39;: Dominic Cummings rips apart Boris&#39;s Ukraine strategy",
        "description": "Mr Cummings, who was at the heart of the Johnson government, branded the former PM a &quot;clown&quot; during a message about the UK&#39;s Ukraine strategy - which he claimed was a &quot;distraction&quot; from the partygate scandal which mired his time in Number 10 Downing Street."
    },
    {
        "url": "https://uk.style.yahoo.com/8-very-controversial-esther-mcvey-155824971.html",
        "title": "8 Very Controversial Esther McVey &#39;Common Sense&#39; Moments",
        "description": "Esther McVey returned to the cabinet this week, in what was seen as an attempt by Rishi Sunak to reach out to the right-wing of the Tory party. The MP for Tatton - known for her socially conservative views - has been given the job of ensuring “common sense” prevails across government,"
    },
    {
        "url": "https://www.oxfordshirelive.co.uk/news/uk-world-news/david-camerons-new-title-confirmed-8915216",
        "title": "David Cameron&#39;s new title confirmed as Lord Cameron of Chipping Norton",
        "description": "It was confirmed on Friday that his full title will be &quot;The Rt Hon. the Lord Cameron of Chipping Norton&quot;. The title confirms Lord Cameron&#39;s long-held ties to the Cotswold town of Chipping Norton, which lies within his former Witney constituency."
    },
    {
        "url": "https://www.theguardian.com/politics/2023/nov/17/rishi-sunak-big-spending-technocrat-or-tax-cutting-culture-warrior?ref=mc.news",
        "title": "<b>Rishi Sunak</b>: big spending technocrat or tax-cutting culture warrior?",
        "description": "More than a year after he became PM voters are still unsure about what kind of leader he is. Will the real Sunak stand up?"
    },
    {
        "url": "https://metro.co.uk/2023/11/17/rishi-tried-create-a-meme-brilliant-replies-19840438/?ico=top-stories_home_top",
        "title": "<b>Rishi</b> tried to create a meme, but we’re here for the brilliant replies",
        "description": "Is there anything more cringe-inducing watching politicians attempt to grapple with meme culture? <b>Rishi Sunak</b> doesn’t think so. The Prime Minister took to Twitter this morning to announce a new government initiative to ‘repair our roads’ by spending ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-67450870.amp",
        "title": "<b>Rishi Sunak</b> denies &#39;tinkering&#39; to save Rwanda plan",
        "description": "The PM says boat crossings across the English Channel are down by a third thanks to government actions. <b>Rishi Sunak</b> has denied &quot;tinkering&quot; with the government&#39;s Rwanda plan after his sacked former home secretary accused him of failing to take the radical ..."
    }
]