[
    {
        "url": "https://www.thelondoneconomic.com/politics/govt-accidentally-leaks-its-dentistry-plan-to-mps-of-all-parties-368234/",
        "title": "Govt accidentally leaks its dentistry plan to MPs of all parties",
        "description": "“The Conservatives are only promising to do something about it now there’s an election coming. It will be left to the next <b>Labour</b> government to rescue NHS dentistry and get patients seen on time once again.” The British Dental Association said claims ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-junk-food-health-commission-95rjpwxxt",
        "title": "<b>Labour</b> vows to ‘steamroll’ junk food firms",
        "description": "He is committed to banning the advertising of junk food to children online and on TV, and said there was also a “serious case to be made” for stricter restrictions on food pac"
    },
    {
        "url": "https://inews.co.uk/news/politics/gove-inflation-housebuilding-migration-2893671?ITO=msn",
        "title": "Gove blames inflation for housebuilding failure and migration for high demand",
        "description": "He added: “The big reason has been access to mortgage finance, the cost of materials tightness in the <b>labour</b> market, all the different manifestations or the causes or symptoms of inflation.” Mr Gove said that, from 2016, the UK was building more than ..."
    },
    {
        "url": "https://news.sky.com/story/popcons-seek-to-rally-tory-base-as-they-look-to-a-post-election-future-13065575",
        "title": "PopCons seek to rally Tory base as they look to a post-election future",
        "description": "Liz Truss may have been ousted from Number 10 after just 49 days. But she has support from certain Conservative MPs for her ideas to live on."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-polling-london-mayoral-election-susan-hall-mayor-labour-conservative-polls-b1137514.html",
        "title": "London mayoral election: Sadiq Khan says he does not believe polls giving him 20 point lead over Susan Hall",
        "description": "The mayor pointed to the twin shocks in 2016 of the Brexit campaign and Donald Trump seizing victory as examples of polls misjudging electorates"
    },
    {
        "url": "https://www.thenational.scot/politics/24102390.supine-distasteful-rishi-sunak-believes-human-life-cheap/",
        "title": "Supine and distasteful Rishi Sunak believes human life is cheap",
        "description": "The Tories continue to wallow in the politics of the gutter with only their political doppelganger, the <b>Labour</b> Party, as a UK alternative. Why aren’t we independent yet? THE <b>Labour</b> Party are said to be worried about the possibility of losing seats in ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-block-labours-bid-scrap-32062701",
        "title": "Tories block <b>Labour</b>&#39;s bid to scrap severance pay-offs for ministers who quit in disgrace",
        "description": "Labour sought to reform the rules after it emerged last month nearly £1million was paid out during the ministerial churn of Boris Johnson and Liz Truss&#39;s chaotic governments"
    },
    {
        "url": "https://metro.co.uk/2024/02/06/how-wish-grown-a-time-internet-20234415/?ico=trending-post-strip_item_3",
        "title": "How I wish I’d grown up in a time without the internet",
        "description": "(Credits: Getty Images/iStockphoto) So, the <b>Labour</b> Party is worried that Muslims are turning away over its stance on Israel’s war in Gaza and will not vote for Sir Keir Starmer in the next election. As a woman of colour, where does that leave us Afro ..."
    },
    {
        "url": "https://www.burytimes.co.uk/news/national/24102348.government-review-ministers-severance-payouts-rejects-immediate-reform/",
        "title": "Government to review ministers’ severance payouts but rejects immediate reform",
        "description": "Minister without Portfolio Esther McVey (James Manning/PA) <b>Labour</b> had sought to present a Bill to Parliament aiming to change the system after it emerged nearly £1 million was spent during the political chaos of 2022. Ministers under the age of 65 are ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/michael-matheson-putting-lives-in-danger-refusing-to-quit/?n=@",
        "title": "SNP&#39;s Matheson ‘putting lives in danger’ by refusing to quit over iPad bill row",
        "description": "Jackie Baillie, with Anas Sarwar, the Scottish <b>Labour</b> leader, said Michael Matheson ‘must go’ Credit: Ken Jack/Getty Images Dame Jackie Baillie, Scottish <b>Labour</b>’s health spokesman, said: “The health secretary has been missing in action while ..."
    },
    {
        "url": "https://inews.co.uk/news/jeremy-hunt-stamp-duty-housing-crisis-2892905?ico=more_from_this_author",
        "title": "If Jeremy Hunt made simple tweaks to stamp duty, he could fix the housing crisis",
        "description": "Barry Gardiner, the <b>Labour</b> MP for Brent North, is releasing a documentary about the leasehold scandal (Photo: Leon Neal/Getty Images) Firstly, the <b>Labour</b> MP for Brent North has released a documentary about the leasehold scandal. It makes for compelling and ..."
    },
    {
        "url": "https://uk.news.yahoo.com/hunt-claims-tax-rises-needed-195754252.html",
        "title": "Hunt claims tax rises needed to fund <b>Labour</b>’s £28bn green spending pledge",
        "description": "Income tax would need to rise by 4% to fund <b>Labour</b>’s £28 billion green spending pledge, according to Jeremy Hunt. The Chancellor also claimed that an alternative approach to increase spending by £28 billion while sticking to fiscal rules would involve ..."
    },
    {
        "url": "https://uk.news.yahoo.com/dentists-offered-cash-incentives-treat-170800885.html",
        "title": "Dentists to be offered cash incentives to treat NHS patients and work in under-served areas",
        "description": "<b>Labour</b> claimed the government was &quot;only promising to do something about it now there&#39;s an election coming&quot;. Pointing to his party&#39;s own plan for supervised toothbrushing for children and thousands of extra appointments, shadow health secretary Wes ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/susanna-reid-praised-skewering-mel-stride-20231895/?ico=read_full_story_videopage",
        "title": "Susanna Reid praised for ‘skewering’ Tory MP after Rishi Sunak’s Rwanda ‘bet’",
        "description": "That wasn’t all Reid grilled him on either, as she called him out on his comments on <b>Labour</b> having ‘absolutely no plan’ to cut the number of migrants crossing the channel. ‘That’s absolutely not true to say that <b>Labour</b> don’t have a plan ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?filterKeyEvents=true&page=with:block-65c22ed58f08fa977b9e5e13",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Identifying five “rules” needed for Tory success, he said: Wes Streeting, the shadow health secretary, has described the government’s dental recovery plan as “remarkably similar to <b>Labour</b>’s”. He was responding to a BBC report saying the plan ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/welsh-translation-blunder-road-sign-120000016.html",
        "title": "Welsh translation blunder on road sign brands scenic Gwent community ‘egg gas town’",
        "description": "MONMOUTH has been given a somewhat unfortunate new moniker in a Welsh translation blunder on a road sign. Monmouth in Welsh translates to Trefynwy, meaning ‘town on the Monnow’. However, on the A449 interchange at Usk, the town&#39;s spelling instead has ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=true&page=with:block-65c0dd0a8f0887442867e4c5",
        "title": "<b>Labour</b> says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "SNP condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’. This live blog is closed Rishi Sunak has been widely criticised for accepting a £1,000 bet with TalkTV presenter Piers Morgan relating to whether he will manage to ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68171168.amp",
        "title": "Dentists to get cash incentives for NHS patients",
        "description": "The government is preparing to offer dentists cash incentives to take on extra NHS patients, and send teams to schools to treat children&#39;s teeth. Under a plan to boost services in England seen by the BBC, dentists will receive a &quot;bonus&quot; to take on more NHS patients."
    },
    {
        "url": "https://www.cwmbranlife.co.uk/senedd-covid-19-committee-not-fit-for-any-purpose-say-bereaved-families/",
        "title": "Senedd Covid-19 committee ‘not fit for any purpose’ say bereaved families",
        "description": "Bereaved families have described a Senedd Covid-19 committee as “not fit for any purpose” amid concerns about duplication and a"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/esther-mcvey-labour-emily-thornberry-liz-truss-government-b1137516.html",
        "title": "Government to review ministers’ severance payouts but rejects immediate reform",
        "description": "Cabinet Office minister Esther McVey said the principle of making “reasonable” payments “remains sound” given ministers can be removed at any time, telling MPs: “The Government doesn’t currently intend to reform severance pay for departing ministers, although I am happy to review it.”"
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24099582.torfaen-councillors-told-budget-will-envy-wales/",
        "title": "Torfaen councillors told budget &#39;will be the envy of Wales&#39;",
        "description": "RISKS around energy prices and pay increases are concerning councillors in Torfean – which is preparing a budget “likely to be the envy” of many Welsh councils. The council’s funding from the Welsh Government is set to increase by 3.24 per cent for the 2024/25 financial year which is above the Welsh average of 3.1 per cent it been planning for."
    },
    {
        "url": "https://www.ft.com/content/463a24c3-497f-4fc7-b6f7-7bc1b1a33a70",
        "title": "Federal Reserve official says hot <b>labour</b> market will not derail plans for interest rate cuts",
        "description": "A top Federal Reserve official has insisted that the US’s hot labour market is continuing to cool, in a sign that last month’s unexpectedly strong employment numbers will not derail plans by rate setters to cut borrowing costs this year."
    },
    {
        "url": "https://www.heraldscotland.com/news/12008566.pact-prospect-is-delightful/",
        "title": "Pact prospect is delightful",
        "description": "I WAS delighted to read today that a Lib- Dem/SNP pact is now a possibility. Let&#39;s hope the talks will lead to the two parties forming a"
    },
    {
        "url": "https://www.heraldscotland.com/news/12009088.an-unlikely-leading-man-emerges-from-behind-the-scenes/",
        "title": "An unlikely leading man emerges from behind the scenes",
        "description": "By brokering a consensus around a document so redolent in the language and vision of New Labour, Mr Robin Cook has demonstrated his value to the Prime Minister as a key conduit for pumping Blairite thinking into the heart of Europe."
    },
    {
        "url": "https://www.lbc.co.uk/news/dentists-to-be-paid-20-000-to-take-on-nhs-patients/",
        "title": "Dentists to be paid £20,000 to take on NHS patients in plan to tackle &#39;dental deserts&#39;",
        "description": "Responding to the leaked plan, <b>Labour</b> accused the Tories of stealing their ideas. Shadow Health Secretary Wes Streeting said: &quot;After 14 years of Conservative neglect, patients are desperately queuing around the block to see a dentist, literally pulling ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/by-election-tripping-point-tory-disaster-nadine-dorries/",
        "title": "Tories losing next week&#39;s by-election will be &#39;tipping point&#39; for &#39;seismic&#39; election defeat, Nadine Dorries tells LBC",
        "description": "The Tories losing next week&#39;s by-election in Wellingborough will act as a &#39;tipping point&#39; before the party faces a &#39;seismic&#39; electoral wipeout, Nadine Dorries has told LBC."
    },
    {
        "url": "https://www.modernghana.com/news/1290768/recruitment-video-employment-ministry-denies-rece.html",
        "title": "Recruitment Video: Employment Ministry denies receiving request for recruitment in Canada",
        "description": "The Ministry of Employment and Labour Relations has denounced a video circulating online that alleges a Ghanaian woman was denied authorisation to recruit labour for jobs in Canada."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/how-wish-grown-a-time-internet-20234415/",
        "title": "How I wish I’d grown up in a time without the internet",
        "description": "Generation X, the cohort born roughly between 1965 and 1980, stands as the final generation to truly comprehend life without the incessant presence of a smartphone or computer screen. In today’s MetroTalk, a Gen-Z (1997 – 2012) reader expresses nostalgia for an era untouched by the pervasive influence of internet-induced ‘brain rot.’"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/asda-billionaire-brothers-infuriate-locals-32062350",
        "title": "Asda billionaire brothers infuriate locals with plans for five &#39;monstrous McMansions&#39;",
        "description": "Now, amendments to the plans have also been passed by the <b>Labour</b>-run council - and neighbours are angry again. The changes will see the height of the homes increased and the felling of more trees, adjustments described as &quot;monstrous&quot; by one local."
    },
    {
        "url": "https://www.building.co.uk/news/gove-gives-all-clear-for-lendlease-to-start-700m-itv-studios-redevelopment/5127637.article",
        "title": "Gove gives all clear for Lendlease to start £700m ITV Studios redevelopment",
        "description": "Communities secretary backs planning inspector&#39;s recommendation to approve South Bank scheme two years after work was due to start"
    },
    {
        "url": "https://utilityweek.co.uk/labour-calls-for-water-companies-to-lose-licence-for-environmental-violations/",
        "title": "<b>Labour</b> calls for water companies to lose licence for environmental violations",
        "description": "The government has been accused of “tinkering at the edges” of the issues facing the water industry, by opposition MPs. Shadow environment minister Emma Hardy made the accusation while speaking at a Parliamentary debate on proposed amendments to the special administration regime (SAR) for water companies facing insolvency or failing"
    },
    {
        "url": "https://www.eastlothiancourier.com/news/24102106.labour-politicians-angela-rayner-anas-sarwar-visit-east-lothian/",
        "title": "<b>Labour</b> politicians Angela Rayner and Anas Sarwar visit East Lothian",
        "description": "Angela Rayner, deputy leader of UK Labour, and Anas Sarwar, Scottish Labour leader, joined Douglas Alexander, the party’s candidate for the East Lothian constituency, and South Scotland MSP Martin Whitfield in Prestonpans and at Glenkinchie Distillery, near Pencaitland, on Friday."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68219737",
        "title": "Trafford Council to press on with £76.5m &#39;New Carrington&#39; road",
        "description": "A council said it planned to press on with an &quot;essential&quot; £76.5m relief road. The &#39;New Carrington&#39; road in Trafford, which was first proposed more than a decade ago, is aimed at cutting traffic congestion on the single existing road in and out of the area."
    },
    {
        "url": "https://www.monmouthshirebeacon.co.uk/news/health/senedds-covid-19-committee-not-fit-for-purpose-664622",
        "title": "Senedd&#39;s Covid-19 committee &#39;not fit for purpose&#39;",
        "description": "Bereaved families have described a Senedd Covid-19 committee as “not fit for any purpose” amid concerns about duplication and a lack of engagement."
    },
    {
        "url": "https://londonnewsonline.co.uk/news/lib-dems-announce-candidate-to-fight-lewisham-mayoral-by-elections/",
        "title": "Lib Dems announce candidate to fight Lewisham Mayoral by-elections",
        "description": "Former councillor Chris Maines has been announced as the Liberal Democrat candidate for the forthcoming mayoral by-election following Damien Egan’s resignation earlier this month. Mr Maines – who works for the NHS – is a former Lewisham councillor and has lived in Blackheath for almost 20 years."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863737/liz-truss-popular-conservativism-group",
        "title": "I was at the launch of Liz Truss’s ‘Popular Conservatives’ movement - I still don’t get it",
        "description": "That may be true. The country certainly isn’t full of Starmerites desperate to put <b>Labour</b> in power to achieve the square root of nothing. However I remain unconvinced that Ms Truss is the person to spearhead a Popular Conservatives movement. She may be ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/clare-haughey-challenges-michael-shanks-32061068",
        "title": "Clare Haughey challenges Michael Shanks on prioritising bankers’ bonuses over child benefits",
        "description": "This stems from October when Labour’s Shadow Chancellor Rachel Reeves criticized the Tories for scrapping bankers’ bonus cap, before later U-turning, alongside Labour not committing to ending the two-child benefit cap – which is affecting 1.5 million children."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics?filterKeyEvents=true&page=with:block-65c223d98f085be9f686a6ef",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-county-council-tax-rise-28581723",
        "title": "Northumberland County Council facing £30m budgets savings as households are expected to by hit with a council tax rise",
        "description": "The Northumberland County Council budget will be voted on by full council later this month at County Hall in Morpeth"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24101652.farnworth-school-expansion-costs-rocket-extra-1-8m-now-needed/",
        "title": "Farnworth: School expansion costs rocket as extra £1.8m now needed",
        "description": "The cost to expand a school has rocketed by £1.8million with high building material prices and <b>labour</b> shortages blamed. Green Fold Special School in Farnworth delivers teaching for primary pupils with a wide variety of complex educational needs across ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/labour-28bn-green-pledge-confusion-tories-election/",
        "title": "<b>Labour</b>’s £28bn green pledge confusion ‘gives Tories election hope’",
        "description": "Strategists believe leadership’s uncertain approach could bode well for Conservatives if replicated in campaign"
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/06/the-guardian-view-on-the-state-pension-age-mindlessly-hiking-it-is-not-the-answer",
        "title": "The Guardian view on the state pension age: mindlessly hiking it is not the answer",
        "description": "Editorial: Just one in 11 men born today can expect to reach retirement age in good health. A system rethink is needed"
    },
    {
        "url": "https://www.heraldscotland.com/news/12008822.exploding-the-myths-of-blairs-spin-doctors/",
        "title": "Exploding the myths of Blair&amp;apos;s spin doctors",
        "description": "There are no dissidents in the Cabinet. They&#39;ve all been on-message since well before the General Election. New <b>Labour</b>&#39;s message has materialised. New <b>Labour</b> is honouring its electoral pledges. That&#39;s the problem. Its economic strategy is the most ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/12009879.the-heavy-brigade-makes-light-of-canavan-question/",
        "title": "The heavy brigade makes light of Canavan question",
        "description": "But this was Falkirk High Street. The town&#39;s two constituencies had <b>Labour</b> majorities of more than 13,000 at the General Election amid swings away from the SNP. And polling day wasn&#39;t next week or next month. It was exactly four months away. Mo Mowlam may ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/wales-welsh-government-senedd-england-northern-ireland-b2491613.html",
        "title": "University tuition fees in Wales set to rise for first time in a decade",
        "description": "Our universities are in a dire situation. Rather than investing in them, we are seeing the <b>Labour</b> Government making it more difficult for students from Wales to study in Wales Heledd Fychan, Plaid Cymru It comes as the Welsh government struggles to balance ..."
    }
]