[
    {
        "url": "https://www.fxstreet.com/analysis/the-60-minutes-walk-back-202402050056",
        "title": "The “60 minutes” walk back",
        "description": "Powell&#39;s &quot;base case&quot; suggests that inflation will continue to decline over the first six months of this year, given the unwinding supply chain disruptions and the impact of the Fed&#39;s rate hikes. Powell highlighted the historical anomaly of these rate increases not leading to a sharper economic slowdown."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68185435",
        "title": "Former Scottish <b>Labour</b> leader Kezia Dugdale admits voting SNP",
        "description": "A former leader of the Labour Party in Scotland has admitted voting SNP. Kezia Dugdale told a new BBC documentary she was &quot;so mad about Brexit&quot; she backed the party at the European Parliament election in 2019. She said she had voted Labour at every election since."
    },
    {
        "url": "https://www.landlordtoday.co.uk/breaking-news/2024/2/renters-reform-bill--no-progress-in-parliament-for-at-least-another-two-weeks",
        "title": "Renters Reform Bill - government reveals another Commons.delay",
        "description": "The Renters Reform Bill will not go for its Third Reading in the House of Commons for at least another fortnight."
    },
    {
        "url": "https://www.lettingagenttoday.co.uk/breaking-news/2024/2/political-uncertainty-suggests-ongoing-landlord-exodus-says-knight-frank",
        "title": "Political uncertainty suggests ongoing landlord exodus, says Knight Frank",
        "description": "Prime London rental values fell closer to their longer-term average in January, as supply continued to increase."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/05/late-queens-common-sense-will-be-used-to-guide-permanent-memorial-in-her-honour/",
        "title": "Late Queen’s common sense will be used to guide permanent memorial in her honour",
        "description": "Baroness Amos and anti-bullying campaigner Alex Holmes have been appointed to the Queen Elizabeth Memorial Committee, alongside Lord Janvrin."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labours-green-investment-pledge-raises-so-many-questions-0jh9jd3fx",
        "title": "<b>Labour</b>’s green investment pledge raises so many questions",
        "description": "Those of us who pay attention to this sort of stuff are probably getting a little bored hearing about <b>Labour</b>’s pledge to spend £28 billion a year on green investment. Will they? Won’t they? Will it depend on the fiscal inheritance? And if so ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/snp-spin-secrecy-and-destruction-evidence-leaves-three-questions-unanswered",
        "title": "SNP ‘spin, secrecy and destruction of evidence’ leaves three questions unanswered, <b>Labour</b> says",
        "description": "Scottish Labour’s deputy leader Jackie Baillie accused the SNP of “completely betraying” families who lost loved ones during the pandemic. She said: “Despite the extraordinary work the inquiry is doing to uncover the truth, the SNP’s spin, secrecy and destruction of evidence has left us all with unanswered questions."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-extend-equal-pay-rights-001518005.html",
        "title": "<b>Labour</b> ‘to extend equal pay rights to ethnic minorities’ in draft Race Equality Act",
        "description": "<b>Labour</b> will reportedly extend the full right to equal pay that exists for women to ethnic minority workers for the first time if Sir Keir Starmer’s party wins the general election, under new plans for a draft Race Equality Act. In plans <b>Labour</b> hopes ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-68153601?at_medium=RSS",
        "title": "DUP deal aimed at restoring power sharing in Northern Ireland is published",
        "description": "The prime minister added this would offer a &quot;brighter future for Northern Ireland&quot;. <b>Labour</b> leader Sir Keir Starmer also described it as an &quot;important moment&quot; and that all sides needed to work together to kickstart devolution. A Stormont deal is agreed ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/diana-queen-government-house-of-lords-cabinet-office-b1136983.html",
        "title": "Late Queen’s common sense will be used to guide permanent memorial in her honour",
        "description": "Baroness Amos and anti-bullying campaigner Alex Holmes have been appointed to the Queen Elizabeth Memorial Committee, alongside Lord Janvrin."
    },
    {
        "url": "https://www.dailymail.co.uk/news/royals/article-13044975/Memorial-legacy-programme-honour-late-Queen-celebrate-monarchs-relentless-common-sense.html",
        "title": "Memorial and legacy programme to honour the late Queen will celebrate the monarch&#39;s &#39;relentless common sense&#39;",
        "description": "Lord Janvrin, who is chair of the Queen Elizabeth Memorial Committee, said Elizabeth II&#39;s practical views will be in the back of his mind as he embarks on the task of creating a lasting tribute."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13044961/Britain-bolster-military-presence-Northern-Ireland-stop-used-hostile-states-door-attack-UK-report-warns.html",
        "title": "Britain should bolster its military presence in Northern Ireland to stop it being used by hostile states as a &#39;back door&#39; to attack the UK, report warns",
        "description": "In a study backed by former Tory and Labour defence secretaries, the Policy Exchange think tank warns that Ireland&#39;s defences could leave this country vulnerable to attack."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/warning-over-ireland-threat-uk-as-sunak-visits-ulster/",
        "title": "Warning over Ireland’s threat to UK as Sunak visit Ulster",
        "description": "Ireland would be “no friend” to the UK under Sinn Fein, a report backed by two former defence secretaries warned as Rishi Sunak visited Northern Ireland to mark the restoration of power to Stormont."
    },
    {
        "url": "https://www.thetimes.co.uk/radio/show/20240204-27684/2024-02-04",
        "title": "Highlights from Times Radio",
        "description": "Legendary architect of New <b>Labour</b> Peter Mandelson can draw on his vast experience as a spin doctor, election supremo, cabinet minister and adviser to <b>Labour</b> leaders on how to win elections, and what might stand in their way.Nobody knows the highs and lows ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/labour-apprenticeships-week-tories/",
        "title": "<b>Labour</b> slam Tories for &quot;stealing opportunities&quot; on apprenticeships as enrolments down a quarter",
        "description": "<b>Labour</b> said enrolment has fallen by a quarter under the Tories - as shadow education secretary Bridget Phillipson vowed that <b>Labour</b> will &quot;transform&quot; the apprenticeship levy if its wins the next general election. Officials said analysis of Department for ..."
    },
    {
        "url": "https://www.newsdzezimbabwe.co.uk/2024/02/rbz-ordered-to-pay-168-former-workers.html",
        "title": "RBZ ORDERED TO PAY 168 FORMER WORKERS",
        "description": "THE Reserve Bank of Zimbabwe has been ordered to pay a group of 168 retrenched former security officers’ salary arrears accrued over two"
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/kate-garraways-daughter-carries-dad-32030424?int_source=nba",
        "title": "Kate Garraway&#39;s daughter carries dad Derek Draper&#39;s coffin at funeral as they say final goodbye",
        "description": "Derek, a prominent figure in New <b>Labour</b> in the 1990 who was also an author, was admitted to hospital in December when he had a heart attack. Kate announced her husband’s death on Instagram, with a post saying: “As some of you may know he has been ..."
    }
]