[
    {
        "url": "https://www.itv.com/news/2024-02-16/scottish-labour-mps-should-be-whipped-in-gaza-ceasefire-vote-snp",
        "title": "Scottish <b>Labour</b> MPs should be whipped in Gaza ceasefire vote – SNP",
        "description": "The SNP is calling on Scottish <b>Labour</b> to whip its two MPs to vote for an immediate ceasefire in Gaza, ahead of a vote in the House of Commons next week. On Saturday, Scottish <b>Labour</b>’s conference is expected to pass a motion calling for an immediate ..."
    },
    {
        "url": "https://uk.news.yahoo.com/yousaf-campaign-scottish-tory-leader-000100143.html",
        "title": "Yousaf to campaign in Scottish Tory leader’s seat",
        "description": "The SNP has set its sights on Mr Ross’ party, with <b>Labour</b> riding high in the polls ahead of an election expected this year. Mr Yousaf will appear in Moray on Saturday alongside the Moray West, Nairn and Strathspey candidate Graham Leadbitter, visiting a ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/keir-starmer-labour-leader-general-election-biography-v706kqcd2",
        "title": "The private life of Keir Starmer — his wife and family reveal all",
        "description": "Having been granted unprecedented access, Tom Baldwin’s new biography explores what the Labour leader is really like away from the limelight"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13093961/Could-Rochdale-Muslims-enraged-war-Gaza-sweep-Putin-loving-firebrand-George-Galloway-House-Commons.html",
        "title": "Could Rochdale Muslims enraged by the war in Gaza sweep Putin-loving firebrand George Galloway back into the House of Commons?",
        "description": "And with another anti-Semitic scandal embroiling the <b>Labour</b> Party, the bookies have now made the pugnacious Scot — who, as someone once said, could start an argument in a phone box — the narrow favourite to win the seat. The bigger picture is that Sir ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/starmer-set-to-attend-major-munich-security-conference-100245/",
        "title": "Starmer set to attend major Munich security conference",
        "description": "Sir Keir Starmer is expected to be at a major security conference in Germany on Saturday for talks and meetings with world leaders. The Labour leader will arrive at the Munich Security Conference fresh from two by-election victories, with Sir Keir expected to use the major annual event to stress his party’s commitment to Nato and defence."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/national/24126044.come-together-sunak-tells-conservatives-twin-by-election-blow/",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "The losses to <b>Labour</b> and an emboldened Reform UK party came as a twin blow to the Prime Minister, with the results the latest in a series of by-election defeats for Mr Sunak. The results mean the Conservative Government has endured more by-election losses ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/after-rishi-sunaks-latest-election-32147266",
        "title": "&#39;After Rishi Sunak&#39;s latest by-election blows we have to say - give us a general election now&#39;",
        "description": "No amount of Tory spin can hide how ­disastrously their party performed in what were previously two safe Conservative seats - it&#39;s time we have a general election"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-wellingborough-conservatives-labour-government-b1139755.html",
        "title": "‘Come together’ Sunak tells Conservatives after twin by-election blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/murray-vows-trade-missions-to-every-continent-under-labour-110725/",
        "title": "Murray vows trade missions to every continent under <b>Labour</b>",
        "description": "A Labour-led Scotland Office would lead trade missions to every continent, the party’s shadow Scottish secretary is expected to announce. Ian Murray will address the Scottish Labour conference in Glasgow on Saturday, telling activists a Labour government will “sell Scotland to the world”."
    },
    {
        "url": "https://uk.news.yahoo.com/recession-election-misery-sent-rishi-230047940.html",
        "title": "How A Recession And By-Election Misery Sent Rishi Sunak Back To Square One",
        "description": "For three days, it looked as though Rishi Sunak was having the rarest of things for him – a good week. Keir Starmer was under the cosh over <b>Labour</b>’s woes in Rochdale and, despite predictions to the contrary by economists, inflation did not go up again ..."
    }
]