[
    {
        "url": "https://www.thetimes.co.uk/article/ill-help-the-sick-get-back-to-work-vows-mairi-mcallan-q89mt95kt",
        "title": "I’ll help the sick get back to work, vows Mairi McAllan",
        "description": "Minister says 240,000 Scots unable to take jobs due to ill health is ‘too many’ as businesses struggle to fill roles"
    },
    {
        "url": "https://www.peterboroughtoday.co.uk/news/politics/westminster-life-ive-always-put-my-hometown-first-4530451",
        "title": "Westminster Life: I’ve always put my hometown first",
        "description": "I will continue to lobby for our fair share of capital investment. You don’t have to look hard to see what the alternative would be under <b>Labour</b>. With the <b>Labour</b> Peterborough and Cambridgeshire Mayor refusing to rule out congestion charging in Peterborough."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/victoria-atkins-health-secretary-diana-johnson-mps-the-telegraph-b1141264.html",
        "title": "Health Secretary signals backing for decriminalising abortion",
        "description": "Victoria Atkins suggested she would support a new clause to remove women from the criminal law relating to abortion."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-faces-call-kick-32200665",
        "title": "Rishi Sunak faces call to kick Liz Truss out of Tory Party for &#39;damaging&#39; conspiracy rants",
        "description": "Labour has written to Rishi Sunak calling on him to punish Liz Truss after she blamed a &#39;deep state&#39; for her failure and failed to challenge claims Tommy Robinson is a &#39;hero&#39;"
    },
    {
        "url": "https://www.bucksfreepress.co.uk/news/national/24141549.labour-demands-truss-anderson-lose-whip-pair-rebuked-senior-tory/",
        "title": "<b>Labour</b> demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "<b>Labour</b> has called for Liz Truss and Lee Anderson to lose the Tory whip over media appearances that also caused anger within Conservative ranks. In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth said ..."
    },
    {
        "url": "https://news.sky.com/story/calls-for-lee-anderson-to-be-kicked-out-of-conservatives-over-divisive-and-dangerous-comments-13079525",
        "title": "Calls for Lee Anderson to be kicked out of Conservatives over &#39;divisive and dangerous&#39; comments",
        "description": "Politicians from across the political spectrum have criticised the MP following remarks he made about London mayor Sadiq Khan."
    },
    {
        "url": "https://www.ft.com/content/ec279514-bc03-455a-9b39-4634afa3197a",
        "title": "Rishi Sunak urged to discipline Lee Anderson over Islamist claims",
        "description": "Rishi Sunak was urged on Friday to remove the Conservative whip from senior MP Lee Anderson, after he claimed that Islamists had “got control” of London and the capital’s Labour mayor Sadiq Khan."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119769/SNP-savaged-failing-business.html",
        "title": "SNP savaged for failing business",
        "description": "Hundreds of bars, restaurants and hotels have shut down or been left &#39;teetering on the brink&#39; because of the SNP &#39;s punishing tax regime, hospitality chiefs have warned."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/uk-vows-to-support-ukraine-until-they-prevail-as-war-enters-third-year-111303/",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "Prime Minister Rishi Sunak said Britain was prepared to do ‘whatever it takes, for as long as it takes’ to help the country."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/jonathan-ashworth-liz-truss-rishi-sunak-labour-steve-bannon-b1141263.html",
        "title": "<b>Labour</b> demands Truss and Anderson lose whip as pair rebuked by senior Tory",
        "description": "In a letter to Prime Minister Rishi Sunak on Friday, shadow paymaster general Jonathan Ashworth condemned remarks made by the pair as ‘egregious’."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/23/mps-to-get-free-vote-on-decriminalising-abortion-in-england-and-wales?ref=upstract.com",
        "title": "MPs to get free vote on decriminalising abortion in England and Wales",
        "description": "Amendment by <b>Labour</b> MP Diana Johnson would end prosecutions for terminations after 24 weeks MPs are expected to get a free vote on decriminalising abortion when a <b>Labour</b> backbencher lays an amendment that would end the prosecution of women who terminate ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/ukraine-rishi-sunak-keir-starmer-kyiv-prime-minister-b1141262.html",
        "title": "UK vows to support Ukraine ‘until they prevail’ as war enters third year",
        "description": "Prime Minister Rishi Sunak said Britain was prepared to do ‘whatever it takes, for as long as it takes’ to help the country."
    },
    {
        "url": "https://www.ibtimes.co.uk/migrant-women-are-still-victim-sexual-violence-throughout-migration-process-1723595",
        "title": "Migrant Women Are Still Victim To Sexual Violence Throughout Migration Process",
        "description": "While 67 per cent of all migrant women are employed in the labour force, unofficial employment and the lack of gender-responsive migration policies threatens gender equalities in employment."
    },
    {
        "url": "https://www.counterfire.org/article/no-ceasefire-no-vote-a-new-movement-in-the-making/",
        "title": "No Ceasefire, No Vote: a new movement in the making",
        "description": "The Gaza solidarity movement has been the spark for independents to start to organise an alternative to Labour, argues Mary Mason Wednesday night’s disgraceful behaviour in the House of Commons shows how far down Keir Starmer is prepared to drag the Labour Party in his craven support for Israel and its probable annexation of that part of historic Palestine that is not currently part of Israel proper."
    },
    {
        "url": "https://www.thesun.co.uk/news/26149197/mps-decriminalise-abortions-vote/",
        "title": "Abortions set to be decriminalised by MPs in ­historic vote next month",
        "description": "MPs are poised to decriminalise abortions in a ­historic vote next month. They are likely to unravel a 19th century law under which women can be prosecuted for ending pregnancies beyond the legal"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119609/MPs-decriminalise-abortion-historic-vote-women-pregnancies.html",
        "title": "MPs poised to decriminalise abortion in historic vote which will stop women who end pregnancies outside permitted circumstances being jailed",
        "description": "After a surge in police investigations polling suggests a majority of MPs think women should no longer be prosecuted for having an abortion after the 24-week legal time limit."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/23/labour-passes-budget-without-amendment/",
        "title": "<b>Labour</b> passes budget without amendment",
        "description": "Council tax in Brighton and Hove will increase by 4.99 per cent after Labour councillors voted through an unamended budget."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1870283/Gogglebox-cast-Mary-and-Giles-tory-politics-complaints",
        "title": "Gogglebox&#39;s Giles and Mary divide Channel 4 viewers as couple &#39;show their true colours&#39;",
        "description": "Channel 4 stars Giles Wood and Mary Killen seemingly lost some of their fans as the married couple aired their political opinions during tonight&#39;s episode of Gogglebox."
    },
    {
        "url": "https://uk.news.yahoo.com/lee-andersons-divisive-dangerous-rant-210501309.html",
        "title": "Lee Anderson&#39;s &#39;divisive and dangerous&#39; rant against Sadiq Khan condemned by Tory and <b>Labour</b> MPs",
        "description": "Mr Anderson made his rant after Right-wing ex-Home Secretary Suella Braverman, who was sacked by Rishi Sunak, had wrongly claimed that “the Islamists, the extremists and the anti-Semites are in charge now” following the chaos in Parliament over a Gaza ceasefire vote."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119331/Justice-Minister-vows-stamp-scourge-gagging-laws-crackdown-oligarchs-powerful-groups-trying-silence-Press.html",
        "title": "Justice Minister vows to stamp out scourge of &#39;gagging laws&#39; in crackdown on oligarchs and powerful groups trying to silence the Press",
        "description": "A crackdown on oligarchs and powerful groups who use &#39;gagging&#39; laws to silence the Press has won ministerial support after Justice Secretary Alex Chalk vows to combat &#39;savage war on truth&#39;."
    },
    {
        "url": "https://www.channel4.com/news/mp-safety-debate-jo-coxs-death-was-not-as-a-result-of-a-protest-says-labour-mp",
        "title": "MP Safety Debate: Jo Cox’s death was ‘not as a result of a protest’ says <b>Labour</b> MP",
        "description": "We were joined by Labour MP Lucy Powell, who serves as the shadow leader of the House of Commons."
    }
]