[
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68395364",
        "title": "Newspaper headlines: &#39;Bodyguards for MPs&#39; and Starmer turns on Tories",
        "description": "&quot;Boot out this bigot&quot; reads the headline on the front of the Sunday Mirror, next to a picture of Lee Anderson. It reports on the Tory MP being suspended by his party following his comments about Mayor of London Sadiq Khan."
    },
    {
        "url": "https://news.sky.com/story/keir-starmer-accuses-weak-sunak-of-harbouring-extremists-in-his-party-13080553",
        "title": "Keir Starmer accuses &#39;weak&#39; Sunak of harbouring &#39;extremists&#39; in his party",
        "description": "The <b>Labour</b> leader said Rishi Sunak&#39;s &quot;weakness&quot; allowed Lee Anderson &quot;to act with impunity&quot; and that he &quot;needs to get a grip and take on the extremists in his party&quot;. Sir Keir said it was &quot;right&quot; that Mr Anderson lost the whip after what he called an ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/jeremy-hunt-recession-budget-2024-labour-cant-follow-gl9d2nmhn",
        "title": "With his plans ripped up, Jeremy Hunt may go where <b>Labour</b> can’t follow",
        "description": "Before every budget there is a slightly giddy period when journalists — and politicians — start floating all manner of proposals that might, or should, be in it. The latest is the idea that, to help young people onto the housing ladder, the government ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mark-harper-prime-minister-midlands-government-humber-b1141345.html",
        "title": "Sunak to hold regional Cabinet as local transport fund announced",
        "description": "The Prime Minister said there is a ‘clear plan to level up our country’ by investing in projects across the North and the Midlands."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-gaza-government-keir-starmer-commons-b1141347.html",
        "title": "SNP to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "MPs are set to again debate calling for a ceasefire in Gaza after a previous attempt dissolved into angry recriminations and demands for the Commons Speaker to resign. The SNP said it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the last Commons debate on the subject."
    },
    {
        "url": "https://www.northernsoul.me.uk/centenary-labour-phm-mcr/",
        "title": "A century later: the first <b>Labour</b> Government, People’s History Museum, Manchester",
        "description": "That first <b>Labour</b> administration of 1924 was short-lived, lacking the parliamentary majority necessary for longer tenure, and inheriting both the recent loss of the Irish Free State and increasing unemployment. Nonetheless, that <b>Labour</b> should have come ..."
    },
    {
        "url": "https://www.nottinghampost.com/news/uk-world-news/local-transport-fund-cabinet-meeting-9122958",
        "title": "&#39;Local transport fund&#39; Cabinet meeting coming North after HS2 axe",
        "description": "The new fund will see Rishi Sunak visit the North of England as he discloses how money from the abandoned HS2 plans will be shared across regional councils"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/lee-anderson-sadiq-khan-prime-minister-labour-baroness-warsi-b1141337.html",
        "title": "PM’s silence is ‘tacit endorsement of vile remarks’ by Anderson, says mayor",
        "description": "Former deputy party chairman Lee Anderson lost the Tory whip after refusing to apologise for the remarks on ‘Islamists’."
    },
    {
        "url": "https://uk.news.yahoo.com/calls-more-tower-crane-safety-234204130.html",
        "title": "Calls for more tower crane safety after death of Vancouver worker",
        "description": "The union representing crane operators in B.C. is asking for stricter safety regulations after a Vancouver construction worker was killed when a crane&#39;s load fell on her.Yuridia Flores, a mother of two from Mexico,"
    },
    {
        "url": "https://www.thesun.co.uk/news/26163303/sir-keir-starmer-fix-speaker-gaza-votes/",
        "title": "<b>Labour</b> MPs boasted Sir Keir Starmer was ‘going to fix the Speaker’ in crunch meeting over Gaza votes",
        "description": "<b>LABOUR</b> MPs boasted Sir Keir Starmer was “going to fix the Speaker” in a crunch meeting over Gaza votes which sent Parliament into meltdown. The explosive claim piles pressure on Sir Keir to reveal what was said in the showdown with Sir Lindsay Hoyle."
    },
    {
        "url": "https://news.sky.com/story/the-prime-minister-in-waiting-but-who-really-is-keir-starmer-13079122",
        "title": "The Prime Minister In Waiting - but who really is Keir Starmer?",
        "description": "The man himself may insist it isn&#39;t over until the votes are in, but Keir Starmer looks likely to be the next prime minister. Who is he and how did he get here? And why do those close to him feel the public doesn&#39;t see all of what they see?"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870461/Rishi-Sunak-s-5-billion-transport-plan-to-fire-up-the-north",
        "title": "Rishi Sunak&#39;s £5 billion transport plan to &quot;fire up&quot; the north",
        "description": "RISHI Sunak vowed to revitalise Britain’s forgotten regions by pumping almost £5billion into improving transport links. The PM will use cash saved by scrapping the northern leg of HS2 to upgrade roads, rail and bus services in “red wall” areas."
    },
    {
        "url": "https://www.burnham-on-sea.com/news/risk-to-financial-future-of-somerset-council-remains-despite-budget-agreement/",
        "title": "Risk to financial future of Somerset Council remains despite budget agreement",
        "description": "Somerset Council could still declare bankruptcy within the next 12 months despite managing to pass a balanced budget last week, it has been warned."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68393822.amp",
        "title": "RMT leader Mick Lynch gives Jeremy Corbyn general election backing",
        "description": "RMT leader Mick Lynch said the union would back Mr Corbyn should he run for his seat again as an independent. &quot;We will support all sorts of people in this election, because we&#39;re not affiliated,&quot; Mr Lynch told the War on Want conference."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/national/24142457.taxpayer-funded-bodyguards-cars-provided-mps-due-safety-fears/",
        "title": "Taxpayer-funded bodyguards and cars ‘provided to more MPs due to safety fears’",
        "description": "Taxpayer-funded bodyguards and cars have reportedly been provided to more MPs amid growing fears for their safety. A rising number of politicians have been assessed to be at risk and are being provided with close protection by private security personnel, the Sunday Telegraph reported."
    }
]