[
    {
        "url": "https://pressgazette.co.uk/publishers/digital-journalism/novara-media-15000-supporters-youtube-events-north-editor-craig-gent/",
        "title": "Youtube drives increase in paying readers as Novara Media nears 15,000 donors",
        "description": "Craig Gent told Press Gazette that despite the cost of living crisis, 2023 was Novara Media&#39;s strongest year for supporter funding."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022439/Angela-Rayner-Palestinian-protesters-police-Israel-Gaza.html",
        "title": "Angela Rayner resurfaces on GMB following low-key few weeks as she says she &#39;understands&#39; rage of pro-Palestinian protesters after needing police escort from chaotic fundraiser ...",
        "description": "Footage shared on social media on Friday showed an event attended by the deputy <b>Labour</b> leader and shadow business secretary Jonathan Reynolds descending into chaos. Activists shouted about the death toll and demanded to know how Ms Rayner could call ..."
    },
    {
        "url": "https://uk.news.yahoo.com/police-officer-numbers-region-fall-090508471.html",
        "title": "Police officer numbers in region fall following government recruitment drive",
        "description": "If voted into power, Ms Cooper vowed <b>Labour</b> would &quot;restore order to the border, establish a new police unit to smash the smuggler gangs and put neighbourhood police back on our streets to keep our local communities safe&quot;. But a Home Office source hit back ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labours-green-energy-plans-run-095257133.html",
        "title": "<b>Labour</b>&#39;s green energy plans will run out of steam",
        "description": "In a recent article in the Press (January 24) York Central MP Rachael Maskell described the <b>Labour</b> Party’s Future Energy Plan. It is claimed that a ‘green energy sprint’ will result in the UK, in 2030, being the first country to run on 100 per cent ..."
    },
    {
        "url": "https://www.coventryobserver.co.uk/news/coventry-news-bereaved-coventry-parents-raise-cash-for-vital-labour-room/",
        "title": "Bereaved Coventry parents raise cash for vital <b>Labour</b> room",
        "description": "Together with husband Jordan and other midwives and support workers, Emma raised £18,001 by climbing Snowdon and hosting a fundraising night."
    },
    {
        "url": "https://www.oxfordmail.co.uk/news/24083339.thames-valley-police-numbers-fall-recruitment-drive/",
        "title": "Thames Valley Police numbers fall after recruitment drive",
        "description": "Following a government campaign to secure 20,000 new police officers, officer numbers in the Thames Valley have fallen, according to Home"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/households-face-100-council-tax-31998231",
        "title": "Households face £100 council tax hikes in April in fresh cost of living misery",
        "description": "Local authority leaders in England are expected to make the maximum 4.99% hike to council tax in April, in a move that would slap around £100 on the average bills"
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, <b>Labour</b>’s silence over the cost of living crisis is deafening’",
        "description": "It comes following <b>Labour</b> leader, Sir Keir Starmer, confirming his party would not redistribute wealth from the richest to the poorest if they win the next general election, nor properly invest in renewable energy. BASC given permission to bring judicial ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/cycle-lane-hell-state-people-28534808",
        "title": "Cycle lane in &#39;hell of a state&#39; as people &#39;laugh&#39; about it",
        "description": "“That is in a hell of a state. It’s full of litter, it’s full of leaves, it’s not maintained even if cyclists wanted to cycle along there. The laugh of the populous is spot the cyclist, nobody uses it. Surely this money from the Liverpool City Region could be better invested to get people more active.”"
    },
    {
        "url": "https://www.thenational.scot/news/24083427.good-morning-britain-angela-rayner-panned-response-gaza/",
        "title": "Good Morning Britain: Angela Rayner panned for response to Gaza &#39;genocide&#39; question",
        "description": "The deputy leader of the <b>Labour</b> Party previously abstained when given the chance to vote on the SNP’s Gaza ceasefire motion in November last year. Despite <b>Labour</b> MPs being ordered to abstain on the amendment, 56 rebelled against Keir Starmer to vote in ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/aslef-rmt-london-overground-labour-mick-lynch-b2487135.html",
        "title": "New rail strike announced as walkout by drivers hits services",
        "description": "<b>Labour</b> has said it will repeal the law if it wins the next general election. Downing Street expressed disappointment at rail operators who are not using the legislation. The Prime Minister’s official spokesman said: “It’s something the rail operators ..."
    }
]