[
    {
        "url": "https://www.thisismoney.co.uk/money/comment/article-13041677/HAMISH-MCRAE-Time-fix-Gordon-Browns-pension-errors.html",
        "title": "HAMISH MCRAE: Time to fix Gordon Brown’s pension errors",
        "description": "Rachel Reeves, his shadow, has just launched <b>Labour</b>&#39;s plan for financial services, called Financing Growth. It is certainly a relief to have politicians that don&#39;t want to clobber the City. But the Conservative offer is pernickety. The Chancellor&#39;s ..."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/cost-of-living/hmrc-2000-warning-people-born-28566696",
        "title": "HMRC £2,000 warning for people born between these two dates",
        "description": "This week, HM Revenue and Customs issued an alert to explain how this could have come about. The government body said that anyone who was born between September 1, 2002, and January 2, 2011, could be in this situation as they were beneficiaries of the Child Trust Fund."
    },
    {
        "url": "https://www.thenational.scot/politics/24095461.ruth-wishart-covid-inquiry-missing-point---starmers-labour/",
        "title": "Ruth Wishart: Covid Inquiry is missing the point - as is Starmer&#39;s <b>Labour</b>",
        "description": "THINK back, if you can bear it. Think about the earliest days of the Covid crisis and that first lockdown in March 2020. Most of us were"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13041573/Indian-tyre-tycoon-says-idle-British-workers-just-want-pub.html?mrn_rm=rta",
        "title": "Indian tyre tycoon says idle British workers just want to go down the pub",
        "description": "Neeraj Kanwar is boss of Apollo Tyres, which has seven factories across the world - including a European base in Hungary - but none in the UK."
    },
    {
        "url": "https://www.thesun.co.uk/news/25702086/tony-parsons-labour-crime-sadiq-khan/",
        "title": "<b>Labour</b> will be even worse than the Tories at cracking down on crime – just look at clueless Sadiq Khan",
        "description": "WHEN a young mother, 31, and her daughters, aged eight and three, were taken to hospital after a chemical substance was thrown at them, the appalling attack was described on the BBC’s breaking"
    },
    {
        "url": "https://www.thesun.co.uk/news/25703756/rishi-sunak-paul-scully-mayor-london-race/",
        "title": "Fresh blow to Rishi Sunak as top Tory MP considers running AGAINST his own party in race to be Mayor of London",
        "description": "PM Rishi Sunak faces a fresh nightmare with one of his own MPs considering running against the Tories for London Mayor. Paul Scully is mulling over standing as an independent after being urged to"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/net-zero-committee-for-climate-change-labour-ian-cheshire/",
        "title": "<b>Labour</b> vetoes ex-Barclays chief for net zero job after diversity row",
        "description": "Party claims shortlist of six to be climate watchdog boss ‘lacks credibility’, meaning process could be re-run after general election"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/hope-fresh-cash-northern-airport-32040021",
        "title": "Hope of fresh cash for northern airport as Tory minister backs away from funding row",
        "description": "But in a letter seen by this newspaper, the top Tory did not rule out allowing the transfer of funds to go ahead. Local <b>Labour</b> leaders have been working to revive the scuppered Doncaster Sheffield Airport, providing transport in the north a much-needed ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041845/jeremy-corbyn-leads-protesters-london-ceasefire-gaza.html",
        "title": "Jeremy Corbyn leads protesters in London calling for a ceasefire in Gaza - with 20,000 joining march, despite organisers claiming &#39;hundreds of thousands&#39; would be demonstrating",
        "description": "Jeremy Corbyn (pictured) was seen at the front of the London protest surrounded by signs calling for peace before he made a speech imploring Rishi Sunak to call for a ceasefire."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/labour-ditches-radical-reforms-as-it-prepares-bombproof-election-manifesto",
        "title": "<b>Labour</b> ditches radical reforms as it prepares ‘bombproof’ election manifesto",
        "description": "Plans to reform social care and House of Lords are trimmed as Keir Starmer’s party opts for caution ahead of vote"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/03/glasgow-pothole-capital-of-britain-with-edinburgh-second/",
        "title": "SNP-controlled Glasgow is pothole capital of Britain with <b>Labour</b>-led Edinburgh second",
        "description": "Across Britain, the Scottish capital Glasgow - run by an SNP -led minority council - had more than 9,700 potholes reported by residents over the past 17 years, less than a third of which have been repaired. Edinburgh has had less than a quarter of the 5,538 reported potholes being filled in since 2007, the data shows."
    },
    {
        "url": "https://cherwell.org/2024/02/03/a-crash-course-in-british-politics-how-elections-work-week-1/",
        "title": "A crash course in British politics: How elections work (Week 1)",
        "description": "This week’s article will explain how British elections work, and hopefully will answer all your related questions."
    },
    {
        "url": "https://www.burnleyexpress.net/education/concern-about-class-sizes-over-30-in-lancashire-schools-amid-claim-of-ps28m-cut-in-spending-power-4504295",
        "title": "Concern about class sizes over 30 in Lancashire schools amid claim of &#39;£28m cut in spending power&#39;",
        "description": "Lancashire schools with more than 30 pupils in some of their classes will be unable to reduce the headcount to “acceptable” levels because of insufficient funding, a leading teaching union official has warned."
    },
    {
        "url": "https://www.varsity.co.uk/news/27010",
        "title": "Unite members picket University over pay dispute",
        "description": "Non-teaching staff across the University of Cambridge picketed outside Senate House yesterday (02/02), marking the last of three days of industrial action across the University. Striking workers were joined by multiple student societies as they called for pay negotiations to be re-opened."
    },
    {
        "url": "https://www.standard.co.uk/sport/rugby/england-player-ratings-vs-italy-ethan-roots-six-nations-b1136847.html",
        "title": "England player ratings vs Italy: Ethan Roots excels on debut but midfield trio <b>labour</b> in tight Six Nations win",
        "description": "Replacing Courtney Lawes is no easy task, but Steve Borthwick has a real gem in the New Zealand-born Exeter flanker"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/tens-thousands-street-lights-dimmed-28562055",
        "title": "Tens of thousands of street lights will be dimmed in one area of Greater Manchester to save money",
        "description": "Bolton Council is set to dim 37,000 of its 40,000 streetlights as part of cuts to balance its budget. The Labour run council’s financial plans for 2024/25 include a plan to ‘dim and trim’ the borough’s streetlights to save £450,000 a year."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "<b>Labour</b> Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68180505?at_link_origin=BBC_Politics&at_bbc_team=editorial&at_campaign_type=owned&at_ptr_name=facebook_page&at_campaign=Social_Flow&at_link_type=web_link&at_medium=social&at_link_id=717FB3F4-C27C-11EE-83C0-FA01AAF30DC0&at_format=link",
        "title": "Stormont: Michelle O&#39;Neill makes history as nationalist first minister",
        "description": "Sinn Féin&#39;s Michelle O&#39;Neill has made history after she was appointed Northern Ireland&#39;s first nationalist first minister. The DUP&#39;s Emma Little-Pengelly has been appointed deputy first minister. The return of power-sharing follows the Democratic Unionist Party (DUP) ending its boycott over post-Brexit trade rules."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-should-learn-labour-32038747",
        "title": "Rishi Sunak &#39;should learn from <b>Labour</b>&#39; and stamp out Liz Truss&#39; party within a party",
        "description": "Ms Truss, who was the least popular British Prime Minister since records began, will launch a group named “Popular Conservatism” this week"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/home-news/online-safety-bill-sex-workers-safety-b2489033.html",
        "title": "Sex workers could be pushed into illegal brothels and dangerous street work due to new laws, MPs warn",
        "description": "Exclusive: Sex worker says online safety bill has pushed her into working in a brothel where a pimp takes half her money, she has no rights and cannot check clients online to ensure they are safe"
    },
    {
        "url": "https://www.thenational.scot/politics/24095461.covid-inquiry-missing-point---starmers-labour/",
        "title": "The Covid Inquiry is missing the point - as is Starmer&#39;s <b>Labour</b>",
        "description": "THINK back, if you can bear it. Think about the earliest days of the Covid crisis and that first lockdown in March 2020. Most of us were"
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/stones-scoop-anas-sarwar-shares-his-secret-space-at-holy-340328/",
        "title": "<b>Labour</b> leader Anas Sarwar has a secret space at Holyrood, he tells Jamie Stone",
        "description": "Far north MP Jamie Stone speaks to the Scottish Labour leader Anas Sarwar about Holyrood and Westminster, his inspirations and how he blows off steam"
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1862786/kate-garraway-derek-draper-funeral-video-dancing",
        "title": "Kate Garraway dances with late husband Derek Draper in emotional clip shared after funeral",
        "description": "Sir Keir Starmer and former <b>Labour</b> leader Ed Miliband were also in attendance. Others included Good Morning Britain presenter Susanna Reid and Capital FM host Roman Kemp. Kate was supported by ITV colleagues past and present, including Piers Morgan ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68192206.amp",
        "title": "Laura Kuenssberg: When will politicians make their minds up on key plans?",
        "description": "No wonder voters are unconvinced when politicians may seem unclear on economic plans, writes Laura Kuenssberg."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68180505.amp",
        "title": "Michelle O&#39;Neill appointed Northern Ireland&#39;s first nationalist first minister",
        "description": "Sinn Féin&#39;s Michelle O&#39;Neill makes history after she is appointed Northern Ireland&#39;s first nationalist first minister."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13041451/vape-shop-blames-vandals-sign-sell-kids.html",
        "title": "Vape shop blames vandals for sign outside saying &#39;we sell to kids - no ID? No problem!&#39;",
        "description": "Techxvape on Carolgate in Retford, Nottinghamshire has criticised the &#39;stupid&#39; sign after a photograph was shared on social media by a local."
    },
    {
        "url": "https://www.yourthurrock.com/2024/02/03/labour-vows-to-close-severance-loophole-exploited-by-thurrock-mp/",
        "title": "<b>Labour</b> vows to close severance “loophole” exploited by Thurrock MP",
        "description": "THE <b>Labour</b> Party has pledged to reform the rules on taxpayer-funded severance payments handed out to government ministers when they leave their jobs. Under the current rules, Jackie Doyle-Price, the MP for Thurrock since 2010, was able to claim a £7,920 ..."
    },
    {
        "url": "https://www.scmp.com/news/china/article/3250797/why-china-hopes-us-wont-touch-century-old-trade-rule-affecting-imports-under-us800",
        "title": "Why China hopes the US won’t touch a century-old trade rule affecting imports under US$800",
        "description": "E-commerce giants Shein and Temu flourish as parcels surpass quarter of a trillion dollars in value annually amid push to tighten de minimis provision."
    },
    {
        "url": "https://finance.yahoo.com/news/ontario-workers-rally-against-ford-214700013.html",
        "title": "Ontario workers rally against Ford’s corruption, closures and cost-of-living crisis",
        "description": "NIAGARA FALLS, Ontario, Feb. 03, 2024 (GLOBE NEWSWIRE) -- Hundreds of trade union and community members, including health care and education workers, joined a rally organized by the Ontario Federation of <b>Labour</b> (OFL) during the Ontario PC Party’s 2024 ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/anyone-but-peter-bone-voters-turn-to-labour-and-reform-uk-as-wellingborough-byelection-nears",
        "title": "‘Anyone but Peter Bone’: voters turn to <b>Labour</b> and Reform UK as Wellingborough byelection nears",
        "description": "While Labour is favourite to snatch the Northamptonshire seat from the Tories, Sunak’s party faces a battle even to take second place, if local opinion is anything to go by"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13041009/DAN-HODGES-Gaza-shadow-George-Galloway-prompt-Rishi-snap-election.html",
        "title": "DAN HODGES: Could Gaza and the shadow of George Galloway prompt Rishi into a snap election?",
        "description": "The Tory MP leapt up and did a jig of joy around the House of Commons Strangers&#39; Bar. &#39;Really? That&#39;s been confirmed?&#39; he asked. &#39;Is George Galloway standing in Rochdale?&#39;"
    },
    {
        "url": "https://news.sky.com/video/nr-rayner-rigby-full-iv-mp4-13063146",
        "title": "<b>Labour</b>&#39;s deputy leader Angela Rayner outlines party&#39;s &#39;new deal for workers&#39;",
        "description": "Ms Rayner says that the Labour Party wants to remove &#39;bogus self-employment&#39; within 100 days of being elected, but without damaging the economy or business."
    },
    {
        "url": "https://stroudtimes.com/relief-for-young-peoples-mental-health/",
        "title": "Relief for young people’s mental health",
        "description": "Dr Simon Opher, Dursley GP and Labour Party Parliamentary candidate has announced a dramatic shift in the availability of mental health counselling and mentoring for young people in the Stroud area."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1862651/tony-blair-vandalism-british-constitution-comment",
        "title": "We need a new revolution to undo Tony Blair&#39;s vandalism of UK traditions, says Daniel Pitt",
        "description": "The lingering presents of New <b>Labour</b> are still with us. The constitutional vandalism of Tony Blair’s legal, judicial and administrative revolution has to be tackled head on. If the problems of illegal migration and the woke culture running through our ..."
    },
    {
        "url": "https://leftfootforward.org/2024/02/how-the-uk-profits-from-war/",
        "title": "How the UK profits from war",
        "description": "As allies look sorrowfully on at our underfunded and shrinking armed forces, Britain’s arms trade is making a killing, with billions of pounds of taxpayers’ money being handed to arms manufacturers that give investors rich returns."
    },
    {
        "url": "https://leftfootforward.org/2024/02/labour-to-back-bankers-bonuses-how-the-political-left-responded/",
        "title": "<b>Labour</b> to back bankers’ bonuses: How the Left responded",
        "description": "Labour will not reinstate a cap on bankers’ bonuses if it wins the next general election, the shadow chancellor announced this week. Saying she wanted to be the ‘champion of a thriving financial services industry,’ Rachel Reeves said she had ‘no intention’ of re-establishing the cap."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/which-tories-will-lose-seats-mp-next-election-2024-uk-rees-mogg-368098/",
        "title": "Three top Tories set to lose seats as MPs to <b>Labour</b> – including Jacob Rees-Mogg",
        "description": "A number of well-known Tories are being confronted by a stark reality - and the likes of Jacob Rees-Mogg face a daunting prospect."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-angela-rayner-labour-most-124348592.html",
        "title": "Voices: Angela Rayner will be <b>Labour</b>’s most powerful minister in government – Keir Starmer should watch out",
        "description": "COMMENT: The deputy Labour leader and champion of workers’ rights may be an unexpected titan in office, writes"
    },
    {
        "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/north-staffordshire-council-orders-ban-9067786",
        "title": "North Staffordshire council orders ban on giving animals as prizes",
        "description": "Giving pets as prizes has been banned by a North Staffordshire council. From now on giving pets as prizes will be banned in Newcastle-under-Lyme on council owned land."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/devastating-reason-kate-garraway-wore-32037714",
        "title": "Devastating reason Kate Garraway wore husband Derek Draper&#39;s watch to his funeral",
        "description": "The presenter was with her children Darcey and Bobby as the family said their final goodbye&#39;s to a loving husband and father."
    },
    {
        "url": "https://alittlebitofstone.com/2024/02/03/action-on-sewage-dumped-at-stone-sports-facility/",
        "title": "Action on sewage dumped at Stone sports facility",
        "description": "Stone Labour Party and Councillor Jill Hood have joined forces to demand that Severn Trent stop dumping raw sewage straight into a major River Trent sports facility."
    },
    {
        "url": "https://www.edp24.co.uk/news/24087073.cashless-society-drive-damaging-rural-norfolk/",
        "title": "Cashless society drive &#39;damaging for rural Norfolk&#39;",
        "description": "The declining use of cash and closure of banks in Norfolk towns, is spelling trouble for businesses, charities and vulnerable people,"
    },
    {
        "url": "https://www.wrexham.com/columns/a-view-from-carolyn-thomas-welsh-labours-north-wales-member-of-the-senedd-8-246621.html",
        "title": "A view from Carolyn Thomas – Welsh <b>Labour</b>’s North Wales Member of the Senedd",
        "description": "Wrexham.com has invited the four North Wales Members of the Senedd to write a monthly column with updates on their work. You can find their updates – along with contributions from the Wrexham and Clwyd South MPs and MSs – here."
    },
    {
        "url": "https://www.libdemvoice.org/listen-christine-jardine-on-any-questions-3-74609.html",
        "title": "LISTEN: Christine Jardine on Any Questions",
        "description": "Christine Jardine was on Any Questions last night along with Ann Widdecombe (representing the Reform Party), Thangam Debonnaire and Sir Robert Buckland. She travelled to Bridgwater in Somerset. The first question was on whether we should have closer relations with the EU,"
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-03/welsh-labour-leadership-election-difference-without-division",
        "title": "Welsh <b>Labour</b> leadership election: Difference without division?",
        "description": "Labour’s leadership election rules have changed a lot from the days when trades unions welded block votes - when Unite backed Vaughan Gething last week it was welcome support for his campaign, but individual members can vote for whomever they choose."
    },
    {
        "url": "https://www.heraldscotland.com/politics/24082958.glasgow-made-history-hosting-scottish-parliament/",
        "title": "When Glasgow made history by hosting the Scottish Parliament",
        "description": "Twenty-four years ago the Scottish Parliament abandoned Edinburgh for Glasgow for a few weeks. &quot;We are creating history&quot;, said"
    },
    {
        "url": "https://www.shropshirestar.com/entertainment/food-and-drink/2024/02/03/chairman-of-food-giant-with-shropshire-beginnings-says-labour-can-get-the-county-out-of-the-cost-of-living-crisis/",
        "title": "Mums go to Iceland - but the executive chairman of the company, which began in Shropshire, has gone to <b>Labour</b>.",
        "description": "Mums go to Iceland - but the executive chairman of the company, which began in Shropshire, has gone to Labour."
    },
    {
        "url": "https://dailybusinessgroup.co.uk/2024/02/rayner-denies-confusion-over-labours-green-pledge/",
        "title": "Rayner denies confusion over <b>Labour</b>’s green pledge",
        "description": "Angela Rayner, Labour’s deputy leader, raised further questions about her party’s pledge to invest £28 billion in green energy when she said it could not be bound by an “arbitrary number”."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/people/abandoned-by-the-conservatives-insiders-say-wellingborough-tory-by-election-campaign-is-struggling-to-attract-top-level-support-4503940",
        "title": "‘Abandoned by the Conservatives’ - insiders say Wellingborough Tory by-election campaign is struggling to attract top-level support",
        "description": "The Times asked ‘Where’s Helen’ in an eviscerating sketch after they visited Wellingborough. And the final insult was an astonishing piece written by Conservative Home, a website set up in support of the Tory party which offers news, analysis and comment on internal goings-on."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/tata-steel-begins-formal-45-090216869.html",
        "title": "Tata Steel begins formal 45-day consultation over plans for Port Talbot plant",
        "description": "Tata Steel has started a formal 45-day consultation on its restructuring which is set to lead to thousands of job losses. The company is planning to shut down blast furnaces at its plant in Port Talbot, south Wales, and switch to a more environmentally friendly way of producing steel."
    },
    {
        "url": "https://inews.co.uk/news/civil-service-richard-tice-reform-2886189",
        "title": "‘No-one, especially the Tories, is laughing at us now,’ says Reform leader",
        "description": "In an interview with i, the Reform Party leader says his &#39;medium-term&#39; plan to take the Tories&#39; place as the threat from the right to Labour"
    },
    {
        "url": "https://uk.news.yahoo.com/bomb-explodes-outside-ministry-athens-071608177.html",
        "title": "Bomb explodes outside ministry in Athens, no injuries",
        "description": "An explosive device went off outside Greece&#39;s labour ministry in central Athens early on Saturday but caused no injuries, Greek police said. A Greek newspaper received a phone call by an unknown caller that a bomb had been planted at the ministry and had informed the police who cordoned off the area before the explosion which caused damage to the building and broken windows,"
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/hartlepool-council-scraps-plans-reduce-28557826",
        "title": "Hartlepool Council scraps plans to reduce CCTV coverage after new funding found",
        "description": "Hartlepool Council planned to reduce the hours CCTV coverage would be monitored but now this has been scrapped due to new funding."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-outdoor-childrens-play-park-28556749",
        "title": "New outdoor children&#39;s play park at Sunderland seafront could get the go ahead next week",
        "description": "Plans for a new children’s play area include a bridge, public walkways, landscaping and several “discrete play areas"
    },
    {
        "url": "https://www.wrexham.com/news/wrexham-council-to-ring-fence-any-future-funding-for-social-care-246628.html",
        "title": "Wrexham Council to ring-fence any future funding for social care",
        "description": "Wrexham Council has confirmed any money it receives as a result of extra funding announced for councils in England will be ringfenced specifically for social care. ‌﻿​﻿‌﻿‌﻿​﻿​﻿​﻿‌﻿‍﻿‌﻿​﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿​﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿​ In January,"
    },
    {
        "url": "https://www.independent.co.uk/travel/news-and-advice/february-march-train-strikes-2024-b2489898.html",
        "title": "February and March train strike dates: Everything you need to know about rail disruption",
        "description": "Thousands of rail services are being cancelled on each day of industrial action by train drivers – how will it affect you?"
    },
    {
        "url": "https://www.politicshome.com/news/article/labours-slow-twenty-eight-billion-green-spending-u-turn",
        "title": "<b>Labour</b> Is Making Its &quot;Slowest U-Turn&quot; On £28bn Green Spending",
        "description": "Labour insiders say the party has made a rod for its own back over the £28bn green spending pledge as a long internal debate over whether Keir"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862609/Beachcomber-factions-banking-byelections-drinking",
        "title": "MPs talk NONCesense, <b>Labour</b>&#39;s latest luvvie, Suella&#39;s leadership plug",
        "description": "It turns out that 81 percent of Kingswood voters saw through Egan&#39;s fake accent and voted &quot;Lewisham Luvvie”. A fundraiser invitation for Tory London Assembly member Keith Prince is doing the rounds on WhatsApp, boasting a couple of star appearances from both Suella Braverman and candidate Susan Hall."
    },
    {
        "url": "https://inews.co.uk/news/politics/ed-miliband-labour-green-growth-2887660?ico=related_article_inline",
        "title": "‘Miliband still wants the £28bn’: Inside <b>Labour</b>’s green growth plan split",
        "description": "Suited up and with smiles plastered on their faces, the leading lights of what could be the next government were out in force at <b>Labour</b>’s business conference at the Oval cricket ground in south London this week. Shadow Chancellor Rachel Reeves led the ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/ive-taken-out-restraining-orders-28554212",
        "title": "&#39;I&#39;ve taken out restraining orders against three men... the misogyny is so bad&#39;",
        "description": "<b>Labour</b> Coun Jo Harding, the town hall&#39;s executive member for finance, change and governance, made the shocking revelation as councillors discussed a ‘Debate Not Hate’ campaign launched by the Local Government Association (LGA). Another councillor ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12504544.property-tax-proposal-consideration-scotland/",
        "title": "Property tax proposal under consideration in Scotland",
        "description": "But it is now being considered by <b>Labour</b> after the party initially dismissed the suggestion. The committee suggested a local property tax, set locally, and which would be refined through regular revaluation. Sir Peter&#39;s report said the tax would on average ..."
    }
]