[
    {
        "url": "https://www.oxfordmail.co.uk/news/national/24135845.sunak-touts-gigabit-broadband-rollout-levelling-tour-north-wales/",
        "title": "Sunak touts gigabit broadband rollout on ‘levelling up tour’ of North Wales",
        "description": "As he gears up for the general election and his party languishes in the polls, Mr Sunak frequently attacks the performance of what he calls “<b>Labour</b>-run Wales”. On Wednesday, he warned that the Welsh Government’s new farm subsidy scheme would ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-speaker-gaza-mps-labour-b2500329.html",
        "title": "Commons Speaker under pressure after Gaza vote chaos",
        "description": "The motion was approved but only after Sir Lindsay Hoyle upended parliamentary convention by selecting <b>Labour</b>’s bid to amend an SNP motion on the Israel-Hamas war. His decision sparked fury from the Conservative and SNP benches, who accused him of ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/lindsay-hoyle-fighting-for-survival-after-controversial-ruling-sparks-snp-fury_uk_65d64cf8e4b0cc1f2f7a7b6d/",
        "title": "Lindsay Hoyle Fighting For Survival After Controversial Ruling Sparks SNP Fury",
        "description": "Hoyle sparked fury when he ignored convention, and the advice of his officials, by selecting a <b>Labour</b> amendment to an SNP opposition day motion calling for an “immediate ceasefire” in Gaza. Amid remarkable scenes, Commons leader Penny Mordaunt ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68342446.amp",
        "title": "<b>Labour</b>&#39;s Damien Egan says West Country accent helped Kingswood win",
        "description": "He has now been sworn in, alongside <b>Labour</b>&#39;s other by-election victor, Gen Kitchen from Wellingborough. Born in Ireland, Damien Egan came to the West of England as a youngster, and his family still live in the area. He was briefly a parish councillor ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/uk-quits-outdated-treaty-that-could-penalise-shift-to-net-zero-b1140739.html",
        "title": "UK quits ‘outdated’ treaty that could penalise shift to net zero",
        "description": "<b>Labour</b> has long argued that the Energy Charter Treaty is clearly outdated and not fit for purpose Kerry McCarthy, <b>Labour</b> The Department for Energy Security and Net Zero said efforts to modernise the treaty to better support cleaner technologies had led to ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/north-wales-prime-minister-government-mark-drakeford-anglesey-b1140746.html",
        "title": "Sunak touts gigabit broadband rollout on ‘levelling up tour’ of North Wales",
        "description": "As he gears up for the general election and his party languishes in the polls, Mr Sunak frequently attacks the performance of what he calls “<b>Labour</b>-run Wales”. On Wednesday, he warned that the Welsh Government’s new farm subsidy scheme would ..."
    },
    {
        "url": "https://www.landlordtoday.co.uk/breaking-news/2024/2/generation-rent-wants-rent-controls-to-be-election-issue",
        "title": "Generation Rent wants rent controls to be election issue",
        "description": "Twomey - a former <b>Labour</b> candidate in a local police commissioner election - has in the past backed <b>Labour</b> London Mayor Sadiq Khan’s bid to win powers to control the private rental sector. Now he wants all candidates in May’s elections to back the idea."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110543/JOHN-MACLEOD-Camerons-return-like-Bobby-stepping-Dallas-shower-Tories-worse-bad-dream.html",
        "title": "JOHN MACLEOD: Cameron&#39;s return was like Bobby stepping out of the Dallas shower. But for the Tories, this is worse than a bad dream",
        "description": "In the end, in 1997, there was a New <b>Labour</b> landslide, the Conservatives were reduced to 165 seats, and spent the next 13 years in opposition, howling at the moon. Another rout – probably this autumn – seems now assuredly on the cards. And if Nigel ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68365928",
        "title": "Situation with farmers incredibly tense - Jeremy Miles",
        "description": "Farmers have been protesting over proposed changes to farm payments. A Welsh <b>Labour</b> leadership candidate has admitted the situation with protesting farmers is &quot;incredibly tense&quot;. Mr Miles made the comment at a live TV debate where both he and his rival ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/snp-motion-in-commons-was-a-denial-of-hamas-attack-on-israel-says-dups-ian-paisley-as-idf-operations-in-gaza-continue-4528468",
        "title": "SNP motion in Commons was a &#39;denial&#39; of Hamas attack on Israel, says DUP&#39;s Ian Paisley as IDF operations in Gaza continue",
        "description": "The debate later descended into chaos, after Speaker Sir Lindsay Hoyle was accused of allowing it to be “hijacked” by <b>Labour</b>. The SNP&#39;s motion was originally meant to be the focus of the day but a <b>Labour</b> amendment went through to loud shouts of “aye ..."
    },
    {
        "url": "https://news.sky.com/story/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm-13077878",
        "title": "What happened in the Commons today - and can the Speaker be sacked?",
        "description": "Despite anger from his clerk, and feathers being spat by a number of MPs, Sir Lindsay decided both the government and Labour&#39;s amendments to the SNP&#39;s motion could and would be voted on, claiming he wanted to give the House as many options as possible when debating such an emotive topic."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68364722?at_medium=social&at_format=link&at_link_id=7F1A9A4A-D0F2-11EE-A5E3-3646AAF30DC0&at_bbc_team=editorial&at_link_origin=WalesPolitics&at_campaign=Social_Flow&at_link_type=web_link&at_ptr_name=twitter&at_campaign_type=owned",
        "title": "Vaughan Gething accepts £200k from environmental offender&#39;s company",
        "description": "Welsh Labour leadership candidate Vaughan Gething accepted £200,000 for his campaign from a company run by a man who was convicted twice for environmental offences, it has emerged. David Neal was given a suspended prison sentence in 2013 for illegally dumping waste on a conservation site."
    },
    {
        "url": "https://www.bbc.com/news/topics/c2rndy225e9t?page=7",
        "title": "Lindsay Hoyle",
        "description": "Speaker Sir Lindsay Hoyle apologises after being accused of allowing the debate to be &quot;hijacked&quot; by <b>Labour</b>. The decision is likely to limit any potential <b>Labour</b> rebellion over its stance on the Middle East. Conservative and SNP MPs show their anger with ..."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/21/greens-urge-labour-to-switch-weedkiller-funding-to-community-services/",
        "title": "Greens urge <b>Labour</b> to switch weedkiller funding to community services",
        "description": "Green councillors want to use money that has been set aside to bring back weedkiller to help fund public services"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110961/keir-starmer-pledges-curb-number-people-benefits.html",
        "title": "Keir Starmer pledges to curb the number of people &#39;languishing&#39; on benefits and make work pay",
        "description": "In a toughly worded intervention, the <b>Labour</b> leader will warn that the soaring number of people on sickness benefits is &#39;choking off growth&#39;. Under new proposals, a <b>Labour</b> government would reform incapacity benefits to &#39;encourage&#39; hundreds of thousands of ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm/",
        "title": "Why was the Commons in chaos - and will the Speaker survive the storm?",
        "description": "This has been a long-held position of the SNP, so the proposal came as no surprise. But it did lead to mounting pressure on the <b>Labour</b> Party to shift its position - which had, until this point, echoed the government&#39;s calls for a &quot;pause&quot; - as the last time ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/happened-house-commons-gaza-ceasefire-vote-chaos-explained-20323752/?ico=trending-module_category_uk_item-6",
        "title": "What happened with UK Gaza ceasefire vote as Lindsay Hoyle’s future is questioned",
        "description": "The vote, which didn’t see individual MP’s votes recorded, came after a day of political wrangling between <b>Labour</b> and the SNP. Speaker of the House, Sir Lindsay Hoyle, was forced to return and apologise for selecting amendments by both <b>Labour</b> and the ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-parliament-plunged-chaos-over-234329678.html",
        "title": "UK parliament plunged into chaos over Gaza ceasefire vote",
        "description": "The uproar followed a decision by the speaker to ignore precedent and allow a vote which helped the opposition <b>Labour</b> Party avoid a large-scale rebellion among its own lawmakers over its position on the Israel-Hamas war. Lawmakers from the governing ..."
    },
    {
        "url": "https://www.heraldscotland.com/sport/24135435.new-dad-steyn-keen-keep-calcutta-cup-scotlands-hands/",
        "title": "New dad Steyn keen to keep Calcutta Cup in Scotland’s hands",
        "description": "The Glasgow wing was named in the starting XV for the Murrayfield showdown with Les Bleus a week past Saturday, but he had to withdraw on the morning of the game after his wife Ally went into <b>labour</b> late on the Friday afternoon. Steyn’s daughter ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?filterKeyEvents=false&page=with:block-65d67f218f088e120023e7b8",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – UK politics live",
        "description": "<b>Labour</b> amendment calling for immediate Gaza ceasefire passes after government and SNP walkout Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages and respond to some in this live ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/labours-uneasy-victory-over-gaza",
        "title": "When the lights went out",
        "description": "Keir Starmer began the day on course for political defeat. By the end, parliament had adopted <b>Labour</b>’s position on the war in Gaza as its own. At the centre of events was the House of Commons Speaker Lindsay Hoyle. His decision to allow a vote on <b>Labour</b> ..."
    },
    {
        "url": "https://www.thenational.scot/news/24135758.police-respond-claim-labour-glasgow-office-stormed/",
        "title": "Police respond to claim that <b>Labour</b> Glasgow office was &#39;stormed&#39;",
        "description": "POLICE Scotland have rejected Paul Sweeney&#39;s claim that the Glasgow constituency office of <b>Labour</b> MSPs was &quot;stormed&quot; by Gaza protesters, with the politician hitting back that it took officers 27 minutes to respond as staff were left &quot;distressed&quot;."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/speaker-gaza-commons-lyndsay-hoyle-votes-b2500211.html",
        "title": "Commons Speaker Sir Lindsay Hoyle facing calls to resign after Gaza debate descends into chaos",
        "description": "A total of 33 MPs have signed a motion of no confidence in the speaker after his actions, accused of favouring <b>Labour</b>, prompted anger. Sir Lindsay had deviated from long-standing procedures to allow a <b>Labour</b> amendment to the SNP motion on a ceasefire to be ..."
    },
    {
        "url": "https://www.jamaicaobserver.com/2024/02/21/charles-jr-advances-discussions-world-bank-additional-social-protections/",
        "title": "Charles Jr advances discussions with World Bank on additional social protections",
        "description": "Minister of <b>Labour</b> and Social Security (MLSS) Pearnel Charles Jr, while greeting the Human Development Programme Leader for Latin America and the Caribbean at the World Bank Emre Özaltın, during a courtesy call on Wednesday, used the opportunity to ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/dental-health-crisis-scots-practices-32110869?int_source=nba",
        "title": "Dental health crisis as Scots practices abandon NHS for private patients",
        "description": "Previously, we reported how practices in Dumfriesshire and Edinburgh deregistered 20,000 and 10,000 patients respectively. <b>Labour</b>&#39;s health spokeswoman Jackie Baillie has warned unless the Scottish Government acts quickly, thousands more Scots could be left ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/scottish-labour-rift-merged-rutherglen-32179243.amp",
        "title": "Scottish <b>Labour</b> rift as merged Rutherglen CLP women&#39;s rights motion rejected at conference",
        "description": "Amy Lee Fraioli of the Rutherglen CLP urged &quot;men to act&quot; to &quot;confront the harsh realities that persist in our society&quot;. Scottish <b>Labour</b> faced division as a merged Rutherglen CLP motion on women&#39;s sex-based rights was rejected at its party conference."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/21/wednesday-evening-news-briefing-tory-mp-no-confidence-gaza/?n=@",
        "title": "Wednesday evening news briefing: Tory MP tables motion of no confidence in Hoyle over handling of Gaza debate",
        "description": "The Commons Speaker took the highly unusual step of selecting both a <b>Labour</b> amendment and a Government amendment to an SNP motion calling for an immediate ceasefire in Gaza. The decision to select the <b>Labour</b> amendment was greeted in the Commons by Tory ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-hamas-house-of-commons-b1140715.html",
        "title": "<b>Labour</b> amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "<b>Labour</b>’s amendment calling for an immediate humanitarian ceasefire in Gaza has been approved in the House of Commons amid chaotic scenes. SNP MPs and some Conservatives walked out of the chamber in protest at Speaker Sir Lindsay Hoyle’s handling of the ..."
    }
]