[
    {
        "url": "https://www.ibtimes.co.uk/labour-proposes-extension-equal-pay-rights-black-asian-minority-staff-1723273",
        "title": "<b>Labour</b> Proposes Extension of Equal Pay Rights to Black, Asian and Minority Staff",
        "description": "For the first time, under progressivist plans for a draft race equality act, the <b>Labour</b> Party has unveiled plans to extend equal pay rights to black, Asian, and minority ethnic (BAME) staff across the United Kingdom. The proposal aims to tackle the ..."
    },
    {
        "url": "https://inews.co.uk/news/labour-drop-green-28bn-pledge-starmer-2895718?ico=related_article_inline",
        "title": "<b>Labour</b> to confirm dropping £28bn a year green investment pledge",
        "description": "Labour will confirm it is dropping a pledge to spend £28bn a year on green investment if it enters government, following weeks of confusion about the flagship policy. Sir Keir Starmer had originally promised in 2021 to invest £28bn annually until 2030 on green projects if Labour came to power."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rachel-reeves-keir-starmer-laura-trott-gdp-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "<b>Labour</b> will reportedly abandon its policy of spending £28 billion a year on environmental projects in a major U-turn following months of uncertainty about the pledge. An announcement on the party’s flagship green prosperity plan is expected to be made ..."
    },
    {
        "url": "https://news.sky.com/story/labour-to-scale-back-28bn-green-prosperity-plan-sky-news-understands-13066410",
        "title": "<b>Labour</b> to ditch £28bn green prosperity plan, Sky News understands",
        "description": "<b>Labour</b> will announce tomorrow that it is scaling back its flagship green prosperity plan, Sky News understands. The policy will not be dropped altogether, but the party is ditching the financial target to spend £28bn a year on environmental schemes."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-prime-minister-labour-rishi-sunak-laura-trott-b1137785.html",
        "title": "Brianna Ghey’s father demands apology from Sunak over transgender jibe",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender joke in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.mirror.co.uk/news/us-news/medical-report-lays-bare-horror-32073078",
        "title": "Medical report lays bare horror injuries of baby &#39;decapitated by doctor&#39; during <b>labour</b>",
        "description": "The distraught parents have launched a lawsuit against the doctors involved and the Southern Regional Medical Center, a hospital in Riverdale, Georgia, where the tragic delivery occured and their son"
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13058419/EDEN-CONFIDENTIAL-Earl-gives-daughter-Lady-Venetia-Baring-telling-dig-Princess-Diana.html",
        "title": "EDEN CONFIDENTIAL: Earl gives his daughter the Tatler &#39;It girl&#39; Lady Venetia Baring a telling off for dig at Princess Diana",
        "description": "The blaze of attention for Lady Venetia Baring, 25, has come at a fearful cost - earning her a ferocious dressing-down from her father, Evelyn, 4th Earl of Cromer."
    },
    {
        "url": "https://www.thesun.ie/news/12158489/richard-bruton-tears-emotional-dail-tribute-brother-taoiseach-john/",
        "title": "Richard Bruton receives standing ovation as he fights tears in emotional Dail tribute to brother &amp; ex-Taoiseach John",
        "description": "DEPUTY Richard Bruton received a standing ovation in the Dail after paying an emotional tribute to his late brother John. The Fine Gael TD fought back tears as he hailed his sibling, former"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68232133",
        "title": "<b>Labour</b> ditches £28bn green investment pledge",
        "description": "Labour is ditching its policy of spending £28bn a year on its green investment plan in a major U-turn, sources have told the BBC. An official announcement will be made on Thursday. The sources insist the party&#39;s Green Prosperity Plan, which includes creating a publicly-owned green power firm, is not being dropped altogether."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/brianna-gheys-father-demands-apology-28589994",
        "title": "Brianna Ghey’s father demands apology from Rishi Sunak over &#39;dehumanising&#39; transgender remark",
        "description": "The father of murdered teenager Brianna Ghey has demanded an apology from Rishi Sunak after he made a “dehumanising” transgender remark in the Commons while the victim’s mother visited Parliament."
    },
    {
        "url": "https://www.ft.com/content/abb231af-bb95-4264-9209-3864fac0e464",
        "title": "<b>Labour</b> set to ditch target to spend £28bn a year on green investment",
        "description": "Starmer is poised to use a set piece event to drop the £28bn figure from Labour’s “green prosperity plan”, blaming the worsening public finances under the Conservative government. “There will be an announcement tomorrow,” said a Labour spokesperson."
    },
    {
        "url": "https://www.thesun.co.uk/news/25793766/electric-vehicles-truth-tackle-climate-change/",
        "title": "Green tech like EVs turns out to be a very uncunning plan… we need the truth to tackle climate change",
        "description": "SALES of electric cars are falling sharply. Monthly forecourt purchases of these vehicles, which will save the world from burning to bits, fell 17 per cent at the end of last year when compared"
    },
    {
        "url": "https://www.channel4.com/news/tories-rather-presumptively-promising-dental-changes-after-election-says-labour",
        "title": "Tories ‘rather presumptively’ promising dental changes after election says <b>Labour</b>",
        "description": "We spoke to the Shadow Health Secretary Wes Streeting, and began by asking who will deliver more NHS appointments – the Conservatives or Labour?"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24104468.darlington-council-responds-government-funding-settlement/",
        "title": "Darlington Council responds to government funding settlement",
        "description": "Until we get the funding that we deserve, life in Darlington will be harder than it should be.” The alarming statement came as <b>Labour</b> and Conservative members clashed over the management of the council’s finances over recent years. Since taking office ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uks-sunak-criticised-over-trans-195454796.html",
        "title": "UK&#39;s Sunak criticised over trans jibe",
        "description": "Opposition politicians demanded UK Conservative Prime Minister Rishi Sunak apologise Wednesday for making a jibe about transgender people in parliament.A spokeswoman for Sunak declined to apologise when pressed by reporters after,"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-open-minded-social-media-ban-under-16s-2895453?ITO=msn",
        "title": "<b>Labour</b> ‘open-minded’ to social media ban for under-16s",
        "description": "Labour has said it is “open-minded” about banning social media for under-16s following calls for a change in the laws from the mother of murdered teenager Brianna Ghey."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864329/Keir-Starmer-green-investment-plan-scrapped",
        "title": "Sir Keir Starmer expected to confirm scaling back of £28bn green pledge",
        "description": "Sir Keir Starmer is set to confirm on Thursday that Labour is scaling back a £28 billion green investment pledge following weeks of uncertainty. The Labour leader will announce the latest u-turn despite insisting for weeks that he intended to meet the commitment."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/labour-weaponised-brianna-ghey-murder-says-kemi-badenoch/",
        "title": "<b>Labour</b> weaponised Brianna Ghey murder, says Kemi Badenoch",
        "description": "Rishi Sunak criticised for saying Keir Starmer has difficulty ‘defining a woman’ while the trans teenager’s mother attended PMQs"
    },
    {
        "url": "https://www.thetimes.co.uk/article/cbis-call-to-labour-over-workers-rights-falls-on-deaf-ears-jf5mnl9rg",
        "title": "CBI’s call to <b>Labour</b> over workers’ rights falls on deaf ears",
        "description": "MPs and unions hit back after business lobby group warns of potential damage to productivity from employment plans"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/24105179.echo-comment-rishi-sunaks-transgender-joke-pmqs/",
        "title": "Echo Comment on Rishi Sunak&#39;s transgender &quot;joke&quot; at PMQs",
        "description": "IT has been a bad week for Rishi Sunak. One day, he is goaded into making an intemperate bet by Piers Morgan, and the next he is criticised for"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/labour-flagship-insulation-policy-cost-13bn-a-year/",
        "title": "<b>Labour</b>’s insulation policy will cost up to £13bn a year, Treasury claims",
        "description": "Party says its green measures would cost Exchequer a maximum of £6 billion a year, but Government’s analysis says it would be double that"
    },
    {
        "url": "https://www.itv.com/watch/news/rishi-sunak-under-fire-after-trans-jibe-while-brianna-gheys-mother-in-parliament/63m2m37",
        "title": "Rishi Sunak under fire after trans jibe while Brianna Ghey&#39;s mother in Parliament",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.itv.com/news/2024-02-07/hunt-admits-treasurys-costing-of-labour-energy-efficiency-plans-may-be-wrong",
        "title": "Chancellor admits Treasury&#39;s costing of <b>Labour</b>&#39;s energy efficiency plans may not be correct",
        "description": "Peston challenged the assumptions that Treasury officials were given by the chancellor’s aides when making the calculations, in particular that a Labour government would not means-test any grants given to homeowners or share the costs with energy companies."
    },
    {
        "url": "https://www.thenational.scot/news/24105222.rishi-sunak-defends-trans-joke-in-front-brianna-gheys-mother/?sent_id=PREVIEW&secret=PREVIEW",
        "title": "Rishi Sunak defends making trans joke in front of Brianna Ghey&#39;s mother",
        "description": "During an exchange with <b>Labour</b> leader Keir Starmer, the Prime Minister attempted to skewer his opponent over the breaking of previous campaign promises. He said: “We are bringing the waiting lists down for the longest waiters and making progress ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/07/gregg-wallace-children-interview-single-parents-arent-single-20240564/?ico=trending-module_category_lifestyle_item-1",
        "title": "Gregg Wallace has got women talking about ‘single parents who aren’t single’",
        "description": "‘Nowhere does he acknowledge it or express his gratitude. This is what really gets me. This is what gendered emotional and mental <b>labour</b> is. Ask GW if he is sexist and he will most certainly say no.’ Writer Rebecca Reid agreed, posting: ‘I ..."
    },
    {
        "url": "https://uk.news.yahoo.com/expanding-senedd-touch-project-210400427.html",
        "title": "Expanding the Senedd is an &#39;out of touch&#39; project",
        "description": "Contentious plans to create 36 extra politicians in the Welsh Parliament reared their ugly ahead again last week - with <b>Labour</b> and Plaid Cymru backing the out-of-touch project. Expanding the Welsh Parliament – which forms part of a reform package being ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864161/wellingborough-by-election-reform-win-odds",
        "title": "Odds of Reform UK pulling off shock by-election victory slashed with Tory voters on strike",
        "description": "Mr Habib told Express.co.uk: &quot;The reason the odds have come in so dramatically is that people in Wellingborough have realised that the only party that stands a chance of reversing the tide of destruction delivered by the Tories and continued by the <b>Labour</b> ..."
    }
]