[
    {
        "url": "https://www.mirror.co.uk/news/politics/critics-say-its-long-rollercoaster-32152067",
        "title": "&#39;Critics say it&#39;s a long rollercoaster ride ahead for <b>Labour</b> - but the panic is over&#39;",
        "description": "Labour secured a double by-election victory on Thursday after a &#39;catastrophic&#39; handling of an anti-semitism row. Keir Mudie believes the party &#39;can hold things together and keep focus&#39;"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "So, another two whopping by-election victories for <b>Labour</b>. What is most striking about the results in Wellingborough and Kingswood is that they feel almost unsurprising, despite the scale of <b>Labour</b>&#39;s wins. Why? Because it extends the trend of <b>Labour</b> ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/labour-ready-for-difficult-decisions-in-new-age-of-insecurity-starmer-says-110761/",
        "title": "<b>Labour</b> ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-scottish-margaret-thatcher-glasgow-snp-b1139835.html",
        "title": "<b>Labour</b> ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.itv.com/news/2024-02-17/keir-starmer-rebukes-donald-trump-as-he-promises-to-stand-up-for-allies",
        "title": "Keir Starmer rebukes Donald Trump as he promises to &#39;stand up for allies&#39;",
        "description": "The Labour leader, who is preparing for the 2024 general election, warned &#39;bad faith politics&#39; risks global security. | ITV National News"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-reportedly-considering-calling-28654450",
        "title": "Rishi Sunak reportedly considering calling General election in May",
        "description": "The Prime Minister is considering calling a General election in May, a report has claimed. It follows two by-election defeats for the Conservatives where <b>Labour</b> overturned huge majorities to take the former Tory seats. MPs are considering a May election to ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/keir-starmer-reportedly-wanted-to-quit-after-2021-byelection-defeat",
        "title": "Keir Starmer reportedly wanted to quit after 2021 byelection defeat",
        "description": "Labour leader thought loss to Tories in Hartlepool meant party going backward, according to new biography"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/sir-keir-starmer-previously-considered-28654438",
        "title": "Sir Keir Starmer previously considered quitting as <b>Labour</b> leader, book claims",
        "description": "A new book on the Labour leader, serialised in The Times, suggests that Sir Kier, the MP for Holborn and St Pancras, told close aides in the immediate wake of the by-election that he was going to quit, before being persuaded to change his mind."
    },
    {
        "url": "https://www.thesun.co.uk/news/26012238/scottish-labour-vote-gaza-ceasefire-starmer/",
        "title": "Fresh blow for Sir Keir Starmer as Scottish <b>Labour</b> openly defies him to vote for Gaza ceasefire",
        "description": "SIR Keir Starmer’s authority has been plunged into fresh turmoil after Scottish Labour voted to demand an immediate ceasefire in Gaza. In a huge blow to the Labour leader, his party colleagues"
    },
    {
        "url": "https://www.thewestonmercury.co.uk/news/national/24126385.labour-will-deal-trump-becomes-president-says-starmer/",
        "title": "<b>Labour</b> will deal with Trump if he becomes president, says Starmer",
        "description": "Sir Keir Starmer said that his party would remain fully committed to Nato if it wins office at the next election."
    }
]