[
    {
        "url": "https://www.shropshirestar.com/news/uk-news/2024/02/15/what-the-papers-say--february-15/",
        "title": "What the papers say – February 15",
        "description": "The Sun hears from friends of radio star Steve Wright who say the BBC broke his heart when his Radio 2 programme was axed after 24 years. The Metro reports that the Government is planning a social media initiative, using TikTok influencers to discourage migrants from making illegal Channel crossings."
    },
    {
        "url": "https://www.theguardian.com/business/2024/feb/15/labour-urged-to-double-funding-in-publicly-owned-renewables?ref=biztoc.com",
        "title": "<b>Labour</b> urged to double funding in publicly owned renewables",
        "description": "Cash injection in Great British Energy should be increased to £30bn, thinktank says after Keir Starmer U-turn Keir Starmer is being urged to more than double <b>Labour</b>’s investment in publicly owned renewable energy to save consumers billions of pounds on ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-faces-electoral-tests-risk-000100344.html",
        "title": "Sunak Faces Electoral Tests That Risk Encouraging Tory Plotters",
        "description": "(Bloomberg) -- Rishi Sunak faces a double electoral test on Thursday that could trigger further division in his Conservative Party and undermine his bid to stop the <b>Labour</b> Party from taking power in a UK-wide vote expected in the fall. Most Read from ..."
    },
    {
        "url": "https://uk.news.yahoo.com/know-bob-marleys-song-one-010532414.html",
        "title": "What to Know About Bob Marley&#39;s Song &#39;One Love&#39;",
        "description": "The iconic song from Bob Marley and the Wailers&#39; &#39;Exodus&#39; inspired the title of the new biopic &#39;Bob Marley: One Love&#39;"
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13084271/STEPHEN-GLOVER-Labour-MPs-loyalty-Palestinian-Keir-Starmer-Azhar-Ali-Rochdale.html",
        "title": "STEPHEN GLOVER: How many <b>Labour</b> MPs feel a greater loyalty to the Palestinian cause than to Keir Starmer?",
        "description": "Is there a faction within the Labour Party, whose primary allegiance is neither to Labour nor to Britain - a group united by hatred of Israel, dislike of Jews and support for a &#39;Free Palestine&#39;?"
    },
    {
        "url": "https://www.fwi.co.uk/livestock/beef/how-a-suckler-and-sheep-unit-aims-for-10-return-after-rent",
        "title": "How a suckler and sheep unit aims for 10% return after rent",
        "description": "A young Northumberland farmer is staying profit-focused on the family unit by aiming to generate enough cash to theoretically buy the farm. Covering a"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13085279/Starmer-Sutra-Tory-attack-ad-puts-Labour-leader-awkward-position.html",
        "title": "Starmer Sutra! Tory attack ad puts the <b>Labour</b> leader in an awkward position over his changing views",
        "description": "Posted on social media, it featured a mocked-up book cover showing Sir Keir Starmer struggling to pull off a handstand beneath a love heart."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sturgeon-resignation-accelerated-snp-s-poll-decline-say-experts-110553/",
        "title": "Sturgeon resignation accelerated SNP’s poll decline, say experts",
        "description": "The year since Nicola Sturgeon’s resignation announcement has accelerated a decline in the SNP’s opinion poll leads, experts have said. However, support for Scottish independence has hardly changed at all in the 12 months since Ms Sturgeon’s Bute House announcement, and has instead proved “stubbornly unwilling to fall”."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-braced-for-double-by-election-test-in-wellingborough-and-kingswood-110547/",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24120929.sturgeons-legacy-one-year-since-political-big-fish-resigned-first-minister/",
        "title": "Sturgeon’s legacy: One year since political big fish resigned as first minister",
        "description": "Since her resignation, the SNP – and Scottish Government – have been battling with a resurgence of <b>Labour</b>, with both parties targeting the other’s seats at the upcoming Westminster election. The first electoral test without Ms Sturgeon at the helm ..."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/15/thousands-sign-petition-urging-council-not-to-use-weedkiller/",
        "title": "Thousands sign petition urging council not to use weedkiller",
        "description": "She asked <b>Labour</b> councillor Tim Rowkins: “Has <b>Labour</b> u-turned on declaring a biodiversity emergency”? Councillor Rowkins, who chairs the City Environment, South Downs and the Sea Committee, said that <b>Labour</b> had not u-turned. He said: “We are working ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24120915.explosion-hatred-all-time-high-antisemitism-recorded-jewish-charity/",
        "title": "‘Explosion in hatred’ as all-time high antisemitism recorded by Jewish charity",
        "description": "We stand with Jewish communities everywhere, now and always. <b>Labour</b>’s Yvette Cooper, shadow home secretary, said the rise was “appalling and intolerable” and a “stain on our society”. She said: “There must be zero-tolerance for antisemitism in ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1866789/Rochdale-Labour-Azhar-Ali-leaflet?ref=todayheadlines.live",
        "title": "<b>Labour</b> embarrassment as leaflets praising disgraced candidate Azhar Ali lands on doorsteps",
        "description": "Residents in Rochdale have received <b>Labour</b> leaflets calling on people to back their ditched by-election candidate. The Opposition party’s humiliation continued on Wednesday when the campaign literature backing supporting Azhar Ali began arriving on ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/times-letters-labours-enduring-problem-with-antisemitism-zrnb036cj",
        "title": "Times letters: <b>Labour</b>’s enduring problem with antisemitism",
        "description": "Sir, Although he acknowledges that Jews had no where else to go, Daniel Finkelstein (“Why the left has a problem with antisemitism”, Feb 14) omits to mention four other reasons why Israel does not fall within a classic colonialist model: those arriving ..."
    },
    {
        "url": "https://www.businessgreen.com/news/4174279/study-labours-clean-energy-plans-save-gbp1bn-interest-payments",
        "title": "Study: <b>Labour</b>&#39;s clean energy plans could save up to £1bn on interest payments alone",
        "description": "Energy transition will be slower, costlier, and less secure without major public investment in renewables, think tank Common Wealth argues"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/sunak-braced-for-double-by-election-test-in-wellingborough-and-kingswood/",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.businessgreen.com/news/4174291/ovo-thirds-house-hunters-prioritising-energy-efficiency-carbon-saving-tech",
        "title": "Ovo: Two thirds of house hunters prioritising energy efficiency and carbon saving tech",
        "description": "Energy supplier finds property buyers are looking for green technology installations when searching for a new home"
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/sturgeons-legacy-one-year-since-political-big-fish-resigned-as-first-minister/",
        "title": "Sturgeon’s legacy: One year since political big fish resigned as first minister",
        "description": "Nicola Sturgeon’s name is still at the forefront of Scottish politics one year on from her resignation. A year on from her shock resignation as Scotland’s first minister, Nicola Sturgeon’s legacy has been put under the microscope."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24120922.timeline-turbulent-year-snp-following-sturgeons-resignation/",
        "title": "Timeline: Turbulent year for SNP following Sturgeon’s resignation",
        "description": "Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland’s longest serving first minister told broadcasters she had “plenty left in the tank” as leader. But she closed the chapter on her tenure in charge after more than eight years in the job, on February 15 2023."
    },
    {
        "url": "https://morningstaronline.co.uk/article/what-next-labour-left-cymru",
        "title": "What next for the <b>Labour</b> left in Cymru?",
        "description": "With the resignation of Mark Drakeford as leader of Welsh <b>Labour</b> and the election of his replacement imminent it is important to ask “What is next?” The ongoing conflict and humanitarian disasters in the Middle East, the worsening housing and cost-of ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-scottish-edinburgh-ipsos-mori-westminster-b1139239.html",
        "title": "Sturgeon resignation accelerated SNP’s poll decline, say experts",
        "description": "Pollster Mark Diffley, a former director of Ipsos Mori in Edinburgh, said the drop in support for the SNP and the related upturn in support for <b>Labour</b> meant the upcoming general election would be the most competitive in Scotland since 2010. He told the PA ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25949389/scottish-parliament-computers-edit-msps-wikipedia-pages/",
        "title": "Scottish parliament computers used numerous times to edit &amp; improve MSPs’ Wikipedia pages",
        "description": "They include deleting criticism of Scottish Lib Dem leader Alex-Cole-Hamilton, a former MSP’s “controversies” section being removed entirely and a prominent Scottish <b>Labour</b> politician’s page having a reference to Jeremy Corbyn taken out."
    }
]