[
    {
        "url": "https://inews.co.uk/news/ex-post-office-badenoch-after-bullying-claims-2914937?ico=most_popular",
        "title": "Ex-Post Office chairman hits back at Badenoch after ‘astonishing’ bullying claims",
        "description": "Spokesperson for Henry Staunton says Commons statement by Ms Badenoch was &#39;first time&#39; any investigation into bullying claims had been mentioned"
    },
    {
        "url": "https://www.expressandstar.com/news/local-hubs/birmingham/2024/02/19/birmingham-city-council-reveal-details-of-massive-budget-cuts-to-young-peoples-services/",
        "title": "Birmingham City Council reveal details of massive budget cuts to young people&#39;s services",
        "description": "Birmingham City Council has finally revealed how it will slash services for children, young people and families amid its alarming financial crisis."
    },
    {
        "url": "https://www.bbc.com/news/articles/cp490rp287wo",
        "title": "Cost of living fears rife in election battleground",
        "description": "I’m not going to be 40 and still living at home.&quot; Shannon Challoner is a bingo hall cashier who sees no way of ever owning her own home. As a general election looms, the 20-year-old from from Rhyl, Denbighshire,"
    },
    {
        "url": "https://news.sky.com/story/tories-accused-of-failing-parents-as-cost-of-childcare-rises-faster-than-inflation-13075864",
        "title": "Tories accused of failing parents as cost of childcare rises faster than inflation",
        "description": "Analysis by the Labour Party shows the price of a part-time nursery place has jumped from £82 per week in 2010 to £146 now."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/19/tories-thwarted-in-budget-ploy-to-save-aquarium-roundabout/",
        "title": "Tories thwarted in budget ploy to save Aquarium roundabout",
        "description": "The Tories called on the <b>Labour</b>-run council scrap the scheme before the “budget council” meeting on Thursday (22 February). They want to use £1 million from the capital budget for the Valley Gardens project on other transport projects such as fixing ..."
    },
    {
        "url": "https://www.thesun.co.uk/motors/26048886/motorists-jeremy-hunt-cut-fuel-duty-budget/",
        "title": "Angry motorists urge Chancellor Jeremy Hunt to make more cuts to fuel duty in Budget",
        "description": "He said last night: “A Budget for motorists will entice wavering voters away from <b>Labour</b>. “Starting with a big cut in Fuel Duty and ensuring the fuel supply chain is ruthlessly policed with PumpWatch will be hugely helpful to the Tory Party’s ..."
    },
    {
        "url": "https://inews.co.uk/opinion/debate-triple-lock-solve-pensioner-poverty-2914907?ico=related_stories",
        "title": "Debate the triple lock all you want, but UK needs to solve pensioner poverty",
        "description": "Pensioners protesting in Westminister over the cost of living and poverty (Photo: Guy Smallman/Getty) Photographer: Guy Smallman Provider: Getty Images Source: Getty Images Europe Some people will celebrate the fact that <b>Labour</b> is expected to commit ..."
    },
    {
        "url": "https://www.ft.com/content/ab467c3b-63ef-4f83-bd1c-e6de458b5983",
        "title": "Sunak bids to win back support of British farmers",
        "description": "The governing party won 96 of the 100 most rural seats in England in 2019 but is on track to lose more than half of those to <b>Labour</b> and the Liberal Democrats, according to a poll by Survation, commissioned by the Country Land and Business Association."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-labour-rishi-sunak-government-ukraine-b1140168.html",
        "title": "PM to tell farming conference Government is ‘by their side’",
        "description": "His speech comes in the wake of polling which found <b>Labour</b> had narrowly overtaken the Tories among countryside voters, who also felt neither main party understood rural communities. Farmers have been dealing with the impacts of soaring costs of inputs ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13101935/Fruit-picking-robots-slash-need-migrant-labour-Rishi-Sunak-tell-farmers-unveils-220-million-fund-new-technology.html",
        "title": "Fruit-picking robots could slash the need for migrant <b>labour</b>, Rishi Sunak to tell farmers as he unveils £220 million fund for new technology",
        "description": "Fruit-picking robots could slash the need for migrant <b>labour</b>, Rishi Sunak will tell farmers today. Addressing the National Farmers&#39; Union conference, the Prime Minister will unveil a £220 million fund to help deploy new technology to help boost ..."
    }
]