[
    {
        "url": "https://www.bbc.com/news/uk-politics-68121804",
        "title": "Watch: Martin Lewis for PM? Voters give their views",
        "description": "A panel made up of Labour voters, Tory voters and the undecided have been sharing their thoughts with Laura Kuenssberg. Hear their suggestions of who should be prime minister are some names you may have heard of but not necessarily for their political backgrounds."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/gemma-atkinson-says-you-should-28527256",
        "title": "Gemma Atkinson says &#39;you should have heard me&#39; as she recalls <b>labour</b> amid finding &#39;mum strength&#39;",
        "description": "It comes after the Hits Radio host previously joked that it was her fiance Gorka Marquez&#39;s fault that she was back in the gym"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/28/labour-spending-spree-risks-liz-truss-debt-crisis/",
        "title": "<b>Labour</b> spending spree would risk reigniting ‘Truss-era crisis’",
        "description": "<b>Labour</b> risks reigniting the debt crisis that brought down Liz Truss if it commits to unsustainable spending after coming to power, a top bond investor has warned. Pictet, a Swiss bank and asset manager, said that concerns over British stability have not ..."
    },
    {
        "url": "https://www.cityam.com/labour-would-host-annual-investment-summit-says-jonathan-reynolds/",
        "title": "<b>Labour</b> would host annual investment summit, says Jonathan Reynolds",
        "description": "<b>Labour</b> would host an annual business summit in a bid to showcase Britain as a global investment destination, if elected into power, Jonathan Reynolds has pledged. Photo: PA <b>Labour</b> would host an annual business summit in a bid to showcase Britain as a ..."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/24077887.gipsy-hills-douglas-fir-micropub-celebrates-craft-beer/",
        "title": "Gipsy Hill’s The Douglas Fir micropub celebrates craft beer",
        "description": "A Crystal Palace micropub which serves as the first venue set up by a local brewery is described as being a <b>labour</b> of love, a community hub, and a celebration of craft beer culture. The Douglas Fir’s journey began in 2016 when the space was transformed ..."
    },
    {
        "url": "https://news.sky.com/story/labours-16328bn-green-pledge-still-the-level-of-ambition-says-shadow-business-secretary-13058508",
        "title": "<b>Labour</b>&#39;s £28bn green pledge still the &#39;level of ambition&#39;, says shadow business secretary",
        "description": "<b>Labour</b> has said it remains &quot;committed&quot; to the &quot;level of ambition&quot; outlined in its £28bn green investment pledge as uncertainty continues to surround whether it will be watered down further or scrapped. Shadow business secretary Jonathan Reynolds said the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/wealth-tax-labour-public-services-neil-kinnock-2877272?ico=related_article_inline",
        "title": "Wealth tax could be imposed by <b>Labour</b> to boost public services, says Neil Kinnock",
        "description": "A wealth tax on high-value assets could be imposed by <b>Labour</b> to raise cash for public services, says former leader Neil Kinnock. Despite shadow Chancellor Rachel Reeves’s reluctance to increase income tax or reverse the cut in national insurance ..."
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/24080017.cllr-amanda-king-will-not-stand-great-sankey-elections/",
        "title": "Cllr Amanda King will not stand in Great Sankey in elections",
        "description": "She is the latest long-serving <b>Labour</b> councillor to confirm they won&#39;t stand in May. Former leader and deputy Cllrs Russ Bowden and Cathy Mitchell also said they will step down. “It has been a privilege and a pleasure to have served my community on ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-private-school-tax-wealthy-poorer-children-grammars-2875633?ico=related_stories",
        "title": "<b>Labour</b> private school tax will see wealthy push out poorer children at grammars",
        "description": "<b>Labour</b>’s plans to charge VAT on private school fees could mean deprived children losing out on places in selective state grammar schools, leading figures in the sector have warned. The party intends to introduce the 20 per cent tax on fees immediately if ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68121257?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_format=link&at_link_type=web_link&at_link_id=5710C8FA-BDD1-11EE-9AC0-2B80D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Wales_News",
        "title": "Post Office scandal: Chairman Henry Staunton had to go as it &#39;wasn&#39;t working&#39; - Badenoch",
        "description": "Ms Badenoch said she removed him after concerns about Post Office governance and &quot;the entire business model&quot;. <b>Labour</b> called on the government to give more specific reasons for its decision. Mr Staunton left the role on Saturday. The BBC has approached him ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/28/welsh-semiconductor-factory-left-in-limbo-as-westminster-fails-to-approve-us-takeover?ref=biztoc.com",
        "title": "Welsh semiconductor factory ‘left in limbo’ as Westminster fails to approve US takeover",
        "description": "Labour criticises government ‘dithering’, after Vishay deal last autumn to buy chip maker Newport Wafer Fab stalls, putting jobs at risk"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860641/conservative-mp-no-beards-rule-general-election",
        "title": "Tory MPs being ‘told to shave off beards to attract voters’",
        "description": "Tory MPs are reportedly keeping clean shaven because beards put voters off. With <b>Labour</b> 23 points ahead of the Tories in the polls and the next General Election set to take place this year, Conservative members of Parliament are said to be telling each ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/cw0rjqyyegko",
        "title": "Councillors reject &#39;only focus on borough&#39; motion",
        "description": "Opposition parties deemed the motion &quot;wholly inappropriate&quot; and it was refused after a majority of <b>Labour</b>, Liberal Democrat and Green Party members voted against it. The Local Democracy Reporting Service said Green Party members&#39; motion calling for an ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/humza-yousaf-accused-cover-up-31983823.amp",
        "title": "Humza Yousaf accused of lying over deleted Covid WhatsApp messages",
        "description": "Scottish <b>Labour</b> deputy Leader Jackie Baillie said: “It beggars belief that Humza Yousaf thought he could lie this publicly and get away with it. “These are not innocent mistakes, time and time again, he doubled down on untruths he told the people of ..."
    },
    {
        "url": "https://www.thenational.scot/news/24079713.sunday-laura-kuenssberg-bbc-panned-english-focus-group/",
        "title": "Sunday with Laura Kuenssberg: BBC panned over English focus group",
        "description": "All participants were from seats in the Greater Manchester area which had voted Conservative in 2019 after previously voting for the <b>Labour</b> Party – but Kuenssberg insisted they represented the “full gamut of views” in Britain. The suggestion was ..."
    },
    {
        "url": "https://uk.news.yahoo.com/mp-concerned-home-educated-children-160000962.html",
        "title": "MP concerned some home-educated children are drifting into isolation and depression",
        "description": "As some of you may be aware, I am having a run-in with the Alliance Council — a confused coalition kept in power by Independents, Greens, Lib Dems and <b>Labour</b>. A few Alliance councillors are good and most try, but overall, they are failing our teachers ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/grieving-palestinian-dragged-out-labour-meeting-angela-rayner-heckled-activists",
        "title": "Grieving Palestinian dragged out of <b>Labour</b> meeting as Rayner heckled by activists",
        "description": "A BEREAVED Palestinian from Gaza was forcefully dragged out of a <b>Labour</b> Party event in Stockport attended by the party’s deputy leader Angela Rayner on Friday. Dalloul al-Neder, who has lost his mother, brother, pregnant sister-in-law and two nieces ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/labour-questions-tory-business-secretary-sacking-of-post-office-chairman",
        "title": "<b>Labour</b> questions Tory Business Secretary&#39;s sacking of Post Office chairman",
        "description": "<b>LABOUR</b> has demanded to know why the chairman of the Post Office has been sacked although not in charge when hundreds of sub-postmasters and mistresses were unjustly prosecuted during the Horizon computer scandal. Henry Staunton was appointed Post Office ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nadine-dorries-hand-back-ps17-000-mistake-b2486289.html",
        "title": "Dorries pledges to hand back nearly £17,000 ‘golden goodbye’ given in error",
        "description": "She blamed Rishi Sunak for her lack of a gong and triggered a by-election in her Mid Bedfordshire seat. Wiithin weeks <b>Labour</b> had overturned a huge Tory majority to win the constituency. <b>Labour</b> has pledged to reform the rules on ministerial severance pay if ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/once-safe-tory-seat-now-28520364",
        "title": "This was once a safe Tory seat - now people don&#39;t know who to vote for",
        "description": "The constituency-level forecast, which is based on data about the type of voters who live in each area, suggests <b>Labour</b>&#39;s victory over the Tories in Altrincham and Sale West would be narrow. But with Sir Graham standing down as MP, the Tories face an ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/nadine-dorries-boris-johnson-cabinet-laura-kuenssberg-emily-thornberry-b2486257.html",
        "title": "Dorries pledges to hand back nearly £17,000 mistakenly received as severance pay",
        "description": "<b>Labour</b> has recently pledged to reform ministerial severance pay rules if it wins power in the election this year after it emerged nearly £1 million was spent during last year’s political turmoil. The Opposition says it would link payouts to time spent ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/lifestyle/money/state-pension-age-change-compensation-31972035?int_source=nba",
        "title": "New call for DWP compensation for WASPI women affected by changes to State Pension age",
        "description": "However, <b>Labour</b> MP Alistair Strathern, has asked the Department for Work and Pensions (DWP) if any recent assessment of the “potential merits of compensating women born in the 1950s affected by changes to State Pension age legislation” has been made."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-slapped-down-watchdog-31911774?mc_cid=08bd0e32d0",
        "title": "Rishi Sunak slapped down by watchdog after &#39;misleading&#39; claim asylum backlog is cleared",
        "description": "The British public deserves better than this.&quot; Shadow Immigration Minister Stephen Kinnock said: &quot;<b>Labour</b> wrote to the UK Statistics Authority a year ago to complain about Rishi Sunak repeatedly lying about the asylum backlog, and he was warned not to do it ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/28/ed-miliband-blairs-team-dubbed-profanity-prone-brown-office/",
        "title": "Ed Miliband: profanity-prone Gordon Brown’s office was known as ‘Planet F---’",
        "description": "Sir Tony Blair’s team dubbed Gordon Brown’s office “Planet F---” because he swore so much, Ed Miliband has claimed. The former Labour Party leader from 2010 to 2015, Mr Miliband, 54, has been the shadow secretary of state for energy security and net zero since 2021."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/28/angela-rayner-tories-council-fund-is-cynical-pre-election-sticking-plaster?ref=biztoc.com",
        "title": "Angela Rayner: Tories’ council fund is cynical pre-election sticking plaster",
        "description": "Exclusive: <b>Labour</b> ‘under no illusions’ about mess party stands to inherit, as council leaders warn more will go bust next year Angela Rayner has accused the Conservatives of cynically applying a “sticking plaster” to council finances to get through ..."
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/people/scottish-governments-affordable-housing-target-at-risk-briefing-note-shows-4495734",
        "title": "Scottish Government’s affordable housing target ‘at risk’, briefing note shows",
        "description": "A key Scottish Government target to build affordable homes over the next decade is “at risk”, according to a ministerial briefing obtained by <b>Labour</b>. Through freedom of information, <b>Labour</b> have now seen briefing notes from December which state “our ..."
    }
]