[
    {
        "url": "https://www.bbc.com/news/uk-england-london-68117976",
        "title": "Merton <b>Labour</b> councillor quits over Israel-Gaza posts",
        "description": "A councillor in south London who was suspended by the Labour Party over her comments on the Israel-Gaza conflict has resigned from the party. Councillor Caroline Charles said she was &quot;kicked out&quot; for calling for a &quot;ceasefire now&quot; on social media."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13013187/DAN-HODGES-Rishi-call-bluff-rebels-John-Major.html",
        "title": "DAN HODGES: Rishi has to call the bluff of rebels just like John Major did - or else suffer death by a thousand cuts",
        "description": "They will continue to attack and undermine the PM until enough MPs decide it&#39;s time for another party leadership contest, or for the General Election to allow the British people to decide it&#39;s time for Sir Keir Starmer and <b>Labour</b> to put the Tory party and ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24077553.durham-council-spent-1-2m-levelling-fund-bids/",
        "title": "Durham Council spent £1.2m on Levelling Up Fund bids",
        "description": "And <b>Labour</b> members now doubt whether the money will be repaid. Cllr Kevin Shaw told a full council meeting: “I have no reason to believe this will be successful and the county council will be similarly ignored.” Cllr Shaw said a judicial review is ..."
    },
    {
        "url": "https://news.sky.com/story/falling-by-the-waugh-side-former-journalist-fails-to-clinch-chance-to-be-mp-13057124",
        "title": "Falling by the Waugh-side - former journalist fails to clinch chance to be MP",
        "description": "From Winston Churchill to Boris Johnson, Michael Foot to Michael Gove and now husband and wife Ed Balls and Yvette Cooper, punditry to parliament is a well-trodden path."
    },
    {
        "url": "https://www.pakistantoday.com.pk/2024/01/27/stolen-childhoods-the-pervasive-shadow-of-child-labour-in-pakistan/",
        "title": "Stolen Childhoods: The pervasive shadow of child <b>labour</b> in Pakistan",
        "description": "The vibrant melody of kites dancing on the Pakistani sky carries a melancholic undertone. For amidst the playful flutter, thousands of children are robbed of their"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/27/caribbean-nation-seeks-reparations-from-uk-brewer/",
        "title": "Caribbean nation seeks slavery reparations from British brewer Greene King",
        "description": "St Kitts and Nevis has set up talks with Greene King to discuss restitution for the company’s founders links to slavery"
    },
    {
        "url": "https://inews.co.uk/news/paul-waugh-labour-mp-for-rochdale-2876818?ico=related_stories",
        "title": "Paul Waugh loses out in bid to stand as new <b>Labour</b> MP for Rochdale",
        "description": "The journalist Paul Waugh has missed out in his bid to stand as the new <b>Labour</b> MP for Rochdale. The party held a hustings on Saturday where Lancashire County councillor Azhar Ali was elected by party members from a shortlist including Mr Waugh and Wigan ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/union-to-use-human-rights-act-to-challenge-minimum-service-strike-law-109108/",
        "title": "Union to use Human Rights Act to challenge minimum service strike law",
        "description": "It is a fundamental human right of any worker to withdraw their <b>labour</b> to protect their terms and one we shall defend on behalf of our members in the Border Force Mark Serwotka, PCS The PCS said it will argue this contravenes the right to strike enshrined ..."
    },
    {
        "url": "https://uk.news.yahoo.com/voices-keir-starmer-mind-labour-163619181.html",
        "title": "Voices: Keir Starmer is about to make up his mind about <b>Labour</b>’s £28bn albatross – its green manifesto",
        "description": "There are now almost daily news stories either saying <b>Labour</b> is about to ditch it, or that <b>Labour</b> denies that a decision to ditch it has already been taken. Patrick Maguire of The Times, who is writing a book about <b>Labour</b>’s not-so-long march to (presumed ..."
    },
    {
        "url": "https://metro.co.uk/2024/01/27/given-chasing-dream-job-couldnt-happier-20177655/?ico=more_text_links",
        "title": "I’ve given up chasing my dream job. I couldn’t be happier",
        "description": "When I look back at my favourite memories from the period I was in full-time employment, they’re of getting up at 4am to go and see Angkor Wat in Cambodia with my husband, or of jumping on a train when my sister told me she had gone into <b>labour</b> ..."
    },
    {
        "url": "https://uk.yahoo.com/news/huge-rally-mark-40th-anniversary-102049767.html",
        "title": "Huge rally to mark 40th anniversary of ban on unions at GCHQ",
        "description": "Most workers quit their unions, but 14 refused as a matter of principle and were sacked. In 1997, the newly-elected <b>Labour</b> government lifted the ban and they were able to return to work. “Our message today is the same as it was in 1984 – we shall fight ..."
    },
    {
        "url": "https://uk.news.yahoo.com/everyone-knows-tories-failed-says-001711017.html",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "One of the main topics on the agenda is <b>Labour</b>&#39;s expected victory which will see the party picking up seats in Earley and Woodley and the newly-designed constituency Reading West and Mid Berkshire, which encompasses Tilehurst. Despite election forecasts ..."
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/154942/azhar-ali-chosen-as-labour-candidate-for-rochdale-seat-in-upcoming-byelection",
        "title": "Azhar Ali chosen as <b>Labour</b> candidate for Rochdale seat in upcoming by-election",
        "description": "Lancashire <b>Labour</b> group leader Azhar Ali has been chosen by the <b>Labour</b> party as its candidate for the Rochdale parliamentary by-election. Mr Ali was voted for by <b>Labour</b> members on Saturday 27 January from a shortlist that included Rochdale-born Westminster ..."
    },
    {
        "url": "https://www.express.co.uk/entertainment/music/1860303/Radiohead-Smile-album-review-Saxon-Frank-Carter-Newdad-rock",
        "title": "Album reviews: The Smile, Saxon, Frank Carter &amp; The Rattlesnakes and NewDad",
        "description": "More worrying for Radiohead fans are the lyrics. Thom sings: ‘And when the end has come, maybe you can’t, maybe you can’t be arsed for half a million…’ So, is The Smile a <b>labour</b> of love for Yorke and Greenwood or an escape hatch? Only time will tell."
    },
    {
        "url": "https://www.itv.com/watch/news/why-the-first-labour-prime-minister-and-former-mp-for-seaham-still-causes-controversy/49zbq15",
        "title": "Why the first <b>Labour</b> Prime Minister and former MP for Seaham still causes controversy",
        "description": "Fri 26 Jan 11am • Why a century on, Ramsay MacDonald&#39;s time in office is still considered a controversial chapter in our political history."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/hatred-margaret-thatcher-still-burns-31959010?int_source=nba",
        "title": "&#39;Hatred&#39; of Margaret Thatcher &#39;still burns bright&#39; in Scots mining communities 40 years on, says MP",
        "description": "The Midlothian MP also hit out at <b>Labour</b>’s Sir Keir Starmer for ignoring his calls for a pardon in Scotland for those convicted of offences relating to the 1984-1985 strike to be extended south of the border. “People have not forgotten what went on."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/new-rochdale-labour-candidate-says-28523777",
        "title": "New Rochdale <b>Labour</b> candidate says by-election is a &#39;chance to send a clear message to Rishi Sunak&#39;",
        "description": "<b>Labour</b>&#39;s candidate to fight the up-coming Rochdale by-election says it will give voters the &#39;chance to send a clear message to Rishi Sunak&#39;. Lancashire county council leader Azhar Ali was today chosen from a shortlist of three to succeed the late Sir Tony ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/union-to-use-human-rights-act-to-challenge-minimum-service-strike-law-b1135241.html",
        "title": "Union to use Human Rights Act to challenge minimum service strike law",
        "description": "It is a fundamental human right of any worker to withdraw their <b>labour</b> to protect their terms and one we shall defend on behalf of our members in the Border Force Mark Serwotka, PCS The PCS said it will argue this contravenes the right to strike enshrined ..."
    }
]