[
    {
        "url": "https://www.standard.co.uk/news/politics/the-king-ayesha-hazarika-labour-plaid-cymru-douglas-ross-b1138306.html",
        "title": "No 10 announces 13 new political life peers during recess",
        "description": "Thirteen new life peers have been announced by the Government. Downing Street published the list of political peerages on Friday as MPs were on holiday. The Tories’ eight nominations include Paul Goodman, a former Conservative MP and editor of the influential ConservativeHome website."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/teens-would-banned-buying-energy-32091596",
        "title": "Teens to be banned from buying energy drinks such as Prime under plan considered by <b>Labour</b>",
        "description": "Energy drinks will be banned from being sold to under-16s, under plans being considered by <b>Labour</b>. A clampdown is being looked at because of worries about the impact on children’s health - as well as their education. The drinks can be packed with high ..."
    },
    {
        "url": "https://news.sky.com/story/amp/labour-considering-ban-on-sale-of-energy-drinks-to-under-16s-13067745",
        "title": "<b>Labour</b> considering ban on sale of energy drinks to under-16s",
        "description": "A ban on the sale of energy drinks to under-16s is being considered by the <b>Labour</b> Party if it wins power, Sky News understands. The proposal has been submitted for the party&#39;s election manifesto, amid growing evidence of the health risks to young people ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-hints-at-protecting-public-sector-from-pension-tax-xzfhwc3br",
        "title": "<b>Labour</b> hints at protecting public sector from pension tax",
        "description": "Jeremy Hunt, the chancellor, last year scrapped the £1 million lifetime tax-free limit on pension contributions to stop senior NHS consultants leaving the health service over hug"
    },
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-election-policies-labour-lite-k6003jsph",
        "title": "The Times view on election policies: <b>Labour</b> Lite",
        "description": "I t is highly likely that Sir Keir Starmer will lead a Labour government with a big majority within a few months. Opinion polls yield a consistent message that the party is about"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/09/rishi-sunak-earned-more-than-22m-last-year/",
        "title": "Rishi Sunak earned more than £2.2m last year",
        "description": "Rishi Sunak earned more than £2.2 million last year and paid an effective tax rate of 23 per cent, according to official accounts released on Friday. Downing Street published the Prime Minister’s tax return which showed that in total he paid just over £500,000 in UK taxes in 2022-23."
    },
    {
        "url": "https://www.channel4.com/news/i-absolutely-did-not-consider-resignation-over-labour-green-u-turn-ed-miliband-says",
        "title": "I absolutely did not consider resignation over <b>Labour</b> green U-turn, Ed Miliband says",
        "description": "We spoke to the Shadow Climate Secretary Ed Miliband, and started by asking him why he had initially pushed for the £28 billion investment plan."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-labour-nominate-political-columnists-house-of-lords-2900258?ITO=msn",
        "title": "Tories and <b>Labour</b> both nominate political columnists to House of Lords",
        "description": "The Conservatives and Labour have both nominated political columnists to the House of Lords, as 13 new life peers were announced by the Government. Downing Street published the latest list of political peerages on Friday as MPs were on holiday."
    },
    {
        "url": "https://www.channel4.com/news/labour-u-turn-scrapping-green-pledge-about-being-straight-with-voters-starmer-says",
        "title": "<b>Labour</b> U-turn: Scrapping green pledge about ‘being straight’ with voters, Starmer says",
        "description": "Sir Keir Starmer insists he scrapped Labour’s £28bn green spending pledge to be straight with voters. With environmental groups, union allies and some of his own MPs expressing disappointment, senior Labour figures have been out presenting a united front as they defend the move."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/barrister-removed-ba-flight-armed-32091769",
        "title": "Barrister removed from BA flight by armed cops after cabin crew row given peerage by PM",
        "description": "Prime Minister Rishi Sunak slipped out the list of new peers on Friday evening that also includes a council leader who bragged about trying to kill moles with a blowtorch"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/09/frustrated-businesses-staff-abroad-britons-abandon-work/",
        "title": "‘Frustrated’ businesses seek staff abroad as Britons abandon work",
        "description": "Businesses have become “frustrated” with trying to hire British workers and are increasingly looking abroad to fill vacancies, the National Institute of Economic and Social Research (NIESR) has warned."
    },
    {
        "url": "https://metro.co.uk/2024/02/09/pink-stunned-fan-goes-labour-australian-show-20255298/?ico=metro-posts_cars_whats-trending-now",
        "title": "Pink stunned as fan goes into <b>labour</b> during her Australian show",
        "description": "So, it might not come as a shock to hear that someone actually went into <b>labour</b> at her recent gig. The US star was performing in Sydney on Friday night (February 9) on the first night of her Australian Summer Carnival tour. Pink, 44, was belting out a ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/09/katie-price-held-like-hostage-traumatic-birth-20252396/?ico=trending-module_tag_katie-price_item-0",
        "title": "Screaming Katie Price ‘held down like a hostage’ during traumatic birth scenes",
        "description": "Katie revealed doctors had to break her waters as she was screaming and being held down to force her <b>labour</b> to start. ‘All I can say is it was like a knitting need hook and they were literally going pull and pop,’ she graphically revealed to her sister ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sir-rod-stewart-says-labour-182100879.html",
        "title": "Sir Rod Stewart says <b>Labour</b> &#39;deserve a crack&#39; at running the country",
        "description": "Sir Rod Stewart has branded Boris Johnson a &quot;lying f***** public schoolboy&quot; as he threw his weight behind <b>Labour</b> ahead of the upcoming general election. The rock legend and long-time Tory voter confirmed a change of tune, in which he said Sir Keir Starmer ..."
    },
    {
        "url": "https://uk.yahoo.com/finance/rishi-sunaks-tax-return-shows-164100290.html",
        "title": "Sunak paid half a million pounds in tax last year, according to his tax returns",
        "description": "Politics Live: Sir Rod Stewart says <b>Labour</b> &#39;deserve a crack&#39; at power The document shows he paid a tax bill of £508,308 in the financial year 2022-23 - around £75,000 more than what he paid in the previous year. Mr Sunak made nearly £1.8m through ..."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1864935/Brian-May-Carol-Vorderman-tories-instagram?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "Brian May backs Carol Vorderman in campaign against the Tories as he issues urgent plea",
        "description": "The votes will most likely be to determine whether Sunak remains PM or whether <b>Labour</b> leader Sir Keir Starmer will take his place. May re-shared a video from Vorderman, where she made several claims about government “scandals” in association with the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/sir-rod-stewart-slams-boris-32091616",
        "title": "Sir Rod Stewart slams Boris Johnson dubbing him a &#39;lying public schoolboy&#39;",
        "description": "<b>Labour</b> “deserve a crack” at running the country, long-time Tory voter Sir Rod Stewart has said. The Maggie May hitmaker also branded former prime minister Boris Johnson a “lying f***** public schoolboy” – despite having admitted that he was ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24110568.rishi-sunak-earned-2-2-million-paid-508-000-tax-documents-show/",
        "title": "Rishi Sunak earned £2.2 million and paid £508,000 in tax, documents show",
        "description": "We need to fix this to make sure that income from wealth is taxed at the same rate as income from work.” <b>Labour</b> MP Richard Burgon posted on X, formerly Twitter: “Our tax system is rigged in favour of the super-rich. It’s time to make them pay their ..."
    },
    {
        "url": "https://news.sky.com/story/sir-rod-stewart-says-labour-deserve-a-crack-at-running-the-country-13067683",
        "title": "Sir Rod Stewart says <b>Labour</b> &#39;deserve a crack&#39; at running the country",
        "description": "Rock legend and long-time Tory voter Sir Rod Stewart has thrown his weight behind Sir Keir Starmer&#39;s leadership as he attacked Boris Johnson as a &quot;lying schoolboy&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/rachel-reeves-labour-green-pledge-2899692?ico=most_popular",
        "title": "Rachel Reeves won Shadow Cabinet ‘war’ on £28bn U-turn, insiders say",
        "description": "Shadow Chancellor Rachel Reeves won an internal battle at the top of Labour that resulted in Sir Keir Starmer deciding to U-turn on a pledge to spend £28bn on green investment."
    }
]