[
    {
        "url": "https://www.politicshome.com/news/article/no-10-halts-police-funding-plans-over-electoral-basklash-concern",
        "title": "Downing Street Halts New Police Funding Plan Over Fears Of Election Backlash",
        "description": "A long-planned new formula for how the police are funded has been put on hold over concern among ministers that it could result in some local"
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/were-still-fighting-tories-right-31969823",
        "title": "&#39;We&#39;re still fighting Tories for our right to strike 40 years after Thatcher banned unions&#39;",
        "description": "There are painful parallels with 1984 as spiteful Tory anti-trade union legislation culminates in the new Strikes (Minimum Service Levels) Act, which could mean some workers losing their jobs for stri"
    },
    {
        "url": "https://www.irishmirror.ie/news/irish-news/watch-moment-irish-mum-child-31965052",
        "title": "Watch: Moment Irish mum and child have emotional reunion with paramedic who saved baby&#39;s life",
        "description": "Therese Siciliano, who is originally from Limerick but living in Tooting in London, visited the Wimbledon Ambulance Station with her daughter Fia to meet paramedic Katie Vaughan"
    },
    {
        "url": "https://news.sky.com/story/nearly-10bn-written-off-value-of-ppe-bought-during-covid-pandemic-13056349",
        "title": "Nearly £10bn written off value of PPE bought during COVID pandemic",
        "description": "Labour&#39;s shadow health secretary Wes Streeting said &quot;Rishi Sunak threw away taxpayers&#39; money as if it were confetti&quot; when chancellor, but the government insisted the decision to try to secure PPE for frontline health and care workers &quot;was right&quot;."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24075565.pm-insists-making-progress-despite-tory-warnings-electoral-massacre/",
        "title": "PM insists he is ‘making progress’ despite Tory warnings of electoral ‘massacre’",
        "description": "Rishi Sunak has told Conservatives fearing they face being electorally “massacred” that he is “making progress”, as he urged them to stick with his plan. Former Cabinet minister Sir Simon Clarke’s warning that the Tories face oblivion at the next election without a change in the Prime Minister was followed by fresh gloom from an adviser."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/1-million-pounds-tory-ministers-severance-pay-pm-chaos/",
        "title": "Almost £1 million spent on severance pay for Tory ministers during year of leadership chaos",
        "description": "Despite being in jobs for mere weeks as Boris Johnson left and Liz Truss briefly held the premiership, all left with at least £16,876"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/25/one-in-four-chance-russia-attack-uk-ally-nato/",
        "title": "One in four chance Russia will attack UK ally by 2025",
        "description": "Cabinet Office experts draw up National Risk Register as Tory MPS urge Government to reverse Army cuts and spend more on equipping military"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7126026",
        "title": "Politics latest: Sunak responds to plot to oust him - as MP warns of &#39;alarming&#39; change that may hit your travel plans",
        "description": "Commenting on the plot, our panellists James Starkie, former chief of staff to Priti Patel, and John McDonnell, <b>Labour</b> MP and former shadow chancellor, agree it is &quot;serious&quot;. Mr McDonnell says &quot;I think you are right, it is very serious&quot; - adding the public ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/police-targeted-miners-just-post-31969361",
        "title": "&#39;Police targeted miners just as the Post Office went for postmasters - now time for justice&#39;",
        "description": "Fire Brigades Union leader Matt Wrack is calling on the Government to overturn convictions from the 1984 Miners&#39; Strike and offer compensation"
    },
    {
        "url": "https://www.ft.com/content/d17425af-6b06-4593-9f13-60a6a38e948b",
        "title": "Humza Yousaf criticises Scottish government’s ‘poor’ handling of Covid inquiry requests",
        "description": "Scotland’s first minister’s testimony raises fresh concerns over transparency around official communication during pandemic"
    },
    {
        "url": "https://www.modernghana.com/news/1288082/intensify-education-on-climate-change-sustainable.html",
        "title": "Intensify education on climate change, sustainable economy — Media told",
        "description": "The Ghanaian media has been urged to intensify public education on issues related to climate change and sustainable development as the country works towards transitioning to a green economy. Speaking at a media sensitization workshop on Ghana 39;"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/25/idris-elba-argues-against-mandatory-prison-sentences-for-carrying-a-knife",
        "title": "Idris Elba argues against mandatory prison sentences for carrying a knife",
        "description": "Actor hails tightening of ban on zombie-style knives in England and Wales but says there is no ‘one size fits all’ solution"
    },
    {
        "url": "https://inews.co.uk/news/politics/george-osborne-secret-tory-leadership-plotters-2873697",
        "title": "Secret Tory plotters are ‘casting a shadow’ over the party, George Osborne says",
        "description": "Ex-chancellor says Conservative Britain Alliance is &#39;casting a big shadow&#39; over the party amid questions over Sunak&#39;s leadership"
    },
    {
        "url": "https://worcesterobserver.co.uk/news/worcester-news-tory-hopeful-voices-dismay-at-watered-down-plans-for-worcesters-scala-theatre/",
        "title": "Tory hopeful voices dismay at &#39;watered down&#39; plans for Worcester&#39;s Scala Theatre",
        "description": "The man bidding to succeed Robin Walker as Worcester’s MP said residents wanted a new theatre ‘not a white elephant’."
    },
    {
        "url": "https://www.scotsman.com/arts-and-culture/books/book-review-the-wild-men-by-david-torrance-4493437",
        "title": "Book review: The Wild Men, by David Torrance",
        "description": "David Torrance has written a thoroughly-researched but very readable account of Britain’s first Labour government, writes Allan Massie"
    },
    {
        "url": "https://www.churchtimes.co.uk/articles/2024/26-january/news/uk/timms-warns-labour-not-to-support-assisted-dying",
        "title": "Timms warns <b>Labour</b> not to support assisted dying",
        "description": "In an article published on the Labour List website on Wednesday, Sir Stephen writes that it is “myth” that support for the legalisation of assisted dying is a left-wing position “in contrast to uncompassionate, reactionary Conservatives who wish to condemn those suffering to undignified deaths”."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-trap-reverse-tax-cuts-slash-public-services-2874208?ico=related_stories",
        "title": "<b>Labour</b>’s spending trap: reverse Tory tax cuts or slash public services",
        "description": "Shadow Chancellor Rachel Reeves has rejected calls to raise taxes in order to pay for higher spending, other than a small number of specific tax increases such as imposing VAT on private school fees. She said last week: “I would like taxes to be lower on working people.”"
    },
    {
        "url": "https://www.thenational.scot/politics/24075815.let-humza-yousaf-goad-keir-starmer-making-look-bad/",
        "title": "Let Humza Yousaf goad Keir Starmer into making himself look bad",
        "description": "AS a dedicated supporter of independence, I would like to suggest to Brian Lawson (Letters, Jan 23) that Humza Yousaf’s offer of cooperation"
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/24075442.newquay-cornwall-council-increase-precept-27/",
        "title": "Newquay, Cornwall, council to increase precept by 27%",
        "description": "However, <b>Labour</b> councillor Stephen Hick, who represents Newquay Trenance ward, has called it “a cruel and unjustifiable increase”. He said: “When added to the Cornwall Council increase of approximately £87 the average household in Newquay will be ..."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-councillor-embarrassed-towns-obscene-163658306.html",
        "title": "<b>Labour</b> councillor &#39;embarrassed&#39; by town&#39;s &#39;obscene and cruel&#39; 27% tax increase",
        "description": "However, <b>Labour</b> councillor Stephen Hick, who represents Newquay Trenance ward, has called it “a cruel and unjustifiable increase”. <b>Labour</b> councillor Stephen Hick, who represents Newquay Trenance ward, has called it “a cruel and unjustifiable increase ..."
    },
    {
        "url": "https://uk.news.yahoo.com/mystery-surrounds-suspension-lewisham-councillor-122520237.html",
        "title": "Mystery surrounds suspension of Lewisham councillor from <b>Labour</b> Party",
        "description": "Mystery surrounds the suspension of a South London councillor from the <b>Labour</b> Party as residents tried to get answers at a council meeting. Lewisham councillor Hau-Yu Tam has been under investigation by the party’s governance unit since last year."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/25/starmer-vows-labour-get-grip-on-knife-crime",
        "title": "Starmer vows that <b>Labour</b> will ‘get a grip’ on knife crime",
        "description": "Leader proposes taking steps to reduce availability of ‘zombie’ knives and creating bespoke plans for all offenders Keir Starmer has promised to “get a grip” on soaring knife crime as he announced that a <b>Labour</b> government would bring in a bespoke ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12503759.tory-msp-criticised-bid-westminster-seat/",
        "title": "Tory MSP criticised over bid for Westminster seat",
        "description": "<b>Labour</b> has been accused of peddling &quot;shoddy politics of the worst kind&quot; after branding David Cameron a hypocrite over Tory MSP John Lamont’s bid to hold a dual mandate and become an MP at the next General Election. Earlier this week, local Tories chose ..."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12425235.new-cash-green-energy-hub/",
        "title": "New cash for green energy hub",
        "description": "First Minister Alex Salmond yesterday announced investment worth £2.6m in Aberdeen&#39;s Scottish European Green Energy Centre (SEGEC) to strengthen Scotland&#39;s position as leader in sustainable energy projects but the <b>Labour</b> energy spokesman described the ..."
    },
    {
        "url": "https://www.birminghammail.co.uk/black-country/council-defends-over-inflation-rent-28513609",
        "title": "Council defends &#39;over inflation&#39; rent increase and says &#39;lot less&#39; than private sector",
        "description": "An increase of 7.7 per cent to social housing rents in Wolverhampton has been approved by council bosses, sparking anger from opposition leaders who claim the rise will have a detrimental effect on the livelihood of families already struggling to feed their children."
    },
    {
        "url": "https://inews.co.uk/news/politics/zombie-knives-illegal-uk-ban-2873294?ITO=msn",
        "title": "Are zombie knives illegal? How loopholes have thwarted 2016 ban",
        "description": "The Offensive Weapons Act, brought in under Sir John Major’s Conservative government, banned the sale of knives to anyone under 16. It also made it an offense to carry a knife on school premises, but a blade under 3 inches without a cutting edge was still considered legal under the legislation."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/watch-highland-msps-baffled-by-yousafs-response-to-healthc-340278/",
        "title": "WATCH: Highland MSPs baffled by Yousaf&#39;s response to healthcare investment halt",
        "description": "Labour and Tory MSPs slam First Minister for avoiding responsibility for Scottish Government decisions and again blaming Westminster."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/25/reform-uk-support-surges-to-record-high/",
        "title": "Reform UK support surges to record high",
        "description": "Reform UK is more popular than at any point in its history, according to opinion polling, which shows 13 per cent of Britons would vote for the party if the general election was held now."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/pm-insists-he-is-making-progress-despite-tory-warnings-of-electoral-massacre-367569/",
        "title": "PM insists he is ‘making progress’ despite Tory warnings of electoral ‘massacre’",
        "description": "Rishi Sunak has told Conservatives fearing they face being electorally “massacred” that he is “making progress&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-york-north-yorkshire-68088577",
        "title": "York city council agrees tax, rents and parking charge increases",
        "description": "In addition to the council tax increase, rents will go up by an average of 7.7% and motorists will have to pay an extra £2 for a day&#39;s parking in the city&#39;s council-run car parks - taking the cost to £20. Officials said over the next four years the authority would see some of the &quot;most significant financial challenges&quot; it had ever experienced."
    },
    {
        "url": "https://morningstaronline.co.uk/article/blair-and-hague-push-sale-nhs-records-private-firms",
        "title": "Blair and Hague push for sale of NHS records to private firms",
        "description": "TONY BLAIR and William Hague came under fire today after they pushed the sale of NHS medical records to private firms. In a joint report, the former political rivals called for the creation of a new NHS data trust “to capitalise on the opportunities of health data” which could be treated as a “competitive asset.”"
    },
    {
        "url": "https://www.newstatesman.com/politics/scotland/2024/01/nicola-sturgeon-is-still-haunting-humza-yousaf",
        "title": "<b>Labour</b> must improve relations with Europe",
        "description": "Not for the first time, Nicola Sturgeon stole Humza Yousaf’s thunder. Unlike the First Minister, his predecessor wasn’t even in the Covid inquiry room today (25 January). But that didn’t matter – Sturgeon’s WhatsApp messages with her chief of staff Liz Lloyd were, and that was quite enough."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/zombie-knives-ban-knife-crime-uk-september-b1134817.html",
        "title": "No 10 defends September date for zombie-style blades ban",
        "description": "Labour has called the ban ‘too little, too late’ and promised instead a wider crackdown on the availability of dangerous knives."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/mancunian-way-time-become-player-28511618",
        "title": "The Mancunian Way: Time to become a player",
        "description": "We’re diving headfirst into the world of Rochdale politics today after <b>Labour</b> confirmed their shortlist for the upcoming by-election - with one surprise contender. It follows the death of the <b>Labour</b> MP Sir Tony Lloyd, who passed away on January 17 after ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tony-blair-william-hague-nhs-british-labour-b1134694.html",
        "title": "Former political rivals call for sale of NHS data to drive AI treatment",
        "description": "Mr Blair, the former <b>Labour</b> prime minister, and the ex-Conservative leader have set out more than 40 recommendations on regulation and state support to help the UK stay at the forefront of growth in biotechnology and artificial intelligence. They say a ..."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/25/why-is-knife-back-in-the-news-and-what-is-being-proposed?ref=upstract.com",
        "title": "Why is knife crime back in the news and what is being proposed?",
        "description": "As Valdo Calocane is sentenced for manslaughter of three people, UK political parties unveil plans to stem use of knives"
    }
]