[
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-sinking-feeling-58-mps-32156072",
        "title": "&#39;Tories sinking feeling as 58 MPs announce plans to abandon Conservative ship&#39;",
        "description": "Some 58 Tory MPs have already announced they are quitting next time around but the figure could top 100 – by some counts even 150"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/markets/article-13097747/Oil-gas-giants-crisis-talks-Labours-windfall-tax.html",
        "title": "Oil and gas giants in crisis talks over <b>Labour</b>&#39;s windfall tax",
        "description": "Oil and gas bosses will attend crisis talks this week over <b>Labour</b>&#39;s plan to extend the windfall tax. Industry group Offshore Energies UK (OEUK) said <b>Labour</b> leader Sir Keir Starmer&#39;s policy would be a &#39;hammer blow&#39;. It had previously warned it could cost ..."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/bristol-iopc-independent-neighbourhood-labour-b1139899.html",
        "title": "Woman arrested on suspicion of murder after three children found dead in Bristol",
        "description": "Avon and Somerset Police officers attended a concern for welfare call in Blaise Walk, in Sea Mills, on Sunday at around 12.40am."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13098335/LORD-AUSTIN-Im-driven-calling-Hamas-Islamist-murderers.html",
        "title": "LORD AUSTIN: How I&#39;m being driven out for calling Hamas &#39;Islamist murderers&#39;",
        "description": "I was shocked to learn on Friday that I had been suspended after a campaign organised by political opponents, extremists and an online mob driven by woke ideology."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/i-call-keir-1001-election-32155887",
        "title": "&#39;I will call Keir at 10.01 on election night to make sure the North gets what it deserves&#39;",
        "description": "Today, as he looks forward to Keir Starmer achieving a similar election triumph for <b>Labour</b>, Steve is the Liverpool Metro Mayor and has power and influence – which he intends to use. He says: “We’re trying to schedule a call in to Keir for one minute ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/national/sunak-warned-against-playing-footsie-with-farage-and-reform-uk-100315/",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/rochdale-by-election-referendum-gaza/",
        "title": "Rochdale by-election is referendum on Gaza, says Muslim charity boss",
        "description": "George Galloway, former <b>Labour</b> MP and the Workers Party of Britain candidate for Rochdale, is running on a pro-Palestine ticket Credit: PA/James Speakman The Rochdale by-election is a “referendum on Gaza”, the boss of a Muslim youth organisation has said."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "Rishi Sunak warned against &#39;playing footsie&#39; with Nigel Farage and Reform UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/baby-born-car-after-mum-28657540",
        "title": "Baby born in car after mum in <b>labour</b> gets struck in traffic jam",
        "description": "Baby Rome was born in the passenger seat of his mum&#39;s car after heavy traffic held them up getting to hospital"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/chris-patten-prime-minister-nigel-farage-labour-neil-kinnock-b1139917.html",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak has been warned against “playing footsie” with Reform UK following two bruising by-election defeats. The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party."
    },
    {
        "url": "https://www.thetimes.co.uk/article/labour-vows-to-fully-ban-fox-hunting-8q5c0gjlc?ilc=timesradio:morefromthetimes",
        "title": "<b>Labour</b> vows to fully ban fox hunting",
        "description": "Labour has vowed to eliminate fox hunting within its first term as the party insists it is moving on from a “self-satisfied urban mindset” to win over rural voters, after new polls show that the majority of voters in the countryside support a ban on the sport."
    },
    {
        "url": "https://www.varsity.co.uk/news/27118",
        "title": "Alastair Campbell: ‘I felt like I didn’t really belong’ at Cambridge",
        "description": "Political strategist Alastair Campbell has revealed that he felt “out of place” and suffered from anxiety during his time at Cambridge."
    },
    {
        "url": "https://www.dailymail.co.uk/sport/football/article-13098215/SPORTS-AGENDA-Man-United-Dan-Ashworth-Labour-candidate-Burnley-Danny-Drinkwater.html",
        "title": "SPORTS AGENDA: Man United may have to share Dan Ashworth, disgraced <b>Labour</b> candidate causes Burnley a headache... while Danny Drinkwater kicks off a row with his neighbours",
        "description": "The former FA director of elite development is set to join the Ineos revolution as sporting director in the coming days, although there will be a period of gardening leave."
    },
    {
        "url": "https://www.theguardian.com/news/2024/feb/18/corrections-and-clarification1",
        "title": "Corrections and clarification",
        "description": "In the Air Tonight"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/rochdale-by-election-referendum-gaza/?n=@",
        "title": "Rochdale by-election is referendum on Gaza, says Muslim charity boss",
        "description": "Mohammed Shafiq, CEO of the Ramadhan Foundation, says issue of Palestine will be ‘really powerful’ in the contest"
    },
    {
        "url": "https://www.channel4.com/news/starmer-calls-for-ceasefire-that-lasts-in-gaza",
        "title": "Starmer calls for ‘ceasefire that lasts’ in Gaza",
        "description": "For months now domestic politics have been unable to escape Gaza, especially when it comes to the issue of a ceasefire. But the language has evolved. Sir Keir Starmer is now calling for a “ceasefire that lasts” and must “happen now”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/general-election-conservative-tory-boris-johnson-leadership/",
        "title": "Tory Party under Boris Johnson could regain votes of ‘lost Conservatives’",
        "description": "Among the “lost Conservatives”, who said they won’t vote Tory at the next election but don’t know who to vote for, 52 per cent said they would vote for Mr Johnson over Sir Keir. This is compared to 39 per cent saying they would vote for the current Prime Minister over the Labour leader."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868055/Pollster-john-curtice-Labour-government",
        "title": "Pollster John Curtice predicts &#39;trouble&#39; for <b>Labour</b> within months of getting keys to No10",
        "description": "A renowned political scientist predicts that <b>Labour</b> will be “in trouble” within a year and a half of forming the next Government if they win the general election. Sir Keir Starmer is widely predicted to be entering No10 following the next general ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-sanction-russians-navalny-putin-2912636?ico=related_stories",
        "title": "<b>Labour</b> would sanction more Russians on Navalny ‘list’ of Putin henchmen",
        "description": "&quot;The cruel death of Alexey Navalny at the hands of Putin’s corrupt system must finally motivate action,&quot; David Lammy tells i"
    },
    {
        "url": "https://www.thenational.scot/news/24127410.home-office-turning-blind-eye-exploitation-scottish-farms/",
        "title": "Home Office ‘turning blind eye’ to exploitation in Scottish farms",
        "description": "And the Home Office has been accused of “turning a blind eye” to the issue by the SNP for not releasing or compiling Scotland-specific data – from how many workers on the visa are in Scotland to where they work – which the party called “unacceptable”."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-special-relationship-starmer-trump-2912536",
        "title": "<b>Labour</b> moves to protect ‘special relationship’ after Starmer swipe at Trump",
        "description": "Labour has pledged to work with “whomever is in the White House ” following the next US Presidential election after Sir Keir Starmer took a veiled swipe at Donald Trump."
    },
    {
        "url": "https://www.thesun.co.uk/motors/25941784/punished-council-charges-park-outside-own-homes/",
        "title": "‘We shouldn’t be punished’, drivers cry as cash-strapped council charges £50 to park outside their own homes",
        "description": "A LABOUR council has waged war on motorists by hiking the cost of parking permits by more than 500%. Residents living under the control of Kirklees Council in West Yorkshire currently pay £15 to"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868054/rachel-reeves-labour-gaza-hamas-leeds",
        "title": "Rachel Reeves flees from furious voter after she is ambushed on campaign trail",
        "description": "Sir Keir Starmer has consistently refused to back the idea of a ceasefire in Gaza without guarantees that it would hold."
    },
    {
        "url": "https://www.itv.com/watch/news/changing-stance-starmer-calls-for-ceasefire-that-lasts-in-gaza-as-he-rallies-scottish-voters/s64v2kn",
        "title": "Changing stance? Starmer calls for &#39;ceasefire that lasts&#39; in Gaza as he rallies Scottish voters",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://news.sky.com/story/tories-think-theyve-spotted-a-labour-weakness-and-are-scouring-for-opportunities-13075189",
        "title": "Tories think they&#39;ve spotted a <b>Labour</b> weakness - and are scouring for opportunities",
        "description": "The Conservative campaign is seeking Labour candidates&#39; comments about Israel and Gaza following the suspension of two MP-hopefuls last week after their comments about the Middle East."
    },
    {
        "url": "https://www.thetimes.co.uk/article/why-i-dont-buy-sarwars-conversion-to-tax-cutting-g6zqsnchk",
        "title": "Why I don’t buy Sarwar’s conversion to tax cutting",
        "description": "Voters don’t follow the ins and outs of fiscal policy, let alone the shifts and turns of election promises, though. And why should they? Much of it is hogwash and spin. People have enough on their minds managing their ever-shrinking family budgets."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/opinion/24121411.lack-council-tax-reform-slammed-labour-msp-katy-clark/",
        "title": "Lack of council tax reform slammed by <b>Labour</b> MSP Katy Clark",
        "description": "THE Scottish Government has now passed Stage 1 of its budget for the next year. Incredibly, ministers have had the gall to describe it"
    },
    {
        "url": "https://www.hamhigh.co.uk/news/24118322.cllr-linda-chung-complaints-made-camden-council/",
        "title": "Cllr Linda Chung on complaints made to Camden Council",
        "description": "Those from the Chinese and South East Asia diaspora may be celebrating the Lunar New Year this week, but this can also be an anxious time for many as we anticipate the forthcoming household utilities bills and council tax. The council is in the process ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/b/war-or-peace-decison-time-starmer",
        "title": "War or peace: decison-time for Starmer",
        "description": "DECISION-TIME looms for Sir Keir Starmer as Scottish Labour united at the weekend to call for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68330465",
        "title": "Post Office scandal: Kemi Badenoch hits back at Henry Staunton",
        "description": "The government says it &quot;utterly refutes&quot; claims by the Post Office&#39;s former chairman that he was ordered to delay compensation payments to victims in the Horizon scandal. Henry Staunton told the Sunday Times he was given instructions to &quot;stall&quot; payments ahead of the election."
    },
    {
        "url": "https://www.scotsman.com/news/politics/labour-eyes-uk-eu-security-pact-amid-fresh-concerns-over-trump-return-4523173",
        "title": "<b>Labour</b> eyes UK-EU security ‘pact’ amid fresh concerns over Trump return",
        "description": "Starmer sets out ‘unshakeable commitment’ to Nato amid concerns over impact of ex-president’s return to White House"
    },
    {
        "url": "https://www.bbc.com/news/av/uk-politics-68333327",
        "title": "Starmer: Gaza ceasefire &#39;must happen now&#39;",
        "description": "Labour leader Sir Keir Starmer has called for a &quot;ceasefire that lasts&quot; in the Israel-Gaza conflict, during a speech at the Scottish Labour conference in Glasgow. His remarks come a day after the conference passed a motion calling for an immediate ceasefire in Gaza."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/tv/real-life-bafta-host-david-28634077",
        "title": "Real life of Bafta host David Tennant - why he left Doctor Who, real name and famous wife",
        "description": "David Tennant found his way into the nation&#39;s hearts as Doctor Who. The Scottish actor has been on screens for more than 20 years. On Sunday (February 18), he&#39;ll join the elite group of actors to have presented the British Academy of Film and Television Awards,"
    },
    {
        "url": "https://morningstaronline.co.uk/article/b/scottish-labour-rejects-motion-single-sex-spaces",
        "title": "Scottish <b>Labour</b> rejects motion calling for single-sex spaces",
        "description": "SCOTTISH LABOUR delegates rejected a motion calling for single-sex spaces at its Glasgow conference yesterday."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/24127418.two-police-officers-first-responder-shot-dead-scene-domestic-call/",
        "title": "Two police officers and a first responder shot dead at scene of domestic call",
        "description": "Law Enforcement <b>Labour</b> Services represents rank-and-file officers and the supervisors of the Burnsville Police Department. The organisation’s executive director, Jim Mortenson, said in a statement: “Our thoughts and prayers are with the family of the ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/labour-seeking-snp-deal-to-avoid-new-gaza-ceasefire-rebellion?ref=todayheadlines.live",
        "title": "<b>Labour</b> seeking SNP deal to avoid new Gaza ceasefire rebellion",
        "description": "Party hopes for compromise wording after previous SNP motion saw 56 MPs defy Keir Starmer <b>Labour</b> is hoping to defuse a fresh crisis over Keir Starmer’s cautious stance on Gaza by rewording a Scottish National party motion calling for an immediate ceasefire."
    }
]