[
    {
        "url": "https://www.lbc.co.uk/news/water-bosses-bonus-block-sewage-spills/",
        "title": "Water company bosses face bonus ban over illegal sewage spills which taint British beaches and rivers",
        "description": "The new rules will come into affect from April at the start of the new financial year. The policy follows campaigning from <b>Labour</b> and the Liberal Democrats who have been calling for this change for months on end. In the last four years, bosses of water ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/dad-who-binned-275m-bitcoin-32102118",
        "title": "Dad who binned £275m Bitcoin hard drive reveals he wants to sue council for £1billion",
        "description": "James Howells could bankrupt Newport City Council, he says, following his 10-year battle with the Labour-controlled authority to retrieve a hard drive thought to have been chucked in a tip"
    },
    {
        "url": "https://www.newelectronics.co.uk/content/blogs/the-need-for-transformational-change",
        "title": "The need for transformational change",
        "description": "Life is not without risk, so why is it that this generation of politicians seem incapable of framing a debate around the need for investment?"
    },
    {
        "url": "https://www.bbc.com/news/business-68270068",
        "title": "Water company bosses could see bonuses stopped over sewage spills",
        "description": "Executives at water companies could lose their bonuses in future if the firm they run causes environmental damage, like letting illegal sewage spills pollute a beach or river. Environment Secretary Stephen Barclay said it was time water company bosses &quot;took responsibility&quot;."
    },
    {
        "url": "https://inews.co.uk/news/government-set-to-block-bonuses-for-chiefs-of-water-firms-which-pollute-rivers-2901447?ico=related_article_inline",
        "title": "Government set to block bonuses for chiefs of water firms which pollute rivers",
        "description": "Environment Secretary Steve Barclay is set to block bonuses for bosses of UK water firms which are illegally polluting rivers, lakes and seas. The crackdown will start with bonuses paid out in the 2024-25 financial year from April."
    },
    {
        "url": "https://news.stv.tv/politics/choice-for-ipad-minister-michael-matheson-whether-to-take-13000-payout-says-new-health-secretary-neil-gray",
        "title": "Choice for iPad minister whether to take £13,000 payout, says new health sec",
        "description": "Michael Matheson resigned on February 8 after incurring £10,935 in data roaming charges on his iPad while on a family holiday."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071997/Labours-green-plans-40-000-farming-jobs-Wales-England.html",
        "title": "<b>Labour</b>&#39;s controversial green plans could cost 40,000 farming jobs if expanded from Wales to England",
        "description": "Steve Barclay, the Environmental Secretary has labelled Labour&#39;s controversial green plans &#39;ill thought-out&#39; - amid fears the policy could cost 40,000 farming jobs"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/deranged-donald-trump-no-friend-32102101",
        "title": "&#39;Deranged Donald Trump is no friend of Britain - he is a grave security threat&#39;",
        "description": "Boris Johnson rashly endorsed a Trump triumph as “what the world needs” with a caveat about still supporting Ukraine which is why it’s more important that Rishi Sunak and David Cameron break diplomati"
    },
    {
        "url": "https://www.thesun.co.uk/news/25871798/let-extremist-azhar-ali-rochdale-by-election-starmer-bigots/",
        "title": "No strong leader would let extremist Azhar Ali run in Rochdale by-election – Keir Starmer still embraces bigots",
        "description": "Labour liar IT is appalling that the lying extremist Azhar Ali remains a Labour member, let alone its Rochdale by-election candidate. He is precisely the sort of crank conspiracy theorist Keir"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68257375",
        "title": "Wellingborough: Calls for action on gangs at by-election debate",
        "description": "Calls for more visible policing and new initiatives to draw young people away from gangs have been heard in a BBC East Wellingborough by-election discussion. The town, facing a by-election on Thursday, is still haunted by the death of teenager Dylan Holliday, who was stabbed 13 times."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-azhar-ali-rochdale-election-offensive-israel-claims-b1138450.html",
        "title": "<b>Labour</b> Rochdale by-election candidate apologises for ‘deeply offensive’ Israel claims",
        "description": "A Labour by-election candidate has apologised for his “deeply offensive” comments, after he reportedly said Israel allowed Hamas to carry out its October 7 attack to provide grounds to invade Gaza."
    },
    {
        "url": "https://www.thesun.co.uk/news/25871329/election-clock-minute-midnight-time-rishi-tories-starmer-labour/",
        "title": "Election clock is at a minute to midnight but there is still time for Rishi and the Tories to avoid the iceberg",
        "description": "SOMETIMES when watching true-life disaster movies like Titanic or Gallipoli, it’s hard to suppress an absurd hope it might somehow turn out differently. All the victims need to do is wake up,"
    },
    {
        "url": "https://news.sky.com/story/labour-candidate-wrong-to-say-israel-allowed-7-october-attack-13069105",
        "title": "<b>Labour</b> candidate &#39;wrong&#39; to say Israel allowed 7 October attack",
        "description": "Remarks made by Azhar Ali have been branded &quot;warped&quot; and &quot;disgraceful&quot; by the Jewish community, which fears they could further fuel hostility, but with the deadline for nominations closed it is too late for the party to replace him."
    },
    {
        "url": "https://socialistworker.co.uk/features/what-are-the-lessons-from-south-africas-anti-apartheid-struggle-for-palestine/",
        "title": "What are the lessons from South Africa’s anti-apartheid struggle for Palestine?",
        "description": "Mass action defeated the apartheid government in South Africa. Can the same methods win against apartheid Israel?"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071817/Bonus-blockage-water-firm-bosses-companies-illegally-spill-sewage-disgust-26million-rewards-handed-past-four-years.html",
        "title": "Bonus blockage on water firm bosses whose companies illegally spill sewage after disgust over the £26million of rewards handed out over the past four years",
        "description": "The environment secretary, Steve Barclay, is to block payouts to executives of firms that are polluting rivers, lakes and seas, starting with bonuses in the 2024-25 financial year from April."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/polluting-water-company-chiefs-bonuses-to-be-blocked-110310/",
        "title": "Polluting water company chiefs’ bonuses to be blocked",
        "description": "Environment Secretary Steve Barclay will ban bosses of water firms that commit criminal acts of water pollution from pocketing payouts."
    },
    {
        "url": "https://news.sky.com/video/labour-candidate-will-still-stand-in-by-election-despite-disgraceful-comments-13069792",
        "title": "<b>Labour</b> candidate will still stand in by-election despite &#39;disgraceful&#39; comments",
        "description": "With the deadline for nominations closed, it is too late for Labour to replace him in Rochdale&#39;s by-election"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-environment-secretary-ofwat-tim-farron-liberal-democrats-b1138482.html",
        "title": "Polluting water company chiefs’ bonuses to be blocked",
        "description": "Environment Secretary Steve Barclay will ban bosses of water firms that commit criminal acts of water pollution from pocketing payouts."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1865575/water-sewage-pollution-scandal-bonus-ban",
        "title": "‘Insulting’ fat cat bonuses at polluting water firms could be banned after sewage scandal",
        "description": "Controversial incentives for bosses of polluting water firms could be blocked, says Environment Secretary Steve Barclay."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/water-firm-bosses-lose-bonuses-32101393",
        "title": "Water firm bosses to lose bonuses if they dump sewage in sea as Tories pinch <b>Labour</b> plan",
        "description": "Ministers have been accused of being &#39;shamed&#39; into adopting Labour&#39;s plans to get tough on water companies after bosses raked in millions in bonuses despite sewage"
    },
    {
        "url": "https://www.thenational.scot/news/24112596.protest-called-amid-fury-holyrood-invitation-firms-arming-israel/",
        "title": "Protest called amid fury at Holyrood invitation to firms arming Israel",
        "description": "PRO-PALESTINE action groups are set to protest outside the Scottish Parliament after arms companies supplying Israel with bombs have been invited"
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-hunt-may-raised-expectations-much-2901325?ico=related_stories",
        "title": "Sunak and Hunt may have raised expectations too much",
        "description": "With just over three weeks until the Budget, it looks like any cut as sweeping as those in the Autumn Statement is probably off the table"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/labour-rochdale-by-election-israel-hamas-wellingborough-kingswood-b2494352.html",
        "title": "Will the Israel-Hamas war be a factor in the Rochdale by-election for <b>Labour</b>?",
        "description": "Both Labour and the Conservatives face tests over their policies and the popularity of their leaders during this month’s three big by-elections, writes Zoe Grunewald"
    },
    {
        "url": "https://www.ft.com/content/d5c9e07b-1278-4815-a9e9-203642a83e09",
        "title": "Now is the time to put people before robots",
        "description": "Everything? National income in any country can be divided into the part that goes to owners of capital and the part that goes to owners of labour. Decades ago, economists such as Nicholas Kaldor believed that this division of national income between labour and capital was fixed for eternity."
    },
    {
        "url": "https://www.thetimes.co.uk/article/clean-it-up-campaign-one-year-anniversary-935scqps2",
        "title": "Clean It Up campaign one year on: what progress has been made?",
        "description": "As we reach the first anniversary of our fight to tackle water pollution, we review any steps that have been taken to overhaul the damage done to UK waterways"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68268563",
        "title": "Bristol regeneration project &#39;won&#39;t lead to gentrification&#39;",
        "description": "Bristol City Council has promised to keep community and cultural spaces protected as part of the Frome Gateway regeneration.The project is expected to last 15 years, covering an area that includes Houlton Street, Wade Street, Wellington Road, Pennywell Road and Riverside Park."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865547/Defence-Secretary-Grant-Shapps-goes-to-war-on-poisonous-woke-nonsense",
        "title": "Defence Secretary Grant Shapps goes to war on &#39;poisonous&#39; woke nonsense",
        "description": "Exclusive: The Cabinet Minister warned the &quot;drumbeat of those who despise Britain&quot; is failing the army and the public."
    }
]