[
    {
        "url": "https://uk.news.yahoo.com/tory-minister-mike-freer-quits-230643252.html",
        "title": "Tory Minister Mike Freer Quits Politics Over Safety Fears",
        "description": "The MP said he has received &quot;several serious threats to my personal safety&quot;, including a suspected arson attack on his constituency office."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24089072.labour-party-business-starmer-tell-company-chiefs/",
        "title": "<b>Labour</b> is ‘party of business’, Starmer to tell company chiefs",
        "description": "The Labour leader and shadow chancellor Rachel Reeves will seek to woo senior company executives and investors at event in London."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/sir-keir-starmer-promises-to-fix-unprecedented-stagnation-as-labour-targets-business-voters/",
        "title": "Sir Keir Starmer promises to &#39;fix unprecedented stagnation&#39; as <b>Labour</b> targets business voters",
        "description": "Sir Keir Starmer will promise to &quot;fix unprecedented stagnation&quot; in the growth of productivity in the UK, as he unveils <b>Labour</b>&#39;s &quot;plan for business&quot;. The party leader and his shadow chancellor, Rachel Reeves, will host hundreds of business leaders and ..."
    },
    {
        "url": "https://news.sky.com/story/sir-keir-starmer-promises-to-fix-unprecedented-stagnation-as-labour-targets-business-voters-13060810",
        "title": "Sir Keir Starmer promises to &#39;fix unprecedented stagnation&#39; as <b>Labour</b> targets business voters",
        "description": "The leader will launch the party&#39;s &quot;plan for business&quot; on Thursday in front of hundreds of firms in central London."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-opposition-labour-party-pledge-223300546.html",
        "title": "UK opposition <b>Labour</b> party pledge productivity fix in latest pitch to business",
        "description": "Britain&#39;s opposition Labour Party will pledge to fix Britain&#39;s stagnating productivity at a conference for businesses on Thursday, its latest charm offensive to companies and investors ahead of a national election expected this year."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/theyre-saying-daughters-lives-worth-32015061",
        "title": "&#39;They&#39;re saying our daughters&#39; lives worth less than those killed on streets - they deserve justice&#39;",
        "description": "Justice for our Daughters – to help the bid to stop domestic violence killers being jailed for a decade less than other murderers"
    },
    {
        "url": "https://5pillarsuk.com/2024/01/31/disgusting-cowards-labour-run-london-council-disrupted-over-gaza/",
        "title": "“Disgusting cowards!” <b>Labour</b>-run London council disrupted over Gaza",
        "description": "A <b>Labour</b>-run Camden Council meeting in London was disrupted on Monday by protesters and residents over the <b>Labour</b> Party’s stance on Israel’s war on Gaza. The protesters say party leader Keir Starmer justifying Israel’s collective punishment of two ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/mike-freer-quits-conservative-minister-safety_uk_65babffae4b0102bd2d79584",
        "title": "Tory Minister Mike Freer Quits Politics Over Safety Fears",
        "description": "The MP said he has received &quot;several serious threats to my personal safety&quot;, including a suspected arson attack on his constituency office."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/5-liverpool-taxi-charge-scrapped-28547798",
        "title": "£5 Liverpool taxi charge scrapped as &#39;hefty&#39; fare rise goes ahead",
        "description": "The current rise was described as something that &quot;works for the public and gives taxi drivers an earning they deserve.&quot;"
    },
    {
        "url": "https://www.heraldscotland.com/news/12270697.electricity-and-devolution/",
        "title": "Electricity and devolution",
        "description": "I ATTENDED the public inquiry at Ayr into the proposed interconnector. It became clear that it was being promoted by Scottish Power so that"
    },
    {
        "url": "https://www.fxstreet.com/analysis/fed-review-in-a-risk-management-mode-202401312157",
        "title": "Fed review: In a risk management mode",
        "description": "The Fed maintained its monetary policy unchanged, as widely expected. Powell signalled optimism on inflation but pushed back on March cut."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/31/tory-mp-mike-freer-quit-politics-death-threats-israel-gaza/",
        "title": "Tory MP Mike Freer to quit frontline politics after death threats",
        "description": "Justice minister was targeted with suspected arson attack and has been subject to intimidation over his pro-Israel views"
    },
    {
        "url": "https://uk.news.yahoo.com/laid-off-java-blend-staff-214720351.html",
        "title": "Laid-off Java Blend staff say they were terminated for union drive, but company disputes it",
        "description": "Employees recently laid-off by a north-end Halifax coffee shop say they were illegally terminated for trying to start a union, but the company&#39;s owners say financial difficulties are to blame.On Wednesday,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861875/Mike-Freer-Rishi-Sunak-elections-quit-politics",
        "title": "Justice Minister Mike Freer to quit frontline politics over death threats",
        "description": "But he added: “You shouldn&#39;t really have to think, am I going to survive the day?” In the last decade, Sir David and <b>Labour</b> MP Jo Cox were both murdered in their constituencies. <b>Labour</b>&#39;s Stephen Timms was stabbed by an al Qaeda sympathiser in 2010 but ..."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/01/31/188161/",
        "title": "<b>Labour</b> says budget staves off threat of bankruptcy",
        "description": "<b>Labour</b> said that its proposals for a balanced budget will stave off the threat of bankruptcy for Brighton and Hove City Council. But newly published budget papers said that 186 posts may have to be deleted – one in five – although many of them were ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13030513/Archbishop-Canterbury-Justin-Welby-joins-forces-former-judge-Labour-peer-mission-derail-Rwanda-plan.html",
        "title": "Archbishop of Canterbury Justin Welby joins forces with a former top judge and a <b>Labour</b> peer in mission to derail Rwanda plan",
        "description": "The Archbishop is backing changes which would instead give the United Nations High Commissioner on Refugees (UNHCR) the final say on whether the east African nation is safe."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/31/labour-pledge-renationalising-rail-starmer-woos-business/",
        "title": "<b>Labour</b> pledges to push ahead with renationalising rail as Starmer launches drive to woo business",
        "description": "Shadow transport secretary says no compensation will be paid to operators when contracts lapse and network goes into public ownership"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1861664/fly-tipping-labour-towns",
        "title": "Fly-tipping three times more likely in <b>Labour</b>-run towns new data shows",
        "description": "Labour-run councils reported a shocking average of 6,843 fly-tipping incidents as opposed to 2,428 in Tory councils."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/uk/labour-is-party-of-business-starmer-to-tell-company-chiefs/a898282473.html",
        "title": "<b>Labour</b> is ‘party of business’, Starmer to tell company chiefs",
        "description": "Sir Keir Starmer is set to pitch Labour as the party to reverse the UK’s slagging growth rates with a major address to hundreds of business leaders."
    },
    {
        "url": "https://www.thetimes.co.uk/article/rare-tory-success-offers-model-for-the-future-sccvlsv20",
        "title": "Rare Tory success offers model for the future",
        "description": "A steelworks site has been transformed by private investment freed from bureaucratic meddling. Labour should take note"
    },
    {
        "url": "https://www.thetimes.co.uk/article/faragist-masterplan-will-go-horribly-wrong-720bzv59w",
        "title": "Faragist masterplan will go horribly wrong",
        "description": "Disaffected Tories tempted to back Reform UK risk handing Labour a 200-seat majority and untrammelled power"
    },
    {
        "url": "https://inews.co.uk/news/politics/nicola-sturgeon-reputation-snp-votes-covid-betrayal-2883150?ico=related_article_inline",
        "title": "Nicola Sturgeon loses reputation and SNP votes after Covid ‘betrayal’",
        "description": "Labour hopes to take a number of seats from Humza Yousaf’s party in this year’s general election, after being left with one in 2019"
    },
    {
        "url": "https://www.fxstreet.com/news/forex-today-the-us-labour-market-comes-to-the-fore-202401312041",
        "title": "Forex Today: The US <b>labour</b> market comes to the fore",
        "description": "EUR/USD challenged YTD lows in the sub-1.0800 region following the Fed gathering, extending at the same time its multi-session consolidative theme. In the euro docket, the final Manufacturing PMI is due on Thursday, along with the flash Inflation Rate in ..."
    },
    {
        "url": "https://news.stv.tv/west-central/calls-for-exhibition-recognising-billy-connolly-to-be-held-in-glasgow-at-kelvingrove-art-gallery",
        "title": "Calls for exhibition recognising Billy Connolly to be held in Glasgow",
        "description": "A Billy Connolly exhibition should be held at Kelvingrove Art Gallery and Museum to recognise his contribution to Glasgow. Councillor George Redmond, the city’s Labour group leader, wants Glasgow Life — which runs the city’s museums on behalf of the council — to consider a display on the Big Yin."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13027523/North-Korea-camp-documentary-showing-defectors.html",
        "title": "Tortured, starved and crushed to death under trees in hell-hole North Korean <b>labour</b> camp: Horrific details of Kim Jong-un&#39;s gulags emerge in new documentary showing defectors ...",
        "description": "Escape from North Korea, harrowing footage reveals the desperate lengths people will go to to leave Kim Jong-un&#39;s regime."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/hunt-less-scope-for-tax-cuts-in-march-budget-than-in-the-autumn-109461/",
        "title": "Hunt: Less scope for tax cuts in March Budget than in the autumn",
        "description": "Jeremy Hunt said it is unlikely he will have “the kind of room that I had for those very big tax cuts” in the autumn statement. The Chancellor confirmed that he warned the Cabinet there is less scope for tax reductions in his March 6 Budget despite clamour within the Tory ranks for cuts to try to woo voters."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rachel-reeves-bankers-bonus-labour-starmer-b2487874.html?lid=f3e3db6717zu",
        "title": "Rachel Reeves sparks <b>Labour</b> backlash as she declares Starmer won’t cut bankers’ bonuses",
        "description": "Former leader Jeremy Corbyn joined left-wing <b>Labour</b> MPs in criticising the move – saying Sir Keir and Ms Reeves must appeal for support beyond “the already wealthy”. And Scottish <b>Labour</b> leader Anas Sarwar said he still believed it was wrong to lift ..."
    },
    {
        "url": "https://www.channel4.com/news/is-labour-watering-down-flagship-28bn-green-investment-plan",
        "title": "Is <b>Labour</b> watering down flagship £28bn green investment plan?",
        "description": "It’s time for the UK to embrace its bankers: that seems to be the idea behind <b>Labour</b>’s new plan for financial services. The Shadow chancellor, Rachel Reeves, told this programme she’s ready to champion the City: not least because it brings so much ..."
    },
    {
        "url": "https://socialistworker.co.uk/palestine-2023/croydon-palestine-campaigners-humiliate-labour-warmongers-david-lammy-and-alastair-campbell/",
        "title": "Croydon Palestine campaigners humiliate <b>Labour</b> warmongers David Lammy and Alastair Campbell",
        "description": "Pro-Palestine activists have been disrupting <b>Labour</b> Party events in Croydon, south London, with great success—showing that protesting works. David Lammy, <b>Labour</b>’s shadow foreign secretary, cancelled his trip to the West Croydon <b>Labour</b> Party launch on ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68155976.amp",
        "title": "Keir Starmer clashes with Rishi Sunak over Iceland worker&#39;s mortgage",
        "description": "The <b>Labour</b> leader said Phil, from Warrington, &quot;told me that his mortgage is going up by a staggering £1,000 a month&quot;, at Prime Minister&#39;s Questions. He said the PM &quot;just doesn&#39;t get how hard it is for millions of people across the country like Phil&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-middle-east-attack-2879497?ico=more_from_this_author",
        "title": "<b>Labour</b> urges restraint in Middle East following deadly attack on US base",
        "description": "<b>Labour</b> has urged “calm and restraint” in the Middle East to avoid a “full blown regional war” in the region after US soldiers were killed in a deadly air strike. The UK and US blamed Iran for the a drone attack on an American base in Jordan ..."
    }
]