[
    {
        "url": "https://www.kentonline.co.uk/news/national/i-understand-voters-frustrations-sunak-says-in-live-tv-grilling-110376/",
        "title": "I understand voters’ frustrations, Sunak says in live TV grilling",
        "description": "As peers in the House of Lords debated draft legislation aimed at sending asylum seekers to Kigali, one voter asked Mr Sunak why he was “so adamant” about the Rwanda policy “when public documentation shows it isn’t working and that it’s not going to work”."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/sunak-warns-reform-voters-put-starmer-number-10/",
        "title": "You will put Starmer in No 10, Sunak warns Reform voters",
        "description": "Credit: Matt Pover/GB News Rishi Sunak has told Reform UK supporters that they will put Sir Keir Starmer’s <b>Labour</b> Party into Number 10 unless they vote Conservative in a plea on live television. Answering questions from voters in County Durham on GB News ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/rochdale-by-election-labour-received-new-information-about-azhar-ali-before-withdrawing-support/",
        "title": "Rochdale by-election: <b>Labour</b> received &#39;new information&#39; about Azhar Ali before withdrawing support",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving new information about comments he is alleged to have made."
    },
    {
        "url": "https://5pillarsuk.com/2024/02/12/labour-party-withdraws-support-for-rochdale-candidate-azhar-ali/",
        "title": "<b>Labour</b> Party withdraws support for Rochdale candidate Azhar Ali",
        "description": "The <b>Labour</b> Party has withdrawn its support from its Rochdale by-election candidate Azhar Ali after mounting pressure from pro-Israel groups and individuals over his secretly recorded remarks suggesting Israel let the October 7 attacks happen so it could ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/starmers-public-sector-fat-cats-will-drag-us-down-gb5srvt0t",
        "title": "Starmer’s public-sector fat cats will drag us down",
        "description": "Labour’s plan to protect top workers from pensions raid shows an obsession with managerialism"
    },
    {
        "url": "https://www.thetimes.co.uk/article/class-war-is-back-in-fashion-for-labour-gnzgk79hl",
        "title": "Class war is back in fashion for <b>Labour</b>",
        "description": "Don’t dismiss them as dull technocrats, Starmer’s cabinet will be the most working class in years and unafraid to show it"
    },
    {
        "url": "https://www.thescottishsun.co.uk/sport/11968833/inside-scottish-labour-leader-anas-sarwar-leadership-jose-mourinho/",
        "title": "Inside Scottish <b>Labour</b> leader Anas Sarwar’s leadership style – inspired by legendary football manager",
        "description": "But Sarwar was accused by the SNP of being <b>Labour</b>’s “branch manager”, with the “real decisions” made in the Westminster “dug-outs”. The Scottish <b>Labour</b> leader said he “completely bought into the mindset” of the ‘Special One’."
    },
    {
        "url": "https://www.ft.com/content/4f24d958-7f73-430d-b069-2acc760b8842",
        "title": "Bank of England’s Andrew Bailey sees signs of ‘somewhat stronger ’ UK growth",
        "description": "Governor plays down upcoming economic data that is feared to show technical recession and deliver blow to Sunak"
    },
    {
        "url": "https://www.ft.com/content/73e64287-e84e-4933-ae88-12fcdcc5be35",
        "title": "<b>Labour</b> drops support for by-election candidate after Hamas-Israel claims",
        "description": "Party withdraws backing for Rochdale hopeful Azhar Ali after comments he made to newspaper over October 7 attack"
    },
    {
        "url": "https://www.lancashiretelegraph.co.uk/news/24115262.labour-withdraws-support-azhar-ali-israel-claims/",
        "title": "<b>Labour</b> withdraws support for Azhar Ali after Israel claims",
        "description": "Labour has withdrawn its support for Pendle&#39;s Azhar Ali as the Rochdale by-election candidate following criticism of remarks he made about Israel"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rochdale-byelection-azhar-ali-mp-israel-gaza-b1138734.html",
        "title": "Starmer withdraws support for Rochdale by-election candidate after &#39;deeply offensive&#39; anti-Israel rant",
        "description": "Labour finally acts after spending much of Monday trying to defend Azhar Ali - with party suspending him pending an investigation"
    },
    {
        "url": "https://www.blackpoolgazette.co.uk/news/politics/azhar-ali-labours-former-rochdale-by-election-candidate-criticised-by-preston-jewish-faith-leader-over-israel-attack-comments-4515579",
        "title": "Azhar Ali: <b>Labour</b>&#39;s former Rochdale by-election candidate criticised by Preston Jewish faith leader over Israel attack comments",
        "description": "A Jewish community leader in Lancashire says comments made by a senior county councillor alleging Israel deliberately allowed the 7th October terrorist attack have given fuel to “demons” on social media spreading other unsubstantiated claims about the state."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/streets-rochdale-labour-problem-28617781",
        "title": "On the streets of Rochdale <b>Labour</b> have a problem",
        "description": "The town has been caught up in controversy after Labour&#39;s former candidate who wants to be the next MP made &#39;deeply offensive&#39; comments about Israel - but there are other things occupying voters&#39; mind"
    },
    {
        "url": "https://socialistworker.co.uk/news/tory-part-crisis-unfolds/",
        "title": "Rishi Sunak’s week from hell",
        "description": "Possibility of rising inflation, drop in production, by-election defeats and opposition to Rwanda bill shows depth of Tory party crisis"
    },
    {
        "url": "https://www.channel4.com/news/labour-withdraws-support-for-rochdale-candidate-after-israel-comments",
        "title": "<b>Labour</b> withdraws support for Rochdale candidate after Israel comments",
        "description": "Labour has withdrawn its support for its candidate in the Rochdale by-election Azhar Ali after criticism of his remarks about Israel, a party spokesperson said."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-withdraw-support-rochdale-byelection-candidate-azhar-ali",
        "title": "<b>Labour</b> Withdraws Support For Rochdale By-Election Candidate Azhar Ali",
        "description": "Labour has withdrawn their support for Rochdale by-election candidate Azhar Ali, after widespread criticism of remarks he had made about Israel."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865978/rishi-sunak-keir-stamer-labour-conservatives-general-election",
        "title": "Rishi Sunak issues warning over <b>Labour</b> as Brits urged not to fall for Keir Starmer&#39;s &#39;con&#39;",
        "description": "Rishi Sunak vowed to fix the social care system, slash NHS waiting lists and continue to ease the cost of living crisis if the Tories win the next general election."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/rochdale-by-election-labour-withdraws-support-for-candidate-azhar-ali-after-antisemitism-remarks/",
        "title": "Rochdale by-election: <b>Labour</b> withdraws support for candidate Azhar Ali after &#39;antisemitism&#39; remarks",
        "description": "The Labour Party has withdrawn support for its candidate in the Rochdale by-election after receiving an official complaint over his antisemitic remarks."
    },
    {
        "url": "https://www.itv.com/watch/news/labour-withdraws-its-support-for-rochdale-by-election-candidate-following-israel-comments/5xl1m4p",
        "title": "<b>Labour</b> withdraws its support for Rochdale by-election candidate following Israel comments",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68280098?at_campaign=KARANGA&at_medium=RSS",
        "title": "<b>Labour</b> withdraws support for Rochdale candidate",
        "description": "Labour says it has “withdrawn support” for Rochdale by-election candidate Azhar Ali following his comments about Israel. The BBC understands Mr Ali has been suspended from the Labour Party pending an investigation. Labour said the decision was taken after &quot;new information about further comments&quot; made by Mr Ali came to light."
    },
    {
        "url": "https://news.sky.com/video/ex-bank-of-england-chief-economist-laments-labour-u-turn-on-28bn-green-pledge-13070329",
        "title": "Ex-Bank of England chief economist &#39;laments&#39; <b>Labour</b> U-turn on £28bn green pledge",
        "description": "Ex-Bank of England chief economist &#39;laments&#39; <b>Labour</b> U-turn on £28bn green pledge Speaking to Sky&#39;s Sophy Ridge, Andy Haldane said the original promise &quot;led the world&quot; in ambition, and would have benefitted Britain - both in achieving its net zero goals and stimulating growth."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/12/rogue-councillors-criticised-for-ignoring-voters/",
        "title": "Rogue councillors criticised for ignoring voters",
        "description": "Voters in Queen’s Park have been left frustrated after receiving either automated or standardised replies from their councillors. Councillor Chandni"
    },
    {
        "url": "https://uk.news.yahoo.com/labour-withdraws-support-rochdale-election-200359288.html",
        "title": "<b>Labour</b> Withdraws Support For Rochdale By-Election Candidate After Anti-Israel Comments",
        "description": "The Labour Party has withdrawn its support for Rochdale by-election candidate Azhar Ali after a backlash over his remarks about Israel, a party spokesperson has said. It comes after The Mail on Sunday reported the councillor allegedly said Israel deliberately allowed 1,400 people to be killed on its own soil on October 7."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?filterKeyEvents=false&page=with:block-65ca79138f08e47ce3f3166a",
        "title": "Rishi Sunak prepares for live public Q&amp;A on GB News",
        "description": "And we’re back. Eleni Courea has the latest on the <b>Labour</b> fallout, but stay tuned here for updates on Rishi Sunak’s interview on GB News. Thank you for following the liveblog this evening. We’ll now be pausing our live political coverage until Rishi ..."
    },
    {
        "url": "https://www.thenational.scot/news/24115240.labour-u-turns-support-rochdale-candidate-azhar-ali/",
        "title": "<b>Labour</b> U-turns on support for Rochdale candidate Azhar Ali",
        "description": "<b>LABOUR</b> has withdrawn its support for Rochdale by-election candidate Azhar Ali, following criticism of remarks he made about Israel. Ali had apologised after he was recorded suggesting in a meeting of the Lancashire <b>Labour</b> Party that Israel had taken the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/azhar-ali-labour-israel-rochdale-keir-starmer-b1138735.html",
        "title": "<b>Labour</b> withdraws support for Rochdale candidate after Israel claims",
        "description": "Mr Ali had apologised after he was recorded suggesting in a meeting of the Lancashire <b>Labour</b> Party that Israel had taken the October 7 Hamas assault as a pretext to invade Gaza. A party spokesperson said: “Following new information about further comments ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rod-stewart-gives-scathing-verdict-32088184?int_source=nba",
        "title": "Rod Stewart gives scathing verdict on the Tories and says <b>Labour</b> &#39;deserve a crack&#39;",
        "description": "The Do Ya Think I&#39;m Sexy? singer said: “Keir Starmer and <b>Labour</b> deserve a crack at it. If there was anyone else we could vote for, then maybe, but they should be given a shot. I live here [in the UK] now. I didn&#39;t used to. And I see what the ..."
    }
]