[
    {
        "url": "https://www.prnewswire.co.uk/news-releases/lundin-mining-pre-announces-items-impacting-the-fourth-quarter-2023-results-302047157.html",
        "title": "Lundin Mining Pre-Announces Items Impacting the Fourth Quarter 2023 Results",
        "description": "Items of significant impact in the fourth quarter 2023 are expected to include unaudited foreign exchange and trading gains on debt and equity investments supporting the capital funding for the Josemaria Project of approximately $19 million on a pre-tax basis and unaudited realized gains on foreign exchange and diesel derivative contracts of approximately $9 million on a pre-tax basis."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/justin-welby-rwanda-government-channel-archbishop-of-canterbury-b1135631.html",
        "title": "Rwanda Bill clears first Lords hurdle as Archbishop Of Canterbury issues warning",
        "description": "The Most Rev Justin Welby accused the Government of outsourcing the country’s ‘legal and moral responsibilities’."
    },
    {
        "url": "https://news.sky.com/story/rwanda-we-can-as-a-nation-do-better-says-archbishop-of-canterbury-as-bill-passes-latest-lords-hurdle-13059470",
        "title": "Rwanda: &#39;We can as a nation do better&#39;, says Archbishop of Canterbury as bill passes latest Lords hurdle",
        "description": "Justin Welby says plans to deport asylum seekers to the African nation is &quot;leading the nation down a damaging path&quot;. But peers nod the scheme through - for now."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/rachel-reeves-refuses-28bn-labour-green-investment-plan/",
        "title": "Reeves refuses to use £28bn figure while defending <b>Labour</b> green investment plan",
        "description": "In 2021, shadow chancellor promised that a Labour government would borrow £28bn a year for five years to fund green energy projects"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/29/tory-teesside-mayors-freeport-project-cleared-of-corruption/",
        "title": "Tory Teesside Mayor’s freeport project cleared of corruption",
        "description": "The Tory Mayor of Teesside Lord Houchen has been cleared of wrongdoing at a flagship freeport project in the north following an inquiry into claims of cronyism and corruption. A review into the finances of the Teesworks project, based on a former steelworks site in Redcar, found “no evidence” to support allegations of illegality."
    },
    {
        "url": "https://news.sky.com/story/no-corruption-at-teesworks-development-but-inquiry-finds-transparency-and-oversight-issues-13059602",
        "title": "No &#39;corruption&#39; at Teesworks development - but inquiry finds &#39;transparency and oversight&#39; issues",
        "description": "Questions were raised over the Tees Valley project on the site of the former Redcar Steelworks after private companies ended up owning 90% of the shares, even though hundreds of millions of taxpayer c"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/two-more-arrests-after-teenagers-28534577",
        "title": "Two more arrests after teenagers stabbed to death in Bristol",
        "description": "Police have arrested two more men after two teenage boys were stabbed to death in Bristol."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/beleaguered-rishi-sunak-on-a-wing-and-a-prayer-and-now-a-fasting-regime",
        "title": "Beleaguered Rishi Sunak on a wing and a prayer – and now a fasting regime",
        "description": "PM battling to salvage his party from predicted electoral obliteration but Tories carry on plumbing the depths"
    },
    {
        "url": "https://www.thesun.co.uk/news/25587624/railway-bosses-strike-bullies-claiming-bonuses-government-enforce-law/",
        "title": "Pathetic railway bosses give into strike bullies while claiming huge bonuses – why won’t the government enforce the law?",
        "description": "THE defeat of trade union militancy in the 1980s showed Margaret Thatcher at her most resolute. “You can never give in to blackmail. You can never give in to a strike that makes impossible"
    },
    {
        "url": "https://www.warringtonguardian.co.uk/news/national/24082750.investigation-bad-practice-agents-recruiting-overseas-students-launched/",
        "title": "Investigation into bad practice by agents recruiting overseas students launched",
        "description": "Universities minister Robert Halfon said he was ‘appalled’ by reports about the way international students are recruited at some universities."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-norfolk-68133873.amp",
        "title": "George Freeman quit as minister as he &#39;couldn&#39;t afford&#39; mortgage",
        "description": "He received £7,920 when he quit Boris Johnson&#39;s government in July 2022, before returning to his role as science minister under Mr Sunak, some 16 weeks later, according to <b>Labour</b> analysis. Ministers under the age of 65 are entitled to a loss-of-office ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mayor-andy-mcdonald-teesside-levelling-up-government-b1135617.html",
        "title": "Mayor: Inquiry sets out in black and white there is no corruption at Teesworks",
        "description": "Lord Houchen Concerns about the Teesworks project were previously raised by Middlesbrough’s then-<b>Labour</b> MP Andy McDonald in the Commons, who alleged “truly shocking, industrial-scale corruption” related to the scheme. Lord Houchen accused Mr McDonald ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-68121257?at_medium=RSS",
        "title": "Post Office scandal: Chairman Henry Staunton had to go as it &#39;wasn&#39;t working&#39; - Badenoch",
        "description": "Ms Badenoch said she removed him after concerns about Post Office governance and &quot;the entire business model&quot;. <b>Labour</b> called on the government to give more specific reasons for its decision. Mr Staunton left the role - which he had been appointed to in ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-slash-severance-pay-ministers-2876145?ico=more_from_this_author",
        "title": "<b>Labour</b> pledges to slash payouts for outgoing ministers after £1m government bill",
        "description": "<b>Labour</b> has pledged to slash the size of severance payouts for ministers leaving office after it emerged nearly £1m was spent in a year due to political churn. Ministers under the age of 65 are entitled to payments amounting to a quarter of their ..."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1861045/Jamie-Dornan-wife-Amelia-Warner-desert-island-discs-the-tourist",
        "title": "Jamie Dornan breaks down in tears as he speaks about marriage to wife Amelia Warner",
        "description": "The Tourist actor Jamie Dornan, who spoke on BBC Radio 4 show Desert Island Discs yesterday, has been married to his wife Amelia Warner since 2013."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24083004.sir-simon-clarke-says-andy-mcdonald-resign-middlesbrough-mp/",
        "title": "Sir Simon Clarke says Andy McDonald should resign as Middlesbrough MP",
        "description": "The MP for Middlesbrough should apologise and resign after Tees Valley Combined Authority was “cleared” of corruption and illegality,"
    },
    {
        "url": "https://www.grampianonline.co.uk/news/could-cast-iron-keith-bypass-pledge-be-scrapped-due-to-mo-340621/",
        "title": "Moray bypasses at risk of ‘more A96 backtracking’? Elgin councillors worry about outcome of A96 Corridor Review",
        "description": "MORAY councillors have raised concerns that &quot;cast iron&quot; pledge Elgin and Keith bypasses could be felled by &quot;more backtracking&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68133057",
        "title": "Rochdale by-election triggered after Sir Tony Lloyd&#39;s death",
        "description": "The <b>Labour</b> party has officially triggered the Rochdale by-election following the death of Sir Tony Lloyd. Sir Tony died on 17 January days after announcing he had an incurable form of leukaemia. Business in the House of Commons started with opposition ..."
    },
    {
        "url": "https://uk.news.yahoo.com/mp-resign-teesworks-corruption-claims-195014641.html",
        "title": "MP should resign after Teesworks corruption claims, Tory ex-minister says",
        "description": "“<b>Labour</b> want Teesworks to fail.” This was met with shouts of “nonsense” from the <b>Labour</b> MP for Stockton North, Alex Cunningham. Sir Simon added: “The honourable member for Middlesbrough ought now to apologise to this House, and indeed to all of ..."
    },
    {
        "url": "https://www.gazettelive.co.uk/news/teesside-news/no-corruption-teesworks-concerns-over-28530060",
        "title": "No corruption at Teesworks, but concerns over transparency, oversight and value for money",
        "description": "It made 28 recommendations, including more oversight by the TVCA. In response to the report, <b>Labour</b>’s candidate for Tees Valley mayor Chris McEwan said it showed &quot;serious failings in transparency and accountability and value for money for people of the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/health/james-nottingham-prime-minister-keir-starmer-rishi-sunak-b1135622.html",
        "title": "Nottingham victims’ families say Rishi Sunak has not ruled out public inquiry",
        "description": "David Webber said he and his wife were “horrified” there were no plans for an inquiry. The families met <b>Labour</b> leader Sir Keir Starmer at the party’s London headquarters earlier on Monday. Mr Webber’s parents have said they want to speak with ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/world-dangerous-cold-war-uk-government-2879511?ico=in-line_link",
        "title": "World now as dangerous as in the Cold War, UK government believes",
        "description": "The world is now more dangerous than any time since the Cold War, Lord Cameron is expected to warn as he pushes for the UK to strengthen its defences against hostile actors. The Foreign Secretary is planning to make his first major speech since rejoining the Government in the coming weeks, i understands."
    }
]