[
    {
        "url": "https://www.thetimes.co.uk/radio/show/20240210-27623/2024-02-10",
        "title": "The best of Matt Chorley",
        "description": "Listen to Times Radio live for the latest breaking news, expert analysis and well-informed discussion covering the biggest stories of the day."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13069671/Outrage-Labour-candidate-claims-Israel-deliberately-allowed-1-400-citizens-massacred-October-7-order-green-light-invade-Gaza.html",
        "title": "Outrage after <b>Labour</b> candidate claims Israel deliberately allowed 1,400 of its citizens to be massacred on October 7 in order to give it the &#39;green light&#39; to invade Gaza",
        "description": "Azhar Ali, who is defending a Labour majority of more than 9,000 in Rochdale on February 29, claimed Israel allowed Hamas to massacre its own citizens."
    },
    {
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13068063/Pinks-sweet-act-woman-goes-labour-Sydney-concert-not-seems.html",
        "title": "Pink&#39;s sweet act after woman goes into <b>labour</b> during her Sydney concert - but not everything is as it seems",
        "description": "Grammy-winning singer Pink briefly stopped her concert to share some sweet words of encouragement to a fan who went into labor during her latest show in Australia on Friday night."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/tory-by-election-councillor-only-one-year-new-homes-fight/",
        "title": "Tory by-election candidate says he will only do the job for a year",
        "description": "Sam Bromiley is running to replace Tory MP Chris Skidmore, who quit over a bill to guarantee annual oil and gas licensing rounds"
    },
    {
        "url": "https://www.thesun.co.uk/news/25856920/king-charles-cancer-royal-future-prince-harry/",
        "title": "King Charles’ cancer is a sign of fragile royal future… with no Prince Harry in it",
        "description": "IT boggles the mind to reflect that if William became King tomorrow, then Harry would be fourth in line to the throne. And the only royals ahead of Harry in the queue for the crown would be"
    },
    {
        "url": "https://betting.betfair.com/politics/uk-politics/wellingborough-by-election-odds-could-reform-breakthrough-destabilise-rishi-sunak-090224-171.html",
        "title": "Wellingborough By-Election Odds: Could Reform breakthrough destabilise Rishi Sunak?",
        "description": "The Tory share crashing to historic lows with voters coalescing behind the party best placed to beat them, whether <b>Labour</b> or Lib Dem. Wellingborough may be slightly more complicated. Big numbers but very doable on recent evidence. When winning the Tamworth ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/10/tories-conservative-byelection-defeats-sunak-leadership-death-spiral",
        "title": "We’ve given up the fight, say top Tories as byelection defeats loom",
        "description": "But senior MPs said not properly contesting the seats risked demoralising an already deflated party during the run-in to a general election, and at a time when <b>Labour</b> was vulnerable after performing a massive U-turn last week over its green economic plans."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/sadiq-khan-saving-pre-election-spending-spree-tories/",
        "title": "Sadiq Khan saving up for huge ‘pre-election spending spree’, say Tories",
        "description": "Sadiq Khan’s Conservative opponent Susan Hall has accused the London Mayor of “squirrelling away” vast sums to spend on the police and other services in a “pre-election spending spree”. Mr Khan is thought to be preparing to announce a funding boost for the Metropolitan Police as part of a new budget this week."
    },
    {
        "url": "https://www.thesun.co.uk/news/25857992/sir-kier-starmer-boost-unions-militant-chaos-labour/",
        "title": "Sir Kier Starmer’s plans to boost unions could open the door to militant chaos in <b>Labour</b>’s first 100 days",
        "description": "LABOUR have vowed to give trade unions sweeping new powers if they win the General Election — sparking fears Britain could be crippled by even more strikes in a year. Sir Keir Starmer plans to"
    },
    {
        "url": "https://www.lbc.co.uk/news/gove-young-voters-democracy-housing/",
        "title": "Gove warns young will abandon democracy if they cannot afford houses in new bid to win over &#39;Nimbys&#39;",
        "description": "Michael Gove has warned that young people shut out of the UK&#39;s housing market could turn away from democracy, in a new intervention."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/10/labour-considers-banning-sale-of-energy-drinks-to-children?ref=biztoc.com",
        "title": "<b>Labour</b> considers ban on sale of energy drinks to children",
        "description": "Measure has been proposed for inclusion in election manifesto amid rising health concerns for young people <b>Labour</b> is considering a ban on the sale of energy drinks to children if it wins power in the general election, it has been reported. The proposal has ..."
    }
]