[
    {
        "url": "https://www.bbc.com/news/business-68145720",
        "title": "Bankers&#39; bonuses: No cap under <b>Labour</b>, says Reeves",
        "description": "The shadow chancellor has told the BBC Labour would not reinstate a bankers&#39; bonuses cap that was scrapped last year by the Conservative government. It comes as Ms Reeves set out Labour&#39;s plans to boost economic growth through the financial services sector."
    },
    {
        "url": "https://www.cityam.com/labour-well-unashamedly-champion-financial-services-as-party-plots-rulebook-reform/",
        "title": "<b>Labour</b>: We’ll ‘unashamedly champion’ financial services as party plots rulebook reform",
        "description": "<b>Labour</b> has unveiled sweeping plans to shake up financial regulation and boost the growth of the City today as shadow chancellor Rachel Reeves said when the “sector succeeds, we all succeed”. In new proposals for the UK’s financial services sector ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/seven-illnesses-patients-told-not-32006772",
        "title": "Seven illnesses patients told NOT to see GP over and to go to pharmacist instead from today",
        "description": "Patients can now be treated for a host of common illnesses at their local pharmacy instead of waiting for a GP appointment in a new £645 million deal with NHS England"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/executives-from-steel-giant-tata-to-be-questioned-over-port-talbot-plans-b1135930.html",
        "title": "Executives from steel giant Tata to be questioned over Port Talbot plans",
        "description": "“We’re very pleased that there has been such strong support for our plan from the <b>Labour</b> benches, along with a firm commitment to £3 billion of investment in our steel industry over the next decade. “At this critical juncture, we need to see far ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/government-philip-dunne-mps-darren-rodwell-conservative-b1135935.html",
        "title": "MPs call for action amid warning of 10,000 annual heatwave deaths",
        "description": "The Environmental Audit Committee said the Government is not moving quickly enough to prevent deaths caused by extreme temperatures."
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68149437",
        "title": "Newspaper headlines: Robbie Williams&#39;s Port Vale bid and &#39;Rise of the cyborgs&#39;",
        "description": "The paper also says the <b>Labour</b> Party has launched outreach efforts amid concerns it is losing support of normally loyal Muslim voters over its position on the Middle East. The Guardian leads with comments from health experts warning the state of the NHS ..."
    },
    {
        "url": "https://news.sky.com/story/bt-and-lloyds-chiefs-among-new-business-advisers-to-sunak-13060352",
        "title": "BT and Lloyds chiefs among new business advisers to Sunak",
        "description": "Allison Kirkby, who will become BT Group’s first female chief this week, will be named on Wednesday as one of 15 members of the prime minister’s 2024 business council, Sky News learns."
    },
    {
        "url": "https://www.cityam.com/rachel-reeves-and-sadiq-khan-tell-city-a-m-readers-when-you-succeed-we-all-succeed/",
        "title": "Rachel Reeves and Sadiq Khan tell City A.M. readers: ‘When you succeed, we all succeed’",
        "description": "Rachel Reeves and Sadiq Khan tell City A.M. that Labour will put the full weight of government behind the City and financial services"
    },
    {
        "url": "https://www.theguardian.com/society/2024/jan/31/next-government-should-declare-nhs-a-national-emergency-experts-warn",
        "title": "Next government should declare NHS a national emergency, experts warn",
        "description": "Leading doctors and NHS leaders say underinvestment, staff shortages and ageing population pose ‘existential threat’ to service"
    },
    {
        "url": "https://www.cwmbranlife.co.uk/welsh-parliament-rejects-calls-for-council-tax-rise-referendums/",
        "title": "Welsh Parliament rejects calls for council tax rise referendums",
        "description": "The Welsh Parliament has rejected calls to force local authorities to hold a referendum on any council tax rise more"
    },
    {
        "url": "https://www.ibtimes.co.uk/50-business-leaders-want-keir-starmer-next-prime-minister-1723098",
        "title": "50% Of Business Leaders Want Keir Starmer As Next Prime Minister",
        "description": "Corporate leaders have said that they would have more business confidence if the Labour Party win the next general election."
    },
    {
        "url": "https://uk.news.yahoo.com/what-is-genocide-221914793.html",
        "title": "What is the legal definition of genocide?",
        "description": "According to the Genocide Convention, the definition of genocide is any of the following acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group. This includes: Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part"
    },
    {
        "url": "https://www.ibtimes.co.uk/hidden-us-prison-workforce-linked-mcdonalds-aldi-coca-cola-1723100",
        "title": "Hidden US Prison Workforce Linked To McDonalds, Aldi And Coca-Cola",
        "description": "A new AP investigation has tied US giants like McDonalds and Walmart to manual prison labour in Louisiana State Penitentiary."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13025763/JAMES-CLEVERLY-Labour-points-based-immigration-control-borders.html",
        "title": "JAMES CLEVERLY: Don&#39;t let <b>Labour</b> take us back to square one... Our points-based immigration system means we have the tools to control our borders",
        "description": "Our post-Brexit points-based immigration system means we have the tools to control our borders and decide who has the right to come here. We control who comes to the UK to work, study and visit."
    },
    {
        "url": "https://www.irishnews.com/news/world/argentinian-court-overturns-mileis-labour-rules-in-blow-to-his-reform-plans-5VPJ6IL2GJPHZHIZVDLPRH4GRY/",
        "title": "Argentinian court overturns Milei’s <b>labour</b> rules in blow to his reform plans",
        "description": "An Argentine court on Tuesday overturned <b>labour</b> rules proposed by President Javier Milei that would make it easier to sack workers, in a new blow to the leader’s efforts to shake up regulations that he says have hampered the country’s struggling economy."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861391/James-Cleverly-Migration-Figures-ONS",
        "title": "James Cleverly vows tough migration rules will halt shock population rise to 74million",
        "description": "EXCLUSIVE: Home Secretary writes for the Express after figures reveal population set to grow by the equivalent of Birmingham five times over by 2036."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/tories-labour-age-vote-election_uk_65b96e59e4b01c5c3a3883a8",
        "title": "Only The Over-70s Would Vote Tory, Poll Finds",
        "description": "“The Tories are now the most popular party only among the over-70s, 43% of whom back the party. This is down from 67% in 2019, however, with Labour being the main beneficiaries, having increased their vote share among the oldest Britons from 14% to 23%."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861439/Britain-civil-defence-force-warning-resilient",
        "title": "A civil defence force would make Britain &#39;most resilient nation on Earth&#39;, minister says",
        "description": "<b>Labour</b> peer Lord West of Spithead, a former first sea lord and chief of naval staff, told the upper chamber of Parliament: “45 years ago I did the study into whether women should serve at sea in the Royal Navy, and I said they should, and I think it has ..."
    },
    {
        "url": "https://uk.news.yahoo.com/reform-uk-ready-general-election-115321043.html",
        "title": "Reform UK will be ready for general election, Tice says",
        "description": "Reform UK leader Richard Tice says his party will be ready for a general election and urged <b>Labour</b> to stand aside, as he claims he did for the Conservatives in 2019."
    }
]