[
    {
        "url": "https://www.thetimes.co.uk/article/labour-immediate-ceasefire-gaza-israel-war-keir-starmer-wlzsfrw6w",
        "title": "<b>Labour</b> calls for ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "Sir Keir Starmer will seek to stave off a <b>Labour</b> revolt over his stance on Gaza by calling for an “immediate humanitarian ceasefire”. In an escalation of language that diverges from the UK government’s position, <b>Labour</b> urged both Israel and Hamas to ..."
    },
    {
        "url": "https://inews.co.uk/news/world/family-youtuber-ruby-franke-jailed-for-up-to-60-years-for-abusing-her-children-2917239?ico=most_popular",
        "title": "Family YouTuber Ruby Franke jailed for up to 60 years for abusing her children",
        "description": "She and Hildebrandt said they also forced him into hours of physical <b>labour</b> in the summer heat without much food or water, causing dehydration and blistering sunburns. The boy was told that everything being done to him was an act of love, according to the ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68352103",
        "title": "<b>Labour</b> pledges to cut red tape for British farmers",
        "description": "<b>Labour</b> has pledged to &quot;back British farmers&quot; by cutting red tape at the border and reducing the reliance on imported food if it wins power. In a speech shadow farming minister Daniel Zeichner will say the government has left farmers &quot;too vulnerable to low ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/what-does-uk-entering-recession-after-steeper-expected-fall-gdp-mean-brits-1723493",
        "title": "What Does UK Entering Recession After Steeper-Than-Expected Fall In GDP Mean For Brits",
        "description": "While recessions of the past, notably during the global financial crisis of 2008-2009, were protracted and severe, indications suggest that this downturn may be milder and short-lived."
    },
    {
        "url": "https://news.sky.com/story/labour-demands-cabinet-office-investigation-into-claims-made-by-former-post-office-chair-henry-staunton-13076422",
        "title": "<b>Labour</b> demands Cabinet Office investigation into claims made by former Post Office chair Henry Staunton",
        "description": "<b>Labour</b> has demanded a Cabinet Office investigation into allegations made by former Post Office chairman Henry Staunton, including that he was told to delay payouts to sub-postmasters ahead of the next election. Shadow business secretary Jonathan Reynolds ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/609a5a2f-e1c1-4c2e-9c5a-e9aeec2f657d?shareToken=cd42b151f47958457c7c76d9a6c3547a",
        "title": "‘Clarkson clause’ could waive planning permission for farm shops",
        "description": "It comes as polling shows a collapse in Conservative support in their traditional rural heartlands, with <b>Labour</b> making a pitch to become “the party of the countryside”. Sunak will tell farmers he will “cut bureaucratic red tape” to make it easier ..."
    },
    {
        "url": "https://www.ibtimes.co.uk/tory-mps-say-sunak-should-resign-if-he-refuses-move-more-towards-right-1723519",
        "title": "Tory MPs Say Sunak Should Resign If He Refuses To Move More Towards The Right",
        "description": "Since the Labour Party overturned majorities in Kingswood and Wellingborough, Tory MPs have threatened a vote of no confidence and urged Sunak to knuckle down on immigration."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-ill-stay-on-as-scotlands-first-minister-if-snp-loses-seats-at-the-uk-general-election",
        "title": "Yousaf: I&#39;ll stay on as FM if SNP loses seats at general election",
        "description": "The SNP leader spoke to STV’s Scotland Tonight programme as polls show the party’s longstanding dominance in Scotland is slipping amid a resurgent <b>Labour</b>. He said he waned to make Scotland “Tory-free”, adding that the SNP was the party in second ..."
    },
    {
        "url": "https://www.espn.co.uk/nba/story/_/id/39564633/unions-oppose-wizards-capitals-planned-move-virginia",
        "title": "Unions oppose Wizards, Capitals&#39; planned move to Virginia",
        "description": "Labor groups in Washington D.C. and Virginia are opposing efforts to move the NBA&#39;s Wizards and NHL&#39;s Capitals from downtown D.C. to northern Virginia."
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/20/welsh-20mph-speed-limit-is-a-success-claims-government",
        "title": "Welsh 20mph speed limit is a success, claims government",
        "description": "Figures show speeds on many roads have dropped by 4mph, but critics say policy is ‘monumental’ waste of money"
    },
    {
        "url": "https://www.itv.com/watch/news/labour-confirms-change-of-stance-on-gaza-ceasefire-ahead-of-vote-tomorrow/s64v2kn",
        "title": "<b>Labour</b> confirms change of stance on Gaza ceasefire ahead of vote tomorrow",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106329/voters-tough-immigration-political-parties-preserve-right.html",
        "title": "Voters are tougher on immigration than all of the main political parties and back policies often seen as the preserve of the Right, poll finds",
        "description": "A survey of more than 13,000 adults found that almost two-thirds want more restrictions on immigration, including slim majorities of Labour and Liberal Democrat voters."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68346129",
        "title": "<b>Labour</b> calls for immediate humanitarian ceasefire in Gaza for first time",
        "description": "Shadow foreign secretary David Lammy says the party&#39;s call mirrors the language of the UN and international allies."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13105855/Birmingham-locals-face-dimmed-street-lights-fewer-bin-collections-council-tax-rise-350-bankrupt-Labour-run-town-hall-desperately-scrambles-make-300m-savings.html?it",
        "title": "Birmingham locals face dimmed street lights, fewer bin collections and a council tax rise of £350 as bankrupt <b>Labour</b>-run town hall desperately scrambles to make £300m of savings",
        "description": "People living in Birmingham face dimmed street lights, fewer bin collections and a council tax rise of £350 as their bankrupt <b>Labour</b>-run council desperately scrambles to make £300million of savings. The authority has faced fury from residents face ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24133000.starmer-faces-new-rebellion-labour-mps-snp-ceasefire-motion/?ref=rss",
        "title": "Starmer faces new rebellion from <b>Labour</b> MPs over SNP ceasefire motion",
        "description": "Sir Keir Starmer could still face a rebellion from his own MPs, despite backing calls call for an &quot;immediate humanitarian ceasefire&quot;"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-bristol-68354801",
        "title": "Deadlock as Bristol City Council fails to approve budget",
        "description": "Bristol City Council has failed to approve its budget for the next financial year. Councillors voted against the plans during a full council meeting at City Hall which lasted about three hours. Outgoing Labour mayor Marvin Rees&#39;s final budget proposed more than £24m of cutbacks and a 4.99% council tax hike."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/mordaunt-could-beat-starmer-next-election-tory-voters/",
        "title": "Only Mordaunt could beat Starmer at next election, say Tory voters",
        "description": "Leader of the Commons only candidate backed by 2019 Conservative voters to give party a better chance if she replaced Rishi Sunak"
    },
    {
        "url": "https://news.sky.com/story/israel-hamas-war-labour-finally-shifts-its-ceasefire-stance-but-may-have-fallen-into-a-trap-13076578",
        "title": "Israel-Hamas war: <b>Labour</b> finally shifts its ceasefire stance - but may have fallen into a trap",
        "description": "Labour MPs tomorrow will be offered the chance to either support the Tories - who reject a permanent ceasefire in Gaza until all hostages are released - or the SNP position, which calls for an immediate one."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/sir-keir-changes-stance-gaza-for-fifth-time-ceasefire/",
        "title": "Sir Keir changes stance on Gaza for fifth time as he backs ‘immediate ceasefire’",
        "description": "The <b>Labour</b> leader caved to pressure from Left-wing MPs and the Scottish National Party by supporting calls for Israel to agree to an instant truce. Stephen Flynn, the SNP leader in Westminster, claimed victory and crowed that the nationalists had ..."
    },
    {
        "url": "https://inews.co.uk/opinion/politicians-rural-posturing-isnt-fooling-our-farmers-2916317?ico=more_from_this_author",
        "title": "Politicians’ rural posturing isn’t fooling our farmers",
        "description": "It is a battlefield that has seen a Tory retreat which <b>Labour</b> hopes to turn into a rout. So a lot of urban ministers are digging out their Hunter wellies to visit distant places and share worries about absent local bus services and fertiliser prices."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/top-tory-defends-flood-party-32171074.amp",
        "title": "Top Tory defends &#39;flood&#39; of party donors into House of Lords as Liz Truss allies take oath",
        "description": "Also introduced to the Lords today was Matthew Elliott, the former chief of the Vote Leave campaign for Brexit. <b>Labour</b> backbench peer Lord George Foulkes voiced his displeasure by asking a Defra minister: &quot;Can the minister tell the House what can be done ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-lammy-government-gaza-mps-uk-government-b1140443.html",
        "title": "Government amendment on Gaza ceasefire vote puts <b>Labour</b> in a bind",
        "description": "Shadow foreign secretary David Lammy suggested <b>Labour</b> could not back either the Government or SNP motion on the Israel-Hamas war. <b>Labour</b> leader Sir Keir Starmer is facing a tough call on Gaza ceasefire debate in the Commons (Dan Kitwood/PA) The UK ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/welsh-labour-welsh-government-uk-government-senedd-b1140449.html",
        "title": "Blanket 20mph speed limits working, says Welsh government",
        "description": "The Welsh <b>Labour</b> Government, which implemented the change in September last year, insists the lower speeds will lead to fewer collisions and people injured. But the change has seen fierce opposition from the Conservatives in the Senedd, who have branded ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/19/kemi-badenoch-post-office-scandal-alexei-navalny-uk-politics-live?filterKeyEvents=true&page=with:block-65d36a2b8f08955f59f82ca0",
        "title": "Minister says government working on sanction options for those involved in Alexei Navalny’s death – as it happened",
        "description": "<b>Labour</b> MPs are urging their leader not to whip them against voting for a Scottish National party motion this week calling for a ceasefire, three months after a similar vote saw 56 members rebel, including eight frontbenchers. Party whips have not yet ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13105855/Birmingham-locals-face-dimmed-street-lights-fewer-bin-collections-council-tax-rise-350-bankrupt-Labour-run-town-hall-desperately-scrambles-make-300m-savings.html",
        "title": "Birmingham locals face dimmed street lights, fewer bin collections and a council tax rise of £350 as bankrupt <b>Labour</b>-run town hall desperately scrambles to make £300m of savings",
        "description": "The authority has faced fury from residents face having to pay more for fewer services as their services are set to be reduced."
    },
    {
        "url": "https://www.channel4.com/news/labour-call-for-immediate-humanitarian-ceasefire-in-gaza-for-first-time",
        "title": "<b>Labour</b> call for immediate humanitarian ceasefire in Gaza for first time",
        "description": "For the first time, Labour has called for an “immediate humanitarian ceasefire” in Gaza. In an effort to head off a rebellion by its MPs, the party has published an amendment to an SNP motion calling more bluntly for an immediate ceasefire."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/david-lammy-government-gaza-mps-uk-government-b2499546.html",
        "title": "Government amendment on Gaza ceasefire vote puts <b>Labour</b> in a bind",
        "description": "Shadow foreign secretary David Lammy suggested Labour could not back either the Government or SNP motion on the Israel-Hamas war."
    },
    {
        "url": "https://www.lbc.co.uk/news/labours-ceasefire-motion-broader-and-goes-further-than-the-snp-david-lammy/",
        "title": "&#39;I want to do what is right&#39;: <b>Labour</b>&#39;s ceasefire motion is &#39;broader&#39; and &#39;goes further&#39; than the SNP&#39;s, says David Lammy",
        "description": "The shadow foreign secretary said <b>Labour</b>&#39;s ceasefire motion is &quot;broader and goes further&quot; than the SNPs, which comes after the party called for an &quot;immediate humanitarian ceasefire&quot; in the Israel-Hamas conflict - a major shift in it&#39;s stance on the war."
    },
    {
        "url": "https://news.stv.tv/politics/uk-plans-to-maximise-north-sea-oil-and-gas-production-move-closer-to-becoming-law",
        "title": "Plans to maximise oil and gas production move closer to becoming law",
        "description": "Labour and the SNP criticised the UK Government’s bid, with an opposition frontbencher branding it &#39;political posturing&#39;."
    },
    {
        "url": "https://www.express.co.uk/news/royal/1868842/royal-family-political-statements-snapshot",
        "title": "Five times the Royal Family have controversially waded into politics",
        "description": "It appeared to endorse <b>Labour</b>’s policy and put John Major in hot water as he said Britain would not support a ban until all countries had signed it. Diana was outspoken about the need to ban “the plague on earth” and described the UK government’s ..."
    },
    {
        "url": "https://www.thenational.scot/news/24133003.keir-starmer-ordering-labour-mps-abstain-snp-ceasefire-motion/",
        "title": "Keir Starmer &#39;ordering <b>Labour</b> MPs to abstain on SNP ceasefire motion&#39;",
        "description": "The amendment was very similar to the motion, but removed the reference to &quot;collective punishment&quot;. While the SNP welcomed <b>Labour</b> moving towards supporting an immediate ceasefire, First Minister Humza Yousaf said it was &quot;frustrating&quot; that they would be ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24127939.bridget-phillipson-hits-tories-school-phone-ban/",
        "title": "Bridget Phillipson hits out at Tories school phone ban",
        "description": "So today, we&#39;re delivering on our promise to ban mobile phones in schools. Following the news, <b>Labour</b>&#39;s Shadow Education Secretary and also MP for Houghton &amp; Sunderland South, Bridget Phillipson has hit out at the move, claiming the Conservative government ..."
    },
    {
        "url": "https://inews.co.uk/news/business/government-crackdown-hire-fire-unions-2913696?ico=more_from_this_author",
        "title": "Government crackdown on P&amp;O Ferries-style ‘fire and hire’ not enough, say unions",
        "description": "TUC General Secretary Paul Nowak said: “This code lacks bite and is not going to deter bad employers like P&amp;O from treating staff like disposable <b>labour</b>. We need far more robust legislation to protect people at work. One in 10 were threatened with fire ..."
    }
]