[
    {
        "url": "https://www.mirror.co.uk/3am/celebrity-news/kate-garraway-wore-derek-drapers-32034768",
        "title": "Kate Garraway wore Derek Draper&#39;s watch to funeral as &#39;she wanted a piece of him to be with her&#39;",
        "description": "Good Morning Britain star Kate Garraway wore her late husband DereK Draper&#39;s watch to his funeral and she and their children Darcey and Billy said their final goodbyes"
    },
    {
        "url": "https://www.thetimes.co.uk/article/can-labours-poll-lead-transfer-to-scottish-success-at-the-ballot-box-jd6g52hr2",
        "title": "Can <b>Labour</b>’s poll lead transfer to Scottish success at the ballot box?",
        "description": "Sir Keir Starmer’s party is riding high as a general election looms, but there are worries about whether his policies are attractive enough to voters north of the border"
    },
    {
        "url": "https://uk.news.yahoo.com/top-n-b-court-grants-194230876.html",
        "title": "Top N.B. court grants leave to appeal in proposed class action over <b>labour</b>-inducing drug",
        "description": "New Brunswick&#39;s highest court has agreed to review a judge&#39;s decision to not certify a class-action lawsuit that alleges a former nurse at the Moncton Hospital administered a labour-inducing drug to potentially &quot;hundreds&quot; of pregnant women without their consent."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68167504",
        "title": "MP: &#39;Garrote&#39; offenders with intestines to cut fly tipping",
        "description": "Desmond Swayne has suggested drastic action to cut the number of fly tipping cases. The Conservative MP for New Forest West intervened in a Commons debate, saying the current penalties were insufficient, but if “offenders were garrotted with their own intestines” then numbers would fall."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/24094676.echo-comment-possible-tax-cuts-council-tax-rises/",
        "title": "Echo Comment on possible tax cuts and council tax rises",
        "description": "THERE is once again talk of impending tax cuts as Chancellor Jeremy Hunt begins work on his March Budget. The Budget is one of the last setpiece events where the Conservatives might hope to introduce measures popular enough to dent Labour’s stubbornly persistent poll lead."
    },
    {
        "url": "https://inews.co.uk/news/politics/income-tax-poll-jeremy-hunt-2887346?ico=related_stories",
        "title": "Poll puts Hunt under pressure to cut income tax for low earners",
        "description": "Voters see cuts to the higher 40p rate of income tax as a low priority (11 per cent, 12 per cent Tories) despite the impact of “fiscal drag” being forecast to pull three million more workers into this threshold over the next five years due to earnings bands being frozen."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/labour-starts-power-handover-talks-with-civil-servants/",
        "title": "<b>Labour</b> starts power handover talks with civil servants",
        "description": "The talks are designed to ensure a smooth transfer of power should Sir Keir Starmer win the next election Credit: Stefan Rousseau/PA <b>Labour</b> has started handover talks with civil servants in preparation for a potential change of government. The party ..."
    },
    {
        "url": "https://uk.news.yahoo.com/jobs-hot-economy-doing-well-191024608.html",
        "title": "Jobs are hot, the economy is doing well. So why are people still sour on Joe Biden?",
        "description": "People still feel lousy about the economy and rising prices. But there are signs people feel better than they did last year. Eric Garcia reports"
    },
    {
        "url": "https://www.kentonline.co.uk/maidstone/news/farmer-cut-off-on-live-gb-news-interview-after-slating-bre-301197/",
        "title": "Kent farmer David Catt kicked off GB News by Jacob Rees-Mogg after saying Brexit had been a disaster",
        "description": "A farmer invited to “celebrate” the fourth anniversary of Brexit on GB News was “cut off” after insisting it had been a disaster for agriculture."
    },
    {
        "url": "https://www.bournemouthecho.co.uk/news/national/24094475.tata-steel-begins-formal-45-day-consultation-plans-port-talbot-plant/",
        "title": "Tata Steel begins formal 45-day consultation over plans for Port Talbot plant",
        "description": "Tata Steel has started a formal 45-day consultation on its restructuring which is set to lead to thousands of job losses. The company is planning to shut down blast furnaces at its plant in Port Talbot, south Wales, and switch to a more environmentally friendly way of producing steel."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.sthelensstar.co.uk/news/24069733.independent-councillors-say-will-not-take-basic-allowance-rise/",
        "title": "Independent councillors say they will not take basic allowance rise",
        "description": "“For a number of years councillors have chosen to not accept an annual uplift on the allowances which is a well-established provision in the scheme but with rising costs and councillor allowances falling behind neighbouring councils the panel agreed to recommend a rise in line with increased council staffing budget of 6.44 per cent."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-manchester-68181089",
        "title": "Eleven candidates announced for Rochdale by-election",
        "description": "Eleven candidates have been announced in a by-election which was called after the death of a veteran Labour MP. The poll in Rochdale was triggered after Sir Tony Lloyd died in January, days after announcing he had an incurable form of leukaemia."
    },
    {
        "url": "https://www.thenational.scot/politics/24094733.labours-quaint-tradition-scrapping-28bn-green-pledge/",
        "title": "<b>Labour</b>&#39;s quaint tradition of scrapping their £28bn green pledge",
        "description": "It&#39;s becoming as regular as the changing of the guards at Buckingham Palace. For those mercifully shielded from the tedium of <b>Labour</b> Party policy, a short recap. The policy was first announced by Rachel Reeves in 2021, who boasted of her ambition of ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/bury-council-faces-22m-budget-28562459",
        "title": "Bury council faces £22m budget gap after declaring itself &#39;financially distressed&#39;",
        "description": "Bury Council faces a £22m gap in its budget for the next year after declaring itself in a state of ‘financial distress’. In finance reports published this week the Labour controlled council’s interim director of finance Paul McKevitt, said that there had been increased demand for services and ‘systemic under funding’ of local authorities."
    },
    {
        "url": "https://news.sky.com/story/labour-will-look-for-radicalism-through-reform-13062317?dcmp=snt-sf-twitter",
        "title": "<b>Labour</b> will look for &#39;radicalism&#39; through reform rather than risk fiscal slip-up",
        "description": "In a week of row backs from her party over reinstating the cap on bankers&#39; bonuses and pouring up to £28bn a year into green energy, Angela Rayner is one <b>Labour</b> politician standing her ground. In Scotland to promote her &quot;new deal for workers&quot;, the deputy ..."
    },
    {
        "url": "https://www.modernghana.com/news/1290024/organised-labour-to-stage-protest-against-15-elec.html",
        "title": "Organised <b>Labour</b> to stage protest against 15% electricity tax on February 13",
        "description": "Organized Labour is set to embark on a nationwide demonstration against government rsquo;s imposition of a 15 VAT on Electricity."
    },
    {
        "url": "https://www.fwi.co.uk/business/business-management/agricultural-transition/hundreds-of-welsh-farmers-angered-by-new-sfs-proposals",
        "title": "Hundreds of farmers unite in anger at Welsh SFS proposals",
        "description": "Hundreds of farmers have come together for a crunch meeting to discuss the future of farming in Wales amid intensifying anger against Welsh government"
    },
    {
        "url": "https://morningstaronline.co.uk/article/hundreds-estate-agents-boards-declare-steel-not-sale-tata-campaign",
        "title": "Hundreds of estate agents boards declare ‘steel not for sale’ in Tata campaign",
        "description": "HUNDREDS of estate agents’ boards declaring “steel not for sale” have gone up in communities around Britain’s steel production centres as union Unite campaigns to defend the industry and thousands of jobs."
    },
    {
        "url": "https://inews.co.uk/news/politics/ill-die-in-a-ditch-for-a-free-nhs-wes-streeting-tells-reform-critics-2887233?ITO=msn",
        "title": "I’ll ‘die in a ditch’ for a free NHS, Wes Streeting tells reform critics",
        "description": "Shadow health secretary said people are feeling more &#39;reassured&#39; about his plans for reform of the health service as he pledges a Labour government will intervene early to tackle UK&#39;s mental health ep"
    },
    {
        "url": "https://westbridgfordwire.com/nottingham-city-council-your-views-wont-change-planned-cuts-because-of-government-board-rules-says-leader/",
        "title": "Nottingham City Council: Your views won’t change planned cuts because of Government board rules, says leader",
        "description": "Nottingham City Council&#39;s recent consultation is expected to have limited influence in stopping significant cuts to services, councillors say."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/crime/clapham-alkaline-attack-row-asylum-b2489543.html",
        "title": "Clapham alkaline attack: Immigration row over refugee granted asylum despite sex crimes",
        "description": "Abdul Ezedi, 35, who is on the run after an attack in Clapham, south London, on Wednesday, pleaded guilty to sexual assault and exposure in 2018 but was still granted asylum in Britain in 2021 or 2022."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13039043/Newborn-baby-died-lack-oxygen-brain-just-16-hours-inexperienced-overstretched-maternity-staff-failed-recognise-emergency-seek-help-inquest-told.html",
        "title": "Newborn baby died of lack of oxygen to the brain after just 16 hours as inexperienced and overstretched maternity staff failed to recognise emergency and seek help, inquest told",
        "description": "The HSIB report suggested Giles&#39; death could have been avoided if staff had known about the care plan for his mother&#39;s <b>labour</b>. Yesterday assistant coroner Louise Wiltshire told the Plymouth inquest: &#39;This is a truly tragic case. &#39;Giles was born on 28th ..."
    },
    {
        "url": "https://ifs.org.uk/journals/financing-uk-democracy-stocktake-20-years-political-donations-disclosure",
        "title": "Financing UK democracy: a stocktake of 20 years of political donations disclosure",
        "description": "We study political donations data disclosed since 2001 to evaluate the role of private and public political finance over time."
    },
    {
        "url": "https://news.sky.com/story/labour-deputy-leader-doubles-down-on-workers-rights-pledges-amid-backtracking-reports-13062223?dcmp=snt-sf-twitter",
        "title": "<b>Labour</b> deputy leader doubles down on workers&#39; rights pledges after backtracking reports",
        "description": "Angela Rayner reiterated a commitment to introduce draft legislation within 100 days of a Labour victory to enshrine its employment promises in law. It comes following claims the party had rowed back on some of its pledges."
    },
    {
        "url": "https://www.thesun.co.uk/sport/25689282/kyle-walkers-annie-kilner-fears-early-labour/",
        "title": "Kyle Walker’s pregnant wife Annie Kilner fears she’ll go into early <b>labour</b> after stress of split, friends say",
        "description": "KYLE Walker’s pregnant wife Annie Kilner fears she may go into labour early after the stress of their split, friends say. The WAG, who dumped Kyle last month after learning he’d fathered a second"
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "And I just wonder, Stephen, we’ve seen quite a lot of flip-flopping recently. I’m thinking, you know, there’s still a lot of uncertainty hanging over <b>Labour</b>’s pledge to spend £28bn as part of their green prosperity plan by the second half of their ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13179325.miliband-makes-emotional-appeal-gathering-labour-supporters/",
        "title": "Miliband makes emotional appeal to gathering of <b>Labour</b> supporters",
        "description": "<b>LABOUR</b> leader Ed Miliband has issued an emotional appeal to Scots&#39; sense of solidarity with the rest of the UK as he abandoned Westminster to fight for a No vote. In a speech to party supporters in Cumbernauld, he said values of social justice and fairness ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/13145986.better-education-needed/",
        "title": "Better education for all is needed",
        "description": "We all agree that children deserve the highest standards of education and state schooling needs to be improved. Anas Sarwar, <b>Labour</b> MP, has received criticism since revealing that his son is privately educated. Yet he is of an age and from a background ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/cramlington-labour-candidate-general-election-28558593",
        "title": "<b>Labour</b> select candidate to fight newly formed Northumberland seat at general election",
        "description": "The Labour Party has unveiled its candidate for the newly formed Cramlington and Killingworth seat at the looming General Election."
    },
    {
        "url": "https://westbridgfordwire.com/race-for-east-midlands-mayor-begins-at-nottingham-debate/",
        "title": "Race for East Midlands Mayor begins at Nottingham debate",
        "description": "An opening debate for those vying to become the first-ever East Midlands Mayor saw candidates clash on who had the best local knowledge and influence to hold"
    },
    {
        "url": "https://nottstv.com/opening-debate-ahead-of-first-ever-east-midlands-mayor-vote-sees-candidates-clash-on-local-knowledge-and-influence/",
        "title": "Opening debate ahead of first-ever East Midlands Mayor vote sees candidates clash on local knowledge and influence",
        "description": "An opening debate for those vying to become the first-ever East Midlands Mayor saw candidates clash on who had the best local knowledge and influence to hold what will be one of the most powerful regional positions in the UK."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/labour-is-in-the-worst-of-all-worlds-with-confused-messaging-on-its-28bn-pledge",
        "title": "<b>Labour</b> is in the worst of all worlds with confused messaging on its £28bn pledge",
        "description": "Tories watch on delighted as Starmer continues to talk about the figure while the shadow Treasury team distances itself from it"
    },
    {
        "url": "https://www.exchangerates.org.uk/news/40014/2024-02-02-pound-to-dollar-exchange-rate-sub-127-after-blowout-us-jobs.html",
        "title": "Pound To Dollar Exchange Rate: Sub 1.27 After Blowout US Jobs",
        "description": "Save money on your currency transfers with TorFX, voted International Money Transfer Provider of the Year 2016 - 2022. Their goal is to connect clients with ultra competitive exchange rates and a uniquely dedicated service whether they choose to trade online or over the telephone. Find out more here."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/02/keir-starmer-ditching-28bn-climate-plan-cowardly-labour",
        "title": "A message to Starmer from the US: ditching your £28bn climate plan isn’t just cowardly – it’s bad politics",
        "description": "Folding in the face of Tory attacks won’t win <b>Labour</b> any votes. Joe Biden has shown how this spending can pay off electorally It’s hard, from the US, to feel all that confident about the state of our climate policies. The Inflation Reduction Act ..."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-back-to-the-immigration-row/",
        "title": "London Playbook PM: Back to the immigration row",
        "description": "**POLITICO Pro Financial Services UK is launching in February 2024! Providing insightful news on U.K. financial services, for City dwellers and finance up-and-comers alike, our newest policy area will unseal the vault of U.K. finance policy as it enters new territory. Get a four-week free trial here.**"
    },
    {
        "url": "https://www.rochdaleonline.co.uk/news-features/2/news-headlines/155023/everyone-who-is-standing-in-the-rochdale-byelection",
        "title": "Everyone who is standing in the Rochdale by-election",
        "description": "On 29 February, residents of the Rochdale constituency will have their chance to say who they want to represent them"
    },
    {
        "url": "https://inews.co.uk/news/politics/business-fear-tax-rises-labour-2886820",
        "title": "Business bosses fear ‘sting in the tail’ on taxes from <b>Labour</b>, says insider",
        "description": "In front of bosses from companies including Microsoft and Aviva, shadow Chancellor Rachel Reeves pledged that Labour would freeze corporation tax for five years if it wins the next election."
    },
    {
        "url": "https://www.plymouthherald.co.uk/news/plymouth-news/royal-navy-warships-albion-bulwark-9075425",
        "title": "Royal Navy warships Albion and Bulwark are now safe says defence minister",
        "description": "Devonport warships HMS Albion and HMS Bulwark will not be scrapped or mothballed, Defence Secretary Grant Shapps said on a visit to Plymouth. The minister said both vessels, currently being worked on in Devonport Dockyard, were essential for the Royal Navy and Royal Marines until newer vessels arrive."
    },
    {
        "url": "https://stratfordobserver.co.uk/news/green-party-candidate-to-meet-southam-residents-48144/",
        "title": "Green Party candidate to meet Southam residents",
        "description": "THERE is a chance to meet the Green Party candidate for Kenilworth and Southam. Coun Zoe Leventhal is inviting residents for tea and cakes at the Grange Hall in Southam tomorrow (Saturday). The event runs from 12."
    },
    {
        "url": "https://www.ft.com/content/34bd389f-f44d-42d8-b5d6-31fe34ea30c6?trk=public_post_comment-text",
        "title": "‘Stunning’ US jobs growth of 353,000 far outstrips estimates",
        "description": "Investors rein in expectations of interest rate cuts after January payrolls come in at almost double economists’ forecasts"
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/tata-steel-begins-formal-45day-consultation-over-plans-for-port-talbot-plant-b1136738.html",
        "title": "Tata Steel begins formal 45-day consultation over plans for Port Talbot plant",
        "description": "Tata Steel has started a formal 45-day consultation on its restructuring which is set to lead to thousands of job losses. The company is planning to shut down blast furnaces at its plant in Port Talbot, south Wales, and switch to a more environmentally friendly way of producing steel."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/pat-mcfadden-alan-bates-vince-cable-horizon-ed-davey-b2489567.html",
        "title": "Paula Vennells to give evidence at next stage of Horizon inquiry",
        "description": "Former Post Office boss Paula Vennells will give evidence at the next stage of the inquiry into the Horizon IT scandal. Ms Vennells, who was chief executive officer of Post Office Ltd between 2012 and 2019, has come under fire over why hundreds of subpostmasters were wrongly prosecuted for fraud and false accounting under her watch."
    },
    {
        "url": "https://morningstaronline.co.uk/article/former-labour-mayor-launches-independent-election-campaign-scathing-attack-party",
        "title": "Former <b>Labour</b> mayor launches independent election campaign with scathing attack on party",
        "description": "AN ELECTED Labour mayor who was barred by the party from standing in May’s mayoral election has launched his election campaign standing as an independent."
    },
    {
        "url": "https://www.thetimes.co.uk/article/derek-draper-funeral-elton-john-and-tony-blair-among-mourners-3h2dwt7vx",
        "title": "Derek Draper funeral: Elton John and Tony Blair among mourners",
        "description": "Draper, the husband of Kate Garraway and a former New <b>Labour</b> strategist, died aged 56 on January 3 after suffering a cardiac arrest in December. He had fallen ill with Covid-19 in March 2020 and was left with damage to his organs and needing round-the ..."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/bibby-stockholm-claustrophobic-asylum-seeker-barge-risks-human-rights-breach-mps-warn/",
        "title": "Bibby Stockholm: &#39;Claustrophobic&#39; asylum seeker barge risks human rights breach, MPs warn",
        "description": "Asylum seekers being housed on a government-run barge are facing claustrophobic conditions that could amount to a breach of their human rights, MPs have warned."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-council-chief-grimly-warns-28560836",
        "title": "Birmingham council chief grimly warns of &#39;unpalatable&#39; decisions amid huge budget gap",
        "description": "Birmingham City Council’s chief executive has warned of “unpalatable” decisions amid an enormous budget gap of at least £300 million. The Labour-run council is currently in a bleak financial position due to a perfect storm of issues,"
    },
    {
        "url": "https://news.stv.tv/politics/angela-rayner-appaling-that-former-first-minister-nicola-sturgeon-deleted-covid-whatsapp-messages",
        "title": "Rayner brands Sturgeon &#39;appalling&#39; for deleting Covid WhatsApps",
        "description": "The deputy Labour leader told STV News that Nicola Sturgeon knew the messages contained &#39;vital pieces of information&#39;."
    },
    {
        "url": "https://www.scotsman.com/whats-on/arts-and-entertainment/scottish-licence-fee-expected-to-pay-for-new-broadcaster-under-independence-vision-4503057",
        "title": "Scottish licence fee expected to pay for new broadcaster under independence vision",
        "description": "A new Scottish licence fee would be created under new plans to shake up the broadcasting landscape in an independent Scotland.The Scottish Government said its proposed public sector broadcaster would “better reflect and prioritise the specific needs and interests of Scottish audiences&quot;."
    },
    {
        "url": "https://www.derbytelegraph.co.uk/news/derby-news/mayor-derby-alan-graves-under-9075300",
        "title": "Mayor of Derby Alan Graves under investigation over his conduct after video row",
        "description": "The Mayor of Derby Alan Graves is under investigation over his conduct amid a dispute about justice. It follows a row between the Alvaston North councillor and senior Derby City Council officials over a video he put on his social media channels in which he slammed the actions of a fellow councillor and the council’s standards committee."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/national/24093919.labour-not-committed-arbitrary-numbers-green-investment---rayner/",
        "title": "<b>Labour</b> not committed to ‘arbitrary’ numbers on green investment – Rayner",
        "description": "<b>Labour</b> deputy leader Angela Rayner has said the party is not committed to “arbitrary” numbers on its pledge to ultimately invest £28 billion a year in the green economy. She said the money will depend on sticking to fiscal rules and <b>Labour</b> will ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-simon-case-prime-minister-rishi-sunak-tories-b1136696.html",
        "title": "<b>Labour</b> commences access talks with civil service",
        "description": "Shadow cabinet teams will begin to meet with departments, a party spokesperson said. <b>Labour</b> <b>labour</b> has commenced access talks with the civil service in preparation for government in case Sir Keir Starmer’s party wins the election (Andrew Matthews/PA ..."
    }
]