[
    {
        "url": "https://www.dailymail.co.uk/news/article-13025567/megyn-kelly-slams-taylor-swift-travis-kelce-biden-theory.html",
        "title": "Conspiracy theorist <b>conservatives</b> fear Taylor Swift is trying to BRAINWASH Americans into voting for Biden, as Megyn Kelly predicts star will soon be torn from her pedestal",
        "description": "However, recent reports that the Biden campaign has a nod from the singer at the top of their endorsement list for 2024 has led some <b>conservatives</b> to believe she will brainwash Americans into voting Democrat. Kelly scoffed at it as a conspiracy theory and ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13025561/Taylor-Swift-weighs-endorses-Biden-conservative-suggest-tapping-quarterback-Brock-Purdy.html",
        "title": "Ahead of the &#39;tsunami&#39; if Taylor Swift endorses Biden, conservative conference attendees suggest getting behind 49ers quarterback Brock Purdy",
        "description": "<b>Conservatives</b> are increasingly worried that Taylor Swift will endorse Joe Biden&#39;s reelection and doom any changes of Republicans winning in 2024. The world&#39;s biggest pop star came up a few times at Turning Point Action&#39;s Restoring National Confidence ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/uk-news/conservative-partys-lies-exposed-latest-32006431",
        "title": "&#39;Conservative Party&#39;s lies exposed by latest UK economic forecast&#39;",
        "description": "People coming to Britain enrich us economically, socially and culturally but anybody unhappy with the figures should complain to Rishi Sunak and his <b>Conservatives</b>. It’s happening on their watch. Demolition teams tearing down Captain Tom’s family’s ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/tories-labour-age-vote-election_uk_65b96e59e4b01c5c3a3883a8",
        "title": "Only The Over-70s Would Vote Tory, Poll Finds",
        "description": "“The Tories are now the most popular party only among the over-70s, 43% of whom back the party. This is down from 67% in 2019, however, with Labour being the main beneficiaries, having increased their vote share among the oldest Britons from 14% to 23%."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-tories-butt-heads-over-shocking-london-knife-crime-figures-1723037",
        "title": "Labour And Tories Butt Heads Over Shocking London Knife Crime Figures",
        "description": "Knife crime cases in London have soared by more than 20 per cent. Photo: GETTY IMAGES / SCOTT OLSON GETTY IMAGES/SCOTT OLSON According to official statistics, published by UK Parliament, the number of knife crime offences in England and Wales has increased ..."
    },
    {
        "url": "https://uk.news.yahoo.com/jen-psaki-mocks-fox-news-235721942.html",
        "title": "Jen Psaki Mocks Fox News-Promoted Conspiracy That Taylor Swift Is a Democratic Plant: ‘Shake It Off!’ | Video",
        "description": "&quot;There&#39;s always some larger big state, big institution behind the curtain keeping conservatives and Donald Trump down,&quot; the MSNBC host says The post Jen Psaki Mocks Fox News-Promoted Conspiracy That Taylor Swift Is a Democratic Plant: ‘Shake It Off!"
    },
    {
        "url": "https://uk.news.yahoo.com/tory-social-housing-plan-promising-200409658.html",
        "title": "Tory social housing plan promising ‘British homes for British workers’ sparks backlash",
        "description": "A controversial new Tory housing policy which seeks to overhaul the housing system and promises “British homes for British people” has been widely criticised. Under the maligned new plans, the government is pledging priorty housing for people with ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/taylor-swift-travis-kelce-super-bowl-b2487573.html",
        "title": "Taylor Swift, Travis Kelce and the Super Bowl conspiracy that wasn’t",
        "description": "When it became clear that Taylor Swift’s boyfriend might win the Super Bowl in the same year as Biden stood for re-election, Clemence Michallon writes, right-wingers lost their collective minds"
    },
    {
        "url": "https://www.thesun.co.uk/money/25611071/income-tax-cuts-fuel-duty-relief-for-budget/",
        "title": "Income tax cuts and fuel duty relief must be in the Budget, Red Wall Tories tell Jeremy Hunt",
        "description": "INCOME tax cuts and fuel duty relief must be in the next Budget, Red Wall Tories have demanded. The influential New Conservatives group of MPs have written to Jeremy Hunt with a plan to ease the"
    },
    {
        "url": "https://uk.movies.yahoo.com/view-defends-taylor-swift-against-173314129.html",
        "title": "The View Defends Taylor Swift Against Conservative Conspiracy Theories: ‘I Cannot Think of a Dumber Fight to Pick’",
        "description": "The ladies of The View have a message for conservative news outlets and politicians targeting Taylor Swift: You need to calm down. Tuesday’s episode began with a discussion about Fox News’ apparent crusade against the pop star,"
    },
    {
        "url": "https://www.thetimes.co.uk/article/neither-snp-nor-tories-give-a-damn-about-devolution-xvrkcg65v",
        "title": "Neither SNP nor Tories give a damn about devolution",
        "description": "While the Nationalists were spoiling for a ‘rammy’ with Westminster, many Conservatives have never really accepted the shift of power away from London"
    },
    {
        "url": "https://uk.news.yahoo.com/tories-spark-outrage-policy-slogan-163311408.html",
        "title": "Tories Spark Outrage With New Policy Slogan About &#39;British Homes For British People&#39;",
        "description": "The <b>Conservatives</b>’ latest policy promotion online has social media users coming down on the government like, well, a ton of bricks. A post shared on Tuesday from the party’s official X (formerly Twitter) account suggested the government would help ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-general-election-starmer-mandelson-poll-b2487453.html",
        "title": "Labour grandee Mandelson warns Labour lead is ‘artificial’ and will shrink before election",
        "description": "Lord Mandelson’s comments come as his party holds a 20-point poll lead over Rishi Sunak’s <b>Conservatives</b>, with an election expected this autumn. Lord Mandelson poured cold water on Labour’s hopes of a landslide election win (Reuters) But the former ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/disney-plus-mps-netflix-british-board-of-film-classification-government-b1135882.html",
        "title": "Disney Plus must bring age rating in line with UK standards, Tory MPs say",
        "description": "The Tory MP, a member of the right wing New <b>Conservatives</b> faction, told the Commons the watershed for adult content “has become increasingly redundant” in the streaming era as MPs continued their consideration of the Media Bill, which aims to update ..."
    }
]