[
    {
        "url": "https://www.readingchronicle.co.uk/news/24082724.fighting-talk-reading-tories-labour-leader-visit/",
        "title": "Fighting talk from Reading Tories after Labour leader visit",
        "description": "The local Conservative leader has accused Labour party leader Sir Keir Starmer of painting Reading ‘in the worst possible light’ in a"
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/councillors-lose-bid-stop-plans-28533644",
        "title": "Councillors lose bid to stop plans for three-weekly bin collections in Cardiff",
        "description": "Councillors&#39; attempts to overturn controversial plans for one black bin bag collection every three weeks failed. Conservative councillors at Cardiff Council, led by Cllr John Lancaster, put forward a motion calling for a re-think on waste collection proposals at a full council meeting on Thursday, January 25."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rishi-sunak-ipsos-poll-general-election-labour-tories-b1135566.html",
        "title": "Britain&#39;s &#39;most capable PM&#39;? Starmer opens up record 13-point lead over Sunak in new Ipsos poll",
        "description": "Sir Keir Starmer has opened up a record 13-point lead over Rishi Sunak in terms of who Britons think is the “most capable Prime Minister ”, according to a new poll."
    },
    {
        "url": "https://news.stv.tv/politics/douglas-ross-attacks-snp-over-orchestrated-and-concerted-deletion-of-covid-whatsapps",
        "title": "Ross attacks SNP over ‘orchestrated and concerted’ deletion of Covid WhatsApps",
        "description": "Douglas Ross, the leader of the Scottish Conservatives, said those who lost loved ones to coronavirus had been “betrayed”, as he accused the Scottish Government of taking “secrecy and cover-up to a new low”. Ross challenged the SNP over the issue following evidence to the UK Covid-19 Inquiry from some of the key figures during the pandemic."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24082837.rishi-sunak-much-proud-might-yet-sneak-win/",
        "title": "Rishi Sunak has much to be proud of. He might yet sneak a win",
        "description": "WHEREVER Rishi Sunak looks, the received wisdom is that he, the Conservatives and their General Election campaign are all doomed. But in years"
    },
    {
        "url": "https://www.heraldscotland.com/news/24082861.snp-tories-accuse-politicising-pandemic/",
        "title": "SNP and Tories accuse each other of politicising pandemic",
        "description": "The SNP and Scottish Conservatives have accused each other of politicising the pandemic after evidence at the UK Covid inquiry showed ministers"
    },
    {
        "url": "https://thenegotiator.co.uk/70-of-housebuilders-want-labour-to-win-general-election-says-knight-frank",
        "title": "70% of housebuilders want Labour to win General Election, says Knight Frank",
        "description": "The Knight Frank Land Index &amp; Housebuilder Survey of English housebuilders shows 70% favour Labour government plans for reform."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860950/mark-drakeford-eu-single-market-Jeremy-Miles?ruid=6c003d44-692d-4da4-9bd9-3c12f3fba60c",
        "title": "Frontrunner to replace Mark Drakeford sparks fury over EU single market demand",
        "description": "But Welsh <b>Conservatives</b> leader Andrew RT Davies said: “Miles’s comments are indicative of a man who thinks he knows better than the people of Wales. “The people of Wales voted to leave the EU, while Labour, Plaid Cymru and the Lib Dems did all they ..."
    }
]