[
    {
        "url": "https://www.huffpost.com/entry/trump-defends-anheuser-busch-stays-quiet-on-brewers-labor-dispute_n_65c3e486e4b093b2e7820c01",
        "title": "Trump Defends Anheuser-Busch, Stays Quiet On Looming Strike",
        "description": "The former president suggested it was time for conservatives to stop boycotting the brewmaker, which could see thousands of workers hit the picket lines soon."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rachel-reeves-keir-starmer-laura-trott-gdp-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "The <b>Conservatives</b> have also seized on the figure as a key attack line in the run-up to an election this year, claiming Labour would ultimately have to raise taxes to meet the “unfunded spending spree”. Labour has pointed to recent economic turmoil ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rachel-reeves-labour-keir-starmer-gdp-treasury-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "An announcement on the party’s flagship green prosperity plan is expected to be made on Thursday. Sir Keir Starmer is due to confirm that the pledge is being scaled back due to the changed economic landscape since it was first unveiled in 2021, according to multiple reports."
    },
    {
        "url": "https://uk.news.yahoo.com/caitlyn-jenner-faces-wing-rage-213853027.html",
        "title": "Caitlyn Jenner Faces Right-Wing Rage for Backing Trump on Bud Light",
        "description": "Beast / GettyOlympic champion Caitlyn Jenner is facing a slew of vicious anti-trans attacks for endorsing Trump’s call to conservatives to give Bud Light a “second chance” and end their boycott of the beer manufacturer over its brief partnership with transgender influencer Dylan Mulvaney."
    },
    {
        "url": "https://www.channel4.com/news/tories-rather-presumptively-promising-dental-changes-after-election-says-labour",
        "title": "Tories ‘rather presumptively’ promising dental changes after election says Labour",
        "description": "We spoke to the Shadow Health Secretary Wes Streeting, and began by asking who will deliver more NHS appointments – the Conservatives or Labour?"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/07/holly-valance-right-wing-conservative-leftie-rees-mogg/",
        "title": "How soap star Holly Valance became an unlikely darling of the Right",
        "description": "However, Valance got into a spot of legal trouble. She had fired her manager (and Neighbours co-star) Scott Michaelson with 15 months still remaining on his contract – and Michaelson claimed that her transition to sexpot singer was his idea in the first place. The court sided with Michaelson, ordering Valance to pay him £180,000 in lost earnings."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68232370.amp",
        "title": "Row erupts over cost of Labour&#39;s home insulation plan",
        "description": "Labour has rejected as &quot;bogus&quot; an analysis by government officials that its plan to improve home energy efficiency would cost £12-15bn a year. The party has said the measures, part of a wider £28bn green investment plan, would be capped at £6bn a year."
    },
    {
        "url": "https://www.thenational.scot/politics/24105182.conservatives-broke-promise-consult-social-energy-tariff/",
        "title": "<b>Conservatives</b> broke their promise to consult on a social energy tariff",
        "description": "I WOULD like to applaud SNP MP Marion Fellows for introducing a Ten Minute Rule motion in the House of Commons, calling for a “social"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13056551/Woke-capitalism-funds-COLLAPSED-13B-year-investors-ESG-greenwashing-leftist.html",
        "title": "&#39;Woke capitalism&#39; funds COLLAPSED by $13B last year - investors fled trendy &#39;ESG&#39; investments over low returns, greenwashing and back-door leftist agenda",
        "description": "Especially within the US, continued political scrutiny of sustainable and ESG strategies contributed to a chilling effect on demand for these funds,&#39; said Alyssa Stankiewicz, a sustainability researcher."
    },
    {
        "url": "https://uk.news.yahoo.com/mcclintock-defends-vote-against-mayorkas-173900673.html",
        "title": "McClintock defends vote against Mayorkas impeachment: Greene should ‘read the Constitution’",
        "description": "Rep. Tom McClintock (R-Calif.) on Wednesday defended his decision to vote against the impeachment of Homeland Security Secretary Alejandro Mayorkas after helping sink the move the night before. Fellow Republican Rep."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864263/keir-starmer-anti-israel-mob-protests-labour-event",
        "title": "Keir Starmer &#39;running scared&#39; of anti-Israel mob as he pulls out of event at last minute",
        "description": "Express.co.uk has asked Labour why Sir Keir has chosen to pull out but received no response. However, <b>Conservatives</b> believe he is now &quot;running scared&quot; of the protests. A Tory source said: &quot;This is exactly what Brits have come to expect: when the going gets ..."
    },
    {
        "url": "https://www.politico.eu/article/frances-right-wing-star-joins-forces-with-italys-giorgia-meloni/",
        "title": "France’s right-wing star joins forces with Italy’s Giorgia Meloni in EU Parliament",
        "description": "In a sign of EU Parliament’s rightward tilt, Marion Maréchal’s party has entered the Italian and Polish-led conservative group."
    },
    {
        "url": "https://www.hexham-courant.co.uk/news/24104352.labour-accuse-conservatives-misleading-voters-ponteland-election/",
        "title": "Labour accuse <b>Conservatives</b> of misleading voters in Ponteland election",
        "description": "Officials have confirmed that no electoral offences were committed by the Conservative Party following a row over campaign leaflets"
    },
    {
        "url": "https://inews.co.uk/news/world/australian-workers-right-ignore-calls-2894708?ico=related_article_inline",
        "title": "Australian employees will have right to ignore work calls outside office hours",
        "description": "The &#39;right to disconnect&#39; is part of a raft of changes proposed by the Australian government to protect employee rights"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864249/Nickie-Aiken-London-MP-resign-election-husband",
        "title": "Tory MP Nickie Aiken to quit her London seat at general election as exodus grows",
        "description": "Tory MP Nickie Aiken has announced she will stand down at the next general election on the same day her senior civil servant husband resigns. Alex Aiken will leave the Civil Service in April to become a communications adviser to the United Arab Emirates Ministry of Foreign Affairs, the Cabinet Office said on Wednesday."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/07/rishi-sunak-pmqs-victoria-atkins-labour-conservatives-nhs-dentists-politics-live?filterKeyEvents=false&page=with:block-65c3b2188f089d2d88787f44",
        "title": "Badenoch accuses Starmer of exploiting Brianna Ghey tragedy after Sunak makes trans jibe during PMQs – UK politics live",
        "description": "Kemi Badenoch accuses Labour leader of ‘political point-scoring’ after he condemned Rishi Sunak’s comments in PMQs"
    },
    {
        "url": "https://www.heraldscotland.com/news/24104532.snap-general-election-know-mid-march/",
        "title": "Snap general election? Why we’ll know by mid March",
        "description": "SNP insiders reckon the crunch deadline is March 15. Against a slew of polls showing the <b>Conservatives</b> trailing Labour by 20 points, one SNP source told Unspun: &quot;We are working on the basis it could be May, and we won&#39;t take that off the agenda until March 15."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/tory-mp-nickie-aiken-quit-28588205",
        "title": "Tory MP Nickie Aiken to quit at 2024 General Election",
        "description": "Tory MP Nickie Aiken is to stand down at the next election, she announced today. Her husband, Alex Aiken, who was in charge of the government&#39;s communications, is also leaving his job to work for the United Arab Emirates."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/tory-mp-nickie-aiken-to-stand-down-while-government-comms-chief-husband-quits-110024/",
        "title": "Tory MP Nickie Aiken to stand down while Government comms chief husband quits",
        "description": "Alex Aiken will leave the Civil Service to take up a new job as a communications adviser to the United Arab Emirates government."
    },
    {
        "url": "https://www.standard.co.uk/comment/rishi-sunak-gaffe-piers-morgan-bet-brianna-ghey-prime-ministers-questions-b1137732.html",
        "title": "Rishi Sunak&#39;s media gaffes are not helping the <b>Conservatives</b>",
        "description": "This is potentially tragic but hear me out: often, when watching political interviews, I place myself in the position of the politician and wonder how I would answer the question. I know the drill. I&#39;ve worked for ministers, prepared questions as well as ..."
    },
    {
        "url": "https://www.independent.co.uk/voices/letters/liz-truss-popcon-launch-jacob-rees-mogg-tory-party-b2492177.html",
        "title": "What is Liz Truss’s band of ‘Popular <b>Conservatives</b>’ really hoping to achieve?",
        "description": "Recently we saw the PopCon launch. Despite a few hard hitting speeches, there were more questions about who wasn’t there, than who was there. Hence no Simon Clarke, no Kwasi Kwarteng, and no Ranil Jayawardena. But at least former Brexit Party leader ..."
    }
]