[
    {
        "url": "https://uk.news.yahoo.com/pierre-poilievre-defends-alberta-premier-smith-on-transgender-policies-193630646.html",
        "title": "Pierre Poilievre defends Alberta Premier Smith on transgender policies",
        "description": "Conservative Leader Pierre Poilievre defended Alberta Premier Danielle Smith and her approach to transgender issues Tuesday, saying the Liberal government and the media have demonized her for policies that would give parents more say over their kids."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-europe-68218907.amp",
        "title": "Europe farmers protests: EU scraps plans to halve pesticide use",
        "description": "The head of the European Commission, Ursula von der Leyen, has announced plans to scrap a proposal halving pesticide use across the EU. The move is an apparent concession to farmers who have been protesting in many EU countries against regulations including the planned reduction in pesticide use."
    },
    {
        "url": "https://www.burytimes.co.uk/news/24102202.bury-north-mp-james-daly-appointed-deputy-chair-conservative-party/",
        "title": "Bury North MP James Daly appointed deputy chair of Conservative Party",
        "description": "Bury North MP James Daly has been appointed to a key position in Conservative Party. Mr Daly has been made deputy chair of the party, following in the footsteps of MPs Lee Anderson and Brendan Clarke-Smith, who resigned as joint-deputy chairmen over the Rwanda vote last month."
    },
    {
        "url": "https://www.leighjournal.co.uk/news/national/24102399.us-senate-deal-border-security-ukraine-aid-facing-defeat/",
        "title": "US Senate deal on border security and Ukraine aid facing defeat",
        "description": "The Democratic president has urged lawmakers to embrace a bipartisan Senate deal that pairs border enforcement measures with 60 billion dollars (£48 billion) in wartime aid for Ukraine, as well as tens of billions of dollars more for Israel, other US allies in Asia, the US immigration system and humanitarian aid for civilians in Gaza and Ukraine."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/how-wish-grown-a-time-internet-20234415/?ico=trending-post-strip_item_3",
        "title": "How I wish I’d grown up in a time without the internet",
        "description": "Joyce, Tottenham, Ex-Labour Supporter Should the <b>Conservatives</b> be more concerned? (Photo by Matt Cardy/Getty Images) Here is why the <b>Conservatives</b> are finally running out of steam. Labour supporters, with lefty civil servants, are always tearing down the ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863819/Who-is-mhairi-fraser-tory-candidate-epsom",
        "title": "Mhairi Fraser: Rising star with key role at Liz Truss’s &#39;Popular <b>Conservatives</b>&#39; launch",
        "description": "While well-known MPs spoke at the launch of Liz Truss&#39;s Popular Conservatism event, there was one unknown rising star among the line-up: Mhairi Fraser."
    },
    {
        "url": "https://news.sky.com/story/popcons-seek-to-rally-tory-base-as-they-look-to-a-post-election-future-13065575",
        "title": "PopCons seek to rally Tory base as they look to a post-election future",
        "description": "Liz Truss may have been ousted from Number 10 after just 49 days. But she has support from certain Conservative MPs for her ideas to live on."
    },
    {
        "url": "https://www.irishnews.com/news/world/us-senate-deal-on-border-security-and-ukraine-aid-facing-defeat-JLIKT5WB7FMV3PRPY6QIO3XLOQ/",
        "title": "US Senate deal on border security and Ukraine aid facing defeat",
        "description": "The Democratic president has urged lawmakers to embrace a bipartisan Senate deal that pairs border enforcement measures with 60 billion dollars (£48 billion) in wartime aid for Ukraine, as well as tens of billions of dollars more for Israel, other US allies in Asia, the US immigration system and humanitarian aid for civilians in Gaza and Ukraine."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mps-nhs-daisy-cooper-wes-streeting-bbc-b1137518.html",
        "title": "Dentists to be offered cash to take on new patients, leaked plans suggest",
        "description": "The NHS Dental Recovery Plan was supposed to be published on Wednesday but an early version was sent to MPs of all parties accidentally."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/labour-28bn-green-pledge-confusion-tories-election/",
        "title": "Labour’s £28bn green pledge confusion ‘gives Tories election hope’",
        "description": "Strategists believe leadership’s uncertain approach could bode well for Conservatives if replicated in campaign"
    },
    {
        "url": "https://www.thenational.scot/news/24102168.lee-anderson-claims-coal-sustainable-popular-conservatives-launch/",
        "title": "Lee Anderson claims coal is sustainable at Popular <b>Conservatives</b> launch",
        "description": "A FORMER deputy chairman of the Conservative Party has claimed that coal is a “sustainable” fuel because it was once made up of “trees"
    },
    {
        "url": "https://www.lbc.co.uk/news/by-election-tripping-point-tory-disaster-nadine-dorries/",
        "title": "Tories losing next week&#39;s by-election will be &#39;tipping point&#39; for &#39;seismic&#39; election defeat, Nadine Dorries tells LBC",
        "description": "The Tories losing next week&#39;s by-election in Wellingborough will act as a &#39;tipping point&#39; before the party faces a &#39;seismic&#39; electoral wipeout, Nadine Dorries has told LBC."
    },
    {
        "url": "https://metro.co.uk/2024/02/06/how-wish-grown-a-time-internet-20234415/",
        "title": "How I wish I’d grown up in a time without the internet",
        "description": "Generation X, the cohort born roughly between 1965 and 1980, stands as the final generation to truly comprehend life without the incessant presence of a smartphone or computer screen. In today’s MetroTalk, a Gen-Z (1997 – 2012) reader expresses nostalgia for an era untouched by the pervasive influence of internet-induced ‘brain rot.’"
    },
    {
        "url": "https://www.cityam.com/truss-warns-of-left-wing-extremists-as-she-seeks-to-galvanise-secret-tories/",
        "title": "Truss warns of ‘left-wing extremists’ as she seeks to galvanise ‘secret Tories’",
        "description": "Liz Truss has hit out at Rishi Sunak for failing to take on “left-wing extremists” she said had gained control of UK institutions."
    },
    {
        "url": "https://www.ft.com/content/dbbd9998-b530-46de-a9d9-08a0bf3591ed",
        "title": "Among US <b>conservatives</b>, the dial is finally shifting on welfare",
        "description": "The writer is an FT contributing editor and executive director of American Compass Last week’s fight among US <b>conservatives</b> over the meaning of “welfare” exposed a deepening rift between the movement’s older anti-government institutions and a newer ..."
    },
    {
        "url": "https://leamingtonobserver.co.uk/news/kenilworth-and-southams-lib-dem-candidate-calls-for-change-48155/",
        "title": "Kenilworth and Southam&#39;s Lib Dem candidate calls for change",
        "description": "Jenny Wilkinson took to the podium in Barford with a rousing speech declaring the Liberal Democrats are ready to change the political landscape."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863737/liz-truss-popular-conservativism-group",
        "title": "I was at the launch of Liz Truss’s ‘Popular <b>Conservatives</b>’ movement - I still don’t get it",
        "description": "But since 2022 we’ve seen the New <b>Conservatives</b>, the Conservative Growth Group, and the Conservative Democratic Organisation spring up. Then there’s the China Research Group, the Net Zero scrutiny group, and that’s before you mention the centrist ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/06/rishi-sunak-rwanda-piers-morgan-bet-conservatives-labour-uk-politics",
        "title": "Liz Truss and Jacob Rees-Mogg attack ‘left-wing extremists’ and ‘Davos man’ at launch of new Tory group – as it happened",
        "description": "Speakers at the ‘PopCons’ event in London attacked the ECHR, WHO, Davos attendees, ‘anti-capitalists’ and ‘wokery’"
    },
    {
        "url": "https://inews.co.uk/news/gary-lineker-bbc-social-media-guidelines-2892057",
        "title": "Gary Lineker claims he helped write BBC’s social media guidelines",
        "description": "Gary Lineker has claimed that he helped write the BBC’s updated social media guidelines which allow him to share his political views."
    },
    {
        "url": "https://utilityweek.co.uk/smart-energy-gb-wasted-money-by-going-full-pelt-from-day-one-ex-director-says/",
        "title": "Smart Energy GB wasted money by going full pelt from day one, ex-director says",
        "description": "A former Smart Energy GB (SEGB) director has urged the government to learn from the failings of the smart meter rollout before establishing a similar campaign body for heat pumps. Robert Cheesewright,"
    },
    {
        "url": "https://inews.co.uk/news/jeremy-hunt-stamp-duty-housing-crisis-2892905?ITO=msn",
        "title": "If Jeremy Hunt made simple tweaks to stamp duty, he could fix the housing crisis",
        "description": "Nobody enjoys paying taxes. Not really. Which is why the <b>Conservatives</b> continue to insist that, at some point, they will cut taxes. There’s an election to win. Chancellor Jeremy Hunt’s tax cutting ambitions have been thwarted after the International ..."
    },
    {
        "url": "https://uk.news.yahoo.com/lee-anderson-argues-coal-sustainable-171141879.html",
        "title": "Lee Anderson argues coal is sustainable because it used to be ‘trees and plants’",
        "description": "Speaking at the launch of a new Tory faction – the so-called Popular <b>Conservatives</b> – Lee Anderson said he wanted to see the opening of coal mines as well as fracking in the UK. He said: “I am an ex-coal miner and I’m one of these people that want ..."
    },
    {
        "url": "https://uk.news.yahoo.com/nigel-farage-conservatives-facing-extinction-143100338.html",
        "title": "Nigel Farage: <b>Conservatives</b> facing &#39;extinction event&#39; and he&#39;s aiming to replace them",
        "description": "Headlined by former prime minister Liz Truss, the group claims it is not looking to replace Rishi Sunak as leader of the <b>Conservatives</b>, but instead spark a debate on ideas. Politics latest: Truss: Supporters of LGBT groups and ethnic minorities are ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/february-by-election-wellingborough-peter-bone-kingswood-b2491278.html",
        "title": "February by-elections: Everything you need to know as Peter Bone’s seat up for grabs",
        "description": "Two seats that the <b>Conservatives</b> held since the 1990s are up for grabs, while Labour have one of their own to defend. With the Tories getting over 50 per cent of the vote in both of the contested seats at the last general election, it would mark a terrible ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/0/lack-of-nhs-dental-care-in-bristol-sees-queues-form-at-dawn/?utmsource=email",
        "title": "No end in sight... day two in the queue to see an NHS dentist",
        "description": "The long line along Ashley Court began forming early on Tuesday morning Credit: Tom Wren / SWNS Preet Gill, the shadow health minister, said: “These queues lay bare the state of dentistry after 14 years of the <b>Conservatives</b>. The consequences for patients ..."
    },
    {
        "url": "https://uk.news.yahoo.com/senate-deal-border-security-ukraine-172121757.html",
        "title": "Senate deal on border security and Ukraine aid faces defeat as Republicans ready to block bill",
        "description": "A bipartisan Senate deal intended to curb illegal crossings at the U.S. border with Mexico faced almost certain defeat Tuesday as Senate Republicans signaled their opposition, stranding President Joe Biden with no clear way to advance aid for Ukraine through Congress."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/mps-dentists-nhs-daisy-cooper-wes-streeting-b2491665.html",
        "title": "Dentists to be offered cash to take on new patients, leaked plans suggest",
        "description": "The NHS Dental Recovery Plan was supposed to be published on Wednesday but an early version was sent to MPs of all parties accidentally."
    },
    {
        "url": "https://morningstaronline.co.uk/article/truss-summons-secret-tories-fight-davos-and-left",
        "title": "Truss summons ‘Secret Tories’ to fight Davos and Left",
        "description": "SECRET Tories were summoned to the fight against “Davos man” and the global left at today’s launch of the Popular Conservatives movement. The new group is fronted by ex-premier Liz Truss, who used her speech to rail against “wokery,” obstructive institutions, left-wing “extremists” and environmentalists."
    },
    {
        "url": "https://inews.co.uk/news/gary-lineker-bbc-social-media-guidelines-2892057?ico=related_article_inline",
        "title": "Gary Lineker claims he helped write BBC’s social media guidelines",
        "description": "Gary Lineker has claimed that he helped write the BBC’s updated social media guidelines which allow him to share his political views."
    }
]