[
    {
        "url": "https://www.thetimes.co.uk/article/the-times-view-election-policies-labour-lite-k6003jsph",
        "title": "The Times view on election policies: Labour Lite",
        "description": "I t is highly likely that Sir Keir Starmer will lead a Labour government with a big majority within a few months. Opinion polls yield a consistent message that the party is about"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-labour-nominate-political-columnists-house-of-lords-2900258?ico=related_article_inline",
        "title": "Tories and Labour both nominate political columnists to House of Lords",
        "description": "The Conservatives and Labour have both nominated political columnists to the House of Lords, as 13 new life peers were announced by the Government. Downing Street published the latest list of political peerages on Friday as MPs were on holiday."
    },
    {
        "url": "https://www.mirror.co.uk/news/health/huge-majority-uks-dentists-think-32090957",
        "title": "Huge majority of UK&#39;s dentists think Rishi Sunak&#39;s <b>Conservatives</b> are harming the NHS",
        "description": "A pair of surveys questioning more than 3,000 dentists across the UK revealed that two-thirds of them now plan to go private – and a whopping 90% think Rishi Sunak&#39;s Conservative government is to blam"
    },
    {
        "url": "https://news.sky.com/story/sir-rod-stewart-says-labour-deserve-a-crack-at-running-the-country-13067683",
        "title": "Sir Rod Stewart says Labour &#39;deserve a crack&#39; at running the country",
        "description": "Rock legend and long-time Tory voter Sir Rod Stewart has thrown his weight behind Sir Keir Starmer&#39;s leadership as he attacked Boris Johnson as a &quot;lying schoolboy&quot;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13065831/petition-Taylor-Swift-Super-Bowl-vote-Travis-Kelce-election-pysop.html",
        "title": "Some 30,000 progressives sign petition urging Taylor Swift to &#39;flash a QR code&#39; at Super Bowl to drive voter registration, fuelling theory that Travis Kelce romance is ...",
        "description": "By Friday, more than 28,000 people had inked the petition calling on Swift to use her stardom and the Super Bowl 58 spotlight in Las Vegas on Sunday to drum up support for the Democrats."
    },
    {
        "url": "https://www.thenational.scot/news/24110920.donald-cameron-quits-msp-role-become-lord-scotland-office/",
        "title": "Donald Cameron quits MSP role to become Lord in Scotland Office",
        "description": "A TORY MSP has quit Holyrood to join the Scotland Office in Westminster as a Lord, it has been confirmed. Donald Cameron, previously a Scottish Conservatives MSP for the Highlands and Islands, has been appointed as a parliamentary under secretary of state in the Scotland Office."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68251300?at_campaign=KARANGA&at_medium=RSS",
        "title": "Ed Miliband: I didn&#39;t think of quitting over Labour&#39;s green U-turn",
        "description": "Ed Miliband has insisted he did not consider quitting over Labour&#39;s decision to junk its pledge to spend £28bn a year on green projects. Labour&#39;s shadow net zero secretary, a key backer of the policy,"
    },
    {
        "url": "https://news.stv.tv/scotland/nhs-treating-fewer-patients-than-pre-covid-as-services-struggle-to-recover",
        "title": "NHS treating fewer patients than pre-Covid as services &#39;struggle to recover&#39;",
        "description": "The Institute for Fiscal Studies (IFS) has outlined that measured hospital activity &#39;fell rapidly&#39; during the pandemic."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066809/Ed-Miliband-insists-DIDNT-consider-quitting-Labours-green-U-turn-Keir-Starmer-Rachel-Reeves-junk-28bn-spending-plans-plunge-party-chaos.html",
        "title": "Ed Miliband insists he DIDN&#39;T consider quitting over Labour&#39;s green U-turn after Keir Starmer and Rachel Reeves junk £28bn spending plans to plunge party into chaos",
        "description": "It is going to be a bleak inheritance after the damage the <b>Conservatives</b> have done to our economy.&#39; September 27, 2021: Rachel Reeves unveils the £28billion-a-year green spending pledge, saying there would be &#39;no dither, no delay&#39; in delivering it if ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-act-green-u-turn-2900030?ico=most_popular",
        "title": "‘S**t politics’: Starmer urged to get his act together after green U-turn",
        "description": "Labour needs to be “more clear” and “nimbler” in telling voters how it would govern after abandoning its biggest spending pledge, insiders have urged Sir Keir Starmer. The Leader of the Opposition has insisted that voters “appreciate us being straight” after he scaled back a £28bn-a-year green investment pledge to less than £5bn."
    },
    {
        "url": "https://www.independent.co.uk/news/toby-keith-ap-iraq-merle-haggard-jason-aldean-b2493811.html",
        "title": "Toby Keith wrote all kinds of country songs. His legacy might be post-9/11 American anger",
        "description": "Country music fans are celebrating Toby Keith&#39;s rich collection of songs in the wake of his death from stomach cancer"
    },
    {
        "url": "https://uk.news.yahoo.com/trudeau-pissed-off-bell-medias-174111730.html",
        "title": "Trudeau &#39;pissed off&#39; by Bell Media&#39;s &#39;garbage decision&#39; to lay off thousands",
        "description": "A fired-up Prime Minister Justin Trudeau unleashed on Bell Media on Friday, calling its move to lay off thousands of employees — including hundreds of journalists — a &quot;garbage decision.&quot;&quot;I&#39;m pretty pissed off about what&#39;s just happened,"
    },
    {
        "url": "https://www.churchtimes.co.uk/articles/2024/16-february/news/uk/llf-road-map-to-rebuilding-trust-set-out-at-general-synod-briefing",
        "title": "LLF road map to ‘rebuilding trust’ set out at General Synod briefing",
        "description": "In his LLF paper, Living in Love, Faith, and Reconciliation, Bishop Snow writes: “We are at a crossroads — either we have reached the point of separation, accepting that our opponents should not be part of the Church — or we must shift the debate to the question of how we live well with difference.”"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24110372.rishi-sunaks-trans-comments-big-part-tory-election-strategy/?ref=rss",
        "title": "Rishi Sunak&#39;s trans comments are a big part of Tory election strategy",
        "description": "The Prime Minister’s jibe about Sir Keir Starmer not being able to define what a woman is at Wednesday’s Prime Minister’s Questions"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-rachel-reeves-labour-ed-miliband-jonathan-reynolds-b1138206.html",
        "title": "Starmer: Ditching green spending pledge was about ‘being straight’ with voters",
        "description": "Environmental groups, trade union allies and energy industry figures have all expressed disappointment at the U-turn."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865151/keir-starmer-labour-party-by-election-result",
        "title": "Keir Starmer told ‘no Labour seat is safe’ as Tories make gain in council by-election",
        "description": "The loss comes as Labour U-turns on an election pledge to spend £28 billion a year as part of the party&#39;s Green Prosperity Plan."
    },
    {
        "url": "https://www.whtimes.co.uk/news/24110228.welwyn-hatfield-conservatives-called-reduced-rents-rise/",
        "title": "Welwyn Hatfield <b>Conservatives</b> called for reduced rents rise",
        "description": "Housing chiefs in one of England’s first garden cities should not raise council rents by more than seven per cent, Conservative councillors"
    },
    {
        "url": "https://www.thenational.scot/news/24110127.ex-surgeon-tears-disastrous-scottish-tory-health-plan/?n=@",
        "title": "Ex-surgeon tears into &#39;disastrous&#39; Scottish Tory health plan",
        "description": "A FORMER surgeon has criticised the Scottish <b>Conservatives</b>’ plans to modernise the health service in a paper that is “full of contradictions”. The party’s leader Douglas Ross unveiled a 32-page document called “A Modern, Efficient and Local NHS ..."
    },
    {
        "url": "https://www.politico.eu/article/sweden-democrats-threaten-to-quit-right-wing-eu-group-erc-if-orban-joins/",
        "title": "Sweden Democrats threaten to quit right-wing EU group if Orbán joins",
        "description": "Leading Sweden Democrats lawmaker Charlie Weimers suggested in written comments to POLITICO’s EU Election Playbook on Friday that he could pull his MEPs out of the right-wing European <b>Conservatives</b> and Reformists (ECR) group if Orbán’s Fidesz MEPs ..."
    },
    {
        "url": "https://www.express.co.uk/celebrity-news/1864935/Brian-May-Carol-Vorderman-tories-instagram?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "Brian May backs Carol Vorderman in campaign against the Tories as he issues urgent plea",
        "description": "Nothing will change under Labour.” Despite another challenging week, the Tories have rallied in the weekly tracker poll after 48 hours of Labour chaos, as <b>Conservatives</b> cut Labour&#39;s lead by two points from last week. Nevertheless, they still face a vast ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/rachel-reeves-asked-why-anyone-should-believe-the-things-you-say-after-green-u-turn_uk_65c5ef4de4b093b2e78339d2?d_id=7282898&ncid_tag=fcbklnkukhpmg00000008",
        "title": "Rachel Reeves Asked Why &#39;Anyone Should Believe The Things You Say&#39; After Green U-Turn",
        "description": "The Labour leader and shadow chancellor have said the move is necessary because the <b>Conservatives</b> have tanked the economy. “Why should anyone believe the things you say about your plans when you are prepared if the circumstances require it to just to ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/sir-rod-stewart-slams-boris-32091616",
        "title": "Sir Rod Stewart slams Boris Johnson dubbing him a &#39;lying public schoolboy&#39;",
        "description": "I didn’t used to. “And I see what the <b>Conservatives</b> get up to. Well, I liked Boris Johnson. He was a good figurehead, but he turned out to be a lying f***** public schoolboy. He got found out and things haven’t been much better since."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/09/tories-accuse-miliband-of-hiding-after-labour-junk-eco-plan/",
        "title": "Tories accuse Miliband of going into hiding after Labour ditch his £28bn eco plan",
        "description": "But his allies insist he backs party’s decision and Starmer says shadow climate secretary will take interviews soon"
    },
    {
        "url": "https://www.standard.co.uk/culture/tvfilm/rishi-sunak-up-close-itv-review-prime-minister-b1138089.html",
        "title": "Rishi Sunak: Up Close on ITV review: what do we learn about the Prime Minister? Not a right lot",
        "description": "Asthana, a former newspaper journalist now at ITV, is an amiable presence and throughout the documentary Sunak – who is not generally a fan of spontaneous interactions with the media – seems pretty relaxed about her following him around as he makes breakfast, rehearses speeches and goes to campaign events."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/09/tories-fiscally-competent-labour-28bn-green-plan",
        "title": "The frightening thing is not that Tories are paraded as more fiscally competent. It’s that even Labour believes it",
        "description": "Abandoning its £28bn green plan betrays a lack of self-belief that has long bedevilled the party, says Guardian columnist Andy Beckett"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/rishi-sunak-latest-news-labour-green-pledge-starmer-live/",
        "title": "Politics latest news: Labour in fresh green U-turn over windfall tax",
        "description": "Rachel Reeves insisted she will still be the UK’s “first green chancellor” despite tearing up Labour’s flagship £28 billion investment pledge. Ms Reeves originally made the statement during her speech at Labour Party conference in 2021."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour/labour-green-spending-rules-2899148",
        "title": "Labour must put green growth above spending rules, business insiders warn",
        "description": "Business insiders believe Labour should prioritise green infrastructure projects over its strict fiscal rules to encourage economic growth if elected, i can reveal."
    },
    {
        "url": "https://www.thenational.scot/news/24109840.tories-panned-eu-warns-anti-strike-laws-may-breach-brexit-deal/",
        "title": "Tories panned as EU warns anti-strike laws &#39;may breach Brexit deal&#39;",
        "description": "THE UK Government “could be genuinely torn” between maintaining its Brexit deal and further undermining workers’ rights after a warning"
    },
    {
        "url": "https://www.independent.co.uk/climate-change/news/rachel-reeves-labour-ed-miliband-energy-uk-jonathan-reynolds-b2493570.html",
        "title": "Starmer: Ditching green spending pledge was about ‘being straight’ with voters",
        "description": "Environmental groups, trade union allies and energy industry figures have all expressed disappointment at the U-turn."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066175/Pensioners-abandon-Tories-just-quarter-65s-planning-vote-Conservative-Reform-Labour.html",
        "title": "Pensioners abandon the Tories with just a quarter of over-65s planning to vote Conservative at the next election - down from 60% in 2019 - with a surge in support for Reform ...",
        "description": "Just 26 per cent of over-65s say they plan to vote for the Tories at the next election, down from an estimated 60 per cent who backed the party under Boris Johnson at the 2019 election."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24109511.scottish-lib-dems-announce-inverclyde-election-candidate/",
        "title": "Scottish Lib Dems announce Inverclyde election candidate",
        "description": "THE Scottish Liberal Democrats have announced their Inverclyde candidate for the next general election. Ross Stalker will contest the new Inverclyde and Renfrewshire West seat, which will take in Houston, Crosslee and Bridge of Weir."
    },
    {
        "url": "https://thenantwichnews.co.uk/2024/02/09/conservatives-win-crewe-central-ward-in-cheshire-east-council-by-election/",
        "title": "<b>Conservatives</b> win Crewe Central ward in Cheshire East Council by-election",
        "description": "The Conservatives have stunned Labour by winning the Crewe Central seat in the Cheshire East Council by-election."
    },
    {
        "url": "https://uk.news.yahoo.com/tory-msp-quits-holyrood-join-185246769.html",
        "title": "Tory MSP quits Holyrood to join Scotland Office as a Lord",
        "description": "A TORY MSP has quit Holyrood to join the Scotland Office in Westminster as a Lord, it has been confirmed. Donald Cameron, previously a Scottish Conservatives MSP for the Highlands and Islands, has been appointed as a parliamentary under secretary of state in the Scotland Office."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rod-stewart-gives-scathing-verdict-32088184",
        "title": "Rod Stewart gives scathing verdict on the Tories and says Labour &#39;deserve a crack&#39;",
        "description": "Long-time Tory Sir Rod Stewart raised concerns about how the Conservatives had switched Prime Minister twice without giving voters a say - and said Keir Starmer deserved a chance"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/douglas-ross-scottish-humza-yousaf-morocco-conservative-b1138207.html",
        "title": "Matheson urged to reject £13,000 severance pay after quitting amid iPad bill row",
        "description": "The former Scottish health secretary initially claimed almost £11,000 in roaming charges on his parliamentary expenses."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/tories-trashed-reputation-fiscal-coherence-130203238.html",
        "title": "Tories have ‘trashed reputation for fiscal coherence’, claims former Boris Johnson adviser",
        "description": "Story continues The comments mark a stinging attack on the party as both Labour and the <b>Conservatives</b> mount a push to woo business in the months ahead of an election. Anderson, who has also authored a book called ‘F**ck Business’, referencing Boris ..."
    },
    {
        "url": "https://www.ft.com/content/0d1326b7-8c83-46bc-a9c2-56ce7bb1a109",
        "title": "Keir Starmer defends green spending U-turn as Sunak claims Labour policy is in ‘tatters’",
        "description": "The Labour leader dismantled his party’s signature policy pledge on Thursday in an attempt to defend against attacks by the governing <b>Conservatives</b> that Labour would increase borrowing in office. Labour’s green prosperity plan had been its biggest ..."
    },
    {
        "url": "https://www.oaoa.com/local-news/texas-conservatives-test-how-far-they-can-extend-abortion-and-gender-transition-restrictions-beyond-state-lines/",
        "title": "Texas <b>conservatives</b> test how far they can extend abortion and gender-transition restrictions beyond state lines",
        "description": "So now, Texas <b>conservatives</b> are testing the limits of their power beyond state lines. Some cities and counties have passed so-called travel bans aimed at stopping Texans from driving to abortion appointments in other states. Meanwhile, Attorney General Ken ..."
    }
]