[
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/disillusioned-true-blue-tory-defects-richard-tice-reform/",
        "title": "‘Disillusioned true blue Tory’ to stand as MP for Richard Tice’s Reform UK",
        "description": "But after jumping ship to Reform UK at the end of 2022, Mr White, 59, is preparing to stand against the <b>Conservatives</b> and a shadow Labour minister candidate in the new constituency of Barnsley East at this year’s general election. Mr White, a councillor ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-normal-neil-kinnock-2876233?ico=more_from_this_author",
        "title": "Rishi Sunak not normal enough to pull off Major-style victory, says Neil Kinnock",
        "description": "Ex-Labour leader recalls 1992 battle with John Major and says current PM could never carry off his opponent&#39;s famous &#39;megaphone moment&#39;"
    },
    {
        "url": "https://inews.co.uk/news/politics/who-is-dougie-smith-no-10-fixer-tory-plots-2877427?ico=above_article_ticker",
        "title": "Who is Dougie Smith? The shadowy No 10 fixer linked to secret Tory plots",
        "description": "He co-founded the <b>Conservatives</b> for Change think tank. In the late nineties and early noughties, he ran a company called Fever Parties which organised swinger parties for wealthy clients. Very few photos of Mr Smith exist publicly, with the most recent ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/tube-fares-will-be-cheaper-on-fridays-under-pre-election-gi/",
        "title": "Tube fares will be cheaper on Fridays under ‘pre-election gimmick’ by Sadiq Khan",
        "description": "London <b>Conservatives</b> accused Mr Khan (pictured), on Sunday of announcing another ‘electoral stunt’ Credit: Getty Images Europe The Mayor of London has announced that all London Underground fares will be charged at off-peak rates on Fridays as ..."
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/jan/28/angela-rayner-tories-council-fund-is-cynical-pre-election-sticking-plaster",
        "title": "Angela Rayner: Tories’ council fund is cynical pre-election sticking plaster",
        "description": "Exclusive: Labour ‘under no illusions’ about mess party stands to inherit, as council leaders warn more will go bust next year Angela Rayner has accused the <b>Conservatives</b> of cynically applying a “sticking plaster” to council finances to get through ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860619/tory-plotters-rishi-sunak-may-coup-comment",
        "title": "Tory plotters warned that May day coup against Rishi Sunak is &#39;too late&#39; to oust the PM",
        "description": "In some cases they have been seen to be working with a rightwing group, the New <b>Conservatives</b> set up by MPs Danny Kruger and Miriam Cates, who became part of the so-called &quot;five families&quot; attempting to change Rishi Sunak&#39;s Rwanda Bill to make it tougher."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860622/badenoch-sends-warning-rebel-tory-mps-plotting-oust-sunak",
        "title": "Kemi Badenoch sends chilling warning to rebel Tory MPs plotting to oust Rishi Sunak",
        "description": "There is also intrigue about an unknown group of Tory donors who have funded polling that suggests the <b>Conservatives</b> are set for a 1997-style wipeout at the ballot box. It has been claimed that Tory rebels want to crown Mrs Badenoch as Conservative leader ..."
    },
    {
        "url": "https://www.vogue.co.uk/article/kylie-jenner-ageing-filler-festoons-couture-week",
        "title": "Kylie Jenner’s Ever-So-Slightly Puffy Face Isn’t The Problem Here",
        "description": "Let the Doomsday Glacier melt and Western society collapse into a nuclear hellscape populated by hermit crabs in plastic ‘shells’, but a woman looking faintly tired after a long-haul flight without being dragged for it?"
    },
    {
        "url": "https://uk.news.yahoo.com/byelection-called-durham-ont-seat-171055912.html",
        "title": "Byelection called for Durham, Ont., seat vacated by Erin O&#39;Toole retirement",
        "description": "Election night for the Durham byelection will be March 4. <b>Conservatives</b> have nominated commentator and author Jamil Jivani to try to retain the seat. The governing Liberals have put forward local councillor Robert Rock, while the NDP have nominated labour ..."
    },
    {
        "url": "https://www.hexham-courant.co.uk/news/24076845.northumberland-line-station-delays-expected-2025/",
        "title": "Northumberland Line station delays expected until 2025",
        "description": "These include problems caused by former mine networks in southeast Northumberland. Responding to his Labour opponents, Cllr Renner-Thompson pointed to the <b>Conservatives</b>’ record of delivering the project. He said: “I’ll take no lectures from hapless ..."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/business/martin-lewiss-warning-on-broken-westminster-system-should-be-heeded-the-yorkshire-post-says-4495625",
        "title": "Martin Lewis&#39;s warning on broken Westminster system should be heeded: The Yorkshire Post says",
        "description": "Responding to a report on BBC’s Sunday with Laura Kuenssberg programme, Mr Lewis light-heartedly said he would “rather wire my nipples to electrodes” than be Prime Minister – but then went on to make some serious and important points about the ..."
    },
    {
        "url": "https://news.sky.com/story/they-are-not-my-friends-kemi-badenoch-distances-herself-from-tory-rebels-who-want-her-as-leader-13058429",
        "title": "&#39;They are not my friends:&#39; Kemi Badenoch distances herself from Tory rebels who want her as leader",
        "description": "Speculation about a further potential leadership election has been building after Sir Simon Clare, the former levelling up secretary under Ms Truss, called on Mr Sunak to resign as prime minister, arguing it was the only way for the <b>Conservatives</b> to avoid ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/24077495.sir-vince-cable-visits-mid-sussex-lib-dem-campaign/",
        "title": "Sir Vince Cable visits Mid Sussex for Lib Dem campaign",
        "description": "The Liberal Democrats, who came second in the constituency in 2019, are hoping to defeat the <b>Conservatives</b> in the seat at the general election and elect the first non-Tory MP for the area since 1906. Campaigners and supporters packed out Haywards Heath ..."
    },
    {
        "url": "https://www.theguardian.com/business/2024/jan/28/governments-facing-wipeout-will-always-cut-taxes-but-there-are-better-uses-for-uks-20bn-windfall",
        "title": "Governments facing wipeout will always cut taxes but there are better uses for UK’s £20bn windfall",
        "description": "Ever since Liz Truss’s seven-week stint as prime minister, opinion polls have been consistent: the <b>Conservatives</b> are on course for a thumping defeat. Historical precedent suggests the race should get tighter as the election approaches but there is ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24079403.ruth-wishart-word-national-not-issue-snp/",
        "title": "Ruth Wishart: The word ‘national’ is not the issue for the SNP",
        "description": "The <b>Conservatives</b> were also in the makeover business. For a while, they ­favoured a torch – though the length of the holding arm varied from year to year. Then came the infamous tree which caused a fair old stushie in the traditional ranks. You can just ..."
    },
    {
        "url": "https://www.thepenn.org/news/national/conservatives-dont-deserve-to-win-election-says-former-tory-health-secretary/video_0e92e222-57c4-5f3e-abc3-10d7a8da5ba1.html",
        "title": "<b>Conservatives</b> don&#39;t deserve to win election, says former Tory health secretary",
        "description": "The only thing left to be decided is the date of the end of it.“That&#39;ll be as late as Rishi Sunak will set that, as late as he can to give himself as much chance as he can to recover the position of the <b>Conservatives</b>.”WATCH ABOVE."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/once-safe-tory-seat-now-28520364",
        "title": "This was once a safe Tory seat - now people don&#39;t know who to vote for",
        "description": "And that could have a big impact at the next general election. In years gone by, the <b>Conservatives</b> have won comfortably in Altrincham and Sale West. Sir Graham Brady, a high-ranking Tory in Westminster who has represented the constituency since 1997 ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/kemi-badenoch-prime-minister-treasury-david-frost-rishi-sunak-b1135293.html",
        "title": "Badenoch criticises Tory plotters but does not rule out leadership bid",
        "description": "Senior <b>Conservatives</b> have leapt to Mr Sunak’s defence as infighting broke out into the open this week starting with Sir Simon’s intervention. Will Dry, a former aide who conducted polling in No 10, later said the country is heading for “at least a ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-slapped-down-watchdog-31911774?mc_cid=08bd0e32d0",
        "title": "Rishi Sunak slapped down by watchdog after &#39;misleading&#39; claim asylum backlog is cleared",
        "description": "Similarly he highlighted that the overall backlog of asylum cases was at 99,000 - a massive 16 times higher than when the <b>Conservatives</b> took power. In response to Mr Carmichael&#39;s letter, Sir Robert said: &quot;The average member of the public is likely to ..."
    },
    {
        "url": "https://ca.news.yahoo.com/ex-central-banker-carney-backs-180813983.html",
        "title": "Ex-central banker Carney backs Trudeau to lead Liberals in Canada&#39;s next election",
        "description": "Canada will hold an election by the end of 2025 and current polling suggests the Liberals would be clobbered by the opposition <b>Conservatives</b> if the vote were held today, fuelling speculation the Liberals may look to replace Trudeau after nearly nine years ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/they-nerve-social-housing-tenants-28508499",
        "title": "&#39;They have a nerve&#39; - Social housing tenants to pay nearly £10 more per week in Salford",
        "description": "Social housing rents are set to increase by almost £10 per week for some residents in Salford."
    },
    {
        "url": "https://www.bbc.com/news/uk-england-south-yorkshire-68097394",
        "title": "Rother Valley: Red wall voters look set to perform about-turn",
        "description": "Since its creation in 1918, the parliamentary seat of Rother Valley had always returned a Labour MP, but all that changed when the so-called red wall crumbled in 2019. With another election due later in 2024, the BBC asked voters in the constituency whether time had changed their voting intentions."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/kemi-badenoch-says-tory-mps-plotting-against-rishi-sunak-are-not-my-friends_uk_65b614bde4b0d407294f6ae1",
        "title": "Kemi Badenoch Says Tory MPs Plotting Against Rishi Sunak Are &#39;Not My Friends&#39;",
        "description": "Kemi Badenoch has said Tory plotters hoping she will replace Rishi Sunak as prime minister before the election are “not my friends”, but did not rule out a future leadership bid. The business secretary said on Sunday that Conservative MPs needed to “stop messing around” and support Sunak."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860251/independent-wales-plaid-cymru-labour-conservatives-spt",
        "title": "An independent Wales: The &#39;only viable option&#39; or a &#39;disaster&#39; waiting to happen?",
        "description": "Andrew RT Davies, leader of the Welsh <b>Conservatives</b>, described the commission&#39;s report as &quot;naval gazing&quot; in a time when Wales was the worst-off nation in the UK, with the highest concentration of poverty, the longest NHS waiting times, a disparate housing ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860535/Nicola-sturgeon-no-longer-trusted-scots-bombshell-new-poll",
        "title": "Nicola Sturgeon &#39;no longer trusted&#39; by Scots: bombshell new poll",
        "description": "The poll also showed as Ms Sturgeon&#39;s popularity has fallen so has that of the SNP and current First Minister Humza Yousaf."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/28/if-we-win-we-have-to-be-ready-labour-prepares-for-first-100-days-as-tories-slide-into-chaos",
        "title": "‘If we win, we have to be ready’: Labour prepares for first 100 days as Tories slide into chaos",
        "description": "If he were to lead the <b>Conservatives</b> into a general election, Clarke wrote, “extinction” was “a very real possibility” for his party. So extreme was the language that it read like a Labour critique of the prime minster. “He does not get what ..."
    },
    {
        "url": "https://www.thisislocallondon.co.uk/news/24074521.long-mayor-london-serve-know/",
        "title": "How long does the Mayor of London serve? All to know",
        "description": "The Mayor of London is a critical political role currently held by Sadiq Khan, this is everything you need to know about the role."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/hedge-fund-behind-100m-shopping-28472192",
        "title": "The hedge fund behind a £100m shopping centre that nobody wanted us to know about",
        "description": "Cyrus Capital is a hedge fund company with offices in London and New York which was set up in 1999 by Stephen Freidheim, an investment advisor who has been on the board of the influential New York think tank the Council on Foreign Relations and a member of the university council at Yale."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/labour-8-billion-deliver-green-060000418.html",
        "title": "Labour Would Need £8 Billion to Deliver Green Plan Within Rules",
        "description": "Story continues The <b>Conservatives</b> can complicate things for Labour by spending more of the £13 billion fiscal buffer left over after Chancellor of the Exchequer Jeremy Hunt’s autumn fiscal statement in November. Hunt is expected to use half in his March ..."
    },
    {
        "url": "https://uk.news.yahoo.com/many-times-mayor-london-elected-050000740.html",
        "title": "How many times can a Mayor of London be re-elected and how long is a term?",
        "description": "The current Labour Mayor Sadiq Khan will be hoping to win a third time against the <b>Conservatives</b> Susan Hall and the Liberal Democrats Rob Blackie to name a few. However, before voting kicks off on May 2, there are a few key things any Londoner should know ..."
    }
]