[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/tory-by-election-councillor-only-one-year-new-homes-fight/",
        "title": "Tory by-election candidate says he will only do the job for a year",
        "description": "Sam Bromiley is running to replace Tory MP Chris Skidmore, who quit over a bill to guarantee annual oil and gas licensing rounds"
    },
    {
        "url": "https://www.thisismoney.co.uk/money/investing/article-13069217/CITY-WHISPERS-Jacob-Rees-Mogg-hits-Davos-man-including-pal-Lord-Dominic-Johnson.html",
        "title": "CITY WHISPERS: Jacob Rees-Mogg hits out at Davos man... including his pal Lord Dominic Johnson",
        "description": "Among the attendees was Somerset MP and ex-Brexit Opportunities Minister Jacob Rees-Mogg, who proudly proclaimed in a speech that &#39;the age of Davos man is over&#39;. He was referring to the gathering of the financial and political elite at the World Economic Forum, held in the Swiss ski destination last month."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/sadiq-khan-saving-pre-election-spending-spree-tories/",
        "title": "Sadiq Khan saving up for huge ‘pre-election spending spree’, say Tories",
        "description": "Sadiq Khan’s Conservative opponent Susan Hall has accused the London Mayor of “squirrelling away” vast sums to spend on the police and other services in a “pre-election spending spree”. Mr Khan is thought to be preparing to announce a funding boost for the Metropolitan Police as part of a new budget this week."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24111819.gove-young-people-shut-housing-market-turn-authoritarianism/",
        "title": "Gove: Young people shut out of housing market could turn to authoritarianism",
        "description": "Michael Gove has warned that young people shut out of the UK’s housing market could turn to authoritarianism. The Housing Secretary said a failure by the Government to tackle the housing crisis could endanger democracy, as well as the Conservatives’ chances at the general election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/michael-gove-rishi-sunak-government-the-times-jeremy-hunt-b1138387.html",
        "title": "Gove: Young people shut out of housing market could turn to authoritarianism",
        "description": "Michael Gove has warned that young people shut out of the UK’s housing market could turn to authoritarianism. The Housing Secretary said a failure by the Government to tackle the housing crisis could endanger democracy, as well as the Conservatives’ chances at the general election."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865388/reform-uk-rishi-sunak-wellingborough-kingswood-by-elections",
        "title": "‘He’s toast!’ Reform taunts Rishi Sunak as PM fights for Brexiteer vote in by-elections",
        "description": "Reform UK candidate Ben Habib believes Rishi Sunak cannot fight back as Conservatives try to hold on to Wellingborough and Kingswood seats in by-elections."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865370/army-troop-numbers-fall-ministry-of-defence-recruitment",
        "title": "Army in crisis as troop numbers slump despite £40m spent on recruitment",
        "description": "Fears Britain will not be able to counter international threats as Army falls short of target on soldiers despite Ministry of Defence investment."
    },
    {
        "url": "https://uk.news.yahoo.com/rod-stewart-calls-tories-step-165032888.html",
        "title": "Rod Stewart calls for Tories to ‘step down’ and give Labour ‘a go’ in resurfaced clip",
        "description": "The singer recently hit out at the <b>Conservatives</b>. In an interview with The Times on Friday (9 February), he called Boris Johnson a “lying f***ing public schoolboy” and called for the Tories to be booted out of No10. In a resurfaced clip from an ..."
    }
]