[
    {
        "url": "https://www.mirror.co.uk/news/politics/lee-anderson-comments-shows-nasty-32205122",
        "title": "&#39;Lee Anderson comments shows Nasty Party is back - even many Tories are sickened&#39;",
        "description": "Moderate Tories are fleeing their party in droves, unable to put up with the effluent flowing from the hard right"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13121601/Two-faced-SNP-wont-forgiven-voters-Tories-deliver-Scotland.html",
        "title": "Two-faced SNP won&#39;t be forgiven by voters… but Tories WILL deliver for Scotland",
        "description": "It is indeed – which is why no one bought his absurd claim. This week the Scottish <b>Conservatives</b> return to Aberdeen for our annual conference. Given we’re the only party unequivocally backing Scotland’s oil and gas sector, we have an altogether ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870461/Rishi-Sunak-s-5-billion-transport-plan-to-fire-up-the-north",
        "title": "Rishi Sunak&#39;s £5 billion transport plan to &quot;fire up&quot; the north",
        "description": "RISHI Sunak vowed to revitalise Britain’s forgotten regions by pumping almost £5billion into improving transport links. The PM will use cash saved by scrapping the northern leg of HS2 to upgrade roads, rail and bus services in “red wall” areas."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13122195/Rebel-Tories-threaten-crime-Bill-leads-abortion-decriminalised.html",
        "title": "Rebel Tories threaten to scupper flagship crime Bill if it leads to abortion being decriminalised",
        "description": "A number of <b>Conservatives</b> are furious that a senior Labour figure has inserted into the Criminal Justice Bill a clause that would mean women could no longer be prosecuted for ending pregnancies after 24 weeks. It is now widely believed in Westminster that ..."
    },
    {
        "url": "https://www.huffpost.com/entry/donald-trump-indictments-black-people_n_65d9f49ee4b0cc1f2f7bdc6d?s=09",
        "title": "Trump Says Criminal Indictments Are The Reason &#39;Black People Like Me&#39;",
        "description": "&quot;I’m being indicted for you, the Black population,&quot; the former president told a gathering of Black conservatives in South Carolina."
    },
    {
        "url": "https://uk.news.yahoo.com/sadiq-khan-calls-tories-morally-223809699.html",
        "title": "Sadiq Khan calls Tories morally rotten and says PM’s silence on Lee Anderson makes Muslims fair game",
        "description": "Mr Khan, standing for a third term as London mayor in May’s election, said “the last thing anyone should want” is “a repeat of the divisive, racist and Islamophobic mayoral campaign the <b>Conservatives</b> ran in London in 2016”. In an emotive ..."
    },
    {
        "url": "https://uk.news.yahoo.com/early-south-carolina-exit-poll-225619828.html",
        "title": "Early South Carolina exit poll shows highly conservative electorate, with many identifying with MAGA movement",
        "description": "Roughly 8 in 10 say that they’re <b>conservatives</b>, with more than 4 in 10 calling themselves very conservative. And only about one-third acknowledge that Joe Biden was the legitimate victor of the 2020 presidential election – similar to Iowa, but lower ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/lee-anderson-sadiq-khan-gavin-barwell-baroness-warsi-prime-minister-b1141337.html",
        "title": "PM’s silence is ‘tacit endorsement of vile remarks’ by Anderson, says mayor",
        "description": "Sadiq Khan has said Rishi Sunak’s “silence” amounts to “tacit endorsement” of Lee Anderson’s widely criticised claim that “Islamists” control the London mayor, despite the MP’s suspension from the Conservative Party. The former deputy ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/?ico=read_full_story_videotrendingbar",
        "title": "The Last Leg rips into government with blistering rant: ‘Be f***ing ashamed’",
        "description": "SNP MPs and some <b>Conservatives</b> ended up walking out of the chamber in protest, with the decision ultimately meaning the SNP were unable to vote on their own proposition. In the chaotic scenes, the Commons was filled with jeers in what many have branded ..."
    },
    {
        "url": "https://ca.news.yahoo.com/early-south-carolina-exit-poll-225619828.html",
        "title": "Early South Carolina exit poll shows highly conservative electorate, with many identifying with MAGA movement",
        "description": "Roughly 8 in 10 say that they’re <b>conservatives</b>, with more than 4 in 10 calling themselves very conservative. And only about one-third acknowledge that Joe Biden was the legitimate victor of the 2020 presidential election – similar to Iowa, but lower ..."
    },
    {
        "url": "https://www.ft.com/content/868f6c05-d7f0-4a45-bbbf-6ffb24159efd",
        "title": "Conservative party suspends Lee Anderson over Sadiq Khan comments",
        "description": "Accusation that London mayor was controlled by Islamists prompts criticism from Labour and moderate Conservatives"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-should-kick-out-32204928",
        "title": "&#39;Rishi Sunak should kick out national embarrassment Liz Truss too - but he is too weak&#39;",
        "description": "Writing for the Mirror, Labour Party Chair Anneliese Dodds says it&#39;s &#39;appalling&#39; Lee Anderson would have remained a Tory MP if he&#39;d apologised for Sadiq Khan slur"
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/local-news/fountains-switched-cambridgeshire-city-passes-28699236",
        "title": "Fountains to be switched off as Cambridgeshire city passes budget",
        "description": "Peterborough City Council has approved plans to turn off the Cathedral Square fountains, review school crossing patrols and increase council tax. The decision was made at a meeting on Wednesday, February 21, where councillors unanimously voted in favour of the budget proposals for the upcoming financial year."
    },
    {
        "url": "https://metro.co.uk/2024/02/24/donald-trump-says-joe-biden-will-us-losing-world-war-3-20341468/?ico=trending-post-strip_item_3",
        "title": "Donald Trump says ‘crookedest’ Joe Biden will have US ‘losing World War 3’",
        "description": "We won’t even be in World War 3, we’ll be losing World War 3, with weapons the likes of which nobody has ever seen before.&#39;"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/24/rural-right-wing-voters-yougov-poll-conservatives-reform-uk/",
        "title": "Rural Right-wing voters abandon Tories in huge switch to Reform UK",
        "description": "Former Conservative voters living in the countryside are shifting allegiance to Richard Tice’s party, suggests poll by Labour think tank"
    },
    {
        "url": "https://www.huffpost.com/entry/trump-says-indictments-boosted-appeal-to-black-voters_n_65d9fbafe4b0e4346d527b14",
        "title": "Trump Says His Criminal Indictments Boosted His Appeal To Black Voters",
        "description": "I got indicted for nothing, for something that is nothing,” Trump told a black-tie event for Black conservatives in South Carolina ahead of Saturday&#39;s Republican primary."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/24/observver-view-on-tory-mps-whipping-up-islamophobia-must-be-stopped",
        "title": "The Observer view: Tory MPs whipping up Islamophobia must be stopped",
        "description": "In the wake of the chaos of the Gaza debate, prominent Conservatives are trying to exploit fears of extremism for their own ends"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/24/conservatives-complain-intimidation-and-bullying-rochdale/",
        "title": "<b>Conservatives</b> complain about ‘intimidation’ and ‘bullying’ in Rochdale",
        "description": "Tory chairman Richard Holden suggested there might be a need for a “police presence at polling stations” to protect voters"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-joe-biden-cpac-b2501992.html",
        "title": "Trump claims ‘<b>conservatives</b> and people of faith’ will be ‘hunted’ under second Biden term",
        "description": "With four more years of Biden, the hordes of illegal aliens stampeding across our borders will exceed 40 to 50 million people,’ Trump claims without evidence"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13121385/lee-anderson-suspended-carol-vorderman-conservatives-sadiq-khan.html",
        "title": "Carol Vorderman mocks Lee Anderson as &#39;30p Lee&#39; after he was suspended for refusing to apologise over &#39;Islamophobic&#39; comments about Sadiq Khan - as she and others wonder if he ...",
        "description": "The former Countdown and BBC radio presenter hit out at Anderson as &#39;30p Lee&#39; - after his comments suggesting people in poverty should be able to make meals costing that much - on Saturday."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24142227.anderson-tory-whip-suspended-refusal-apologise-islamist-claim/",
        "title": "Anderson has Tory whip suspended after ‘refusal to apologise’ for Islamist claim",
        "description": "Lee Anderson has been suspended from the Conservative Party after making a widely criticised claim that London Mayor Sadiq Khan was controlled by “Islamists”. The decision was taken following the former Tory deputy chairman’s “refusal to apologise” for the remarks made on Friday, a spokesperson for chief whip Simon Hart said."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-conservatives-suspend-lawmaker-accused-171847982.html",
        "title": "UK <b>Conservatives</b> suspend a lawmaker after he accused London&#39;s mayor of being controlled by Islamists",
        "description": "The U.K.’s governing Conservative Party has suspended ties with one if its lawmakers after he accused London Mayor Sadiq Khan of being controlled by Islamists, as tensions over the Israel-Hamas war roil British politics."
    },
    {
        "url": "https://leftfootforward.org/2024/02/reform-uk-existential-threat-to-the-tories-or-here-today-gone-tomorrow/",
        "title": "Reform UK: Existential threat to the Tories or here today, gone tomorrow?",
        "description": "Emboldened by two byelections successes, Reform UK seeks to capitalise on voter disenchantment with the ruling party. But how much of a threat are they to the Tories?"
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/local-news/final-nail-coffin-peterborough-pool-28698510",
        "title": "&#39;Final nail in the coffin&#39; for Peterborough pool as former council leader says it&#39;s &#39;not worth fixing&#39;",
        "description": "Cllr Wayne Fitzgerald (<b>Conservatives</b>, West) stated that the pool is &quot;not worth fixing&quot; after reinforced autoclaved aerated concrete, or RAAC, was found in the Bishop&#39;s Road building. It&#39;s been admitted by councillors that the pool, which has been shut ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/24/lee-anderson-stripped-of-tory-whip-over-sadiq-khan-comment?ref=upstract.com",
        "title": "Lee Anderson stripped of Tory whip over Sadiq Khan comments",
        "description": "Claim by Ashfield MP that London mayor had ‘given our capital away’ to Islamists prompted widespread outrage"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870438/lord-farmer-conservative-party-families",
        "title": "Ex-top Tory blasts party for &#39;turning their backs on families&#39; in brutal swipe",
        "description": "Blair himself used the F word to powerful effect in opposition, arguing before his massive victory in 1997 that a strong society cannot be morally neutral about the family. He was completely right but ignored his own nostrum in power and focused solely on children."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24129700.general-election-poll-monmouth-newport-islwyn-seats/",
        "title": "General election poll for Monmouth, Newport and Islwyn seats",
        "description": "Prime minister Rishi Sunak has a matter of months to change the Conservatives&#39; fortunes if they want to avoid an historic Labour win in a"
    },
    {
        "url": "https://www.huffpost.com/entry/donald-trump-indictments-black-people_n_65d9f49ee4b0cc1f2f7bdc6d?ncid=engmodushpmg00000003",
        "title": "Trump Says Criminal Indictments Are The Reason &#39;Black People Like Me&#39;",
        "description": "COLUMBIA, S.C. ― Donald Trump said on the eve of South Carolina’s GOP presidential primary that his criminal indictments ― he faces 91 charges across multiple cases ― are boosting his appeal with Black voters. Addressing the Black Conservative ..."
    },
    {
        "url": "https://news.sky.com/story/lee-anderson-fuelling-anti-muslim-hatred-with-islamist-claim-says-sadiq-khan-13079767",
        "title": "&#39;Muslims are fair game when it comes to racism&#39;: Sadiq Khan slams PM for failing to condemn Lee Anderson comments",
        "description": "The Conservative former deputy chairman&#39;s claim that &quot;Islamists&quot; had &quot;got control&quot; of the London mayor, have prompted criticism from Labour and some Tories, including former cabinet minister Sajid Javid who branded them &quot;ridiculous&quot;."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68392026.amp",
        "title": "Lee Anderson: Sadiq Khan criticises PM for failing to condemn MP&#39;s remarks",
        "description": "Lee Anderson told GB News &quot;Islamists&quot; had &quot;got control&quot; of the mayor of London. His words, which follow pro-Palestinian protests outside Parliament, have been condemned by some Conservatives. But Mr Khan criticised Rishi Sunak and his Cabinet for what he called a &quot;deafening silence&quot;."
    },
    {
        "url": "https://inews.co.uk/news/sadiq-khan-slam-sunak-lee-anderson-london-2924691?ITO=msn",
        "title": "Lee Anderson is ‘pouring fuel on fire of anti-Muslim hatred’, says Sadiq Khan",
        "description": "The London Mayor has described comments made by former Tory deputy chairman Lee Anderson as ‘pouring fuel on the fire of anti-Muslim hatred’"
    },
    {
        "url": "https://inews.co.uk/news/sadiq-khan-slam-sunak-lee-anderson-london-2924691",
        "title": "Sadiq Khan slams PM for failing to condemn Lee Anderson’s ‘anti-Muslim’ comments",
        "description": "His words, which follow pro-Palestinian protests outside Parliament, have been condemned by some <b>Conservatives</b>, as well as sparking widespread criticism from Labour politicians. Mr Khan has criticised Rishi Sunak and his cabinet for what he has described ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/lee-anderson-suspended-conservatives-islamist-khan/",
        "title": "Lee Anderson suspended from Conservative Party after claiming &#39;Islamists have control of Sadiq Khan&#39;",
        "description": "Lee Anderson, the former deputy chairman of the Conservatives, has been suspended from the party after claiming that Sadiq Khan was controlled by Islamists."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68392026",
        "title": "Sadiq Khan criticises PM for failing to condemn Lee Anderson&#39;s remarks",
        "description": "Lee Anderson told GB News &quot;Islamists&quot; had &quot;got control&quot; of the mayor of London. His words, which follow pro-Palestinian protests outside Parliament, have been condemned by some Conservatives. But Mr Khan criticised Rishi Sunak and his Cabinet for what he called a &quot;deafening silence&quot;."
    },
    {
        "url": "https://news.sky.com/story/calls-for-lee-anderson-to-be-kicked-out-of-conservatives-over-divisive-and-dangerous-comments-13079525",
        "title": "Calls for Lee Anderson to be kicked out of <b>Conservatives</b> over &#39;divisive and dangerous&#39; comments",
        "description": "Politicians from across the political spectrum have criticised the MP following remarks he made about London mayor Sadiq Khan."
    },
    {
        "url": "https://www.independent.co.uk/voices/keir-starmer-quit-failure-biography-election-b2501884.html",
        "title": "Keir Starmer was going to quit as a failure three years ago – now he is on course for No 10",
        "description": "The Tories’ implosion is the biggest reason for that transformation, writes John Rentoul – but what does that mean for Labour’s prospects in power?"
    },
    {
        "url": "https://www.yellowad.co.uk/amended-southend-opposition-budget-to-soften-blow-of-cuts-branded-coalition-of-chaos/",
        "title": "Amended Southend opposition budget to soften blow of cuts branded ‘coalition of chaos’",
        "description": "Southend Conservatives have branded oppositions councillors a “coalition of chaos” after the Tory budget was torpedoed by sweeping last-minute am"
    },
    {
        "url": "https://www.onlondon.co.uk/susan-hall-stays-silent-about-lee-anderson-attack-on-sadiq-khan/",
        "title": "Susan Hall stays silent about Lee Anderson attack on Sadiq Khan",
        "description": "Conservative mayoral candidate Susan Hall has failed to join politicians from her own party in condemning false claims by a Tory MP that Islamists have “got control” of Sadiq Khan and also “got control of London” because Khan “has given our capital city away to his mates”."
    },
    {
        "url": "https://www.wokingnewsandmail.co.uk/news/poll-points-to-narrow-conservative-victory-in-woking-at-next-election-667448",
        "title": "Poll points to narrow Conservative victory in Woking at next election",
        "description": "A poll released this week by Electoral Calculus, which specialises in election data and predictions, suggests that the Conservatives will narrowly hold Woking in the next general election."
    },
    {
        "url": "https://www.lbc.co.uk/news/liz-truss-labour-urges-rishi-sunak-to-strip-former-pm-of-conservative-whip/",
        "title": "Labour urges Rishi Sunak to strip former PM Liz Truss of Conservative whip after claim of &#39;deep state sabotage&#39;",
        "description": "Labour has urged Rishi Sunak to strip Liz Truss, his predecessor as Prime Minister, of the Conservative whip after she said she was &quot;sabotaged&quot; by &quot;the deep state&quot;."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/chaotic-scenes-house-commons-amid-28679680",
        "title": "Chaotic scenes in House of Commons amid Gaza vote row",
        "description": "SNP MPs and some <b>Conservatives</b> walked out of the chamber in an apparent protest at the state of affairs as the debate reached its conclusion. Penny Mordaunt, the Leader of the Commons, complained that Speaker Lindsay had &quot;hijacked&quot; the debate and destroyed ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1870484/humza-yousaf-north-sea-oil-snp-tories-politics",
        "title": "Disaster for Humza Yousaf as brazen hypocrisy over North Sea oil laid bare by Tories",
        "description": "Humza Yousaf&#39;s position on North Sea oil is as slippery as the stuff itself, the Scottish <b>Conservatives</b> deputy leader has claimed. Meghan Gallacher attacked the First Minister of Scotland&#39;s record on oil and gas in an op-ed published in the Scottish Daily ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/24/bbc-should-be-proud-be-progressive-tim-davie/",
        "title": "BBC should be proud to be progressive, director general told staff",
        "description": "BBC people simply don’t seem to understand that not everyone shares their opinions and that to social <b>conservatives</b> the consensus BBC view on social issues and concepts like ‘diversity’ is itself controversial. “For Tim Davie to say the BBC is ..."
    },
    {
        "url": "https://www.channel4.com/news/conservative-divide-lee-anderson-suspended-for-sadiq-khan-comments",
        "title": "Conservative divide: Lee Anderson suspended for Sadiq Khan comments",
        "description": "Lee Anderson was disagreeing with former Home Secretary Suella Braverman when he made the comments that got him suspended from the <b>Conservatives</b>. Asked about her claim that Islamists are in charge of Britain, he told GB News he believes it’s Sadiq Khan ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/24/donald-trump-says-joe-biden-will-us-losing-world-war-3-20341468/?ico=zone-widget_home_us-news",
        "title": "Donald Trump says ‘crookedest’ Joe Biden will have US ‘losing World War 3’",
        "description": "Donald Trump has warned that gangs will ‘explode’ into the suburbs, ‘weaponised law enforcement’ will hunt <b>conservatives</b> and Hamas will ‘terrorise’ the streets unless he is elected back into the White House. The former president also warned ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/23/suburban-women-60-could-decide-next-election-think-tank/",
        "title": "Suburban women in their sixties could decide the next election",
        "description": "Twenty-three per cent of those surveyed voted Labour and plan to do so again, while 22 per cent intend to stick with the <b>Conservatives</b> and a further five per cent planned to switch from the Tories to Labour. Six per cent said they voted Tory in 2019 but ..."
    }
]