[
    {
        "url": "https://www.huffpost.com/entry/biden-says-he-will-shut-down-the-border-urges-congress-to-pass-deal_n_65b511e4e4b077c17ab55229",
        "title": "Biden Says He Will &#39;Shut Down The Border,&#39; Urges Congress To Pass Deal",
        "description": "Biden said he would use a new emergency authority to handle the border if lawmakers could come together to pass the compromise bill."
    },
    {
        "url": "https://leftfootforward.org/2024/01/could-the-tories-still-win/",
        "title": "Could the Tories still win?",
        "description": "Could 2024 become remembered for the British people ‘hurling the findings of the opinion polls back into the faces of the pollsters,’ as Times’ journalist George Clarke wrote following the Tories’ shock win in 1970?"
    },
    {
        "url": "https://inews.co.uk/news/politics/tory-inquiry-money-sunak-coup-2876275",
        "title": "Tory HQ probe into money behind Sunak coup amid Reform donor concerns",
        "description": "Conservatives will strip the whip from those working with mysterious group - including Lord Frost - if they have accepted funds from Reform donors"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/next-uk-general-parliamentary-election-dates/",
        "title": "When is the next general election? The dates Rishi Sunak is considering",
        "description": "The Prime Minister has hinted at an autumn poll but could call one as early as May. The Telegraph examines his options"
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24078790.cllr-martyn-cox-leader-bolton-conservatives-net-zero/",
        "title": "Cllr Martyn Cox, leader of Bolton <b>Conservatives</b> on net zero",
        "description": "You may not be aware of this but Bolton Council has a net zero target date of 2030 – this is 20 years before the UK government’s target. Yes you read that correctly, Bolton Labour council are committed to reaching this extremely challenging target, a ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/27/tory-party-rishi-sunak-nigel-farage-coup/",
        "title": "The plotters, the coup and Farage’s path to the Tory throne",
        "description": "Does Canada offer a blueprint for the predicted Conservative electoral wipeout – and a saviour to &#39;unite the Right&#39; rising from the flames?"
    },
    {
        "url": "https://inews.co.uk/news/politics/rishi-sunak-tory-plot-threat-2876230?ico=editors_picks",
        "title": "The plot against Sunak: Why ‘second rate’ Tories could still pose threat to PM",
        "description": "Despite the latest bout of Conservative infighting, some in Labour are still nervous about potential weakness in the so-called &#39;Red Wall&#39;"
    },
    {
        "url": "https://www.politico.eu/article/teresa-ribera-climate-change-europe-conservatives-fueling-far-right-green-deal-crusade/",
        "title": "EU <b>conservatives</b> are fueling far right with Green Deal crusade, Spain’s deputy PM warns",
        "description": "They tried to emulate the far right to avoid the far right. At the end, everybody goes towards the far right,’ Teresa Ribera told POLITICO."
    },
    {
        "url": "https://uk.news.yahoo.com/everyone-knows-tories-failed-says-001711017.html",
        "title": "Everyone knows the Tories have failed, says opposition leader",
        "description": "The <b>Conservatives</b> said Labour will bring &quot;economic disaster&quot; for Britain. In an era of disinformation online and fake news, Sir Keir said local newspapers are &quot;really important&quot;. He said: &quot;I think that holding sort of local representatives to account ..."
    },
    {
        "url": "https://www.huffpost.com/entry/conservatives-dei-airplane-accidents-boeing_n_65b2aafce4b04d8995105144?uq9i=",
        "title": "<b>Conservatives</b> Are Blaming A New Racist Theory For Airline Accidents",
        "description": "Some <b>conservatives</b> were more explicit in their complaints about DEI. “I’m sorry,” co-founder of far-right pressure group Turning Point USA Charlie Kirk said on his show on Tuesday. “If I see a Black pilot, I’m going to be like, ‘Boy ..."
    },
    {
        "url": "https://uk.news.yahoo.com/johnson-road-gets-rougher-110000406.html",
        "title": "For Johnson, the road gets rougher from here",
        "description": "For House Speaker Mike Johnson (R-La.), the easy part is over. The untested GOP leader stormed into the top ranks of power last fall and spent the first three months negotiating a series of spending bargains with President Biden,"
    },
    {
        "url": "https://www.yorkshirepost.co.uk/lifestyle/family-and-parenting/free-childcare-places-race-against-time-for-conservatives-to-ensure-landmark-childcare-places-pledge-4494323",
        "title": "Free childcare places: Race against time for <b>Conservatives</b> to ensure landmark childcare places pledge",
        "description": "There are barely 60 days before landmark plans to deliver state-funded childcare for thousands of two-year-olds go live. But ministers and civil servants are facing a race against time to ensure the key pledge is delivered amid accusations the programme is ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/26/labour-reform-ministerial-severance-pay-tories",
        "title": "Labour vows to reform ministerial severance pay after Tories handed £1m last year",
        "description": "If the age limit was properly enforced by the <b>Conservatives</b>, Nadine Dorries would not have received £16,876, Deborah Stedman-Scott would not have received £17,742, and both Sir David Evennett and Maggie Throup would not have been handed £10,072."
    },
    {
        "url": "https://www.standard.co.uk/comment/state-crumbling-tories-conservative-party-pretend-tax-cuts-b1135033.html",
        "title": "Tax cuts in this economy? This Tory obsession is a fiscal scorched earth strategy aimed at Labour",
        "description": "This is the logic that underpins the <b>Conservatives</b>’ fiscal scorched earth policy. Yet there are a few problems with this strategy. The first is that, according to a YouGov poll for The Times, 62 per cent of voters — including a majority of Tory ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/simon-clarke-david-frost-mps-rishi-sunak-budget-b1135104.html",
        "title": "Tory chairman teases two tax-cutting events amid election warnings for Sunak",
        "description": "The Tory party chairman has suggested there could be two tax-cutting financial announcements this year as Rishi Sunak fights to keep his MPs on-side over fears he will lead them to defeat."
    }
]