[
    {
        "url": "https://www.dailymail.co.uk/news/article-13110543/JOHN-MACLEOD-Camerons-return-like-Bobby-stepping-Dallas-shower-Tories-worse-bad-dream.html",
        "title": "JOHN MACLEOD: Cameron&#39;s return was like Bobby stepping out of the Dallas shower. But for the Tories, this is worse than a bad dream",
        "description": "In the small hours of last Friday, the <b>Conservatives</b> lost two more Parliamentary by-elections. Scott Benton’s disgrace – he lost his appeal against a 35-day suspension from the Commons – in all likelihood means a coming, hopeless bid to defend ..."
    },
    {
        "url": "https://news.sky.com/story/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm-13077878",
        "title": "What happened in the Commons today - and can the Speaker be sacked?",
        "description": "Despite anger from his clerk, and feathers being spat by a number of MPs, Sir Lindsay decided both the government and Labour&#39;s amendments to the SNP&#39;s motion could and would be voted on, claiming he wanted to give the House as many options as possible when debating such an emotive topic."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13111039/mike-johnson-freedom-caucus-government-shutdown-spending-bill.html",
        "title": "Hardline Republicans threaten a government shutdown with NINE days until funding runs out: <b>Conservatives</b> issue new set of spending demands to Mike Johnson",
        "description": "The House Freedom Caucus is turning up the heat on Speaker Mike Johnson, telling him to meet their conservative demands in a budget deal or risk a government shutdown."
    },
    {
        "url": "https://uk.movies.yahoo.com/matt-schlapp-boasts-banning-liberal-223028004.html",
        "title": "Matt Schlapp Boasts About Banning Liberal Media From Now-Irrelevant CPAC",
        "description": "Anna Moneymaker/GettyAmerican Conservative Union chairman Matt Schlapp boasted on Wednesday that he has implemented a “new rule” banning liberal media outlets from covering this week’s Conservative Political Action Conference."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68362405.amp",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "A Commons debate on calls for a ceasefire in Gaza descended into chaos, after the Speaker was accused of allowing it to be &quot;hijacked&quot; by Labour. Sir Lindsay Hoyle sparked fury from the SNP and Conservatives when he broke with convention to allow a vote on a Labour motion for an &quot;immediate humanitarian ceasefire&quot;."
    },
    {
        "url": "https://news.sky.com/story/speaker-clinging-on-to-job-as-33-mps-sign-no-confidence-motion-after-commons-gaza-vote-descends-into-row-13077779",
        "title": "Speaker clinging on to job as 33 MPs sign no-confidence motion after Commons Gaza vote descends into row",
        "description": "An SNP opposition day starts with a row over Sir Lindsay Hoyle&#39;s decision to select a Labour amendment and ends with a mass walkout of MPs."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/21/debate-gaza-commons-labour-tories-snp-row-lindsay-hoyle/",
        "title": "How debate on Gaza conflict descended into war of words, with Sir Lindsay Hoyle in eye of storm",
        "description": "Sir Lindsay Hoyle is facing calls to quit after an extraordinary day when the Commons descended into chaos over a debate on Gaza. The Speaker enraged the Tories and the Scottish National Party by going against official advice to controversially select a Labour amendment."
    },
    {
        "url": "https://www.itv.com/news/2024-02-21/labour-says-gaza-ceasefire-plan-is-different-to-snps-ahead-of-vote",
        "title": "Pressure mounts on Speaker Lindsay Hoyle after Commons chaos following Gaza ceasefire debate",
        "description": "Labour has faced criticism for not calling for an immediate ceasefire in Gaza sooner, including a mass rebellion from members in November. | ITV National News"
    },
    {
        "url": "https://metro.co.uk/2024/02/21/happened-house-commons-gaza-ceasefire-vote-chaos-explained-20323752/?ico=trending-post-strip_item_1",
        "title": "What happened with UK Gaza ceasefire vote as Lindsay Hoyle’s future is questioned",
        "description": "Speaker of the House, Sir Lindsay Hoyle, was forced to return and apologise for selecting amendments by both Labour and the <b>Conservatives</b> to the SNP’s ceasefire motion – which has never been done before. Sir Lindsay said he wanted MPs to have the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/gaza-ceasefire-vote-descends-into-chaos-and-anger-as-snp-and-tories-walk-out-2919643?ico=related_article_inline",
        "title": "Gaza ceasefire vote descends into chaos and anger as SNP and Tories walk out",
        "description": "Labour leader Sir Keir Starmer speaks during Prime Minister’s Questions in the House of Common on Wednesday (Photo: PA) He added: “Unfortunately, the <b>Conservatives</b> and the SNP decided to walk out hand-in-hand, refusing to vote on this serious matter ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68362405",
        "title": "Commons descends into chaos over Gaza ceasefire vote",
        "description": "A Commons debate on calls for a ceasefire in Gaza descended into chaos, after the Speaker was accused of allowing it to be &quot;hijacked&quot; by Labour. Sir Lindsay Hoyle sparked fury from the SNP and Conservatives when he broke with convention to allow a vote on a Labour motion for an &quot;immediate humanitarian ceasefire&quot;."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/results-uks-gazas-ceasefire-vote-revealed-20323318/?ico=trending-post-strip_item_4",
        "title": "UK government votes to call for an ‘immediate ceasefire’ in Gaza",
        "description": "The UK government voted on Wednesday evening after Commons Speaker Sir Lindsay Hoyle selected amendments by both Labour and the <b>Conservatives</b> to the SNP’s ceasefire motion. SNP MPs walked out of the chamber over the ‘chaos’ caused by the Speaker’s ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-parliament-plunged-chaos-over-234329678.html",
        "title": "UK parliament plunged into chaos over Gaza ceasefire vote",
        "description": "Lawmakers from the governing <b>Conservatives</b> and the opposition Scottish National Party (SNP) left the debating chamber in protest and some tried to take the rare step of holding proceedings in private. The speaker, Lindsay Hoyle, eventually apologised and ..."
    },
    {
        "url": "https://uk.news.yahoo.com/house-commons-sinks-chaos-over-212311445.html",
        "title": "House of Commons Sinks Into Chaos Over Israel-Hamas War Vote",
        "description": "(Bloomberg) -- A vote on the Israel-Hamas war triggered chaos in the UK’s House of Commons with the Scottish National Party walking out in protest and Prime Minister Rishi Sunak’s <b>Conservatives</b> also refusing to cast their ballots. Most Read from ..."
    },
    {
        "url": "https://www.lowestoftjournal.co.uk/news/national/24133128.20mph-speed-limits-working-says-welsh-government/",
        "title": "20mph speed limits working, says Welsh government",
        "description": "But the change has seen fierce opposition from the <b>Conservatives</b> in the Senedd, who have branded it a “waste of time and resources”. The TfW data shows that average speeds have dropped from 28.9mph to 24.8mph since the measure was put in place."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/haley-south-carolina-democrats-independents-b2500269.html",
        "title": "Haley courts Democrats and independents in South Carolina ahead of Saturday primary",
        "description": "Nikki Haley’s campaign is pulling out all the stops as she hopes for a showing of life in South Carolina’s Republican primary this weekend. The former governor of South Carolina continues to trail Donald Trump by a significant margin in all available ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-hamas-house-of-commons-b1140715.html",
        "title": "Labour amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "SNP MPs and some <b>Conservatives</b> walked out of the chamber in protest at Speaker Sir Lindsay Hoyle’s handling of the Gaza ceasefire debate. Commons Leader Penny Mordaunt pulled the Government’s participation, claiming Sir Lindsay had “hijacked” the ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-keir-starmer-hamas-b1140715.html",
        "title": "Labour amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "SNP MPs and some <b>Conservatives</b> walked out of the chamber in protest at Speaker Sir Lindsay Hoyle’s handling of the Gaza ceasefire debate. Commons Leader Penny Mordaunt pulled the Government’s participation, claiming Sir Lindsay had “hijacked” the ..."
    }
]