[
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/candidates-standing-rochdale-election-month-28561824",
        "title": "All the candidates standing in the Rochdale by-election this month",
        "description": "The date for the Rochdale by-election is Thursday, February 29 - which means candidates have just under four weeks to try and win the support of voters. Here is the full list of candidates and the political parties they are representing:"
    },
    {
        "url": "https://inews.co.uk/news/politics/income-tax-poll-jeremy-hunt-2887346?ico=related_article_inline",
        "title": "Poll puts Hunt under pressure to cut income tax for low earners",
        "description": "More than half (53 per cent) said they are taxed too much, with no significant difference between supporters of Labour and the <b>Conservatives</b>, the BMG Research survey for i indicates. The public are also most likely (46 per cent) to want Jeremy Hunt to cut ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/reform-party-red-wall-highest-support-richard-tice/",
        "title": "Reform support in Red Wall hits highest level ever",
        "description": "Richard Tice’s party now on 14 per cent across 40 of the traditionally Labour-held seats won by the Tories in 2019, poll shows"
    },
    {
        "url": "https://www.thenational.scot/politics/24093807.nicola-sturgeons-covid-inquiry-session-showed-scotlands-media/",
        "title": "Nicola Sturgeon&#39;s Covid Inquiry session showed up Scotland&#39;s media",
        "description": "SCOTLAND is very poorly served by its media, the broadcast media is controlled from London and pursues an avowedly British political and"
    },
    {
        "url": "https://inews.co.uk/news/politics/income-tax-poll-jeremy-hunt-2887346?ico=above_article_ticker",
        "title": "Slash income tax for low and middle earners, voters tell Jeremy Hunt in poll",
        "description": "A majority of voters believe they are taxed too much and want the Chancellor to use next month’s Budget to slash income tax on low and middle earners, a poll suggests. More than half (53 per cent) said they are taxed too much, with no significant difference between supporters of Labour and the Conservatives, the BMG Research survey for i suggests."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/cramlington-labour-candidate-general-election-28558593",
        "title": "Labour select candidate to fight newly formed Northumberland seat at general election",
        "description": "The Labour Party has unveiled its candidate for the newly formed Cramlington and Killingworth seat at the looming General Election."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/02/senior-mp-confirms-labour-has-dropped-28bn-target-for-green-investment",
        "title": "Senior MP all but confirms Labour has dropped £28bn green investment target",
        "description": "Darren Jones says party will decide budget based on state of economy and individual projects if it wins election"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/02/rishi-sunak-latest-news-red-wall-reform-uk-labour-stormont/",
        "title": "Politics latest news: Labour starts pre-election talks with civil service",
        "description": "Reform UK has hit its highest ever level of support in crucial Red Wall seats, according to a new poll. A Redfield &amp; Wilton Strategies survey, conducted between Jan 30-31, put Richard Tice’s party on 14 per cent of the vote. That was up by three points when compared to the company’s previous poll conducted between Dec 17-18."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1862517/robert-taylor-rishi-sunak-get-a-grip-or-go",
        "title": "Rishi Sunak must get a grip or go now, writes Robert Taylor",
        "description": "And by that, I don’t mean a big Labour majority, though that would be bad enough. I mean the kind of existential crisis that the Canadian <b>Conservatives</b> suffered in 1993. Okay, it might not be as bad as that. But even the most optimistic Tory forecasters ..."
    },
    {
        "url": "https://www.peterboroughtoday.co.uk/heritage-and-retro/retro/opinion-setting-the-record-straight-4503343",
        "title": "Opinion: Setting the record straight",
        "description": "Was this achieved by the new administration? No, we as <b>Conservatives</b> did it!! We have maintained and strengthened our position as one of the top retail destinations thanks to our high street, leisure, culture and entertainment offer. This includes a ..."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/02/congress-border-bill-trump-georgia-biden-election-politics-latest-updates?ref=upstract.com",
        "title": "Congress awaits border deal bill as Chuck Schumer plans vote next week – US politics live",
        "description": "Capitol Hill abuzz for details of deal tying Ukraine aid to US immigration measures after fraught negotiations and attempts by Trump to derail it"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/police-boss-apologises-comments-schoolgirls-28559321",
        "title": "Police boss apologises for comments on schoolgirls wearing &#39;very short skirts&#39;",
        "description": "A police and crime commissioner is facing calls to resign over &#39;misogynistic&#39; comments about schoolgirls wearing &#39;very short skirts&#39;."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/labour-unveils-10bn-life-sciences-28559397",
        "title": "Labour unveils £10bn life sciences plan to boost UK pharmaceutical sector ahead of 2024 General Election",
        "description": "Labour said that under the Conservatives, the life sciences sector has declined, stating that the UK&#39;s share of global exports is down from 9% to 4%, with the share of global pharmaceutical R&amp;D falling from 7.2% to 3.2% between 2012 and 2020."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/home-office-james-cleverly-robert-jenrick-london-zac-goldsmith-b1136562.html",
        "title": "Calls for ‘urgent’ Home Office review into alkali attack suspect’s asylum claim",
        "description": "The details of the case have renewed calls from some Tory MPs for serious reform of the asylum system, with former immigration minister Robert Jenrick calling on Home Secretary James Cleverly to carry out a “detailed review” of how Ezedi was allowed to remain in the UK."
    },
    {
        "url": "https://www.mirror.co.uk/news/weird-news/britains-most-tattooed-man-quits-32030947.amp",
        "title": "&#39;Britain&#39;s most tattooed man&#39; quits ink to pay mortgage and ditches &#39;risky&#39; arm implants",
        "description": "I&#39;m coming off a fixed rate like so many other people, but hopefully, I&#39;ll be able to get this fixed again in future – thanks <b>Conservatives</b> for crashing the economy – roll on the general election. &quot;I&#39;m trying to stay reserved and disciplined to my ..."
    },
    {
        "url": "https://www.wrexham.com/news/independence-may-be-viable-option-but-not-a-desirable-one-said-wales-first-minister-246670.html",
        "title": "“Independence may be viable option but not a desirable one”, said Wales’ first minister",
        "description": "Mark Drakeford gave a statement to the Senedd about the Independent Commission on the Constitutional Future of Wales. ‌﻿​﻿‌﻿‌﻿​﻿​﻿​﻿‌﻿‍﻿‌﻿​﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿​﻿‌﻿​﻿​﻿‍﻿‌﻿​﻿‌﻿‌﻿‌﻿​﻿‌﻿‌﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿​﻿‍﻿‌﻿​﻿​﻿‌﻿‌﻿‌﻿​﻿​﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿‌﻿‍﻿‌﻿‌﻿​﻿​﻿‌﻿‌﻿​﻿​"
    },
    {
        "url": "https://uk.news.yahoo.com/four-trends-ll-see-online-125433411.html",
        "title": "Four trends you’ll see in online election campaigns this year",
        "description": "Over the past decade, social media has become an essential component of election campaigns. But in 2024, the options seem endless. With a record number of elections taking place around the world, how will digital campaigning look different this year?"
    },
    {
        "url": "https://www.ft.com/content/ba53e42b-14fc-49ce-b971-3072d23ea977",
        "title": "Who still votes Conservative?",
        "description": "Gender, age, religion: the new faultlines in how the UK votes"
    },
    {
        "url": "https://www.independent.co.uk/voices/tories-wrong-tax-business-keir-starmer-b2489494.html",
        "title": "It’s not just the Tories getting it badly wrong on tax and business...",
        "description": "Despite its 20-point lead, Labour is badly faltering on the issues that matter, writes Andrew Grice. Are Keir Starmer’s critics right to say that he represents a continuation of the same old status quo?"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/taylor-swift-biden-psyop-conspiracy-b2489364.html",
        "title": "Is Taylor Swift a Biden psyop? Here’s the far-right’s ‘evidence’",
        "description": "Conservative media storm erupts over deranged suggestion that pop superstar could be Democratic ‘psyop’ used to brainwash voters into turning away from Donald Trump, writes Joe Sommerlad"
    },
    {
        "url": "https://metro.co.uk/2024/02/02/sat-brianna-ghey-trial-this-like-2-20214548/?ico=metro-posts_gadgets_whats-trending-now",
        "title": "I sat through the Brianna Ghey trial – this is what I learned as a trans person",
        "description": "series. She fancied her date - until he admitted to being a Just Stop Oil protester. Labour MP Dawn Butler shines a light on the small change the <b>Conservatives</b> have made recently that could help them steal the election. She reckons you didn&#39;t even notice."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-environment-climate-election-keir-starmer-b1136586.html",
        "title": "Labour leadership feel heat as they go cold over £28billion green plan",
        "description": "The opposition leadership has gone from a firm promise in 2021 to invest £28 billion a year on a “Green Prosperity Plan”, via increased borrowing, to merely an “ambition” to come up with the money in the second half of the next Parliament, subject to fiscal rules."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "Given what Stephen’s saying about the importance of valence voters and people assessing competence, is this the kind of deal that could see the <b>Conservatives</b> get a bit of a political dividend? Miranda Green So I think the problem with using Northern ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sunak-tells-tories-england-cricket-132133378.html",
        "title": "Sunak tells Tories they are like England cricket team – down but not out",
        "description": "The <b>Conservatives</b> have been trailing Labour in the polls by around 20 points for months – but the Tory leader told his troops this year’s general election could still be won. The PM made the comparison at a dinner with around 100 of his MPs on Thursday ..."
    },
    {
        "url": "https://www.lgbtqnation.com/2024/02/conservatives-lose-their-minds-over-jesus-as-a-scantily-clad-white-twink-on-a-poster/",
        "title": "<b>Conservatives</b> lose their minds over Jesus as a scantily clad white twink on a poster",
        "description": "A poster depicting Jesus Christ as a cute, white, scantily-clad youth has sparked controversy in Spain. As NBC News reports, the Council of Brotherhoods in Seville, Spain, commissioned renowned painter Salustiano García to create the arresting image for a poster promoting the city’s Easter festivities."
    },
    {
        "url": "https://www.al.com/reckon/2024/02/conservatives-resistances-to-tax-credit-expansion-adds-to-tensions-on-immigration.html",
        "title": "<b>Conservatives</b> resistances to tax credit expansion adds to tensions on immigration",
        "description": "House Republicans struggled to get on board with a tax plan that addresses childhood poverty over concerns about undocumented families. Now the bill heads to the Senate."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/fury-james-cleverly-pleads-26billion-32030006",
        "title": "Fury as James Cleverly pleads for £2.6billion to plug Home Office asylum black hole",
        "description": "Tories have been accused of &#39;busting the budget&#39; after Home Secretary James Cleverly said he needed an extra £2.6billion to plug a Home Office budget black hole"
    },
    {
        "url": "https://www.libdems.org.uk/press/release/sunak-slammed-as-quarter-of-pharmacy-budgets-cut-since-2015",
        "title": "Sunak slammed as quarter of pharmacy budgets cut since 2015",
        "description": "The Liberal Democrats have slammed the Conservatives for failing pharmacies as reports show hundreds of millions of pounds worth of cuts since 2015."
    },
    {
        "url": "https://metro.co.uk/2024/02/02/sat-brianna-ghey-trial-this-like-2-20214548/?ico=more_text_links",
        "title": "I sat through the Brianna Ghey trial – this is what I learned as a trans person",
        "description": "The transphobia felt unbearable at times. Like when planning Brianna’s murder, the defendants exchanged messages including transphobic slurs and other transphobic material, such as references to her genitalia, questioning whether she would scream ‘like a man or a girl’ when killed, and Ratcliffe continually referred to her as an ‘it’."
    },
    {
        "url": "https://www.derbytelegraph.co.uk/news/local-news/candidates-two-derbyshire-dales-elections-9073548",
        "title": "Candidates for two Derbyshire Dales by-elections announced",
        "description": "Only two candidates have listed their home address, with four listing “Derbyshire Dales”. May’s elections saw the Conservatives retain the second Bakewell seat (now held by Gareth Gee) by 55 votes over Labour."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/more-misery-for-rishi-sunak-as-poll-suggests-tories-could-win-fewer-than-100-seats_uk_65bccf0ce4b0102bd2d8d2a5?d_id=7253458&ncid_tag=fcbklnkukhpmg00000008",
        "title": "More Misery For Rishi Sunak As Poll Suggests Tories Could Win Fewer Than 100 Seats",
        "description": "The Techne survey showed support for the Conservatives has fallen again to just 23%, while Labour has gone up by one point to 45%. According to the Electoral Calculus website, that would put Rishi Sunak’s party on just 93 seats - a staggering 283 fewer than they won at the 2019 election."
    },
    {
        "url": "https://www.haslemereherald.com/news/politics/opinion-dont-believe-labours-bluster-the-lib-dems-are-best-placed-to-dethrone-the-tories-663748",
        "title": "Opinion: Don&#39;t believe Labour&#39;s bluster – the Lib Dems are best placed to dethrone the Tories...",
        "description": "The Liberal Democrats are the leading challengers to the Conservatives in the new Farnham Bordon constituency, contrary to another misleading claim from the local Labour Party in the Herald last week that they are best placed to beat the Conservatives when a General Election is called."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/25670562/fury-over-abdul-ezedi-asylum-case/",
        "title": "Why was chemical attack fugitive Abdul Ezedi granted asylum in UK AFTER being convicted of sex attack, MPs fume",
        "description": "FURIOUS MPs today demanded to know why chemical attack fugitive Abdul Ezedi was granted asylum in Britain AFTER being convicted of a sex attack. The Clapham attacker, originally from Afghanistan,"
    },
    {
        "url": "https://news.sky.com/story/clapham-chemical-attack-big-questions-for-government-after-chemical-attack-suspect-given-asylum-after-criminal-conviction-13061433",
        "title": "Clapham chemical attack: &#39;Big questions&#39; for government - as more details of chemical attack suspect&#39;s sexual crimes emerge",
        "description": "There are &quot;big questions&quot; for the Home Office after it emerged that the Clapham chemical attack suspect Abdul Shokoor Ezedi was granted asylum in either 2021 or 2022, despite having committed a sexual offence in 2018."
    },
    {
        "url": "https://www.politico.eu/article/europe-greens-are-on-the-ropes-eu-elections/",
        "title": "Europe’s Greens are on the ropes",
        "description": "Farmers’ ire and a right-wing surge is testing the EU’s climate goals. And the Greens that backed them are teetering."
    },
    {
        "url": "https://www.mirror.co.uk/money/labour-refuses-say-still-supports-32027652",
        "title": "Labour refuses to say if it still supports £28bn green investment pledge",
        "description": "Shadow chancellor Rachel Reeves has repeatedly refused to set out whether she is standing by her commitment to spend £28 billion a year on green investment"
    },
    {
        "url": "https://news.stv.tv/world/snp-and-labour-on-course-to-win-same-number-of-westminster-seats-poll-suggests",
        "title": "SNP and Labour on course to win same number of Westminster seats, poll suggests",
        "description": "The SNP and Labour will win the same number of seats at the next general election, a new poll suggests. A survey for advisory firm True North by Survation questioned 1,029 people between January 23 and 25, and put Humza Yousaf’s party on 36% of decided likely voters, while Labour is on 34%."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/tories-dine-at-the-happy-families-hotel/",
        "title": "Tories dine at the happy families hotel",
        "description": "HAPPY FAMILIES: Some 476 days after using it to mourn second place in the leadership contest, Rishi Sunak returned on Thursday night to Leicester Square’s “super boutique” Londoner hotel to tell more than 100 Tory MPs he can definitely win the election. Honest."
    },
    {
        "url": "https://news.sky.com/story/clapham-chemical-attack-latest-manhunt-under-way-for-suspect-with-significant-injuries-to-face-13061433?postid=7165526",
        "title": "Clapham chemical attack: &#39;Big questions for Home Office&#39; as suspect granted asylum after committing sexual offence",
        "description": "There are &quot;big questions&quot; for the Home Office after it emerged that the Clapham chemical attack suspect Abdul Shokoor Ezedi was granted asylum in either 2021 or 2022, despite having committed a sexual offence in 2018."
    },
    {
        "url": "https://uk.news.yahoo.com/scottish-tories-call-probe-politicisation-114743505.html",
        "title": "Scottish Tories call for probe into &#39;politicisation&#39; of Scotland&#39;s civil service",
        "description": "THE Scottish <b>Conservatives</b> have urged a probe into the alleged “politicisation” of the civil service in Scotland. Permanent secretary John-Paul Marks, Scotland’s most senior civil servant, has been urged to launch an investigation into an email ..."
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24091705.rebecca-pow-meets-dental-minister-dame-andrea-leadsom/",
        "title": "Rebecca Pow meets Dental Minister Dame Andrea Leadsom",
        "description": "Taunton Deane MP Rebecca Pow has met with the new Dental Minister, Dame Andrea Leadsom, to press home her views about the"
    },
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68175798.amp",
        "title": "Newspaper headlines: Chemical attack manhunt and Gazza&#39;s plea to Rashford",
        "description": "&quot;I can&#39;t see, I can&#39;t see&quot;, is the headline on the front of the Sun as it quotes a witness to the alkali attack who heard the screams of the injured mother. The mother and her two children are feared to have been deliberately targeted, according to police."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24092097.douglas-ross---man-glass-house-throwing-stones/?ref=rss",
        "title": "Douglas Ross - a man in a glass house throwing stones",
        "description": "There is something rather irritating about Douglas Ross lecturing anyone about what is good for business and the economy"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-labour-could-win-same-32023864",
        "title": "SNP and Labour &quot;could win same number of seats in Scotland at general election&quot;",
        "description": "Polling expert Professor John Curtice said &quot;SNP and Labour remain locked in a close contest for supremacy in Scotland&quot;."
    },
    {
        "url": "https://www.huffpost.com/entry/adam-schiff-katie-porter-california_n_65bbe26ee4b05c8779f84e72",
        "title": "Adam Schiff Releases Ad Boosting GOP Opponent In California Senate Race",
        "description": "Schiff holds a lead in the race, according to several polls conducted recently, while Garvey and Rep. Katie Porter (D-Calif.) are battling for second place, and Rep. Barbara Lee (D-Calif.) trails behind them."
    },
    {
        "url": "https://uk.news.yahoo.com/boebert-speaker-johnson-leadership-171521627.html",
        "title": "Boebert on Speaker Johnson: ‘We need leadership’",
        "description": "Rep. Lauren Boebert (R-Colo.) jabbed House Speaker Mike Johnson (R-La.) amid mounting conservative criticism over his negotiations with Democrats on spending measures. “I don’t want to get there, but we need leadership,"
    },
    {
        "url": "https://www.heraldscotland.com/news/24091780.robertson-launch-independence-paper-focus-culture/?ref=rss",
        "title": "Robertson to launch independence paper with focus on culture",
        "description": "Angus Robertson will today unveil the latest Scottish Government&#39;s paper making the case for independence with a focus on culture and the arts."
    },
    {
        "url": "https://www.thenational.scot/news/24092171.john-curtice-general-election-poll-shows-close-contest-supremacy/",
        "title": "John Curtice: General Election poll shows ‘close contest for supremacy&#39;",
        "description": "LEADING elections expert Professor Sir John Curtice has said “the SNP and Labour remain locked in a close contest for supremacy"
    },
    {
        "url": "https://www.peacearchnews.com/news/bc-ndp-maintaining-a-sizeable-lead-in-latest-polls-7313359",
        "title": "BC NDP maintaining a sizeable lead in latest polls",
        "description": "A Research Co. poll of decided voters gives Premier David Eby’s New Democrats a double-digit lead over the second-placed Conservative Party of BC with 46 per cent share versus 26 per cent. Research Co. conducted the poll online between Jan. 22 to Jan. 24."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/snp-labour-set-win-same-28556788",
        "title": "SNP and Labour set to win same number of seats in Scotland at 2024 General Election, poll suggests",
        "description": "The Scottish <b>Conservatives</b> polled 16% and the Scottish Liberal Democrats 8%, with 7% opting for other parties. Analysis of the results by polling expert Professor Sir John Curtice puts the two parties level on 23 seats, a drop from 48 won by the SNP in ..."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/feb/02/the-guardian-view-on-labours-28bn-green-deal-dont-prove-tories-right-by-ditching-it",
        "title": "The Guardian view on Labour’s £28bn green deal: don’t prove Tories right by ditching it",
        "description": "Editorial: Sir Keir Starmer wants to change his country for the better. That won’t happen if he drops his key industrial strategy for growth"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862313/rishi-sunak-tories-poll-wipeout",
        "title": "Rishi Sunak&#39;s Tories heading for less than 100 seats as fears of complete wipeout explode",
        "description": "EXCLUSIVE: A leading pollster has warned that the public &quot;have made up their minds on the Conservatives&quot; as Labour&#39;s massive lead grows again."
    }
]