[
    {
        "url": "https://justthenews.com/videos/matt-schlapp-says-cpac-will-continue-honoring-tradition-discounted-tickets-conservative",
        "title": "Matt Schlapp says CPAC will continue honoring tradition of discounted tickets for conservative youth",
        "description": "Conservative Political Action Conference Chairman Matt Schlapp says this year’s event will continue to honor &quot;The Reagan Promise” and offer young <b>conservatives</b> subsidized tickets. Schlapp also details former President Ronald Reagan’s long history ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/cp490rp287wo",
        "title": "Cost of living fears rife in election battleground",
        "description": "I’m not going to be 40 and still living at home.&quot; Shannon Challoner is a bingo hall cashier who sees no way of ever owning her own home. As a general election looms, the 20-year-old from from Rhyl, Denbighshire,"
    },
    {
        "url": "https://news.sky.com/story/tories-accused-of-failing-parents-as-cost-of-childcare-rises-faster-than-inflation-13075864",
        "title": "Tories accused of failing parents as cost of childcare rises faster than inflation",
        "description": "Analysis by the Labour Party shows the price of a part-time nursery place has jumped from £82 per week in 2010 to £146 now."
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/19/tories-thwarted-in-budget-ploy-to-save-aquarium-roundabout/",
        "title": "Tories thwarted in budget ploy to save Aquarium roundabout",
        "description": "But council officials have told the <b>Conservatives</b> that scrapping the final phase of the Valley Gardens scheme would mean returning grant funding to the government and the loss of money already spent. The £13 million final phase is partly funded with £6 ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/childcare-costs-shot-up-80-32163293",
        "title": "Childcare costs have shot up by 80% since 2010 as Tories accused of &#39;failing&#39; parents",
        "description": "Parents have been left thousands of pounds worse off after childcare costs soared by a third faster than inflation since the Tories came to power, according to Labour&#39;s analysis"
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/breathtaking-viewers-rage-blood-boiling-32163122.amp",
        "title": "Breathtaking viewers rage their &#39;blood is boiling&#39; just minutes into ITV drama",
        "description": "Viewers were left fuming just minutes into ITV&#39;s latest drama Breathtaking as it documents the very start of the coronavirus pandemic inside an NHS hospital in 2020"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/19/help-labour-succeed-ex-tory-minister-nick-boles/",
        "title": "I’ll do all I can to help Labour succeed, says ex-Tory minister",
        "description": "Nick Boles, who quit Conservatives over ‘refusal to compromise’ on Brexit, is helping Sir Keir Starmer’s party prepare for government"
    },
    {
        "url": "https://uk.news.yahoo.com/trump-ranks-dead-last-again-205253668.html",
        "title": "Trump Ranks Dead Last (Again) in Poll of Presidential Greatness",
        "description": "The former president always offers himself glowing superlatives, but scholars find little to admire about the presumptive 2024 GOP nominee"
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-triple-lock-tories-2914529?ico=more_from_this_author",
        "title": "Labour’s triple-lock pension pledge will force the Tories to do the same",
        "description": "Starmer and Reeves are set to commit to the state policy in their general election manifesto - it&#39;s a no-brainer for them"
    },
    {
        "url": "https://www.darlingtonandstocktontimes.co.uk/news/24129925.darlington-council-tax-increase-five-per-cent/",
        "title": "Darlington council tax to increase by five per cent",
        "description": "The rise was approved by a majority of councillors, as the local authority takes urgent measures to stave off a financial crisis. Cutbacks aimed at saving £4m per year and £16m by 2027/28 have also been announced and other savings are expected to be made through increased service charges."
    },
    {
        "url": "https://www.bbc.com/news/articles/c51ez249k8jo",
        "title": "Darlington households to pay more council tax",
        "description": "Council tax bills for households in Darlington are set to increase by about 5%. The rise was approved as the local authority takes urgent measures to stave off a financial crisis, the Local Democracy Reporting Service said."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-wales-politics-68336717.amp",
        "title": "Mark Drakeford: Not up to farmers to decide how subsidies spent",
        "description": "Wales&#39; outgoing first minister has defended plans to ask farmers to plant trees on their land in return for cash. Mark Drakeford spoke following recent go-slow protests sparked by proposed changes to how agriculture is subsidised."
    },
    {
        "url": "https://www.thetimes.co.uk/article/ursula-von-der-leyen-second-term-european-commission-president-nkfmvblml",
        "title": "Ursula von der Leyen set for second term as European Commission head",
        "description": "“I am taking a very conscious and well-considered decision. I would like to run for a second term in office,” she said today, thanking the German Christian Democrats for nominating her as “the top candidate” for European <b>conservatives</b>."
    },
    {
        "url": "https://www.standard.co.uk/news/uk/ukraine-family-visa-scheme-close-conservatives-home-office-b1140119.html",
        "title": "<b>Conservatives</b> criticised for closing Ukraine Family Visa Scheme",
        "description": "Conservative ministers have been criticised for being “cruel” after the unexpected announcement that the government’s visa scheme for people fleeing the Ukraine war would be scrapped."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/darlington-council-tax-bills-rise-28663581",
        "title": "Darlington council tax bills to rise as Tory and Labour parties clash",
        "description": "The rise was approved by a majority of councillors, as the local authority takes urgent measures to stave off a financial crisis"
    },
    {
        "url": "https://www.theguardian.com/uk-news/2024/feb/19/london-overground-rebrand-is-a-fitting-tribute-to-british-history",
        "title": "London Overground rebrand is a fitting tribute to British history",
        "description": "Letters: Readers react to TfL’s new names for rail lines in response to an article by Jonn Elledge"
    },
    {
        "url": "https://www.knutsfordguardian.co.uk/news/24129403.conservatives-challenge-cheshire-east-parking-charge-decision/",
        "title": "<b>Conservatives</b> challenge Cheshire East parking charge decision",
        "description": "Cheshire East Tories are challenging the decision to introduce parking charges in free towns and hike up prices in others saying flawed data"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/north-lanarkshire-tory-councillors-call-32158025",
        "title": "North Lanarkshire Tory councillors call for action on closed Motherwell Concert Hall",
        "description": "Lorraine Nolan and Nathan Wilson have expressed concerns about the future of the building and highlighted the importance of the Concert Hall to residents."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-tories-byelection-labour-mps-gen-kitchen-damien-egan-b1139965.html",
        "title": "Two ex-local London politicians sworn in as MPs after Labour ousted Tories in by-elections",
        "description": "Former Mayor of Lewisham Damien Egan won in Kingswood, south Gloucestershire, and ex-Newham councillor Gen Kitchen in Wellingborough, Northamptonshire"
    },
    {
        "url": "https://www.thestar.co.uk/news/politics/just-stop-oil-demand-sheffield-mps-resign-if-labour-does-not-cancel-oil-licences-4524370",
        "title": "Just Stop Oil demand Sheffield MPs &#39;promise to resign&#39; if Labour does not cancel oil licences on gaining power",
        "description": "&quot;Labour politicians must promise to resign from the party within six months if, on gaining power, they do not stop all Tory oil licences.&quot;"
    },
    {
        "url": "https://www.ft.com/content/ab467c3b-63ef-4f83-bd1c-e6de458b5983",
        "title": "Sunak bids to win back support of British farmers",
        "description": "Rishi Sunak will seek to win back British farmers on Tuesday ahead of the general election expected later this year, pledging the government “will be by their side” as a recent poll suggests the ruling <b>Conservatives</b> are losing support in their ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/times-tories-tried-ban-phones-schools-2913340?ico=related_article_inline",
        "title": "The 8 times Tories tried to ban phones in schools before, and why it didn’t work",
        "description": "Here are all the times that the Tories have backed or ruled out a classroom ban on phones: In 2007, the Conservative Party, which was in opposition at the time, set out proposals to ban mobile phones in schools."
    },
    {
        "url": "https://www.ft.com/content/d69d668f-7bf5-4404-a9d7-336fd533492f",
        "title": "Faultlines divide parties on Europe’s nationalist right",
        "description": "In early February, Reconquest!, the party formed in 2021 by Eric Zemmour, the rightwing commentator and former candidate for the French presidency, announced that it would be joining the European <b>Conservatives</b> and Reformists group in the European parliament."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-running-mate-vice-president-b2498750.html",
        "title": "Trump asks supporters to tell him who to pick as his VP",
        "description": "Readers are then invited to explain more about their answers in a small text box, before a live results feed reports back on which issues are regarded as most pressing by their fellow <b>conservatives</b> (the border was narrowly ahead on 14 per cent, at the time ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868029/migrant-crisis-economically-inactive-report?trk=public_post_comment-text",
        "title": "Outrage as it&#39;s revealed how much jobless migrants and foreign students really cost UK",
        "description": "“If we don&#39;t get a grip this can lose the <b>Conservatives</b> the election, and we know that under a Labour government we would see more open borders and much higher levels of migration.” Dudley North MP Marco Longhi added: “The data completely contradicts ..."
    },
    {
        "url": "https://www.huffpost.com/entry/greece-same-sex-marriage-bill_n_65ccdda9e4b0dd11b9116496?email_hash=e519d4f548734b1de60cd3c50b0cee241cc5768f",
        "title": "Greek Parliament Approves Historic Bill Legalizing Same-Sex Marriage",
        "description": "While that measure was opposed by <b>conservatives</b> at the time, Mitsotakis had voted in favor of it. In a speech to parliament earlier Thursday, Mitsotakis said the new law means “people who have been invisible until now can finally become visible around us ..."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-mayor-ulez-adverts-gla-tfl-advertising-standards-authority-misleading-apologise-b1140120.html",
        "title": "Sadiq Khan urged to apologise and &#39;take responsibility&#39; for Ulez adverts which were &#39;likely to mislead&#39;",
        "description": "Mr Khan’s spokesperson said the adverts were ‘clearly presented’, despite the UK’s advertising watchdog finding that they made claims ‘likely to mislead’"
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/news/republic-of-ireland/kneecap-manager-says-government-going-down-dangerous-road-after-funding-decision/a938037208.html",
        "title": "Kneecap manager says Government going down ‘dangerous road’ after funding decision",
        "description": "The manager of Irish language rappers Kneecap has said the Government is going down &quot;a dangerous road&quot; after the band was denied funding."
    },
    {
        "url": "https://www.middleeasteye.net/opinion/war-gaza-uk-greens-demand-ceasefire-no-arms-to-israel-boycott",
        "title": "War on Gaza: As UK Greens we demand a ceasefire, no more arms to Israel and a boycott",
        "description": "With another ceasefire vote in Parliament this week, the Conservatives and Labour will once again be seen as complicit in Israel&#39;s mass killing if they do not support it"
    },
    {
        "url": "https://www.scotsman.com/news/politics/who-is-tim-eagle-meet-scotlands-newest-conservative-msp-representing-the-highlands-and-islands-4524351",
        "title": "Who is Tim Eagle? Meet Scotland&#39;s newest Conservative MSP representing the Highlands and Islands",
        "description": "In 2021 the <b>Conservatives</b> won four seats, which were taken by the first four people on the list – Mr Cameron, party leader Douglas Ross, Edward Mountain and Jamie Halcro Johnston. Mr Eagle was fifth on the list and therefore missed out on a seat."
    },
    {
        "url": "https://news.stv.tv/scotland/humza-yousaf-says-snp-wont-back-labour-plans-to-extend-windfall-tax-to-oil-and-gas-companies",
        "title": "Humza Yousaf says SNP won&#39;t back Labour plans to extend windfall tax",
        "description": "The FM accused Labour of throwing north east workers &#39;on the scrap heap&#39; under their plans for a &#39;proper&#39; windfall tax."
    },
    {
        "url": "https://www.scotsman.com/news/politics/humza-yousaf-attacks-labours-aggressive-plan-to-raid-north-sea-oil-and-gas-industry-4523925",
        "title": "Humza Yousaf attacks Labour’s ‘aggressive’ plan to ‘raid’ North Sea oil and gas industry",
        "description": "Humza Yousaf has accused Labour of threatening to let the north-east go the way “our coal and mining towns went under Thatcher” as he launched an attack on the party’s “aggressive” plans to extend the windfall tax."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/cornwall-reacts-new-law-requiring-9108942.amp",
        "title": "Cornwall reacts to new law requiring holiday lets to have planning permission",
        "description": "Cornwall MPs and politicians have reacted to new proposals put forward by Michael Gove which would require people to get planning permission for short term holiday lets. The law is intended to provide support in areas where short-term lets are preventing local people from renting or buying a home."
    },
    {
        "url": "https://www.bristolpost.co.uk/news/bristol-news/what-bristol-city-councils-conservatives-9106218",
        "title": "What Bristol City Council&#39;s <b>Conservatives</b> would do with your taxpayer money",
        "description": "Abandoned cuts to council tax benefits would be restored to beef up planning, housing and neighbourhood enforcement teams"
    },
    {
        "url": "https://www.wrexham.com/news/calls-to-improve-healthcare-in-north-wales-as-one-year-of-betsi-cadwaladr-special-measures-approaches-247365.html",
        "title": "Calls to improve healthcare in north Wales as one year of Betsi Cadwaladr special measures approaches",
        "description": "The Welsh Conservative motion, which will be debated on Wednesday (21 February), comes almost a year after Betsi Cadwaladr University Health Board was placed back in special measures."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/boris-johnson-rishi-sunak-tory-vote-b2498409.html",
        "title": "Boris Johnson ‘would bring back half of lost Tory votes’ and is favourite to replace Sunak, poll finds",
        "description": "The study comes just weeks after a Tory bustup over secretive polls, including the “Labour landslide” poll warning of Tory wipeout at the general election"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/19/alberto-nunez-feijoo-peoples-party-retains-absolute-majority-in-galicia-election-spain",
        "title": "Spain’s <b>conservatives</b> retain absolute majority in Galicia election",
        "description": "PP’s victory in regional election strengthens Alberto Núñez Feijóo’s position"
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/anger-as-west-sussex-county-council-cuts-flooding-funding-4523891",
        "title": "Anger as West Sussex County Council cuts flooding funding",
        "description": "Plans to cut the amount of funding provided by West Sussex County Council to help local communities protect themselves from flood risk are attracting criticism from Liberal Democrats and local residents."
    },
    {
        "url": "https://www.sussexexpress.co.uk/news/politics/west-sussex-liberal-democrats-express-anger-at-conservative-budget-4523750",
        "title": "West Sussex Liberal Democrats express anger at Conservative budget",
        "description": "Liberal Democrat councillors at West Sussex County Council have slammed the Conservative-led administration at the council after its 2024/5 budget was passed in Chichester on Friday with pothole repairs and drainage shortchanged,"
    },
    {
        "url": "https://www.sunderlandecho.com/news/sunderland-conservative-leader-slams-unreasonable-request-for-government-film-studio-investment-4522096",
        "title": "Sunderland <b>Conservatives</b> leader brands film studios funding request &#39;unreasonable&#39;",
        "description": "To unlock this article and unlimited access to all of the Sunderland Echo, choose from the subscription options below and get straight back to reading."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/rishi-sunak-told-stop-playing-28659283",
        "title": "Rishi Sunak told to &#39;stop playing footsie&#39; with Nigel Farage as Tories face election disaster",
        "description": "The Prime Minister has been urged by some in his party to shift further to the right to see off the threat of the Nigel Farage-linked party"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13099787/Reform-UK-make-difference-massive-192-seat-Labour-majority-hung-Parliament-Keir-Starmer-left-14-seats-short-general-election.html",
        "title": "Reform UK &#39;could make the difference&#39; between a massive 192-seat Labour majority and a hung Parliament with Keir Starmer left 14 seats short at the general election",
        "description": "According to modelling by the Labour Together think tank, the fortunes of the Nigel Farage-backed party may prove key to how many seats Labour wins."
    },
    {
        "url": "https://uk.news.yahoo.com/two-ex-local-london-politicians-084116504.html",
        "title": "Two ex-local London politicians sworn in as MPs after Labour ousted Tories in by-elections",
        "description": "The by-election results were a heavy blow to the <b>Conservatives</b>, especially given that they saw Reform UK getting double-digit backing in both by-elections. They have sparked fresh talk of a possible challenge to Rishi Sunak if the party’s position in the ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-told-playing-footsie-32156950",
        "title": "Rishi Sunak told &#39;playing footsie&#39; with Nigel Farage and Reform will trigger Tory wipeout",
        "description": "Former Conservative Party chairman Chris Patten warned Rishi Sunak that the party &#39;won&#39;t stand a prayer of winning the next election&#39; if it lurches to the right to pursue Reform UK"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-nigel-farage-conservatives-reform-b2498418.html",
        "title": "Former Tory chairman warns Rishi Sunak against ‘playing footsie’ with Reform UK",
        "description": "Lord Patten said the Conservative Party is ‘deluding itself’ if it thinks it can ‘behave like this and still go on and win an election’"
    },
    {
        "url": "https://stratfordobserver.co.uk/news/stratford-lib-dem-parliamentary-candidate-launches-her-campaign/",
        "title": "Stratford Lib Dem parliamentary candidate launches her campaign",
        "description": "Speaking in front of the Royal Shakespeare Theatre, MP hopeful Manuela Perteghella insisted local people had been badly let down by the Conservatives."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24124892.brexit-uk-recession-woe-embarrass-conservatives/",
        "title": "Brexit and UK recession woe should embarrass <b>Conservatives</b>",
        "description": "However, the country’s fall into recession should surely be an embarrassment to the ruling <b>Conservatives</b>, who have made such a mess of overseeing the economy, as should the fact the UK grew by just 0.1% last year. Talking of the Tory mess, a report from ..."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/24125582.general-election-predictions-new-melksham-devizes-constituency/",
        "title": "General Election: Predictions in new Melksham and Devizes constituency",
        "description": "It will be formed by the central western area of the county, stretching out from Bradford on Avon to just past Devizes, rising in its western"
    },
    {
        "url": "https://uk.news.yahoo.com/spain-conservatives-win-local-election-081212066.html",
        "title": "Spain <b>Conservatives</b> Win Local Election as Socialists Retreat",
        "description": "Spain’s strongest opposition party comfortably won Galicia’s regional election, while Prime Minister Pedro Sanchez’s Socialists lost about a third of its seats in the first electoral test since he sought an amnesty for Catalan separatists."
    },
    {
        "url": "https://www.politico.eu/article/tory-mps-are-hooked-on-plotting-against-their-leaders/",
        "title": "Tory MPs are hooked on plotting against their leaders",
        "description": "Liz Truss’ record short tenure ended amid an outcry from her MPs over a Budget that helped send markets into free-fall. “As we’ve seen at Westminster, the herd instinct is powerful and when the herd moves, it moves,” Johnson said of his own toppling as he announced his resignation."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sewage-spills-marginal-tory-seats-general-election-clean-it-up-nmc79v68z",
        "title": "Sewage spills are a stinker for Tories in marginal seats",
        "description": "Conservative MPs are open to attacks over the party’s record on water pollution with nearly 39,000 sewage spills in marginal constituencies in 2022"
    },
    {
        "url": "https://pressreleases.responsesource.com/news/105086/silversurfers-com-th-anniversary-survey-reveals-the-over-s-will/",
        "title": "Silversurfers.com 10th anniversary survey reveals the over 50s will vote Conservative",
        "description": "This could be attributed to the fact that 31% believe that the <b>Conservatives</b> have coped reasonably well considering the worldwide turmoil of the last 10 years.” Lock continues, “Other key survey findings about politics reveal that over 50% of our ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/liberal-democrats/2024/02/inside-liberal-democrats-plan-labour",
        "title": "Labour’s “good jobs” agenda could be transformative",
        "description": "Then, as Labour’s support plummeted in the late 2000s, the Lib Dems moved closer to David Cameron’s <b>Conservatives</b>. As described in the recent book The Liberal Democrats: From hope to despair to where?, economic liberals on the party’s right – such ..."
    },
    {
        "url": "https://www.coventrytelegraph.net/news/coventry-news/bid-keep-funding-risk-coventry-28648857",
        "title": "Bid to keep funding for at-risk Coventry school bus routes will be made at council next week",
        "description": "A news release from the group added: &quot;Coventry <b>Conservatives</b> recognise this year’s budget process has been more difficult than usual with inflationary pressures putting a strain on service delivery. However, they believe these amendments are responsible ..."
    },
    {
        "url": "https://www.belfasttelegraph.co.uk/opinion/comment/poll-provides-clues-on-nis-future-in-the-union-but-recent-history-shows-how-campaigns-quickly-change-minds/a1110017311.html",
        "title": "Poll provides clues on NI’s future in the Union, but recent history shows how campaigns quickly change minds",
        "description": "Regular elections are also becoming more campaign-dependent. When Theresa May called the 2017 general election, the <b>Conservatives</b> were 20% ahead in all the polls. But at the end of the campaign, marked by Mrs May’s U-turn on the so-called Dementia Tax ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13211990.gove-tories-will-win-seats-labour-scotland/",
        "title": "Gove: Tories will win more seats than Labour in Scotland",
        "description": "Insisting the <b>Conservatives</b> would do better than the Opposition, Mr Gove declined to say which seats his party would win, adding: &quot;It would be wrong of me to alert the SNP, the Liberal Democrats and Labour to our highly effective ground operation."
    }
]