[
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-warned-against-playing-28658005",
        "title": "Rishi Sunak warned against &#39;playing footsie&#39; with Nigel Farage and Reform UK",
        "description": "Rishi Sunak has been warned against &quot;playing footsie&quot; with Reform UK following two bruising by-election defeats."
    },
    {
        "url": "https://uk.news.yahoo.com/kristen-stewart-says-her-rolling-204037887.html",
        "title": "Kristen Stewart Says Her Rolling Stone Cover Was Controversial Because It Was ‘Not Designed for, Desired by’ Straight Men | Video",
        "description": "Rolling Stone published an interview with Kristen Stewart on Valentine’s Day that quickly incensed <b>conservatives</b> across the U.S. (the magazine described them as “terrified” in a piece on Sunday) because she dared to express her sexuality in a way ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/sunak-warned-against-playing-footsie-with-farage-and-reform-uk-E6GBKBZVBVM5LJUV3WM336JIII/",
        "title": "Sunak warned against ‘playing footsie’ with Farage and Reform UK",
        "description": "Rishi Sunak visit to Harlow Police Station – Essex The <b>Conservatives</b> highlighted the low turnout in both contests (Dan Kitwood/PA) Former Tory chairman Chris Patten said: “I was chairman of the Conservative Party when there was a Conservative Party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/strip-natural-england-and-environment-agency-of-powers/",
        "title": "Strip Natural England and the Environment Agency of powers, urges Tory pressure group",
        "description": "Conservative Rural Forum Bring wants ‘delegated responsibilities of quangos brought back to Defra to enable more joined-up decision making’"
    },
    {
        "url": "https://uk.news.yahoo.com/spanish-conservatives-retain-majority-galicia-192727048.html",
        "title": "Spanish <b>conservatives</b> retain majority in Galicia regional vote - exit poll",
        "description": "Spain&#39;s opposition conservative People&#39;s Party (PP) is set to retain its absolute majority in its stronghold in the northwest region of Galicia on Sunday in a close-run regional election. The PP is likely to have won 45."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/18/general-election-conservative-tory-boris-johnson-leadership/",
        "title": "Tory Party under Boris Johnson could regain votes of ‘lost <b>Conservatives</b>’",
        "description": "Among the “lost Conservatives”, who said they won’t vote Tory at the next election but don’t know who to vote for, 52 per cent said they would vote for Mr Johnson over Sir Keir. This is compared to 39 per cent saying they would vote for the current Prime Minister over the Labour leader."
    },
    {
        "url": "https://inews.co.uk/news/politics/tax-cuts-without-slashing-public-spending-hunt-2912540?ico=more_from_this_author",
        "title": "Tax cuts still possible without slashing public spending, Hunt believes",
        "description": "Mr Hunt and Rishi Sunak are still eyeing up tax cuts in the 6 March Budget, a key moment for Tory poll prospects"
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-68329756",
        "title": "Newtown: About 100 farmers in tractor go-slow protest",
        "description": "About 100 farmers drove their tractors and farm vehicles through a mid Wales town to protest against Welsh government farming policy. They arrived at a hustings event in Newtown, Powys, where Vaughan Gething and Jeremy Miles, the two candidates to be the next first minister of Wales, were due to speak."
    },
    {
        "url": "https://www.scotsman.com/news/politics/sunak-defended-after-by-election-defeats-set-against-difficult-backdrop-4523157",
        "title": "Sunak defended after by-election defeats set against ‘difficult backdrop’",
        "description": "A Conservative minister has defended Rishi Sunak and the party after two by-election defeats, saying they were set against a “very difficult backdrop”. The losses to Labour in Wellingborough and Kingswood, as well as increased support for the emboldened Reform UK party, were the latest blow to the Prime Minister."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13097317/DOMINIC-LAWSON-firms-Labour-win-power-jobs.html",
        "title": "DOMINIC LAWSON: You can virtually hear big firms sucking up to Labour, but if they win it&#39;ll be the sound of jobs gurgling down the plughole...",
        "description": "The voice of big business, the CBI, has been for some time sidling up to Labour, too. Last week, its former chief, Paul Drechsler, said that the <b>Conservatives</b> are ‘not just losing the argument on business, Labour is winning it’. And the CBI’s current ..."
    },
    {
        "url": "https://www.gazetteherald.co.uk/news/24127367.many-conservative-readers-will-desperately-wondering-vote/",
        "title": "Many Conservative readers will be desperately wondering how to vote?",
        "description": "Violated by the party system Most readers are probably unaware that a grubby brown plaque near the entrance to the Old Town Hall (now a"
    },
    {
        "url": "https://news.stv.tv/politics/tories-could-still-win-next-uk-election-starmer-warns-in-glasgow-speech",
        "title": "Tories could still win next election, Starmer warns in Glasgow speech",
        "description": "Keir Starmer has warned the Tories could still win the next UK general election – despite the party consistently polling around 20 points ahead of their rivals. Speaking to Scottish Labour members on the last day of the party’s conference in Glasgow, the Labour leader took aim at the SNP for claiming Labour is almost certain to win the next ballot."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/postmasters-demand-tories-punished-ballot-32154205",
        "title": "Postmasters demand Tories punished at ballot box as they face compensation delay claims",
        "description": "Victims of the Horizon IT scandal accused ministers of not matching their words with action as a former Post Office boss claimed he&#39;d been told to delay compensation payments"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/tories-can-still-win-2024-28656665",
        "title": "Tories can still win 2024 general election, warns Keir Starmer",
        "description": "Sir Keir Starmer has said the Tories can still win the next general election, as he warned that &quot;Tory stagnation is a threat to Britain itself&quot;"
    },
    {
        "url": "https://www.theguardian.com/world/2024/feb/18/call-urgently-revive-theresa-may-plan-eu-wide-defence-treaty",
        "title": "Call to urgently revive Theresa May’s plan for EU-wide defence treaty",
        "description": "Leader of centrist Renew group in EU parliament says defence must be main priority over next five years"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868029/migrant-crisis-economically-inactive-report",
        "title": "Outrage at new revelation jobless migrants and foreign students cost UK £36bn since 2020",
        "description": "A new report has revealed that the UK taxpayer has forked out almost £24billion on jobless legal migrants who contribute nothing to the economy since 2020. The number does not include international students who are discounted from the “economically inactive” category but if they were added the total cost would be an eye-watering £36billion."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867951/rishi-sunak-brexit-eu-regulations-equalities?ruid=4012be5c-f7b2-4f4c-ac58-d543cf421a85",
        "title": "Rishi Sunak accused of squandering Brexit freedoms by introducing more EU rules",
        "description": "Nobody seems to have quite grasped how important these issues are.” New <b>Conservatives</b> co-founded Miriam Cates said it would “undermine our understanding of discrimination rather than to strengthen it ... by gold-plating an obscure piece of foreign case ..."
    },
    {
        "url": "https://www.landlordzone.co.uk/news/government-to-rush-through-changes-to-housing-laws-before-the-election",
        "title": "Government to rush through changes to housing laws before the election",
        "description": "With time running out for the <b>Conservatives</b>, the government wants to make a last-ditch impact on the crises facing both housing and the High Street! The housing secretary Michael Gove has announced restrictions on Airbnb style short-term lettings."
    },
    {
        "url": "https://inews.co.uk/news/politics/reform-best-result-rishi-sunak-election-2909342?ico=more_from_this_author",
        "title": "Reform’s best-ever election result is not Sunak’s biggest concern",
        "description": "Reform UK secured its best ever by-election results on Friday, in a result that will give the <b>Conservatives</b> even more cause for concern ahead of the general election. The party scored double-digit vote shares to come third in both Wellingborough and ..."
    }
]