[
    {
        "url": "https://www.avclub.com/taylor-swift-conspiracy-conservatives-joe-biden-1851212799",
        "title": "Of course Taylor Swift is now in the center of political conspiracy theories",
        "description": "Ergo, converting low-propensity voter Swifties is a critical ballot harvesting strategy for the Democrat operation in swing states.” Although Posobiec may be the most extreme, he’s far from the only conservative figure preoccupied with Taylor Swift at the moment."
    },
    {
        "url": "https://www.bbc.com/news/uk-wales-politics-68152933",
        "title": "Protect free-to-air TV for Six nations, Senedd says",
        "description": "Moving the Six Nations to a protected list of free-to-air TV events could devastate Welsh rugby, the Welsh Rugby Union said. Senedd members on Wednesday are expected to back calls for the tournament to be included in the so-called &quot;crown jewels&quot; list."
    },
    {
        "url": "https://inews.co.uk/news/politics/nicola-sturgeon-reputation-snp-votes-covid-betrayal-2883150?ico=above_article_ticker",
        "title": "Sturgeon loses reputation and SNP votes with Covid ‘betrayal’",
        "description": "Labour are hoping to take a number of seats from Humza Yousaf’s party in this year’s general election, after being left with just one in 2019"
    },
    {
        "url": "https://www.dailymail.co.uk/sport/nfl/article-13028585/Taylor-Swift-WONT-influence-2024-election-insists-Jason-Whitlock-accuses-fellow-conservatives-having-derangement-syndrome-thinking-Travis-Kelce-Chiefs-win-Super-Bowl-help-Joe-Biden.html",
        "title": "Taylor Swift WON&#39;T influence the 2024 election, insists Jason Whitlock as he accuses fellow <b>conservatives</b> of having &#39;derangement syndrome&#39; for thinking a Travis Kelce and ...",
        "description": "The singer&#39;s huge influence on popular culture could be a factor in the race to the White House , particularly as 41 million Gen Z voters prepare to vote this year."
    },
    {
        "url": "https://bylinetimes.com/2024/01/31/straight-out-of-the-republican-playbook-conservatives-impose-new-strategy-on-elections-watchdog-in-crucial-election-year/",
        "title": "‘Straight Out of the Republican Playbook’: <b>Conservatives</b> Impose New Strategy on Elections Watchdog in Crucial Election Year",
        "description": "The new Government-set priorities for the Electoral Commission make no mention of AI or misinformation - but plenty of mentions of almost non-existent voter fraud"
    },
    {
        "url": "https://uk.news.yahoo.com/nato-chief-us-conservatives-us-175346275.html",
        "title": "NATO chief to US <b>conservatives</b>: US alliance &#39;a good deal&#39;",
        "description": "NATO&#39;s chief on Wednesday told US conservatives that the alliance was a &quot;good deal&quot; for the United States and created jobs, as likely presidential candidate Donald Trump fuels doubts about assisting Ukraine."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/councils-face-devastating-service-cuts-32013696",
        "title": "Councils face devastating service cuts as £5.8billion Tory black hole revealed",
        "description": "“The <b>Conservatives</b> have cut council finances to the bone and it is local people up and down the country who are paying the price. Without proper funding for local services, it is communities and local people who will continue to suffer.” Will ..."
    },
    {
        "url": "https://uk.news.yahoo.com/trump-thinks-more-popular-taylor-173519226.html",
        "title": "Trump thinks he’s more popular than Taylor Swift",
        "description": "The former president reportedly said last month that it was ‘obviously’ nonsensical that he wasn’t declared Time magazine’s Person of the Year in 2023 instead of Swift"
    },
    {
        "url": "https://news.sky.com/story/free-to-air-six-nations-rule-could-have-devastating-effect-on-rugby-13060813",
        "title": "Free-to-air Six Nations rule could have &#39;devastating effect&#39; on rugby",
        "description": "The Welsh Rugby Union (WRU) has issued a warning after politicians recently called for a change in the rules to allow the rugby championship to stay without a subscription fee."
    },
    {
        "url": "https://inews.co.uk/news/politics/badenochs-naive-bravermans-loopy-inside-the-tory-fight-to-replace-sunak-2882631?ITO=msn",
        "title": "Inside the Tory fight to replace Sunak",
        "description": "Penny Mordaunt has been accused of building support for a leadership bid by sending letters to Tory candidates. The PM wants MPs to &#39;stick to the plan&#39;, but the race to succeed him is well underway"
    },
    {
        "url": "https://www.dailymail.co.uk/sport/nfl/article-13028585/Taylor-Swift-WONT-influence-2024-election-insists-Jason-Whitlock-accuses-fellow-conservatives-having-derangement-syndrome-thinking-Travis-Kelce-Chiefs-win-Super-Bowl-help-Joe-Biden.html?ns_mchann",
        "title": "Taylor Swift WON&#39;T influence the 2024 election, says Jason Whitlock as the controversial right-wing commentator accuses fellow <b>conservatives</b> of having &#39;derangement syndrome ...",
        "description": "Speaking on his &#39;Fearless with Jason Whitlock&#39; show, he said: &#39;I don&#39;t want any of the <b>conservatives</b> to take anything I&#39;m saying personally. I&#39;m trying to look out for you. I&#39;m trying to give you a bigger picture understanding of what&#39;s really going on ..."
    },
    {
        "url": "https://www.standard.co.uk/news/london/sadiq-khan-drug-testing-london-bristol-the-loop-conservatives-b1136201.html",
        "title": "Sadiq Khan urged to &#39;follow Bristol&#39;s lead&#39; with drug testing services across London",
        "description": "Emma Best, City Hall <b>Conservatives</b> deputy leader, said: “By treating drug taking as a public health issue and providing drug checking services to those who choose to consume drugs, we can keep people safe and reduce drug-related harm. “Sadiq Khan must ..."
    },
    {
        "url": "https://www.doncasterfreepress.co.uk/news/politics/reform-uk-to-hold-huge-rally-in-doncaster-as-general-election-draws-nearer-4500283",
        "title": "Reform UK to hold huge rally in Doncaster as General Election draws nearer",
        "description": "Reform UK is to hold a huge spring rally in Doncaster – as a General Election draws nearer. The gathering, which is expected to draw more than 1,000 supporters, will take place at Doncaster Racecourse on February 24."
    },
    {
        "url": "https://www.theguardian.com/commentisfree/2024/jan/31/taylor-swift-ai-pictures-far-right",
        "title": "Anyone could be a victim of ‘deepfakes’. But there’s a reason Taylor Swift is a target",
        "description": "Deepfake porn is a potent new weapon for harassment – and it’s not a coincidence Swift has become its most prominent victim"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/local-news/election-win-dunblane-bridge-allan-32013195",
        "title": "By-election win in Dunblane and Bridge of Allan for <b>Conservatives</b>",
        "description": "It was victory for the Conservatives in the Dunblane and Bridge of Allan by-election last week. Thomas Heald won the contest on Thursday, securing 1644 votes to beat out the SNP’s Ahsan Khan who racked up 1000 votes in the contest."
    },
    {
        "url": "https://www.express.co.uk/news/world/1861724/eu-donald-tusk-poland-new-taxes",
        "title": "EU crony Donald Tusk savaged for ushering in three new taxes &#39;to fill bloc’s coffers&#39;",
        "description": "Donald Tusk, the former President of the European Council, was appointed as Poland&#39;s PM after several weeks of bitter wrangling."
    }
]