[
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68316527?at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_link_type=web_link&at_format=link&at_link_id=2B8CD55A-CDC3-11EE-86A2-FD79D9B5F045&at_medium=social&at_campaign_type=owned&at_link_origin=BBC_Scotland_News",
        "title": "By-elections: Tory gloom deepens after double poll blow",
        "description": "Perhaps little wonder that my phone pinged first thing with a text from one of those of <b>Conservatives</b> convinced of the party&#39;s imminent doom unless something radical changes, perhaps getting rid of Rishi Sunak. &quot;The reality is Labour are currently storming ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-reportedly-considering-calling-28654450",
        "title": "Rishi Sunak reportedly considering calling General election in May",
        "description": "The Prime Minister is considering calling a General election in May, a report has claimed. It follows two by-election defeats for the <b>Conservatives</b> where Labour overturned huge majorities to take the former Tory seats. MPs are considering a May election to ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/keir-starmer-reportedly-wanted-to-quit-after-2021-byelection-defeat",
        "title": "Keir Starmer reportedly wanted to quit after 2021 byelection defeat",
        "description": "Labour leader thought loss to Tories in Hartlepool meant party going backward, according to new biography"
    },
    {
        "url": "https://www.thesun.co.uk/news/26008476/tony-parsons-sunak-grasp-election-voters/",
        "title": "General election is not a done deal…but disillusioned Tory voters staying home is straw that PM &amp; the party must grasp",
        "description": "LABOUR are now a general election juggernaut and pointing out that some of the wheels are a bit wonky is not going to stop them. Labour’s problems only seem to help their cause. Dumping their"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867891/laura-kuenssberg-reform-uk-nigel-farage-election",
        "title": "Laura Kuenssberg pinpoints &#39;important evidence&#39; over threat of Nigel Farage and Reform UK",
        "description": "While recent by-elections may on the surface appear to be Labour victories, the specifics of the votes reveal Reform UK could be increasing their hold over British politics."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/meet-labours-newest-mps-double-32150516",
        "title": "Meet Labour&#39;s newest MPs as double by-election wins spell fresh misery for Rishi Sunak",
        "description": "Gen Kitchen and Damian Egan are celebrating their double victory over the Tories in the Wellingborough and Kingswood by-elections - here&#39;s how they won, and what they want to do"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-eye-up-election-stop-32150575",
        "title": "Tories eye up May election to &#39;stop the bleeding&#39; and head off mutiny against Rishi Sunak",
        "description": "Senior Tory source says May election might be necessary after Labour battering in by-elections and polls suggesting the party will be &#39;obliterated&#39; with announcement potentially soon"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/17/rishi-sunak-tories-traditional-values-win-election-poll/",
        "title": "Sunak must embrace traditional Conservative values for Tories to win election, poll suggests",
        "description": "Poll likely to fuel concerns over Rishi Sunak’s leadership as Labour leads with 22 percentage points over Conservatives"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867873/Tories-face-extinction-opinion",
        "title": "<b>Conservatives</b> face &#39;extinction&#39; unless they change course, warns top Tory",
        "description": "To be clear, what Rishi Sunak and the Conservatives are facing is a potential extinction event rather than a defeat. What makes this political implosion all the more remarkable, is that no one I speak to in my Red Wall constituency of Rossendale and Darwen in Lancashire seems to even like Keir Stammer or be clamouring for a Labour Government."
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/national/uk-in-a-doom-loop-under-tories-labour-mp-claims-100266/",
        "title": "UK in a ‘doom loop’ under Tories, Labour MP claims",
        "description": "Shadow financial secretary to the Treasury James Murray said public services across the country were ‘on their knees’."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/how-a-recession-and-by-election-misery-sent-rishi-sunak-back-to-square-one_uk_65cf0264e4b043f1c0aaaf9e?d_id=7311830&ncid_tag=fcbklnkukhpmg00000001",
        "title": "How A Recession And By-Election Misery Sent Rishi Sunak Back To Square One",
        "description": "“Reform UK now have begun to put votes in the ballot box,” Curtice said. “The problem that means for the <b>Conservatives</b> is that for every one voter who is switching to Labour, there’s now another one who’s switching to Reform. “It means that ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/james-murray-rishi-sunak-tories-treasury-labour-b1139801.html",
        "title": "UK in a ‘doom loop’ under Tories, Labour MP claims",
        "description": "Shadow financial secretary to the Treasury James Murray said public services across the country were ‘on their knees’."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13094803/DAN-HODGES-unpalatable-truth-longer-Rishi-waits-call-election-worse-Tories.html",
        "title": "DAN HODGES: It&#39;s an unpalatable truth, but the longer Rishi waits to call an election, the worse it will be for the Tories",
        "description": "In the immediate aftermath of their dual implosion in Kingswood and Wellingborough, Tory MPs were dispatched to put a brave public face on the results."
    },
    {
        "url": "https://www.independent.co.uk/voices/rishi-sunak-lose-next-nine-months-b2497893.html",
        "title": "If Rishi Sunak is going to lose, what should he do in the next nine months?",
        "description": "The prime minister could do the right things, which would mean no tax cuts, writes John Rentoul... but will he?"
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68326119.amp",
        "title": "Laura Kuenssberg: Tory by-election disaster shows power of ‘sofa vote’",
        "description": "The results this week are as much about Conservative voters staying home as it is about them turning to Labour."
    },
    {
        "url": "https://www.politics.co.uk/5-minute-read/2024/02/17/friend-or-foe-the-conservative-party-misjudges-nigel-farage-at-its-peril/",
        "title": "Friend or foe? The Conservative Party misjudges Nigel Farage at its peril",
        "description": "As they are busy engaging with Nigel Farage, are Conservatives misreading the very threat that he poses to their party."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-election losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/17/rishi-sunak-conservatives-reform-party-unity-byelection-defeats",
        "title": "Sunak urges right-leaning voters to unite to keep Starmer out of No 10",
        "description": "Prime minister calls for unity after heavy losses to Labour and Reform UK electoral gains"
    },
    {
        "url": "https://inews.co.uk/news/politics/were-fking-up-so-much-no-10-despair-after-tories-double-defeat-2911108",
        "title": "‘We’re f**king up so much’: No 10 despair after Tories’ double defeat",
        "description": "But in the immediate aftermath of the Tories’ double defeat, there was little evidence of any serious manoeuvres against Sunak. How long that will hold remains to be seen, particularly if next month’s Budget fails to shift the polls and flights to Rwanda do not take off."
    },
    {
        "url": "https://www.falmouthpacket.co.uk/news/24126091.cla-poll-finds-labour-takes-lead-among-rural-voters/",
        "title": "CLA poll finds labour takes lead among rural voters",
        "description": "LABOUR has taken a narrow lead over the Conservatives among England’s rural voters, a poll has found. But while the survey suggests Conservative support has collapsed in the party’s heartlands, the head of a major countryside business association said rural voters were still “politically homeless”."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24125239.mark-mcgeoghegan-huge-gambles-anas-sarwar-must-take-win/",
        "title": "Mark McGeoghegan: The huge gambles Anas Sarwar must take to win",
        "description": "When Scottish Labour politicians and activists gathered at their annual conference a year ago, it was with a newfound optimism, despite doing"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/come-together-sunak-tells-conservatives-101359242.html",
        "title": "‘Come together’ Sunak tells <b>Conservatives</b> after by-election blows",
        "description": "Rishi Sunak has called on British conservatives to “come together” after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.politics.co.uk/week-in-review/2024/02/17/week-in-review-rishi-sunak-is-stuck-in-a-political-doom-loop/",
        "title": "Week-in-Review: Rishi Sunak is stuck in a political doom loop",
        "description": "If this was a bad week for Keir Starmer, then what might a good one look like?  With Westminster occupied by Labour’s £28 billion travails and closely scrutinising the electoral ramifications of its Rochdale debacle,"
    },
    {
        "url": "https://uk.news.yahoo.com/christian-nation-idea-fuels-us-130017054.html",
        "title": "Christian-nation idea fuels US conservative causes, but historians say it misreads founders&#39; intent",
        "description": "The Declaration of Independence famously proclaims that people’s rights come from a “Creator” and “Nature’s God” — but doesn’t specify who that is. Already such views are being voiced by supporters of Donald Trump amid his bid to recapture the presidency."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-conservatives-call-byelection-loss-b2497858.html",
        "title": "Rishi Sunak in desperate call to British <b>conservatives</b> after by-election losses",
        "description": "Rishi Sunak has called on all those on the right of politics to &quot;come together&quot; – over him - after disastrous double defeats in the Wellingborough and Kingswood by-elections. The Tories lost votes to Labour and a strengthened Reform UK, the successor to Nigel Farage ’s Brexit Party."
    },
    {
        "url": "https://www.politicshome.com/news/article/grim-by-elections-rishi-sunak-crushed-tory-morale-wellingborough-kingswood",
        "title": "&quot;Grim&quot; By-Election Defeats Leave Rishi Sunak Battling Crushed Tory Morale",
        "description": "Prime Minister Rishi Sunak will return from parliamentary recess to a restless and despondent Conservative party after another disastrous set of"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-northamptonshire-68323136",
        "title": "Wellingborough by-election: Five things we learned",
        "description": "The dust has settled, 30,000-odd votes have been counted and Wellingborough has a new MP. The election was called after a recall petition ousted the former member Peter Bone, whose partner was chosen as the Conservative candidate. But what have we learned during the Northamptonshire constituency&#39;s by-election?"
    },
    {
        "url": "https://inews.co.uk/news/politics/starmer-sitting-pretty-as-chances-for-tories-are-bitty-2911482?ico=related_article_inline",
        "title": "Starmer sitting pretty as chances for Tories are bitty",
        "description": "Sir Keir Starmer is playing it cool. He would only go as far as to say that his party is a “credible contender” for power. Those in Labour who study the numbers closely are less hesitant: they know that, as things stand, Sir Keir could win a majority as big as Tony Blair’s was in 1997."
    },
    {
        "url": "https://www.theboltonnews.co.uk/news/24119674.yasmin-qureshi-bolton-council-forced-make-hard-choices/",
        "title": "YASMIN QURESHI: Bolton Council forced to make hard choices",
        "description": "I do not envy local councillors having to make these decisions. Locally and nationally, <b>Conservatives</b> have tried to argue that the decisions forced upon Bolton Council are not inevitable and that there are other options. This is not true. Bolton Council ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/only-way-down-terrible-tories-32147101",
        "title": "Only way is down for terrible Tories following recent by-election defeats",
        "description": "The manner of their recent losses shows that the Conservatives are now &#39;unfit to govern and out of ideas,&#39; says Record View."
    },
    {
        "url": "https://uk.news.yahoo.com/labour-lead-firm-reform-gains-060000431.html",
        "title": "Labour’s Lead Is Firm, Reform Gains: Five Lessons From the By-Elections",
        "description": "The Labour Party handed the governing Conservatives two thumping defeats in a pair of special elections on Thursday in a setback for Prime Minister Rishi Sunak that reinforces the sense that the opposition is on course to win power at a general election due in the next year."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13094013/Reform-UK-leader-Richard-Tice-rejects-pact-Rishi-Sunak.html",
        "title": "Reform UK leader Richard Tice rejects pact with Rishi Sunak as Conservative rebels warn they face &#39;extinction-level event&#39; at election - while Nigel Farage predicts Tory Right ...",
        "description": "Richard Tice ruled out any talk of a deal and said that Tory MPs deserved to lose their jobs due to their &#39;woeful performance&#39;."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24126044.come-together-sunak-tells-conservatives-twin-by-election-blow/",
        "title": "‘Come together’ Sunak tells <b>Conservatives</b> after twin by-election blow",
        "description": "Rishi Sunak has called on British <b>conservatives</b> to “come together” after a bruising set of by-election defeats in Wellingborough and Kingswood. The losses to Labour and an emboldened Reform UK party came as a twin blow to the Prime Minister ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/16/misery-sunak-tories-suffer-electoral-defeat-two-safe-seats-20290963/?ico=trending-post-strip_item_4",
        "title": "Here’s what the by-election results mean for the Tory and Labour parties",
        "description": "Rishi Sunak suffered more electoral misery last night as the <b>Conservatives</b> suffered two more brutal by-election defeats in the traditionally safe seats of Kingswood and Wellingborough. Labour overturned majorities of 11,220 and 18,540 to deliver the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/were-fking-up-so-much-no-10-despair-after-tories-double-defeat-2911108?ico=most_popular",
        "title": "‘We’re f**king up so much’: No 10 despair after Tories’ double defeat",
        "description": "But in the immediate aftermath of the Tories’ double defeat, there was little evidence of any serious manoeuvres against Sunak. How long that will hold remains to be seen, particularly if next month’s Budget fails to shift the polls and flights to Rwanda do not take off."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/places-wales-three-week-monthly-28643511",
        "title": "The places in Wales with three-week or monthly black bin collections and the ones that could introduce it next",
        "description": "Most areas of Wales could have their black bins collected every three or four weeks as councils try to cut service costs amid a £432m funding gap"
    }
]