[
    {
        "url": "https://fortune.com/2024/02/23/trump-alabama-ivf-supreme-court-embryos/",
        "title": "Trump says he’d ‘strongly support the availability of IVF’ after his party ruled it illegal in Alabama",
        "description": "The fallout has deepened divisions among <b>conservatives</b> over abortion and other reproductive services in a campaign year already fraught with debates over whether Republicans should pursue national abortion limits after the U.S. Supreme Court’s 2022 ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/?ico=related-posts",
        "title": "Adam Hills rages that government should be ‘f***ing ashamed’ over Gaza in blistering rant",
        "description": "SNP MPs and some <b>Conservatives</b> ended up walking out of the chamber in protest, with the decision ultimately meaning the SNP were unable to vote on their own proposition. In the chaotic scenes, the Commons was filled with jeers in what many have branded ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rishi-sunak-faces-call-kick-32200665",
        "title": "Rishi Sunak faces call to kick Liz Truss out of Tory Party for &#39;damaging&#39; conspiracy rants",
        "description": "Labour has written to Rishi Sunak calling on him to punish Liz Truss after she blamed a &#39;deep state&#39; for her failure and failed to challenge claims Tommy Robinson is a &#39;hero&#39;"
    },
    {
        "url": "https://www.theguardian.com/education/2024/feb/24/schools-england-real-terms-cuts-since-2010-tories",
        "title": "Most schools in England facing real-terms cuts since 2010 thanks to Tories, analysis shows",
        "description": "Urgent investment of £12.2bn needed to reverse effects of 14 years of austerity, unions say"
    },
    {
        "url": "https://news.sky.com/story/calls-for-lee-anderson-to-be-kicked-out-of-conservatives-over-divisive-and-dangerous-comments-13079525",
        "title": "Calls for Lee Anderson to be kicked out of <b>Conservatives</b> over &#39;divisive and dangerous&#39; comments",
        "description": "Politicians from across the political spectrum have criticised the MP following remarks he made about London mayor Sadiq Khan."
    },
    {
        "url": "https://inews.co.uk/news/world/trump-alabama-preserve-ivf-2924450?ico=related_article_inline",
        "title": "Trump urges Alabama to to find ‘immediate solution’ to preserve IVF",
        "description": "“Like the OVERWHELMING MAJORITY of Americans, including the VAST MAJORITY of Republicans, <b>Conservatives</b>, Christians, and Pro-Life Americans, I strongly support the availability of IVF for couples who are trying to have a precious baby.” He said he was ..."
    },
    {
        "url": "https://www.bbc.com/news/world-us-canada-68388232.amp",
        "title": "Trump calls on Alabama to protect IVF treatment after court ruling",
        "description": "&quot;[Like] the VAST MAJORITY of Republicans, <b>Conservatives</b>, Christians, and Pro-Life Americans, I strongly support the availability of IVF for couples who are trying to have a precious baby,&quot; he added. Earlier on Friday, in an apparent effort to ease concerns ..."
    },
    {
        "url": "https://inews.co.uk/news/world/trump-alabama-preserve-ivf-2924450?ITO=msn",
        "title": "Trump urges Alabama to to find ‘immediate solution’ to preserve IVF",
        "description": "He said he was calling on Alabama’s Republican-controlled state legislature to “act quickly to find an immediate solution to preserve the availability of IVF in Alabama,” adding: “The Republican Party should always be on the side of the Miracle of Life – and the side of mothers, fathers, and their beautiful babies.”"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/lee-anderson-branded-racist-over-32200429",
        "title": "Lee Anderson branded &#39;racist&#39; over Sadiq Khan slur as PM told to boot him out of the Tories",
        "description": "Ex-Conservative Deputy Chairman Lee Anderson claimed that London&#39;s first Muslim mayor Sadiq Khan is controlled by Islamists as he appeared on GB News where he&#39;s a presenter"
    },
    {
        "url": "https://uk.news.yahoo.com/nigel-farage-harps-banking-woes-212835303.html",
        "title": "Nigel Farage harps on about banking woes at American CPAC conference",
        "description": "Nigel Farage brought up his banking row in a speech to American conservatives at CPAC, eight months after first accusing Coutts, which is owned by NatWest, of deciding to close his account because it did not agree with his political views."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119609/MPs-decriminalise-abortion-historic-vote-women-pregnancies.html",
        "title": "MPs poised to decriminalise abortion in historic vote which will stop women who end pregnancies outside permitted circumstances being jailed",
        "description": "After a surge in police investigations polling suggests a majority of MPs think women should no longer be prosecuted for having an abortion after the 24-week legal time limit."
    },
    {
        "url": "https://www.bbc.co.uk/news/world-us-canada-68388232",
        "title": "Trump calls on Alabama to protect availability of IVF treatment",
        "description": "Donald Trump has said he supports the availability of IVF treatment, joining a growing number of Republicans seeking to distance themselves from an Alabama court ruling on the issue. The state&#39;s top court ruled last week that frozen embryos have the same legal rights as children."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-speech-cpac-2024-b2501659.html",
        "title": "What to expect from Trump’s CPAC speech",
        "description": "Mr Trump’s rhetoric will largely match what attendees at CPAC have heard from speakers over the prior three days, nearly all of whom have used their time on stage to denounce President Joe Biden, accusing him of “weaponising” the government against Mr Trump and his supporters and call for an end to US aid to Ukraine."
    },
    {
        "url": "https://news.sky.com/story/labour-lead-grows-in-sea-wall-constituencies-polling-shows-13079229",
        "title": "Labour lead grows in &#39;sea wall&#39; constituencies, polling shows",
        "description": "Research seen by Sky News suggests Sir Keir Starmer&#39;s party is ahead of the Conservatives in a swathe of coastal constituencies in England and Wales."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/wales-next-first-minister-candidates-28695735",
        "title": "Wales&#39; next First Minister: Candidates stand firm on 20mph limits and farming consultation",
        "description": "Voting is open in the race to become the next leader of Welsh Labour when Mark Drakeford stands down in March. It is between the economy minister, Vaughan Gething, and education minister, Jeremy Miles. Voting is open for Labour members and those in affiliated groups, and the result will be announced on March 16."
    },
    {
        "url": "https://uk.news.yahoo.com/cracking-down-abortion-ivf-recreational-194021978.html",
        "title": "The Right Is Cracking Down on Abortion and IVF. Is ‘Recreational Sex’ Next?",
        "description": "Conservative influencers have set their sights on birth control amid the GOP&#39;s continued to push to curtail reproductive freedoms"
    },
    {
        "url": "https://www.ft.com/content/820a4c91-675b-4000-a70b-940002e99ddb",
        "title": "Rishi Sunak touts ‘green shoots’ of UK economic recovery ahead of Budget",
        "description": "Sunak and chancellor Jeremy Hunt believe voters are starting to see evidence of a recovery, with real wages rising and unemployment rates below 4 per cent. Hunt is putting the finishing touches to the main measures he intends to put into his Budget on March 6, which he hopes to show voters a clear path to a brighter future."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24141442.andrew-rt-davies-speaks-welsh-conservative-conference-2024/",
        "title": "Andrew RT Davies speaks at Welsh Conservative conference 2024",
        "description": "The Conservatives will need to “win the confidence” of Welsh voters ahead of an election after what has been a “challenging” year, the"
    },
    {
        "url": "https://edition.cnn.com/2024/02/23/politics/gop-candidates-reaction-alabama-ivf/index.html",
        "title": "GOP lawmakers and candidates race to distance themselves from Alabama court decision",
        "description": "A number of Congressional Republicans running in 2024 are swiftly distancing themselves from a controversial Alabama Supreme Court ruling seen as infringing on IVF, the latest obstacle for GOP candidates in the post- Roe era."
    },
    {
        "url": "https://www.barryanddistrictnews.co.uk/news/24140857.sunak-backs-farmers-protesting-welsh-government-reform/",
        "title": "Sunak backs farmers protesting against Welsh Government reform",
        "description": "The Labour government in the Senedd insists the change is necessary to fight climate change but could be adjusted by the end of the consultation. Mr Sunak met campaigners outside the Welsh Conservative Conference in Llandudno, where he offered his support for their cause, telling them he was “sorry for what you are going through”."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/23/the-case-for-overturning-commons-conventions",
        "title": "The case for overturning Commons conventions",
        "description": "Letters: Joyce Quin says Sir Lindsay Hoyle was right to allow a range of views on a difficult issue, while Lyn A Dade calls the debate a tawdry farce that makes no difference to the suffering in Gaza."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-68381271",
        "title": "Hazlemere: <b>Conservatives</b> win council by-election by 33 votes",
        "description": "A Conservative has won a council by-election in Hazlemere, Buckinghamshire, by 33 votes. Steven Roy was elected as a Buckinghamshire unitary councillor for the ward on 22 February with 687 votes. The candidate beat the independent Leigh Anthony Casey who ..."
    },
    {
        "url": "https://inews.co.uk/opinion/liz-truss-westminster-laugh-2923550?ico=most_popular",
        "title": "Westminster has no right to laugh at Liz Truss",
        "description": "Liz Truss still seems as busy as during the (brief) time she held power. Scarcely a day goes by without a Truss-related headline, with a book on the way and a rousing speech about needing a “bigger bazooka” to conservatives in the US."
    },
    {
        "url": "https://www.malverngazette.co.uk/news/national/24139648.sunak-tells-welsh-tories-economy-producing-green-shoots-recovery/",
        "title": "Sunak tells Welsh Tories economy is producing ‘green shoots’ of recovery",
        "description": "Speaking at the Welsh Conservative Conference in Llandudno on Friday, Rishi Sunak said the public are “feeling that the economy has turned the corner”, adding: “Things are g"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/23/reform-raise-40p-income-tax-threshold-70k/?utmsource=email",
        "title": "Reform would raise 40p income tax threshold to £70,000",
        "description": "Draft manifesto unveiled by party leader Richard Tice piles pressure on Chancellor to go further with tax cuts in spring Budget"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/william-wragg-mps-environmental-audit-committee-scottish-national-party-gaza-b1141216.html",
        "title": "More than 70 MPs sign motion urging Speaker to quit over Gaza vote",
        "description": "More than 70 MPs have now signed a motion expressing no confidence in the Speaker after angry scenes in the Commons on Wednesday. Senior Conservatives and Scottish National Party MPs have put their names to the “early day motion” proposed by senior Tory William Wragg in a move intended to pressure the Speaker, Sir Lindsay Hoyle, to step down."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/23/reform-uk-to-unveil-new-policies-and-election-candidates-at-doncaster-rally",
        "title": "Reform UK to unveil new policies and election candidates at Doncaster rally",
        "description": "Far-right party is trying to capitalise on third place finishes in recent byelections and is cleaning up social media histories of prospective MPs"
    },
    {
        "url": "https://www.newstatesman.com/politics/conservatives/2024/02/liz-truss-is-lost-in-her-own-contradictions",
        "title": "Revealed: the Tory peer linked to £3.8bn in government contracts",
        "description": "The former prime minister’s embrace of the Trumpian right is at odds with her traditional economic liberalism."
    },
    {
        "url": "https://inews.co.uk/news/world/liz-truss-big-break-us-unimpressed-2922328?ico=in-line_link",
        "title": "‘She sucks’: Americans unsure who Liz Truss is as she seeks big break in US",
        "description": "To little applause and empty seats, Liz Truss addressed Cpac – America’s biggest right-wing conference – to talk bazookas, the “deep state”, “Rinos” (Republicans in name only) and “Chinos” (<b>Conservatives</b> in name only). They were the kinds ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/welsh-mp-favourite-take-over-28693901",
        "title": "Welsh MP favourite to take over from Lindsay Hoyle as Commons speaker",
        "description": "&quot;The <b>Conservatives</b> have two notable representees in the market in the form of Dame Eleanor Laing and Caroline Noaks, who are 4/1 and 5/1 respectively to be elected.&quot;"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119117/Veep-hopeful-Kristi-Noem-CPAC-Joe-Biden-Kamala-Harris.html",
        "title": "Kristi Noem makes her case to be Trump&#39;s running mate by criticizing Republicans who ran against him",
        "description": "South Dakota Gov. Kristi Noem thrilled conservative activists attending CPAC on Friday, as one of the leading political figures on former President Donald Trump&#39;s list of possible running mates."
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24140805.rishi-sunak-speaks-welsh-conservative-conference-2024/",
        "title": "Rishi Sunak speaks at Welsh Conservative conference 2024",
        "description": "Mr Sunak spoke at Venue Cymru to a well-attended hall of Conservative members. The prime minister flew to Wales by plane, Downing Street said. Mr Sunak was introduced to the stage by David TC Davies, the secretary of state for Wales."
    },
    {
        "url": "https://www.ft.com/content/de28864d-bb66-4e38-a31b-6744fc9e2dab",
        "title": "Tories ‘going backwards’ on gender equality target for candidates",
        "description": "About 70% of parliamentary candidates selected so far are male with most having a background in local government"
    },
    {
        "url": "https://www.heraldscotland.com/news/24140108.snp-lose-borders-council-by-election-conservatives/?ref=rss",
        "title": "SNP lose Borders council by-election to <b>Conservatives</b>",
        "description": "The SNP have been dealt a blow in a by election in the Borders losing a seat on the local council to the Conservatives."
    },
    {
        "url": "https://www.bbc.com/news/articles/c25dl7y98qwo",
        "title": "<b>Conservatives</b> complete council ward clean sweep",
        "description": "John Bathgate (centre) joins two fellow Conservative councillors and MSP Rachael Hamilton and MP John Lamont in representing the area The <b>Conservatives</b> have completed a clean sweep of seats in a ward on Scottish Borders Council. Candidate John Bathgate won ..."
    },
    {
        "url": "https://www.newburytoday.co.uk/news/leader-of-the-opposition-selected-as-tory-candidate-for-read-9354334/",
        "title": "Leader of the opposition Ross Mackinnon selected as Conservative candidate for Reading West &amp; Mid Berkshire",
        "description": "The Tory candidate for the newly formed parliamentary seat of Reading West &amp; Mid Berkshire has said being selected was like “a dream come true”."
    },
    {
        "url": "https://www.swindonadvertiser.co.uk/news/24139584.swindon-council-tax-rise-maximum-amount-april/",
        "title": "Swindon council tax to rise by maximum amount in April",
        "description": "Council taxpayers in Swindon will be asked to pay between £1,366 and £4,532 in council tax in the next financial year."
    },
    {
        "url": "https://www.dailypost.co.uk/news/north-wales-news/live-farmers-protest-outside-welsh-28690307",
        "title": "LIVE - Farmers protest outside Welsh <b>Conservatives</b> conference in Llandudno",
        "description": "Farmers are protesting outside the Welsh Conservative conference, in Llandudno today, as Prime Minister Rishi Sunak prepares to make a speech. It is the third day of protests by farmers in North Wales, over a proposed Welsh Government subsidy scheme."
    },
    {
        "url": "https://www.northwalespioneer.co.uk/news/24139703.tractors-gather-llandudno-ahead-conservatives-conference/",
        "title": "Tractors gather in Llandudno ahead of <b>Conservatives</b> conference",
        "description": "A NUMBER of tractors have assembled outside Venue Cymru in Llandudno this morning (February 23) prior to the Welsh Conservatives Conference taking place. This follows a similar protest by farmers during First Minister Mark Drakeford’s visit to Rhyl on Wednesday (February 21) to open Coleg Llandrillo’s new engineering centre in the town."
    },
    {
        "url": "https://www.thenational.scot/news/24139570.scottish-conservatives-take-council-seat-snp-by-election/",
        "title": "<b>Conservatives</b> win Scottish council seat from SNP after by-election",
        "description": "THE SNP have lost a council seat to the Scottish Conservatives in a by-election. The Tories ’ John Bathgate became the newest councillor for the Jedburgh and District ward on the Scottish Borders council after a vote held on Thursday. The election took place after the resignation of the SNP’s councillor Pam Brown in 2023."
    },
    {
        "url": "https://uk.news.yahoo.com/former-mayor-bromley-standing-conservatives-163500251.html",
        "title": "Former Mayor of Bromley standing for <b>Conservatives</b> at next general election",
        "description": "The former Mayor of Bromley is standing as the Tory candidate for Beckenham and Penge at the next general election. Hannah Gray, who has twice served as mayor, has been named as the Conservative&#39;s Parliamentary Candidate ahead of the election expected this year."
    },
    {
        "url": "https://www.politicshome.com/news/article/rural-voters-feel-labour-doesnt-get-them-says-shadow-environment-secretary",
        "title": "Rural Voters Feel Labour Doesn’t &quot;Get&quot; Them, Says Shadow Environment Secretary",
        "description": "Rural voters feel the Labour Party does not &#39;get&#39; them, shadow environment, food and rural affairs secretary Steve Reed has said in an interview"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13117307/Is-Liz-Truss-eyeing-political-comeback-alongside-Nigel-Farage-Ex-PM-backs-Brexit-Party-founder-returning-Conservatives-says-work-help-turn-country-around.html",
        "title": "Is Liz Truss eyeing a political comeback alongside Nigel Farage? Ex-PM backs Brexit Party founder returning to the <b>Conservatives</b> and says she would work with him to &#39;help turn ...",
        "description": "She also claimed <b>conservatives</b> being in power was the only way to &#39;save the West&#39; from opponents such as Russia, Iran and China. Mr Farage, who went on to found the Brexit Party - now known as Reform UK - after quitting UKIP, has recently attended major ..."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/older-suburban-women-could-hold-key-to-next-election-poll-finds-369254/",
        "title": "Older suburban women could hold key to next election, poll finds",
        "description": "Analysis by More In Common suggested the key cohort could be the key to deciding whether its a hung parliament or a landslide."
    },
    {
        "url": "https://edition.cnn.com/2024/02/23/politics/conservative-supreme-court-regulations-biskupic-analysis/index.html",
        "title": "While eyes are on Trump, Supreme Court <b>conservatives</b> prepare to rewrite the rulebook",
        "description": "Supreme Court <b>conservatives</b> are accelerating their moves to overhaul the way the federal government protects Americans, whether from air pollution or unfair financial practices. Although the decisions won’t be released until later this year ..."
    },
    {
        "url": "https://ifamagazine.com/britains-hnwis-would-vote-labour-and-want-the-incoming-government-to-prioritise-growing-the-economy/",
        "title": "Britain’s HNWIs would vote Labour and want the incoming government to prioritise growing the economy",
        "description": "Despite this recent improvement, these respondents–still believe the Labour Party will win at a General Election and the party has the biggest support of this"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/energy-bills-labour-conservatives-price-cap-policy-b2501204.html",
        "title": "Energy bills: How are Labour and <b>Conservatives</b> proposing to help households?",
        "description": "Household energy bills are set to fall to their lowest point in two years, with Ofgem announcing it will lower its price cap by 12.3 per cent."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-23/welsh-secretary-to-poke-fun-at-first-minister-candidates-during-party-conference",
        "title": "Welsh Secretary to poke fun at First Minister candidates during conference speech in Llandudno",
        "description": "Mr Davies will join other senior <b>Conservatives</b> including the Prime Minister and the Welsh Tory leader at the Welsh Conservative conference which is being held in Llandudno today. Want a quick and expert briefing on the biggest news stories? Listen to our ..."
    }
]