[
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/22/weak-biden-asleep-at-wheel-liz-truss-cpac/",
        "title": "‘Weak’ Biden is ‘asleep at the wheel’, says Liz Truss at conservative conference",
        "description": "Former prime minister said US needs a ‘Republican back in the White House’ to remain leader of the ‘free world’"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/liz-truss-trump-america-republican-boris-johnson-b2500944.html",
        "title": "Truss says world ‘needs Republican in White House’ but does not mention Trump",
        "description": "In a speech to the Conservative Political Action Conference (Cpac) near Washington DC, the former prime minister said <b>conservatives</b> being in power was the only way to “save the West” from opponents such as Russia, Iran and China. Ms Truss said ..."
    },
    {
        "url": "https://www.thenational.scot/news/24138660.scottish-conservatives-councillor-quits-party-budget-meeting/",
        "title": "Scottish <b>Conservatives</b> councillor quits party during budget meeting",
        "description": "A Scottish Conservative councillor has resigned her party membership during a budget meeting at Aberdeenshire Council, after saying plans would"
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/22/what-the-conservatives-said-at-the-annual-budget-council-meeting/",
        "title": "What the <b>Conservatives</b> said at the annual budget council meeting",
        "description": "The second anniversary of the Russian invasion of Ukraine is on Saturday 24 February. On Sunday 25 February, there will be a memorial service in All Saints Church, Hove, from 3pm to 6pm. Do go. While we in the chamber may often strongly disagree with each ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24138433.michael-matheson-saga-set-drag---happens-next/?ref=rss",
        "title": "Michael Matheson saga set to drag on - what happens next?",
        "description": "Michael Matheson has today being given an extension to respond to a Holyrood report into his £11,000 bill for his parliamentary iPad racked"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68368320",
        "title": "Speaker&#39;s handling of Gaza vote very concerning, says Rishi Sunak",
        "description": "Sir Lindsay Hoyle is facing mounting pressure to quit as Commons Speaker over his handling of a vote on Gaza. SNP Westminster leader Stephen Flynn said his decision to pick a Labour motion had seen Parliament &quot;descend into farce&quot;. He added his party no longer had confidence in him, and called for a Commons vote on his future."
    },
    {
        "url": "https://www.politico.eu/article/eu-conservatives-bend-to-von-der-leyen-ditching-car-ban-fight-in-draft-manifesto-epp/",
        "title": "EU <b>conservatives</b> bend to von der Leyen, ditching car ban fight in draft manifesto",
        "description": "The center-right European People’s Party will no longer campaign to scrap a ban on the sale of combustion engine vehicles, according to a draft election manifesto seen by POLITICO. If that holds, it would represent a victory for European Commission ..."
    },
    {
        "url": "https://www.theguardian.com/us-news/live/2024/feb/22/biden-border-crackdown-migrants-us-latest-trump-republicans-congress-updates?filterKeyEvents=false&page=with%3Ablock-65d77c498f089db0bc972ab0",
        "title": "Biden calls ‘disregard’ for reproductive rights in conservative push ‘outrageous’ – live",
        "description": "<b>Conservatives</b> in Congress have long clamored for tighter border restrictions to keep migrants from entering the United States from Mexico, with some going as far as to threaten to shut down the government over the issue. Rightwing congressman Byron Donalds ..."
    },
    {
        "url": "https://uk.news.yahoo.com/three-north-east-tory-mps-194948941.html",
        "title": "Three North East Tory MPs join call for Speaker to quit over Gaza vote",
        "description": "Sedgefield MP Paul Howell, Blyth Valley MP Ian Levy and Hartlepool MP Jill Mortimer - all <b>Conservatives</b> - put their names to the “early day motion” proposed by senior Tory William Wragg in a move intended to pressure the Speaker, Sir Lindsay Hoyle ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/liz-truss-trump-america-republican-boris-johnson-b1141007.html",
        "title": "Truss says world ‘needs Republican in White House’ but does not mention Trump",
        "description": "Liz Truss criticised ‘<b>conservatives</b> in name only’ during a speech to the right-wing Cpac conference near Washington DC. Former prime minister Liz Truss told a right-wing conference in America that the world ‘needs a Republican in the White House ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mps-environmental-audit-committee-philip-dunne-commons-william-wragg-b1140979.html",
        "title": "More than 60 MPs call for Speaker to quit over Gaza vote",
        "description": "Senior <b>Conservatives</b> and Scottish National Party MPs have put their names to the “early day motion” proposed by senior Tory William Wragg in a move intended to pressure the Speaker, Sir Lindsay Hoyle, to step down. On Thursday evening, the total number ..."
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/maga-house-majority-scott-perry-b2500871.html",
        "title": "Maga Republican boasts small House majority helps right-wingers amid ongoing chaos",
        "description": "“I will tell you this. There are Republicans, there are <b>conservatives</b> – some Republicans are <b>conservatives</b>. And then you got the folks that are willing to save the Republic,” he added. “That’s [who] we need to be elected, regardless of whether ..."
    }
]