[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/rachel-reeves-refuses-28bn-labour-green-investment-plan/",
        "title": "Reeves refuses to use £28bn figure while defending Labour green investment plan",
        "description": "In 2021, shadow chancellor promised that a Labour government would borrow £28bn a year for five years to fund green energy projects"
    },
    {
        "url": "https://www.thetimes.co.uk/article/expats-voting-general-election-campaign-swdl7vgr3?ilc=timesradio:morefromthetimes",
        "title": "Tories hunt polling-day proxies to make most of expat vote",
        "description": "Leaked guidance from Conservative Central Headquarters (CCHQ) said associations should “help in building up a supply of <b>Conservatives</b> willing to act as proxy voters”. The rule changes mean voters can now act as a proxy to up to four others, two of"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/sunaks-rwanda-plan-faces-more-hurdles-as-tory-peers-condemn-policy",
        "title": "Sunak’s Rwanda plan faces more hurdles as Tory peers condemn policy",
        "description": "<b>Conservatives</b>’ opposition in the House of Lords could prolong wrangling over bill’s implementation Rishi Sunak’s troubled Rwanda deportation plan has been condemned by Conservative peers, historians and bishops in an indication that the House of ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/jan/29/beleaguered-rishi-sunak-on-a-wing-and-a-prayer-and-now-a-fasting-regime",
        "title": "Beleaguered Rishi Sunak on a wing and a prayer – and now a fasting regime",
        "description": "PM battling to salvage his party from predicted electoral obliteration but Tories carry on plumbing the depths"
    },
    {
        "url": "https://inews.co.uk/opinion/vaping-ban-unite-tories-2879302",
        "title": "A vaping ban will unite the Tories… against Rishi Sunak",
        "description": "Where some countries, like Australia, surrendered to kneejerk-ism and banned vaping outright, British politicians and public health bodies were refreshingly open to the evidence for a powerful technological aid to massively reduce the harm done by smoking."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860950/mark-drakeford-eu-single-market-Jeremy-Miles",
        "title": "Frontrunner to replace Mark Drakeford blasted after backing rejoining EU&#39;s single market",
        "description": "But Welsh <b>Conservatives</b> leader Andrew RT Davies said: “Miles’s comments are indicative of a man who thinks he knows better than the people of Wales. “The people of Wales voted to leave the EU, while Labour, Plaid Cymru and the Lib Dems did all they ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13145835.milband-tories-warning-following-by-election/",
        "title": "Milband in Tories warning following by-election",
        "description": "The <b>Conservatives</b> should be deeply concerned about the party&#39;s thrashing in the Wythenshawe and Sale East by-election, Labour leader Ed Miliband said after his party held the seat comfortably with 55% of the vote. Mr Miliband described it as a &quot;very good ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861005/rishi-sunak-immigration-referendum-general-election",
        "title": "Rishi Sunak handed blueprint for shock election win with &#39;radical offer&#39; on immigration",
        "description": "A leading academic said the PM could &quot;pull off one of the biggest shocks&quot; in the history of general elections by promising a referendum on reducing immigration."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/01/29/spanish-catholics-denounce-offensive-jesus-poster/",
        "title": "Spanish Catholics denounce ‘offensive’ Jesus poster",
        "description": "Ultra-conservatives demand apology from artist over ‘effeminate’ and &#39;camp&#39; image to celebrate Easter week in Seville"
    },
    {
        "url": "https://www.markpack.org.uk/172468/conservative-party-please-dont-flush-your-toilet-when-its-stormy/",
        "title": "Conservative Party: please don’t flush your toilet when it’s stormy",
        "description": "The Conservatives have been getting a lot of flack over the dumping of sewage in our rivers and on our beaches."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/more-expats-to-vote-2024-but-will-it-change-much_uk_65b7af35e4b077c17ab5e886?d_id=7237131&ncid_tag=fcbklnkukhpmg00000001",
        "title": "Millions Of Expats Could Penalise Tories In The Next Election – But There&#39;s A Catch",
        "description": "It’s not clear how many people will register to vote from overseas for the next general election. According to the government’s general estimates, it is assumed just 17.8% of overseas voters register during an election year, while 4.7% register during a non-election year."
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/iceland-boss-who-backed-tories-28532437",
        "title": "Iceland boss who backed Tories switches to Labour ahead of 2024 General Election",
        "description": "Richard Walker, the executive chairman of the supermarket and a former Tory donor, quit the Conservative party last October in a blow to Rishi Sunak. Now Mr Walker has switched his support to Sir Keir Starmer&#39;s party, accusing the Tories of having &quot;failed the nation&quot;."
    },
    {
        "url": "https://uk.news.yahoo.com/effeminate-christ-poster-angers-spanish-152953629.html",
        "title": "&#39;Effeminate&#39; Christ poster angers Spanish <b>conservatives</b>",
        "description": "A poster of Christ to promote Easter week in Seville has drawn a sharp backlash from Spanish ultra-conservatives, who denounced it as &quot;effeminate&quot; and &quot;offensive&quot; to Roman Catholics. In a social media backlash,"
    },
    {
        "url": "https://uk.finance.yahoo.com/news/iceland-boss-backs-labour-starmer-152928967.html",
        "title": "Iceland boss backs Labour as Starmer promises to protect ‘pound in your pocket’",
        "description": "Former Conservative donor and Iceland boss Richard Walker has thrown his support behind the Labour Party, calling it the “right choice” for businesses."
    },
    {
        "url": "https://www.retail-week.com/grocery/iceland-boss-and-ex-conservative-donor-walker-backs-labour/7045477.article",
        "title": "Iceland boss and ex-Conservative donor Richard Walker backs Labour in next election",
        "description": "The executive chair of Iceland said that Starmer has moved the Labour party closer to the political centre, while Rishi Sunak had taken the <b>Conservatives</b> further to the right and caused a “total collapse in public confidence” in the government."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/nothings-ruled-out-greater-manchester-28532294",
        "title": "&#39;Nothing&#39;s ruled out&#39;: Greater Manchester council leader says more cuts to services might be needed",
        "description": "&quot;What makes me nervous is that we&#39;re not really getting a steer from Labour or the <b>Conservatives</b> over how they&#39;re going to handle the challenge of financing local government. It&#39;s a difficult time for all councils.&quot; Coun Hunter called for a &quot;fundamental ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/rochdale-election-officially-triggered-following-28532495",
        "title": "Rochdale by-election officially triggered following death of Sir Tony Lloyd",
        "description": "Labour has officially triggered the Rochdale by-election following the death of Sir Tony Lloyd. The 73-year-old MP, who held several political posts in Greater Manchester over the last 45 years, died earlier this month after revealing he was suffering from ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/0bbb2d47-687d-4b5f-bbf6-22f54321120a?shareToken=6b166e93ee196c19474f39288a8cf759",
        "title": "Anti-EU populists poised to dominate in European elections",
        "description": "Olaf Scholz’s Social Democrats will come in fourth or fifth place behind the hard-right Alternative for Germany as German <b>conservatives</b> pivot away from EU climate change and migration policy. In Hungary, Viktor Orban’s populist <b>conservatives</b> are ..."
    }
]