[
    {
        "url": "https://www.ft.com/content/4f24d958-7f73-430d-b069-2acc760b8842",
        "title": "Bank of England’s Andrew Bailey sees signs of ‘somewhat stronger ’ UK growth",
        "description": "Governor plays down upcoming economic data that is feared to show technical recession and deliver blow to Sunak"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865978/rishi-sunak-keir-stamer-labour-conservatives-general-election",
        "title": "Rishi Sunak issues warning over Labour as Brits urged not to fall for Keir Starmer&#39;s &#39;con&#39;",
        "description": "Rishi Sunak vowed to fix the social care system, slash NHS waiting lists and continue to ease the cost of living crisis if the Tories win the next general election."
    },
    {
        "url": "https://metro.co.uk/2024/02/12/two-schools-forced-shut-concrete-falls-ceiling-20267979/",
        "title": "Two schools forced to shut after concrete falls from ceiling",
        "description": "Two schools have closed and another two are shut to certain year groups after falling concrete prompted safety inspections."
    },
    {
        "url": "https://www.huffpost.com/entry/biden-trolls-super-bowl-conspiracy-dark-brandon_n_65ca1f59e4b0fb721d61ee27",
        "title": "Biden Teases Super Bowl Conspiracy With ‘Dark Brandon’ Meme After Chiefs Win",
        "description": "President Joe Biden likely sent conspiracy theorists into a frenzy late Sunday by teasingly suggesting the Kansas City Chiefs’ Super Bowl win was indeed a deep-state plot. “Just like we drew it up,” he posted on X, the social media site formerly known as Twitter, following the Chiefs’ nail-biting 25-22 victory in overtime."
    },
    {
        "url": "https://www.theguardian.com/music/2024/feb/11/taylor-swift-travis-kelce-super-bowl?ICID=ref_fark",
        "title": "Romcom ending: Taylor Swift and Travis Kelce’s big night at the Super Bowl",
        "description": "The pop star was a focal point during the NFL’s biggest night, getting to enjoy a happy ending with her victorious boyfriend"
    },
    {
        "url": "https://inews.co.uk/news/politics/sunak-shrug-bad-economic-news-obr-forecast-tax-cuts-2902707?ITO=msn",
        "title": "Sunak hopes to shrug off bad economic news with OBR forecast allowing tax cuts",
        "description": "The Treasury is braced for a double blow this week, with the ONS expected to confirm a slight increase in inflation on Wednesday due to a rise in the energy price cap which took effect in January, although it is expected to fall back to its target of 2 per cent this year."
    },
    {
        "url": "https://uk.news.yahoo.com/rishi-sunak-rwanda-bill-comes-180935010.html",
        "title": "Rishi Sunak’s Rwanda bill comes under fire from Tory and Labour peers",
        "description": "Tory and Labour peers warned of their belief that the Safety of Rwanda Bill would set a dangerous precedent for Britain"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/gillian-keegan-national-apprenticeships-week-28617369",
        "title": "Gillian Keegan visits new education facilities in Blyth during National Apprenticeship Week",
        "description": "The Education secretary also joined the Secretary of State for Energy Security and Net Zero on a visit to an offshore windfarm"
    },
    {
        "url": "https://www.huffpost.com/entry/hillary-clinton-super-bowl-2024-tweet_n_65c9c2c1e4b01f4a8b01552a",
        "title": "Hillary Clinton Trolls <b>Conservatives</b> With ‘Taylor’s Boyfriend’ Super Bowl Post",
        "description": "Clinton’s comment was interpreted by some as a double troll of conservatives. Firstly, for flipping the trope of sports commentators defining female athletes by their male partners. Swift, of course, is in a relationship with Chiefs’ tight end Travis Kelce and she jetted in from Tokyo to see the game."
    },
    {
        "url": "https://www.politicshome.com/news/article/rural-tory-mps-worried-about-mobile-merger-impact",
        "title": "Tories Fear Slower 4G Rollout Would Be Nail In The Coffin For Ailing Rural Voters",
        "description": "Conservative MPs have expressed concern that a proposed merger of two of the country&#39;s four mobile networks could result in bigger phone bills and"
    },
    {
        "url": "https://www.thenational.scot/news/24114824.snp-demand-clarity-free-tuition-fee-stance-scottish-tories/",
        "title": "SNP demand clarity on free tuition fee stance from Scottish Tories",
        "description": "“With the Tories planning to impose backdoor tuition fees, and Keir Starmer’s breaking his pledge on free tuition, it’s clear that only the SNP will stand up for Scotland’s students, and make sure a university education is based on the ability to learn and not the ability to pay.”"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/when-next-byelections-dates-labour-conservatives-mps-b1107076.html",
        "title": "When are the next by-elections? Labour stands by Rochdale candidate after &#39;offensive&#39; comments about Israel",
        "description": "Mr Al apologises unreservedly to the Jewish community after saying Israel had ‘allowed’ the deadly Hamas attack on October 7"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865887/humza-yousaf-nicola-sturgeon-snp-secrecy",
        "title": "Humza Yousaf accused of carrying on Nicola Sturgeon&#39;s &#39;addiction to cover-up and secrecy&#39;",
        "description": "Labour&#39;s Jackie Baillie accused the SNP of &quot;treating the public with contempt and attempting to stifle scrutiny&quot;."
    },
    {
        "url": "https://morningstaronline.co.uk/article/ofwat-water-bosses-bonus-block-plans-dismissed-symbolic-campaigners",
        "title": "Ofwat water bosses&#39; bonus block plans dismissed as ‘symbolic’ by campaigners",
        "description": "GOVERNMENT plans to block the bonuses of water company bosses who fail to stop illegal sewage spills have been dismissed as merely “symbolic” by environment group Greenpeace."
    },
    {
        "url": "https://uk.news.yahoo.com/uks-labour-party-cuts-ties-210420966.html",
        "title": "UK&#39;s Labour Party cuts ties with a candidate who said Israel allowed Hamas&#39; attack to happen",
        "description": "Britain’s opposition Labour Party on Monday disowned an election candidate who claimed that Israel allowed Hamas’ Oct. 7 attack to happen as a pretext to invade Gaza. Azhar Ali was selected last month to run for Labour in a Feb."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13074859/Tories-slump-lowest-poll-rating-Rishi-PM-Labour-lead-surging-25-points-start-one-Sunaks-worst-weeks-No10.html",
        "title": "Tories slump to their lowest poll rating with Rishi as PM with Labour lead surging to 25 points at start of what could be one of Sunak&#39;s worst weeks in No10",
        "description": "The latest Redfield &amp; Wilton Strategies survey showed the Conservatives on just 21 per cent support among voters, which is down three points since last week."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/empty-council-offices-could-solve-28617074",
        "title": "Empty council offices could &#39;solve homelessness and rough sleeping&#39; in Salford",
        "description": "Empty council offices should be used to help people who are homeless or rough sleeping in Salford, a councillor has said. Offices in Salford Civic Centre in Swinton are often left empty when staff work from home, Councillor Robin Garrido said."
    },
    {
        "url": "https://www.gazetteandherald.co.uk/news/towns/devizesheadlines/24105106.conservatives-lack-plan-led-lacking-nhs-services-devizes/",
        "title": "&#39;<b>Conservatives</b>&#39; lack of plan led to lacking NHS services in Devizes&#39;",
        "description": "“Was it part of the plan not to hold NHS Property Services to account, when they sold the NHS clinic in New Park Street to Majestic, or for leaving the Devizes Community Hospital in a state of decline over many years - apart from moving the clinics to it, of course - until now when they are starting the process of trying to sell it off?"
    },
    {
        "url": "https://inews.co.uk/news/politics/unlikely-lord-cameron-pm-again-tory-plots-oust-sunak-2902018?ITO=msn",
        "title": "Why it’s unlikely Lord Cameron would become PM again despite Tory plots to oust Sunak",
        "description": "One MP tells i the Foreign Secretary is being floated by some Tory plotters as a potential &#39;unity candidate&#39; before the election"
    },
    {
        "url": "https://www.somersetcountygazette.co.uk/news/24114310.rebecca-pow-mp-reacts-grant-given-ymca-taunton/",
        "title": "Rebecca Pow MP reacts to grant given to YMCA Taunton",
        "description": "Rebecca Pow, MP for Taunton Deane, has said the Conservatives will continue to fund youth services following a grant given to YMCA Taunton."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/conservatives-labour-party-countryside-seats-election/",
        "title": "Tories ‘could lose more than half of England’s 100 most rural seats’",
        "description": "The Conservatives could lose more than half of the 100 most rural seats in England at the election, according to a poll that has dealt another blow to Rishi Sunak. The Survation survey showed that Labour holds a lead in the polls in the seats, which have traditionally formed Conservative heartlands."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/david-cameron-handed-michelle-mone-32108746",
        "title": "David Cameron handed Michelle Mone a peerage as she was a &#39;proud Scot&#39; and &#39;proud Conservative&#39;",
        "description": "Cameron was prime minister in 2015 when he decided to hand the controversial businesswoman a life-long place in the House of Lords."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/12/rishi-sunak-keir-starmer-rochdale-rwanda-conservatives-labour-uk-politics-live?page=with:block-65ca20d98f086f2438b7c99b&filterKeyEvents=false",
        "title": "Lords debate Rwanda deportation bill – UK politics live",
        "description": "Peers debate amendments to controversial immigration legislation"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/12/rishi-sunak-latest-news-labour-rochdale-elections-rwanda/",
        "title": "Politics latest news: Tories need &#39;best campaigners&#39; like Boris Johnson at election, says minister",
        "description": "The Labour Party now holds a poll lead over the Tories in England’s 100 most rural constituencies in a fresh blow for Rishi Sunak. A Survation survey put Labour on 37 per cent of the vote in the traditionally Tory heartlands with the Conservatives now three points behind on 34 per cent."
    },
    {
        "url": "https://www.itv.com/news/central/2024-02-12/councillors-removed-from-committee-after-badly-behaved-send-kids-comments",
        "title": "Warwickshire County Councillors removed from committee following SEND comments",
        "description": "Comments from councillors Brian Hammersley, Jeff Morgan and Clare Golby about SEND children caused outrage from parents and campaigners. | ITV News Central"
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/people/edinburgh-castles-redcoat-cafe-re-opening-upsets-scottish-independence-supporters-despite-same-name-4514198",
        "title": "Edinburgh Castle&#39;s Redcoat Cafe re-opening upsets independence supporters despite same name for 30 years",
        "description": "Redcoats was an informal name for British infantrymen who wore a distinctive garment into battles. Scottish independence supporters associate the army, clad in red, with the killing of Scots at the Battle of Culloden Moor in 1746, marking the defeat of the Jacobite movement."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/rod-stewart-gives-scathing-verdict-32088184?int_source=nba",
        "title": "Rod Stewart gives scathing verdict on the Tories and says Labour &#39;deserve a crack&#39;",
        "description": "I live here [in the UK] now. I didn&#39;t used to. And I see what the <b>Conservatives</b> get up to.” Sir Rod, who was speaking in an interview with The Times, added: “Well, I liked Boris Johnson. He was a good figurehead, but he turned out to be a lying f***ing ..."
    },
    {
        "url": "https://www.racingpost.com/news/opinion/comment/politicians-are-desperate-not-to-damage-britains-parlous-finances-and-that-should-be-good-news-on-the-affordability-checks-front-aI3eI9L4Rp8n/",
        "title": "Politicians are desperate not to damage Britain&#39;s parlous finances - and that should be good news on the affordability checks front",
        "description": "There was much national media coverage last week of the so-called &#39;Pop Cons&#39; [Popular <b>Conservatives</b>] holding a meeting in Westminster, at which such luminaries as former prime minister Liz Truss and Jacob Rees-Mogg called for an end to all sorts of ..."
    },
    {
        "url": "https://www.exmouthjournal.co.uk/news/24114048.seaton-hospital-classed-asset-community-value/",
        "title": "&#39;Seaton Hospital is classed as a &#39;Asset of Community Value&#39;",
        "description": "Several huge meetings took place in Seaton and Colyford, and a campaign committee was formed, on which the local MP and I sit, alongside local medical representatives, the League of Friends and experienced serving and ex-councillors from Seaton."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/former-tory-minister-announces-shes-28616501",
        "title": "Former Tory minister announces she&#39;s quitting Parliament",
        "description": "Ms Crouch, 48, is the eighth MP, and sixth Conservative, this year to announce that they will quit Parliament at the election expected to take place later in 2024."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/tracey-crouch-parliament-conservative-kent-aylesford-b1138651.html",
        "title": "Former sports minister becomes latest Tory to say she will quit Parliament",
        "description": "Tracey Crouch said she would pursue ‘a new professional challenge’, and that her reasons for not standing were ‘entirely personal and positive’."
    },
    {
        "url": "https://www.thestar.co.uk/news/politics/council/angry-words-as-sheffield-councillors-oppose-government-ending-ps104m-help-for-poorest-families-4514827",
        "title": "Angry words as Sheffield councillors oppose government ending £10.4m help for poorest families",
        "description": "There have been angry exchanges between Labour and LibDem councillors during a debate about the loss of £10.4m of support for Sheffield families living in poverty."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/conservative-vote-collapse-rural-labour-lead-election-b2494601.html",
        "title": "Senior Tories set to lose seats at next election as support in rural strongholds collapses",
        "description": "Support for the Conservatives among England’s rural voters has collapsed since 2019 with many high profile MPs at risk of losing their seats"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24107617.jeremy-hunt-calls-united-front-among-conservatives/",
        "title": "Jeremy Hunt calls for &#39;united front&#39; among <b>Conservatives</b>",
        "description": "The Chancellor has called for a &#39;united front&#39; among Conservatives to have a chance at holding North East seats"
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/robert-f-kennedy-jr-super-bowl-ad_n_65c9f9f6e4b067c6b73da056",
        "title": "Robert F. Kennedy Jr. Apologizes For Controversial $7 Million Super Bowl Ad",
        "description": "The ad, produced by a super PAC backing Kennedy, American Values 2024, borrowed heavily from a 1960 spot for his uncle John F. Kennedy ’s winning presidential bid. It uses the same jingle and co-opts the vintage vibe."
    },
    {
        "url": "https://www.yorkshirepost.co.uk/news/opinion/letters/tory-promises-to-wipe-out-national-debt-proved-false-yorkshire-post-letters-4505020",
        "title": "Tory promises to wipe out national debt proved false - Yorkshire Post Letters",
        "description": "Fossil fuel companies are raking it in. Those with assets are doing fine. Those without aren’t. <b>Conservatives</b> are criticising Labour for plans to invest £28bn a year in low carbon industry which will create a return and boost the economy. However ..."
    },
    {
        "url": "https://www.northumberlandgazette.co.uk/news/politics/conservative-candidate-rosie-hanlon-wins-ponteland-town-council-by-election-4514635",
        "title": "Conservative candidate Rosie Hanlon wins Ponteland Town Council by-election",
        "description": "The Conservative Party has been successful in a Ponteland Town Council by-election, with Rosie Hanlon elected as the new councillor for the Ponteland East ward."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/new-national-anti-fraud-campaign-28614766",
        "title": "New national anti-fraud campaign launched - but critics say it&#39;s &#39;too little, too late&#39;",
        "description": "The Government&#39;s Stop! Think Fraud campaign, starting on Monday, includes a new website with fraud safety advice and adverts on billboards, TV and radio broadcasts and social media."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-calls-parties-support-hike-32105585.amp",
        "title": "SNP calls on all parties to support hike in alcohol price and warns against &#39;political point scoring&#39;",
        "description": "Claire Haughey claimed MSPs &quot;owe it to the people of Scotland&quot; to support an increase in minimum unit pricing."
    },
    {
        "url": "https://www.businessgreen.com/news/4172931/tories-labour-trade-blows-oil-gas-windfall-tax-plans",
        "title": "Tories and Labour trade blows over oil and gas windfall tax plans",
        "description": "Chancellor Jeremy Hunt accuses Labour of having an £8bn black hole in its Green Prosperity Plan, but Opposition slams &#39;flawed&#39; analysis"
    },
    {
        "url": "https://www.palatinate.org.uk/picking-a-winner-the-conservatives-campaign-for-the-city-of-durham-begins/",
        "title": "Picking a winner? The <b>Conservatives</b>’ campaign for the City of Durham begins",
        "description": "Jussi-Peter Hill explores Councillor Luke Allan Holmes&#39;s selection as the Conservative candidate for the forthcoming general election."
    },
    {
        "url": "https://uk.style.yahoo.com/bonus-ban-water-bosses-break-104245100.html",
        "title": "Bonus ban for water bosses who break rules with illegal sewage spills",
        "description": "Water company bosses are set to be banned from receiving bonuses if their companies let illegal sewage spills pollute beaches and rivers. The environment secretary called on water company bosses to take responsibility for “inexcusable breaches” damaging the environment while announcing the ban on Sunday."
    },
    {
        "url": "https://www.newstatesman.com/comment/2024/02/taylor-swift-triumphant-incoherence",
        "title": "Europe mishandled its migration crisis. Biden can learn from it",
        "description": "Remembering this, the anti-Swift mania that gripped the “Make America great again” (Maga) <b>conservatives</b> for weeks now is hardly surprising. A flurry of accusations emerged: Swift is a “Pentagon asset” conspiring with Democrats to deliver electoral ..."
    }
]