[
    {
        "url": "https://uk.news.yahoo.com/yousaf-campaign-scottish-tory-leader-000100143.html",
        "title": "Yousaf to campaign in Scottish Tory leader’s seat",
        "description": "“The urban-centric SNP have no understanding of rural Scotland. Voters in those areas know that only the Scottish <b>Conservatives</b> can beat the SNP and move the focus away from the nationalists’ independence obsession and onto their priorities.”"
    },
    {
        "url": "https://www.huffpost.com/entry/donald-trump-is-discussing-national-16-week-abortion-ban-report_n_65cfa1bde4b0f7fbe7b287dd?ncid=engmodushpmg00000003",
        "title": "Donald Trump Is Plotting National 16-Week Abortion Ban: Report",
        "description": "The former president denied the report from The New York Times that he&#39;s discussed supporting a 16-week federal abortion ban."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/come-together-sunak-tells-conservatives-after-twin-by-election-blow-100244/",
        "title": "‘Come together’ Sunak tells <b>Conservatives</b> after twin by-election blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-wellingborough-conservatives-labour-government-b1139755.html",
        "title": "‘Come together’ Sunak tells <b>Conservatives</b> after twin by-election blow",
        "description": "Rishi Sunak has called on British conservatives to ‘come together’, after a bruising set of by-election defeats in Wellingborough and Kingswood."
    },
    {
        "url": "https://www.thetimes.co.uk/article/another-tough-night-for-the-tories-arent-they-all-r3pf98mqh",
        "title": "Another ‘tough night’ for the Tories — aren’t they all?",
        "description": "On that occasion, when two seats were lost — one the consequence of an MP caught watching porn in the House of Commons and that’s not even the bad one — the party chairman Oliver Dowden decided that instead of going on the TV to say there was nothing to worry about and everything was definitely fine it would be easier to just resign."
    },
    {
        "url": "https://www.ft.com/content/7dfa734c-0f15-421a-bc24-47fe42e96174",
        "title": "Transcript: Tories reel from by-election blows",
        "description": "Lucy Fisher talks to George Parker, Rafe Uddin, elections guru Professor Sir John Curtice and the FT’s foreign editor Alec Russell"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/humza-yousaf-scotland-scottish-labour-douglas-ross-moray-b2497790.html",
        "title": "Yousaf to campaign in Scottish Tory leader’s seat",
        "description": "First Minister Humza Yousaf will campaign in the Moray seat of Scottish Tory leader Douglas Ross as he pushes to make Scotland “Tory-free” after the next election. The SNP has set its sights on Mr Ross’ party, with Labour riding high in the polls ahead of an election expected this year."
    },
    {
        "url": "https://www.thesun.co.uk/news/25999021/sun-says-budget-rishi-sunak/",
        "title": "Budget was already a huge moment for Rishi, now it’s massive… he must give the country a vision of a better future",
        "description": "Protest vote FOR all that Keir Starmer trumpeted his success in Thursday’s two by-elections, the public remains unenthused — and in many cases despairing of the choice on offer. In Wellingborough,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867734/nigel-farage-tory-leader-rish-sunak-wellingborough-by-election",
        "title": "Nigel Farage declares: Tory members want ME as their leader, not Rishi Sunak",
        "description": "Nigel Farage says grassroots Conservatives would prefer him to lead the party instead of Rishi Sunak in the wake of two crushing by-election drubbings."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/letter-from-scotland-440/",
        "title": "Letter from Scotland",
        "description": "It lost 40 of its 41 MPs in Scotland. It still only has 2 MPs and 22 seats in the Scottish Parliament, behind the <b>Conservatives</b> (31) and the SNP (63). The latest opinion polls put Labour and the SNP level-pegging at about 35 per cent support each ..."
    },
    {
        "url": "https://uk.finance.yahoo.com/news/fox-news-anchors-complain-trump-212440529.html",
        "title": "Fox News Anchors Complain Trump Being Treated Worse Than O.J.",
        "description": "Fox NewsAfter Donald Trump’s New York civil fraud trial ended with a whopping fine on Friday, Fox News’ “hard news” anchors immediately complained that the former president was being treated worse than an accused wife murderer."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/reform-uk-richard-tice-rishi-sunak-election-pact-reject/",
        "title": "Reform leader rejects an election pact with <b>Conservatives</b>",
        "description": "Richard Tice rules out a collaboration with Rishi Sunak as Tories fear the general election becoming a ‘slow-moving car crash’"
    },
    {
        "url": "https://news.sky.com/video/is-it-all-over-for-rishi-sunak-and-the-conservative-party-13073466",
        "title": "Is it all over for Rishi Sunak and the Conservative Party?",
        "description": "Labour overturned five-figure majorities to win both the Kingswood and Wellingborough by-elections in a double blow for the Conservatives."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/15/wellingborough-kingswood-by-elections-results-live-updates/",
        "title": "Rishi Sunak urges Right to come together after by-election losses",
        "description": "And if they are defeated in both Wellingborough and Kingswood, it would be the third time that two by-elections have been lost on the same day during Rishi Sunak’s premiership. The Tory majority in Kingswood is 11,200, while Wellingborough has a majority of 18,540."
    },
    {
        "url": "https://news.sky.com/story/wellingborough-proves-you-dont-have-to-look-hard-to-find-broad-disillusionment-with-politics-13073247",
        "title": "Wellingborough proves you don&#39;t have to look hard to find broad disillusionment with politics",
        "description": "The stunning Labour swing in the by-election shows the party has become a receptacle for some voter disenchantment over the cost of living, the state of high street and the NHS."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/opinion/24125586.echo-comment-tories-disastrous-by-election-results/",
        "title": "Echo Comment on Tories&#39; disastrous by-election results",
        "description": "LABOUR had had a bad week. It had performed a mighty U-turn on the £28bn green industrial policy that was to be the centrepiece of its"
    },
    {
        "url": "https://www.scotsman.com/news/politics/labour-conference-anas-sarwar-suggests-scottish-labour-will-cut-income-tax-if-it-wins-power-4522265",
        "title": "Labour conference: Anas Sarwar suggests Scottish Labour will cut income tax if it wins power",
        "description": "Anas Sarwar has signalled he will cut income tax for middle-earners if Scottish Labour wins power in Holyrood, calling the current situation “ludicrous”."
    },
    {
        "url": "https://uk.news.yahoo.com/tory-elections-bloodbath-sunak-starmer-185311506.html",
        "title": "Tory by-elections bloodbath as Sunak &amp; Starmer countdown to polls - The Standard podcast",
        "description": "It was a double by-election bloodbath for the Conservatives as the party suffered defeats at the ballot box just months before Britain goes to the polls. Rishi Sunak lost both the Kingswood and Wellingborough constituencies in a humiliating night for the Conservatives - with celebrations for Labour as Sir Keir Starmer’s party scooped both seats."
    },
    {
        "url": "https://www.itv.com/watch/news/labour-overturns-huge-tory-majorities-in-by-election-victories/6m8nl3g",
        "title": "Labour overturns huge Tory majorities in by-election victories",
        "description": "Fri 16 Feb 6.50pm • The Prime Minister insisted that the <b>Conservatives</b>&#39; plan &#39;is working&#39; following the party&#39;s defeat in two by-elections in Wellingborough and Kingswood.."
    },
    {
        "url": "https://uk.news.yahoo.com/recession-election-misery-sent-rishi-230047940.html",
        "title": "How A Recession And By-Election Misery Sent Rishi Sunak Back To Square One",
        "description": "“Reform UK now have begun to put votes in the ballot box,” Curtice said. “The problem that means for the <b>Conservatives</b> is that for every one voter who is switching to Labour, there’s now another one who’s switching to Reform. “It means that ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/16/rishi-sunak-conservative-tory-path-forward-byelections-analysis?ref=mc.news",
        "title": "Sunak faces conflicting calls over Tory path forward after bruising byelections",
        "description": "Loudest voices urge further tack to right after Reform UK gains but moderates argue general election can only be won on centre ground"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rishi-sunak-keir-starmer-peter-bone-kingswood-b1139548.html",
        "title": "Wellingborough and Kingswood ‘particularly challenging’, PM insists after defeat",
        "description": "Rishi Sunak said midterm votes are ‘always difficult’ for incumbent governments after Labour overturned two Tory majorities."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/tactical-voting-note-of-caution-issued-to-labour-ahead-of-election-110709/",
        "title": "Tactical voting ‘note of caution’ issued to Labour ahead of election",
        "description": "Polling experts from the Scottish Election Study discussed the predicted trends of a Labour voter at the upcoming general election."
    },
    {
        "url": "https://www.ft.com/content/80f99501-dc76-4bd1-9a9e-6729da1a584d",
        "title": "Rishi Sunak faces mutinous Tory party after by-election losses",
        "description": "Danny Kruger and Miriam Cates, the co-leaders of the New Conservatives faction of right-wing Tory MPs, also issued a damning statement accusing Sunak of presiding over “consensus politics” that centred on “high taxes, low security, managed decline”."
    },
    {
        "url": "https://news.stv.tv/politics/anas-sarwar-scotland-will-be-at-the-heart-of-a-uk-labour-government",
        "title": "Anas Sarwar: Scotland will be at the heart of a UK Labour government",
        "description": "The Scottish Labour leader used the word &#39;change&#39; more than 60 times throughout his hour-long speech on the first day of his party&#39;s conference in Glasgow."
    },
    {
        "url": "https://inews.co.uk/opinion/labour-by-election-victory-historic-shallow-2910758",
        "title": "Labour’s by-election victories are historic, but ultimately shallow",
        "description": "Kingswood was always likely to deliver a Labour victory – and the seat is one of those that, if the next general election were being held on the current parliamentary boundaries, Labour would be expected to win if it was on course for an overall majority. It was won with ease. Labour enjoyed a 16 per cent swing from the Conservatives."
    },
    {
        "url": "https://inews.co.uk/opinion/all-voters-seem-to-know-about-rishi-sunak-is-that-he-is-very-wealthy-2910611?ico=related_article_inline",
        "title": "All voters seem to know about Rishi Sunak is that he is very wealthy",
        "description": "But these are not normal times. Indeed few <b>Conservatives</b> expected the party to hold the seats, and hardly any ministers were to be seen canvassing in them. The speed of Labour’s recovery from the 2019 election, which left them with only 32 per cent of ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68314953.amp",
        "title": "Tory members would choose me as leader, says Nigel Farage",
        "description": "Nigel Farage has said Conservative members would choose him as their leader over Rishi Sunak, after Reform UK had its best ever by-elections. Mr Farage, Reform&#39;s honorary president, said he would &quot;have to&quot; eventually end up in the same party as Conservative MPs like Sir Jacob Rees-Mogg."
    },
    {
        "url": "https://www.onlondon.co.uk/conservatives-doctor-video-of-sadiq-khan-to-score-antisemitism-point/",
        "title": "<b>Conservatives</b> doctor video of Sadiq Khan to score antisemitism point",
        "description": "A television interview with London&#39;s Muslim Mayor has been released by the Tories in a misleading form in an attempt to damage Labour"
    },
    {
        "url": "https://www.huffpost.com/entry/greece-same-sex-marriage-bill_n_65ccdda9e4b0dd11b9116496",
        "title": "Greek Parliament Approves Historic Bill Legalizing Same-Sex Marriage",
        "description": "Greek parliament on Thursday approved a bill legalizing same-sex marriage, making history as the first majority Christian Orthodox country and the first in southeast Europe to do so. The legislation, which also recognizes adoption rights for gay couples, faced strong opposition from the powerful Greek church, religious groups and some politicians."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-england-oxfordshire-68311667.amp",
        "title": "New Oxford traffic measures branded &#39;tax bombshell&#39;",
        "description": "You can change these settings by clicking “Ad Choices / Do not sell my info” in the footer at any time. <b>Conservatives</b> on Oxfordshire County Council have said that is the total estimated income from three proposed schemes in the city over five years."
    },
    {
        "url": "https://www.thesun.co.uk/news/25997621/tories-general-election-by-election/",
        "title": "The Tories ‘must adapt’ if they want General Election hope after two by-election drubbings",
        "description": "The New <b>Conservatives</b> group of MPs said he must “adapt to the reality that the by-elections reveal”. They also demanded a pledge to quit the European Court of Human Rights and curbing welfare. Tory peer Lord Frost called for “more Conservative ..."
    }
]