[
    {
        "url": "https://www.huffpost.com/entry/sevilla-spain-hot-jesus_n_65be9b09e4b0a3aad5a538ba",
        "title": "Spanish <b>Conservatives</b> Are Upset With This Picture Of Hot Jesus",
        "description": "MADRID (AP) — A poster in the southern Spanish city of Seville that depicts a young, handsome Jesus wearing only a loincloth has unleashed a storm on social media, with some calling it an affront to the figure of Christ and others posting lewd remarks ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/03/nhs-misses-targets-still-pockets-fourteen-billion-pounds/",
        "title": "NHS misses targets and still pockets £1.4 billion",
        "description": "The health department asked the Treasury for a “relaxation” of the rules stipulating that the £1.4 billion was conditional on targets being met by the individual ICSs. At this point, targets associated with £1 billion of the pot had already been missed."
    },
    {
        "url": "https://www.politico.eu/article/greens-try-to-flip-the-script-blame-conservatives-not-the-green-deal/",
        "title": "Greens try to flip the script: Blame <b>conservatives</b>, not the Green Deal",
        "description": "The farmers are protesting decades of conservative farming policy,’ one official argued. That case will be a hard sell amid a cacophony of green-bashing."
    },
    {
        "url": "https://www.ibtimes.co.uk/labour-backtrack-28-billion-green-investment-pledge-after-weeks-confusion-1723184",
        "title": "Labour Backtrack On £28 Billion Green Investment Pledge After Weeks Of Confusion",
        "description": "With a UK general election looming, the Labour Party are starting to persuade business and financial sector leaders that it can be trusted to grow the economy."
    },
    {
        "url": "https://www.huffpost.com/entry/bc-us-election-2024-republicans-ronna-mcdaniel-trump_n_65be3625e4b0102bd2d95126?k7",
        "title": "The RNC Chairwoman Calls For Unity As The Party Faces A Cash Crunch And Attacks By Some Trump Allies",
        "description": "Republican National Committee Chairwoman Ronna McDaniel is calling for the party to unite behind the goal of defeating President Joe Biden."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68192206",
        "title": "Laura Kuenssberg: When will politicians make their minds up on key plans?",
        "description": "No wonder voters are unconvinced when politicians may seem unclear on economic plans, writes Laura Kuenssberg."
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-planning-for-two-back-to-back-general-elections-2888082?ico=more_from_this_author",
        "title": "Tories planning for two back-to-back general elections",
        "description": "The Conservatives are preparing for the possibility of a tight election result leading to a second being called quickly afterwards"
    },
    {
        "url": "https://www.southwalesargus.co.uk/news/24091019.banks-not-legally-required-provide-welsh-language-services/",
        "title": "Banks not legally required to provide Welsh-language services",
        "description": "The Senedd narrowly rejected calls for banks to be subject to legally binding language standards after HSBC’s “disgraceful” decision to"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/03/senior-tory-mp-bob-neill-stand-down-next-general-election",
        "title": "Senior Tory MP Bob Neill to stand down at next general election",
        "description": "MP for Bromley and Chislehurst wants to spend more time with his wife who had a stroke in 2019"
    },
    {
        "url": "https://uk.news.yahoo.com/bill-maher-mocks-taylor-swift-143000597.html",
        "title": "Bill Maher Mocks How Taylor Swift Freaks <b>Conservatives</b> Out so Much They’re ‘Rooting for San Francisco’ | Video",
        "description": "&quot;ABORT! They&#39;re onto us,&quot; the HBO host jokes about the Taylor Swift conspiracy theories The post Bill Maher Mocks How Taylor Swift Freaks Conservatives Out so Much They’re ‘Rooting for San Francisco’ | Video appeared first on TheWrap."
    },
    {
        "url": "https://www.northantstelegraph.co.uk/news/people/abandoned-by-the-conservatives-insiders-say-wellingborough-tory-by-election-campaign-is-struggling-to-attract-top-level-support-4503940",
        "title": "‘Abandoned by the <b>Conservatives</b>’ - insiders say Wellingborough Tory by-election campaign is struggling to attract top-level support",
        "description": "The Times asked ‘Where’s Helen’ in an eviscerating sketch after they visited Wellingborough. And the final insult was an astonishing piece written by Conservative Home, a website set up in support of the Tory party which offers news, analysis and comment on internal goings-on."
    },
    {
        "url": "https://inews.co.uk/news/civil-service-richard-tice-reform-2886189",
        "title": "‘No-one, especially the Tories, is laughing at us now,’ says Reform leader",
        "description": "In an interview with i, the Reform Party leader says his &#39;medium-term&#39; plan to take the Tories&#39; place as the threat from the right to Labour"
    },
    {
        "url": "https://www.bbc.com/news/uk-england-london-68152083",
        "title": "London mayor&#39;s group solar panel scheme &#39;quietly shelved&#39; - Tories",
        "description": "The Solar Together group-buying programme was introduced and backed by Labour mayor Sadiq Khan in 2017 to allow multiple homeowners club together to purchase solar panels at a discounted price. By early 2023, City Hall had received 1,456 complaints from customers unhappy with the service provided by GET-UK, the Conservatives said."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862609/Beachcomber-factions-banking-byelections-drinking",
        "title": "MPs talk NONCesense, Labour&#39;s latest luvvie, Suella&#39;s leadership plug",
        "description": "It turns out that 81 percent of Kingswood voters saw through Egan&#39;s fake accent and voted &quot;Lewisham Luvvie”. A fundraiser invitation for Tory London Assembly member Keith Prince is doing the rounds on WhatsApp, boasting a couple of star appearances from both Suella Braverman and candidate Susan Hall."
    },
    {
        "url": "https://uk.news.yahoo.com/banks-wont-required-welsh-language-120000350.html",
        "title": "Banks won&#39;t be required to provide Welsh-language services after Senedd rejects call",
        "description": "Samuel Kurtz, the <b>Conservatives</b>’ shadow minister, broadly agreed, saying his party would support Plaid Cymru’s amendment. He said: “The attitude of HSBC in announcing that they were to cease to provide a Welsh language helpline was disgraceful."
    },
    {
        "url": "https://www.ft.com/content/5e322c62-42dc-4744-b688-830fd29c0fc9",
        "title": "Transcript: Who still votes Conservative?",
        "description": "Given what Stephen’s saying about the importance of valence voters and people assessing competence, is this the kind of deal that could see the <b>Conservatives</b> get a bit of a political dividend? Miranda Green So I think the problem with using Northern ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/03/family-tax-cuts-poll-tory-election-jeremy-hunt-chancellor/",
        "title": "Tax cuts for parents would revive Tories’ election chances, new poll suggests",
        "description": "Almost half of families with young children are ‘more likely to vote Conservative’ if Budget has measures to support those with youngsters"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862293/reform-uk-tories-barnsley-rishi-sunak",
        "title": "&#39;We are talking to MPs&#39;: Dispirited Tories ready to jump ship, says Reform UK recruiter",
        "description": "EXCLUSIVE: David White says he is getting calls from everyone from parish councillors to mayors of district and borough councils."
    },
    {
        "url": "https://www.newstatesman.com/the-weekend-interview/2024/02/iceland-boss-richard-walker-leaving-conservatives",
        "title": "Your entire existence is a fluke",
        "description": "The businessman has turned against Rishi Sunak’s bonfire of a party."
    },
    {
        "url": "https://www.herefordtimes.com/news/24090658.green-party-oust-conservatives-herefordshire/",
        "title": "Could Green Party oust <b>Conservatives</b> in Herefordshire?",
        "description": "Voters in North Herefordshire, in contrast, know that the Greens are the only party that can challenge the Conservatives here: our own data from knocking on thousands of doors locally shows that more than a third of voters in North Herefordshire plan to vote Green at the next General Election."
    },
    {
        "url": "https://www.ft.com/content/ce4457fd-8a88-4928-a465-33f7d5a15337",
        "title": "Enough Tory gerrymandering — it’s checkmate for Sunak",
        "description": "Except Britons abroad have reasons not to vote Tory — not least Brexit and new migration rules. University of Sussex researchers have concluded that the idea of expats as rich Tories in the Med is “a stereotype that belongs to the 1980s”; most who were polled in 2019 would have voted for Labour or the Liberal Democrats."
    },
    {
        "url": "https://www.politico.eu/article/uk-election-2024-saving-conservatism-center-must-hold/",
        "title": "Saving Conservatism: The center must hold",
        "description": "As the specter of populism now stretches across the West, it’s diminishing our collective ability to check the advance of authoritarianism."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13040189/election-balance-voters-undecided.html",
        "title": "The next election is still in the balance with more than 10 million voters undecided, CCHQ chief tells Tory MPs",
        "description": "In a talk to Tory MPs, CCHQ chief Isaac Levido said that despite Labour &#39;s commanding poll lead there was still evidence of &#39;a lot of volatility&#39; among the electorate."
    },
    {
        "url": "https://www.thetimes.co.uk/article/general-election-2024-uk-tories-polls-vznpgwjqn",
        "title": "General election 2024: polls show history is not on Tories’ side",
        "description": "With the Tories trailing Labour by about 20 points, a study of polling records going back to 1951 reveals that no government has successfully closed such a large gap this close to a general elec­tion."
    },
    {
        "url": "https://uk.news.yahoo.com/convoys-conspiracies-conservative-grudges-fueling-225450273.html",
        "title": "Convoys, conspiracies and conservative grudges are fueling the battle at the Texas border",
        "description": "A convoy filled with self-described peaceful protesters departed Virginia this week, bound for the US-Mexico border. Its final destination is Eagle Pass, Texas, where National Guard troops mobilised by Governor Greg Abbott have been attempting to take enforcement of the US-Mexico border out of the hands of the federal government."
    },
    {
        "url": "https://bylinetimes.com/2024/01/31/straight-out-of-the-republican-playbook-conservatives-impose-new-strategy-on-elections-watchdog-in-crucial-election-year/?mc_cid=09b4f55a07&mc_eid=9b87100b15",
        "title": "‘Straight Out of the Republican Playbook’: <b>Conservatives</b> Impose New Strategy on Elections Watchdog in Crucial Election Year",
        "description": "The new Government-set priorities for the Electoral Commission make no mention of AI or misinformation - but plenty of mentions of almost non-existent voter fraud"
    },
    {
        "url": "https://www.heraldscotland.com/news/13209658.opponents-criticise-tory-partys-inheritance-tax-plans-desperate-panicky/",
        "title": "Opponents criticise the Tory Party&#39;s inheritance tax plans as desperate and panicky",
        "description": "Labour and the Liberal Democrats have described David Cameron&#39;s pledge to end inheritance tax on properties worth up to £1 million as &#39;a panic move&#39; and a sign of &#39;desperation&#39; from the <b>Conservatives</b>. The plan revives the party&#39;s previous pledge from 2010 ..."
    }
]