[
    {
        "url": "https://www.bbc.co.uk/news/blogs-the-papers-68175798?at_campaign=KARANGA&at_medium=RSS",
        "title": "Newspaper headlines: Chemical attack manhunt and Gazza&#39;s plea to Rashford",
        "description": "&quot;I can&#39;t see, I can&#39;t see&quot;, is the headline on the front of the Sun as it quotes a witness to the alkali attack who heard the screams of the injured mother. The mother and her two children are feared to have been deliberately targeted, according to police."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rishi-sunak-latest-news-hunt-frost-farage-blair/?utmsource=email",
        "title": "Starmer to press ahead with Labour plans to ‘level-up workers’ rights’",
        "description": "Rachel Reeves has refused to give a commitment to lift income tax thresholds. The shadow chancellor said the tax burden is the “highest it has been in 70 years” but it would be “damaging” to promise tax cuts without knowing how they would be paid for."
    },
    {
        "url": "https://inews.co.uk/news/politics/millions-to-face-stealth-tax-squeeze-but-hunt-moves-away-from-inheritance-tax-cut-2885389?ico=related_article_inline",
        "title": "Millions to face ‘stealth tax’ squeeze but Hunt moves away from inheritance tax cut",
        "description": "Jeremy Hunt will be unable to fully reverse the ‘fiscal drag’ stealth tax that drags millions of earners into higher tax thresholds in the Budget – meaning despite any tax cuts the Conservatives will still have presided over the biggest tax-raising parliament on record."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13034753/Senate-Republicans-threaten-TANK-House-passed-78BILLION-tax-deal-child-tax-credit.html",
        "title": "Senate Republicans threaten to TANK House-passed $78BILLION tax deal over child tax credit expansion giving <b>conservatives</b> &#39;heartburn&#39;",
        "description": "Senate Republicans are threatening to tank a tax bill that passed through the House in rare bipartisan fashion."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862240/Rachel-Reeves-10-times-28-billion",
        "title": "Rachel Reeves refuses 10 times to say if Labour is sticking with £28 billion green splurge",
        "description": "Rachel Reeves has refused ten times in a single interview to say whether Labour is standing by it’s plan to splurge £28 billion on green investment. The Shadow Chancellor faced a bruising showdown on Sky News, in which Beth Rigby failed to get a firm commitment despite asking again and again."
    },
    {
        "url": "https://www.standard.co.uk/news/health/labour-party-children-nhs-keir-starmer-england-b1136387.html",
        "title": "Children ‘pay the price’ of dentistry issues, experts warn",
        "description": "Children are “continuing to pay the price” for issues in NHS dentistry after a survey of 10 and 11 years olds found one in six has experienced tooth decay. There were also disparities between deprived and affluent areas,"
    },
    {
        "url": "https://news.stv.tv/politics/alister-jack-wrong-to-delete-covid-whatsapp-messages-says-scottish-tory-leader-douglas-ross",
        "title": "Alister Jack ‘wrong’ to delete WhatsApp messages, says Douglas Ross",
        "description": "The Scottish secretary was “wrong” to delete all his WhatsApp messages during the Covid pandemic, the leader of the Conservatives in Scotland has said. Douglas Ross was speaking after Alister Jack confirmed he had erased all of his messages in November 2021 to free up space on his mobile phone."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862202/rishi-sunak-replacement-boris-johnson",
        "title": "Rishi Sunak&#39;s replacement predicted by supercomputer - and its bad news for Boris Johnson",
        "description": "Rishi Sunak’s successor has been predicted by a supercomputer and the result is not good news for the former PM Boris Johnson. In the wake of rumours about internal discord within the Conservative Party, Star Sports has reduced the odds of Kemi Badenoch becoming the party leader to 9/4 from 5/2."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/01/rachel-reeves-labour-tax-corporation-pro-business-party/",
        "title": "Rachel Reeves won’t promise income tax cuts despite criticising Tories’ freeze on thresholds",
        "description": "Shadow chancellor says Labour is a ‘pro-business’ party and pledges to cap corporation tax at 25 per cent for five years if it wins election"
    },
    {
        "url": "https://www.standard.co.uk/news/health/children-nhs-labour-party-keir-starmer-england-b1136387.html",
        "title": "Children ‘pay the price’ of dentistry issues, experts warn",
        "description": "Children are “continuing to pay the price” for issues in NHS dentistry after a survey of 10 and 11 years olds found one in six has experienced tooth decay. There were also disparities between deprived and affluent areas, with experts warning “decay and deprivation go hand in hand”."
    },
    {
        "url": "https://www.politico.eu/article/britain-learned-love-keir-starmer-boring-snoring-right-hand-woman-rachel-reeves-labour-shadow-chancellor/",
        "title": "Labour’s ‘boring, snoring’ Rachel Reeves is winning over Brits",
        "description": "LONDON — She was once a Labour Party outcast, dismissed by Jeremy Corbyn as too right-wing and famously derided by a TV executive as “boring, snoring.” But now Rachel Reeves is on course to be Britain’s first female chancellor, via a close partnership with leader Keir Starmer which shows no signs of cracking under pressure as the election looms."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/01/jeremy-hunt-tax-cuts-conservatives-labour-uk-politics?filterKeyEvents=false&page=with:block-65bb7d388f0816b984cc49ee",
        "title": "Starmer says Labour would level up workers’ rights in way not attempted for decades – UK politics live",
        "description": "Labour leader tells conference that reforms ‘may not please everyone in room’"
    },
    {
        "url": "https://inews.co.uk/news/politics/be-bold-now-or-risk-a-tory-comeback-starmers-lesson-from-australia-2883214?ITO=msn",
        "title": "Be bold now or risk a Tory comeback – Starmer’s lesson from Australia",
        "description": "Labour&#39;s decision not to risk upsetting bankers by capping their bonuses is the latest example of a safety first pre-election strategy. But Australian politics reveal how that can backfire"
    }
]