[
    {
        "url": "https://uk.news.yahoo.com/sunak-faces-electoral-tests-risk-000100344.html",
        "title": "Sunak Faces Electoral Tests That Risk Encouraging Tory Plotters",
        "description": "Still, much of the political focus will be on the Reform UK party and its ability to siphon off support from the <b>Conservatives</b>. That is the nightmare scenario for many Tory Members of Parliament, who fear a split in the right-wing vote will facilitate a ..."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sunak-braced-for-double-by-election-test-in-wellingborough-and-kingswood-110547/",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/nicola-sturgeon-first-minister-humza-yousaf-conservatives-scottish-health-secretary-b2496466.html",
        "title": "Minister recalls ‘sadness and shock’ over Nicola Sturgeon’s decision to quit",
        "description": "A year on, however, Scottish <b>Conservatives</b> claimed the former SNP leader is a “totally discredited politician” and that “her reputation and credibility lie in tatters”. Nicola Sturgeon is now a totally discredited politician. Her reputation and ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/tories-face-election-wipeout-in-scotland-poll-predicts-st79j6jgm",
        "title": "Tories face election wipeout in Scotland, poll predicts",
        "description": "The Liberal Democrats would secure four seats but the Tories would return no MPs in Scotland for the first time since 1997. The polling of 18,000 people was carried out on behalf"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-wellingborough-peter-bone-government-jewish-b1139237.html",
        "title": "Sunak braced for double by-election test in Wellingborough and Kingswood",
        "description": "Rishi Sunak is braced for tests in Wellingborough and Kingswood, where Labour hopes to flip Tory majorities in the tens of thousands."
    },
    {
        "url": "https://www.thetimes.co.uk/article/michael-matheson-missed-dozens-of-nhs-targets-even-before-ipad-scandal-7dks3tk79",
        "title": "Michael Matheson ‘missed dozens of NHS targets’ even before iPad scandal",
        "description": "Scottish Conservatives say former health secretary failed to tackle NHS problems and was then distracted by the row over £11,000 roaming charges"
    },
    {
        "url": "https://inews.co.uk/news/politics/inflation-sunak-economy-autumn-election-2906691?ITO=msn",
        "title": "Inflation figure gives Sunak hope for better economy in time for Autumn election",
        "description": "An expected uptick in inflation did not materialise and the rate of price growth is now expected to slow markedly"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/14/tories-target-labour-keir-starmer-sutra-valentines-attack/",
        "title": "Tories target Labour with ‘Starmer Sutra’ Valentine’s attack ad",
        "description": "Mocking the Labour leader’s changing stances, the Conservatives&#39; ad follows Labour&#39;s about-turn on its green investment plan"
    },
    {
        "url": "https://inews.co.uk/news/politics/tories-80-seats-general-election-poll-2906688",
        "title": "Tories face being reduced to 80 seats, poll of 18,000 voters suggests",
        "description": "Cabinet ministers are predicted to lose their seats in total in what would mark the worst Conservative wipeout in history"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68295796.amp",
        "title": "Analysis: Tough week tests Keir Starmer&#39;s leadership",
        "description": "That change means a key threat to the <b>Conservatives</b>, who know that controversies surrounding Labour&#39;s former leader Jeremy Corbyn played into Boris Johnson&#39;s landslide victory in the general election in 2019. That is why, politically, this week matters."
    }
]