[
    {
        "url": "https://www.theday.com/nation/20240205/senate-republicans-distance-themselves-from-border-bill-leaving-ukraine-aid-in-doubt/",
        "title": "Senate Republicans distance themselves from border bill, leaving Ukraine aid in doubt",
        "description": "Facing a torrent of criticism from conservatives, Senate Republicans on Monday distanced themselves from a bipartisan proposal intended to clamp down on illegal border crossings,"
    },
    {
        "url": "https://www.standard.co.uk/news/tech/government-opposition-party-keir-starmer-instagram-mps-b1137282.html",
        "title": "Labour urges ministers to close ‘glaring loopholes’ in knife crime plans",
        "description": "The party wants to see ninja swords included in a ban of dangerous weapons and tech bosses face criminal sanctions for allowing online knife sales."
    },
    {
        "url": "https://www.bbc.com/culture/article/20240205-sexualised-jesus-painting-sparks-controversy-in-spain",
        "title": "&#39;Sexualised&#39; Jesus painting sparks controversy in Spain",
        "description": "Conservatives in Spain call a recent rendition of Jesus &quot;sexualised&quot;. Art experts don&#39;t get what the fuss is about."
    },
    {
        "url": "https://uk.news.yahoo.com/mcconnell-staked-legacy-border-ukraine-210958153.html",
        "title": "McConnell staked his legacy on a border-Ukraine deal. He may be too out of step with the GOP to save it.",
        "description": "Senate Minority Leader Mitch McConnell is trying to overcome Trump&#39;s opposition to the sweeping legislation. It may be too late to save the bill."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/05/liz-truss-ally-pulls-out-popular-conservatives-launch/",
        "title": "Truss ally pulls out of Popular <b>Conservatives</b> group launch at last minute",
        "description": "I’ll keep making the positive case for growth from the common ground of British politics&#39;, Mr Jayawardena said Credit: LEON NEAL/GETTY IMAGES A Liz Truss ally has pulled out of the launch of the new Popular <b>Conservatives</b> group at the last minute as he ..."
    },
    {
        "url": "https://www.itv.com/news/wales/2024-02-05/welsh-reaction-following-kings-cancer-diagnosis",
        "title": "Welsh leaders send King Charles &#39;very best wishes&#39; following cancer diagnosis",
        "description": "Buckingham Palace announced His Majesty the King has been diagnosed with cancer and will be &quot;stepping back&quot; from royal duties. | ITV News Wales"
    },
    {
        "url": "https://inews.co.uk/opinion/tories-lose-not-landslide-2890759?ico=related_stories",
        "title": "What happens if the Tories lose – but not by a landslide",
        "description": "Even assuming the Conservatives rally and can hold Labour to a modest victory, Rishi Sunak’s future is unlikely to lie at Westminster"
    },
    {
        "url": "https://inews.co.uk/news/politics/liz-truss-popcons-tory-activists-sunak-2891316?ico=related_stories",
        "title": "Liz Truss’s ‘PopCons’ to mobilise ‘thousands’ of Tory activists to pressure Sunak",
        "description": "Nigel Farage will attend launch of the New Popular Conservatives group will seek to influence Rishi Sunak&#39;s policies ahead of general election"
    },
    {
        "url": "https://www.independent.co.uk/voices/rishi-sunak-nhs-failed-cost-of-living-economy-b2490781.html",
        "title": "Even the prime minister must see that the <b>Conservatives</b> have failed the NHS",
        "description": "Editorial: Rishi Sunak’s apology for falling short on his key pledge to reduce waiting lists barely covers the mounting problems the NHS now faces. For these, there will be no quick fix – but, as a country,"
    },
    {
        "url": "https://www.onlondon.co.uk/dave-hill-the-right-have-turned-ulez-into-a-law-and-order-issue/",
        "title": "Dave Hill: The Right have turned the ULEZ into a law and order issue",
        "description": "Conservatives and their media supporters barely muster mealy-mouthed disapproval for the criminality and intimidation used by some protesters"
    },
    {
        "url": "https://www.politicshome.com/news/article/popular-conservatism-does-not-want-to-oust-rishi-sunak",
        "title": "PopCon Tories Say They Do Not Want To Oust Rishi Sunak",
        "description": "Senior Conservative MPs will stress that the new Popular Conservatism movement being launched on Tuesday does not aim to attempt to oust Prime"
    },
    {
        "url": "https://www.thetimes.co.uk/article/my-five-rules-to-make-conservatism-popular-62n5gzqvv",
        "title": "My five rules to make conservatism popular",
        "description": "Aren’t <b>Conservatives</b> unpopular at the moment, and weren’t the people leading this particular conference — luminaries of the short-lived Truss administration — at the very unpopular end of the unpopularity scale? Might this be a bit of charming self ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24099158.kezia-dugdale-votes-snp-wider-picture/",
        "title": "Kezia Dugdale votes for SNP: What&#39;s the wider picture?",
        "description": "Former Scottish Labour leader Kezia Dugdale has shocked pretty much no-one by admitting she voted for the SNP in the European election of 2019."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13047627/Israel-aid-17B-Mike-Johnson-concerns.html",
        "title": "Republicans &#39;concerned&#39; about Speaker Mike Johnson&#39;s $17BILLION Israel aid standalone bill muddy waters for passage",
        "description": "Right-wing <b>conservatives</b> have already called Speaker Mike Johnson&#39;s $17 billion Israel aid bill &#39;extremely disappointing,&#39; threatening to tank the package to assist the United States&#39; key ally. Unlike a previous $14.3 billion Israel bill that passed the ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/conservative-growth-group-pressure-chancellor-help-squeezed-middle",
        "title": "Low Tax <b>Conservatives</b> Want Chancellor To Focus Cuts On “Squeezed Middle&quot;",
        "description": "Leading figures in the Conservative Growth Group (CGG) are putting pressure on cutting inheritance tax and reforming income tax bands to help the"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863319/liz-truss-popcon-launch-tories-win",
        "title": "Liz Truss&#39;s new election game plan is getting back to &#39;what Tories need to win&#39;, says MP",
        "description": "EXCLUSIVE: Damian Moore, one of the MPs behind Liz Truss&#39;s new Popular Conservativism (PopCon) group, explains what it is all about."
    },
    {
        "url": "https://www.wakefieldexpress.co.uk/news/politics/simon-lightwood-mp-empty-slogans-from-conservatives-4505946",
        "title": "Simon Lightwood MP: Empty slogans from <b>Conservatives</b>",
        "description": "Ten years on since The Northern Powerhouse was first proposed, it still feels like an empty slogan."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1863148/tory-members-fury-survey-rishi-sunak",
        "title": "&#39;Look what you&#39;ve done!&#39; Angry Tories rage MPs have destroyed party in poll",
        "description": "There were genuine fears expressed that too many Tory MPs are not real <b>Conservatives</b> and are anti-Brexit. One said: &quot;Accept Brexit, it&#39;s what people want not. Listen to the people!&quot; &quot;Britain first!&quot; added one in the light of international deals which ..."
    },
    {
        "url": "https://uk.sports.yahoo.com/news/exclusive-liz-truss-remains-really-132141637.html",
        "title": "Exclusive: Liz Truss Remains Really Unpopular Ahead Of &#39;Popular Conservatism&#39; Launch, Poll Reveals",
        "description": "The fresh intervention by the former PM comes amid ongoing infighting within the <b>Conservatives</b> over the direction of the government as the general election looms. A separate poll last week suggested the Tories could end up with fewer than 100 seats with ..."
    },
    {
        "url": "https://www.huffpost.com/entry/mychal-threets-america-favorite-librarian-tiktok_n_65ab2fe8e4b00bbb446f3f7d?ncid=engmodushpmg00000003",
        "title": "He&#39;s America&#39;s Favorite Librarian — And He&#39;s Just Getting Started Spreading &#39;Library Joy&#39;",
        "description": "In a country faced with a dire literacy crisis, coinciding with regressive and discriminatory book bans and attacks on third spaces from <b>conservatives</b>, Threets’ work to make reading more accessible is needed now more than ever. “Library joy in its ..."
    },
    {
        "url": "https://www.huffpost.com/entry/conservatives-dei-airplane-accidents-boeing_n_65b2aafce4b04d8995105144?email_hash=a9b8b75fa93e4fb6e8cda8e74b6341d398da4f0d",
        "title": "<b>Conservatives</b> Are Blaming A New Racist Theory For Airline Accidents",
        "description": "Some <b>conservatives</b> were more explicit in their complaints about DEI. “I’m sorry,” co-founder of far-right pressure group Turning Point USA Charlie Kirk said on his show on Tuesday. “If I see a Black pilot, I’m going to be like, ‘Boy ..."
    }
]