[
    {
        "url": "https://www.irishnews.com/news/uk/blanket-20mph-speed-limits-working-says-welsh-government-A4GA7Z2KU5LQXKYN5E6UX7SS64/",
        "title": "Blanket 20mph speed limits working, says Welsh government",
        "description": "Drivers travelled on average 4mph slower on main roads since the rollout of a new lower speed limit for built-up areas last year, figures show."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106329/voters-tough-immigration-political-parties-preserve-right.html",
        "title": "Voters are tougher on immigration than all of the main political parties and back policies often seen as the preserve of the Right, poll finds",
        "description": "A survey of more than 13,000 adults found that almost two-thirds want more restrictions on immigration, including slim majorities of Labour and Liberal Democrat voters."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/mordaunt-could-beat-starmer-next-election-tory-voters/",
        "title": "Only Mordaunt could beat Starmer at next election, say Tory voters",
        "description": "Leader of the Commons only candidate backed by 2019 Conservative voters to give party a better chance if she replaced Rishi Sunak"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/20/farmer-rish-woos-the-nfu-conference-in-full-on-panic-to-secure-rural-vote?trk=public_post_comment-text",
        "title": "Farmer Rish! woos the NFU conference in full-on panic to secure rural vote",
        "description": "Downing Street team was in love-bombing mode at farmers’ union meeting in Birmingham"
    },
    {
        "url": "https://www.theguardian.com/environment/2024/feb/20/i-have-your-back-rishi-sunak-tells-farmers-at-nfu-conference",
        "title": "I have your back, Rishi Sunak tells farmers at NFU conference",
        "description": "Sunak becomes first PM to address conference since Gordon Brown in 2008, as part of courting of farming sector"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13105619/Supreme-Court-appeal-Marjorie-greene-massie-norman-mask.html",
        "title": "Supreme Court REJECTS appeal from Marjorie Taylor Greene claiming her rights were violated when she was fined $500 for refusing to wear a mask in Congress",
        "description": "The Supreme Court on Tuesday swatted away an appeal from three House <b>conservatives</b> over fines they were slapped with for refusing to wear a mask during the Covid pandemic. Reps. Marjorie Taylor Greene, Ga., Thomas Massie, Ky., and Ralph Norman ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/senior-tories-question-badenochs-decision-to-launch-attack-on-ex-post-office-chair-2917005",
        "title": "Senior Tories question Badenoch’s decision to launch attack on ex-Post Office chair",
        "description": "Senior Tories have questioned Kemi Badenoch ’s decision to launch a stinging attack against the former Post Office chairman after he claimed he was told to delay payments to wrongfully accused postmasters."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868856/Labour-triple-lock-pensions-policy-warning",
        "title": "Campaigners warn not to believe Labour triple lock pledge until it&#39;s in black and white",
        "description": "The Tories have said pensioners will take Labour&#39;s latest policy with a big pinch of salt, given previous U-turns."
    },
    {
        "url": "https://inews.co.uk/news/politics/david-cameron-punish-russia-alexei-navalny-death-2916971?ITO=msn",
        "title": "How David Cameron can punish Russia for Alexei Navalny’s death",
        "description": "The Foreign Secretary has faced calls from senior Conservatives to use Magnitsky sanctions that target those involved in human rights violations or corruption"
    },
    {
        "url": "https://www.independent.co.uk/news/world/americas/us-politics/cpac-2024-donald-trump-republicans-b2498831.html",
        "title": "Trump boosters, Biden attacks – and a Liz Truss speech: What to expect at Republicans’ CPAC event this week",
        "description": "Donald Trump will take centre stage, as will his veepstakes, plus plenty of international characters. Eric Garcia reports ahead of the annual conservative gathering"
    },
    {
        "url": "https://www.itv.com/news/granada/2024-02-20/mp-caught-in-lobbying-sting-faces-suspension-after-appeal-fails",
        "title": "Blackpool South MP Scott Benton loses appeal after being caught in lobbying sting",
        "description": "Scott Benton will be given the 35 day recommended suspension after an independent panel dismissed his appeal. Benton was caught by the Times in April 2023, offering to lobby ministers and table parliamentary questions on behalf of gambling investors. Footage also showed him allegedly boasting there were ways to keep corporate hospitality secret."
    },
    {
        "url": "https://www.ft.com/content/cae5c81e-e2d0-481b-9b5e-bbb4dec6a040",
        "title": "Rishi Sunak should resist a swerve to the right",
        "description": "Bleeding support on that scale on its right flank, they say, could compound its losses in an election. They are urging Sunak to tack further to the right in cutting taxes, slowing climate goals and hardening his line on “illegal” migration,"
    },
    {
        "url": "https://www.thenational.scot/news/24132927.jackson-carlaw-urged-cancel-ads-group-arms-dealer-event/",
        "title": "Jackson Carlaw urged to cancel ADS Group &#39;arms dealer&#39; event",
        "description": "READ MORE: Labour call for immediate ceasefire in major climbdown on Gaza The Scottish Greens have demanded Carlaw, formerly the leader of the Scottish <b>Conservatives</b>, cancel the event, due to go ahead on Wednesday. Ross Greer (above), the party’s ..."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/entry/james-cleverly-sacks-borders-watchdog-for-speaking-to-the-media_uk_65d4f106e4b0cc1f2f79cb95",
        "title": "&#39;Total Tory Chaos&#39;: James Cleverly Sacks Immigration Watchdog After Security Clash",
        "description": "David Neal, the independent chief inspector of borders and immigration, was told he had “lost the confidence” of home secretary James Cleverly. He had previously accused the Home Office of failing to publish 15 critical reports he had carried out."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24127939.bridget-phillipson-hits-tories-school-phone-ban/",
        "title": "Bridget Phillipson hits out at Tories school phone ban",
        "description": "A North East MP has stated the government is &quot;scraping the bottom of the policy barrel&quot; following news that they are to fully ban mobile phones in schools. Education Secretary Gillian Keegan announced the news yesterday (February 19), following a pledge ..."
    },
    {
        "url": "https://edition.cnn.com/2024/02/20/politics/consovoy-mccarthy-supreme-court-wins/",
        "title": "This small, conservative law firm is landing big wins at the Supreme Court",
        "description": "In June, the Supreme Court’s <b>conservatives</b> voted together against its liberals to embrace that argument. Blum told CNN that the Consovoy firm has “an oversized influence on our nation’s jurisprudence.” In coming weeks, the firm’s lawyers are ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/tories-eye-up-election-stop-32150575?s=09",
        "title": "Tories eye up May election to &#39;stop the bleeding&#39; and head off mutiny against Rishi Sunak",
        "description": "A mega poll published by the Mirror this week suggested the <b>Conservatives</b> face an electoral wipeout - losing three quarters of their seats. The bombshell survey of 18,000 people predicted Mr Sunak will be left with just 80 MPs, which would be the party&#39;s ..."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/some-people-said-like-turkeys-28666196",
        "title": "&#39;Some people said it was like turkeys voting for Christmas... they were right&#39;",
        "description": "Hannah, 34, said: “Some people said it was like turkeys voting for Christmas, and they were right. Me? I didn’t vote Conservative and I never will. Why people thought the Conservatives would do anything for Leigh is beyond me.”"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/10-ways-birminghams-council-crisis-28671409",
        "title": "10 ways Birmingham’s council crisis could impact YOU and your neighbourhood",
        "description": "From street lighting to bin collections - Birmingham City Council&#39;s crisis will result in several changes across Brum"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-labour-westminster-scotland-tories-b1140414.html",
        "title": "SNP heaps pressure on Labour by calling for commitment to £28bn green spending",
        "description": "The SNP at Westminster accused the Tories and Labour of blocking ‘Scotland’s entry to the green renewables goldrush’."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-labour-fights-its-ceasefire-war/",
        "title": "London Playbook PM: Labour fights its ceasefire war",
        "description": "UKRAINE ROW LATEST: Home Office Minister Tom Pursglove told the Commons it was “deliberate scaremongering” to suggest the government had reduced access for Ukrainians hoping to flee war to the U.K. Downing Street also insisted changes this week to application routes for Ukrainian refugees do not reduce eligibility."
    },
    {
        "url": "https://www.blackpoolgazette.co.uk/news/politics/reaction-from-blackpool-south-mp-scott-benton-after-he-loses-his-appeal-and-faces-a-possible-by-election-4526547",
        "title": "Reaction from Blackpool South MP Scott Benton after he loses his appeal and faces a possible by-election",
        "description": "Blackpool South MP Scott Benton, who is facing a recall vote, says he is &#39;deeply disappointed&#39; by the decision of an independent panel to dismiss his appeal against his 35-day suspension."
    },
    {
        "url": "https://www.thenational.scot/news/24132645.scottish-tories-undermined-uk-announces-short-term-let-scheme/",
        "title": "Scottish Tories ‘undermined’ as UK announces short term let scheme",
        "description": "THE Scottish Conservatives opposition to short term let regulation in Scotland has been “undermined” after the UK Government announced it"
    },
    {
        "url": "https://www.brightonandhovenews.org/2024/02/20/cut-cycle-hangar-subsidy-to-support-those-in-need-urge-tories/",
        "title": "Cut cycle hangar subsidy to support those in need, urge Tories",
        "description": "Concerns that cycle hangars installed across Brighton and Hove are not covering their maintenance costs has led to a call"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/rishi-sunak-faces-backlash-for-saying-farmers-work-for-love/",
        "title": "Sunak faces backlash for saying farmers work for love not money",
        "description": "Prime Minister, who was speaking at NFU conference, rebuked by union chief, as polling shows Tories face rural election woe"
    },
    {
        "url": "https://uk.news.yahoo.com/senate-conservatives-pressure-mcconnell-push-165947411.html",
        "title": "Senate <b>conservatives</b> pressure McConnell to push for full Mayorkas impeachment trial",
        "description": "A group of Republican senators are putting the pressure on Senate Minority Leader Mitch McConnell (R-Ky.) to back a full impeachment trial for Homeland Security Secretary Alejandro Mayorkas. In a letter to McConnell sent Tuesday by Sens. Mike Lee (Utah ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/environment-agency-labour-government-defra-tim-farron-b1140378.html",
        "title": "Inspections on water companies to quadruple ‘to end routine lawbreaking’",
        "description": "Inspections on water companies will quadruple over the next year in a bid to crack down on pollution by firms, the Government has announced. The measures to increase checks include up to 500 additional Environment Agency staff for inspections, enforcements and stronger regulation over the next three years."
    }
]