[
    {
        "url": "https://www.thetimes.co.uk/article/ill-help-the-sick-get-back-to-work-vows-mairi-mcallan-q89mt95kt",
        "title": "I’ll help the sick get back to work, vows Mairi McAllan",
        "description": "Minister says 240,000 Scots unable to take jobs due to ill health is ‘too many’ as businesses struggle to fill roles"
    },
    {
        "url": "https://metro.co.uk/2024/02/23/adam-hills-tells-government-ashamed-gaza-angry-rant-20338823/?ico=related-posts",
        "title": "Adam Hills rages that government should be ‘f***ing ashamed’ over Gaza in blistering rant",
        "description": "A vote of no confidence in the speaker was submitted by 57 MPs after he broke with convention to wave through a Labour amendment to the <b>SNP</b>’s motion calling for an ‘immediate humanitarian ceasefire’, which later passed without a formal vote."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119769/SNP-savaged-failing-business.html",
        "title": "<b>SNP</b> savaged for failing business",
        "description": "Hundreds of bars, restaurants and hotels have shut down or been left &#39;teetering on the brink&#39; because of the SNP &#39;s punishing tax regime, hospitality chiefs have warned."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13119681/Restaurants-bars-forced-close-terrifying-rate-wonder-chefs-Nick-Nairn-furious-SNPs-shocking-hostility-business.html",
        "title": "Restaurants and bars are being forced to close at a terrifying rate. So is it any wonder top chefs such as Nick Nairn are furious at the <b>SNP</b>&#39;s shocking hostility to business?",
        "description": "There may be more genteel ways to express the exasper­ation endemic in Scotland&#39;s hospitality industry, but at this moment celebrity chef Nick Nairn chooses not to seek one."
    },
    {
        "url": "https://news.stv.tv/west-central/councillors-call-for-new-powers-over-private-landlords-to-makes-homes-more-energy-efficient",
        "title": "Councillors call for new powers over private landlords",
        "description": "Councillors have written to Scottish Ministers to highlight how the current situation can be a barrier to addressing fuel poverty."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/sadiq-khan-lee-anderson-bg-news-london-islamist-suella-braverman-b1141254.html",
        "title": "Lee Anderson&#39;s &#39;divisive and dangerous&#39; rant against Sadiq Khan condemned by Tory and Labour MPs",
        "description": "Mr Anderson made his rant after Right-wing ex-Home Secretary Suella Braverman, who was sacked by Rishi Sunak, had wrongly claimed that “the Islamists, the extremists and the anti-Semites are in charge now” following the chaos in Parliament over a Gaza ceasefire vote."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/23/james-cleverly-suella-braverman-claim-islamists-run-britain/",
        "title": "James Cleverly rejects claim by Suella Braverman that Islamists now run Britain",
        "description": "Home Secretary says while he understands predecessor’s frustration, he insists we live in a ‘high-functioning democracy’"
    },
    {
        "url": "https://inews.co.uk/news/politics/snp-pressure-speaker-confidence-vote-2924184?ico=related_article_inline",
        "title": "<b>SNP</b> to keep pressure on Speaker with confidence vote call as 71 MPs pull support",
        "description": "Allies of Sir Lindsay Hoyle insist he is continuing &#39;business as usual&#39; amid calls for him to reflect on his future after Gaza ceasefire vote chaos"
    },
    {
        "url": "https://www.ft.com/content/79b7895b-590a-432f-941d-8e24f28f44af",
        "title": "Transcript: Why would anyone want to become an MP?",
        "description": "This is an audio transcript of the Political Fix podcast episode: ‘Why would anyone want to become an MP?’ Lucy Fisher Why would anyone want to become an MP? [MUSIC PLAYING] W"
    },
    {
        "url": "https://www.thenational.scot/politics/24141397.like-boris-johnson-keir-starmer-happily-twists-uk-constitution/",
        "title": "Like Boris Johnson, Keir Starmer happily twists the UK constitution",
        "description": "THE incident is yet another example of how the UK&#39;s famously uncodified constitution is woefully unfit for purpose"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/23/scotland-local-authorities-hit-out-snp-council-tax-freeze/",
        "title": "Local authorities in Scotland hit out at <b>SNP</b> bid to force council tax freeze",
        "description": "The Convention of Scottish Local Authorities (Cosla) hit out at a warning by Shona Robison, the <b>SNP</b> finance minister, that she would refuse to pass on extra cash from Westminster unless they implemented the freeze. In an unprecedented move, Ms Robison said ..."
    },
    {
        "url": "https://uk.news.yahoo.com/worst-westminster-week-really-180000196.html",
        "title": "The Worst of Westminster: This week, it really was",
        "description": "Welcome to this week&#39;s Worst of Westminster. Remember you can receive this newsletter for free in your inbox by clicking the banner above. THE title of this newsletter speaks for"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/23/the-case-for-overturning-commons-conventions",
        "title": "The case for overturning Commons conventions",
        "description": "Letters: Joyce Quin says Sir Lindsay Hoyle was right to allow a range of views on a difficult issue, while Lyn A Dade calls the debate a tawdry farce that makes no difference to the suffering in Gaza."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-schools-cant-take-more-28694791",
        "title": "Glasgow schools &#39;can&#39;t take more cuts&#39; as teachers are &#39;stretched to limit&#39;",
        "description": "Reform of education services is planned in Glasgow and it has been revealed 172 teaching posts could be removed."
    },
    {
        "url": "https://www.thenational.scot/politics/24141265.podcast-inside-speaker-gaza-ceasefire-row-snp-chief-whip/",
        "title": "Podcast: Inside the Speaker Gaza ceasefire row with <b>SNP</b> chief whip",
        "description": "THE House of Commons descended into chaos this week as the Speaker broke convention during what should have been a serious debate led by the SNP"
    },
    {
        "url": "https://www.heraldscotland.com/news/24141228.shona-robison-defends-priority-council-tax-freeze/?ref=rss",
        "title": "Shona Robison defends &#39;priority&#39; council tax freeze",
        "description": "Relations between the Scottish Government and the country’s town halls have deteriorated in recent months, stemming from Humza Yousaf’s surprise announcement at <b>SNP</b> conference last October, that council tax would be frozen. READ MORE: Councils treated ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-23/politicians-face-growing-safety-fears-but-not-just-over-gaza",
        "title": "&#39;I&#39;d question being an MP if I was starting out again today&#39;: politicians face growing safety fears",
        "description": "ITV News Deputy Political Editor Anushka Asthana explains how threats to MPs have become so severe in the last two decades. | ITV National News"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/william-wragg-mps-environmental-audit-committee-scottish-national-party-gaza-b1141216.html",
        "title": "More than 70 MPs sign motion urging Speaker to quit over Gaza vote",
        "description": "More than 70 MPs have now signed a motion expressing no confidence in the Speaker after angry scenes in the Commons on Wednesday. Senior Conservatives and Scottish National Party MPs have put their names to the “early day motion” proposed by senior Tory William Wragg in a move intended to pressure the Speaker, Sir Lindsay Hoyle, to step down."
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/edinburgh-housing-more-than-12000-disabled-people-trapped-on-waiting-list-for-home-4529846",
        "title": "Edinburgh housing: More than 12,000 disabled people &#39;trapped&#39; on waiting list for home",
        "description": "“It should be a source of shame for the <b>SNP</b>-Green Government that at least close to 40,000 disabled Scots are languishing on social housing waiting lists. “Vulnerable disabled people have been abandoned by the <b>SNP</b>, including more than 1500 who are ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24138820.lindsay-hoyle-pressure-almost-70-mps-call-quit/",
        "title": "Lindsay Hoyle under pressure as almost 70 MPs call for him to quit",
        "description": "Sir Lindsay Hoyle is facing continued pressure to step down as Commons Speaker after almost 70 MPs called for him to go."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68377243",
        "title": "Political violence adviser urges new police powers to protect MPs",
        "description": "Gaza vote chaos highlights pressure on MPs Parliamentary chaos reflects Rochdale campaigning How the row over Commons Speaker unfolded Speaker&#39;s decision on Gaza vote concerning - PM A vote on a ceasefire in Gaza during a <b>SNP</b> debate on Wednesday descended ..."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7276381",
        "title": "Politics latest: Why Speaker Sir Lindsay Hoyle appears safe for now - as minister criticises &#39;real culprit&#39; for Commons chaos",
        "description": "Sir Lindsay sparked outrage among <b>SNP</b> and Tory MPs when he selected a Labour amendment to the <b>SNP</b>&#39;s motion. Convention dictates that only the government can amend an opposition motion, but Sir Lindsay opted to choose Labour&#39;s amendment as well as the ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/angry-west-lothian-budget-debate-28693897",
        "title": "Angry West Lothian budget debate as <b>SNP</b> branded a &#39;masochistic political cult&#39;",
        "description": "Early hints of the tetchy behaviour to come aired at the start when the SNP group leader Councillor Janet Campbell, questioned the provost over the 3pm starting time. She cited family friendly policies and inquired about the welfare of council officers kept late."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24139104.cleverly-backs-hoyle-70-mps-sign-call-speaker-quit/",
        "title": "Cleverly backs Hoyle as more than 70 MPs sign call for Speaker to quit",
        "description": "More than 70 MPs, more than a tenth of the Commons, have signed a motion proposed by senior Conservative William Wragg expressing no confidence in him after Wednesday’s <b>SNP</b> Opposition Day vote descended into chaos. Sir Lindsay has apologised for his ..."
    },
    {
        "url": "https://uk.news.yahoo.com/glasgow-mp-travels-ukraine-show-171256687.html",
        "title": "Glasgow MP travels to Ukraine to show support on anniversary of invasion",
        "description": "Stewart McDonald, Glasgow South <b>SNP</b> MP, arrived in the capital, Kyiv, on Friday morning. He said he met with Ukrainian MPs, people in the defence sector and members of the military who are in recovery. READ NEXT: Famous restaurant boss on 50 years in ..."
    },
    {
        "url": "https://www.ft.com/content/b8aaf8bd-bdef-4043-8967-f9b92ca08601",
        "title": "What comes next for embattled Commons Speaker Lindsay Hoyle?",
        "description": "The Speaker prompted fury from the Scottish National party and the ruling Conservatives after breaking convention by accepting a Labour amendment to an <b>SNP</b> motion that called for an immediate ceasefire in the Israel-Hamas war. Hoyle said his decision was ..."
    },
    {
        "url": "https://www.theguardian.com/news/audio/2024/feb/23/how-a-ceasefire-vote-led-to-two-days-of-chaos-in-the-commons-podcast",
        "title": "How a ceasefire vote led to two days of chaos in the Commons",
        "description": "All parties were calling for a pause in the conflict. So why did MPs storm out and why is the speaker facing calls to quit? Kiran Stacey reports"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/full-list-71-mps-who-28694787",
        "title": "Full list of 71 MPs who have signed no confidence motion in Commons Speaker Lindsay Hoyle",
        "description": "Stephen Flynn and Mhairi Black from the <b>SNP</b> at Westminster, also signed. More than half of the <b>SNP</b>’s Westminster contingent have now signed the motion. It comes after Wednesday’s <b>SNP</b> Opposition Day vote descended into chaos after Sir Lindsay approved ..."
    },
    {
        "url": "https://www.walesonline.co.uk/news/wales-news/welsh-mp-favourite-take-over-28693901",
        "title": "Welsh MP favourite to take over from Lindsay Hoyle as Commons speaker",
        "description": "As it stands, 67 MPs have called for Sir Lindsay to quit the high profile role, including 28 from the <b>SNP</b>. Bookmaker William Hill puts Mr Bryant, a Labour MP, as favourite to take over from him if he does stand down. Mr Bryant has previously run for the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/north-lanarkshire-rejects-garden-waste-32190031",
        "title": "North Lanarkshire rejects garden waste charges and winter and road cuts in 2024-2025 budget",
        "description": "Both the <b>SNP</b> and Progressive Change North Lanarkshire had proposed the introduction of an annual £35 charge to empty householders’ garden bins in their budget papers. The Lanarkshire Live app is available to download now. Get all the news from your area ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/lack-care-service-detail-firmly-inacceptable-say-stuc",
        "title": "Lack of care service detail ‘firmly inacceptable’, say STUC",
        "description": "THE STUC has slammed a lack of detail on <b>SNP</b>-Green Scottish government plans for a National Care Service (NCS) as “unacceptable.” STUC general secretary Roz Foyer made the remarks after Holyrood’s health, social care and sport committee reported ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68371016?at_link_id=6F37C5A4-D227-11EE-AB23-387FD9B5F045&at_campaign_type=owned&at_medium=social&at_link_origin=BBC_Politics&at_campaign=Social_Flow&at_ptr_name=facebook_page&at_bbc_team=editorial&at_format=link&at_link_type=web_link",
        "title": "How the row over Commons Speaker Sir Lindsay Hoyle unfolded",
        "description": "Sir Lindsay had decided to allow a vote on a Labour amendment to an <b>SNP</b> motion, calling for an immediate ceasefire in the conflict, sparking fury among <b>SNP</b> and Conservative MPs who accused him of breaking with parliamentary convention. On Thursday ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24140799.northern-ireland-can-install-buffer-zones-not-snp/?ref=rss",
        "title": "If Northern Ireland can install buffer zones, why not <b>SNP</b>?",
        "description": "I’m from Northern Ireland, therefore it amazes me that my homeland – a nation plagued by Christian fundamentalism – has managed to put"
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24139104.cleverly-backs-hoyle-70-mps-sign-call-speaker-quit/",
        "title": "Cleverly backs Hoyle as more than 70 MPs sign call for Speaker to quit",
        "description": "Sir Lindsay Hoyle gained the support of the senior Cabinet minister as he faced continued pressure to step down."
    },
    {
        "url": "https://leftfootforward.org/2024/02/full-list-of-mps-who-have-signed-motion-of-no-confidence-in-lindsay-hoyle-following-gaza-ceasefire-vote/",
        "title": "Full list of MPs who have signed motion of no confidence in Lindsay Hoyle following Gaza ceasefire vote",
        "description": "The Commons was initially set to vote on a motion proposed by the SNP which called for a ceasefire. However, that motion was ultimately not put to MPs after the speaker Lindsay Hoyle allowed an amendment from the Labour Party."
    },
    {
        "url": "https://www.holyrood.com/inside-politics/view,economic-gains-what-the-snp-can-learn-from-labours-business-lovein",
        "title": "Economic gains: What the <b>SNP</b> can learn from Labour&#39;s business love-in",
        "description": "Contrast that with the <b>SNP</b>, whose currency with business has fallen to a new low after First Minister Humza Yousaf was forced to reshuffle his cabinet earlier this month. Having stood by health secretary Michael Matheson, refusing to sack him when he ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/west-lothian-agree-council-tax-28692884",
        "title": "West Lothian agree council tax freeze in budget as rent rise approved",
        "description": "Council Tax freeze cuts an extra £1.4million from planned spending in the next year as service costs rise across the council and bin charges for garden waste are brought in"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/23/rishi-sunak-latest-news-cleverly-hoyle-braverman/",
        "title": "William Wragg: Hoyle not an ‘impartial referee’",
        "description": "James Cleverly said he was “comfortable” with Sir Lindsay Hoyle continuing in his role after 67 MPs signed a motion of no confidence against the Commons Speaker."
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1870134/lindsay-hoyle-gaza-resign",
        "title": "There is only one way Lindsay Hoyle can save dignity from the Gaza chaos - resign!",
        "description": "Oh, my goodness me! Mr Speaker seems to have got the house, well the Tories and the <b>SNP</b> anyway, into an almighty tizzy. Their unmentionables have become twisted in the tightest of knots, I fancy. I honestly believed that the bad old days of that appalling ..."
    },
    {
        "url": "https://www.politics.co.uk/news/2024/02/23/motion-of-no-confidence-commons-speaker-lindsay-hoyle/",
        "title": "Over 70 MPs back motion of no confidence in commons Speaker Lindsay Hoyle",
        "description": "Over 60 MPs have backed a motion of no confidence in House of Commons speaker Sir Lindsay Hoyle after a day of chaos in the chamber."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/james-cleverly-political-violence-gaza-commons-b2501164.html",
        "title": "Government tells police to crack down on protests at MPs’ homes after Gaza Commons furore",
        "description": "The group’s leader Sarah Lunnon defended their right to protest outside the homes of MPs, saying on Radio 4’s Today programme that “people are no longer safe [from cold weather, hunger, flooding] in their homes, our politicians have a duty to protect us and they’re not doing it”."
    },
    {
        "url": "https://www.itv.com/news/2024-02-23/pm-adviser-says-police-should-be-able-to-disperse-protests-around-parliament",
        "title": "PM&#39;s adviser says police should have power to &#39;disperse&#39; protests around Parliament",
        "description": "The PM&#39;s official adviser on political violence says protests shouldn&#39;t be allowed outside Parliament and MPs offices | ITV National News"
    },
    {
        "url": "https://www.thetimes.co.uk/article/096a6f86-14b4-47b5-a379-a81fc47adc97?shareToken=3160db8db410dcd762d4770a1331c05a",
        "title": "Scottish households shouldn’t pay for a crisis they didn’t cause",
        "description": "It’s a serious plan to tackle the serious long-term challenges facing Scotland. And yet the choices taken by the <b>SNP</b> could not be starker. Not only do they oppose the windfall tax that would help working people, but they are putting taxes up on working ..."
    },
    {
        "url": "https://news.stv.tv/politics/insight-absolutely-frightening-threats-against-mps-pit-security-against-democracy",
        "title": "&#39;Absolutely frightening&#39; threats against MPs pit security against democracy",
        "description": "Speaker Lindsay Hoyle is concerned about MPs’ security due to the intimidation suffered by some parliamentarians during the Middle East debate."
    },
    {
        "url": "https://www.heraldscotland.com/news/24140108.snp-lose-borders-council-by-election-conservatives/",
        "title": "<b>SNP</b> lose Borders council by-election to Conservatives",
        "description": "The <b>SNP</b> have been dealt a blow in a by-election in the Borders losing a seat on the local council to the Conservatives. Tory candidate John Bathgate took a massive 58.5% of the vote to win the Jedburgh and District seat on Scottish Borders Council."
    },
    {
        "url": "https://www.middleeasteye.net/news/uk-suella-braverman-says-islamists-now-control-britain",
        "title": "UK: Suella Braverman says &#39;Islamists&#39; now in control of Britain",
        "description": "Her comments come in the wake of a row in parliament over a motion calling for a ceasefire in Gaza. On Wednesday, the Scottish National Party (<b>SNP</b>) put forward a motion that included condemnation of Israel for its &quot;collective punishment&quot; of the Palestinian ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/gaza-ceasefire-vote-humza-yousaf-accuses-worst-of-politicians-suella-braverman-of-stoking-fires-of-racial-and-religious-tensions-4531094",
        "title": "Gaza ceasefire vote: Humza Yousaf accuses ‘worst of politicians’ Suella Braverman of stoking &#39;fires of racial and religious tensions’",
        "description": "Humza Yousaf has taken aim at former home secretary Suella Braverman, accusing her of stoking “the fires of racial and religious tensions for self-serving purposes” in the wake of chaotic scenes at this week’s Gaza ceasefire vote."
    },
    {
        "url": "https://www.eastlothiancourier.com/opinion/24136944.paul-mclennan-msp-residents-distressed-angry-situation-gaza/",
        "title": "Paul McLennan MSP: Residents distressed and angry at situation in Gaza",
        "description": "Stephen Flynn and Westminster’s <b>SNP</b> MPs again proposed demanding an immediate ceasefire, leaving Labour MPs to argue about wording. This isn’t party political: Courier readers of diverse political views will, I’m confident, back Stephen Flynn’s ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68377243?at_link_origin=BBC_Politics&at_link_type=web_link&at_link_id=ADFDD8A6-D226-11EE-92D6-7E2187A28522&at_medium=social&at_campaign_type=owned&at_campaign=Social_Flow&at_format=link&at_bbc_team=editorial&at_ptr_name=facebook_page",
        "title": "Political violence adviser urges new police powers to protect MPs",
        "description": "Police should get extra powers to tackle protests outside Parliament, the author of a government-commissioned review has urged. Crossbench peer Lord Walney said MPs needed protecting from &quot;intimidation&quot; that could influence how they vote."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/chris-bryant-favourite-to-replace-lindsay-hoyle-as-speaker-369269/",
        "title": "Chris Bryant favourite to replace Lindsay Hoyle as Speaker",
        "description": "The Conservatives also have two notable representees in the market, which could make things interesting if Hoyle steps down."
    },
    {
        "url": "https://www.holyrood.com/news/view,north-sea-spat-tory-leader-challenges-yousaf-and-sarwar-to-debate-on-future-of-oil",
        "title": "North Sea spat: Tory leader challenges Yousaf and Sarwar to debate future of oil",
        "description": "Scottish Conservative leader Douglas Ross has poured fuel on the row currently raging between the SNP and Scottish Labour over the future of the North Sea, challenging the leaders of both parties to a debate on the issue."
    },
    {
        "url": "https://www.guardian-series.co.uk/news/national/24139104.cleverly-backs-hoyle-almost-70-mps-sign-call-speaker-quit/",
        "title": "Cleverly backs Hoyle as almost 70 MPs sign call for Speaker to quit",
        "description": "Nearly 70 MPs, more than a tenth of the Commons, have signed a motion proposed by senior Conservative William Wragg expressing no confidence in him after Wednesday’s <b>SNP</b> Opposition Day vote descended into chaos. Sir Lindsay has apologised for his ..."
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24132741.snp-heaps-pressure-labour-calling-commitment-28bn-green-spending/",
        "title": "<b>SNP</b> heaps pressure on Labour by calling for commitment to £28bn green spending",
        "description": "The <b>SNP</b> at Westminster is piling pressure on Labour over its slashed £28 billion green spending pledge by calling for a commitment to the investment. Sir Keir Starmer’s party announced earlier this month it was drastically scaling back its key ..."
    },
    {
        "url": "https://uk.news.yahoo.com/fiona-bruce-omits-key-snp-151819210.html",
        "title": "Fiona Bruce omits key <b>SNP</b> details in Question Time debate on Commons chaos",
        "description": "FIONA Bruce has been criticised after she missed out key details about the <b>SNP</b> when summarising Wednesday&#39;s chaotic events in the House of Commons on Question Time. Commons Speaker Lindsay Hoyle sparked uproar after choosing to break with long-established ..."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1869883/Keir-Starmer-privileges-committee-Lindsay-Hoyle",
        "title": "Keir Starmer referred to top parliamentary ethics watchdog by MP over Speaker-gate",
        "description": "“It has been alleged that this course of conduct was pursued to ensure that the Labour amendment to the <b>SNP</b> motion for an immediate ceasefire in Gaza was given priority as the Leader of the Opposition sought to prevent his members voting against the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/lanarkshire-mp-insists-no-up-32189802",
        "title": "Lanarkshire MP insists there will be no let up in calls for &#39;immediate ceasefire&#39; following Commons chaos",
        "description": "That’s despite chaotic scenes that broke out on Wednesday evening in the House of Commons when an <b>SNP</b> Opposition Day motion was not voted on. Marion Fellows MP says she wants to reassure the hundreds of constituents who have contacted her office that the ..."
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/north-east-news/full-list-mps-who-declared-28688628",
        "title": "Full list of MPs who have declared no confidence in Speaker Sir Lindsay Hoyle - including three from the North East",
        "description": "The mottion has won the backing of dozens of Tory and <b>SNP</b> MPs. They launched the bid after Sir Lindsay let Labour suggest a change for an &quot;immediate humanitarian ceasefire&quot; that everyone must follow. The change was agreed without voting after some <b>SNP</b> MPs ..."
    },
    {
        "url": "https://www.independent.co.uk/politics/speaker-hoyle-mp-gaza-ceasefire-vote-commons-b2500449.html",
        "title": "Gaza ceasefire vote: Why did MPs walk out in protest at speaker Lindsay Hoyle?",
        "description": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address The <b>SNP</b> were angry as they felt their ..."
    }
]