[
    {
        "url": "https://www.itv.com/news/2024-02-16/scottish-labour-mps-should-be-whipped-in-gaza-ceasefire-vote-snp",
        "title": "Scottish Labour MPs should be whipped in Gaza ceasefire vote – <b>SNP</b>",
        "description": "The <b>SNP</b> is calling on Scottish Labour to whip its two MPs to vote for an immediate ceasefire in Gaza, ahead of a vote in the House of Commons next week. On Saturday, Scottish Labour’s conference is expected to pass a motion calling for an immediate ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/humza-yousaf-scotland-douglas-ross-first-minister-tories-b1139758.html",
        "title": "Yousaf to campaign in Scottish Tory leader’s seat",
        "description": "The <b>SNP</b> has set its sights on Mr Ross’ party, with Labour riding high in the polls ahead of an election expected this year. Mr Yousaf will appear in Moray on Saturday alongside the Moray West, Nairn and Strathspey candidate Graham Leadbitter, visiting a ..."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/letter-from-scotland-440/",
        "title": "Letter from Scotland",
        "description": "It lost 40 of its 41 MPs in Scotland. It still only has 2 MPs and 22 seats in the Scottish Parliament, behind the Conservatives (31) and the <b>SNP</b> (63). The latest opinion polls put Labour and the <b>SNP</b> level-pegging at about 35 per cent support each ..."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24125650.another-five-years-tory-government-unbearable-nightmare-warns-sarwar/",
        "title": "Another five years of Tory Government an ‘unbearable nightmare’, warns Sarwar",
        "description": "Anas Sarwar has made a fresh appeal to independence supporters to back Labour in the forthcoming general election – warning another five years of Tory rule at Westminster would be an “unbearable nightmare”."
    },
    {
        "url": "https://www.holyrood.com/news/view,anas-sarwar-calls-for-immediate-ceasefire-in-gaza-in-scottish-labour-conference-speech",
        "title": "Anas Sarwar calls for immediate ceasefire in Gaza in Scottish Labour conference speech",
        "description": "Anas Sarwar has called for an “immediate ceasefire” in Gaza in his speech to the Scottish Labour conference. The party has been under pressure over its stance on the conflict, which has cost tens of thousands of lives."
    },
    {
        "url": "https://www.scotsman.com/news/politics/labour-conference-anas-sarwar-suggests-scottish-labour-will-cut-income-tax-if-it-wins-power-4522265",
        "title": "Labour conference: Anas Sarwar suggests Scottish Labour will cut income tax if it wins power",
        "description": "Anas Sarwar has signalled he will cut income tax for middle-earners if Scottish Labour wins power in Holyrood, calling the current situation “ludicrous”."
    },
    {
        "url": "https://dailybusinessgroup.co.uk/2024/02/were-pro-business-says-sarwar-despite-attacks/",
        "title": "‘We’re pro-business’ says Sarwar despite attacks",
        "description": "Anas Sarwar has claimed Scottish Labour is pro-business while at the same time backing a range of employment measures and energy policies that have drawn criticism from business leaders."
    },
    {
        "url": "https://www.thetimes.co.uk/article/sarwar-promises-tax-cuts-if-unstoppable-scottish-labour-take-power-0b2fp7hn3",
        "title": "Sarwar promises tax cuts if ‘unstoppable’ Scottish Labour take power",
        "description": "The party leader delivered a rousing speech to conference delegates promising higher rates cuts and jobs, but opponents question his hubris"
    },
    {
        "url": "https://www.thenational.scot/news/24125896.young-scottish-labour-activists-react-anas-sarwar-speech/",
        "title": "Young Scottish Labour activists react to Anas Sarwar speech",
        "description": "Lauren Harper, a youth representative on the Scottish Executive Committee and a member of the party&#39;s socialist wing, called the Scottish Labour leader&#39;s speech “absymal”. “I just thought it was really poor and wishy-washy,” she added."
    },
    {
        "url": "https://www.thenational.scot/news/24125098.scrap-not-eu-labels-copy-scottish-funds-food-bosses-tell-uk/",
        "title": "Scrap &#39;not for EU&#39; labels and copy Scottish funds, food bosses tell UK",
        "description": "Brexit “not for EU” labelling on food and copying Scottish Government funding for suppliers are two key recommendations for"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11996046/anas-sarwar-labour-mantra-change-flogged/",
        "title": "Anas Sarwar didn’t just double-down on Labour’s ‘change’ mantra.. he flogged it to within an inch of its life",
        "description": "And unless tangible change happens in the 18 months or so between the Westminster election and the Holyrood vote in 2026, Mr Sarwar’s dream of getting into Bute House may slip away amid cries of betrayal from the <b>SNP</b>. He knows this. Labour chiefs know this."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/c89n5vg1zx7o",
        "title": "Councils vote to freeze tax rates",
        "description": "The freeze was unexpectedly announced as <b>SNP</b> policy by the first minister at the party&#39;s conference last October, taking councils by surprise. The Scottish government has warned councils they will not receive money to cover a freeze if they opt to increase ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/reform-recession-robbed-rishi-sunak-chance-labour-chaos/",
        "title": "Reform and recession have robbed Rishi of the chance to exploit Labour chaos",
        "description": "The Prime Minister says a vote for Richard Tice’s party is a vote to put Keir Starmer into No 10 but the public aren’t listening"
    },
    {
        "url": "https://morningstaronline.co.uk/article/labour-will-make-scotland-clean-energy-capital-uk",
        "title": "Labour will make Scotland the ‘clean energy capital of UK’",
        "description": "DELEGATES to Scottish Labour’s business conference in Glasgow were assured today that the next Labour government will make Scotland the “clean energy capital” of Britain. The claim was made by shadow net zero secretary Ed Miliband as he discussed the party’s green prosperity plan alongside his Holyrood counterpart, Sarah Boyack."
    },
    {
        "url": "https://www.heraldscotland.com/news/24125773.sturgeon-yousafs-covid-message-lies-turn-reputations-trash/",
        "title": "Sturgeon and Yousaf’s Covid message lies turn reputations to trash",
        "description": "UNTIL recently it might have made sense for Humza Yousaf to cut Nicola Sturgeon loose over her sleekit and duplicitous lies around deleting"
    },
    {
        "url": "https://morningstaronline.co.uk/article/we-will-not-rest-until-we-put-an-end-to-this-monstrosity",
        "title": "‘We will not rest until we put an end to this monstrosity’",
        "description": "Palestine supporters to mobilise worldwide in call for a ceasefire as Israel mounts attack on Gaza&#39;s last refuge"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-party-snp-scottish-conservatives-holyrood-b1139709.html",
        "title": "Tactical voting ‘note of caution’ issued to Labour ahead of election",
        "description": "Polling experts from the Scottish Election Study discussed the predicted trends of a Labour voter at the upcoming general election."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7239085",
        "title": "Politics live: Backbench Tories deliver message to Rishi Sunak after double by-election defeat",
        "description": "In third are the Lib Dems on 9.8%, followed by Reform on 9.4%. The Green Party stands at 5.7%, and the <b>SNP</b> on 3.2%. See the latest update below - and you can read more about the methodology behind the tracker here. Statehood for Palestine is &#39;not the gift ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24125606.anas-sarwar-touts-income-tax-cuts-attacks-anti-aspiration-snp/?ref=rss",
        "title": "Anas Sarwar touts income tax cuts as he attacks &#39;anti-aspiration&#39; <b>SNP</b>",
        "description": "He accused the <b>SNP</b>-Green Government of resorting to tax hikes to find money “as a substitute for economic growth”, saying he would spur growth by working with business. “We are an unashamedly pro-growth, pro-business, pro-worker party,” he told ..."
    },
    {
        "url": "https://www.worcesternews.co.uk/news/national/24125411.five-years-tory-government-unbearable-nightmare---sarwar/",
        "title": "Five more years of Tory Government would be ‘unbearable nightmare’ – Sarwar",
        "description": "In a speech with few concrete policies, Mr Sarwar emphasised the differences between his party, the Tories and the <b>SNP</b> as he also looked ahead to the Holyrood election in 2026. Rishi Sunak’s Tory party, he said, is pushing closer to the “far-right ..."
    },
    {
        "url": "https://uk.news.yahoo.com/police-investigating-edinburgh-castle-redcoat-201627807.html",
        "title": "Police investigating after Edinburgh Castle Redcoat Café &#39;threatened with firebombs&#39;",
        "description": "The backlash was sparked by the announcement of a completed renovation of the café with <b>SNP</b> MP Douglas Chapman among those to call for a “swift rebrand”. Regarding allegations of firebombing, a Police Scotland spokesperson said: “We have received a ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-community-centre-saved-closure-28649683",
        "title": "Glasgow community centre saved from closure after budget u-turn",
        "description": "Proposals to close or transfer ownership of five Glasgow community centres have been scrapped in a dramatic u-turn by the <b>SNP</b> administration. The administration had planned to make a saving of £469,000 through community venue closures or transfers which ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/chris-hoy-humza-yousaf-instagram-ambassador-one-b2497677.html",
        "title": "Sir Chris Hoy ‘felt forced’ to reveal cancer diagnosis",
        "description": "<b>SNP</b> MSP Evelyn Tweed paid tribute to Sir Chris on X. “She wrote: Sorry to hear @chrishoy has been diagnosed with cancer. I wish him a speedy recovery. “One of Scotland’s best sporting champions, an Ambassador for @SAMHtweets, supporter of @SocialBite ..."
    },
    {
        "url": "https://news.stv.tv/politics/anas-sarwar-scotland-will-be-at-the-heart-of-a-uk-labour-government",
        "title": "Anas Sarwar: Scotland will be at the heart of a UK Labour government",
        "description": "The Scottish Labour leader used the word &#39;change&#39; more than 60 times throughout his hour-long speech on the first day of his party&#39;s conference in Glasgow."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scotland-snp-government-westminster-scottish-government-b1139703.html",
        "title": "Another five years of Tory Government an ‘unbearable nightmare’, warns Sarwar",
        "description": "Anas Sarwar has made a fresh appeal to independence supporters to back Labour in the forthcoming general election – warning another five years of Tory rule at Westminster would be an “unbearable nightmare”."
    },
    {
        "url": "https://inews.co.uk/news/scotland/scotland-conservatives-back-sunak-2910359?ico=related_article_inline",
        "title": "Stop fighting and back PM, Scottish Tories warn plotters after by-election blow",
        "description": "Scottish Conservatives have urged colleagues in Westminster to back Rishi Sunak and stop infighting despite the party’s double by-election blow. The Prime Minister is expected to face fresh challenges from the Tory right following defeats in Wellingborough and Kingswood,"
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-labour-pledge-160000-more-nhs-appointments-year",
        "title": "Scottish Labour pledge 160,000 more NHS appointments a year",
        "description": "SCOTTISH Labour leader Anas Sarwar claimed today that the party will deliver 160,000 more NHS appointments annually by closing tax loopholes."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/16/hypocrisy-allegations-dog-labour-candidate-rwanda/",
        "title": "‘Hypocrisy’ allegations dog Labour candidate over Rwanda connection",
        "description": "Blair McDougall, who has attacked the PM’s migrant plan as ‘inhumane’, previously worked in the African nation as an adviser"
    },
    {
        "url": "https://www.holyrood.com/news/view,anas-sarwar-hints-at-income-tax-change-and-pledges-nhs-cash-in-general-election-push",
        "title": "Anas Sarwar hints at income tax change and pledges NHS cash in general election push",
        "description": "Anas Sarwar hints at income tax change and pledges NHS cash in general election push in Scottish Labour conference"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/scottish-news/24125557.anas-sarwar-labour-will-lower-tax-burden-scots-workers/",
        "title": "Anas Sarwar: Labour will lower tax burden for Scots workers",
        "description": "Anas Sarwar said a Labour Scottish Government would lower the tax burden on Scottish workers. In his speech to the party’s conference in Glasgow, he hit out at the SNP income tax policy and its handling of the economy. Sarwar accused the SNP of “financial mismanagement during a cost-of-living crisis.”"
    }
]