[
    {
        "url": "https://www.mirror.co.uk/news/uk-news/tyrant-vladimir-putin-poses-mortal-32173896",
        "title": "&#39;Tyrant Vladimir Putin poses mortal danger to Britain - he can’t be ignored&#39;",
        "description": "Campaigner Bill Browder - thought to be top of the Kremlin&#39;s kill list in the UK - is right to warn of the threat Vladimir Putin poses and cannot be ignored, says the"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13106097/GRAHAM-GRANT-sop-Nationalists-proved-flop-viewers.html",
        "title": "GRAHAM GRANT: A sop to the Nationalists that proved a flop with viewers",
        "description": "It led to <b>SNP</b> supporters staging an angry protest outside the BBC’s Scottish headquarters in Glasgow. Sources close to the creation of the channel said it was driven partly by a desire to shore up the corporation’s defences in the event that ..."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-ill-stay-on-as-scotlands-first-minister-if-snp-loses-seats-at-the-uk-general-election",
        "title": "Yousaf: I&#39;ll stay on as FM if <b>SNP</b> loses seats at general election",
        "description": "The First Minister suggested that even if his party lost a third of its MPs he would stay on as leader. The <b>SNP</b> leader spoke to STV’s Scotland Tonight programme as polls show the party’s longstanding dominance in Scotland is slipping amid a resurgent ..."
    },
    {
        "url": "https://www.itv.com/watch/news/labour-confirms-change-of-stance-on-gaza-ceasefire-ahead-of-vote-tomorrow/s64v2kn",
        "title": "Labour confirms change of stance on Gaza ceasefire ahead of vote tomorrow",
        "description": "Cookie choices We use cookies and similar technologies to provide our services and to measure and improve your experience. If you choose ‘Accept’, the online marketing you see about ITV will be more relevant to you. See our Privacy &amp; Cookie Information for more info."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68346129",
        "title": "Labour calls for immediate humanitarian ceasefire in Gaza for first time",
        "description": "Shadow foreign secretary David Lammy says the party&#39;s call mirrors the language of the UN and international allies."
    },
    {
        "url": "https://www.heraldscotland.com/news/24133000.starmer-faces-new-rebellion-labour-mps-snp-ceasefire-motion/?ref=rss",
        "title": "Starmer faces new rebellion from Labour MPs over <b>SNP</b> ceasefire motion",
        "description": "Sir Keir Starmer could still face a rebellion from his own MPs, despite backing calls call for an &quot;immediate humanitarian ceasefire&quot;"
    },
    {
        "url": "https://news.sky.com/story/israel-hamas-war-labour-finally-shifts-its-ceasefire-stance-but-may-have-fallen-into-a-trap-13076578",
        "title": "Israel-Hamas war: Labour finally shifts its ceasefire stance - but may have fallen into a trap",
        "description": "Labour MPs tomorrow will be offered the chance to either support the Tories - who reject a permanent ceasefire in Gaza until all hostages are released - or the SNP position, which calls for an immediate one."
    },
    {
        "url": "https://www.express.co.uk/life-style/cars/1868919/uk-city-increases-parking-taxes-commuters-residents",
        "title": "Major UK city increases on-street parking taxes could impact poverty-stricken residents",
        "description": "This <b>SNP</b> parking budget will raise around £2.5 million extra from on-street pay and display parking, according to The Herald. READ MORE: Made in China – expert shares most anticipated cars set to reach UK market before 2025 It will also collect £ ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/sir-keir-changes-stance-gaza-for-fifth-time-ceasefire/",
        "title": "Sir Keir changes stance on Gaza for fifth time as he backs ‘immediate ceasefire’",
        "description": "Stephen Flynn, the <b>SNP</b> leader in Westminster, claimed victory and crowed that the nationalists had “inserted a backbone into the Labour Party”. Sir Keir tabled an amendment backing an “immediate humanitarian ceasefire” after coming under pressure ..."
    },
    {
        "url": "https://www.lbc.co.uk/news/labours-ceasefire-motion-broader-and-goes-further-than-the-snp-david-lammy/",
        "title": "&#39;I want to do what is right&#39;: Labour&#39;s ceasefire motion is &#39;broader&#39; and &#39;goes further&#39; than the <b>SNP</b>&#39;s, says David Lammy",
        "description": "&quot;We&#39;ve crafted a motion that I think could attract the support of the government, as well as support the <b>SNP</b> and I saw there some generosity towards the motion as it&#39;s now been crafted,&quot; Mr Lammy said. &quot;I want to do what is right&quot;, Mr Lammy told Andrew Marr."
    },
    {
        "url": "https://news.stv.tv/politics/scottish-transport-secretary-still-committed-to-dualling-a96-but-cannot-give-start-date",
        "title": "Scottish transport secretary still committed to dualling A96 but cannot give start date",
        "description": "He said: “Fiona Hyslop’s pitiful refusal to admit that the 2030 completion date won’t be met is all too typical of the veil of secrecy which has clouded the SNP’s despicable handling of the A96 dualling."
    },
    {
        "url": "https://news.sky.com/video/snps-gaza-ceasefire-motion-is-about-the-palestinian-people-israel-hamas-war-13076569",
        "title": "<b>SNP</b>&#39;s Gaza ceasefire motion is &#39;about the Palestinian people&#39; | Israel-Hamas war",
        "description": "SNP&#39;s Westminster leader, Stephen Flynn says his party&#39;s motion for an immediate ceasefire in the Israel-Hamas war is &quot;&#39;about the Palestinian people.&quot;"
    },
    {
        "url": "https://www.thenational.scot/news/24133003.keir-starmer-ordering-labour-mps-vote-snp-ceasefire-motion/",
        "title": "Keir Starmer &#39;ordering Labour MPs to vote down <b>SNP</b> ceasefire motion&#39;",
        "description": "KEIR Starmer is ordering his MPs to vote down the SNP&#39;s Gaza ceasefire motion because it accuses Israel of engaging in the"
    },
    {
        "url": "https://www.thenational.scot/news/24133003.keir-starmer-ordering-labour-mps-abstain-snp-ceasefire-motion/",
        "title": "Keir Starmer &#39;ordering Labour MPs to abstain on <b>SNP</b> ceasefire motion&#39;",
        "description": "KEIR Starmer is ordering his MPs to abstain on the <b>SNP</b>&#39;s Gaza ceasefire motion because it accuses Israel of engaging in the &quot;collective punishment&quot; of the Palestinian people, it has been reported. On Tuesday Starmer&#39;s party tabled an amendment to the <b>SNP</b>&#39;s ..."
    },
    {
        "url": "https://www.midlothianview.com/news/council-tax-freeze-will-mean-10-rise-next-year-for-east-lothian",
        "title": "Council tax freeze will mean 10% rise next year for East Lothian",
        "description": "Residents in East Lothian will face a 10 per cent rise in council tax next year after councillors agreed to support a freeze in this year’s budget."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-demands-immediate-humanitarian-ceasefire-in-gaza-2915794?ico=more_from_this_author",
        "title": "Labour demands ‘immediate humanitarian ceasefire’ in Gaza but MPs may still rebel",
        "description": "The move was an attempt to prevent another Commons rebellion but party sources said it was not enough to diffuse support for the SNP motion"
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/labour-calls-for-immediate-ceasefire-in-gaza-for-first-time/",
        "title": "Labour calls for &#39;immediate ceasefire&#39; in Gaza for first time",
        "description": "Labour has called for an immediate ceasefire in Gaza for the first time, saying the situation there is intolerable."
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/02/20/lucy-frazer-public-interest-concerns-uae-bid-telegraph/",
        "title": "Lucy Frazer says public interest concerns remain in UAE bid for The Telegraph",
        "description": "The Culture Secretary has expressed continued concerns over a United Arab Emirates-funded bid to buy The Telegraph in a letter to a cross-party group of MPs. Lucy Frazer said there remain “public interest considerations” over the proposed acquisition, including “the accurate presentation of news and free expression of opinion”."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13105541/Prince-Williams-Gaza-plans-King-MPs-question-Charles-knew-highly-political-statement.html",
        "title": "&#39;We want to see an end to the fighting&#39;: Israel responds to Prince William&#39;s shock statement over Gaza conflict - as experts claim well-choreographed intervention shows he ...",
        "description": "The comment comes just the day before MPs will debate and vote on an <b>SNP</b> measure calling for an unqualified &#39;immediate ceasefire&#39; to end the bloodshed, even if Israeli hostages are not returned. Labour has added an amendment as it also calls for an ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/bin-hubs-glasgow-streets-being-28671687",
        "title": "Bin hubs on Glasgow streets being rolled out to 80,000 tenements",
        "description": "A total of 80,000 tenements are in line to get bins on streets over the next two years to give residents &quot;back their back courts.&quot; Glasgow City Council aims to spend £7.2 million towards the roll out of &#39;on-street&#39; bin hubs,"
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-welcome-return-of-labours-backbone-as-party-shifts-position-to-call-for-immediate-humanitarian-ceasefire-in-gaza-4525970",
        "title": "<b>SNP</b> welcome &#39;return of Labour&#39;s backbone&#39; as party shifts position to call for ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "In a surprise move ahead of the vote, the United States circulated a rival UN Security Council resolution that would support a temporary ceasefire in Gaza linked to the release of all hostages, and call for the lifting of all restrictions on the delivery of humanitarian aid."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-demands-immediate-humanitarian-ceasefire-in-gaza-2915794?ico=editors_picks",
        "title": "Labour demands ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "The move was an attempt to prevent another Commons rebellion but party sources said it was not enough to diffuse support for the SNP motion"
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nigel-farage-tells-prince-william-32171842",
        "title": "Prince William told &#39;stick to BAFTAs&#39; by Nigel Farage after Gaza statement",
        "description": "Labour confirmed today it will call for an &quot;immediate humanitarian ceasefire&quot;. No 10 said it could not confirm how the Government planned to vote on Wednesday&#39;s <b>SNP</b> motion. A spokeswoman for the Prime Minister said its position had not changed and that ..."
    },
    {
        "url": "https://www.eastlothiancourier.com/news/24132828.east-lothian-council-budget-ten-per-cent-council-tax-rise-2025/",
        "title": "East Lothian Council budget: Ten per cent council tax rise in 2025",
        "description": "RESIDENTS in East Lothian will face a 10 per cent rise in council tax next year after councillors agreed to support a freeze in this"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/gaza-snp-palestine-israel-motion-b2499349.html",
        "title": "What does the <b>SNP</b>’s motion and vote on Gaza mean for Labour?",
        "description": "With the death toll in Gaza steadily moving up every day, the SNP has tabled a motion calling for an immediate ceasefire, putting Labour in an uncomfortable place, as Sean O’Grady explains the context"
    },
    {
        "url": "https://www.strathspey-herald.co.uk/news/exclusive-highland-council-budget-includes-potential-job-lo-342803/",
        "title": "Highland Council budget includes potential job losses, adult social care cuts, and Council Tax details",
        "description": "Highland Council’s <b>SNP</b>-Independent administration has confirmed its proposed budget for 2024/25 with £602.5 million to deliver the region’s vital services amid the “unprecedented financial challenge” facing the local authority. Each year the counc ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24132687.snp-blames-hospital-building-cuts-twin-financial-pressures/?ref=rss",
        "title": "<b>SNP</b> blames hospital building cuts on &#39;twin&#39; financial pressures",
        "description": "At least a dozen NHS construction projects have been delayed for up to two years. <b>SNP</b> ministers have confirmed the Scottish Government is reviewing all of its capital spending projects amid the budget constraints. The Scottish Government told health boards ..."
    },
    {
        "url": "https://uk.news.yahoo.com/why-wait-long-david-lammy-184000232.html",
        "title": "&#39;Why wait this long?&#39;: David Lammy defends Labour delay in ceasefire call",
        "description": "It comes after his party lodged an amendment to the <b>SNP</b>&#39;s motion calling for an &quot;immediate ceasefire&quot; amid fears of another Commons rebellion over the party&#39;s position. Much of the sentiment matches the <b>SNP</b>&#39;s motion, however the reference to &quot;collective ..."
    },
    {
        "url": "https://uk.news.yahoo.com/80-000-glasgow-tenements-bins-180209330.html",
        "title": "80,000 Glasgow tenements to get bins on streets and out of backcourts",
        "description": "Councillor Bell, <b>SNP</b>, said: “My budget invests to ensure that we can move more quickly to roll out our successful bin hub programme which has been trialled in areas in the city including in Pollokshields. And this funding will deliver the programme to ..."
    },
    {
        "url": "https://www.ft.com/content/64fea0d2-f327-4110-b34b-028212127c06",
        "title": "UK Labour demands immediate humanitarian ceasefire in Gaza",
        "description": "Labour has drafted its own amendment to the <b>SNP</b> motion that calls for an immediate ceasefire, dependent on certain conditions being met, which it will whip MPs to support. The statement said that an Israeli ground offensive in Rafah risked “catastrophic ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/20/post-office-horizon-scandal-conservatives-kemi-badenoch-rishi-sunak-uk-politics-live?page=with:block-65d4dfcc8f0814397b234b79",
        "title": "<b>SNP</b> welcomes Labour call for ‘immediate humanitarian ceasefire’ in Gaza, claiming it forced Starmer into U-turn – UK politics live",
        "description": "Stephen Flynn says decision by Labour is ‘long-overdue’ and Starmer was forced into position by public pressure and the <b>SNP</b> You must be 18 or over to fill in this form. We will only use this data for the purpose of improving our live blogs. For more ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/david-lammy-government-gaza-mps-uk-government-b1140443.html",
        "title": "Government amendment on Gaza ceasefire vote puts Labour in a bind",
        "description": "Shadow foreign secretary David Lammy suggested Labour could not back either the Government or <b>SNP</b> motion on the Israel-Hamas war. Labour leader Sir Keir Starmer is facing a tough call on Gaza ceasefire debate in the Commons (Dan Kitwood/PA) The UK ..."
    },
    {
        "url": "https://leftfootforward.org/2024/02/how-every-mp-voted-on-the-offshore-petroleum-licensing-bill/",
        "title": "How every MP voted on the Offshore Petroleum Licensing Bill",
        "description": "Despite the warnings from climate campaigners, the Offshore Petroleum Licensing Bill passed its third reading with 285 votes for and 218 votes against. As a result, the legislation will now continue its journey through parliament, firstly by being debated in the House of Lords."
    },
    {
        "url": "https://inews.co.uk/news/politics/labour-demands-immediate-humanitarian-ceasefire-in-gaza-2915794?ico=in-line_link",
        "title": "Labour demands ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "The move was an attempt to prevent another Commons rebellion but party sources said it was not enough to diffuse support for the SNP motion"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/20/snp-uses-mini-embassy-brussels-pitch-prospective-eu-member/",
        "title": "<b>SNP</b> uses mini-embassy in Brussels to pitch itself as ‘prospective EU member’",
        "description": "Scottish Government&#39;s most senior civil servant set out in a letter how it shares the bloc&#39;s vision for social justice and a greener society"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/labour-ceasefire-gaza-starmer-snp-b2499161.html",
        "title": "Labour calls for immediate humanitarian ceasefire in Gaza ahead of crunch Commons vote",
        "description": "Ahead of a crunch vote in the Commons on Wednesday, the Labour leader met with his shadow cabinet to discuss whether to order MPs to vote for an SNP -led motion which will call for an “immediate ceasefire” in the conflict in the Middle East."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-labour-westminster-scotland-tories-b1140414.html",
        "title": "<b>SNP</b> heaps pressure on Labour by calling for commitment to £28bn green spending",
        "description": "The SNP at Westminster accused the Tories and Labour of blocking ‘Scotland’s entry to the green renewables goldrush’."
    },
    {
        "url": "https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-labour-fights-its-ceasefire-war/",
        "title": "London Playbook PM: Labour fights its ceasefire war",
        "description": "UKRAINE ROW LATEST: Home Office Minister Tom Pursglove told the Commons it was “deliberate scaremongering” to suggest the government had reduced access for Ukrainians hoping to flee war to the U.K. Downing Street also insisted changes this week to application routes for Ukrainian refugees do not reduce eligibility."
    },
    {
        "url": "https://www.thetimes.co.uk/article/nation-or-class-the-snp-and-labour-are-challenging-voters-to-choose-kzjz7xc93",
        "title": "Nation or class? The <b>SNP</b> and Labour are challenging voters to choose",
        "description": "A sense of belonging is a powerful life force. It nourishes and sustains. It soothes and compels. In many ways it defines who we are. And in politics belonging is a battleground. Belonging comes in many forms. It can derive from a place, whether a ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/20/post-office-horizon-scandal-conservatives-kemi-badenoch-rishi-sunak-uk-politics-live",
        "title": "<b>SNP</b> welcomes Labour call for ‘immediate humanitarian ceasefire’ in Gaza, claiming it forced Starmer into U-turn – as it happened",
        "description": "Scott Benton loses appeal against recommendation he should be suspended for 35 days for offering to lobby for gambling industry"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/north-lanarkshire-council-cuts-back-32168131",
        "title": "North Lanarkshire Council cuts back on funding for voluntary organisations following review",
        "description": "North Lanarkshire Council has cut back on its funding for voluntary organisations following a review. A shakeup of the system by which grant applications are assessed was voted through at a full council meeting which also saw the annual budget set. One change will be to reduce the maximum grant which can be applied for from £50,000 to £10,000."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/labour-turns-up-heat-snp-32172122",
        "title": "Labour turns up heat on <b>SNP</b> over opposition to windfall tax on energy giant profits",
        "description": "EXCLUSIVE: Shadow Scotland Secretary Ian Murray urging the SNP to withdraw a motion on energy which does not include a windfall tax."
    },
    {
        "url": "https://www.thenational.scot/news/24132544.snp-welcome-keir-starmers-gaza-ceasefire-u-turn/",
        "title": "<b>SNP</b> welcome Keir Starmer&#39;s Gaza ceasefire U-turn",
        "description": "THE <b>SNP</b> have welcomed Keir Starmer’s “long overdue U-turn” after the Labour leader bowed to mounting pressure and backed calls for a ceasefire in Gaza. Stephen Flynn, the <b>SNP</b>’s Westminster leader, said Starmer had been “forced into this position ..."
    },
    {
        "url": "https://www.politico.eu/article/uk-labour-gaza-israel-hamas-war-cease-fire-scottish-national-party/",
        "title": "UK Labour is backing an ‘immediate’ Gaza cease-fire. But the devil’s in the details",
        "description": "The rhetorical shift may be small, but ahead of Wednesday’s vote the new wording is aimed at keeping restive Labour MPs on side with the party’s position rather than backing the <b>SNP</b>. The <b>SNP</b> has form. It previously managed to claim Labour scalps by ..."
    },
    {
        "url": "https://www.itv.com/news/2024-02-20/labours-gaza-ceasefire-motion-in-lockstep-with-snp-what-happens-next",
        "title": "Labour&#39;s Gaza ceasefire motion in lockstep with <b>SNP</b> - what happens next?",
        "description": "In condemning any Israeli ground invasion of Rafah, and in pressing for a general immediate ceasefire, the SNP and Labour are now more-or-less aligned. | ITV National News"
    },
    {
        "url": "https://morningstaronline.co.uk/article/politics-and-personalities-driving-intergovernmental-tensions-mps-are-told",
        "title": "Politics and personalities driving intergovernmental tensions, MPs are told",
        "description": "“POLITICS and personalities” have soured relations between the Scottish and Westminster governments, a parliamentary committee has heard. The Scottish affairs select committee took evidence from three former Labour secretaries of state for Scotland on Monday as it examined intergovernmental relations since devolution."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1868792/diane-abbott-keir-starmer-labour-gaza-ceasefire",
        "title": "Diane Abbott furiously blasts Keir Starmer over &#39;weasel words&#39; to get Labour &#39;off hook&#39;",
        "description": "Diane Abbott hit out at Sir Keir Starmer after he moved to stave off another Labour rebellion over Gaza. Labour tabled an amendment to an SNP ceasefire motion which marks a shift in its position by calling for an &quot;immediate humanitarian ceasefire&quot; in the Israel -Hamas conflict."
    },
    {
        "url": "https://www.thetelegraphandargus.co.uk/news/national/24132262.eight-mps-risked-recall-petitions-breaking-commons-rules-since-2019/",
        "title": "Eight MPs who risked recall petitions after breaking Commons rules since 2019",
        "description": "Margaret Ferrier, <b>SNP</b>, Rutherglen and Hamilton West Margaret Ferrier was successfully recalled after she was suspended for breaching Covid rules (Parliament TV) A lengthy process saw Margaret Ferrier become the first MP of the current Parliament to be ..."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-calls-humanitarian-ceasefire-gaza-ahead-israels-rafah-offensive",
        "title": "Labour Hopes To Avert Ceasefire Vote Showdown With New Gaza Amendment",
        "description": "Labour will order its MPs to abstain on the <b>SNP</b>&#39;s Gaza ceasefire motion on Wednesday, instead whipping its MPs to back an amendment calling for &quot;an immediate humanitarian ceasefire&quot; in Gaza in a bid to avoid a showdown with its own MPs. PoliticsHome ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/starmer-wobbles-gaza-under-protest-pressure",
        "title": "Starmer wobbles on Gaza under protest pressure",
        "description": "Stop the War Coalition convener Lindsey German said: “Labour’s amendment is a welcome development although weaker than the <b>SNP</b> position. “Let’s be clear: this is the result of mass protest and of widespread opposition inside Labour."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/20/post-office-horizon-scandal-conservatives-kemi-badenoch-rishi-sunak-uk-politics-live?filterKeyEvents=false&page=with:block-65d49b988f08595b86234efe",
        "title": "<b>SNP</b> welcomes Labour call for ‘immediate humanitarian ceasefire’ in Gaza, claiming it forced Starmer into U-turn – as it happened",
        "description": "Party to table amendment to SNP motion to be debated on Wednesday in Commons"
    },
    {
        "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/labour-calls-immediate-ceasefire-israel-28671203",
        "title": "Labour calls for &#39;immediate&#39; ceasefire in Israel-Hamas war in major shift",
        "description": "The Opposition party has tabled an amendment to the <b>SNP</b>&#39;s ceasefire in Gaza motion, to be voted on in the House of Commons on Wednesday. Sir Keir Starmer has previously called for a &quot;ceasefire that lasts&quot; in the Middle East, but stopped short of using the ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/east-lothian-council-rent-rise-28670825",
        "title": "East Lothian council rent to rise by 7% despite residents concerns",
        "description": "However at a special meeting of elected members today their <b>SNP</b> opponents rejected the claim calling on them to stop blaming others and look at their own actions. A consultation on the rent rise held at the end of last year found only 3 per cent of those ..."
    }
]