[
    {
        "url": "https://www.bbc.co.uk/programmes/p0h9n5gt",
        "title": "Edinburgh: The panel take questions on the rental market, car free city centres, the Assisted Dying Bill, and economic growth",
        "description": "The SNP&#39;s Jim Fairlie, Scottish Labour&#39;s Michael Shanks, Scottish Conservatives&#39; Sue Webber, journalist Gabriella Bennett and musician Colin MacIntyre join Stephen Jardine to discuss Edinburgh&#39;s rental market,"
    },
    {
        "url": "https://www.heraldscotland.com/news/24123396.humza-yousaf-mocked-snp-campaign-broadcast-fails-mention-indy/?ref=rss",
        "title": "Humza Yousaf mocked as <b>SNP</b> campaign broadcast fails to mention Indy",
        "description": "Humza Yousaf has been criticised by fellow Yes supporters after the SNP’s new general election broadcast failed to mention independence."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-scottish-jeane-freeman-humza-yousaf-kate-forbes-b1139379.html",
        "title": "Sturgeon transferred ‘zero’ WhatsApp Covid messages on to corporate record",
        "description": "The former first minister is now facing calls to make a personal statement to Holyrood to answer questions from MSPs."
    },
    {
        "url": "https://www.heraldscotland.com/news/24122741.labour-windfall-tax-hike-could-see-100-000-jobs-lost/",
        "title": "Labour windfall tax hike &#39;could see 100,000 jobs lost&#39;",
        "description": "Labour’s plans for a 78 windfall tax on the profits of energy firms would &quot;cast tens of thousands of hard-working men and women on"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-parking-charges-rise-council-28642627",
        "title": "Glasgow parking charges to rise but council tax frozen as budget set",
        "description": "A late deal between the SNP and the Greens was agreed as the city faces an almost £108m shortfall over three years - with concerns raised by Labour that it will see education funding cut."
    },
    {
        "url": "https://www.thenational.scot/politics/24122662.sell-labour-working-class-band-together/",
        "title": "All who sell their labour are working-class and should band together",
        "description": "ASSA Samake-Roman has very much missed the point about social class in her column in Wednesday’s National (UK’s definition of who"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/edinburgh-castle-firebomb-threats-police-snp-redcoat-cafe/",
        "title": "Edinburgh Castle cafe threatened with firebombs after nationalist backlash at Redcoat name",
        "description": "The Redcoat Cafe, which is named after British soldiers, was criticised on social media by figures including SNP politicians"
    },
    {
        "url": "https://www.northern-scot.co.uk/news/frustration-over-stalled-plan-for-new-keith-health-centre-342380/",
        "title": "Frustration over stalled plan for new Keith Health Centre",
        "description": "THE lack of progress towards a &quot;desperately needed&quot; and &quot;top priority&quot; new Keith Health Centre has been criticised."
    },
    {
        "url": "https://www.thenational.scot/news/24123250.glasgow-city-council-passes-budget-backing-council-tax-freeze/",
        "title": "Glasgow city council passes budget backing council tax freeze",
        "description": "GLASGOW’S local authority has passed its budget for the next three years, with councillors choosing to freeze council tax."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-holiday-hunger-programme-extra-28642227",
        "title": "Glasgow holiday hunger programme to get extra £1.5m after row over Labour &#39;cut&#39;",
        "description": "Glasgow City Council is to invest a further £1.5 million into its Holiday Food programme this financial year as part of its budget deal - after claims the Labour budget has scrapped it &#39;by mistake&#39;."
    },
    {
        "url": "https://news.stv.tv/west-central/glasgow-councillors-pass-budget-backing-council-tax-freeze",
        "title": "Glasgow councillors pass budget backing council tax freeze",
        "description": "During the Glasgow council meeting city treasurer Ricky Bell, from the governing SNP group, said the council tax freeze was “fully funded”. Council leader Susan Aitken also backed the council tax freeze. She said: “We don’t have the powers in Scotland just now to address rampant inflation and mortgage rates."
    },
    {
        "url": "https://inews.co.uk/news/waspi-cancer-forced-out-work-no-income-2906183?ito=facebook_share_article-top",
        "title": "‘I’m a Waspi woman, cancer forced me out of work at 60 with no income’",
        "description": "Anne Andrews – who belongs to the so-called Waspi (women against state pension inequality) generation – revealed how she struggled financially after being forced to give up work while having gruelling medical treatment."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24122920.parking-charges-school-meals-rise-glasgow/",
        "title": "Parking charges and school meals to rise in Glasgow",
        "description": "The price of a school meal, parking charges and Glasgow Life facilities are to rise to meet cuts needed to balance the council’s budget."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-responds-to-fall-in-nursing-applications-for-third-year-in-a-row",
        "title": "Cole-Hamilton responds to fall in nursing applications for third year in a row",
        "description": "Responding to the embargoed data from UCAS which shows that for the third year in a row the number of applicants for nursing courses in Scotland has dropped, down by 8.3% compared to the same point last year,"
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/snp-running-out-of-excuses-as-sturgeon-and-co-recorded-0-whatsapps",
        "title": "<b>SNP</b> ‘running out of excuses’ as Sturgeon and co. recorded 0 Whatsapps",
        "description": "Responding to a freedom of information request which shows that Nicola Sturgeon, Humza Yousaf, former Deputy First Minister John Swinney, former Health Secretary Jeane Freeman and former Finance Secretary Kate Forbes,"
    },
    {
        "url": "https://www.scotsman.com/news/politics/nicola-sturgeon-former-first-minister-told-to-make-statement-on-recording-of-covid-whatsapps-over-zero-message-retention-4520427",
        "title": "Nicola Sturgeon: Former first minister told to make statement on recording of Covid WhatsApps over &#39;zero&#39; message retention",
        "description": "Opposition parties say the SNP government has ‘huge questions’ to answer about WhatsApp messages during the coronavirus pandemic"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/15/rachel-reeves-defends-labour-vetting-anti-semitism-row/",
        "title": "Rachel Reeves defends Labour vetting in anti-Semitism row",
        "description": "Shadow chancellor says Labour cannot ‘see everything everywhere’ as party is under pressure to tighten checks on parliamentary candidates"
    },
    {
        "url": "https://morningstaronline.co.uk/article/sturgeon-still-faces-questions-over-missing-whatsapps-say-labour",
        "title": "Sturgeon still faces questions over missing WhatsApps, say Labour",
        "description": "SCOTTISH LABOUR has attacked the SNP’s “culture of secrecy and cover-up,” as a row over missing messages related to its handling of the Covid pandemic continues."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867174/nicola-sturgeon-whatsapp-messages-covid",
        "title": "Nicola Sturgeon under fire over new &#39;eye-opening&#39; revelation on Covid WhatsApps",
        "description": "The former Scottish first minister is facing calls to make a personal statement to Holyrood about her failure to transfer WhatsApps onto official records."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/nhs-lanarkshire-facing-massive-112m-32130663.amp",
        "title": "NHS Lanarkshire facing massive £112m funding black hole",
        "description": "NHS Lanarkshire is facing a massive £112m black hole and huge cuts to plug the deficit. The amount the health board has to save is the equivalent of 24 days’ running costs for the struggling board. A leaked paper states: “All directors have been asked to consider how a five to six per cent reduction to their budget could be achieved.”"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/local-news/plans-move-public-path-perthshire-32108257",
        "title": "Plans to move public path at Perthshire estate narrowly approved by single vote",
        "description": "The new path will wrap around the back of the approved driving range buildings, raising concerns about the safety of horse riders who regularly use the current bridleway"
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-nhs-in-desperate-situation-as-staffing-crisis-worsens",
        "title": "Scottish NHS in ‘desperate situation’ as staffing crisis worsens",
        "description": "Scottish Labour’s Jackie Baillie said: “These figures are a damning reminder of how damaged the perception of nursing in Scotland has become under the <b>SNP</b>’s watch. “Years of seeing our NHS with an understaffed, overstretched nursing workforce has ..."
    },
    {
        "url": "https://www.bbc.com/news/articles/c89n5vg1zx7o",
        "title": "Councils vote to freeze tax rates",
        "description": "Glasgow City Council and North Lanarkshire Council have voted to freeze council tax for the coming year. The budgets were approved after councillors at the respective local authorities met to discuss budgets for the next three years. Other councils will discuss their budgets in the coming weeks, with some actively considering council tax rises."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/labour-would-have-acted-sooner-had-it-known-about-alis-comments-says-reeves-368749/",
        "title": "Labour ‘would have acted sooner’ had it known about Ali’s comments, says Reeves",
        "description": "The shadow chancellor said party leader Sir Keir Starmer had intervened ‘swiftly’ to ‘ensure the highest standards’."
    },
    {
        "url": "https://wingsoverscotland.com/nothing-changes-here/comment-page-1/",
        "title": "Nothing Changes Here",
        "description": "One year ago today, Nicola Sturgeon suddenly resigned as First Minister. And what a spectacular 12 months it’s been for the Yes movement since her departure. That, of course, is a somewhat"
    },
    {
        "url": "https://www.lbc.co.uk/opinion/views/a-year-on-what-is-nicola-sturgeons-legacy/",
        "title": "A year on - what is Nicola Sturgeon&#39;s legacy?",
        "description": "There is no denying Nicola Sturgeon made the SNP the force in Scottish politics, the establishment party. She was a force to be reckoned with but her leaving has seen her party falter and her apparent refusal to listen to a wider group of advisers while in charge saw policy misjudgements which proved hugely divisive across Scottish society."
    }
]