[
    {
        "url": "https://www.thetimes.co.uk/article/companies-to-lose-millions-on-scotlands-failed-recycling-scheme-tcwhx62r8",
        "title": "Companies to lose millions on Scotland’s failed recycling scheme",
        "description": "The deposit return scheme collapsed in June last year leaving contractors signed up to facilitate the plans out of pocket"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13025031/EDDIE-BARNES-truth-England-Scotland-arent-different-fact-SNP-afraid-accept.html",
        "title": "EDDIE BARNES: The truth is that England and Scotland aren&#39;t very different - a fact the <b>SNP</b> is too afraid to accept",
        "description": "More than 80 years after his death, it perfectly explains not just the <b>SNP</b>’s appallingly politicised behaviour during the Covid crisis, but their entire way of working. Freud’s theory was based on observing neighbouring communities. These communities ..."
    },
    {
        "url": "https://www.thenational.scot/news/24086133.snp-reject-claims-nicola-sturgeon-burner-phones-covid-lockdown/",
        "title": "<b>SNP</b> reject claims over Nicola Sturgeon &#39;burner phones&#39; in Covid lockdown",
        "description": "THE <b>SNP</b> have branded claims that Nicola Sturgeon and Jeane Freeman bought &quot;burner phones&quot; at the start of the Covid lockdown as “desperate” and “grossly misleading”. The Scottish Daily Express has reported that the then first minister and health ..."
    },
    {
        "url": "https://uk.news.yahoo.com/what-is-genocide-221914793.html",
        "title": "What is the legal definition of genocide?",
        "description": "According to the Genocide Convention, the definition of genocide is any of the following acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group. This includes: Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part"
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/wishaw-mp-heaps-further-pressure-32002729",
        "title": "Wishaw MP heaps further pressure on UK Government over Post Office scandal",
        "description": "Marion Fellows accused ministers of scapegoating chairman Henry Staunton - amid the fallout from the ITV drama, Mr Bates v the Post Office - to deflect from its own role."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/30/covid-inquiry-nicola-sturgeon-john-swinney-close-schools/",
        "title": "Sturgeon told evidence did not support Covid school closures day before she shut them, inquiry hears",
        "description": "Ministers were warned in March 2020 that stopping classes could actually increase risks of pandemic, cabinet records show"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24083878.misogyny-nicola-sturgeon-endure-shameful/?ref=rss",
        "title": "The misogyny Nicola Sturgeon has had to endure is shameful",
        "description": "That we never properly understand something until it’s considered in hindsight, has rarely been more evident than with the misogyny, in all"
    },
    {
        "url": "https://www.telegraph.co.uk/business/2024/01/30/mps-queue-demand-separation-sheikh-state-telegraph-sale/",
        "title": "MPs queue up to demand separation of ‘Sheikh and state’ in Telegraph sale",
        "description": "An urgent question on the sale of The Telegraph had been granted to the Conservative backbencher Alicia Kearns, the chairman of the Foreign Affairs Select Committee and an avowed opponent of RedBird IMI’s plans. She demanded a national security review as “we cannot separate Sheikh and state”."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/whatsapp-covid-inquiry-scottish-government-westminster-b2487531.html",
        "title": "Do WhatsApp revelations mean Scotland’s government is as bad as Westminster?",
        "description": "As it emerges that WhatsApp messages were deleted by senior SNP ministers, Sean O’Grady looks at the fractious relationship between Edinburgh and London"
    },
    {
        "url": "https://www.thenational.scot/news/24085772.scottish-labour-doing-absolutely-nothing-brexit-snp-say/",
        "title": "Scottish Labour ‘doing absolutely nothing on Brexit’, <b>SNP</b> say",
        "description": "Scottish Labour have been accused of doing “absolutely nothing” on the challenges facing Scotland after Brexit."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861399/Keir-Starmer-conversion-therapy-ban",
        "title": "Keir Starmer vows to ban &#39;psychologically damaging&#39; conversion therapy",
        "description": "Sir Keir branded it &quot;psychologically damaging abuse&quot; but promised his law tackling it would be &quot;trans-inclusive&quot;."
    },
    {
        "url": "https://www.thetimes.co.uk/article/neither-snp-nor-tories-give-a-damn-about-devolution-xvrkcg65v",
        "title": "Neither <b>SNP</b> nor Tories give a damn about devolution",
        "description": "While the Nationalists were spoiling for a ‘rammy’ with Westminster, many Conservatives have never really accepted the shift of power away from London"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68145945",
        "title": "Covid texts to Sturgeon &#39;not available&#39; - Swinney",
        "description": "The first minister has invited Sir Keir Starmer to discuss working together if Labour wins power. The <b>SNP</b>&#39;s Westminster leader warns that US-UK air strikes in Yemen must not lead to a wider regional crisis. The health secretary was asked if anyone else had ..."
    },
    {
        "url": "https://news.sky.com/story/covid-inquiry-kate-forbes-did-not-delete-whatsapps-during-pandemic-and-surprised-no-minutes-exist-from-key-meetings-13059845",
        "title": "COVID inquiry: Kate Forbes &#39;did not delete&#39; WhatsApps during pandemic and &#39;surprised&#39; no minutes exist from key meetings",
        "description": "The UK COVID-19 Inquiry is currently sitting in Edinburgh as it probes the devolved administration&#39;s response to the pandemic."
    },
    {
        "url": "https://www.opendemocracy.net/en/covid-19-inquiry-missing-minutes-kate-forbes-john-swinney/",
        "title": "Minutes missing from Scottish government’s key Covid meetings",
        "description": "Ex-finance chief Kate Forbes said she was ‘surprised’ that record keeping was missing from ‘Gold Command’ meetings"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/nicola-sturgeon-ranted-humza-yousaf-32003130",
        "title": "Nicola Sturgeon &#39;ranted&#39; at Humza Yousaf in stormy Cabinet meeting over covid support",
        "description": "Nicola Sturgeon began &quot;ranting&quot; at Humza Yousaf at a stormy Scottish Government meeting during the coronavirus pandemic, the UK Covid Inquiry has heard. In a text message exchange with Jason Leitch from December 2021, the now First Minister said he took &quot;a hell of a bullet&quot; from his old boss."
    },
    {
        "url": "https://www.scotsman.com/news/politics/uk-covid-inquiry-kate-forbes-chooses-her-targets-carefully-as-she-paints-picture-of-two-tier-scottish-government-4498412",
        "title": "UK Covid Inquiry: Kate Forbes chooses her targets carefully as she paints picture of two-tier Scottish Government",
        "description": "Former finance secretary’s evidence raises further questions over power imbalances in cabinet and lack of record keeping"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11881526/kate-forbes-kept-out-nicola-sturgeon-covid-meetings/",
        "title": "Scot Gov ‘Chancellor’ Kate Forbes kept in the dark over Nicola Sturgeon’s ‘shady’ Gold Command Covid summits",
        "description": "In her evidence today, ex-<b>SNP</b> leadership contender Ms Forbes also told how “surprises were never welcome” at Ms Sturgeon’s cabinet meetings, in a further revelation about how the ex-First Minister ran her government over the years. It came as she ..."
    },
    {
        "url": "https://www.scotsman.com/health/matheson-facing-calls-to-quit-over-deadly-disarray-in-ae-departments-4498315",
        "title": "Matheson facing calls to quit over ‘deadly disarray’ in A&amp;E departments",
        "description": "Michael Matheson is facing fresh calls to quit as Health Secretary as figures show more than a third of patients in accident and emergency had to wait longer than the target time for care. The latest waiting time figures for the week ending January 21 show 62 per cent of patients were either admitted, transferred or discharged within four hours."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24084537.parties-pick-candidates-election-glasgow-march/",
        "title": "Parties pick candidates for by election in Glasgow in March",
        "description": "Candidates have been chosen to fight the Hillhead by-election in Glasgow. The four parties represented on the council have selected who will contest the vote on March 7. The by-election was called after the death of long-serving Labour councillor, Hanzala Malik, in December, last year."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-snp-making-woeful-progress-on-scotlands-drugs-emergency",
        "title": "Cole-Hamilton: <b>SNP</b> making woeful progress on Scotland’s drugs emergency",
        "description": "Scottish Liberal Democrat leader Alex Cole-Hamilton MSP has today warned that the country’s drugs crisis continues to “end lives and blight communities”, as new statistics revealed that drug-related hospital admissions,"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1861272/humza-yousaf-snp-scottish-civil-servants-work-abroad",
        "title": "Humza Yousaf under fire as <b>SNP</b> allows civil servants to work abroad for 28 days each year",
        "description": "The SNP First Minister Humza Yousaf is under fire from political rivals and business leaders over the Scottish Government&#39;s hybrid working policy."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-snps-ministerial-disinterest-is-taking-its-toll-on-ae",
        "title": "Cole-Hamilton: <b>SNP</b>&#39;s ministerial disinterest is taking its toll on A&amp;E",
        "description": "Responding to new figures showing only 62% of people attending A&amp;E were seen within the 4 hour target in the week ending 21st January, while 3,831 people waited over 8 hours, Scottish Liberal Democrat"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13022875/Kate-Forbes-says-shes-surprised-no-minutes-kept-Nicola-Sturgeons-key-meetings-Covid-former-minister-reveals-SNP-figures-NOT-delete-pandemic-WhatsApps.html",
        "title": "<b>SNP</b> civil war as ex-minister Kate Forbes swipes at Nicola Sturgeon over deleted Covid WhatsApps and lack of minutes for key meetings",
        "description": "The former Scottish finance secretary was quizzed about the lack of notes from meetings of the Scottish Government Resilience Room (SGoRR) and the &#39;Gold Command&#39; group."
    },
    {
        "url": "https://uk.news.yahoo.com/northern-ireland-first-republican-leader-170414190.html",
        "title": "What has Northern Ireland’s first republican leader said about Scottish independence?",
        "description": "After dialogue between O’Neill and <b>SNP</b> leader Yousaf , both leaders praised the meeting on social media. “We discussed hopes of a deal to restore power-sharing and the opportunity for more co-operation between Scotland and Northern Ireland,” the <b>SNP</b> ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nicola-sturgeon-snp-covid-inquiry-forbes-b2487511.html",
        "title": "No record of Sturgeon’s secretive ‘gold command’ meetings, Covid inquiry told",
        "description": "Former finance minister Kate Forbes, who stood for the <b>SNP</b> leadership when Ms Sturgeon stepped down, said she was “surprised” to learn that meetings of the groups had no minutes. Mr Dawson said: “It becomes difficult to understand what the ultimate ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-and-uk-government-covid-19-differences-werent-political-insists-swinney",
        "title": "Scottish and UK government&#39;s Covid-19 differences weren&#39;t political, insists Swinney",
        "description": "He refuted allegations made by Michael Gove — who served as UK Cabinet secretary at the time — that there had been a “desire for differentiation” from the <b>SNP</b> Scottish government during the pandemic. Mr Swinney insisted differences, such as ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/13180904.jovial-tough-tetchy-now-happy-reflect/",
        "title": "Jovial, tough, tetchy, now happy to reflect",
        "description": "His reasons for leaving were clear: he felt the fresh challenges facing the <b>SNP</b> after defeat in the referendum required a fresh leader, someone to &quot;hold Westminster&#39;s feet to the fire&quot; over new powers for Holyrood. He was proud of securing 1.6 million ..."
    },
    {
        "url": "https://news.yahoo.com/nicola-sturgeons-reputation-line-uk-225941229.html",
        "title": "Nicola Sturgeon&#39;s reputation on the line at UK Covid inquiry",
        "description": "Nicola Sturgeon Get info without leaving the page. will give evidence to the UK Covid inquiry in Edinburgh later. At the height of the pandemic, Scotland&#39;s then first minister was a near-constant presence on the nation&#39;s TVs and her popularity soared."
    },
    {
        "url": "https://www.cornwalllive.com/news/cornwall-news/bbc-should-more-promote-cornwalls-9067910",
        "title": "BBC should do more to promote Cornwall&#39;s unique identity",
        "description": "Steve Double, the Conservative MP for St Austell and Newquay, said he wanted to see more programming on the BBC which reflected Cornwall&#39;s history, heritage and language, rather than &quot;adverts for more second homeowners&quot;."
    },
    {
        "url": "https://www.alzforum.org/news/research-news/ftd-tmem106b-fibrils-tip-tdp-43-dysfunction-overdrive",
        "title": "In FTD, TMEM106b Fibrils Tip TDP-43 Dysfunction into Overdrive",
        "description": "Variants in the TMEM106b gene influence the risk and severity of frontotemporal dementia, but how? A study published January 17 in Science Translational Medicine suggests that the answer comes down to the lysosomal protein’s propensity to twist into ..."
    },
    {
        "url": "https://news.stv.tv/politics/jason-leitch-labelled-nicola-sturgeon-ridiculous-over-anger-at-humza-yousaf-during-covid-cabinet-meeting",
        "title": "Leitch labelled Sturgeon &#39;ridiculous&#39; over anger at Yousaf during Covid",
        "description": "Scotland&#39;s national clinical director told Humza Yousaf he &#39;almost intervened&#39; during Nicola Sturgeon&#39;s &#39;rant&#39;."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/kate-forbes-criticises-nicola-sturgeon-32001058",
        "title": "Kate Forbes criticises Nicola Sturgeon government conduct during covid pandemic",
        "description": "The former finance secretary said &quot;corporate memory was critical&quot; as the Scottish Government faces mounting pressure over why some details on covid decision-making were not kept."
    },
    {
        "url": "https://www.heraldscotland.com/news/24084008.barely-third-e-patients-seen-time-glasgow-super-hospital/?ref=rss",
        "title": "Barely a third of A&amp;E patients seen on time at Glasgow super-hospital",
        "description": "Waiting time performance across Scotland’s A&amp;E units deteriorated again last week, with almost two in five patients waiting too long"
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/greenock/24081587.letters-local-politicians-slammed-inchgreen-dry-dock/",
        "title": "Letters: Local politicians slammed over Inchgreen dry dock",
        "description": "However, co-chair of the taskforce Stephen McCabe Labour and Stuart McMillan <b>SNP</b> with Louise Long chief executive failed to put Inchgreen dry dock on the agenda. Why? Ronnie Cowan (<b>SNP</b>) and Labour’s general election candidate Martin McCluskey both ..."
    },
    {
        "url": "https://www.scotsman.com/news/people/plans-for-new-ellon-and-banchory-health-centres-pushed-further-back-in-the-queue-4497767",
        "title": "Plans for new Ellon and Banchory health centres ‘pushed further back in the queue’",
        "description": "Douglas Lumsden MSP and Alexander Burnett MSP have voiced concerns that plans for a new Ellon Health Centre and health hub in Banchory have been “pushed further back in the queue” following a freeze on NHS projects."
    },
    {
        "url": "https://www.cityam.com/fresh-london-overground-strikes-to-pile-on-more-misery-for-commuters/",
        "title": "Fresh London Overground strikes to pile on more misery for commuters",
        "description": "Fresh London Overground strikes in the ongoing dispute over pay will pile on yet more misery for commuters in the capital next month."
    },
    {
        "url": "https://www.cityam.com/uk-economy-consumer-borrowing-dropped-last-month-in-latest-recession-warning/",
        "title": "UK economy: Consumer borrowing dropped last month in latest recession warning",
        "description": "Consumer borrowing dropped sharply in December in the latest sign that the UK probably slipped into recession at the end of last year."
    },
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, Labour’s silence over the cost of living crisis is deafening’",
        "description": "Even during the progress of the Finance bill, the process following the Chancellor’s Autumn statement, the Labour party have refused to bring their own or support <b>SNP</b> initiatives to help people, now, during their time of need. We’ve asked for last ..."
    },
    {
        "url": "https://www.aol.com/ross-attacks-snp-over-orchestrated-000100655.html",
        "title": "Ross attacks <b>SNP</b> over ‘orchestrated and concerted’ deletion of Covid WhatsApps",
        "description": "Mr Ross challenged the SNP over the issue following evidence to the UK Covid-19 Inquiry from some of the key figures during the pandemic. He spoke out ahead of the Tories challenging the Scottish Government on its “sickening cynicism and self-interest” in a debate on government transparency on Wednesday – the same day that former first minister Nicola Sturgeon is due to appear before the inquiry."
    },
    {
        "url": "https://news.stv.tv/highlands-islands/orkney-islands-council-faces-27m-funding-gap-over-next-four-years-say-auditors",
        "title": "Orkney Islands Council &#39;faces £27m funding gap over next four years&#39;",
        "description": "Serving around 22,000 people, Orkney Islands Council was noted to have relatively high costs and staffing difficulties."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24082447.john-daly-remember-created-mess-devolution-scotland/",
        "title": "John Daly: Remember who created the mess of devolution in Scotland",
        "description": "THESE days there is a bit of a spring in the step among some of our more excitable Labour colleagues at the City Chambers and it has nothing to"
    },
    {
        "url": "https://www.fleetmon.com/maritime-news/2024/44305/cargo-ship-stalls-bosphorus-strait-turkey-halts-tr/",
        "title": "Cargo Ship Stalls in Bosphorus Strait in Turkey, Halts Traffic",
        "description": "The cargo ship, &quot;SNP PAZAR,&quot; blocked the Bosphorus Strait in Turkey on Saturday night of 27th January due to engine trouble. While sailing through the Bosphorus strait, the ship was traveling to the Greek port of Kalymnos when it experienced"
    },
    {
        "url": "https://www.healthaffairs.org/content/forefront/integrated-programs-can-address-challenges-limited-english-proficiency-dual-eligible",
        "title": "How Integrated Programs Can Address The Challenges Of Limited English Proficiency For Dual Eligible Individuals",
        "description": "State policy makers can improve person-centered care for dual-eligible individuals with limited English proficiency and their caregivers using tools such as the Medicare Advantage dual-eligible special needs plan (D-<b>SNP</b>), state Medicaid agency contract ..."
    }
]