[
    {
        "url": "https://www.dailymail.co.uk/news/article-13035177/Grinning-Blackford-hand-hand-new-lover-marriage-broke-down.html",
        "title": "Grinning Blackford hand in hand with new lover after his marriage broke down",
        "description": "Former SNP Westminster leader Ian Blackford has split from his wife and started a new relationship. Mr Blackford was seen hand in hand with his new partner outside a television studio in London at the weekend."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11900126/snp-labour-westminster-poll-results/",
        "title": "New poll makes grim reading for <b>SNP</b> as huge Labour boost predicted",
        "description": "LABOUR’S election hopes have been boosted by another poll showing them neck and neck with Nats. The bitter rivals would be locked on 23 seats each in the Westminster vote expected later this year,"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-68174557",
        "title": "UK Covid inquiry in Scotland: Three weeks in 90 seconds",
        "description": "The UK Covid 19 inquiry has spent three weeks in Edinburgh looking at the decisions made in Scotland during the pandemic."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862280/Question-Time-Nicola-Sturgeon-Covid-Inquiry",
        "title": "Nicola Sturgeon torn apart by Question Time audience member in brutal inquiry takedown",
        "description": "The former First Minister&#39;s popularity has seemingly taken a big hit during the last week&#39;s Covid inquiry evidence sessions."
    },
    {
        "url": "https://www.bbc.co.uk/news/articles/cjqjw48n79qo?at_medium=RSS",
        "title": "Scotland set for 8.8% increase in water bills",
        "description": "Water bills in Scotland will increase by 8.8% from April. Scottish Water said the rise was needed to provide &quot;significant investment&quot; in replacing ageing infrastructure and improving services. The publicly-owned company dismissed reports that it was already planning similar-sized increases for a further two years beyond 2024."
    },
    {
        "url": "https://inews.co.uk/opinion/business-cant-get-enough-labour-corbyn-2885171?ico=most_popular",
        "title": "Business can’t get enough of Labour – it’s like Corbyn never existed",
        "description": "Smart business leaders don’t want to micromanage every decision; they want political calm, good ministers in post, and to be left alone to run their businesses – this is what Labour offers"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/colin-campbell-covid-inquiry-has-to-do-more-than-trash-repu-340922/",
        "title": "COLIN CAMPBELL: Covid inquiry has to do more than trash reputations",
        "description": "&quot;The Covid inquiry has been highly effective in trashing the reputations or at least exposing the human flaws of the key decision-makers.&quot;"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/northern-ireland-stormont-sinn-fein-b2488977.html",
        "title": "What does the restoration of power-sharing mean for Northern Ireland?",
        "description": "With Sinn Fein only increasing in popularity and the shuttered Belfast government looking set to reconvene, the politics of Northern Ireland is transforming before our eyes. Though talk of a united Ireland may be a bridge too far,"
    },
    {
        "url": "https://www.thenational.scot/news/24091798.tories-siphon-off-covid-funds-michael-goves-union-report/",
        "title": "Did Tories &#39;siphon off Covid funds&#39; for Michael Gove&#39;s Union report?",
        "description": "THE UK Government is facing allegations it may have “siphoned off Covid funds for its own political party ends” in order to work on"
    },
    {
        "url": "https://www.grampianonline.co.uk/news/snp-criticise-tory-lib-dem-led-aberdeenshire-council-for-axe-340964/",
        "title": "<b>SNP</b> criticise Tory/Lib Dem led Aberdeenshire Council for axeing of out-of-school care",
        "description": "Aberdeenshire’s primary schools will be affected with the local authority blaming a decrease in demand as well as staffing and budget pressures."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-covid-inquiry-created-winners-170346445.html",
        "title": "Has the UK Covid Inquiry created winners and losers?",
        "description": "Given the raw emotions around the UK Covid-19 Inquiry, it’s unlikely any of our politicians would talk openly about it creating winners and losers."
    },
    {
        "url": "https://www.heraldscotland.com/news/24091815.uk-covid-inquiry-winners-losers-created/",
        "title": "UK Covid Inquiry: Have winners and losers been created?",
        "description": "Likewise Brazil’s President Bolsonaro. Closer to home, the opposition at Holyrood have been drooling at the prospect of <b>SNP</b> ministers being put on the stand and eviscerated by forensic KCs. Rows over who kept their WhatsApps and who hit delete have run ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/alex-salmond-nicola-sturgeon-whatsapp-86hg906d7",
        "title": "Alex Salmond denies ministers were told in 2007 to delete messages",
        "description": "Nicola Sturgeon and John Swinney told the UK Covid inquiry they wiped their phones of potentially relevant evidence because of instructions received when they became ministers"
    },
    {
        "url": "https://www.thetimes.co.uk/article/were-no-worse-than-our-opponents-is-hardly-a-robust-defence-dzwtqphg8",
        "title": "‘We’re no worse than our opponents’ is hardly a robust defence",
        "description": "Humza Yousaf treads a fine line between ‘we could have done better’ and ‘not to blame’"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/warning-over-glasgow-argyle-street-28553220",
        "title": "Warning over Glasgow Argyle Street revamp after Sauchiehall Street &#39;debacle&#39;",
        "description": "A £5.8m contract has been awarded for the revamp of a section of Argyle Street, but a local councillor has warned communication with residents over planned work must be better."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sturgeon-crying-covid-inquiry-alister-jack-b2489044.html",
        "title": "‘I don’t buy it’: Scottish secretary dismisses Sturgeon’s tears at Covid inquiry",
        "description": "Rishi Sunak’s Scottish secretary Alister Jack has rejected Nicola Sturgeon ’s claim she did not seek to politicise the Covid crisis – claiming he “didn’t believe her for a minute”."
    },
    {
        "url": "https://www.thesouthernreporter.co.uk/news/politics/six-candidates-to-contest-jedburgh-by-election-4501908",
        "title": "Six candidates to contest Jedburgh by-election",
        "description": "Six candidates will contest the Jedburgh and District ward by-election, which will take place on Thursday, February 22."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/01/jeremy-hunt-tax-cuts-conservatives-labour-uk-politics?page=with:block-65bb809a8f08ab88d92b6d7b",
        "title": "Starmer says Labour would level up workers’ rights in way not attempted for decades – as it happened",
        "description": "Labour leader tells conference that reforms ‘may not please everyone in room’"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/higher-charges-falkirks-high-school-32024407",
        "title": "Higher charges for Falkirk&#39;s high school swimming pools agreed to keep them open",
        "description": "Charges for swimming clubs are set to increase after councillors agreed plans to make more use of high school swimming pools in Falkirk and help them break even."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-outlines-key-proposals-ahead-of-party-leader-climate-summit",
        "title": "Cole-Hamilton outlines key proposals ahead of party leader climate summit",
        "description": "Speaking ahead of a summit of Scottish party leaders called to address climate action, Scottish Liberal Democrat leader Alex Cole-Hamilton has outlined a package of immediate measures that his party wants to see implemented to bring down emissions,"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11898113/humza-yousaf-ridiculed-douglas-ross-embarrassing-admission-covid-whatsapps/",
        "title": "Humza Yousaf ridiculed by Douglas Ross after ’embarrassing admission’ unearthed in Covid WhatsApps",
        "description": "HUMZA Yousaf was wound up by his Tory rival at Holyrood today following the disclosure of his WhatsApps admission that he was “winging it” when he became Health Secretary. Scottish Conservative"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24088429.uk-covid-inquiry-shows-snp-greens-tarnished-civil-service/",
        "title": "UK Covid Inquiry shows <b>SNP</b>/Greens have tarnished civil service",
        "description": "Fighting back tears at the UK Covid Inquiry today, an emotional Nicola Sturgeon said she had felt “overwhelmed by the scale” of what she had"
    },
    {
        "url": "https://www.bbc.co.uk/sport/football/68170031",
        "title": "Scottish government not committed to football regulator - but door remains open",
        "description": "Scottish sport minister Maree Todd will not commit to introducing an independent football regulator but stresses that the door remains open."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/auditor-general-warns-scottish-government-must-up-the-pace-on-fossil-fuel-phase-out",
        "title": "Auditor General warns Scottish Government must up the pace on fossil fuel phase out",
        "description": "Commenting on the embargoed report from the Auditor General which warns that the Scottish Government will not be able to phase out fossil-fuel home heating systems by 2045 unless it significantly increases the scale and pace of activity,"
    },
    {
        "url": "https://inews.co.uk/news/politics/be-bold-now-or-risk-a-tory-comeback-starmers-lesson-from-australia-2883214",
        "title": "Be bold now or risk a Tory comeback – Starmer’s lesson from Australia",
        "description": "Labour&#39;s decision not to risk upsetting bankers by capping their bonuses is the latest example of a safety first pre-election strategy. But Australian politics reveal how that can backfire"
    },
    {
        "url": "https://www.thenational.scot/news/24091228.uk-government-urged-stop-arms-sales-israel-snp-mp-petition/",
        "title": "UK Government urged to stop arms sales to Israel by <b>SNP</b> MP petition",
        "description": "THE UK Government has been urged to stop selling weapons to Israel by a petition launched by an SNP MP and backed by his constituents."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24088238.inverclyde-msp-welcomes-surge-new-green-energy/",
        "title": "Inverclyde MSP welcomes surge in new green energy",
        "description": "MSP Stuart McMillan says Inverclyde can play a key role in making Scotland a leader in renewable energy. The SNP man has welcomed the news that Scotland’s green energy sector has for the first time delivered more electricity than the country used."
    },
    {
        "url": "https://news.stv.tv/politics/spain-email-shows-scottish-government-was-thinking-about-independence-during-covid-says-douglas-ross",
        "title": "Ross: Spain email shows <b>SNP</b> was thinking about independence during Covid",
        "description": "The Scottish Tory leader pointed to an email which he said showed the Scottish Government was &#39;thinking about independence instead of focusing purely on public health&#39;."
    },
    {
        "url": "https://www.herefordtimes.com/news/national/24090637.yousaf-defends-sturgeons-handling-darkest-days-covid/",
        "title": "Yousaf defends Sturgeon’s handling of ‘darkest days’ of Covid",
        "description": "The Scottish First Minister said he is ‘very pleased’ she was in charge of the Scottish Government ‘as opposed to Boris Johnson’."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/nicola-sturgeon-gave-mobile-phone-32022161",
        "title": "Nicola Sturgeon gave mobile phone used during covid pandemic to &#39;family member&#39;",
        "description": "The former <b>SNP</b> leader has faced a barrage of criticism after she failed to retain texts or WhatsApps sent in 2020 and 2021 to government ministers or civil servants. Sturgeon, her then deputy John Swinney and several public health officials have all ..."
    },
    {
        "url": "https://www.snp.org/broken-brexit-britains-new-harmful-import-controls/",
        "title": "Broken Brexit Britain’s new harmful import controls",
        "description": "The <b>SNP</b> holds the key to a different future, offering hope, where Scotland can flourish on the global stage and providing the people of Scotland a pathway back into the EU and the European Single Market. Currently, Scotland’s decision-making ..."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/national/article/yousaf-defends-sturgeon-s-handling-of-darkest-days-of-covid-99064/",
        "title": "Yousaf defends Sturgeon’s handling of ‘darkest days’ of Covid",
        "description": "The Scottish First Minister said he is ‘very pleased’ she was in charge of the Scottish Government ‘as opposed to Boris Johnson’."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/second-home-owners-west-lothian-28550751",
        "title": "Second home owners in West Lothian could see council tax double",
        "description": "Second home owners in West Lothian could face paying double their current Council Tax on the properties in the new financial year. The increase - which could affect more than 80 homes - is planned as part of the measures to balance the council’s books in the 2024 budget."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/penny-mordaunt-prime-minister-lucy-powell-labour-traitors-b1136386.html",
        "title": "Penny Mordaunt urged to reveal if she is a traitor or faithful amid Tory plots",
        "description": "Labour shadow Commons leader Lucy Powell raised questions about Ms Mordaunt’s ‘bizarre’ defence of the Prime Minister."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/01/nicola-sturgeon-cry-scottish-secretary-covid-inquiry/?utmsource=email",
        "title": "Sturgeon could ‘cry from one eye if she wanted to’, claims Scottish Secretary",
        "description": "Alister Jack tells Covid Inquiry he ‘didn’t believe for a minute’ that former first minister set aside independence aims during pandemic"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1862102/nicola-sturgeon-alister-jack-covid-tears",
        "title": "&#39;Didn&#39;t believe her for a minute!&#39; Top Tory savages Nicola Sturgeon over Covid tears",
        "description": "The former Scottish first minister choked back tears during an appearance before the Covid inquiry yesterday as she denied suggestions the Scottish Government looked to weaponise the crisis for her independence cause. But giving evidence today, Mr Jack claimed Ms Sturgeon &quot;could cry from one eye if she wanted to&quot;."
    },
    {
        "url": "https://www.theguardian.com/society/2024/feb/01/they-were-dying-and-theyd-not-had-their-money-britains-multibillion-pound-equal-pay-scandal",
        "title": "‘They were dying, and they’d not had their money’: Britain’s multibillion-pound equal pay scandal",
        "description": "In 2005, Glasgow council offered to compensate women for historic pay inequality. But it sold them short again – and soon workers all over the UK started fighting for what they were owed"
    },
    {
        "url": "https://www.heraldscotland.com/news/24090033.bid-raise-scotlands-school-start-age-gains-cross-party-support/?ref=rss",
        "title": "Bid to raise Scotland&#39;s school start age gains cross-party support",
        "description": "All but one of Scotland&#39;s main political parties have backed the motion to raise the school starting age and create a national kindergarten system."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/jack-i-didn-t-delete-some-of-my-pandemic-whatsapps-i-deleted-them-all-109531/",
        "title": "Jack: I didn’t delete some of my pandemic WhatsApps – I deleted them all",
        "description": "The Scottish Secretary told the Covid inquiry he ‘regrets’ the move, but he insisted he did not take Government decisions on messages."
    },
    {
        "url": "https://news.stv.tv/west-central/hundreds-of-refugees-facing-homelessness-over-accommodation-shortage",
        "title": "Councils facing &#39;impossible&#39; task of finding accommodation for homeless refugees",
        "description": "Council officials have told MSPs it is &#39;almost impossible&#39; to find accommodation for homeless refugees. Hundreds of asylum seekers are facing homelessness due to a lack of suitable accommodation. Council officials have told MSPs it is “almost impossible” to find accommodation for homeless refugees following positive asylum decisions."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-taxi-boss-says-only-28550025",
        "title": "Glasgow taxi boss says only 12 vehicles LEZ ready as trade struggles",
        "description": "A Glasgow taxi boss has admitted tough market conditions and new low emission zone (LEZ) rules are making it a fight to keep his business going. Brian O&#39;Hara said his firm once had 100 taxis but that number is now down to 30. So far he has managed to get only 12 vehicles to comply with LEZ rules."
    }
]