[
    {
        "url": "https://www.thesun.co.uk/news/25856920/king-charles-cancer-royal-future-prince-harry/",
        "title": "King Charles’ cancer is a sign of fragile royal future… with no Prince Harry in it",
        "description": "IT boggles the mind to reflect that if William became King tomorrow, then Harry would be fourth in line to the throne. And the only royals ahead of Harry in the queue for the crown would be"
    },
    {
        "url": "https://www.thenational.scot/news/24111776.westminster-sits-silent-hind-rajab-found-killed-gaza/",
        "title": "‘Westminster sits silent’: Hind Rajab found killed in Gaza",
        "description": "OLD girl has been found killed nearly two weeks after she called rescuers pleading for help from a car surrounded by the bodies of"
    },
    {
        "url": "https://www.thetimes.co.uk/article/humza-yousafs-snp-cabinet-reshuffle-is-hand-to-mouth-politics-hwv5cvhld",
        "title": "Humza Yousaf’s <b>SNP</b> cabinet reshuffle ‘is hand-to-mouth politics’",
        "description": "Party insiders are critical of first minister’s promotions after Michael Matheson’s resignation over iPad affair: why didn’t he bring back Kate Forbes?"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/10/labour-mps-facing-wave-of-independent-challengers-over-stance-on-gaza",
        "title": "Labour MPs facing wave of independent challengers over stance on Gaza",
        "description": "Starmer initially refused to back a ceasefire last year, with Labour MPs told not to vote in favour of the <b>SNP</b> motion backing one. He also faced criticism for an interview in which he appeared to support Israel’s right to cut off power and water in Gaza."
    },
    {
        "url": "https://news.stv.tv/politics/more-than-12000-died-before-reaching-hospital-by-ambulance-last-year",
        "title": "More than 12,000 died before reaching hospital by ambulance last year",
        "description": "Party leader Anas Sarwar said the statistic, obtained using freedom of information legislation, shows the &#39;real-world consequences&#39; of &#39;SNP incompetence&#39;."
    },
    {
        "url": "https://www.thenational.scot/news/24111355.new-lords-include-tory-donors-msp-youngest-ever-life-peer/",
        "title": "New Lords include Tory donors, MSP and youngest ever life peer",
        "description": "READ MORE: Stephen Flynn: No <b>SNP</b> MPs will enter House of Lords under my watch The former Tory MSP’s appointment was criticised by <b>SNP</b> MP Tommy Sheppard, who has campaigned for the abolition of the House of Lords. Writing on Twitter/X, he said ..."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24109309.scottish-government-needs-kept-check-senate/?ref=rss",
        "title": "Scottish Government needs to be kept in check by a Senate",
        "description": "Under the <b>SNP</b> the mission to break up the UK is everything; roads, railways, hospitals and schools are secondary. Part of the problem with the <b>SNP</b> Government is the low calibre of people in it, look for people of real stature and talent and you have to ..."
    },
    {
        "url": "https://www.northern-times.co.uk/news/fergus-ewing-delighted-fiona-hyslop-is-appointed-transport-341901/",
        "title": "Fergus Ewing &#39;delighted&#39; Fiona Hyslop is appointed transport secretary overseeing the A9",
        "description": "The Inverness and Nairn MSP says of Humza Yousaf&#39;s pick that &#39;no one has put more effort into A9 dualling than Fiona&#39;"
    },
    {
        "url": "https://www.holyrood.com/inside-politics/view,civil-war-the-battle-brewing-in-scottish-politics-over-covid-inquiry-revelations",
        "title": "Civil War: The battle brewing in Scottish politics over Covid Inquiry revelations",
        "description": "For the Tories, there has been “unacceptable” shift away from the civil service’s traditional, and protected, impartiality. For Labour, as reported in the Sunday Herald, the civil service has been “captured wholesale and the lines between political interest and public service have not just become blurred, they have disappeared”."
    },
    {
        "url": "https://www.irishtimes.com/world/uk/2024/02/10/humza-yousaf-faces-questions-over-his-political-judgment-in-ministerial-ipad-affair/",
        "title": "Humza Yousaf faces questions over his political judgment in ministerial iPad affair",
        "description": "Scotland’s health minister Michael Matheson suddenly quit this week, three months after it emerged an £11,000 holiday roaming charge had been racked up on his taxpayer-funded iPad"
    },
    {
        "url": "https://www.dailyrecord.co.uk/ayrshire/disabled-access-issues-ayrshire-train-32086203.amp",
        "title": "Disabled access issues at Ayrshire train stations branded a &#39;scandal&#39;",
        "description": "South Scotland Labour List MSP, Colin Smyth, branded the figures a &#39;scandal&#39; and has demanded action from both <b>SNP</b> and Tory governments. He said: “It is shameful that disabled people are still being are locked out of some train stations in parts of Ayrshire."
    },
    {
        "url": "https://inews.co.uk/news/sunak-promises-tax-cuts-long-term-spring-budget-speculation-2900362",
        "title": "Sunak promises to deliver tax cuts in ‘long term’ amid Spring Budget speculation",
        "description": "Rishi Sunak has promised to deliver tax cuts in the “long-term” amid growing speculation about the content of next month’s Spring Budget. In an interview with The Times, the Prime Minister said that the “trajectory” of his government was to cut taxes but would not specify how or when."
    },
    {
        "url": "https://morningstaronline.co.uk/article/there-comes-time-when-asking-nicely-isnt-enough",
        "title": "There comes a time when asking nicely isn’t enough",
        "description": "THERE’S a common cry in Scotland whenever the <b>SNP</b>-Green Scottish government are asked to spend some money — “The budget is fixed! Something, something, Westminster. Something, something Brexit.” It is remarkable how many out there seem to believe ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067087/Tax-haven-Tweed-Special-report-Jonathan-Brocklebank.html",
        "title": "Tax haven upon Tweed: Special report by Jonathan Brocklebank",
        "description": "Estate agents say the street is one of the prime targets of largely Edinburgh-based high earners looking to avoid the <b>SNP</b>’s increasingly punitive tax regime. It is the pick of a bunch of affluent locations in north Northumberland now catching the eye of ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13067079/SNP-ignored-financial-warnings-sparked-great-tartan-tax-exodus.html",
        "title": "<b>SNP</b> ignored financial warnings - and sparked the great tartan tax exodus!",
        "description": "Scots are fleeing across the Border in droves to escape the SNP &#39;s tax hikes. The mass exodus of high earners is sparking a property boom in northern England as workers try to protect their pay."
    },
    {
        "url": "https://www.heraldscotland.com/news/national/24110906.tory-msp-stands-holyrood-take-position-scotland-office/",
        "title": "Tory MSP stands down from Holyrood to take up position at Scotland Office",
        "description": "“I’d like to put on record my thanks to Douglas and wish him – and all my Scottish Conservative colleagues – the very best as they continue to hold this failing, scandal-ridden <b>SNP</b> Government to account. “I’m delighted to be taking up a new ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/thousands-mcclure-clients-still-unaware-32058255",
        "title": "Thousands of McClure clients &#39;still unaware&#39; historic solicitors firm went bust",
        "description": "<b>SNP</b> MSP Stuart McMillan has now lodged a motion in the Scottish Parliament on the issue and won cross-party support. It calls on Holyrood to recognise that &quot;a substantial portion of the firm&#39;s former clients remain unaware of its closure and the transfer ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/10/uk-general-election-poll-tracker-conservative-labour/",
        "title": "General election poll tracker",
        "description": "The Telegraph’s poll tracker shows that Labour continues to have a dominating lead over the Tories, who were last ahead in late 2021. On Thursday, the Conservative Party will face by-elections in both Kingswood and Wellingborough, which had both been Tory seats."
    },
    {
        "url": "https://uk.news.yahoo.com/student-killed-turbulent-protests-over-115626693.html",
        "title": "Student killed in turbulent protests over Senegal&#39;s election delay",
        "description": "A student died during protests in the Senegalese city of Saint-Louis, the interior ministry said on Saturday, becoming the first person killed in unrest that broke out after a presidential election planned for this month was pushed back to the end of the year."
    },
    {
        "url": "https://www.thetimes.co.uk/article/michael-matheson-could-be-forced-out-as-msp-over-ipad-scandal-f6vsl8bn9",
        "title": "Michael Matheson ‘could be forced out as MSP’ over iPad scandal",
        "description": "Michael Matheson’s future as an MSP is at risk, critics have said, if a report into his £11,000 data roaming bill concludes that he lied to parliamentary officials. Douglas Ross, the Scottish Conservative leader, said the allegation that Matheson may ..."
    },
    {
        "url": "https://www.pensionplanpuppets.com/preview-maple-leafs-in-ottawa-senators-who-is-their-coach-again/",
        "title": "Preview: Leafs in Ottawa",
        "description": "The Leafs last game was at home on February 7 against the Dallas Stars, which Toronto won by a score of 5-4 in regulation. The Leafs have a record of 26-15-8 for a 0.612 Points %. The Ottawa Senators last played away on January 31 against the Detroit Red ..."
    }
]