[
    {
        "url": "https://www.kentonline.co.uk/news/national/sturgeon-resignation-accelerated-snp-s-poll-decline-say-experts-110553/",
        "title": "Sturgeon resignation accelerated <b>SNP</b>’s poll decline, say experts",
        "description": "The year since Nicola Sturgeon’s resignation announcement has accelerated a decline in the SNP’s opinion poll leads, experts have said. However, support for Scottish independence has hardly changed at all in the 12 months since Ms Sturgeon’s Bute House announcement, and has instead proved “stubbornly unwilling to fall”."
    },
    {
        "url": "https://www.heraldscotland.com/news/24120430.timeline-turbulent-year-snp-sturgeons-shock-exit/",
        "title": "Timeline: Turbulent year for <b>SNP</b> after Sturgeon&#39;s shock exit",
        "description": "Peter Murrell: The <b>SNP</b>&#39;s then chief executive, Peter Murrell, who is married to Ms Sturgeon, resigned from his position after he provided the party&#39;s head of communications, Murray Foote, with false <b>SNP</b> membership figures. READ MORE: Who is Peter Murrell ..."
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24120929.sturgeons-legacy-one-year-since-political-big-fish-resigned-first-minister/",
        "title": "Sturgeon’s legacy: One year since political big fish resigned as first minister",
        "description": "In her resignation speech, Ms Sturgeon said she believed the “time is now”, stating stepping aside was in the best interests of herself, the <b>SNP</b> and the country. No obvious successor initially emerged and a fiery leadership contest was the first time ..."
    },
    {
        "url": "https://www.irishnews.com/news/uk/minister-recalls-sadness-and-shock-over-nicola-sturgeons-decision-to-quit-H7T4SNB3Y5JQBPNHTS3L3LEAKI/",
        "title": "Minister recalls ‘sadness and shock’ over Nicola Sturgeon’s decision to quit",
        "description": "A year on, however, Scottish Conservatives claimed the former <b>SNP</b> leader is a “totally discredited politician” and that “her reputation and credibility lie in tatters”. Since leaving the Scottish Government Ms Sturgeon, who is still an <b>SNP</b> MSP ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/timeline-turbulent-year-for-snp-following-sturgeons-resignation/",
        "title": "Timeline: Turbulent year for <b>SNP</b> following Sturgeon’s resignation",
        "description": "The year following her resignation has proved a tough one for Nicola Sturgeon, the <b>SNP</b> and Scotland. Nicola Sturgeon resigns: A month prior to her shock resignation, Scotland’s longest serving first minister told broadcasters she had “plenty left in ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/25949389/scottish-parliament-computers-edit-msps-wikipedia-pages/",
        "title": "Scottish parliament computers used numerous times to edit &amp; improve MSPs’ Wikipedia pages",
        "description": "This was described as a “typo fix” by the person within the Holyrood building who made the change, the site shows. The page on <b>SNP</b> MSP Bill Kidd has been edited six times, including the addition of his nomination for a Nobel Peace Prize. Mr Cole ..."
    },
    {
        "url": "https://www.expressandstar.com/news/uk-news/2024/02/15/sturgeons-legacy-one-year-since-political-big-fish-resigned-as-first-minister/",
        "title": "Sturgeon’s legacy: One year since political big fish resigned as first minister",
        "description": "Nicola Sturgeon’s name is still at the forefront of Scottish politics one year on from her resignation. A year on from her shock resignation as Scotland’s first minister, Nicola Sturgeon’s legacy has been put under the microscope."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/nicola-sturgeon-first-minister-humza-yousaf-conservatives-scottish-health-secretary-b2496466.html",
        "title": "Minister recalls ‘sadness and shock’ over Nicola Sturgeon’s decision to quit",
        "description": "A year on, however, Scottish Conservatives claimed the former <b>SNP</b> leader is a “totally discredited politician” and that “her reputation and credibility lie in tatters”. Nicola Sturgeon is now a totally discredited politician. Her reputation and ..."
    }
]