[
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/07/nicola-sturgeons-claim-she-did-not-politicise-covid-not-bel/",
        "title": "Fewer than third of Scots believe Nicola Sturgeon’s claim she did not politicise Covid crisis",
        "description": "A new survey found that despite Sturgeon insisting she had not sought to play politics with the pandemic, this was widely rejected"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/prime-minister-king-the-king-buckingham-palace-downing-street-b1137786.html",
        "title": "Weekly audiences between King and PM expected to resume in two weeks",
        "description": "Downing Street and Buckingham Palace took the unusual step of confirming details of a call between the Prime Minister and the King on Wednesday."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1864321/king-charles-holds-weekly-audience-rishi-sunak-by-phone",
        "title": "King Charles holds weekly audience with Rishi Sunak by phone post cancer diagnosis",
        "description": "Downing Street and Buckingham Palace took the unusual step of sharing details about the meeting in an attempt to show the King was carrying on with his duties."
    },
    {
        "url": "https://www.thenational.scot/politics/24105198.jackie-baillie-quick-condemn-snp-not-apologise/",
        "title": "Jackie Baillie is quick to condemn the <b>SNP</b>, but not to apologise",
        "description": "WE were treated on Wednesday morning to a diatribe from Dame Jackie Baillie for nearly nine minutes, complaining about the wrong coding of women"
    },
    {
        "url": "https://bellacaledonia.org.uk/2024/02/07/the-settled-will/",
        "title": "The Settled Will",
        "description": "How do you understand the latest polling from IPSOS which puts the SNP ahead of Labour by seven points and predicts they would pick up 40 seats in the next General Election? At the last general"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-man-jailed-assaulting-friend-28589084",
        "title": "Glasgow man jailed for assaulting friend with bottle loses private hire bid",
        "description": "The applicant had a series of convictions, which were all spent, but Police Scotland, which objected to the application, believed they were relevant to the committee."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11935463/alarm-snp-crumbling-concrete-nhs-buildings/",
        "title": "Alarm raised as <b>SNP</b> ministers decide to leave ‘crumbling’ concrete in NHS buildings",
        "description": "SNP ministers have been accused of risking “catastrophe” after revealing they will leave so-called crumbling concrete in 35 NHS buildings. Health Secretary Michael Matheson disclosed the decision"
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/sauchiehall-street-skyscraper-roof-row-28589038",
        "title": "Sauchiehall Street &#39;skyscraper&#39; roof row ends with planning permission go-ahead",
        "description": "A councillor said there isn&#39;t an issue over seeing changes to the roof unless you are passing in a helicopter."
    },
    {
        "url": "https://news.stv.tv/politics/rishi-sunak-ignores-snps-stephen-flynns-calls-to-apologise-over-1000-rwanda-bet-with-piers-morgan",
        "title": "Sunak ignores Flynn&#39;s calls to apologise over &#39;crude&#39; £1,000 Rwanda bet",
        "description": "The SNP Westminster leader said Rishi Sunak had demeaned asylum seekers and degraded the office of Prime Minister."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/07/rishi-sunak-pmqs-victoria-atkins-labour-conservatives-nhs-dentists-politics-live?filterKeyEvents=false&page=with:block-65c3726b8f080dbfe0e9b3db",
        "title": "Badenoch accuses Starmer of exploiting Brianna Ghey tragedy after Sunak makes trans jibe during PMQs – as it happened",
        "description": "Kemi Badenoch accuses Labour leader of ‘political point-scoring’ after he condemned Rishi Sunak’s comments in PMQs"
    },
    {
        "url": "https://www.thetimes.co.uk/article/yousaf-the-nationalist-is-condemned-by-his-own-words-f3b65p2rs",
        "title": "Yousaf the nationalist is condemned by his own words",
        "description": "The great thing about Humza Yousaf is that he never knows when to stop talking. The first minister is an affable fellow who can scarcely pass a microphone without succumbing to the urge to share his thoughts. There are times when he makes Joe Biden seem a ..."
    },
    {
        "url": "https://www.thenational.scot/news/24104666.snp-press-uk-government-compensation-bill-waspi-women/",
        "title": "<b>SNP</b> press UK Government on compensation bill for Waspi women",
        "description": "THE SNP are pushing the UK Government to introduce a compensation scheme for women impacted by increases in the state pension age."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rishi-sunaks-transgender-jibe-as-brianna-gheys-mother-in-attendance-is-latest-misstep-from-a-prime-minister-who-cant-adapt-4509331",
        "title": "Rishi Sunak&#39;s transgender jibe as Brianna Ghey&#39;s mother in attendance is latest misstep from a Prime Minister who can&#39;t adapt",
        "description": "The joke was made as the mother of murdered teenager Brianna Ghey was at the Houses of Parliament. Esther Ghey was understood not to be in the public gallery for the immediate exchange, but entered later. Frankly, this does not matter."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-hopes-ministers-discussion-of-mental-health-will-help-end-stigma",
        "title": "Yousaf hopes ministers’ discussion of mental health will help end stigma",
        "description": "Humza Yousaf has said he hopes he and other ministers discussing their mental health will help to end stigma around the issue. The First Minister said the political environment can be “toxic” due to intrusion into private lives and public “character assassinations” – acknowledging he has sometimes played a role in this himself."
    },
    {
        "url": "https://uk.news.yahoo.com/analysis-snap-general-election-why-154320830.html",
        "title": "Analysis: Snap general election? Why we’ll know by mid March if May vote is off table",
        "description": "Around Westminster and Holyrood, at meetings of local party groups, and indeed in newsrooms up and down the country, everyone is wondering &#39;when is the general election?&#39;"
    },
    {
        "url": "https://www.heraldscotland.com/news/24104532.snap-general-election-know-mid-march/",
        "title": "Snap general election? Why we’ll know by mid March",
        "description": "First Minister Humza Yousaf certainly wasn&#39;t ruling it out when he gathered the <b>SNP</b> to the Oran Mor venue in Glasgow&#39;s west end near the start of the year to launch his party&#39;s campaign and unveil his candidates. Still smarting from the Rutherglen defeat ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/snps-lead-over-labour-is-narrowing-poll-shows-hvvqt2gvv",
        "title": "<b>SNP</b>’s lead over Labour is narrowing, poll shows",
        "description": "Labour has narrowed its gap with the SNP in voting for the next general election, according to the latest polling. The SNP remains ahead in Westminster voting intentions with a seven-point lead over Labour,"
    },
    {
        "url": "https://uk.news.yahoo.com/pmqs-sketch-rishi-sunak-misfires-142213112.html",
        "title": "PMQs sketch: Rishi Sunak misfires with transgender jibe as &#39;out of touch&#39; PM slammed in heated Commons clash",
        "description": "The PM ignored a subsequent invitation from Labour MP Liz Twist to apologise to Mrs Ghey for his “insensitive comment”, before using his very last answer of the session to belatedly praise Brianna’s mother as representing “the very best of humanity in the face of seeing the very worst of humanity”."
    },
    {
        "url": "https://www.holyrood.com/news/view,snp-lead-labour-by-seven-points-in-new-election-polling",
        "title": "<b>SNP</b> lead Labour by seven points in new election polling",
        "description": "The SNP lead Labour by seven points on general election voting intentions, according to a new poll by Ipsos Scotland and STV News. It shows that the gap in voting intentions is narrowing between the two parties, falling relatively sharply from the largest gap in recent times of 26 points in December 2022."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24103972.public-say-plans-close-eight-police-stations/",
        "title": "Public to have say on plans to close eight police stations",
        "description": "Plans to close eight police stations in Greater Glasgow, including city centre site currently open 24/7, are to be put to the public."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/labour-rachel-reeves-keir-starmer-laura-trott-gdp-b1137797.html",
        "title": "Starmer ‘to announce scaling back of £28 billion-a-year green pledge’",
        "description": "It’s a weak and short-sighted U-turn Stephen Flynn, <b>SNP</b> Chief Secretary to the Treasury Laura Trott said: “This is a serious moment which confirms Labour have no plan for the UK, creating uncertainty for business and our economy. On the day that Labour ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24103936.snps-mairi-mcallan-rules-formal-review-a9-failings/",
        "title": "<b>SNP</b>&#39;s Mairi McAllan rules out formal review into A9 failings",
        "description": "Scotland’s Transport Secretary has ruled out a formal internal review into the “complete failure” of dualling the A9 by the original"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13056479/Royal-family-cancer-charities-MacMillan-Maggies-Centre-Instagram-Kings-diagnosis.html",
        "title": "The Royal family teams up with cancer charities MacMillan and Maggie&#39;s Centre on Instagram to raise awareness and &#39;encourage others to reach out for support&#39; after King&#39;s diagnosis",
        "description": "The royal family has partnered with several leading cancer charities to promote support for those suffering from cancer and their loved ones."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/rishi-sunak-refuses-apologise-crude-28586416",
        "title": "Rishi Sunak refuses to apologise for &#39;crude&#39; £1,000 bet on Rwanda asylum scheme",
        "description": "The Prime Minister shook hands with TalkTV presenter Piers Morgan when he was offered a charity bet that ministers would not be able to send asylum seekers to Rwanda by the time of the election."
    },
    {
        "url": "https://www.bbc.co.uk/news/av/uk-politics-68228438",
        "title": "<b>SNP</b>: Public used to Tory leaders betting on lives of others",
        "description": "Stephen Flynn references the records of Boris Johnson and Liz Truss and his view of their effects on the public."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/politics/11934350/scottish-labour-nick-snp-slogan/",
        "title": "Scottish Labour accused of nicking famous <b>SNP</b> independence slogan",
        "description": "SCOTTISH Labour were today accused of nicking one of the SNP’s main slogans from the 2014 independence referendum. Anas Sarwar’s party used the “Scotland’s Future” tag on a mailshot telling voters"
    },
    {
        "url": "https://www.grampianonline.co.uk/news/snp-launch-bill-for-women-impacted-by-state-pension-age-incr-341562/",
        "title": "<b>SNP</b> launch bill for women impacted by state pension age increase (WASPI)",
        "description": "The <b>SNP</b>’s Alan Brown MP will present a Bill today that, if passed, would force the UK government to publish proposals for a compensation scheme for women born in the 1950s impacted by increases in the state pension age. Over 250,000 women affected by ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/poll-snp-lead-in-scotland-falls-as-labour-narrows-the-gap-4508856",
        "title": "Poll: <b>SNP</b> lead in Scotland falls as Labour narrows the gap",
        "description": "The poll shows the SNP remains the most trusted party across a range of issues. However, Labour has narrowed the gap on all four of the issues surveyed – managing the NHS, growing Scotland’s economy, managing education and schools, and tackling the cost-of-living crisis."
    },
    {
        "url": "https://news.stv.tv/scotland/ipsos-poll-snp-lead-shrinks-as-labour-narrows-gap",
        "title": "<b>SNP</b> lead shrinks as Labour narrows gap - Ipsos/STV poll",
        "description": "New poll by Ipsos&#39; Scottish Political Monitor - run in partnership with STV News - finds SNP hold a seven point lead over Labour."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-retains-general-election-poll-32067785",
        "title": "<b>SNP</b> retains general election poll lead over Labour but direction of travel will &#39;worry&#39; Humza Yousaf",
        "description": "The latest survey of voting intentions shows Labour continuing to make ground but the Nationalists still out in front."
    },
    {
        "url": "https://www.scottishlegal.com/articles/juryless-trials-pilot-unlikely-to-get-off-the-ground",
        "title": "Juryless trials pilot unlikely to get off the ground",
        "description": "Almost all of Scotland&#39;s defence solicitors are prepared to boycott the Scottish government&#39;s proposed juryless trials pilot, meaning it will most likely not run. Appearing before MSPs on Holyrood&#39;s Justice Committee,"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/glasgow-local-authority-chief-backs-32066629",
        "title": "Glasgow local authority chief backs council tax freeze despite city facing £120m shortfall",
        "description": "Susan Aitken, who leads the SNP group on Scotland&#39;s largest local authority, described the council tax freeze as a &quot;no-brainer&quot;."
    },
    {
        "url": "https://www.thenational.scot/news/24102892.hatred-snp-leaves-tory-msp-looking-petty-minimum-pricing/",
        "title": "&#39;Hatred of <b>SNP</b>&#39; leaves Tory MSP looking &#39;petty&#39; on minimum pricing",
        "description": "A TORY MSP’s “hatred of the SNP” left him looking “foolish” over his claims about minimum unit pricing, the depute leader of the SNP"
    },
    {
        "url": "https://www.bbc.com/news/articles/cmlgvpjm3ego",
        "title": "Scotland&#39;s papers: Harry reunited with King and <b>SNP</b> finances probe",
        "description": "King Charles&#39; meeting with Harry and a call for a police update on the SNP inquiry make the front pages."
    },
    {
        "url": "https://uk.news.yahoo.com/snp-win-40-scottish-seats-121035323.html",
        "title": "<b>SNP</b> will win 40 Scottish seats at next General Election, poll predicts",
        "description": "THE SNP would lead Labour by seven points and win 40 Scottish seats if a General Election were held tomorrow, a new poll has found"
    },
    {
        "url": "https://www.heraldscotland.com/news/24101916.snp-criticised-delayed-plan-tackle-highland-depopulation/",
        "title": "<b>SNP</b> criticised over delayed plan to tackle Highland depopulation",
        "description": "The Scottish Government has been told to &quot;get its finger out&quot; over a four month delay to a report aimed at tackling depopulation"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24102283.council-tax-freeze-no-brainer-glasgow-snp/",
        "title": "Council Tax freeze is a no-brainer for Glasgow <b>SNP</b>",
        "description": "Council Tax remains badly in need of reform. Although the Scottish Government has taken action to make it less regressive for people in lower-value homes and to protect lower-income households, it’s still an unfair tax – not only between households but also between different parts of Scotland ."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24102236.listed-house-west-end-demolished-council-plans/",
        "title": "Listed house in West End to be demolished under council plans",
        "description": "A listed janitor’s house on a former school site the West End is to be demolished as repairs have been deemed “not economically viable”. Glasgow City Council intends to knock down the “ruinous” Church Street building, with officials reporting it could benefit the “future development” of the land."
    },
    {
        "url": "https://uk.news.yahoo.com/resigning-snp-drugs-minister-hits-105239554.html",
        "title": "Resigning <b>SNP</b> drugs minister hits out at hostility on Twitter",
        "description": "AN SNP MSP who resigned as a minister in the Scottish Government citing “post-traumatic stress” has hit out at hostility online"
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/edinburgh-council-urged-to-investigate-claims-tram-works-caused-structural-damage-to-anchorfield-tenement-4508110",
        "title": "Edinburgh council urged to investigate claims tram works caused structural damage to Anchorfield tenement",
        "description": "A Leith SNP councillor will table a motion at this week&#39;s full council meeting to investigate claims tram works caused tenement damage"
    },
    {
        "url": "https://www.thetimes.co.uk/article/how-snp-forestry-cuts-will-take-an-axe-to-scotlands-net-zero-ambitions-6wl9pb99h",
        "title": "How <b>SNP</b> forestry cuts will take an axe to Scotland’s net zero ambitions",
        "description": "The Scottish government is proposing to cut 41 per cent of funding for the sector, which makes meeting its tree-planting target impossible to achieve"
    },
    {
        "url": "https://www.bbc.co.uk/programmes/m001wk5g",
        "title": "Social Energy Tariff",
        "description": "The introduction to the House of Commons of a Bill under the ten minute rule by <b>SNP</b> MP Marian Fellows on a social energy tariff, from Tuesday 6 February."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13053755/As-standards-slip-SNP-pushes-lessons-Scots.html",
        "title": "As standards slip, <b>SNP</b> pushes more lessons… in Scots",
        "description": "Teachers are being encouraged to &#39;embed&#39; the Scots language in the classroom, despite literacy standards falling."
    }
]