[
    {
        "url": "https://www.ross-shirejournal.co.uk/news/colin-campbell-the-electorate-is-fed-up-to-the-back-teeth-340437/",
        "title": "COLIN CAMPBELL: Will this Highland MP pay the price from &#39;fed up to the back teeth&#39; electorate?",
        "description": "With Sir Keir Starmer seemingly ready to measure the curtains for No.10 and many Tories conceding they are due to be kicked out, the main point of interest north of the border will be how well – or how very badly – the <b>SNP</b> will fare. After a prolonged ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/28/scotland-nhs-diversity-costs-up-40-per-cent-cash-strapped/",
        "title": "Spending on equality and diversity has increased by 40 per cent in Scotland’s cash-strapped NHS",
        "description": "Over the past five years bill for ‘mumbo-jumbo’ has reached £2.3 million while country suffers from worst cancer-survival rates in Europe"
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/people/scottish-governments-affordable-housing-target-at-risk-briefing-note-shows-4495734",
        "title": "Scottish Government’s affordable housing target ‘at risk’, briefing note shows",
        "description": "The commitment to build 110,000 affordable homes by 2032 was made in the 2021 Programme for Government, the first legislative agenda of the <b>SNP</b>-Green government. Did you know with a Digital Subscription to Edinburgh News, you can get unlimited access to ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/ian-blackford-insists-nicola-sturgeon-and-humza-yousaf-trusted-by-public-as-labour-surges-to-biggest-lead-over-snp-for-a-decade-4495575",
        "title": "Ian Blackford insists Nicola Sturgeon and Humza Yousaf trusted by public as Labour surges to biggest lead over <b>SNP</b> for a decade",
        "description": "Ian Blackford has insisted Nicola Sturgeon and Humza Yousaf are trusted by the public as a poll found Labour had surged to its biggest lead over the SNP for a decade. Research by Nostat put Labour on 36 per cent, up three points since its last poll in October, with the SNP on 33 per cent, down four points."
    },
    {
        "url": "https://www.thenational.scot/news/24079769.ex-gchq-chief-ciaran-martin-denies-intelligence-services-spying-snp/",
        "title": "Ex-GCHQ chief Ciaran Martin denies intelligence services spying on <b>SNP</b>",
        "description": "A FORMER top spy has denied that UK intelligence services have snooped on the activities of mainstream pro-independence parties."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11868841/police-investigating-fraud-claims-over-snp-financial-documents/",
        "title": "Police investigating ‘fraud claims’ over <b>SNP</b> financial documents",
        "description": "COPS are probing claims false signatures were used on financial documents as part of their investigation into <b>SNP</b> finances, according to reports. Detectives are believed to be looking into whether signatures used on accounting forms linked to the party’s ..."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/your-views-greens-blamed-for-highland-road-delays-20mph-li-340347/",
        "title": "YOUR VIEWS: Greens blamed for Highland road delays, 20mph limits and cold weather help",
        "description": "According to the Registers of Scotland 97.8 per cent of Scotland is rural but only about 17 per cent of the population lives in a rural area – but this 17 per cent of the population is being let down by the <b>SNP</b> government and its Green Party puppet masters."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7141423",
        "title": "Politics latest: &#39;Stop messing around&#39; - Badenoch issues warning to Tory rebels; the pledge &#39;haunting&#39; Labour",
        "description": "<b>SNP</b> urges Cameron to be on &#39;right side of history&#39; The foreign secretary should ensure the UK is &quot;on the right side of history&quot; following the International Court of Justice (ICJ) ruling on the Israel-Gaza conflict, the <b>SNP</b> has said. The UN court stopped ..."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/politics-poor-broadband-issue-had-to-be-raised-again-in-par-340425/",
        "title": "Politics: Poor broadband issue had to be raised again in Parliament",
        "description": "While telecommunications policy is reserved to the UK Government, it was the <b>SNP</b> Scottish Government who promised that Scotland would have 100 per cent superfast coverage by 2021, after they took on the responsibility for the local rollout of broadband ..."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24074640.sick-collateral-damage-lefts-thrust-power/",
        "title": "We are sick of being collateral damage in the Left&#39;s thrust for power",
        "description": "I AM surprised that Neil Mackay (&quot;I don&#39;t think there&#39;s a genuine left-winger in the <b>SNP</b>&quot;, January 21) should believe that Mick Lynch &quot;has become a symbol of hope for the Left&quot;, given Jeremy Corbyn&#39;s treatment by Sir Keir Starmer and the right-wingers in ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/snp-vow-to-work-harder-than-ever-as-poll-shows-labour-on-track-to-be-biggest-party-in-scotland-at-general-election-4495575",
        "title": "<b>SNP</b> vow to work ‘harder than ever’ as poll shows Labour on track to be biggest party in Scotland at general election",
        "description": "The <b>SNP</b> has vowed to work “harder than ever” after a poll showed Labour had surged to its biggest lead over the party for almost a decade. Research by Nostat put Labour on 36 per cent, up three points since its last poll in October, with the <b>SNP</b> on 33 ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24079574.poll-labour-surges-ahead-take-biggest-lead-snp/",
        "title": "Poll: Labour surges ahead to take biggest lead over <b>SNP</b>",
        "description": "Scottish Labour has taken its biggest lead over the <b>SNP</b> for almost a decade, according to a poll published today. The survey found a growing number of independence supporters switch their voting allegiances to Anas Sarwar&#39;s party amid mistrust of both ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13015591/A-majority-Scots-say-no-longer-trust-Nicola-Sturgeon-Scotlands-former-minister-faces-SNP-finances-Covid-WhatsApp-scandals.html",
        "title": "Nicola Sturgeon&#39;s popularity tanks in Scotland: New poll shows most Scots no longer trust ex-first minister amid <b>SNP</b> finances and Covid WhatsApp scandals",
        "description": "A survey by Norstat found that 51 per cent of Scottish voters do not trust Ms Sturgeon, with just under one-third (32 per cent) having trust in the former <b>SNP</b> leader. Her net trust rating of -19 represents a huge drop from when she led Scotland&#39;s response ..."
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24079452.snp-urges-cameron-on-right-side-history-icjs-israel-ruling/",
        "title": "<b>SNP</b> urges Cameron to be ‘on right side of history’ after ICJ’s Israel ruling",
        "description": "The International Court of Justice stopped short of ordering a ceasefire, but urged Israel to contain the death and damage in Gaza."
    },
    {
        "url": "https://www.express.co.uk/news/politics/1860535/Nicola-sturgeon-no-longer-trusted-scots-bombshell-new-poll",
        "title": "Nicola Sturgeon &#39;no longer trusted&#39; by Scots: bombshell new poll",
        "description": "The poll also showed as Ms Sturgeon&#39;s popularity has fallen so has that of the SNP and current First Minister Humza Yousaf."
    },
    {
        "url": "https://www.holyrood.com/comment/view,sketch-jenny-gilruth-would-like-a-good-star-please",
        "title": "Sketch: Jenny Gilruth would like a good star, please",
        "description": "She finds it “disappointing” that Labour could not bring itself to acknowledge anything positive. The <b>SNP</b> may not have closed the attainment gap, but on the bright side her teaching qualification at least makes it look like the government has put ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24079403.ruth-wishart-word-national-not-issue-snp/",
        "title": "Ruth Wishart: The word ‘national’ is not the issue for the <b>SNP</b>",
        "description": "HERE’S a question: Do the <b>SNP</b> need a makeover? Question two: Should that involve the removal of the word “national”? Thoughts which swirled ever since I learned that the ­current FM echoed his predecessor by musing that “national” was not the ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/police-investigating-claims-forged-signatures-31983420",
        "title": "Police in <b>SNP</b> forgery probe amid claims signatures were falsified on documents",
        "description": "Police are investigating claims that signatures were forged on documents as part of their probe into SNP finances. The Sunday Mail understand detectives have paperwork showing a name which the person denies having written themselves or having any knowledge of."
    },
    {
        "url": "https://uk.news.yahoo.com/former-spy-chief-russia-could-095859985.html",
        "title": "Former spy chief: Russia could target Holyrood and exploit Indy to damage Britian",
        "description": "As founding head of GCHQ’s National Cyber Security Centre, he sculpted Britain’s response to cyber-threats. Martin also held the post of director of security and intelligence at the Cabinet Office. GCHQ is the UK’s secret intelligence listening-post."
    },
    {
        "url": "https://uk.news.yahoo.com/council-makes-u-turn-takeaway-060000883.html",
        "title": "Council makes u-turn on takeaway planning permission after objection blunder",
        "description": "He called for planning permission to remain in place. Committee chair, Ken Andrew, <b>SNP</b>, said the situation is “absolutely unique” to him. He said last month’s committee meeting was left with the impression that the community council had not placed an ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/scottish-labour-takes-biggest-lead-31985786",
        "title": "Scottish Labour takes biggest lead over <b>SNP</b> in a decade according to poll results",
        "description": "Scottish Labour has taken its biggest lead over the <b>SNP</b> for almost a decade, according to a new poll. The survey by Norstat put Labour on 36 per cent and the <b>SNP</b> on 33 per cent. Labour was up three points from its last poll in October, while the <b>SNP</b> was ..."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/disgraced-ex-mp-gets-keep-31928541?int_source=nba",
        "title": "Disgraced ex-MP gets to keep work laptop for knockdown price after being booted out",
        "description": "Margaret Ferrier, an ex-<b>SNP</b> MP, lost her seat in a recall vote after admitting to breaking Covid rules. Newly published expenses data shows Ms Ferrier purchased her work laptop to keep after leaving office for just £320 - an £898 discount on the £1218 ..."
    },
    {
        "url": "https://www.aa.com.tr/en/turkiye/istanbul-straits-traffic-reopens-in-both-directions-after-cargo-ship-malfunction/3120906",
        "title": "Istanbul Straits traffic reopens in both directions after cargo ship malfunction",
        "description": "The <b>SNP</b> Pazar, an 80-meter (262-foot) cargo ship, which suffered a machinery malfunction near the Fatih Sultan Mehmet Bridge, was safely anchored at the Ahirkapı anchorage area with the support of a tugboat named Rescue-7, said a statement by the Turkish ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/covid-inquiry-jamie-dawson-sliced-snp-response-t3cc8zsj7",
        "title": "Covid inquiry: Jamie Dawson, the smiling KC tearing into the <b>SNP</b>",
        "description": "He can quickly turn a witness into a courtroom casualty. With a wry smile and a bounce on the balls of his feet, he took one pithy swipe and put the <b>SNP</b> response to the UK Covid inquiry to the sword in Edinburgh. “If it were the case that one had ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/israel-cameron-uk-government-gaza-david-lammy-b1135282.html",
        "title": "<b>SNP</b> urges Cameron to be ‘on right side of history’ after ICJ’s Israel ruling",
        "description": "The International Court of Justice stopped short of ordering a ceasefire, but urged Israel to contain the death and damage in Gaza."
    },
    {
        "url": "https://www.thetimes.co.uk/article/covid-inquiry-tore-them-apart-snp-nicola-sturgeon-comment-smtpf6gr2",
        "title": "Covid inquiry tore them apart and the <b>SNP</b> is on thin ice",
        "description": "All eyes will be on Nicola Sturgeon as she gives evidence next week, although our cheeks are still burning after her sweary WhatsApp tirade"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13013737/The-SNP-MP-old-flame-school-affair-ended-marriage.html",
        "title": "The <b>SNP</b> MP, an old flame from school… and an affair which ended his marriage",
        "description": "A Nationalist MP has split from his wife and rekindled a relationship with his childhood sweetheart amid a new <b>SNP</b> sleaze scandal. The politician was spotted embracing his old flame, whom he first met at school, on the House of Commons terrace during ..."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11867192/snp-ministers-sought-to-make-political-capital-covid/",
        "title": "<b>SNP</b> ministers ‘sought to make political capital’ from Covid crisis, says public policy expert",
        "description": "BOMBSHELL evidence at the UK Covid inquiry shows SNP ministers “sought to make political capital” from the Covid crisis, a leading public policy academic said. Professor James Mitchell’s verdict"
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1860499/tturgeon-SNP-shambles-matthew-goodwin",
        "title": "Sturgeon’s halo slips as shambles of <b>SNP</b> is revealed, says Matthew Goodwin",
        "description": "After failing to turnaround Scotland’s dismal record in education and health, Sturgeon was arrested after hundreds of thousands of pounds in the <b>SNP</b> allegedly went missing. She was released without charge, but the whole thing stinks and looks like a ..."
    },
    {
        "url": "https://news.yahoo.com/bbc-defends-kaye-adams-over-114927226.html",
        "title": "BBC defends Kaye Adams over ‘shocking’ Nicola Sturgeon comment on Radio Scotland",
        "description": "Sturgeon’s messages that were shared with the ex-<b>SNP</b> leader’s top adviser, Liz Lloyd, were revealed at the Covid inquiry on Thursday (25 January). Talking about the subject on Mornings, with Kaye Adams, columnist Kelly Given told host the presenter ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/25/cross-party-mps-telegraph-deal-write-letter-concern-uae/",
        "title": "Cross-party group of MPs tell minister of concerns over UAE-backed takeover of The Telegraph",
        "description": "The signatories to the letter come from the Conservatives, Labour, Lib Dems, and <b>SNP</b> and include former cabinet ministers, a former justice secretary, and former chairmen of the Public Accounts Committee. It is highly unusual for such a broad coalition of ..."
    }
]