[
    {
        "url": "https://www.thetimes.co.uk/article/our-great-challenge-protect-mps-right-protest-rc2bm6j50",
        "title": "Our great challenge: protect MPs and the right to protest",
        "description": "The Speaker, Sir Lindsay Hoyle, made a mistake in accepting amendments from both Labour and the Tories on an <b>SNP</b> motion calling for a ceasefire in the Gaza conflict. The immediate effect was to relieve pressure on Sir Keir Starmer, whose MPs might"
    },
    {
        "url": "https://www.thetimes.co.uk/article/snp-reject-house-asylum-seekers-ferries-uk-government-b656vkjwm",
        "title": "<b>SNP</b> rejects Home Office plea to house migrants on ferries",
        "description": "<b>SNP</b> ministers have dismissed pressure from the UK government to house asylum seekers on ferries by accusing the home secretary of pursuing “morally repugnant” migration policies. James Cleverly, the home secretary, has urged the Scottish government to ..."
    },
    {
        "url": "https://www.newsshopper.co.uk/news/national/24142462.snp-propose-fresh-gaza-ceasefire-motion-commons-chaos/",
        "title": "<b>SNP</b> to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "The <b>SNP</b> said it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the last Commons debate on the subject. Last Wednesday’s angry scenes in the Commons meant an <b>SNP</b> ..."
    },
    {
        "url": "https://uk.news.yahoo.com/mps-vote-fresh-gaza-ceasefire-001302310.html",
        "title": "MPs to vote on fresh Gaza ceasefire motion after Commons chaos",
        "description": "The <b>SNP</b> said it will take up speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the previous Commons debate on the subject. Last Wednesday’s angry scenes in the Commons meant that ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/cameron-gaza-foreign-office-benjamin-netanyahu-government-b1141343.html",
        "title": "UK pledges £4.25m in sexual and reproductive aid for women in Gaza",
        "description": "The <b>SNP</b> indicated it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh motion which it said would push for UK Parliament to back concrete action to end the hostilities. It is not yet clear what form the new debate will take ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/snp-gaza-government-keir-starmer-commons-b1141347.html",
        "title": "<b>SNP</b> to propose fresh Gaza ceasefire motion after Commons chaos",
        "description": "MPs are set to again debate calling for a ceasefire in Gaza after a previous attempt dissolved into angry recriminations and demands for the Commons Speaker to resign. The SNP said it will take up Speaker Sir Lindsay Hoyle’s offer of a meaningful debate on a fresh ceasefire motion following criticism of his handling of the last Commons debate on the subject."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24142457.taxpayer-funded-bodyguards-cars-provided-mps-due-safety-fears/",
        "title": "Taxpayer-funded bodyguards and cars ‘provided to more MPs due to safety fears’",
        "description": "Sir Lindsay, who has faced calls to resign after going against convention during the <b>SNP</b>’s Opposition Day debate on a ceasefire in Gaza, said his motivation for widening Wednesday’s discussion was fuelled by concern about MPs’ security after ..."
    },
    {
        "url": "https://www.thesun.co.uk/news/26163303/sir-keir-starmer-fix-speaker-gaza-votes/",
        "title": "Labour MPs boasted Sir Keir Starmer was ‘going to fix the Speaker’ in crunch meeting over Gaza votes",
        "description": "Westminster was plunged into turmoil on Wednesday when Sir Lindsay tore up procedure to let Labour push its Gaza amendment to an <b>SNP</b> ceasefire motion. The Labour leader had been braced for another mass rebellion on Palestine — and rumours claim he strong ..."
    }
]