[
    {
        "url": "https://news.stv.tv/west-central/glasgow-city-council-facing-more-than-107m-budget-gap-over-next-three-years",
        "title": "Council facing more than £107m budget gap over next three years",
        "description": "Political groups will present proposals to plug the gap at a meeting, with service cuts and increased charges among the options available."
    },
    {
        "url": "https://www.dailyrecord.co.uk/in-your-area/lanarkshire/katy-loudon-confident-general-election-32087358",
        "title": "Katy Loudon confident of General Election seat win despite bruising by-election loss",
        "description": "Katy Loudon is ready to once again run for the SNP in the Rutherglen and Hamilton West seat despite losing in the by-election last year."
    },
    {
        "url": "https://www.scotsman.com/news/politics/scottish-budget-local-authorities-call-for-flexibility-to-hike-council-tax-by-up-to-5-per-cent-as-shona-robison-urgent-meeting-demanded-4513090",
        "title": "Scottish Budget: Local authorities call for ‘flexibility’ to hike council tax by up to 5 per cent as Shona Robison urgent meeting demanded",
        "description": "The demand for an urgent meeting with Shona Robison comes after the Scottish Government threatened to withdraw money intended to fund a freeze"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/09/humza-yousaf-snp-divisions-kate-forbes-cabinet/",
        "title": "Humza Yousaf accused of stoking <b>SNP</b> civil war by snubbing Kate Forbes in reshuffle",
        "description": "Allies of former leadership rival say First Minister could have helped reunite party by hiring her to replace disgraced health secretary"
    },
    {
        "url": "https://www.lbc.co.uk/opinion/be-careful-what-you-wish-for-is-a-phrase-coined-for-humza-yousaf/",
        "title": "Be careful what you wish for is a phrase coined for Humza Yousaf",
        "description": "Not quite two months into the year and for Humza Yousaf it seems impossible to shake off the plague of problems which have beset him since becoming both <b>SNP</b> leader and First Minister of Scotland. The personable 38-year-old is sipping from a chalice ..."
    },
    {
        "url": "https://morningstaronline.co.uk/article/pressure-growing-starmer-scrap-two-child-limit",
        "title": "Pressure growing on Sir Keir to scrap two-child limit under Labour government",
        "description": "PRESSURE is growing on Sir Keir Starmer to commit to scrapping the two-child limit under a Labour government amid ongoing criticism of its recent green pledge U-turn."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24110733.councillors-unite-ceasefire-call-bethlehem-delegation-visits/",
        "title": "Councillors unite in ceasefire call as Bethlehem delegation visits",
        "description": "Political leaders in Glasgow have issued a renewed call for an immediate and lasting ceasefire in Gaza. A statement has been released by the <b>SNP</b>, Labour and Green groups on the city council as a delegation of educational psychologists from Bethlehem ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24110673.scots-town-halls-draw-plan-5-per-cent-council-tax-hike/",
        "title": "Scots Town halls draw up plan for 5 per cent council tax hike",
        "description": "However, the only way they’ll receive the cash is by agreeing to the policy by February 16. Many of Scotland’s 32 councils, including <b>SNP</b>-run Glasgow, are expected to implement the freeze. Others, who were planning increases of as much as 10% ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-political-groups-call-gaza-28604879",
        "title": "Glasgow political groups call for Gaza ceasefire after Bethlehem delegation visit",
        "description": "Councillors expressed solidarity with all Palestinians when they met a delegation from Glasgow&#39;s twin city of Bethlehem."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/clydebank-community-centre-leased-gymnastics-28604363",
        "title": "Clydebank community centre to be leased to gymnastics club despite concerns",
        "description": "In March 2023, as part of savings options put forward to address a £21 million budget gap, members agreed to review community facility provision, across West Dunbartonshire"
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/opinion/24105350.time-scottish-government-think-eu-alignment/",
        "title": "Time for the Scottish government to think again on EU alignment",
        "description": "The SNP party’s stance on EU alignment regarding farm policy is looking more ludicrous by the day, given the Dutch, the French,"
    },
    {
        "url": "https://www.thenational.scot/news/24110075.labour-face-fresh-gaza-ceasefire-troubles-snp-plan-vote/",
        "title": "Labour face fresh Gaza ceasefire troubles as <b>SNP</b> plan vote",
        "description": "CRACKS could again be exposed in the Labour Party as the <b>SNP</b> consider forcing another vote on calling for a ceasefire in Gaza. The National understands the party may use a scheduled opposition day debate in the Commons later this month to call for a ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13066169/Michael-Matheson-urged-forgo-13-000-golden-goodbye-finally-quits-Scotlands-health-secretary-row-11-000-iPad-data-roaming-charges-racked-holiday-Morocco.html",
        "title": "Michael Matheson urged to forgo £13,000 &#39;golden goodbye&#39; after he finally quits as Scotland&#39;s health secretary in row over £11,000 in iPad data roaming charges he racked up ...",
        "description": "The Scottish Tories are pressuring the <b>SNP</b> ex-minister to refuse a severance payment after he quit in the wake of a scandal over his iPad data roaming charges. Douglas Ross, the Scottish Conservative leader, said voters would be &#39;appalled&#39; if Mr Matheson ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24109889.michael-matheson-misled-presiding-officer-11k-data-bill/?ref=rss",
        "title": "Michael Matheson &#39;misled&#39; Presiding Officer over £11k data bill",
        "description": "Scottish Tory leader Douglas Ross said if the allegations were accurate it would be “unforgivable” and would “raise serious questions” about the <b>SNP</b> vetran&#39;s future as an MSP. Mr Matheson resigned on Thursday morning, hours before he was given a ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/24109511.scottish-lib-dems-announce-inverclyde-election-candidate/",
        "title": "Scottish Lib Dems announce Inverclyde election candidate",
        "description": "THE Scottish Liberal Democrats have announced their Inverclyde candidate for the next general election. Ross Stalker will contest the new Inverclyde and Renfrewshire West seat, which will take in Houston, Crosslee and Bridge of Weir."
    },
    {
        "url": "https://www.thenational.scot/politics/24107718.podcast-can-snp-galvanise-yessers-win-next-election/",
        "title": "Podcast: Can the <b>SNP</b> galvanise Yessers to win the next election?",
        "description": "POLITICS in Scotland still falls heavily along constitutional lines – but will the SNP be able to galvanise support of Yessers to win the"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-scotland-politics-68252464",
        "title": "Why did iPad row minister Michael Matheson choose to quit now?",
        "description": "On the other side, there are those within the <b>SNP</b> who think the party was denied a productive day bashing Labour U-turns. So with all this taken into account, the question remains: why did Michael Matheson choose to go when he did? The answer may well lie ..."
    },
    {
        "url": "https://www.gazetteherald.co.uk/news/national/24109478.matheson-urged-reject-13-000-severance-pay-quitting-amid-ipad-bill-row/",
        "title": "Matheson urged to reject £13,000 severance pay after quitting amid iPad bill row",
        "description": "The public will be “outraged” if former health secretary Michael Matheson accepts a severance payment of almost £13,000, Scottish Conservative leader Douglas Ross has said. Mr Matheson resigned from the Scottish Government role on Thursday following ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/ayrshire/tory-candidate-accuses-snp-housing-32080789",
        "title": "Tory candidate accuses <b>SNP</b> of housing &quot;failure&quot;",
        "description": "Tory challenger Todd Ferguson has insisted the local MP has run out of excuses trying to deflect from years of SNP failure to build enough houses. But incumbent North Ayrshire and Arran SNP MP, Patricia Gibson, claims her party have a great record on housing."
    },
    {
        "url": "https://www.cambridge-news.co.uk/news/uk-world-news/waspi-campaign-hits-parliament-bill-28599158",
        "title": "WASPI campaign hits parliament with bill to force £10,000 compensation payouts",
        "description": "More than 3.5 million women born in the 1950s lost out in pension changes and in a new update a bill has been created to get them money"
    },
    {
        "url": "https://uk.news.yahoo.com/glasgow-council-groups-unite-ceasefire-173117424.html",
        "title": "Glasgow council groups unite in ceasefire call as Bethlehem delegation visits city",
        "description": "Political leaders in Glasgow have issued a renewed call for an immediate and lasting ceasefire in Gaza. A statement has been released by the <b>SNP</b>, Labour and Green groups on the city council as a delegation of educational psychologists from Bethlehem ..."
    },
    {
        "url": "https://uk.news.yahoo.com/sanction-tucker-carlson-vladimir-putin-160940847.html",
        "title": "Sanction Tucker Carlson for Vladimir Putin &#39;love in&#39;, says <b>SNP</b> MP",
        "description": "FOX News host Tucker Carlson should be sanctioned by the UK Government for a “love-in” interview with Vladimir Putin, an <b>SNP</b> MP has said. The pro-Donald Trump news anchor this week became the first western journalist to be granted an audience with the ..."
    },
    {
        "url": "https://www.ardrossanherald.com/news/24108425.north-ayrshire-general-election-candidates-clash-housing/",
        "title": "North Ayrshire general election candidates clash on housing",
        "description": "NORTH Ayrshire&#39;s <b>SNP</b> and Conservative candidates have clashed over the housing issues facing the area. Todd Ferguson, the Tories&#39; candidate for North Ayrshire and Arran at the forthcoming general Election, claims the area&#39;s MP has &quot; run out of excuses ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scotland-snp-holyrood-house-of-lords-highlands-and-islands-b1138299.html",
        "title": "Tory MSP stands down from Holyrood to take up position at Scotland Office",
        "description": "“I’d like to put on record my thanks to Douglas and wish him – and all my Scottish Conservative colleagues – the very best as they continue to hold this failing, scandal-ridden <b>SNP</b> Government to account. “I’m delighted to be taking up a new ..."
    },
    {
        "url": "https://www.thetimes.co.uk/article/33663c75-4736-4d17-9016-d5e6dd93db1f",
        "title": "<b>SNP</b> misled public over budget, think tank says",
        "description": "<b>SNP</b> ministers painted a “seriously misleading picture” of funding for the NHS and councils in the budget, according to analysis by a leading think tank. The Institute for Fiscal Studies found that money for the health service was being cut by 0.7 per ..."
    },
    {
        "url": "https://news.yahoo.com/snp-health-secretary-quit-over-180500286.html",
        "title": "<b>SNP</b> health secretary who quit over iPad scandal urged to reject £13k payout",
        "description": "The public will be “outraged” if former health secretary Michael Matheson accepts a severance payment of almost £13,000, the leader of the Scottish Tories has said."
    },
    {
        "url": "https://www.yahoo.com/news/humza-yousaf-rearranges-snp-deck-175939690.html",
        "title": "Humza Yousaf rearranges <b>SNP</b> deck chairs as the iceberg looms",
        "description": "Such soundings that are possible in the secret state that now passes for the <b>SNP</b> government suggest that no attempt was made by Yousaf to enlist Forbes to add a bit of sparkle to his beleaguered administration. But even if he had approached her ..."
    },
    {
        "url": "https://news.yahoo.com/snp-war-booze-bound-fail-162541879.html",
        "title": "The <b>SNP</b>’s war on booze is bound to fail",
        "description": "Alcoholic drinks purchased in Scotland will rise by 30 per cent in September, after ministers decided to increase the minimum unit price (MUP) of alcohol from 50p to 65p."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/douglas-ross-scottish-humza-yousaf-morocco-conservative-b2493581.html",
        "title": "Matheson urged to reject £13,000 severance pay after quitting amid iPad bill row",
        "description": "The former Scottish health secretary initially claimed almost £11,000 in roaming charges on his parliamentary expenses."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/fergus-ewing-delighted-fiona-hyslop-is-appointed-transport-341806/",
        "title": "Fergus Ewing &#39;delighted&#39; Fiona Hyslop is appointed transport secretary overseeing the A9",
        "description": "Critic of the Scottish Government’s handling of dualling, <b>SNP</b> Inverness and Nairn MSP Fergus Ewing said he was “personally delighted” with the appointment. But at the same time he promised to maintain the pressure on the government so it fulfils the ..."
    },
    {
        "url": "https://www.alloaadvertiser.com/news/24106631.politicians-row-kincardine-health-centre-delays/",
        "title": "Politicians row over Kincardine Health Centre delays",
        "description": "DUNFERMLINE MSP Shirley-Anne Somerville has called on a future Labour government to commit to restoring funding for Scotland - and allow"
    },
    {
        "url": "https://www.thegrocer.co.uk/alcohol/scotland-to-raise-minimum-unit-pricing-for-alcohol-to-65p/688093.article",
        "title": "Scotland to raise minimum unit pricing for alcohol to 65p",
        "description": "The SNP-Green coalition government is to increase the minimum unit price (MUP) for alcohol in Scotland from 50p to 65p. The new rate will take effect, subject to parliamentary approval, from 30 September. The plans will be put before the Scottish parliament on 19 February."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/politics/11948436/michael-matheson-tax-free-golden-goodbye/",
        "title": "Shamed <b>SNP</b> minister Michael Matheson’s £12.7k ‘golden goodbye’ will be tax free amid calls to hand back cash",
        "description": "DISGRACED ex-Health Secretary Michael Matheson’s £12,700 golden goodbye will be paid to him tax free, it can be revealed. The severance will comfortably cover the £11,000 iPad roaming charges he"
    },
    {
        "url": "https://www.walesonline.co.uk/news/uk-news/waspi-campaign-hits-parliament-bill-28599120",
        "title": "WASPI campaign hits parliament with bill to force £10,000 compensation payouts",
        "description": "More than 3.5 million women born in the 1950s lost out in pension changes and in a new update a bill has been created to get them money"
    },
    {
        "url": "https://www.holyrood.com/news/view,neil-gray-faces-significant-fall-in-hospital-productivity-in-new-role-as-health-secretary",
        "title": "Neil Gray faces &#39;significant fall in hospital productivity&#39; in new role as health secretary",
        "description": "The scale of the challenge facing newly appointed health secretary Neil Gray has been revealed in a new report that shows the Scottish NHS is now treating fewer patients than it was before the pandemic despite an increase in funding and staff."
    },
    {
        "url": "https://news.stv.tv/politics/mcarthur-to-lead-delegation-to-learn-from-assisted-dying-laws-in-california",
        "title": "McArthur to lead delegation to learn from assisted dying laws in California",
        "description": "The Scottish Liberal Democrat’s Assisted Dying for Terminally Ill Adults (Scotland) Bill is expected to be introduced at Holyrood later this year."
    },
    {
        "url": "https://www.holyrood.com/news/view,exclusive-snp-membership-numbers-fall-again-new-figures-reveal",
        "title": "Exclusive: <b>SNP</b> membership numbers fall again, new figures reveal",
        "description": "<b>SNP</b> membership has fallen again, with the figure now almost half its 2019 peak of 125,000, Holyrood can reveal. During the leadership contest to succeed Nicola Sturgeon in spring 2023 it was revealed that the total had declined to just under 72,190."
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/letter-from-scotland-439/",
        "title": "Letter from Scotland",
        "description": "It’s been a week of wind and rain and, occasionally, snow, as the weather swings erratically from unusually mild to freezing cold, day by day. The storms are getting stronger. We are on to our"
    },
    {
        "url": "https://www.chroniclelive.co.uk/news/uk-news/whatsapp-informal-communications-review-could-28596029",
        "title": "WhatsApp and informal communications review could be widened to include UK Government",
        "description": "Humza Yousaf said his Deputy First Minister Shona Robison has written to the other administrations to urge them to be part of the review"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24107889.council-faces-100m-cuts-next-three-years/",
        "title": "Council faces more than £100m of cuts over next three years",
        "description": "GLASGOW City Council is facing more than £100 million of budget cuts over the next three years. Councillors are meeting next week to set the budget and officials have confirmed the scale of the cuts required to balance the books. A report shows a spending gap of £107.7m for 2004/25 to 2026/27."
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24107957.scottish-income-tax-spotlight-kate-forbes-wades/?ref=rss",
        "title": "Scottish income tax in spotlight as Kate Forbes wades in",
        "description": "There is clearly room for debate about the degree to which Scotland should use its devolved powers on income tax"
    },
    {
        "url": "https://uk.news.yahoo.com/inspiring-kaukab-stewart-becomes-first-111953663.html",
        "title": "&#39;Inspiring&#39;: Kaukab Stewart becomes first woman of colour to gain ministerial role",
        "description": "THE appointment of SNP MSP Kaukab Stewart to a ministerial position has been praised as “inspiring” after she became the first woman of colour to hold the post in the Scottish Government."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13063343/Ipad-scandal-minister-FINALLY-quits.html",
        "title": "Humza Yousaf is accused of &#39;weak&#39; leadership as pressure grows on First Minister after his health secretary finally quit over £11,000 iPad data roaming bill",
        "description": "Humza Yousaf has been plunged into the biggest crisis of his leadership after the SNP Health Secretary finally quit over his £11,000 iPad data roaming bill."
    },
    {
        "url": "https://www.thetimes.co.uk/article/scotland-rent-cap-snp-lets-landlord-tenant-rules-gsmdrxxpm",
        "title": "Scottish rent cap: Tenants confused by <b>SNP</b>’s control system face huge rises",
        "description": "Tenants in Scotland face huge hikes because most have not been told how to use the SNP’s new rent control system, a poll suggests. A YouGov survey commissioned by the Scottish government found that more than half of private renters did not think they had the right to challenge an increase through a rent officer."
    },
    {
        "url": "https://www.pressandjournal.co.uk/fp/politics/6369403/aberdeenshire-snp-councillor-suspended-sharing-anti-semitic-post/",
        "title": "Aberdeenshire <b>SNP</b> councillor suspended for sharing anti-Semitic post mocking up Israeli PM as Hitler",
        "description": "An icon of a desk calendar. An icon of a circle with a diagonal line across. An icon of a block arrow pointing to the right. An icon of a paper envelope. An icon of the Facebook &quot;f&quot; mark. An icon of the Google &quot;G&quot; mark. An icon of the Linked In &quot;in&quot; mark ..."
    },
    {
        "url": "https://www.nhl.com/news/nhl-buzz-news-and-notes-february-7",
        "title": "NHL Buzz: Poitras expected to be out rest of season for Bruins after surgery",
        "description": "If we waited, then the summer gets compromised.&quot; The Bruins host the Vancouver Canucks on Thursday (7 p.m. ET; NESN, <b>SNP</b>, SNO, SNE, TVAS). &quot;He&#39;s not leaving Boston,&quot; Montgomery said. &quot;He&#39;s got to do his rehab here and we&#39;re going to be hands-on with him ..."
    },
    {
        "url": "https://www.pressandjournal.co.uk/fp/lifestyle/6365807/sandi-thom-banff-music-star/",
        "title": "Sandi Thom: Banff star on her new single and return to the music scene",
        "description": "An icon of a desk calendar. An icon of a circle with a diagonal line across. An icon of a block arrow pointing to the right. An icon of a paper envelope. An icon of the Facebook &quot;f&quot; mark. An icon of the Google &quot;G&quot; mark. An icon of the Linked In &quot;in&quot; mark ..."
    },
    {
        "url": "https://www.newsday.com/long-island/crime/gilgo-beach-killings/gilgo-beach-killings-rex-heuermann-dna-evidence-g8otc4ib",
        "title": "Gilgo Beach killings: Prosecutors poised to rely heavily on nuclear DNA technology to prove case against Rex Heuermann",
        "description": "&quot;Nuclear DNA is sort of like the gold standard,&quot; said Suffolk County District Attorney Ray Tierney, who is part of a team of prosecutors trying the case against Rex A. Heuermann."
    },
    {
        "url": "https://www.heraldscotland.com/default_content/12610899.battle-sent-english-home-think-now-alex-salmond-wants-heart-homecoming-2014/",
        "title": "It was the battle which sent the English home to think again ... now Alex Salmond wants it at the heart of Homecoming 2014",
        "description": "Last week, <b>SNP</b> plans to subsidise school trips to the site of the Scots victory over the English prompted claims the government was using public money to push Nationalist propaganda. However, according to leaked documents obtained by the Sunday Herald ..."
    }
]