[
    {
        "url": "https://www.thescottishsun.co.uk/news/11962456/scottish-government-dorothy-bain-post-office-told-years-after/",
        "title": "Scottish Government claims it was only told about Post Office scandal FIFTEEN YEARS after it emerged",
        "description": "PROSECUTORS say they only told the Scottish Government about the flawed Horizon IT system that saw subpostmasters wrongly convicted of theft 15 years after the scandal broke. They were also"
    },
    {
        "url": "https://news.stv.tv/politics/choice-for-ipad-minister-michael-matheson-whether-to-take-13000-payout-says-new-health-secretary-neil-gray",
        "title": "Choice for iPad minister whether to take £13,000 payout, says new health sec",
        "description": "Michael Matheson resigned on February 8 after incurring £10,935 in data roaming charges on his iPad while on a family holiday."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/11/nicola-sturgeon-sent-flowers-by-snp-after-covid-inquiry/",
        "title": "Nicola Sturgeon was sent flowers by the <b>SNP</b> after ‘traumatic’ interrogation at Covid Inquiry",
        "description": "Gesture branded insensitive by people who were unable to say goodbye to loved ones because of policies she put in place during pandemic"
    },
    {
        "url": "https://www.thetimes.co.uk/article/alister-jack-demands-answers-snp-lord-advocate-jtkvl989v",
        "title": "Alister Jack seeks answers from <b>SNP</b> on lord advocate’s dual role",
        "description": "The Scottish secretary wants the first minister to explain why a manifesto pledge of separating the political and legal duties is taking so long"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/11/female-inmates-views-sharing-prison-trans-convicts-scotland/",
        "title": "Female inmates’ views on sharing prison with trans convicts ‘kept secret’ by Scottish Prison Service",
        "description": "Female prisoners’ views on transgender inmates in Scotland will be kept secret after the prison service blocked requests for a poll to be made public."
    },
    {
        "url": "https://www.thenational.scot/politics/24112599.michael-matheson-deserves-credit-service-constituents/",
        "title": "Michael Matheson deserves credit for his service to his constituents",
        "description": "AS a constituent of the former Health Secretary Michael Matheson MSP, I feel the voice of constituents should be heard."
    },
    {
        "url": "https://www.thenational.scot/politics/24112595.snps-current-policy-general-election-entirely-misconceived/",
        "title": "<b>SNP</b>’s current policy for the General Election is entirely misconceived",
        "description": "I got a letter from Messrs Yousaf and Flynn seeking financial support for the SNP’s Westminster campaign. It says the manifesto"
    },
    {
        "url": "https://www.shetlandtimes.co.uk/2024/02/11/beatrice-wishart-calls-for-rethink-over-broadband-scheme",
        "title": "Beatrice Wishart calls for rethink over broadband scheme",
        "description": "Shetland MSP Beatrice Wishart has today (Sunday) called for a rethink of the SNP’s broadband rollout. Ms Wishart said the voucher scheme has failed after"
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24112551.celtic-humza-yousaf-charge-makes-green-around-gills/",
        "title": "Celtic: Humza Yousaf being in charge makes me green around the gills",
        "description": "It showcases ingenuity and a pleasing can-do attitude that doesn’t mess about if you want to access power very quickly."
    },
    {
        "url": "https://www.heraldscotland.com/news/24112520.inside-nightclub-helping-keep-sauchiehall-street-alive/",
        "title": "Inside the nightclub helping to keep Sauchiehall Street alive",
        "description": "IT’S only on weekends as midnight approaches that Sauchiehall Street comes alive. And then mainly on that jaggy stretch that dips towards the"
    },
    {
        "url": "https://uk.news.yahoo.com/david-cameron-deeply-concerned-israeli-083929840.html",
        "title": "David Cameron ‘deeply concerned’ after Israeli strikes kill 44 in Rafah ahead of planned invasion",
        "description": "Lord David Cameron has said he is “deeply concerned” about a planned Israeli ground invasion of the southern Gaza city of Rafah. Rafah, on the southern border with Egypt, is one of the only regions not yet targeted by an Israeli ground offensive and is providing refuge to more than half of Gaza’s 2.3 million population."
    },
    {
        "url": "https://uk.news.yahoo.com/why-parliamentary-candidate-t-removed-165818784.html",
        "title": "Why a parliamentary candidate can’t be removed by a party in the weeks up to an election",
        "description": "This happened to Neale Hanvey in the last general election. Mr Hanvey stood as an independent for Kirkcaldy after he was suspended from the <b>SNP</b>. Labour has mantained it intends to keep Mr Ali on as the candidate. Pat McFadden, Labour’s national campaign ..."
    },
    {
        "url": "https://www.scotsman.com/news/politics/pressure-mounting-on-michael-matheson-to-rule-out-ps13000-golden-goodbye-4513823",
        "title": "Pressure mounting on Michael Matheson to rule out £13,000 golden goodbye",
        "description": "Former health secretary Michael Matheson has been told it would be “outrageous” to accept a near £13,000 severance package, as pressure mounts on him to rule out receiving the golden goodbye."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/by-election-rules-azhar-ali-b2494375.html",
        "title": "Why a parliamentary candidate can’t be removed by a party in the weeks up to an election",
        "description": "The withdrawal notice must be signed by the candidate, attested by a witness and delivered by 4pm on the 19th working day before the poll. In this instance, since the by-election is on the 29 Feburary, the notice would have to have been delivered by 2 February. The short answer is you can’t."
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/anchorfield-tram-works-edinburgh-council-evacuation-newhaven-4513280",
        "title": "Council &#39;secrecy&#39; over investigation into claims tram works cause of damage at Anchorfield",
        "description": "The <b>SNP</b> group leader said he was told to withdraw a comment that the damage could be caused by tram works over concerns about the council&#39;s &#39;insurance position&#39;. His tram works claim has been criticised by the council leader as &#39;fuelling speculation&#39;."
    },
    {
        "url": "https://www.independent.co.uk/news/world/middle-east/david-cameron-israel-military-offensive-gaza-b2494264.html",
        "title": "David Cameron ‘deeply concerned’ after Israeli strikes kill 44 in Rafah ahead of planned invasion",
        "description": "Lord David Cameron says he is “deeply concerned” about a planned Israeli ground invasion of the southern Gaza city of Rafah. Rafah, on the southern border with Egypt, is one of the only regions not yet targeted by an Israeli ground offensive and is providing refuge to more than half of Gaza’s 2.3 million population."
    },
    {
        "url": "https://www.heraldscotland.com/news/24112335.alister-jack-asks-humza-yousaf-lord-advocate-clarification/",
        "title": "Alister Jack asks Humza Yousaf for Lord Advocate clarification",
        "description": "Alister Jack has written to the First Minister asking for an update on plans to reform the role of Lord Advocate."
    },
    {
        "url": "https://www.thenational.scot/politics/24111507.scotland-weeks-seize-independence-opportunity/",
        "title": "Scotland has only a few weeks to seize this independence opportunity",
        "description": "It’s clear for all to see that if Stephen Noon’s latest piece of Upper House nonsense is any measure, strategy in <b>SNP</b> circles isn’t what it used to be. What is blindingly obvious to all of us who have no credentials in the arena of political strategy ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/ayrshire/view-bellfield-interchange-wont-priority-32099826",
        "title": "View that Bellfield Interchange won&#39;t be a priority for 20 years blasted as &#39;scandalous&#39;",
        "description": "Furious East Ayrshire Council leader Douglas Reid expressed anger and disappointment that the junction won&#39;t be prioritised."
    }
]