[
    {
        "url": "https://www.kentonline.co.uk/news/national/labour-ready-for-difficult-decisions-in-new-age-of-insecurity-starmer-says-110761/",
        "title": "Labour ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/keir-starmer-scottish-margaret-thatcher-glasgow-snp-b1139835.html",
        "title": "Labour ready for difficult decisions in new age of insecurity, Starmer says",
        "description": "Sir Keir Starmer will insist Labour can deliver ‘security for decades’ as he addresses his party’s Scottish conference in Glasgow on Sunday."
    },
    {
        "url": "https://www.thesun.co.uk/news/26013045/sun-says-west-united-alexei-navalny-death/",
        "title": "Navalny’s death must unite the West like never before against Putin’s murderous tyranny",
        "description": "Don’t let Navalny’s death be in vain ALEXEI Navalny’s death must unite the West like never before against Vladimir Putin’s murderous tyranny. The scenes now playing out inside his brutal regime"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13095501/SNP-MP-Ian-Blackford-stole-wife-used-say-looked-like-Weeble.html",
        "title": "<b>SNP</b> MP Ian Blackford stole my wife (but she used to say he looked like a Weeble!)",
        "description": "Eric Boyle, 64, has been married to Mr Blackford’s new lover Kim Lyons, 63, for almost 14 years and has chosen to speak out about the turmoil he has suffered at the hands of the senior Nationalist and his now-estranged wife."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/palestine-march-israel-london-arrests-b2497951.html",
        "title": "Twelve arrested at pro-Palestine march near Israeli embassy in central London",
        "description": "Twelve people were arrested at a pro-Palestine march in central London on Saturday afternoon which called for an immediate ceasefire in Gaza. The arrests were for a string of alleged offences, with one person detained on suspicion of support “for a proscribed organisation in relation to a placard”."
    },
    {
        "url": "https://www.thesun.co.uk/news/politics/26011279/james-cleverly-tells-scotland-and-wales-take-more-asylum-seekers/",
        "title": "Home Secretary James Cleverly tells Scotland and Wales to house more asylum seekers",
        "description": "JAMES Cleverly has told Scotland and Wales to house more asylum seekers – including on cruise ships and former Army barracks. The Home Secretary wrote to both governments shaming their"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1867902/Nicola-Sturgeon-SNP-supporters-Humza-Yousaf-crisis",
        "title": "Nicola Sturgeon downfall triggers exodus of <b>SNP</b> supporters in crisis for Humza Yousaf",
        "description": "A glaring weakness has been revealed in the SNP’s election chances following the resignation of Nicola Sturgeon. Key to the SNP ’s previous road to Holyrood was a policy focus on middle-class voters. But recent polling analysis shows that that same target group are leaving the party in droves ever since Ms Sturgeon’s resignation."
    },
    {
        "url": "https://www.thetimes.co.uk/article/scottish-labour-poised-to-back-snp-call-for-gaza-ceasefire-205xr983p",
        "title": "Scottish Labour poised to back <b>SNP</b> call for Gaza ceasefire",
        "description": "The party’s conference demanded an immediate ceasefire and steps towards a two-state solution in the Middle East. The SNP is due to lay a similar motion in the Commons"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-humza-yousaf-snp-politics-scottish-b1139826.html",
        "title": "Sarwar felt ‘sorry’ for Sturgeon after she resigned as first minister",
        "description": "Anas Sarwar has recalled “feeling sorry” for Nicola Sturgeon after she resigned as first minister last year. The Scottish Labour leader said he felt an “emotional connection” with the former SNP leader as she left office, despite their clearly diverging views on politics."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/anas-sarwar-felt-sorry-nicola-32151378",
        "title": "Anas Sarwar &#39;felt sorry&#39; for Nicola Sturgeon after she stepped down as first minister",
        "description": "The Scottish Labour leader said he felt an &quot;emotional connection&quot; with the former SNP leader as she left office."
    },
    {
        "url": "https://www.yorkpress.co.uk/news/national/24126646.twelve-arrests-pro-palestine-demonstration-central-london/",
        "title": "Twelve arrests at pro-Palestine demonstration in central London",
        "description": "Between 200,000 and 250,000 people were expected at the demonstration, according to a spokesman for the Palestine Solidarity Campaign."
    },
    {
        "url": "https://news.stv.tv/west-central/thousands-march-to-scottish-labour-conference-in-glasgow-for-gaza-ceasefire-protest",
        "title": "Thousands march to Scottish Labour conference in Gaza ceasefire protest",
        "description": "Demonstrators marched through Glasgow as Scottish Labour delegates gathered. Thousands of pro-Palestinian demonstrators have marched through Glasgow to protest outside the Scottish Labour conference taking place in the city, calling for an immediate ceasefire in the Israel-Hamas war."
    },
    {
        "url": "https://www.thenational.scot/news/24126617.inside-ceasefire-protest-scottish-labour-conference/",
        "title": "Inside the ceasefire protest at the Scottish Labour conference",
        "description": "THE Scottish Labour conference may have voted in favour of an immediate ceasefire on Saturday, but it wasn’t enough to deter thousands"
    },
    {
        "url": "https://news.sky.com/story/scottish-labour-unanimously-backs-immediate-ceasefire-in-gaza-13073951",
        "title": "Scottish Labour unanimously backs immediate ceasefire in Gaza",
        "description": "Scottish Labour leader Anas Sarwar said he was &quot;proud&quot; the party had passed the motion. But it puts the party branch at odds with Sir Keir Starmer, who has called for a &quot;sustainable&quot; ceasefire instead."
    },
    {
        "url": "https://www.thetimes.co.uk/article/nicola-sturgeon-leaves-snp-with-a-class-problem-as-affluent-voters-flee-hv6kpwzpk",
        "title": "Is this Nicola Sturgeon’s legacy? Middle classes desert the <b>SNP</b>",
        "description": "A new analysis of opinion surveys shows that the middle classes have drifted away from the party towards Labour since the former first minister’s resignation"
    },
    {
        "url": "https://www.holyrood.com/news/view,anas-sarwar-signals-labour-support-for-gaza-ceasefire-ahead-of-vote-on-snp-motion",
        "title": "Anas Sarwar signals Labour support for Gaza ceasefire ahead of vote on <b>SNP</b> motion",
        "description": "Scottish Labour leader Anas Sarwar has said there is now “no distance” between him and Keir Starmer on calling for a"
    },
    {
        "url": "https://www.theargus.co.uk/news/national/24126554.snp-motion-gaza-ceasefire-pretty-reasonable---sarwar/",
        "title": "<b>SNP</b> motion on Gaza ceasefire is ‘pretty reasonable’ – Sarwar",
        "description": "The Scottish Labour leader stopped short of confirming whether he will whip Scottish Labour MPs to back the motion."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/snp-motion-on-gaza-ceasefire-is-pretty-reasonable-sarwar-110753/",
        "title": "<b>SNP</b> motion on Gaza ceasefire is ‘pretty reasonable’ – Sarwar",
        "description": "The Scottish Labour leader stopped short of confirming whether he will whip Scottish Labour MPs to back the motion."
    }
]