[
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-speaker-gaza-mps-labour-b2500329.html",
        "title": "Commons Speaker under pressure after Gaza vote chaos",
        "description": "The motion was approved but only after Sir Lindsay Hoyle upended parliamentary convention by selecting Labour’s bid to amend an <b>SNP</b> motion on the Israel-Hamas war. His decision sparked fury from the Conservative and <b>SNP</b> benches, who accused him of ..."
    },
    {
        "url": "https://www.newsletter.co.uk/news/politics/snp-motion-in-commons-was-a-denial-of-hamas-attack-on-israel-says-dups-ian-paisley-as-idf-operations-in-gaza-continue-4528468",
        "title": "<b>SNP</b> motion in Commons was a &#39;denial&#39; of Hamas attack on Israel, says DUP&#39;s Ian Paisley as IDF operations in Gaza continue",
        "description": "The <b>SNP</b> motion called for “an immediate ceasefire in Gaza and Israel” and noted “with shock and distress that the death toll has now risen beyond 28,000, the vast majority of whom were women and children”. Did you know with a Digital Subscription ..."
    },
    {
        "url": "https://news.sky.com/story/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm-13077878",
        "title": "What happened in the Commons today - and can the Speaker be sacked?",
        "description": "Despite anger from his clerk, and feathers being spat by a number of MPs, Sir Lindsay decided both the government and Labour&#39;s amendments to the SNP&#39;s motion could and would be voted on, claiming he wanted to give the House as many options as possible when debating such an emotive topic."
    },
    {
        "url": "https://www.huffingtonpost.co.uk/amp/entry/lindsay-hoyle-fighting-for-survival-after-controversial-ruling-sparks-snp-fury_uk_65d64cf8e4b0cc1f2f7a7b6d/",
        "title": "Lindsay Hoyle Fighting For Survival After Controversial Ruling Sparks <b>SNP</b> Fury",
        "description": "Lindsay Hoyle is fighting for survival after <b>SNP</b> and Tory MPs declared they had no confidence in him continuing as Commons Speaker following a day of chaos in parliament. A total of 33 of them have so far signed an early day motion outlining their ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/speaker-gaza-commons-lyndsay-hoyle-votes-b2500204.html?page=3",
        "title": "Sir Lindsay Hoyle faced with motion of no confidence over House of Commons chaos - live",
        "description": "It centred on his decision to allow break convention and select Labour’s bid to amend the <b>SNP</b> motion calling for an “immediate ceasefire” in Gaza and Israel, which was later passed without vote. Commons Leader Penny Mordaunt claimed Sir Lindsay had ..."
    },
    {
        "url": "https://uk.news.yahoo.com/uk-parliament-plunged-chaos-over-234329678.html",
        "title": "UK parliament plunged into chaos over Gaza ceasefire vote",
        "description": "Lawmakers from the governing Conservatives and the opposition Scottish National Party (<b>SNP</b>) left the debating chamber in protest and some tried to take the rare step of holding proceedings in private. The speaker, Lindsay Hoyle, eventually apologised and ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?filterKeyEvents=false&page=with:block-65d67f218f088e120023e7b8",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – UK politics live",
        "description": "Labour amendment calling for immediate Gaza ceasefire passes after government and <b>SNP</b> walkout Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages and respond to some in this live ..."
    },
    {
        "url": "https://www.newstatesman.com/politics/uk-politics/2024/02/labours-uneasy-victory-over-gaza",
        "title": "When the lights went out",
        "description": "Support 110 years of independent journalism. Shadow cabinet ministers are asking why it took an <b>SNP</b> motion for the party to shift its position on a ceasefire. By Freddie Hayward “Disaster averted” was the appraisal of one shadow cabinet minister."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13110559/Half-children-obese-overweight-age-14.html",
        "title": "Half of children now obese or overweight by age 14",
        "description": "Scotland is in the grip of a childhood obesity epidemic with at least half now believed to be dangerously overweight by the age of 14."
    },
    {
        "url": "https://www.iwradio.co.uk/news/video/why-was-the-commons-in-chaos-and-will-the-speaker-survive-the-storm/",
        "title": "Why was the Commons in chaos - and will the Speaker survive the storm?",
        "description": "And how did the Speaker, Sir Lindsay Hoyle, find himself at the centre of the furore? As the third largest party in the Commons, the <b>SNP</b> is entitled to three opposition days in parliament every session - letting them pick the topic to be debated on the ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/21/lindsay-hoyle-brink-labour-gaza-ceasefire-vote-snp/",
        "title": "Lindsay Hoyle on brink after Labour Gaza vote walkout",
        "description": "Speaker accused of favouring his old party after alleged lobbying by Sir Keir as 33 MPs put name to &#39;no-confidence motion&#39;"
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68362405.amp",
        "title": "Gaza ceasefire vote: Commons debate descends into chaos",
        "description": "A Commons debate on calls for a ceasefire in Gaza descended into chaos, after the Speaker was accused of allowing it to be &quot;hijacked&quot; by Labour. Sir Lindsay Hoyle sparked fury from the SNP and Conservatives when he broke with convention to allow a vote on a Labour motion for an &quot;immediate humanitarian ceasefire&quot;."
    },
    {
        "url": "https://inews.co.uk/news/politics/lindsay-hoyle-position-precarious-commons-gaza-chaos-2919901?ITO=msn",
        "title": "Lindsay Hoyle’s position is precarious after Commons Gaza chaos",
        "description": "But it does make Sir Lindsay’s position as Speaker precarious. His apology was welcomed by the Commons Leader, Penny Mordaunt, and he will attempt to smooth things over with leaders and chief whips from all parties in the coming days. Yet Conservative and SNP MPs remain unhappy, and there are moves for a vote of no confidence in the Speaker."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68358524",
        "title": "Rafah ground offensive ‘must not happen’ - Lammy",
        "description": "Shadow Foreign Secretary David Lammy has led the Labour Party&#39;s calls for an “immediate humanitarian ceasefire” in Gaza in the House of Commons"
    },
    {
        "url": "https://www.scotsman.com/news/politics/snps-stephen-flynn-calls-for-investigation-following-chaotic-gaza-vote-4528450",
        "title": "<b>SNP</b>’s Stephen Flynn calls for investigation following chaotic Gaza vote",
        "description": "Stephen Flynn has called for an investigation into the chaos in the Commons on Wednesday following a debate on Gaza led by his party."
    },
    {
        "url": "https://www.irishnews.com/news/uk/house-of-commons-gaza-debate-what-happened-during-the-chambers-day-of-chaos-LK6WMNSGP5OTHL2WCBATZFZSZQ/",
        "title": "House of Commons Gaza debate: What happened during the chamber’s day of chaos?",
        "description": "What was meant to be a discussion about the UK’s policy on the Hamas-Israel conflict spiralled into heated exchanges on the Speaker’s actions."
    },
    {
        "url": "https://www.libdemvoice.org/ed-on-tonights-drama-in-parliament-we-need-an-urgent-end-to-the-humanitarian-catastrophe-74704.html",
        "title": "Ed on tonight’s drama in Parliament: We need an urgent end to the humanitarian catastrophe",
        "description": "So I managed to sleep thoughout tonight’s drama. Waking up to a phone glowing with WhatsApp messages, I realised there had been a bit of a rammy in the Commons. I checked out the BBC summary and my immediate and instinctive reaction is that the Speaker had been right to allow votes on three"
    },
    {
        "url": "https://news.sky.com/story/speaker-clinging-on-to-job-as-33-mps-sign-no-confidence-motion-after-commons-gaza-vote-descends-into-row-13077779",
        "title": "Speaker clinging on to job as 33 MPs sign no-confidence motion after Commons Gaza vote descends into row",
        "description": "An SNP opposition day starts with a row over Sir Lindsay Hoyle&#39;s decision to select a Labour amendment and ends with a mass walkout of MPs."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/happened-house-commons-gaza-ceasefire-vote-chaos-explained-20323752/?ico=trending-post-strip_item_1",
        "title": "What happened with UK Gaza ceasefire vote as Lindsay Hoyle’s future is questioned",
        "description": "The vote, which didn’t see individual MP’s votes recorded, came after a day of political wrangling between Labour and the <b>SNP</b>. Speaker of the House, Sir Lindsay Hoyle, was forced to return and apologise for selecting amendments by both Labour and the ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/gaza-ceasefire-vote-descends-into-chaos-and-anger-as-snp-and-tories-walk-out-2919643?ico=related_article_inline",
        "title": "Gaza ceasefire vote descends into chaos and anger as <b>SNP</b> and Tories walk out",
        "description": "But the result came only after scenes of chaos and bitter political point-scoring which saw Tory MPs call for a vote of confidence in Sir Lindsay Hoyle and a mass walkout by <b>SNP</b> members. The Speaker, who had not been in the Chair for the later stages of ..."
    },
    {
        "url": "https://metro.co.uk/2024/02/21/results-uks-gazas-ceasefire-vote-revealed-20323318/?ico=trending-post-strip_item_4",
        "title": "UK government votes to call for an ‘immediate ceasefire’ in Gaza",
        "description": "Pro-Palestinian demonstrators are marching outside of parliament ahead of the vote (Picture: HENRY NICHOLLS/AFP) MPs have voted to call for an immediate ceasefire in Gaza after a day of political wrangling between Labour and the <b>SNP</b>. The UK government ..."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/21/wednesday-evening-news-briefing-tory-mp-no-confidence-gaza/?n=@",
        "title": "Wednesday evening news briefing: Tory MP tables motion of no confidence in Hoyle over handling of Gaza debate",
        "description": "The Commons Speaker took the highly unusual step of selecting both a Labour amendment and a Government amendment to an <b>SNP</b> motion calling for an immediate ceasefire in Gaza. The decision to select the Labour amendment was greeted in the Commons by Tory ..."
    },
    {
        "url": "https://uk.news.yahoo.com/house-commons-sinks-chaos-over-212311445.html",
        "title": "House of Commons Sinks Into Chaos Over Israel-Hamas War Vote",
        "description": "Hoyle’s move meant Starmer avoided what threatened to be a destabilizing rebellion by members of his party, because it meant his MPs could back his carefully chosen wording rather than language put forward by the <b>SNP</b>. Starmer has been battling to keep ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/21/kemi-badenoch-post-office-scandal-rishi-sunak-keir-starmer-pmqs-uk-politics-live?filterKeyEvents=true&page=with:block-65d67f218f088e120023e7b8",
        "title": "More than 30 MPs sign motion of no confidence in Commons speaker – UK politics live",
        "description": "Labour amendment calling for immediate Gaza ceasefire passes after government and <b>SNP</b> walkout Please note: This is not a public comment – only the Guardian can see your message. Our writers will monitor these messages and respond to some in this live ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/gaza-labour-snp-hamas-house-of-commons-b1140715.html",
        "title": "Labour amendment pushing for immediate Gaza ceasefire passes amid Commons chaos",
        "description": "<b>SNP</b> MPs and some Conservatives walked out of the chamber in protest at Speaker Sir Lindsay Hoyle’s handling of the Gaza ceasefire debate. Commons Leader Penny Mordaunt pulled the Government’s participation, claiming Sir Lindsay had “hijacked” the ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/speaker-gaza-commons-lyndsay-hoyle-votes-b2500211.html",
        "title": "Commons Speaker Sir Lindsay Hoyle facing calls to resign after Gaza debate descends into chaos",
        "description": "Sir Lindsay Hoyle is under pressure to stand down as speaker following chaos in the Commons when Conservative and <b>SNP</b> MPs walked out in protest at his handling of the much-talked about Gaza ceasefire vote. A total of 33 MPs have signed a motion of no ..."
    },
    {
        "url": "https://www.thenational.scot/news/24135758.police-respond-claim-labour-glasgow-office-stormed/",
        "title": "Police respond to claim that Labour Glasgow office was &#39;stormed&#39;",
        "description": "The Labour MSP’s initial post to Twitter/X was in response to a claim by the i newspaper’s senior political correspondent Chloe Chaplain saying she was told that Speaker Lindsay Hoyle’s decision to exceptionally allow a Labour amendment to the <b>SNP</b> ..."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hd9g51",
        "title": "Disorder Disorder in the House of Commons",
        "description": "A row erupted after the Commons Speaker allowed MPs to vote on a Labour motion on the Israel-Hamas conflict. The <b>SNP</b> and Conservatives accused Sir Lindsay Hoyle of breaking with precedent for allowing the votes - and chaos ensued. Plus a row over who said ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/20/post-office-horizon-scandal-conservatives-kemi-badenoch-rishi-sunak-uk-politics-live?filterKeyEvents=true&page=with:block-65d492ab8f08a8115d73e885",
        "title": "<b>SNP</b> welcomes Labour call for ‘immediate humanitarian ceasefire’ in Gaza, claiming it forced Starmer into U-turn – as it happened",
        "description": "Stephen Flynn says decision by Labour is ‘long-overdue’ and Starmer was forced into position by public pressure and the <b>SNP</b>. This live blog is closed MPs should “vote with your conscience for an immediate ceasefire”, the <b>SNP</b>’s Westminster leader ..."
    }
]