[
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/22/islamism-suella-braverman-gaza-ceasefire-lindsay-hoyle/",
        "title": "Suella Braverman says Islamists are in charge of Britain now",
        "description": "By Thursday evening, more than 67 MPs had signed a motion declaring no confidence in Sir Lindsay. Stephen Flynn, the <b>SNP</b>’s Commons leader, and some Tory rebels are trying to oust the Speaker by forcing a no-confidence vote. In his apology to the Commons ..."
    },
    {
        "url": "https://news.sky.com/story/commons-speaker-mps-who-support-sir-lindsay-hoyle-probably-outnumber-those-who-want-him-out-13078558",
        "title": "Commons Speaker: MPs who support Sir Lindsay Hoyle probably outnumber those who want him out",
        "description": "&quot;I don&#39;t want anything to happen again,&quot; he added. So his defence is that in agreeing to put all three ceasefire options - from the <b>SNP</b>, Labour and the government - to a vote on Wednesday he acted for the best of motives. And that defence appears to be ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24138610.scotland-will-never-get-fair-hearing-corrupt-westminster/",
        "title": "Scotland will never get a fair hearing in corrupt Westminster",
        "description": "Yesterday afternoon MPs were due to begin a debate on the <b>SNP</b>&#39;s motion calling for an immediate ceasefire in Gaza, which described Israel&#39;s actions in the territory as a form of “collective” punishment of the population of Gaza for the actions of Hamas ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-accusations-against-starmer-complete-garbage-speaker-probably-safe-in-role-12593360",
        "title": "Politics latest: Accusations against Starmer &#39;complete garbage&#39;; Speaker &#39;probably safe&#39; in role",
        "description": "Rishi Sunak has joined the legion of Tory and <b>SNP</b> MPs who have criticised the Commons Speaker over his handling of votes on a ceasefire in Gaza, but a no confidence motion in him appears to be petering out. Meanwhile, Keir Starmer has denied applying undue ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/hoyle-warned-he-cannot-make-another-mistake-as-more-than-60-mps-pull-support-2921924?ico=related_article_inline",
        "title": "Sir Lindsay Hoyle warned he ‘cannot make another mistake’ as more than 60 MPs pull support",
        "description": "The SNP has officially withdrawn support of the Speaker - and the PM and Commons leader have boith urged Hoyle to &#39;reflect&#39; on his actions over the Gaza ceasefire vote"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/24138668.north-east-mps-joined-call-speaker-quit-gaza-vote/",
        "title": "North East MPs who joined call for Speaker to quit over Gaza vote",
        "description": "This evening (Thursday, Februarhy 22), the total number of signatures stood at 67, including Sir Graham Brady, chairman of the 1922 Committee of Conservative backbenchers, former Tory deputy chairmen Lee Anderson and Brendan Clarke-Smith, the <b>SNP</b>’s ..."
    },
    {
        "url": "https://uk.news.yahoo.com/three-north-east-tory-mps-194948941.html",
        "title": "Three North East Tory MPs join call for Speaker to quit over Gaza vote",
        "description": "This evening (Thursday, Februarhy 22), the total number of signatures stood at 67, including Sir Graham Brady, chairman of the 1922 Committee of Conservative backbenchers, former Tory deputy chairmen Lee Anderson and Brendan Clarke-Smith, the <b>SNP</b>’s ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mps-environmental-audit-committee-philip-dunne-commons-william-wragg-b1140979.html",
        "title": "More than 60 MPs call for Speaker to quit over Gaza vote",
        "description": "Sir Lindsay Hoyle has faced calls to step down as Speaker over his handling of the <b>SNP</b>’s motion on Gaza (Hannah McKay/PA) More than 60 MPs have now signed a motion expressing no confidence in the Speaker after angry scenes in the Commons on Wednesday."
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/mps-who-called-sir-lindsay-28687582",
        "title": "The MPs who have called for Sir Lindsay Hoyle to quit",
        "description": "Dozens of Conservative and <b>SNP</b> MPS have backed a motion demanding the removal of Sir Hoyle from the seat. He caused controversy when broke convention and allowed a Labour amendment that called for an &quot;immediate humanitarian ceasefire&quot; that must be observed ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/government-only-told-of-grangemouth-closure-at-same-time-as-workers-minister-b1140954.html",
        "title": "Government only told of Grangemouth closure at same time as workers – minister",
        "description": "First look at exceptional new London properties for sale in 2024 Scottish Conservative energy spokesman Douglas Lumsden said: “News of the Grangemouth transition announced in November was shocking to many of its workers, but not to the <b>SNP</b> Government who ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/lindsay-hoyle-house-of-commons-speaker-mps-history-b2500918.html",
        "title": "Speaker’s role throughout history from beheadings to revolting MPs",
        "description": "House of Commons Speaker Sir Lindsay Hoyle has apologised for his handling of the Gaza ceasefire debate, which descended into acrimony after he upended parliamentary convention to approve a Labour amendment on the <b>SNP</b> opposition day motion. Sir Lindsay ..."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/22/lindsay-hoyle-rishi-sunak-criticises-speakers-concerning-choice-gaza-vote",
        "title": "Lindsay Hoyle fights back as Sunak criticises speaker’s ‘concerning’ choice",
        "description": "Hoyle is under pressure after 67 Conservative and <b>SNP</b> MPs signed a motion calling for a vote of no confidence in him. The furore erupted on Wednesday when Hoyle changed parliamentary procedure to allow a Labour amendment on Gaza to be debated to help stave ..."
    },
    {
        "url": "https://www.thescottishsun.co.uk/sport/12033506/john-mcginn-scotland-scottish-golf-course-saved-dalmuir-macintyre/",
        "title": "John McGinn-backed social media campaign pays off as closure-threatened Scottish golf course SAVED at 11th hour",
        "description": "&quot;We are the last line of defence against <b>SNP</b> underfunding of local councils.&quot; McAllister added later: &quot;We won’t reduce the size of the course. The Labour group are committed to this. &quot;Hope that helps to clarify matters and allay fears. 100% Guarantee."
    },
    {
        "url": "https://inews.co.uk/news/politics/hoyle-warned-he-cannot-make-another-mistake-as-more-than-60-mps-pull-support-2921924",
        "title": "Hoyle warned he ‘cannot make another mistake’ as more than 60 MPs pull support",
        "description": "Westminster&#39;s third-largest party, the SNP, has officially pulled its support of the Speaker and the Prime Minister and Commons leader have urged Hoyle to &#39;reflect&#39; on his actions over the Gaza ceasef"
    },
    {
        "url": "https://www.thetimes.co.uk/article/what-happened-house-commons-lindsay-hoyle-labour-gaza-ceasefire-hx8865dn5?ilc=timesradio:morefromthetimes",
        "title": "What did Sir Lindsay Hoyle do — and can he be forced to resign?",
        "description": "Sir Lindsay Hoyle is being criticised by Conservative and <b>SNP</b> MPs for his handling of a debate on the Israel-Hamas conflict. This is what you need to know about the row and why it matters. The Speaker broke with parliamentary precedent by allowing Labour ..."
    },
    {
        "url": "https://news.sky.com/story/uk-politics-sunak-starmer-general-election-vote-labour-tories-speaker-sky-news-politics-hub-12593360?postid=7270872",
        "title": "Politics latest: Sunak criticises Speaker&#39;s &#39;very concerning&#39; handling of Gaza ceasefire votes",
        "description": "Prime Minister Rishi Sunak has joined the legion of Tory and <b>SNP</b> MPs who have criticised the Commons Speaker over his handling of votes on a ceasefire in Gaza, with the motion of no confidence in him attracting dozens of signatories. News is moving fast ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24138433.michael-matheson-saga-set-drag---happens-next/?ref=rss",
        "title": "Michael Matheson saga set to drag on - what happens next?",
        "description": "Michael Matheson has today being given an extension to respond to a Holyrood report into his £11,000 bill for his parliamentary iPad racked"
    },
    {
        "url": "https://www.thenational.scot/politics/24138599.speaker-keir-starmer-questions-answer-meeting/",
        "title": "Speaker and Keir Starmer both have questions to answer about meeting",
        "description": "Both Starmer and the Speaker have questions to answer. Labour have had at least eight Opposition Days since the last <b>SNP</b> day and Gaza was not raised once. But lo and behold, along comes the <b>SNP</b> day and Starmer, fearing the embarrassment of MPs voting for ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24138594.reason-snp-mps-retake-seats-commons/",
        "title": "Is there any reason for <b>SNP</b> MPs to retake their seats in the Commons?",
        "description": "AFTER Wednesday’s chaos in the House of Common, <b>SNP</b> Westminster leader Stephen Flynn boldly stated that he (and presumably the rest of the <b>SNP</b> group) have no confidence in the Speaker of the House. This raises a rather obvious question: if they have no ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68368320",
        "title": "Speaker&#39;s handling of Gaza vote very concerning, says Rishi Sunak",
        "description": "Prime Minister Rishi Sunak has said Sir Lindsay Hoyle&#39;s decision to depart from convention during a debate on the Gaza conflict was &quot;very concerning&quot;. The Commons Speaker is facing pressure to quit, after chaotic scenes in Parliament and acrimonious debate."
    },
    {
        "url": "https://www.bbc.co.uk/programmes/p0hdjdwd",
        "title": "Erskine Mayday",
        "description": "Chaos in the House of Commons as a vote on a Gaza ceasefire motion turns into a row."
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/22/mordaunt-meets-labours-olive-twig-with-theatrical-fury-after-gaza-omnishambles",
        "title": "Mordaunt meets Labour’s olive twig with theatrical fury after Gaza omnishambles",
        "description": "They could hardly be blamed for trying it on. But then no one was totally guilt-free. The <b>SNP</b> had chosen the Gaza motion as much to embarrass Labour as anything else. It wasn’t as if the result of the vote would make a blind bit of difference to Israel ..."
    },
    {
        "url": "https://www.dailymail.co.uk/debate/article-13114305/RICHARD-LITTLEJOHN-politicians-lost-plot-human-tragedy-Israel-Gaza.html",
        "title": "RICHARD LITTLEJOHN: Self-obsessed. Grandstanding. Our political class has lost the plot and tried to make the tragedy of Israel and Gaza all about THEM",
        "description": "Not for the first time, the politicians have taken complete leave of their senses. They have managed to make the human tragedy unfolding in Israel and Gaza all about them."
    },
    {
        "url": "https://uk.news.yahoo.com/msps-back-scottish-government-plans-175708202.html",
        "title": "MSPs back Scottish Government plans to create new tax bracket for higher earners",
        "description": "READ MORE: <b>SNP</b> demand investigation into Speaker&#39;s conduct over Gaza ceasefire motion The Scottish Fiscal Commission (SFC) forecasts the tax changes will bring in £1.5 billion in revenue funding next year alone, although its chair said “tough decisions ..."
    },
    {
        "url": "https://www.business-live.co.uk/economic-development/uk-taxpayers-not-cover-extra-28687324",
        "title": "UK taxpayers will not have to cover extra Hinkley Point C costs, minister insists",
        "description": "He was speaking during a backbench debate in the commons on the government’s civil nuclear road map. Speaking for the <b>SNP</b>, Hannah Bardell told the house that Hinkley Point C is “not value for money” and that costs are “staggering”."
    },
    {
        "url": "https://www.heraldscotland.com/news/24131542.labour-call-immediate-humanitarian-ceasefire-gaza/?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "Labour to call for &#39;immediate humanitarian ceasefire&#39; in Gaza",
        "description": "Labour MPs have been told to back the party’s call for an &quot;immediate humanitarian ceasefire&quot; in Gaza rather than the <b>SNP</b>’s “immediate ceasefire” in tomorrow’s vote. It is a significant shift for Sir Keir Starmer and his shadow cabinet ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/labour-calls-immediate-humanitarian-ceasefire-32169637?0=utm_source=ground.news&1=utm_medium=referral",
        "title": "Labour calls for ‘immediate humanitarian ceasefire’ in Gaza",
        "description": "Labour has called for an “immediate humanitarian ceasefire” in the Israel-Hamas conflict in a major shift in the party’s stance on the war. The party has tabled an amendment to the <b>SNP</b>’s ceasefire in Gaza motion, to be voted on in the House of Commons on Wednesday."
    },
    {
        "url": "https://www.politicshome.com/news/article/labour-calls-humanitarian-ceasefire-gaza-ahead-israels-rafah-offensive",
        "title": "Labour Hopes To Avert Ceasefire Vote Showdown With New Gaza Amendment",
        "description": "Labour will order its MPs to abstain on the <b>SNP</b>&#39;s Gaza ceasefire motion on Wednesday, instead whipping its MPs to back an amendment calling for &quot;an immediate humanitarian ceasefire&quot; in Gaza in a bid to avoid a showdown with its own MPs. PoliticsHome ..."
    },
    {
        "url": "https://www.helensburghadvertiser.co.uk/news/24137826.snp-mp-brands-trident-missile-test-misfire-expensive-failure/",
        "title": "<b>SNP</b> MP brands Trident missile test misfire expensive failure",
        "description": "Martin Docherty-Hughes, West Dunbartonshire <b>SNP</b> MP, said: &quot;This was a seriously expensive failure and one that is symptomatic of the UK Government’s wider defence spending and strategy. “The financial burden imposed by Trident renewal is enormous and ..."
    }
]