[
    {
        "url": "https://www.express.co.uk/news/politics/1863819/Who-is-mhairi-fraser-tory-candidate-epsom",
        "title": "Mhairi Fraser: Rising star with key role at Liz Truss’s &#39;Popular Conservatives&#39; launch",
        "description": "While well-known MPs spoke at the launch of Liz Truss&#39;s Popular Conservatism event, there was one unknown rising star among the line-up: Mhairi Fraser."
    },
    {
        "url": "https://www.thenational.scot/politics/24102390.supine-distasteful-rishi-sunak-believes-human-life-cheap/",
        "title": "Supine and distasteful Rishi Sunak believes human life is cheap",
        "description": "Michael Shanks was elected on the basis he was his “own man”, with a rhetoric that echoed the weasel words of Anas Sarwar, but on arriving in Westminster he –immediately fell into line with Keir Starmer’s policy on Gaza by not backing an <b>SNP</b> motion ..."
    },
    {
        "url": "https://www.northern-times.co.uk/news/jamie-halcro-johnston-snps-nearly-80-million-in-cuts-will-341491/",
        "title": "Jamie Halcro Johnston: <b>SNP</b>&#39;s nearly £80 million in cuts will hit rural Scotland hard",
        "description": "He says &#39;decisions by SNP and Green ministers in Edinburgh that will have a real impact on life here in the Highlands.&#39;"
    },
    {
        "url": "https://www.thenational.scot/news/24102334.steve-bakers-irish-vote-claim-prompts-anger-scottish-independence-position/",
        "title": "Steve Baker&#39;s Irish vote claim prompts anger over Scottish independence position",
        "description": "Tommy Sheppard, the <b>SNP</b>’s Scotland spokesperson, said the minister’s admission showed the need for Scotland to have a formal mechanism to decide its membership of the Union as Northern Ireland has. READ MORE: New Scottish independence poll gives Yes ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68217946",
        "title": "Drugs minister Elena Whitham quits due to post-traumatic stress",
        "description": "Drugs and Alcohol Policy Minister Elena Whitham has resigned from the Scottish government for health reasons. The SNP MSP for Carrick, Cumnock and Doon Valley said she was receiving treatment for post-traumatic stress. She said the condition had &quot;greatly&quot; affected her wellbeing."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/scottish-news/24102298.scottish-government-drugs-minister-quits-health-reasons/",
        "title": "Scottish Government drugs minister quits for health reasons",
        "description": "The Scottish Government&#39;s drugs and alcohol policy minister Elena Whitham has resigned for health reasons. The <b>SNP</b> minister said that over the last year she had &quot;experienced a series of events leading to post traumatic stress&quot;. She was appointed to her ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/12008287.snp-shambles-indecision-leaves-party-vulnerable/",
        "title": "<b>SNP</b> shambles Indecision leaves party vulnerable",
        "description": "Like most teams that are committed to attack, the <b>SNP</b> has been great going forward, fleet of foot and decisive in exploiting its opponents&#39; weaknesses to secure notable victories against top-of-the-table Labour. But like most attack-minded outfits it has ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24102272.probe-snp-covid-whatsapps-look-systemic-practice-failure/",
        "title": "Probe into <b>SNP</b> Covid WhatsApps to look at &#39;systemic practice failure&#39;",
        "description": "AN investigation by Scotland’s transparency tsar into the destruction of pandemic WhatsApp messages by <b>SNP</b> ministers will investigate “serious systemic practice failure”, it has emerged. The Scottish Government confirmed that Scottish Information ..."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/02/06/michael-matheson-putting-lives-in-danger-refusing-to-quit/?n=@",
        "title": "<b>SNP</b>&#39;s Matheson ‘putting lives in danger’ by refusing to quit over iPad bill row",
        "description": "Opposition parties accuse Michael Matheson of being ‘distracted’ by the roaming charges scandal Credit: Andrew Milligan/PA The <b>SNP</b>’s health secretary has been accused of putting “lives in danger” by refusing to quit over his £11,000 roaming ..."
    },
    {
        "url": "https://www.eastlothiancourier.com/news/24102106.labour-politicians-angela-rayner-anas-sarwar-visit-east-lothian/",
        "title": "Labour politicians Angela Rayner and Anas Sarwar visit East Lothian",
        "description": "Angela Rayner, deputy leader of UK Labour, and Anas Sarwar, Scottish Labour leader, joined Douglas Alexander, the party’s candidate for the East Lothian constituency, and South Scotland MSP Martin Whitfield in Prestonpans and at Glenkinchie Distillery, near Pencaitland, on Friday."
    },
    {
        "url": "https://www.thetimes.co.uk/article/snp-has-given-me-second-thoughts-about-first-past-the-post-8pvqkcgf5",
        "title": "<b>SNP</b> has given me second thoughts about first past the post",
        "description": "And so I confess to having second thoughts about the wisdom of proportional representation (PR) for electing MPs to the House of Commons. This is despite me banging on for years that the first-past-the-post system is a stain on our democracy."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24102098.snp-budget-glasgow-will-freeze-council-tax-year/",
        "title": "<b>SNP</b> budget for Glasgow will freeze council tax this year",
        "description": "The <b>SNP</b> will propose council tax be frozen this year in Glasgow as the council leader has confirmed the administration will accept the funding terms to keep the tax at last year’s level. The deal which sees councils receive a share of £144 million to ..."
    },
    {
        "url": "https://www.fifetoday.co.uk/news/opinion/columnists/ineos-fight-is-about-preserving-our-nations-industrial-capacity-4507904",
        "title": "Ineos fight is about preserving our nation’s industrial capacity",
        "description": "In my younger years, my skates-in-hand Saturday trek went from the ice rink down St. Clair St, Junction Road, Factory Road and along Nairn Street. I’d then wind my way through the old mill buildings above Pathhead and on down to the High Street."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/scottish-government-drugs-minister-elena-32062744",
        "title": "Scottish Government drugs minister Elena Whitham resigns for health reasons",
        "description": "The Scottish Government’s drugs and alcohol policy minister Elena Whitham has resigned for health reasons. The SNP minister said that over the last year she had “experienced a series of events leading to post traumatic stress”. She was appointed to her current role in Humza Yousaf’s Government in March last year."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/scots-solicitors-could-boycott-rape-32062324",
        "title": "Scots solicitors could boycott rape cases in protest at jury-less trials, <b>SNP</b> ministers warned",
        "description": "Brown told MSPs on Holyrood’s Criminal Justice Committee it was the pilot for judge-only trials in rape and attempted rape cases that they were concerned about. With more than 400 lawyers in the SSBA, he said the organisation was “currently polling at over 97 per cent of our members refusing to take part”."
    },
    {
        "url": "https://www.dailyecho.co.uk/news/national/24099945.sunak-admits-not-betting-person-amid-criticism-rwanda-wager/",
        "title": "Sunak admits he is ‘not a betting person’ amid criticism over Rwanda wager",
        "description": "Rishi Sunak shook hands on a £1,000 wager with broadcaster Piers Morgan about flights to Rwanda leaving before the election."
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/nicky-campbell-jumped-chance-itvs-32059847.amp",
        "title": "Nicky Campbell jumped at chance to do ITV&#39;s Masked Singer after &#39;hardest year of his life&#39;",
        "description": "Wares&#39; identity was made public following arguments from the media and after <b>SNP</b> MP Ian Blackford named him in the House of Commons. Just before Christmas, five men, aged between 69 and 90, were charged in connection with alleged, non-recent, abuse ..."
    },
    {
        "url": "https://uk.news.yahoo.com/snp-criminal-record-prisons-172537752.html",
        "title": "The <b>SNP</b> and their criminal record on prisons",
        "description": "And there, in response, was the <b>SNP</b> Justice Secretary Angela Constance, acknowledging the situation and insisting everything had been done to reduce the risk of a crisis. The next day, in response to a question from Tory MSP Russell Findlay, Ms Constance ..."
    },
    {
        "url": "https://uk.news.yahoo.com/snp-budget-glasgow-accept-funding-170027770.html",
        "title": "<b>SNP</b> budget for Glasgow will accept funding to freeze council tax",
        "description": "The <b>SNP</b> will propose council tax be frozen this year in Glasgow as the council leader has confirmed the administration will accept the funding terms to keep the tax at last year’s level. The deal which sees councils receive a share of £144 million to ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/sunak-defends-rwanda-bet-piers-morgan-b2491392.html",
        "title": "Rishi Sunak defends £1,000 Rwanda bet for ‘showing commitment’",
        "description": "Labour, the Liberal Democrats and the <b>SNP</b> all condemned Mr Sunak’s hand-shake with TalkTV host Piers Morgan – with the Scottish national party reporting Mr Sunak over a potential breach of the ministerial code. Mr Morgan and Mr Sunak agreed the £1,000 ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=true&page=with:block-65c0dd0a8f0887442867e4c5",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "<b>SNP</b> condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’. This live blog is closed Rishi Sunak has been widely criticised for accepting a £1,000 bet with TalkTV presenter Piers Morgan relating to whether he will manage to ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24102232.bbc-disclosure-shows-snps-record-prisons-criminal/?ref=rss",
        "title": "BBC Disclosure shows <b>SNP</b>&#39;s record on prisons is criminal",
        "description": "It wasn’t déjà vu, but it was uncanny. Watching Monday’s BBC Disclosure documentary about prison overcrowding in Scotland was a vivid"
    },
    {
        "url": "https://www.holdthefrontpage.co.uk/2024/news/row-erupts-over-plan-to-give-child-criminals-lifetime-anonymity/",
        "title": "Row erupts over plan to give child criminals lifetime anonymity",
        "description": "Editors are fighting proposals which would give lifetime anonymity to any person under 18 convicted of a crime."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11928472/snp-minister-told-to-grip-crisis-in-nhs/",
        "title": "Embattled <b>SNP</b> minister told to ‘get to grips’ with crisis in NHS",
        "description": "UNDER-fire Health Secretary Michael Matheson has been accused of being “missing in action” with key performance figures hitting grim levels amid his iPad scandal. Latest stats revealed there were"
    },
    {
        "url": "https://www.christian.org.uk/news/doctors-most-in-favour-of-assisted-suicide-least-involved-in-care-of-dying/",
        "title": "‘Doctors most in favour of assisted suicide least involved in care of dying’",
        "description": "Canvassed for her views, the <b>SNP</b> MSP told The Herald on Sunday: “I don’t see how this legislation can be safe while disabled people don’t have equality”. Last year, Scotland’s First Minister and Health Secretary both publicly restated their ..."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/rishi-sunak-rwanda-government-piers-morgan-prime-minister-b2491277.html",
        "title": "Sunak admits he is ‘not a betting person’ amid criticism over Rwanda wager",
        "description": "Rishi Sunak shook hands on a £1,000 wager with broadcaster Piers Morgan about flights to Rwanda leaving before the election."
    },
    {
        "url": "https://www.scotsman.com/news/transport/three-days-free-bus-travel-is-a-first-in-fife-as-councillors-spend-ps18000-in-new-initiative-4507429",
        "title": "Three days free bus travel is a first in Fife as councillors spend £18,000 in new initiative",
        "description": "For the first time ever, the City of Dunfermline is offering three free days of bus travel in March. Rather than running a free car parking scheme, the local area committee will be offering free bus travel on certain weekends in March."
    },
    {
        "url": "https://www.thenational.scot/news/24101195.stephen-flynn-hopeful-constitutional-convention-election/",
        "title": "Stephen Flynn &#39;hopeful&#39; of constitutional convention after election",
        "description": "STEPHEN Flynn has said he is “hopeful” that a constitutional convention on independence will go ahead - but warned that the looming"
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/nicky-campbell-jumped-chance-itvs-32059847",
        "title": "Nicky Campbell jumped at chance to do ITV&#39;s Masked Singer after &#39;hardest year of his life&#39;",
        "description": "The Masked Singer star Nicky Campbell has shared the heartbreaking reason why he was so eager to appear on the ITV1 show after enduring the most difficult year of his life"
    },
    {
        "url": "https://www.standard.co.uk/news/politics/scexit-scottish-independence-uk-humza-yousaf-b1137381.html",
        "title": "What is Scexit? Scottish independence prospect revived by new report",
        "description": "Scotland&#39;s independence from the UK could pave the way for the country to have its own Eurovision entry, a new report highlights"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11928380/snp-scots-risk-police-fall/",
        "title": "<b>SNP</b> ministers ‘putting Scots at risk’ as police numbers hit lowest level in 15 years",
        "description": "POLICE numbers in Scotland are at the lowest levels since 2008, it has emerged. Official stats published by the Scottish Government show that there were 16,363 full-time equivalent cops in"
    },
    {
        "url": "https://www.holyrood.com/news/view,humza-yousaf-inherited-poisoned-chalice-from-nicola-sturgeon-says-mhairi-black",
        "title": "Humza Yousaf inherited ‘poisoned chalice’ from Nicola Sturgeon, says Mhairi Black",
        "description": "Humza Yousaf inherited a “slightly poisoned chalice” when he became First Minister of Scotland, the SNP’s depute leader at Westminster has said. Mhairi Black, who has announced her intention to stand down at the next election, said her party had faced “challenges” in recent months."
    },
    {
        "url": "https://www.birminghammail.co.uk/news/midlands-news/palestine-protesters-disrupt-labours-west-28579695",
        "title": "Palestine protesters disrupt Labour&#39;s West Midlands mayoral launch over Gaza ceasefire stance",
        "description": "Outside the venue, protesters jeered and chanted &#39;shame on you&#39; in anger over Labour&#39;s refusal to call for an immediate ceasefire in Gaza. Instead, Keir Starmer and the Labour Party is calling for a &#39;sustainable ceasefire&#39;, which includes the destruction of Hamas."
    },
    {
        "url": "https://www.thenational.scot/news/24100982.snp-mp-bid-give-disabled-people-lower-energy-bills/",
        "title": "<b>SNP</b> MP in bid to give disabled people lower energy bills",
        "description": "AN MP has passed the first hurdle in forcing the Government to give disabled people lower energy bills amid concerns they cannot afford the cost"
    },
    {
        "url": "https://www.scotsman.com/news/crime/police-scotland-officer-numbers-hit-lowest-level-in-15-years-as-humza-yousaf-told-to-step-up-4507282",
        "title": "Police Scotland: Officer numbers hit lowest level in 15 years as Humza Yousaf told to &#39;step up&#39;",
        "description": "But with the <b>SNP</b> having pledged to increase officer numbers by 1,000 in the 2007 election campaign, numbers rose to more than 17,000 during the first three months of 2009, and did not fall below this until the first quarter of 2022. The Conservatives hit ..."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/cole-hamilton-snp-not-focused-on-crisis-in-ae",
        "title": "Cole-Hamilton: <b>SNP</b> not focused on crisis in A&amp;E",
        "description": "Responding to new figures showing that just 65.6% of attendees at A&amp;E were seen within 4 hours and 15,107 attendees waited more than 8 hours in December 2023, Scottish Liberal Democrat leader and heal"
    },
    {
        "url": "https://news.stv.tv/politics/police-officer-numbers-in-scotland-reach-lowest-level-since-2008",
        "title": "Police officer numbers in Scotland reach lowest level since 2008",
        "description": "Figures from the Scottish Government showed that at the end of 2023 there were 16,262 full time equivalent officers in Scotland."
    },
    {
        "url": "https://news.stv.tv/politics/health-spending-to-fall-despite-misleading-scottish-government-claims-ifs-says",
        "title": "Health spending &#39;to fall despite misleading Scottish Government claims&#39;",
        "description": "The Institute for Fiscal Studies said spending on the NHS could drop by 0.7% in real terms in the coming year despite official documents showing a 1.3% rise."
    },
    {
        "url": "https://www.insider.co.uk/news/second-bid-ban-edinburgh-strip-32057739",
        "title": "Second bid to ban Edinburgh strip clubs defeated",
        "description": "Liberal Dempcrat convener Neil Ross tabled a joint amendment with the Greens - which was passed with support from <b>SNP</b> and Conservative councillors - to set the cap at three. It also said the city centre ward boundary would be the only location suitable to ..."
    },
    {
        "url": "https://www.bbc.com/news/uk-politics-68214641.amp",
        "title": "Rishi Sunak says he was taken by surprise on £1,000 Rwanda bet",
        "description": "Opposition parties have criticised Mr Sunak for taking the bet. The <b>SNP</b> said it had reported Mr Sunak for a potential breach of ministerial rules over the &quot;grotesque&quot; bet. The party&#39;s Cabinet Office spokeswoman, Kirsty Blackman, has written to the PM&#39;s ..."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13050791/Humza-Yousaf-says-didnt-tell-boss-Nicola-Sturgeon-collapse-marriage-fears-hed-lose-job-Minister-reveals-sat-crying-sofa-did-not-eat-drink-24-hours-split.html",
        "title": "Humza Yousaf says he didn&#39;t tell his boss Nicola Sturgeon about the collapse of his first marriage due to fears he&#39;d lose his job - as First Minister reveals he sat crying on ...",
        "description": "The Scottish First Minister - despite acknowledging Ms Sturgeon would have been &#39;perfectly understanding&#39; - pointed to a stigma around male mental health at the time."
    },
    {
        "url": "https://www.scotlibdems.org.uk/news/article/police-officer-numbers-plummet-to-record-low",
        "title": "Police officer numbers plummet to record low",
        "description": "Scottish Liberal Democrat justice spokesperson Liam McArthur MSP has today urged <b>SNP</b> ministers to get serious over the funding challenges facing policing as new figures reveal that police officer numbers are now at their lowest level since the second ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=true&page=with:block-65c0dbd78f08e58b80163b86",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "<b>SNP</b> condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’. This live blog is closed Rishi Sunak has been widely criticised for accepting a £1,000 bet with TalkTV presenter Piers Morgan relating to whether he will manage to ..."
    },
    {
        "url": "https://www.express.co.uk/showbiz/tv-radio/1863769/bbc-statement-laura-kuenssberg-biased-interview",
        "title": "BBC release statement after Laura Kuenssberg&#39;s &#39;biased&#39; interview sparked viewer backlash",
        "description": "Laura Kuenssberg recently interviewed Labour Shadow Secretary Yvette Cooper during her morning show on BBC One."
    }
]