[
    {
        "url": "https://www.dailymail.co.uk/news/article-13048441/GRAHAM-GRANT-lazy-Left-wing-tripe-progressive-tax-rises-time-Holyrood-tried-start-CUTTING-them.html",
        "title": "GRAHAM GRANT: Enough of this lazy Left-wing tripe about &#39;progressive&#39; tax rises it&#39;s time Holyrood tried to start CUTTING them",
        "description": "Is Scotland condemned to high taxes for eternity - and is any political party brave enough to make a stand against them? It&#39;s a fiction to suppose that Scots are wedded to punitive taxation."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13048587/If-SNP-believes-transparency-minister-WhatsApp-auto-delete.html",
        "title": "If <b>SNP</b> believes in transparency, minister, why is your WhatsApp on auto-delete?",
        "description": "The SNP&#39;s information minister has been forced to admit he uses an &#39;auto delete&#39; function on WhatsApp after being caught out during a live radio interview."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/scottish-news/bid-ban-strip-clubs-edinburgh-32055324",
        "title": "Bid to ban strip clubs in Edinburgh defeated for second time",
        "description": "Concerns were raised that strip clubs operating in Edinburgh increased violence against women but the move to introduce a &#39;nil cap&#39; was voted down by seven votes to two."
    },
    {
        "url": "https://www.bbc.com/news/live/world-africa-67977510?pinned_post_locator=urn:asset:00db6bf7-1149-4df4-b3d0-e71b2244f936&pinned_post_asset_id=65c0b9de57478648da6f7c92&pinned_post_type=share",
        "title": "Africa Live: Internet cut amid Senegal protests over poll delay",
        "description": "Mobile internet access has been temporarily cut in Senegal, the government announced on Monday, a day after hundreds protested President Macky Sall&#39;s postponement of the presidential election."
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rishi-sunak-piers-morgan-talktv-nhs-tory-b2490614.html",
        "title": "Rishi Sunak: I can’t keep pledge to reduce NHS waiting lists",
        "description": "PM takes a huge political gamble by admitting he’s failed to deliver key election promise – and sparks outrage by accepting £1,000 bet on live TV that he won’t fail on Rwanda flights"
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/05/humza-yousaf-opens-up-about-mental-health-crisis/",
        "title": "Humza Yousaf: marriage split left me crying on sofa in ‘state of breakdown’",
        "description": "First Minister says he kept his mental health struggles in 2016 secret because of fears it would cost him his job as transport minister"
    },
    {
        "url": "https://www.thenational.scot/politics/24099494.scots-robbed-history-folk-memories-industries/",
        "title": "Scots have been been robbed our history, folk memories and industries",
        "description": "KENNY MacAskill’s excellent article in Monday’s National on Scottish working-class mass action in the last century raised many points,"
    },
    {
        "url": "https://news.sky.com/story/sunak-accused-of-making-depraved-bet-with-piers-morgan-on-rwanda-plan-13064894",
        "title": "Sunak accused of making &#39;depraved bet&#39; with Piers Morgan on Rwanda plan",
        "description": "Rishi Sunak has been accused of &quot;gambling with people&#39;s lives&quot; after he appeared to accept a bet that the Rwanda scheme will take off before the election."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/mims-davies-campaigners-government-vicky-foxcroft-uk-parliament-b1137258.html",
        "title": "Disability Action Plan welcome but lacks focus on key issues, say campaigners",
        "description": "Minister for disabled people, health and work Mims Davies said the plan aimed to ‘improve the daily lives of disabled people’."
    },
    {
        "url": "https://www.thenational.scot/politics/24099432.david-mundell-will-pleased-greens-standing-constituency/",
        "title": "David Mundell will be pleased Greens are standing in his constituency",
        "description": "I WOULD not be surprised if Tory MP and former Scottish Secretary David Mundell was having a wee celebration and raising a glass to the"
    },
    {
        "url": "https://www.express.co.uk/news/royal/1863398/tributes-king-charles-cancer-diagnosis",
        "title": "Tributes pour in as King Charles announces cancer diagnosis",
        "description": "Celebrities from every corner of UK culture wrote their tributes on social media from journalists to former politicians as King Charles gave a significant health update."
    },
    {
        "url": "https://www.thelondoneconomic.com/politics/grotesque-sunak-criticised-over-depraved-rwanda-bet-with-piers-morgan-368178/",
        "title": "‘Grotesque’: Sunak criticised over ‘depraved’ Rwanda bet with Piers Morgan",
        "description": "Rishi Sunak accepts Peirs Morgan&#39;s £1,000 bet that he&#39;ll get asylum seekers to Rwanda before the next election The Prime Minister was immediately criticised by opposition parties, with the <b>SNP</b> reporting Mr Sunak to his own independent adviser on ministers ..."
    },
    {
        "url": "https://inews.co.uk/opinion/keir-starmer-scrap-popular-labour-policies-2890921?ico=related_article_inline",
        "title": "Why does Keir Starmer want to scrap popular Labour policies?",
        "description": "The latest reported U-turn, on the pledge to spend £28bn a year on green investment, is the biggest yet. The policy was one of Labour’s most bold and genuinely interesting pledges. It was also popular: a poll last year found that 52 per cent of voters backed it, while only 30 per cent disagreed. But with boldness comes risk, and so it had to go."
    },
    {
        "url": "https://uk.news.yahoo.com/first-minister-address-national-farmer-181437490.html",
        "title": "First Minister to address National Farmer Union Scotland&#39;s conference",
        "description": "FIRST Minister Humza Yousaf is to address delegates attending Scotland&#39;s National Farmers Union&#39;s (NFUS) annual conference."
    },
    {
        "url": "https://news.stv.tv/politics/humza-yousaf-i-feel-hurt-and-regret-at-how-relationship-with-alex-salmond-turned-sour",
        "title": "Yousaf: I feel regret at how relationship with Salmond turned sour",
        "description": "Scotland’s First Minister Humza Yousaf has said he feels “hurt and regret” at the breakdown of his relationship with the SNP’s former leader, Alex Salmond. Yousaf credited the former first minister and party leader as the reason he joined the SNP and said Salmond gave him many opportunities at the start of his career."
    },
    {
        "url": "https://www.scotsman.com/news/politics/rishi-sunak-bet-prime-minister-accused-of-breaching-ministerial-code-over-ps1000-rwanda-bet-with-piers-morgan-4506322",
        "title": "Rishi Sunak bet: Prime Minister accused of breaching ministerial code over £1,000 Rwanda bet with Piers Morgan",
        "description": "Rishi Sunak has made the Rwanda plan central to his promise to “stop the boats” and curb migrant crossings in the Channel"
    },
    {
        "url": "https://news.sky.com/story/politics-latest-rishi-sunak-general-election-keir-starmer-12593360?postid=7186843",
        "title": "Politics latest: Sunak criticised for placing £1,000 bet with Piers Morgan over flights to Rwanda",
        "description": "The prime minister has been branded &quot;depraved&quot; by the <b>SNP</b>&#39;s Westminster leader after appearing to bet he will get flights to Rwanda off the ground before the next general election. The policy was ruled unlawful by the Supreme Court in November, and since ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?ICID=ref_fark",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – as it happened",
        "description": "SNP condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’"
    },
    {
        "url": "https://www.heraldscotland.com/news/24099212.yousaf-facing-snp-backbench-rebellion-justice-reforms/",
        "title": "Yousaf facing <b>SNP</b> backbench rebellion over justice reforms",
        "description": "HUMZA Yousaf is facing a SNP backbench rebellion over landmark reforms on how sexual offences are prosecuted- in Scotland . Former Cabinet minister Fergus Ewing revealed he will vote against the legislation if a controversial proposal to run a juryless trials pilot for rape cases remains in the plans."
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/second-bid-to-ban-strip-clubs-defeated-as-council-votes-to-keep-venues-4506298",
        "title": "Edinburgh strip club ban: Second bid to ban strip clubs defeated as council votes to keep existing venues",
        "description": "A second bid to ban strip clubs in Edinburgh has been defeated after councillors voted to allow the capital’s three existing venues to continue operating."
    },
    {
        "url": "https://www.heraldscotland.com/news/24097734.snp-warned-cash-grab-surtax-alcohol-tobacco-retailers/",
        "title": "<b>SNP</b> warned over &#39;cash grab&#39; surtax on alcohol and tobacco retailers",
        "description": "Retailers have urged <b>SNP</b> ministers to shelve considerations for a “cash grab” tax on grocery stores selling alcohol or tobacco. The Scottish Government’s 2024-25 budget documents revealed plans to “explore” a new business rate surtax on retail ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/feb/05/rishi-sunak-nhs-northern-ireland-dup-stormont-uk-politics-live?filterKeyEvents=false&page=with:block-65c11ad18f080012882288d7",
        "title": "Labour says Sunak’s £1,000 bet with Piers Morgan over Rwanda policy shows he’s ‘out of touch’ – UK politics live",
        "description": "<b>SNP</b> condemns Sunak’s £1,000 Rwanda bet as ‘grotesque, callous and downright cruel’ You must be 18 or over to fill in this form. We will only use this data for the purpose of improving our live blogs. For more information please read our terms of ..."
    },
    {
        "url": "https://www.holyrood.com/news/view,former-scottish-labour-leader-kezia-dugdale-admits-to-voting-snp",
        "title": "Former Scottish Labour leader Kezia Dugdale admits to voting <b>SNP</b>",
        "description": "Kezia Dugdale voted for the <b>SNP</b> while she was still a sitting Labour MSP. The former Scottish Labour leader backed her rival party at the European Parliament election in 2019 owing to dissatisfaction with Labour’s stance on Brexit. She told a BBC ..."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/edinburgh-news/second-bid-ban-edinburgh-strip-28575235",
        "title": "Second bid to ban Edinburgh strip clubs defeated as existing venues to stay open",
        "description": "Lib Dem convener Councillor Neil Ross tabled a joint amendment with the Greens - which was passed with support from <b>SNP</b> and Conservative councillors - to set the cap at three. It also said the city centre ward boundary would be the only location suitable ..."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-king-and-pm-to-continue-weekly-audiences-as-concerned-biden-reveals-plans-to-call-12593360",
        "title": "Politics latest: King and PM to continue weekly audiences - as &#39;concerned&#39; Biden reveals plans to call",
        "description": "After hearing from the Labour and <b>SNP</b> leadership, we&#39;ve also had statements from other opposition parties about the King&#39;s health. Lib Dem leader Sir Ed Davey said his party joins &quot;the rest of the nation in wishing a full and quick recovery to His Majesty&quot;."
    },
    {
        "url": "https://www.iwradio.co.uk/news/sky-news/sunak-accused-of-making-depraved-bet-with-piers-morgan-on-rwanda-plan/",
        "title": "Sunak accused of making &#39;depraved bet&#39; with Piers Morgan on Rwanda plan",
        "description": "Rishi Sunak has been accused of taking a depraved bet with broadcaster Piers Morgan over whether deportation flights to Rwanda will take off."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/05/foreigners-likelier-than-scots-receive-university-offer/",
        "title": "Foreign students more likely than Scots to be offered place at top universities",
        "description": "It is long past time the SNP ceased throwing up obstacles in the way of ‘disheartened’ native students, say Scottish Tories"
    },
    {
        "url": "https://www.heraldscotland.com/news/24099158.kezia-dugdale-votes-snp-wider-picture/?ref=rss",
        "title": "Kezia Dugdale votes for <b>SNP</b>: What&#39;s the wider picture?",
        "description": "Former Scottish Labour leader Kezia Dugdale has shocked pretty much no-one by admitting she voted for the SNP in the European election of 2019."
    },
    {
        "url": "https://www.scotsman.com/news/politics/humza-yousaf-admits-to-suffering-from-state-of-breakdown-as-he-opens-up-about-mental-health-struggle-as-junior-minister-and-end-of-first-marriage-4506118",
        "title": "Humza Yousaf admits to suffering from &#39;state of breakdown&#39; as he opens up about mental health struggle as junior minister and end of first marriage",
        "description": "The 38-year-old was transport minister between 2016 and 2018. In December 2016, he was caught driving a friend&#39;s car without the proper insurance. At the time, he said it was an &quot;honest mistake&quot; following the break-up of his marriage to Gail Lythgoe."
    },
    {
        "url": "https://www.thescottishfarmer.co.uk/news/24099102.pressure-mounts-humza-yousaf-ahead-crunch-address-nfus/",
        "title": "Pressure mounts on Humza Yousaf ahead of crunch address to NFUS",
        "description": "“On issues ranging from gene-editing to flood prevention, the NFUS Conference will give Humza Yousaf the perfect opportunity to address the concerns of North East farmers and crofters and I urge him to consider our rural policies to safeguard the future of the industry in Scotland.”"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/i-was-almost-in-state-of-breakdown-when-my-first-marriage-broke-up-yousaf-109826/",
        "title": "I was ‘almost in state of breakdown’ when my first marriage broke up – Yousaf",
        "description": "First Minister Humza Yousaf has told how he was almost in a “state of breakdown” when his first marriage ended and sought professional help. Mr Yousaf, who was transport minister from 2016 to 2018, said a “lack of boundaries” contributed to the end of his first marriage, in the same year he took up the position."
    },
    {
        "url": "https://news.stv.tv/politics/snp-calls-for-probe-into-rishi-sunaks-depraved-1000-rwanda-bet-with-piers-morgan",
        "title": "<b>SNP</b> calls for probe into Sunak&#39;s &#39;depraved&#39; £1,000 bet with Piers Morgan",
        "description": "The SNP has called for an investigation into whether the Prime Minister broke the ministerial code when he accepted a bet by the broadcaster on air."
    },
    {
        "url": "https://www.thetimes.co.uk/article/blinkered-snp-nuclear-policy-undermines-ukraine-in-its-hour-of-need-0f05nzs9w",
        "title": "Blinkered <b>SNP</b> nuclear policy undermines Ukraine in its hour of need",
        "description": "Nationalist plan to dispense of Faslane betrays brave Ukrainians and gives succor to revanchist Putin"
    },
    {
        "url": "https://www.thetimes.co.uk/article/income-tax-increases-create-a-cross-border-divide-for-workers-38qnc7sx8",
        "title": "Income tax increases ‘create a cross-border divide for workers’",
        "description": "Income tax rises under the SNP are a “major concern” for employers struggling to fill vacancies and are creating a barrier to growth, economists have warned. The EY Scottish Item Club, an economic forecasting group,"
    },
    {
        "url": "https://www.manchestereveningnews.co.uk/news/uk-news/prime-minister-rishi-sunak-criticised-28575077",
        "title": "Prime Minister Rishi Sunak criticised over ‘depraved’ Rwanda £1,000 bet with Piers Morgan",
        "description": "Rishi Sunak has been criticised for a &quot;depraved&quot; bet with TV presenter Piers Morgan about whether flights will depart to Rwanda. The TalkTV host challenged Mr Sunak with a £1,000 bet that ministers wouldn&#39;t be able to send asylum seekers to Rwanda, and Mr Sunak seemed to accept the wager."
    },
    {
        "url": "https://www.eastlothiancourier.com/news/national/24098997.sunak-criticised-depraved-rwanda-bet-piers-morgan/",
        "title": "Sunak criticised over ‘depraved’ Rwanda bet with Piers Morgan",
        "description": "Piers Morgan offered to bet £1,000 to a refugee charity that flights would not take off to Rwanda (Dominic Lipinski/PA) The Prime Minister was immediately criticised by opposition parties, with the <b>SNP</b> reporting Mr Sunak to his own independent adviser on ..."
    }
]