[
    {
        "url": "https://www.scotsman.com/news/politics/analysis-from-fking-clowns-to-covid-policy-whatsapps-are-giving-us-a-valuable-insight-4493468",
        "title": "Analysis: From f**king clowns to Covid policy, WhatsApps are giving us a valuable insight",
        "description": "For one thing, Ms Lloyd’s WhatsApp messages – which formed part of her evidence to the UK Covid Inquiry – call into question the Scottish Government’s position that it did not routinely use the app for decision-making. This has been its repeated response in the face of criticism over ministers and officials deleting messages."
    },
    {
        "url": "https://www.johnogroat-journal.co.uk/news/dounreay-stakeholder-group-chairman-says-nuclear-expansion-i-340108/",
        "title": "Dounreay Stakeholder Group chairman says nuclear expansion is &#39;colossal opportunity&#39;",
        "description": "The biggest expansion of nuclear power in Britain for 70 years is seen as a &quot;colossal opportunity&quot; by the chairman of Dounreay Stakeholder Group."
    },
    {
        "url": "https://www.thenational.scot/politics/24075888.yes-movement-switch-civil-rights-movement/",
        "title": "Should Yes movement switch to being a civil rights movement?",
        "description": "REGARDING your story reporting that 57.5 of Scots support the Scottish Parliament having powers to legislate for independence (Majority of"
    },
    {
        "url": "https://www.mirror.co.uk/tv/tv-news/loose-women-star-slams-nicola-31969114",
        "title": "Loose Women star slams Nicola Sturgeon for &#39;not being a human being&#39;",
        "description": "BBC Radio Scotland has responded to complaints against its presenter Kaye Adams after she described former first minister Nicola Sturgeon as &#39;not a human being&#39;"
    },
    {
        "url": "https://www.ft.com/content/d17425af-6b06-4593-9f13-60a6a38e948b",
        "title": "Humza Yousaf criticises Scottish government’s ‘poor’ handling of Covid inquiry requests",
        "description": "Scotland’s first minister’s testimony raises fresh concerns over transparency around official communication during pandemic"
    },
    {
        "url": "https://www.scotsman.com/health/uk-covid-inquiry-scottish-government-accused-of-cover-up-amid-evidence-decisions-were-taken-on-whatsapp-4493394",
        "title": "UK Covid Inquiry: Scottish Government accused of &#39;cover up&#39; amid evidence decisions were taken on WhatsApp",
        "description": "Opposition politicians have accused the Scottish Government of a “deliberate cover up” after the UK Covid Inquiry heard evidence suggesting policy decisions were in fact being taken over WhatsApp during the Covid pandemic."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/drew-hendry-our-mp-faces-toughest-battle-to-hold-on-to-his-340230/",
        "title": "COLIN CAMPBELL: Our MP faces toughest battle to hold on to his seat",
        "description": "Councillor Angus MacDonald and MP Drew Hendry. Drew Hendry has entered his 10th year as MP for the Inverness constituency, and the question looms large as to whether or not he wil"
    },
    {
        "url": "https://www.birminghammail.co.uk/news/cost-of-living/new-british-gas-ovo-edf-28513783",
        "title": "New British Gas, OVO, EDF, Octopus bills rule could save customers &#39;hundreds&#39;",
        "description": "An energy bills Parliament petition demands key charges change that could save energy bill customers across the country hundreds."
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/watch-highland-msps-baffled-by-yousafs-response-to-healthc-340278/",
        "title": "WATCH: Highland MSPs baffled by Yousaf&#39;s response to healthcare investment halt",
        "description": "Labour and Tory MSPs slam First Minister for avoiding responsibility for Scottish Government decisions and again blaming Westminster."
    },
    {
        "url": "https://uk.news.yahoo.com/nicola-sturgeon-called-boris-johnson-111931231.html",
        "title": "Sturgeon called Boris a ‘f****** clown’ over ‘utter incompetence’ in handling Covid, WhatsApps reveal",
        "description": "WhatsApp messages shared between the ex- SNP leader and her top adviser, Liz Lloyd, shown at the Covid inquiry demonstrated the utter disdain with which the then-prime minister was held. Ms Sturgeon said Mr Johnson’s address announcing a second national lockdown on 31 October 2020 was “f***ing excruciating” and “awful”."
    },
    {
        "url": "https://www.heraldscotland.com/news/12629157.councillor-claims-court-case-has-left-him-ruined/",
        "title": "Councillor claims court case has left him ruined",
        "description": "Councillor Gibson had denied applying for a ballot paper by pretending Drumlithie, in November 1991. As he left the court, an angry Councillor Gibson said: &#39;&#39;I have lost my job over this. I think the whole thing has been a total waste of &#39;&#39;I have got a #72,000 mortgage, a wife, and an eight-month-old baby"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/nicola-sturgeon-boris-johnson-clown-b2484663.html",
        "title": "Nicola Sturgeon called Boris Johnson a ‘f***ing clown’, Covid WhatsApps reveal",
        "description": "Top Sturgeon adviser wanted ‘rammy’ with Tory government so she could ‘think about something other than sick people’"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13006561/Humza-Yousaf-admits-using-multiple-personal-mobile-phones-Covid-pandemic-Nicola-Sturgeon.html",
        "title": "Humza Yousaf admits using &#39;multiple&#39; personal mobile phones to carry out Scottish government business during the Covid pandemic amid furore over Nicola Sturgeon using her ...",
        "description": "First Minister Humza Yousaf became the latest <b>SNP</b> politician to admitted using private communications for official Scottish Government business today. The party leader admitted to using &#39;multiple&#39; personal mobile phones while health and justice secretary ..."
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/edinburghs-new-eye-hospital-humza-yousaf-says-no-doubt-replacement-for-eye-pavilion-is-needed-4492938",
        "title": "Edinburgh&#39;s new eye hospital: Humza Yousaf says &#39;no doubt&#39; replacement for Eye Pavilion is needed",
        "description": "First Minister Humza Yousaf has said there is &quot;no doubt&quot; that Edinburgh needs a new eye hospital to replace the current Princess Alexandra Eye Pavilion - but he failed to commit to any timetable for the project."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-needs-fully-step-31968074",
        "title": "Humza Yousaf needs to fully step out of the shadow of tainted Nicola Sturgeon",
        "description": "Humza Yousaf’s Covid Inquiry evidence showed he is gradually walking away from his role as Nicola Sturgeon’s human shield. The First Minister has from the first day of his leadership been tripped up by the baggage left by his predecessor."
    },
    {
        "url": "https://www.obantimes.co.uk/2024/01/25/fm-questioned-on-new-belford-hospital-delays/",
        "title": "FM questioned on new Belford hospital delays",
        "description": "A Highland MSP has questioned the First Minister on when the long-promised new Belford Hospital will be delivered"
    },
    {
        "url": "https://uk.news.yahoo.com/snp-yousaf-plans-probe-scottish-144439020.html",
        "title": "<b>SNP</b>’s Yousaf plans probe into Scottish government’s WhatsApp use after “f****** clown” message",
        "description": "Covid inquiry has thrown government use of Whatsapp under the spotlight as leaders desperately scramble to explain missing and inappropriate messages"
    },
    {
        "url": "https://www.express.co.uk/comment/expresscomment/1859773/esther-krakue-tory-rebels",
        "title": "Deluded rebels are not doing the party or nation any favours",
        "description": "North of the border, too, has been a car crash in slow motion. The <b>SNP</b> is in total disarray and Nicola Sturgeon’s successor, Humza Yousaf, inspires little confidence. In a nutshell, despite the polls, the Tories have everything to play for. How ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24073086.no-independence-route-relies-london-cooperating-viable/",
        "title": "No independence route that relies on London cooperating is viable",
        "description": "ON the route to independence, most discourse fumbles the pivotal issue. With London opposed to Scottish independence and committed in word and"
    },
    {
        "url": "https://www.heraldscotland.com/news/24074450.review-held-whatsapp-use-snp-accused-betrayal/",
        "title": "Review to be held over WhatsApp use as <b>SNP</b> accused of &#39;betrayal&#39;",
        "description": "Humza Yousaf has insisted the Scottish Government’s “over-arching priority” during the pandemic was public health – after evidence"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/humza-yousaf-makes-unreserved-apology-31965462",
        "title": "Humza Yousaf makes &#39;unreserved&#39; apology to covid victims over Nicola Sturgeon WhatsApp scandal",
        "description": "The First Minister, who was Health Secretary for part of the pandemic, was giving evidence to the UK Covid Inquiry."
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/pandemic-decisions-were-not-made-for-political-reasons-insists-yousaf-108961/",
        "title": "Pandemic decisions were not made for political reasons, insists Yousaf",
        "description": "The First Minister also said he has commissioned an external review into Scottish Government policy on mobile messaging."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/humza-yousaf-snp-scottish-government-government-prime-minister-b1134809.html",
        "title": "Pandemic decisions were not made for political reasons, insists Yousaf",
        "description": "The First Minister also said he has commissioned an external review into Scottish Government policy on mobile messaging."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/25/nicola-sturgeon-covid-inquiry-boris-johnson-clown-liz-lloyd/",
        "title": "Nicola Sturgeon branded Boris Johnson a ‘f---ing clown’ in deleted Whatsapps",
        "description": "Messages disclosed to the Covid Inquiry that were deleted by the former first minister were retained by Liz Lloyd, her former chief of staff"
    },
    {
        "url": "https://metro.co.uk/2024/01/25/kaye-adams-bbc-fire-scathing-comment-nicola-sturgeon-20171880/?ico=trending-post-strip_item_3",
        "title": "Kaye Adams and BBC under fire after presenter ‘crossed a line’ with scathing comment about Nicola Sturgeon",
        "description": "Kaye Adams and the BBC have been urged to apologise after the presenter said politicians like Nicola Sturgeon are ‘not human beings.’ The Loose Women host made the scathing remark on her BBC Scotland radio show on Wednesday while discussing former First Minister Sturgeon’s Covid Whatsapp messages which are under investigation."
    },
    {
        "url": "https://www.mirror.co.uk/news/politics/nicola-sturgeon-branded-boris-johnson-31964335",
        "title": "Nicola Sturgeon branded Boris Johnson &#39;f****** clown&#39; in secret Covid WhatsApp messages",
        "description": "We&#39;re not perfect but we don&#39;t get nearly enough credit for how much better than them we are.&quot; The former First Minister and ex-<b>SNP</b> leader also told her former chief of staff Liz Lloyd: &quot;His utter incompetence in every sense is now offending me on behalf ..."
    },
    {
        "url": "https://www.greenocktelegraph.co.uk/news/national/24073857.sturgeon-face-covid-inquiry-next-week/",
        "title": "Sturgeon to face Covid inquiry next week",
        "description": "The former first minister is likely to face questions on the use of private emails for Scottish Government business."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/penny-mordaunt-scottish-government-snp-government-tories-b1134789.html",
        "title": "Mordaunt jokes about Tories being ‘a bunch of rotters’ after <b>SNP</b> criticism",
        "description": "<b>SNP</b> MP Deirdre Brock also accused Ms Mordaunt of being anti-Scottish. The Commons Leader said Ms Brock was equating her criticisms of the <b>SNP</b>’s performance with criticism of Scotland itself. Ms Mordaunt added that the <b>SNP</b> had “turned maladministration ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-drink-driver-who-hit-28509770",
        "title": "Glasgow drink driver who hit parked cars while five times over limit has private hire bid rejected",
        "description": "Cllr Alex Wilson, <b>SNP</b>, who chairs the licensing committee, said: “Obviously this happened in 2014, which is a number of years ago, however it is still a serious nature, which is why Police Scotland have drawn this to our attention when looking to grant ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/13209301.miliband-steps-attack-snp-post-election-deal-ruled/",
        "title": "Miliband steps up attack on <b>SNP</b> as any post-election deal ruled out",
        "description": "ED Miliband and Ed Balls arrive in Scotland today to capitalise on Labour&#39;s growing poll momentum by intensifying their economic attack on the <b>SNP</b> and underlining a post-election deal of any kind with Nicola Sturgeon&#39;s Nationalists has now been ruled out."
    }
]