[
    {
        "url": "https://www.politics.co.uk/mp-comment/2024/01/30/drew-hendry-be-warned-labours-silence-over-the-cost-of-living-crisis-is-deafening/",
        "title": "Drew Hendry: ‘Be warned, Labour’s silence over the cost of living crisis is deafening’",
        "description": "Even during the progress of the Finance bill, the process following the Chancellor’s Autumn statement, the Labour party have refused to bring their own or support <b>SNP</b> initiatives to help people, now, during their time of need. We’ve asked for last ..."
    },
    {
        "url": "https://news.stv.tv/politics/douglas-ross-attacks-snp-over-orchestrated-and-concerted-deletion-of-covid-whatsapps",
        "title": "Ross attacks <b>SNP</b> over ‘orchestrated and concerted’ deletion of Covid WhatsApps",
        "description": "Douglas Ross, the leader of the Scottish Conservatives, said those who lost loved ones to coronavirus had been “betrayed”, as he accused the Scottish Government of taking “secrecy and cover-up to a new low”. Ross challenged the SNP over the issue following evidence to the UK Covid-19 Inquiry from some of the key figures during the pandemic."
    },
    {
        "url": "https://news.stv.tv/highlands-islands/orkney-islands-council-faces-27m-funding-gap-over-next-four-years-say-auditors",
        "title": "Orkney Islands Council &#39;faces £27m funding gap over next four years&#39;",
        "description": "Serving around 22,000 people, Orkney Islands Council was noted to have relatively high costs and staffing difficulties."
    },
    {
        "url": "https://www.heraldscotland.com/opinion/24082837.rishi-sunak-much-proud-might-yet-sneak-win/",
        "title": "Rishi Sunak has much to be proud of. He might yet sneak a win",
        "description": "WHEREVER Rishi Sunak looks, the received wisdom is that he, the Conservatives and their General Election campaign are all doomed. But in years"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24082447.john-daly-remember-created-mess-devolution-scotland/",
        "title": "John Daly: Remember who created the mess of devolution in Scotland",
        "description": "THESE days there is a bit of a spring in the step among some of our more excitable Labour colleagues at the City Chambers and it has nothing to"
    },
    {
        "url": "https://www.heraldscotland.com/news/24058259.snps-kate-forbes-says-highland-council-split/?ref=rss",
        "title": "<b>SNP</b>&#39;s Kate Forbes says Highland Council should be split up",
        "description": "Putting power closer to Highland communities in an independent Scotland could halt the ‘population emergency’, <b>SNP</b> MSP Kate Forbes has said. She described Highland Council as &quot;far too big&quot; and said devolving local authority control to areas ..."
    },
    {
        "url": "https://www.thenational.scot/politics/24083016.snps-era-safe-cautious-managerial-politics-come-end/",
        "title": "<b>SNP</b>’s era of safe, cautious managerial politics has come to an end",
        "description": "THIS is a big year for Scottish and UK politics, with a General Election likely in October or November. It looks certain that the Tories will"
    },
    {
        "url": "https://uk.news.yahoo.com/orkney-islands-council-faces-27m-080123751.html",
        "title": "Orkney Islands Council faces £27m funding gap over next four years, say auditors",
        "description": "Conservative islands spokesman Jamie Halcro Johnston said: “Orkney Islands Council is not alone in facing significant challenges, after years of systemic underfunding and neglect by an increasingly authoritarian and centralising <b>SNP</b> government."
    },
    {
        "url": "https://www.thenational.scot/news/24083427.good-morning-britain-angela-rayner-panned-response-gaza/",
        "title": "Good Morning Britain: Angela Rayner panned for response to Gaza &#39;genocide&#39; question",
        "description": "The deputy leader of the Labour Party previously abstained when given the chance to vote on the <b>SNP</b>’s Gaza ceasefire motion in November last year. Despite Labour MPs being ordered to abstain on the amendment, 56 rebelled against Keir Starmer to vote in ..."
    },
    {
        "url": "https://www.property118.com/no-difficulty-renting-for-first-minister-during-housing-crisis/",
        "title": "No difficulty renting for First Minister during housing crisis",
        "description": "Despite Scotland facing a housing emergency, First Minister Humza Yousaf spent £6,000 a month of taxpayer’s money on a rented flat in Edinburgh. The Scottish Tories slammed the eye-watering cost"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13020377/GRAHAM-GRANT-remains-Sturgeons-legacy-stake-history-not-judge-kindly.html",
        "title": "GRAHAM GRANT: What remains of Sturgeon&#39;s legacy is at stake - and history will not judge her kindly",
        "description": "As political con artists go, few are more brazen or more accomplished than Nicola Sturgeon , who was once widely deemed to have had a &#39;good pandemic&#39;."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13020457/Now-cash-strapped-NHS-hires-50-diversity-chiefs-cost-2-3million.html",
        "title": "Now cash-strapped NHS hires 50 diversity chiefs - at a cost of £2.3million",
        "description": "Scotland&#39;s crisis-hit NHS has been accused of wasting millions on an army of ‘diversity’ experts. The health service is now spending more than £2.3million annually on 50 workers in dedicated ‘equality, diversity and inclusion’ (EDI) roles, with the headcount rising by more than 40 per cent in five years."
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11878162/former-scottish-health-secretary-regret-covid-care-home-deaths/",
        "title": "Former Scottish health secretary admits regret at Covid care home deaths caused by <b>SNP</b> Government mistakes",
        "description": "EANE Freeman told yesterday of her “regret” at any Covid deaths in Scots care homes caused by SNP Government blunders during the pandemic. But tonight the former Health Secretary was slammed by"
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/29/craig-mackinlay-rishi-sunak-net-zero-green-agenda-decline/?utmsource=email",
        "title": "Rishi Sunak’s net zero targets are ‘path to ruin’, says leading Tory MP",
        "description": "Rishi Sunak is putting Britain on a “path to ruin” with his pursuit of net zero targets, the leader of an influential Tory group has warned. Craig Mackinlay accused the Prime Minister of overseeing a “shameful acceptance of decline” in the name of the green agenda."
    },
    {
        "url": "https://www.grampianonline.co.uk/news/could-cast-iron-keith-bypass-pledge-be-scrapped-due-to-mo-340621/",
        "title": "Moray bypasses at risk of ‘more A96 backtracking’? Elgin councillors worry about outcome of A96 Corridor Review",
        "description": "MORAY councillors have raised concerns that &quot;cast iron&quot; pledge Elgin and Keith bypasses could be felled by &quot;more backtracking&quot;."
    },
    {
        "url": "https://www.northern-scot.co.uk/news/elgin-and-keith-bypasses-at-risk-of-more-a96-backtracking-340615/",
        "title": "Elgin and Keith bypasses at risk of ‘more A96 backtracking’? Moray councillors worry about outcome of A96 Corridor Review",
        "description": "MORAY councillors have raised concerns that &quot;cast iron&quot; pledge Elgin and Keith bypasses could be felled by &quot;more backtracking&quot;."
    },
    {
        "url": "https://www.scotsman.com/news/politics/uk-covid-inquiry-snp-ministers-and-nicola-sturgeon-motivated-by-constitutional-politics-at-times-during-covid-suggests-michael-gove-4496821",
        "title": "UK Covid Inquiry: <b>SNP</b> ministers and Nicola Sturgeon motivated by constitutional politics at times during Covid, suggests Michael Gove",
        "description": "Nicola Sturgeon sought to diverge from the UK Government at certain points during the coronavirus pandemic in order to advance the SNP’s “political agenda”, Michael Gove has suggested to the UK Covid Inquiry."
    },
    {
        "url": "https://www.scotsman.com/news/politics/uk-covid-inquiry-scottish-government-ministers-including-nicola-sturgeon-accused-of-orchestrated-whatsapp-deletion-4497460",
        "title": "UK Covid Inquiry: Scottish Government ministers, including Nicola Sturgeon, accused of &#39;orchestrated&#39; WhatsApp deletion",
        "description": "The Tories will lead a debate on Scottish Government transparency on Wednesday in the wake of WhatsApp message revelations"
    },
    {
        "url": "https://www.thetimes.co.uk/article/ex-snp-health-secretary-reveals-regret-over-care-homes-in-pandemic-cf6t0c35k",
        "title": "Ex-<b>SNP</b> health secretary reveals regret over care homes in pandemic",
        "description": "Jeane Freeman tells Covid inquiry that Holyrood may have made mistakes but insists improvements were made ‘as time went on’"
    },
    {
        "url": "https://www.inverness-courier.co.uk/news/build-the-bypass-calls-for-nairn-bypass-as-a96-nightmare-340525/",
        "title": "BUILD THE BYPASS: Calls for Nairn bypass as survey reveals &#39;status quo is absurd&#39;",
        "description": "Picture: Callum Mackay.. He said that although the meeting was positive, it is vital that the Scottish Government delivers a clear timetable for completion of the project, which he dubbed &quot;the pensioner of <b>SNP</b> pledges&quot;. He said: &quot;I had the absolutely clear ..."
    },
    {
        "url": "https://www.standard.co.uk/business/business-news/calls-for-massive-cultural-change-at-post-office-after-chairman-s-exit-b1135599.html",
        "title": "Calls for ‘massive cultural change’ at Post Office after chairman’s exit",
        "description": "A minister has denied a “falling out” caused the exit of the Post Office’s chairman, amid calls for a “massive cultural change” in the company’s management. Business minister Kevin Hollinrake said “very serious governance issues” led to the departure of Henry Staunton, adding he did not receive a severance payment."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68127028",
        "title": "Covid Inquiry: Michael Gove denies playing politics during pandemic",
        "description": "Michael Gove has rejected suggestions the UK government was &quot;playing politics&quot; during the pandemic. He also denied attempting to promote the union in the course of his evidence to the UK Covid Inquiry."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/01/29/michael-gove-snp-plan-to-destroy-the-uk-covid-pandemic/",
        "title": "<b>SNP</b>’s aim to ‘destroy the UK’ drove its Covid response, says Gove",
        "description": "Levelling Up Secretary tells inquiry it would be naive not to see political agenda in how Nicola Sturgeon managed pandemic"
    },
    {
        "url": "https://www.eastlothiancourier.com/news/24082420.edinburgh-council-ask-snp-ministers-2bn-build-new-tram-line/",
        "title": "&#39;QMU option&#39; to East Lothian included as possible future tram route",
        "description": "A &#39;QMU option&#39; has been highlighted as a potential future tram route, as the possibility of extending Edinburgh&#39;s trams into East Lothian"
    },
    {
        "url": "https://www.christian.org.uk/news/msp-increasing-numbers-of-scots-will-die-if-holyrood-backs-assisted-suicide/",
        "title": "MSP: ‘Increasing numbers of Scots will die if Holyrood backs assisted suicide’",
        "description": "A majority of MSPs in both the Scottish Conservatives and Scottish Labour voted against the Bill, with MSPs from the Scottish Liberal Democrats and the <b>SNP</b> also rejecting the legislation. Earlier this month, Scotland’s Equalities Minister Emma Roddick ..."
    },
    {
        "url": "https://www.dumbartonreporter.co.uk/news/24082315.dumbarton-msp-jackie-baillie-slams-snp-bellsmrye/",
        "title": "Dumbarton MSP Jackie Baillie slams <b>SNP</b> over Bellsmrye",
        "description": "Jackie Baillie blasted the <b>SNP</b> administration for “moving the goalposts” over promised funding, resulting in delays to the delivery of new-build housing on the estate. The deputy Scottish Labour leader claims the <b>SNP</b> Government encouraged Caledonia ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/michael-gove-covid-inquiry-scotland-2879023?ITO=msn",
        "title": "Five things we learned from Michael Gove’s evidence to Scottish Covid inquiry",
        "description": "Michael Gove suggested the Scottish government was &#39;thinking politically&#39; in its response to the coronavirus pandemic"
    },
    {
        "url": "https://www.thetimes.co.uk/article/michael-gove-covid-inquiry-news-pandemic-politics-latest-nicola-sturgeon-7hkz9f9qc?ilc=timesradio:morefromthetimes",
        "title": "Michael Gove at Covid inquiry: Sturgeon played politics in pandemic",
        "description": "Don’t forget, the SNP mission is to destroy the United Kingdom, levelling-up secretary tells Covid inquiry in Scotland"
    },
    {
        "url": "https://www.thenational.scot/news/24082202.snp-facebook-group-thousands-members-defects-alba/",
        "title": "<b>SNP</b> Facebook group with thousands of members defects to Alba",
        "description": "THE administrators of a regional <b>SNP</b> Facebook page have issued a statement after defecting to Alba, taking the group page with them. Some users of the social media site reacted with anger after the South Ayrshire <b>SNP</b> page was changed to a South Ayrshire ..."
    },
    {
        "url": "https://news.stv.tv/politics/nicola-sturgeon-and-snp-wanted-political-conflict-during-covid-pandemic-michael-gove-claims",
        "title": "Sturgeon wanted &#39;political conflict&#39; during Covid pandemic, Gove claims",
        "description": "Michael Gove claimed messages published revealed Nicola Sturgeon had pursued different Covid policies to &#39;advance a particular political agenda&#39;."
    },
    {
        "url": "https://news.sky.com/story/politics-latest-iranian-officials-behind-threats-to-kill-on-uk-soil-sanctioned-as-sunak-and-truss-clash-over-tobacco-12593360",
        "title": "Politics latest: Iranian officials behind &#39;threats to kill on UK soil&#39; sanctioned - as Sunak and Truss clash over tobacco",
        "description": "Urgent Question on ousting of Post Office chair Over to the Commons, and <b>SNP</b> member Marion Fellows is asking an Urgent Question related to the removal of Henry Staunton as Post Office chair. He was forced out of the role on Saturday, as frustration grew in ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-government-official-said-few-31990661",
        "title": "<b>SNP</b> Government official said few of his colleagues believed covid pandemic would be &#39;serious&#39;",
        "description": "Private notes from Derek Grieve also show him comparing the Scottish Government unfavourably to the UK Government at the beginning of the pandemic"
    },
    {
        "url": "https://www.dorsetecho.co.uk/news/national/24081926.uk-government-not-use-pandemic-strengthen-union-gove-tells-inquiry/",
        "title": "UK Government did not use pandemic to strengthen union, Gove tells inquiry",
        "description": "it is the case the <b>SNP</b> has a political mission to achieve Scotland’s independence, i.e. destroy the United Kingdom and it would be naive not to be aware that highly skilled politicians, including those at the top of the Scottish Government, might well ..."
    },
    {
        "url": "https://uk.news.yahoo.com/row-snp-facebook-page-thousands-153029591.html",
        "title": "Row as <b>SNP</b> Facebook group with thousands of members defects to Alba",
        "description": "THE administrators of a regional <b>SNP</b> Facebook page have issued a statement after defecting to Alba, taking the group page with them. Some users of the social media site reacted with anger after the South Ayrshire <b>SNP</b> page was changed to a South Ayrshire ..."
    },
    {
        "url": "https://www.theguardian.com/politics/live/2024/jan/29/liz-truss-rishi-sunak-ban-cigarettes-vaping-keir-starmer-michael-gove-uk-politics-latest?topics=PERSON%3ABoris+Johnson",
        "title": "Tory former minister says he resigned from government because he could not afford mortgage hike on £120,000 salary – live",
        "description": "Here are some of the excerpts from his evidence about the tensions. Gove said the <b>SNP</b> did not want inter-governmental relations to work. Mark Drakeford, the Welsh first minister, did, he said. But he went on: “With the best will in the world the <b>SNP</b> don ..."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/jeane-freeman-regrets-any-care-31995037",
        "title": "Jeane Freeman &#39;regrets&#39; any care home death caused by Scottish Government &#39;inaction&#39; during pandemic",
        "description": "A former <b>SNP</b> health secretary has said she will &quot;regret for the rest of my life&quot; any deaths in care homes caused by Scottish Government inaction in the early weeks of the coronavirus pandemic. Jeane Freeman gave evidence at the UK Covid Inquiry today where ..."
    },
    {
        "url": "https://www.glasgowlive.co.uk/news/glasgow-news/glasgow-labour-candidate-hillhead-byelection-28532170",
        "title": "Glasgow Labour reveals candidate for Hillhead by-election",
        "description": "She added: “The choice will be clear — more division and decline with the <b>SNP</b> or a fresh start with Glasgow Labour. I will work hand in hand with residents to shape a brighter future for Hillhead.” Cllr Malik, who passed away last month at the age of ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24078472.snp-ministers-accused-scandalous-failure-2billion-state-bank/?ref=fbshr",
        "title": "<b>SNP</b> ministers accused of &#39;scandalous&#39; failure at £2billion state bank",
        "description": "<b>SNP</b> ministers have been accused of a “scandalous dereliction of duty” over the operation of Scotland’s state-owned £2billion investment bank. Under the Holyrood law which created the bank, ministers “must establish and maintain” a group to ..."
    }
]