[
    {
        "url": "https://www.dailymail.co.uk/news/article-13101795/MP-love-make-official-Facebook.html",
        "title": "MP and love make it official… on Facebook",
        "description": "The former leader of the SNP at Westminster changed his Facebook profile yesterday to confirm he is in a new relationship."
    },
    {
        "url": "https://www.walesonline.co.uk/news/world-news/foreign-secretary-calls-a-stop-28665158",
        "title": "Foreign Secretary calls for &#39;a stop to the fighting now&#39; in Gaza",
        "description": "The Foreign Secretary has tonight (Monday) called for &quot;a stop to the fighting now&quot; in Gaza. Lord David Cameron said that there must be moves towards a lasting peace rather than an all-out Israeli offensive in Rafah."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13101769/GRAHAM-GRANT-trust-SNP-loopy-Green-bedfellows-country-safe.html",
        "title": "GRAHAM GRANT: Would you trust the <b>SNP</b> and their loopy Green bedfellows to keep our country safe?",
        "description": "The North Sea oil and gas industry faces existential threats from numerous sources, not least Humza Yousaf&#39;s SNP Government and its Green partners."
    },
    {
        "url": "https://news.stv.tv/politics/alex-salmond-tony-blair-was-responsible-for-breakdown-in-scottish-and-uk-government-relations",
        "title": "Salmond: Blair was responsible for breakdown in Scottish-UK relations",
        "description": "The former first minister accuses Tony Blair of &#39;contempt&#39; for devolution and Scots law ahead of his appearance before a Westminster inquiry on Tuesday."
    },
    {
        "url": "https://www.heraldscotland.com/news/12165153.new-evidence-on-fox-hunting-impact/",
        "title": "New evidence on fox hunting impact",
        "description": "NEW evidence has been submitted by the Macaulay Institute on the economic impact of a ban on fox-hunting, but the Scottish Executive confirmed"
    },
    {
        "url": "https://www.scotsman.com/news/politics/negativity-around-scottish-and-uk-governmental-relations-committee-told-4525031",
        "title": "‘Negativity’ around Scottish and UK governmental relations, committee told",
        "description": "There has been a “negativity” surrounding the relationship between the Scottish and UK governments in recent years, the Scottish Affairs Committee (SAC) has heard. On Monday, three former secretaries of state for Scotland spoke to the SAC on intergovernmental relations between both governments during their time in office."
    },
    {
        "url": "https://www.telegraph.co.uk/world-news/2024/02/19/us-use-un-force-israel-halt-rafah-invasion-hamas-idf/",
        "title": "US moves to stop Israel’s invasion of Rafah",
        "description": "Joe Biden pushing for United Nations vote calling for a temporary ceasefire over fears for Palestinian citizens"
    },
    {
        "url": "https://www.thenational.scot/news/24129255.new-tory-msp-sworn-donald-cameron-heads-lords/?sent_id=PREVIEW&secret=PREVIEW",
        "title": "New Tory MSP to be sworn in after Donald Cameron heads to Lords",
        "description": "Eagle staged an unsuccessful comeback attempt standing in the Buckie by-election in 2022, losing to the <b>SNP</b>. Ahead of being sworn in, Eagle told The Scotsman that the <b>SNP</b>-Green “obsession with the Central Belt has been to the detriment of everyone”."
    },
    {
        "url": "https://www.standard.co.uk/news/tech/james-cleverly-suella-braverman-meta-mps-kevan-jones-b1140165.html",
        "title": "Tech giants ‘could severely disable UK spooks from stopping online harms’",
        "description": "But <b>SNP</b> MP Joanna Cherry suggested it could still “open the door even further than its parent Bill on the surveillance of trade unions”. The Edinburgh South West MP asked: “I wonder whether he will agree with me that there should be no place for the ..."
    }
]