[
    {
        "url": "https://www.thescottishsun.co.uk/sport/11968833/inside-scottish-labour-leader-anas-sarwar-leadership-jose-mourinho/",
        "title": "Inside Scottish Labour leader Anas Sarwar’s leadership style – inspired by legendary football manager",
        "description": "But Sarwar was accused by the <b>SNP</b> of being Labour’s “branch manager”, with the “real decisions” made in the Westminster “dug-outs”. The Scottish Labour leader said he “completely bought into the mindset” of the ‘Special One’."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/12/snp-accused-of-presiding-over-a-culture-of-secrecy/",
        "title": "<b>SNP</b> ministers accused of presiding over a ‘culture of secrecy’",
        "description": "Labour says administration is flouting transparency laws with fewer than a third of FOI requests answered in full within 20-day time limit"
    },
    {
        "url": "https://www.heraldscotland.com/politics/viewpoint/24114806.snp-oppose-despise-working-people-much-tories/?ref=rss",
        "title": "Why does the <b>SNP</b> oppose despise working people as much as some Tories?",
        "description": "The Scottish Government’s attempt to criminalise parents for protecting their children in its proposed conversion therapy ban reveals"
    },
    {
        "url": "https://www.christian.org.uk/news/jellyfish-legislation-top-kc-launches-searing-attack-on-scots-conversion-therapy-law/",
        "title": "‘Jellyfish legislation’: Top KC launches searing attack on Scots ‘conversion therapy’ law",
        "description": "Scottish Government plans for a new law on so-called conversion therapy have been dismissed as “jellyfish legislation” in a withering legal opinion for The Christian Institute."
    },
    {
        "url": "https://morningstaronline.co.uk/article/scottish-government-rotten-culture-of-secrecy-slammed",
        "title": "Scottish government&#39;s ‘rotten culture of secrecy’ slammed",
        "description": "SCOTTISH LABOUR hit out at a “rotten culture of secrecy” today after it was revealed that the Scottish government honours less than a third of freedom of information (FoI) requests in full and on time."
    },
    {
        "url": "https://www.thenational.scot/news/24114824.snp-demand-clarity-free-tuition-fee-stance-scottish-tories/",
        "title": "<b>SNP</b> demand clarity on free tuition fee stance from Scottish Tories",
        "description": "“With the Tories planning to impose backdoor tuition fees, and Keir Starmer’s breaking his pledge on free tuition, it’s clear that only the SNP will stand up for Scotland’s students, and make sure a university education is based on the ability to learn and not the ability to pay.”"
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24114820.battery-storage-firm-reveals-new-plans-local-backlash/",
        "title": "Battery storage firm reveals new plans after local backlash",
        "description": "Apatura have detailed new plans for the battery storage farm being proposed on land next to Cochno Road on the outskirts of Clydebank"
    },
    {
        "url": "https://theedinburghreporter.co.uk/2024/02/call-for-urgent-explanation-over-school-support-for-additional-needs-pupils/",
        "title": "Call for ‘urgent explanation’ over school support for additional needs pupils",
        "description": "Edinburgh’s councillors called for clarification of the support being offered to pupils with additional needs after a “significant number” were refused places in school learning hubs.  Some"
    },
    {
        "url": "https://www.express.co.uk/news/politics/1865887/humza-yousaf-nicola-sturgeon-snp-secrecy",
        "title": "Humza Yousaf accused of carrying on Nicola Sturgeon&#39;s &#39;addiction to cover-up and secrecy&#39;",
        "description": "Labour&#39;s Jackie Baillie accused the SNP of &quot;treating the public with contempt and attempting to stifle scrutiny&quot;."
    },
    {
        "url": "https://www.christian.org.uk/press_release/snp-trans-law-proposals-condemned-as-jellyfish-legislation-by-top-kc-in-devastating-legal-critique/",
        "title": "<b>SNP</b> trans law proposals condemned as ‘jellyfish legislation’ by top KC in devastating legal critique",
        "description": "Scottish Government plans for a new trans law which could see parents jailed for stopping their children changing gender have been condemned as “jellyfish legislation… impossible to grasp… [with] a sting in the tail” in a searing legal opinion by one of the country’s top KCs."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/12/edinburgh-castle-review-name-redcoats-cafe-snp-backlash/?n=@",
        "title": "Edinburgh Castle reviewing name of Redcoat Cafe after nationalist backlash",
        "description": "Snack bar, whose name has been in place since 1992, under fire for being named after uniform of British Army from the 17th to 19th centuries"
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/people/edinburgh-castles-redcoat-cafes-name-to-be-reviewed-after-re-opening-backlash-with-jacobite-room-also-4515140",
        "title": "Edinburgh Castle&#39;s Redcoat Cafe&#39;s name to be reviewed after re-opening backlash, with Jacobite Room included",
        "description": "The name of the cafe at Edinburgh Castle is to be reviewed by Historic Environment Scotland, after a furious backlash from Scottish independence supporters when it re-opened at the weekend."
    },
    {
        "url": "https://www.thenational.scot/politics/24112625.yes-supporting-snp-critics-must-put-misgivings-aside/",
        "title": "Yes-supporting <b>SNP</b> critics must put their misgivings aside",
        "description": "THE SNP can’t win? According to opposition parties at Holyrood, the SNP have been so obsessed with independence that they have failed in all"
    },
    {
        "url": "https://www.edinburghnews.scotsman.com/news/people/edinburgh-castles-redcoat-cafe-re-opening-upsets-scottish-independence-supporters-despite-same-name-4514198",
        "title": "Edinburgh Castle&#39;s Redcoat Cafe re-opening upsets independence supporters despite same name for 30 years",
        "description": "Redcoats was an informal name for British infantrymen who wore a distinctive garment into battles. Scottish independence supporters associate the army, clad in red, with the killing of Scots at the Battle of Culloden Moor in 1746, marking the defeat of the Jacobite movement."
    },
    {
        "url": "https://www.express.co.uk/news/uk/1865855/edinburgh-castle-cafe-backlash",
        "title": "Edinburgh Castle could be forced to change &#39;deeply offensive&#39; cafe name",
        "description": "The Redcoat Cafe gets its name from the British soldiers who wore red uniforms and fought against the Jacobites in Scotland."
    },
    {
        "url": "https://www.scotsman.com/heritage-and-retro/heritage/edinburgh-castle-redcoat-cafe-and-jacobite-room-names-to-be-reviewed-after-outcry-by-snp-politicians-4514936",
        "title": "Edinburgh Castle Redcoat Cafe and Jacobite Room names to be reviewed after outcry by <b>SNP</b> politicians",
        "description": "The relaunch of the Redcoat Cafe at Edinburgh Castle has sparked an outcry on social media, leading to a commitment to review the eatery’s name"
    },
    {
        "url": "https://news.stv.tv/scotland/snp-westminster-leader-calls-for-gaza-ceasefire-ahead-of-israeli-ground-invasion",
        "title": "<b>SNP</b> calls for Gaza ceasefire ahead of Israeli ground invasion",
        "description": "Westminster leader Stephen Flynn said invasion of Rafah would &#39;amount to waging a war in the largest refugee camp in the world&#39;."
    },
    {
        "url": "https://www.glasgowtimes.co.uk/news/24113582.clydebank-centre-leased-gymnastics-club-despite-concerns/",
        "title": "Clydebank centre to be leased to gymnastics club despite concerns",
        "description": "A popular Clydebank community centre owned by West Dunbartonshire Council is to be leased to a gymnastics club despite concerns from"
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/israel-urged-stop-think-seriously-32106391",
        "title": "Israel urged to &#39;stop and think seriously&#39; before escalating war in Gaza as ceasefire calls grow",
        "description": "The SNP and Scottish Labour have both called for an immediate ceasefire in Gaza after months of fighting and thousands of deaths."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/snp-calls-parties-support-hike-32105585",
        "title": "<b>SNP</b> calls on all parties to support hike in alcohol price and warns against &#39;political point scoring&#39;",
        "description": "Claire Haughey claimed MSPs &quot;owe it to the people of Scotland&quot; to support an increase in minimum unit pricing."
    },
    {
        "url": "https://www.heraldscotland.com/news/24113244.snp-presiding-rotten-culture-secrecy-amid-foi-responses-fury/",
        "title": "<b>SNP</b> presiding over &#39;rotten culture of secrecy&#39; amid FoI responses fury",
        "description": "SNP ministers have been accused of presiding over a “rotten culture of secrecy” after figures revealed only one third of freedom of"
    },
    {
        "url": "https://ukdefencejournal.org.uk/apprentices-in-defence-and-aerospace-celebrated-at-parliament/",
        "title": "Apprentices in defence and aerospace celebrated at Parliament",
        "description": "Jane Stevenson MP led a celebration of defence apprentices at a Parliamentary reception with MPs Nusrat Ghani, Luke Pollard, Brendan O&#39;Hara, showing strong cross-party support. #NationalApprenticeship"
    },
    {
        "url": "https://www.theguardian.com/politics/2024/feb/12/snp-one-year-on-nicola-sturgeon-resignation",
        "title": "Deleted WhatsApps and iPad uproar: <b>SNP</b> a year after Sturgeon resignation",
        "description": "While members appreciate Humza Yousaf’s more inclusive style, party is facing heavy losses at next general election"
    },
    {
        "url": "https://www.newstatesman.com/politics/politics-interview/2024/02/anas-sarwar-unpopular-labour-government",
        "title": "Wellingborough by-election: is Labour on course for another Tory turnover?",
        "description": "The Scottish Labour leader on why defeating the SNP depends on his party delivering at Westminster. I look at my phone, which rests on the table and is silently recording every word, and then I look back up at Anas Sarwar and wonder whether he’s temporarily forgotten this."
    },
    {
        "url": "https://www.scotsman.com/news/politics/israel-hamas-rishi-sunak-and-keir-starmer-showing-cowardice-says-snp-westminster-leader-as-two-hostages-rescued-4514118",
        "title": "Israel-Hamas: Rishi Sunak and Keir Starmer showing &#39;cowardice&#39;, says <b>SNP</b> Westminster leader, as two hostages rescued",
        "description": "The SNP’s Westminster leader has written to both Rishi Sunak and Sir Keir Starmer urging them to back calls for an immediate ceasefire in the Israel- Hamas war, as two hostages were rescued from captivity in the Gaza Strip."
    },
    {
        "url": "https://www.ispreview.co.uk/index.php/2024/02/calls-for-scottish-government-to-rethink-rural-broadband-vouchers.html",
        "title": "Calls for Scottish Government to Rethink Rural Broadband Vouchers",
        "description": "The Shetland MSP, Beatrice Wishart, has called on the Scottish Government (SG) to &quot;rethink&quot; the Scottish Broadband Voucher Scheme (SBVS) after it was revealed"
    },
    {
        "url": "https://www.shetlandtimes.co.uk/2024/02/11/beatrice-wishart-calls-for-rethink-over-broadband-scheme",
        "title": "Beatrice Wishart calls for rethink over broadband scheme",
        "description": "Shetland MSP Beatrice Wishart has today (Sunday) called for a rethink of the SNP’s broadband rollout. Ms Wishart said the voucher scheme has failed after a parliamentary question revealed that the government’s Scottish Broadband Voucher Scheme has only helped connect 3.6 per cent of properties in eligible hard-to-reach areas."
    },
    {
        "url": "https://www.itv.com/news/border/2024-02-12/two-thirds-support-marine-and-coastal-national-park-poll-shows",
        "title": "Two thirds support marine and coastal national park, poll shows",
        "description": "Almost two thirds of Scots want a new national park with coastal and marine areas in it, polling has revealed. Research by pollsters at Survation found that 33% strongly support this, while another 30% somewhat support the idea."
    },
    {
        "url": "https://www.scottishlegal.com/articles/westminster-seeks-update-on-splitting-lord-advocates-role",
        "title": "Westminster seeks update on splitting lord advocate’s role",
        "description": "Scottish Secretary Alister Jack has called on the Scottish government for an update on proposals to split the role of the lord advocate. Mr Jack has asked First Minister Humza Yousaf to explain what is causing the delay on consulting on the separation of the role,"
    },
    {
        "url": "https://dailybusinessgroup.co.uk/2024/02/ministers-urged-to-rethink-failed-broadband-roll-out/",
        "title": "Ministers urged to rethink ‘failed’ broadband roll-out",
        "description": "SNP ministers are being urged to “rethink” a rural broadband initiative after new data revealed that ojnly 3.6% of eligible properties in hard to reach areas have taken up a voucher scheme."
    },
    {
        "url": "https://inews.co.uk/news/i-morning-briefing-three-big-challenges-facing-the-government-this-week-2901479?ico=above_article_ticker",
        "title": "i morning briefing: Three big challenges facing the government this week",
        "description": "A major international energy security summit due to be hosted by the UK – designed to protect consumers from spikes in bills – has been delayed by a year, i can reveal. The first-ever London Energy Security Conference was announced by then energy secretary Grant Shapps last summer, with the date set for spring this year."
    },
    {
        "url": "https://www.holyrood.com/inside-politics/view,pat-mcfadden-its-a-myth-that-british-politics-is-a-pendulum-labour-victories-are-rarities",
        "title": "Pat McFadden: It&#39;s a myth that British politics is a pendulum - Labour victories are rarities",
        "description": "I don’t want Scottish voters to send a message, I want them to send a government&#39;. The Labour MP and party strategist"
    },
    {
        "url": "https://www.holyrood.com/news/view,pat-mcfaddens-comments-will-haunt-labours-general-election-campaign-says-snp-mp",
        "title": "Pat McFadden’s comments will ‘haunt’ Labour’s general election campaign, says <b>SNP</b> MP",
        "description": "The <b>SNP</b> have said comments by Labour strategist Pat McFadden that his party’s electoral victories are “rarities” will come to “haunt” the party in the run-up to the general election. Labour’s national campaign coordinator told Holyrood that the ..."
    },
    {
        "url": "https://news.yahoo.com/snp-ministers-accused-presiding-over-183006511.html",
        "title": "<b>SNP</b> ministers accused of presiding over a ‘culture of secrecy’",
        "description": "SNP ministers have been accused of presiding over a “culture of secrecy” after new evidence emerged that they were flouting transparency laws."
    },
    {
        "url": "http://risingkashmir.com/dc-ganderbal-reviews-utilization-of-funds-under-snp-icds-services",
        "title": "DC Ganderbal reviews utilization of funds under <b>SNP</b>, ICDS services",
        "description": "To review the implementation of the ICDS sector services and utilization of allocated funds under Supplementary Nutrition Programme (SNP), the Deputy Commissioner (DC) Ganderbal, Shyambir today convened a meeting of ICDS department at V.C Room of DC office, here."
    },
    {
        "url": "https://www.telegraph.co.uk/news/2024/02/12/scottish-parents-at-jail-if-they-refuse-to-provocatively/",
        "title": "Scottish parents at risk of jail if they refuse to allow children to dress provocatively",
        "description": "Loving parents who refuse to allow their teenage children to dress in a sexually provocative manner could face jail under the SNP ’s conversion therapy ban, a KC has warned."
    },
    {
        "url": "https://www.ft.com/video/37793bc4-f7bd-46c9-953c-3b8317566193",
        "title": "Sketchy Politics: the rules of the electoral race",
        "description": "The FT&#39;s UK chief political commentator Robert Shrimsley and deputy opinion editor Miranda Green discuss how outlying runners in the electoral race could affect the election result, and how the rules"
    },
    {
        "url": "https://morningstaronline.co.uk/article/snp-calls-sunak-and-starmer-change-course-and-back-immediate-ceasefire",
        "title": "<b>SNP</b> calls on Sunak and Starmer to ‘change course’ and back an immediate ceasefire",
        "description": "THE SNP has today written to Rishi Sunak and Sir Keir Starmer urging them to “change course” and back an immediate ceasefire in Gaza amid mounting concern over plans for a major military assault on Rafah."
    },
    {
        "url": "https://www.thetimes.co.uk/article/best-time-snp-ditch-humza-yousaf-comment-2k23nzs3v",
        "title": "When is the best time for the <b>SNP</b> to ditch Humza Yousaf?",
        "description": "A s the crisis of Humza Yousaf’s leadership continues and criticism mounts, the right question for the SNP to ask is when should a new leader be chosen — rather than who shoul"
    },
    {
        "url": "https://www.thetimes.co.uk/article/snps-cuts-university-places-skills-shortage-technology-worse-vhc0djt9q",
        "title": "<b>SNP</b>’s cut to university places ‘will worsen skills shortage’",
        "description": "Humza Yousaf’s cut to the number of university places for Scottish students will make skills shortages worse and cause long-term economic damage, ministers have been warned. The"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071787/Stephen-Daisleys-latest-unmissable-column-really-ask-politician-substance-competence-sense-duty.html",
        "title": "Stephen Daisley&#39;s latest unmissable column: Is it really too much to ask for a politician to have substance, competence and a sense of duty?",
        "description": "One piece of advice about politics would be this: listen to people you disagree with. One voice worth cupping your ear towards is Geoff Aberdein, former chief of staff to Alex Salmond."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13071783/Matheson-suspended-without-pay-Holyrood.html",
        "title": "Matheson could be suspended without pay from Holyrood",
        "description": "Michael Matheson could be suspended as an MSP over his expenses scandal. He faces a potentially damning report into how he charged taxpayers for data whilst on holiday."
    }
]