[
    {
        "url": "https://www.falkirkherald.co.uk/news/politics/council/falkirk-council-agree-to-close-boness-recreation-centre-within-three-months-4500527",
        "title": "Falkirk Council agree to close Bo&#39;ness Recreation Centre within three months",
        "description": "Bo’ness Recreation Centre will close within three months despite a determined campaign by residents hoping to save it."
    },
    {
        "url": "https://www.dailyrecord.co.uk/news/politics/house-sturgeon-turned-mound-dust-32015848",
        "title": "The House of Sturgeon has turned into a mound of dust",
        "description": "Record Political Editor Paul Hutcheon says her confident handling of covid was part of her legacy, but this has now gone."
    },
    {
        "url": "https://www.channel4.com/news/sturgeon-wasnt-wrong-to-delete-whatsapp-messages-as-all-appropriate-info-handed-over-says-snps-ian-blackford",
        "title": "Sturgeon wasn’t wrong to delete WhatsApp messages as all ‘appropriate info handed over’, says <b>SNP</b>’s Ian Blackford",
        "description": "We spoke to the former leader of the Scottish National Party in Westminster, Ian Blackford. We asked him whether Nicola Sturgeon was wrong to say that all government messages would be available to the inquiry."
    },
    {
        "url": "https://news.stv.tv/west-central/glasgow-private-hire-driver-who-indecently-assaulted-and-threatened-woman-loses-licence",
        "title": "Driver who indecently assaulted and threatened woman loses licence",
        "description": "A Glasgow private hire car driver who indecently assaulted a woman and threatened to abduct her while working has lost his licence. Mazin Mohamed seized the passenger by the breast during the terrifying ordeal in a city street in April 2022."
    },
    {
        "url": "https://www.thesun.co.uk/news/25637512/valdo-calocane-nottingham-families-unleashed-sun-says/",
        "title": "What assurances can the Govt give the Nottingham families that Valdo Calocane will never be unleashed on the public?",
        "description": "Broken justice THE worst fears of the families torn apart by Valdo Calocane now look very real. As they knew, and as The Sun warned last week, the triple killer’s indefinite detention at a"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/rachel-reeves-bankers-bonus-labour-starmer-b2487874.html?lid=f3e3db6717zu",
        "title": "Rachel Reeves sparks Labour backlash as she declares Starmer won’t cut bankers’ bonuses",
        "description": "I saw what happened when a culture of greed endangered the lives of working people,” he added. Westminster leader of the <b>SNP</b>, Stephen Flynn, also criticised Labour’s policy. During PMQs, he said Rishi Sunak could be “comforted by the fact that he’s ..."
    },
    {
        "url": "https://inews.co.uk/news/politics/nicola-sturgeon-reputation-snp-votes-covid-betrayal-2883150?ITO=msn",
        "title": "Sturgeon loses reputation and <b>SNP</b> votes",
        "description": "The <b>SNP</b>’s electoral chances are likely to have been dented further by the continuing controversy engulfing Nicola Sturgeon, polling experts have said. While the party’s popularity had already begun to fall before Ms Sturgeon resigned as leader a year ..."
    },
    {
        "url": "https://www.heraldscotland.com/news/24088862.snp-accuses-uk-total-lack-focus-oil-gas-licences/",
        "title": "<b>SNP</b> accuses UK of &#39;total lack of focus&#39; after oil and gas licences",
        "description": "A senior SNP minister has accused the UK Government of “a total lack of focus on delivering a just transition” for energy workers after 24"
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13029355/SNP-Covid-Nicola-Sturgeons-travel-ban-Spain-pandemic-inquiry-EU.html",
        "title": "The smoking gun email that &#39;PROVES Nicola Sturgeon was using Covid to break up the UK&#39;: Inquiry is shown message between <b>SNP</b> deputy and ex-First Minister opposing travel ban on ...",
        "description": "The message from John Swinney in July 2020 was highlighted as Ms Sturgeon gave evidence at the official inquiry this afternoon."
    },
    {
        "url": "https://www.thenational.scot/politics/24088839.unionist-media-didnt-get-nicola-sturgeon-gotcha-moment/",
        "title": "Unionist media didn&#39;t get a Nicola Sturgeon &#39;gotcha&#39; moment",
        "description": "Former First Minister Nicola Sturgeon gave her much anticipated evidence to the UK Covid Inquiry which the Scottish media closely watched in"
    },
    {
        "url": "https://www.heraldscotland.com/news/24088862.snp-accuse-uk-total-lack-focus-oil-gas-licences/",
        "title": "<b>SNP</b> accuse UK of &#39;total lack of focus&#39; after oil and gas licences",
        "description": "A senior SNP minister has accused the UK Government of “a total lack of focus on delivering a just transition” for energy workers after 24"
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68156720.amp",
        "title": "Nicola Sturgeon denies Covid decisions were political",
        "description": "Nicola Sturgeon has denied that some of her decisions during the Covid pandemic were motivated by furthering the cause of Scottish independence. The former first minister also rejected claims she presided over a culture of secrecy despite admitting she deleted all her WhatsApps during the pandemic."
    },
    {
        "url": "https://www.bbc.com/news/uk-scotland-68161268",
        "title": "Former FM Nicola Sturgeon returns to centre stage at Covid Inquiry",
        "description": "The marathon evidence session was a reminder of her key role during one of the bleakest periods in living memory."
    },
    {
        "url": "https://www.thenational.scot/politics/24088806.clear-indy-backburner-pandemic-period/",
        "title": "It is clear indy was on the backburner during the pandemic period",
        "description": "IT is quite evident that the Scottish Parliament and Scottish Government operate under very different parameters, rules and regulations to those"
    },
    {
        "url": "https://www.independent.co.uk/news/uk/politics/politics-explained/nicola-sturgeon-covid-inquiry-snp-b2488181.html",
        "title": "Can the <b>SNP</b> ever recover from the fall of Nicola Sturgeon?",
        "description": "Nicola Sturgeon became vital to the SNP and has dominated Scottish politics for more than a decade, writes Sean O’Grady"
    },
    {
        "url": "https://www.cityam.com/nicola-sturgeon-accused-of-crocodile-tears-at-covid-19-inquiry/",
        "title": "Nicola Sturgeon accused of ‘crocodile tears’ at Covid-19 inquiry",
        "description": "But critics, including the Covid bereaved families, hit out at the former Scottish National Party (<b>SNP</b>) leader, who resigned in a shock move last year ahead of further police investigation into party finances, accusing her of faking her emotions."
    },
    {
        "url": "https://www.scotsman.com/news/politics/nicola-sturgeon-denies-secrecy-and-political-motives-during-emotional-evidence-to-uk-covid-inquiry-4500406",
        "title": "Nicola Sturgeon denies secrecy and political motives during emotional evidence to UK Covid Inquiry",
        "description": "Nicola Sturgeon denied adopting a secretive approach during the pandemic and insisted she did not seek to use the crisis to her political advantage as she occasionally fought back tears while giving evidence to the UK Covid Inquiry."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-key-points-summary-evidence-uk-covid-inquiry-b1136181.html",
        "title": "The key points from Nicola Sturgeon’s day of evidence at the UK Covid Inquiry",
        "description": "The former first minister faced questions about the use of WhatsApp as well as her chief regret during the pandemic"
    },
    {
        "url": "https://www.thenorthernecho.co.uk/news/national/24088667.mp-defends-pontius-pilate-jibe-aimed-rishi-sunak-pmqs-gaza-response/",
        "title": "MP defends ‘Pontius Pilate’ jibe aimed at Rishi Sunak over PMQs Gaza response",
        "description": "Pontius Pilate was the Roman governor who presided over the trial of Jesus and ordered his crucifixion. Mr MacNeil, who previously sat as an <b>SNP</b> MP, told the PA news agency: “It was myself who said it, the PM was washing his hands from answering the ..."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68155976.amp",
        "title": "Keir Starmer clashes with Rishi Sunak over Iceland worker&#39;s mortgage",
        "description": "said the Labour leader. Labour &#39;shameful&#39; for not backing end of bank bonus cap - <b>SNP</b>&#39;s Stephen Flynn In a swipe at Mr Sunak&#39;s personal wealth, he said a mortgage rise &quot;might not sound much&quot; to the prime minister, but that &quot;most people don&#39;t have that sort ..."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/rishi-sunak-prime-minister-commons-conservative-snp-b1136182.html",
        "title": "MP defends ‘Pontius Pilate’ jibe aimed at Rishi Sunak over PMQs Gaza response",
        "description": "Conservative MP Richard Drax had complained in the Commons about the ‘extremely unpleasant’ heckle heard during Prime Minister’s Questions."
    },
    {
        "url": "https://www.standard.co.uk/news/politics/nicola-sturgeon-scottish-government-uk-government-michael-gove-snp-b1136181.html",
        "title": "The key points from Nicola Sturgeon’s day of evidence at the UK Covid Inquiry",
        "description": "The former first minister faced questions about the use of WhatsApp as well as her chief regret during the pandemic."
    },
    {
        "url": "https://news.sky.com/story/covid-inquiry-nicola-sturgeon-admits-large-part-of-her-wishes-she-wasnt-first-minister-when-pandemic-hit-13060609",
        "title": "COVID inquiry: Nicola Sturgeon admits &#39;large part&#39; of her wishes she wasn&#39;t first minister when pandemic hit",
        "description": "The UK COVID-19 Inquiry is currently sitting in Edinburgh as it probes the devolved administration&#39;s response to the pandemic."
    },
    {
        "url": "https://www.scotsman.com/news/opinion/columnists/uk-covid-inquiry-nicola-sturgeon-misses-chance-to-allay-public-concerns-over-why-she-deleted-her-whatsapp-messages-euan-mccolm-4500311",
        "title": "UK Covid Inquiry: Nicola Sturgeon misses chance to allay public concerns over why she deleted her WhatsApp messages – Euan McColm",
        "description": "Former First Minister Nicola Sturgeon made a failed attempt to advance a semantic argument that her WhatsApp messages were ‘not retained’ rather than ‘deleted’"
    },
    {
        "url": "https://www.thescottishsun.co.uk/news/11890837/nicola-sturgeon-booed-leaving-covid-inquiry/",
        "title": "Nicola Sturgeon booed and called ‘scum’ as she leaves covid inquiry after tearful apology to bereaved families",
        "description": "NICOLA Sturgeon was booed as she left the UK Covid Inquiry. The former First Minister was quizzed on her Government’s handling of the pandemic in Scotland. The ex-SNP boss became emotional"
    },
    {
        "url": "https://www.kentonline.co.uk/news/national/sleekit-sturgeon-deleted-messages-on-an-industrial-scale-says-ross-109436/",
        "title": "‘Sleekit’ Sturgeon deleted messages on an industrial scale, says Ross",
        "description": "Scottish Conservative leader Douglas Ross used a debate at Holyrood to attack the former Scottish first minister, branding her a ‘liar’ and a ‘fraud’."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-scotland-68159892?at_link_id=6A109676-C05E-11EE-BC58-1704AAF30DC0&at_format=link&at_medium=social&at_campaign_type=owned&at_ptr_name=facebook_page&at_campaign=Social_Flow&at_link_type=web_link&at_link_origin=BBC_News&at_bbc_team=editorial",
        "title": "American XL bully ban dates confirmed for Scotland",
        "description": "XL bully dogs will be subject to new controls in Scotland New restrictions on XL bully dogs are being introduced in Scotland from 23 February. It will be legal to own one of the dogs but they must be muzzled and on a lead in public from that date."
    },
    {
        "url": "https://www.dailymail.co.uk/news/article-13029225/Knuckleduster-Nicola-Sturgeon-blubbing-shes-finished.html",
        "title": "QUENTIN LETTS: The real reason knuckle-duster Nicola Sturgeon sprang a leak and started blubbing... because she knows she&#39;s finished",
        "description": "We had a Stan Laurel moment at the Covid inquiry when Nicola Sturgeon started blubbing. She didn&#39;t quite remove her bowler hat and start scratching her head but it was a close-run thing."
    },
    {
        "url": "https://www.bbc.co.uk/news/uk-politics-68155976",
        "title": "Keir Starmer clashes with Rishi Sunak over Iceland worker&#39;s mortgage",
        "description": "Keir Starmer raises one man&#39;s case, as Rishi Sunak says he is helping people whose fixed-rate mortgage deals are ending."
    },
    {
        "url": "https://www.edinburghlive.co.uk/news/wedding-venue-owned-west-lothian-28545253",
        "title": "Wedding venue owned by West Lothian Council loses £77,000 in last year",
        "description": "A West Lothian wedding venue run by the council is set to make a loss of £77,000 this year. A council officer could provide no answers when a local member raised the deficit and questions on plans to recoup losses at Linlithgow’s Burgh Halls."
    },
    {
        "url": "https://www.telegraph.co.uk/politics/2024/01/31/nicola-sturgeon-uk-covid-inquiry-snp-whatsapp-messages/",
        "title": "Covid Inquiry: Sturgeon denies &#39;burning desire&#39; for independence influenced decisions",
        "description": "Nicola Sturgeon has denied that her “burning desire” to achieve Scottish independence played any role in her pandemic decision making. Jamie Dawson KC, counsel for the inquiry"
    },
    {
        "url": "https://www.express.co.uk/news/uk/1861630/covid-sceintists-organ-damage-virus",
        "title": "Covid scientists warn of &#39;silent organ damage&#39; as they warn &#39;virus is till evolving&#39;",
        "description": "It needs more research but it&#39;s very concerning.&quot; DON&#39;T MISS: Who is the daughter of Covid hero Captain Tom, Hannah Ingram-Moore [CAPTAIN TOM] <b>SNP</b>&#39;s &#39;true, rotten colours&#39; exposed by two key findings at Covid inquiry [COVID INQUIRY] King Charles and Prince ..."
    },
    {
        "url": "https://tfn.scot/news/holyrood-committee-urges-scottish-government-to-deliver-on-multi-year-funding-commitments",
        "title": "Holyrood committee urges Scottish Government to deliver on multi-year funding commitments",
        "description": "The Scottish Government published its 2024/25 draft budget in December, outlining the <b>SNP</b>-Green administration’s spending plans for next year. The plans included little mention of the sector, with just fleeting mentions of “Fairer Funding” for the ..."
    }
]